#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_002

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass A_002.A_002_C
// 0x0010 (0x09E0 - 0x09D0)
class AA_002_C final : public ABullet
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          NewVar_0;                                          // 0x09D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NewVar_1;                                          // 0x09D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void GetRot(const struct FVector& Location, int32 Min, int32 Max, struct FTransform* Rot);
	void ReceiveBulletFire();
	void ExecuteUbergraph_A_002(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"A_002_C">();
	}
	static class AA_002_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AA_002_C>();
	}
};
static_assert(alignof(AA_002_C) == 0x000010, "Wrong alignment on AA_002_C");
static_assert(sizeof(AA_002_C) == 0x0009E0, "Wrong size on AA_002_C");
static_assert(offsetof(AA_002_C, UberGraphFrame) == 0x0009D0, "Member 'AA_002_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AA_002_C, NewVar_0) == 0x0009D8, "Member 'AA_002_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(AA_002_C, NewVar_1) == 0x0009D9, "Member 'AA_002_C::NewVar_1' has a wrong offset!");

}

