#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_002

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function A_002.A_002_C.GetRot
// 0x00C0 (0x00C0 - 0x0000)
struct A_002_C_GetRot final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Min;                                               // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max;                                               // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Rot;                                               // 0x0020(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FQuat                                  CallFunc_SequenceRotationYZX_ReturnValue;          // 0x0070(0x0010)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Quat_Rotator_ReturnValue;                 // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(A_002_C_GetRot) == 0x000010, "Wrong alignment on A_002_C_GetRot");
static_assert(sizeof(A_002_C_GetRot) == 0x0000C0, "Wrong size on A_002_C_GetRot");
static_assert(offsetof(A_002_C_GetRot, Location) == 0x000000, "Member 'A_002_C_GetRot::Location' has a wrong offset!");
static_assert(offsetof(A_002_C_GetRot, Min) == 0x00000C, "Member 'A_002_C_GetRot::Min' has a wrong offset!");
static_assert(offsetof(A_002_C_GetRot, Max) == 0x000010, "Member 'A_002_C_GetRot::Max' has a wrong offset!");
static_assert(offsetof(A_002_C_GetRot, Rot) == 0x000020, "Member 'A_002_C_GetRot::Rot' has a wrong offset!");
static_assert(offsetof(A_002_C_GetRot, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000050, "Member 'A_002_C_GetRot::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_002_C_GetRot, CallFunc_RandomIntegerInRange_ReturnValue) == 0x00005C, "Member 'A_002_C_GetRot::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_002_C_GetRot, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000060, "Member 'A_002_C_GetRot::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_002_C_GetRot, CallFunc_MakeRotator_ReturnValue) == 0x000064, "Member 'A_002_C_GetRot::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_002_C_GetRot, CallFunc_SequenceRotationYZX_ReturnValue) == 0x000070, "Member 'A_002_C_GetRot::CallFunc_SequenceRotationYZX_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_002_C_GetRot, CallFunc_Quat_Rotator_ReturnValue) == 0x000080, "Member 'A_002_C_GetRot::CallFunc_Quat_Rotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_002_C_GetRot, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'A_002_C_GetRot::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

// Function A_002.A_002_C.ExecuteUbergraph_A_002
// 0x0004 (0x0004 - 0x0000)
struct A_002_C_ExecuteUbergraph_A_002 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_002_C_ExecuteUbergraph_A_002) == 0x000004, "Wrong alignment on A_002_C_ExecuteUbergraph_A_002");
static_assert(sizeof(A_002_C_ExecuteUbergraph_A_002) == 0x000004, "Wrong size on A_002_C_ExecuteUbergraph_A_002");
static_assert(offsetof(A_002_C_ExecuteUbergraph_A_002, EntryPoint) == 0x000000, "Member 'A_002_C_ExecuteUbergraph_A_002::EntryPoint' has a wrong offset!");

}

