#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AbnormalAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SeasunAnimGraph_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AbnormalAnimBP.AbnormalAnimBP_C
// 0x0300 (0x0850 - 0x0550)
class UAbnormalAnimBP_C : public UAbnormalAnimBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0550(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0558(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0588(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0608(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0638(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x06E8(0x0048)()
	struct FAnimNode_CurveSequenceSlot            AnimGraphNode_CurveSequenceSlot;                   // 0x0730(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0768(0x0048)()
	bool                                          bInStun;                                           // 0x07B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bInLie;                                            // 0x07B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          InStandUp;                                         // 0x07B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bInFloatingRising;                                 // 0x07B3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bInFloatingFloating;                               // 0x07B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bInFloatingDown;                                   // 0x07B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B6[0x2];                                      // 0x07B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      FloatingAnim;                                      // 0x07B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInRepel;                                          // 0x07C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bInRepelEnd;                                       // 0x07C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C2[0x6];                                      // 0x07C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      RepelAnim;                                         // 0x07C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      RepelEndAnim;                                      // 0x07D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AbnormalAnimType;                                  // 0x07D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         AbnormalStateID;                                   // 0x07DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7DD[0x3];                                      // 0x07DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      FloatingFarAnim;                                   // 0x07E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      FloatingFarUpAnim;                                 // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      FloatingHitinAir;                                  // 0x07F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      RepelStandAnim1;                                   // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      RepelStandAnim2;                                   // 0x0800(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInPlayRepel;                                      // 0x0808(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bResetRepel;                                       // 0x0809(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_80A[0x2];                                      // 0x080A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RandomRepel;                                       // 0x080C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      RepelStandAnim3;                                   // 0x0810(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      RepelStandAnim;                                    // 0x0818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimSequenceBase*>              ValidRepleArray;                                   // 0x0820(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimSequenceBase*>              NextRandomArray;                                   // 0x0830(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimSequenceBase*                      RepelStandAnim4;                                   // 0x0840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      RepelStandAnim_HitHead;                            // 0x0848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_AbnormalAnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AbnormalAnimBP_C">();
	}
	static class UAbnormalAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbnormalAnimBP_C>();
	}
};
static_assert(alignof(UAbnormalAnimBP_C) == 0x000010, "Wrong alignment on UAbnormalAnimBP_C");
static_assert(sizeof(UAbnormalAnimBP_C) == 0x000850, "Wrong size on UAbnormalAnimBP_C");
static_assert(offsetof(UAbnormalAnimBP_C, UberGraphFrame) == 0x000550, "Member 'UAbnormalAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, AnimGraphNode_Root) == 0x000558, "Member 'UAbnormalAnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, AnimGraphNode_SequencePlayer) == 0x000588, "Member 'UAbnormalAnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, AnimGraphNode_StateResult) == 0x000608, "Member 'UAbnormalAnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, AnimGraphNode_StateMachine) == 0x000638, "Member 'UAbnormalAnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, AnimGraphNode_Slot_1) == 0x0006E8, "Member 'UAbnormalAnimBP_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, AnimGraphNode_CurveSequenceSlot) == 0x000730, "Member 'UAbnormalAnimBP_C::AnimGraphNode_CurveSequenceSlot' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, AnimGraphNode_Slot) == 0x000768, "Member 'UAbnormalAnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, bInStun) == 0x0007B0, "Member 'UAbnormalAnimBP_C::bInStun' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, bInLie) == 0x0007B1, "Member 'UAbnormalAnimBP_C::bInLie' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, InStandUp) == 0x0007B2, "Member 'UAbnormalAnimBP_C::InStandUp' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, bInFloatingRising) == 0x0007B3, "Member 'UAbnormalAnimBP_C::bInFloatingRising' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, bInFloatingFloating) == 0x0007B4, "Member 'UAbnormalAnimBP_C::bInFloatingFloating' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, bInFloatingDown) == 0x0007B5, "Member 'UAbnormalAnimBP_C::bInFloatingDown' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, FloatingAnim) == 0x0007B8, "Member 'UAbnormalAnimBP_C::FloatingAnim' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, bInRepel) == 0x0007C0, "Member 'UAbnormalAnimBP_C::bInRepel' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, bInRepelEnd) == 0x0007C1, "Member 'UAbnormalAnimBP_C::bInRepelEnd' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, RepelAnim) == 0x0007C8, "Member 'UAbnormalAnimBP_C::RepelAnim' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, RepelEndAnim) == 0x0007D0, "Member 'UAbnormalAnimBP_C::RepelEndAnim' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, AbnormalAnimType) == 0x0007D8, "Member 'UAbnormalAnimBP_C::AbnormalAnimType' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, AbnormalStateID) == 0x0007DC, "Member 'UAbnormalAnimBP_C::AbnormalStateID' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, FloatingFarAnim) == 0x0007E0, "Member 'UAbnormalAnimBP_C::FloatingFarAnim' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, FloatingFarUpAnim) == 0x0007E8, "Member 'UAbnormalAnimBP_C::FloatingFarUpAnim' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, FloatingHitinAir) == 0x0007F0, "Member 'UAbnormalAnimBP_C::FloatingHitinAir' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, RepelStandAnim1) == 0x0007F8, "Member 'UAbnormalAnimBP_C::RepelStandAnim1' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, RepelStandAnim2) == 0x000800, "Member 'UAbnormalAnimBP_C::RepelStandAnim2' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, bInPlayRepel) == 0x000808, "Member 'UAbnormalAnimBP_C::bInPlayRepel' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, bResetRepel) == 0x000809, "Member 'UAbnormalAnimBP_C::bResetRepel' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, RandomRepel) == 0x00080C, "Member 'UAbnormalAnimBP_C::RandomRepel' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, RepelStandAnim3) == 0x000810, "Member 'UAbnormalAnimBP_C::RepelStandAnim3' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, RepelStandAnim) == 0x000818, "Member 'UAbnormalAnimBP_C::RepelStandAnim' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, ValidRepleArray) == 0x000820, "Member 'UAbnormalAnimBP_C::ValidRepleArray' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, NextRandomArray) == 0x000830, "Member 'UAbnormalAnimBP_C::NextRandomArray' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, RepelStandAnim4) == 0x000840, "Member 'UAbnormalAnimBP_C::RepelStandAnim4' has a wrong offset!");
static_assert(offsetof(UAbnormalAnimBP_C, RepelStandAnim_HitHead) == 0x000848, "Member 'UAbnormalAnimBP_C::RepelStandAnim_HitHead' has a wrong offset!");

}

