#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Girl004b_04_Aftetimage

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Girl004b_04_Aftetimage.ABP_Girl004b_04_Aftetimage_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Girl004b_04_Aftetimage_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_Girl004b_04_Aftetimage_C_AnimGraph;

// Function ABP_Girl004b_04_Aftetimage.ABP_Girl004b_04_Aftetimage_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Girl004b_04_Aftetimage_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_Girl004b_04_Aftetimage_C_BlueprintUpdateAnimation;

// Function ABP_Girl004b_04_Aftetimage.ABP_Girl004b_04_Aftetimage_C.ExecuteUbergraph_ABP_Girl004b_04_Aftetimage
// 0x0020 (0x0020 - 0x0000)
struct ABP_Girl004b_04_Aftetimage_C_ExecuteUbergraph_ABP_Girl004b_04_Aftetimage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerAfterimage*                      K2Node_DynamicCast_AsPlayer_Afterimage;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_Girl004b_04_Aftetimage_C_ExecuteUbergraph_ABP_Girl004b_04_Aftetimage;

}

