#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Girl006a_Phy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "ControlRig_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Girl006a_Phy.ABP_Girl006a_Phy_C
// 0x13040 (0x13300 - 0x02C0)
class UABP_Girl006a_Phy_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_83;                    // 0x02D0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_82;                    // 0x0660(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_81;                    // 0x09F0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_80;                    // 0x0D80(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_79;                    // 0x1110(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_78;                    // 0x14A0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_77;                    // 0x1830(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_76;                    // 0x1BC0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_75;                    // 0x1F50(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_74;                    // 0x22E0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_73;                    // 0x2670(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_72;                    // 0x2A00(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_71;                    // 0x2D90(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_70;                    // 0x3120(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_69;                    // 0x34B0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_68;                    // 0x3840(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_67;                    // 0x3BD0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_66;                    // 0x3F60(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_65;                    // 0x42F0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_64;                    // 0x4680(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_63;                    // 0x4A10(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_62;                    // 0x4DA0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_61;                    // 0x5130(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_60;                    // 0x54C0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_59;                    // 0x5850(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_58;                    // 0x5BE0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_57;                    // 0x5F70(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_56;                    // 0x6300(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_55;                    // 0x6690(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_54;                    // 0x6A20(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_53;                    // 0x6DB0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_52;                    // 0x7140(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_51;                    // 0x74D0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_50;                    // 0x7860(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_49;                    // 0x7BF0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_48;                    // 0x7F80(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_47;                    // 0x8310(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_46;                    // 0x86A0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_45;                    // 0x8A30(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_44;                    // 0x8DC0(0x0390)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x9150(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x9170(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_43;                    // 0x9190(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_42;                    // 0x9520(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_41;                    // 0x98B0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_40;                    // 0x9C40(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_39;                    // 0x9FD0(0x0390)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0xA360(0x0368)()
	uint8                                         Pad_A6C8[0x8];                                     // 0xA6C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_38;                    // 0xA6D0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_37;                    // 0xAA60(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_36;                    // 0xADF0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_35;                    // 0xB180(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_34;                    // 0xB510(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_33;                    // 0xB8A0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_32;                    // 0xBC30(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_31;                    // 0xBFC0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_30;                    // 0xC350(0x0390)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0xC6E0(0x0070)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_29;                    // 0xC750(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_28;                    // 0xCAE0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_27;                    // 0xCE70(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_26;                    // 0xD200(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_25;                    // 0xD590(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_24;                    // 0xD920(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_23;                    // 0xDCB0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_22;                    // 0xE040(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_21;                    // 0xE3D0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_20;                    // 0xE760(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0xEAF0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0xEE80(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0xF210(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0xF5A0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0xF930(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0xFCC0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x10050(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x103E0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x10770(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x10B00(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x10E90(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x11220(0x0390)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x115B0(0x00A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x11650(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x119E0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x11D70(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x12100(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x12490(0x0390)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x12820(0x0030)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x12850(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x12BE0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x12F70(0x0390)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ABP_Girl006a_Phy(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Girl006a_Phy_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Girl006a_Phy_C")
	}
	static class UABP_Girl006a_Phy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Girl006a_Phy_C>();
	}
};
DUMPER7_ASSERTS_UABP_Girl006a_Phy_C;

}

