#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon_113_Part01_Locomotion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Mon_113_Part01_Locomotion.ABP_Mon_113_Part01_Locomotion_C
// 0x0130 (0x0490 - 0x0360)
class UABP_Mon_113_Part01_Locomotion_C final : public UAnimInstance_Locomotion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0368(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0398(0x00E8)()
	float                                         SpeedCache;                                        // 0x0480(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AngleFlag;                                         // 0x0484(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFalling;                                          // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bFallingAnim;                                      // 0x0489(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintBeginPlay();
	void ExecuteUbergraph_ABP_Mon_113_Part01_Locomotion(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Mon_113_Part01_Locomotion_C">();
	}
	static class UABP_Mon_113_Part01_Locomotion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Mon_113_Part01_Locomotion_C>();
	}
};
static_assert(alignof(UABP_Mon_113_Part01_Locomotion_C) == 0x000010, "Wrong alignment on UABP_Mon_113_Part01_Locomotion_C");
static_assert(sizeof(UABP_Mon_113_Part01_Locomotion_C) == 0x000490, "Wrong size on UABP_Mon_113_Part01_Locomotion_C");
static_assert(offsetof(UABP_Mon_113_Part01_Locomotion_C, UberGraphFrame) == 0x000360, "Member 'UABP_Mon_113_Part01_Locomotion_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Part01_Locomotion_C, AnimGraphNode_Root) == 0x000368, "Member 'UABP_Mon_113_Part01_Locomotion_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Part01_Locomotion_C, AnimGraphNode_BlendSpacePlayer) == 0x000398, "Member 'UABP_Mon_113_Part01_Locomotion_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Part01_Locomotion_C, SpeedCache) == 0x000480, "Member 'UABP_Mon_113_Part01_Locomotion_C::SpeedCache' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Part01_Locomotion_C, AngleFlag) == 0x000484, "Member 'UABP_Mon_113_Part01_Locomotion_C::AngleFlag' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Part01_Locomotion_C, bFalling) == 0x000488, "Member 'UABP_Mon_113_Part01_Locomotion_C::bFalling' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Part01_Locomotion_C, bFallingAnim) == 0x000489, "Member 'UABP_Mon_113_Part01_Locomotion_C::bFallingAnim' has a wrong offset!");

}

