#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_girl004_Prop02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_girl004_Prop02.ABP_Girl004_Prop02_C
// 0x02C0 (0x0580 - 0x02C0)
class UABP_Girl004_Prop02_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x02C8(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0310(0x00E8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03F8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0428(0x0080)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x04A8(0x00C8)()
	bool                                          Get_Speed;                                         // 0x0570(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571[0x3];                                      // 0x0571(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CaptainSpeed;                                      // 0x0574(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintBeginPlay();
	void ExecuteUbergraph_ABP_Girl004_Prop02(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Girl004_Prop02_C">();
	}
	static class UABP_Girl004_Prop02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Girl004_Prop02_C>();
	}
};
static_assert(alignof(UABP_Girl004_Prop02_C) == 0x000010, "Wrong alignment on UABP_Girl004_Prop02_C");
static_assert(sizeof(UABP_Girl004_Prop02_C) == 0x000580, "Wrong size on UABP_Girl004_Prop02_C");
static_assert(offsetof(UABP_Girl004_Prop02_C, UberGraphFrame) == 0x0002C0, "Member 'UABP_Girl004_Prop02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Girl004_Prop02_C, AnimGraphNode_Slot) == 0x0002C8, "Member 'UABP_Girl004_Prop02_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Girl004_Prop02_C, AnimGraphNode_BlendSpacePlayer) == 0x000310, "Member 'UABP_Girl004_Prop02_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Girl004_Prop02_C, AnimGraphNode_Root) == 0x0003F8, "Member 'UABP_Girl004_Prop02_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Girl004_Prop02_C, AnimGraphNode_SequencePlayer) == 0x000428, "Member 'UABP_Girl004_Prop02_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Girl004_Prop02_C, AnimGraphNode_ApplyAdditive) == 0x0004A8, "Member 'UABP_Girl004_Prop02_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UABP_Girl004_Prop02_C, Get_Speed) == 0x000570, "Member 'UABP_Girl004_Prop02_C::Get_Speed' has a wrong offset!");
static_assert(offsetof(UABP_Girl004_Prop02_C, CaptainSpeed) == 0x000574, "Member 'UABP_Girl004_Prop02_C::CaptainSpeed' has a wrong offset!");

}

