#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_GirlBase_HeadBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_GirlBase_HeadBase.ABP_GirlBase_HeadBase_C
// 0x0160 (0x05D0 - 0x0470)
class UABP_GirlBase_HeadBase_C : public UAccessoryAnimInstance_Head
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0478(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x04A8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x04F0(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0570(0x0048)()
	class UAnimSequenceBase*                      New;                                               // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Times;                                             // 0x05C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintBeginPlay();
	void CustomEvent();
	void ExecuteUbergraph_ABP_GirlBase_HeadBase(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_GirlBase_HeadBase_C">();
	}
	static class UABP_GirlBase_HeadBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_GirlBase_HeadBase_C>();
	}
};
static_assert(alignof(UABP_GirlBase_HeadBase_C) == 0x000010, "Wrong alignment on UABP_GirlBase_HeadBase_C");
static_assert(sizeof(UABP_GirlBase_HeadBase_C) == 0x0005D0, "Wrong size on UABP_GirlBase_HeadBase_C");
static_assert(offsetof(UABP_GirlBase_HeadBase_C, UberGraphFrame) == 0x000470, "Member 'UABP_GirlBase_HeadBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_GirlBase_HeadBase_C, AnimGraphNode_Root) == 0x000478, "Member 'UABP_GirlBase_HeadBase_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_GirlBase_HeadBase_C, AnimGraphNode_Slot_1) == 0x0004A8, "Member 'UABP_GirlBase_HeadBase_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_GirlBase_HeadBase_C, AnimGraphNode_SequencePlayer) == 0x0004F0, "Member 'UABP_GirlBase_HeadBase_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_GirlBase_HeadBase_C, AnimGraphNode_Slot) == 0x000570, "Member 'UABP_GirlBase_HeadBase_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_GirlBase_HeadBase_C, New) == 0x0005B8, "Member 'UABP_GirlBase_HeadBase_C::New' has a wrong offset!");
static_assert(offsetof(UABP_GirlBase_HeadBase_C, Times) == 0x0005C0, "Member 'UABP_GirlBase_HeadBase_C::Times' has a wrong offset!");

}

