#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon_108_Main

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Mon_108_Main.ABP_Mon_108_Main_C
// 0x1440 (0x1A10 - 0x05D0)
class UABP_Mon_108_Main_C final : public UAnimInstance_Humanoid
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x05D8(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x06F0(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x0720(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0878(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x09D0(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x09F8(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0AA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0AD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0AF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0B20(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0B48(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0BC8(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x0BF8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x0C40(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0C88(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0D48(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x0D90(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0DB8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0DE0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0E10(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0E90(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0EB8(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0F58(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0FA0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0FD0(0x00B0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x1080(0x00B0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1130(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1150(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x1170(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1320(0x0158)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x1478(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x14A8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x14D0(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1570(0x0028)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x1598(0x00A0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x1638(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x16D8(0x00A0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x1778(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1890(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x18C0(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x19D8(0x0030)()

public:
	void ExecuteUbergraph_ABP_Mon_108_Main(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_108_Main_AnimGraphNode_TransitionResult_1968BF77400B0B0D0580ED8720B7554F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_108_Main_AnimGraphNode_TransitionResult_BCFB5D784A913E1B765BDFA942D92D44();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_108_Main_AnimGraphNode_TransitionResult_16938E7B4A1FFD05C5EC2EB094E307A3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_108_Main_AnimGraphNode_TransitionResult_FA3ECF6E45F9E885E79A92A8B3324D19();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_108_Main_AnimGraphNode_SequencePlayer_758AC1F04908565ECDE1D3818C48318F();
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void GroundIKLayer(const struct FPoseLink& GroundIkInputPose, struct FPoseLink* GroundIKLayer_0);
	void CurveDataLayer(const struct FPoseLink& CurveInputPose, struct FPoseLink* CurveDataLayer_0);
	void HitAddtiveLayer(const struct FPoseLink& HitInputPose, struct FPoseLink* HitAddtiveLayer_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Mon_108_Main_C">();
	}
	static class UABP_Mon_108_Main_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Mon_108_Main_C>();
	}
};
static_assert(alignof(UABP_Mon_108_Main_C) == 0x000010, "Wrong alignment on UABP_Mon_108_Main_C");
static_assert(sizeof(UABP_Mon_108_Main_C) == 0x001A10, "Wrong size on UABP_Mon_108_Main_C");
static_assert(offsetof(UABP_Mon_108_Main_C, UberGraphFrame) == 0x0005D0, "Member 'UABP_Mon_108_Main_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_LinkedInputPose_2) == 0x0005D8, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_Root_3) == 0x0006F0, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_SaveCachedPose_2) == 0x000720, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_SaveCachedPose_1) == 0x000878, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_UseCachedPose_5) == 0x0009D0, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_LinkedAnimLayer_1) == 0x0009F8, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_LinkedAnimLayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_TransitionResult_3) == 0x000AA8, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_TransitionResult_2) == 0x000AD0, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_TransitionResult_1) == 0x000AF8, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_TransitionResult) == 0x000B20, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_SequencePlayer_1) == 0x000B48, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_StateResult_2) == 0x000BC8, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_Slot_3) == 0x000BF8, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_Slot_2) == 0x000C40, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_LayeredBoneBlend) == 0x000C88, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_Slot_1) == 0x000D48, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_UseCachedPose_4) == 0x000D90, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_UseCachedPose_3) == 0x000DB8, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_StateResult_1) == 0x000DE0, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_SequencePlayer) == 0x000E10, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_UseCachedPose_2) == 0x000E90, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_BlendListByBool_2) == 0x000EB8, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_Slot) == 0x000F58, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_StateResult) == 0x000FA0, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_StateMachine) == 0x000FD0, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_LinkedAnimLayer) == 0x001080, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_LocalToComponentSpace) == 0x001130, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_ComponentToLocalSpace) == 0x001150, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_LookAt) == 0x001170, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_SaveCachedPose) == 0x001320, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_Root_2) == 0x001478, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_UseCachedPose_1) == 0x0014A8, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_BlendListByBool_1) == 0x0014D0, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_UseCachedPose) == 0x001570, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_LinkedAnimGraph_1) == 0x001598, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_LinkedAnimGraph_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_LinkedAnimGraph) == 0x001638, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_BlendListByBool) == 0x0016D8, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_LinkedInputPose_1) == 0x001778, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_Root_1) == 0x001890, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_LinkedInputPose) == 0x0018C0, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_108_Main_C, AnimGraphNode_Root) == 0x0019D8, "Member 'UABP_Mon_108_Main_C::AnimGraphNode_Root' has a wrong offset!");

}

