#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon_107_Main

#include "Basic.hpp"

#include "SeasunAnimGraph_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Mon_107_Main.ABP_Mon_107_Main_C
// 0x0260 (0x0770 - 0x0510)
class UABP_Mon_107_Main_C final : public UAnimInstanceBase
{
public:
	uint8                                         Pad_508[0x8];                                      // 0x0508(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0518(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0548(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x05C8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0610(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x06B0(0x0080)()
	struct FAnimNode_CurveSequenceSlot            AnimGraphNode_CurveSequenceSlot;                   // 0x0730(0x0038)()
	bool                                          bIsDead;                                           // 0x0768(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_Mon_107_Main(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Mon_107_Main_C">();
	}
	static class UABP_Mon_107_Main_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Mon_107_Main_C>();
	}
};
static_assert(alignof(UABP_Mon_107_Main_C) == 0x000010, "Wrong alignment on UABP_Mon_107_Main_C");
static_assert(sizeof(UABP_Mon_107_Main_C) == 0x000770, "Wrong size on UABP_Mon_107_Main_C");
static_assert(offsetof(UABP_Mon_107_Main_C, UberGraphFrame) == 0x000510, "Member 'UABP_Mon_107_Main_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Mon_107_Main_C, AnimGraphNode_Root) == 0x000518, "Member 'UABP_Mon_107_Main_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Mon_107_Main_C, AnimGraphNode_SequencePlayer_1) == 0x000548, "Member 'UABP_Mon_107_Main_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_107_Main_C, AnimGraphNode_Slot) == 0x0005C8, "Member 'UABP_Mon_107_Main_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Mon_107_Main_C, AnimGraphNode_BlendListByBool) == 0x000610, "Member 'UABP_Mon_107_Main_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Mon_107_Main_C, AnimGraphNode_SequencePlayer) == 0x0006B0, "Member 'UABP_Mon_107_Main_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_107_Main_C, AnimGraphNode_CurveSequenceSlot) == 0x000730, "Member 'UABP_Mon_107_Main_C::AnimGraphNode_CurveSequenceSlot' has a wrong offset!");
static_assert(offsetof(UABP_Mon_107_Main_C, bIsDead) == 0x000768, "Member 'UABP_Mon_107_Main_C::bIsDead' has a wrong offset!");

}

