#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Girl004b_04_Aftetimage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Girl004b_04_Aftetimage.ABP_Girl004b_04_Aftetimage_C
// 0x0100 (0x03C0 - 0x02C0)
class UABP_Girl004b_04_Aftetimage_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_PoseSnapshot                 AnimGraphNode_PoseSnapshot;                        // 0x02F8(0x0090)()
	struct FPoseSnapshot                          Snapshot;                                          // 0x0388(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_Girl004b_04_Aftetimage(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Girl004b_04_Aftetimage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Girl004b_04_Aftetimage_C")
	}
	static class UABP_Girl004b_04_Aftetimage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Girl004b_04_Aftetimage_C>();
	}
};
DUMPER7_ASSERTS_UABP_Girl004b_04_Aftetimage_C;

}

