#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon_103

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Mon_103.ABP_Mon_103_C
// 0x15E0 (0x1BB0 - 0x05D0)
class UABP_Mon_103_C final : public UAnimInstance_Humanoid
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x05D8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x0608(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0720(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0750(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0868(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0898(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x09B0(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x09E0(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0B38(0x0158)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x0C90(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0D40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0D68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0D90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0DB8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0DE0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0E60(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0E90(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x0F10(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0FB0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1030(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x1060(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x10A8(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x1168(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x11B0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x11D8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1200(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1230(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x12B0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x12D8(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1378(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x13C0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x13F0(0x00B0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x14A0(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1550(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1578(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1618(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1640(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x1660(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1810(0x0158)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1968(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1988(0x0028)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x19B0(0x00A0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x1A50(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1AF0(0x00A0)()
	bool                                          DeadType;                                          // 0x1B90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B91[0x7];                                     // 0x1B91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             Idle2FightEvent;                                   // 0x1B98(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void HitAddtiveLayer(const struct FPoseLink& HitInputPose, struct FPoseLink* HitAddtiveLayer_0);
	void GroundIKLayer(const struct FPoseLink& GroundIkInputPose, struct FPoseLink* GroundIKLayer_0);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_103_AnimGraphNode_TransitionResult_F92663674F29A0F66A39D186C4FD00C1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_103_AnimGraphNode_TransitionResult_07F22B1748A6A9BB9E197E9AA1B3B23E();
	void AnimNotify_EventIdle2Fight();
	void ExecuteUbergraph_ABP_Mon_103(int32 EntryPoint);
	void CurveDataLayer(const struct FPoseLink& CurveInputPose, struct FPoseLink* CurveDataLayer_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_103_AnimGraphNode_SequencePlayer_A36FA4AB47FAF0D725CDD0932DB080D7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_103_AnimGraphNode_TransitionResult_87BFF56B4966D9F4DA3C08BB08FF9ACE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_103_AnimGraphNode_TransitionResult_6C436868450E8526FFFE85A9853941A3();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void Idle2FightEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Mon_103_C">();
	}
	static class UABP_Mon_103_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Mon_103_C>();
	}
};
static_assert(alignof(UABP_Mon_103_C) == 0x000010, "Wrong alignment on UABP_Mon_103_C");
static_assert(sizeof(UABP_Mon_103_C) == 0x001BB0, "Wrong size on UABP_Mon_103_C");
static_assert(offsetof(UABP_Mon_103_C, UberGraphFrame) == 0x0005D0, "Member 'UABP_Mon_103_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_Root_3) == 0x0005D8, "Member 'UABP_Mon_103_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_LinkedInputPose_2) == 0x000608, "Member 'UABP_Mon_103_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_Root_2) == 0x000720, "Member 'UABP_Mon_103_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_LinkedInputPose_1) == 0x000750, "Member 'UABP_Mon_103_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_Root_1) == 0x000868, "Member 'UABP_Mon_103_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_LinkedInputPose) == 0x000898, "Member 'UABP_Mon_103_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_Root) == 0x0009B0, "Member 'UABP_Mon_103_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_SaveCachedPose_2) == 0x0009E0, "Member 'UABP_Mon_103_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_SaveCachedPose_1) == 0x000B38, "Member 'UABP_Mon_103_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_LinkedAnimLayer_1) == 0x000C90, "Member 'UABP_Mon_103_C::AnimGraphNode_LinkedAnimLayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_TransitionResult_3) == 0x000D40, "Member 'UABP_Mon_103_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_TransitionResult_2) == 0x000D68, "Member 'UABP_Mon_103_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_TransitionResult_1) == 0x000D90, "Member 'UABP_Mon_103_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_TransitionResult) == 0x000DB8, "Member 'UABP_Mon_103_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_SequencePlayer_3) == 0x000DE0, "Member 'UABP_Mon_103_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_StateResult_3) == 0x000E60, "Member 'UABP_Mon_103_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_SequencePlayer_2) == 0x000E90, "Member 'UABP_Mon_103_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_BlendListByBool_3) == 0x000F10, "Member 'UABP_Mon_103_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_SequencePlayer_1) == 0x000FB0, "Member 'UABP_Mon_103_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_StateResult_2) == 0x001030, "Member 'UABP_Mon_103_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_Slot_2) == 0x001060, "Member 'UABP_Mon_103_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_LayeredBoneBlend) == 0x0010A8, "Member 'UABP_Mon_103_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_Slot_1) == 0x001168, "Member 'UABP_Mon_103_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_UseCachedPose_5) == 0x0011B0, "Member 'UABP_Mon_103_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_UseCachedPose_4) == 0x0011D8, "Member 'UABP_Mon_103_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_StateResult_1) == 0x001200, "Member 'UABP_Mon_103_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_SequencePlayer) == 0x001230, "Member 'UABP_Mon_103_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_UseCachedPose_3) == 0x0012B0, "Member 'UABP_Mon_103_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_BlendListByBool_2) == 0x0012D8, "Member 'UABP_Mon_103_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_Slot) == 0x001378, "Member 'UABP_Mon_103_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_StateResult) == 0x0013C0, "Member 'UABP_Mon_103_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_StateMachine) == 0x0013F0, "Member 'UABP_Mon_103_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_LinkedAnimLayer) == 0x0014A0, "Member 'UABP_Mon_103_C::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_UseCachedPose_2) == 0x001550, "Member 'UABP_Mon_103_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_BlendListByBool_1) == 0x001578, "Member 'UABP_Mon_103_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_UseCachedPose_1) == 0x001618, "Member 'UABP_Mon_103_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_ComponentToLocalSpace) == 0x001640, "Member 'UABP_Mon_103_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_LookAt) == 0x001660, "Member 'UABP_Mon_103_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_SaveCachedPose) == 0x001810, "Member 'UABP_Mon_103_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_LocalToComponentSpace) == 0x001968, "Member 'UABP_Mon_103_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_UseCachedPose) == 0x001988, "Member 'UABP_Mon_103_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_LinkedAnimGraph_1) == 0x0019B0, "Member 'UABP_Mon_103_C::AnimGraphNode_LinkedAnimGraph_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_LinkedAnimGraph) == 0x001A50, "Member 'UABP_Mon_103_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, AnimGraphNode_BlendListByBool) == 0x001AF0, "Member 'UABP_Mon_103_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, DeadType) == 0x001B90, "Member 'UABP_Mon_103_C::DeadType' has a wrong offset!");
static_assert(offsetof(UABP_Mon_103_C, Idle2FightEvent) == 0x001B98, "Member 'UABP_Mon_103_C::Idle2FightEvent' has a wrong offset!");

}

