#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_GirlBaseEXSpine3

#include "Basic.hpp"

#include "Game_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PhysicsControl_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "SeasunAnimGraph_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_GirlBaseEXSpine3.ABP_GirlBaseEXSpine3_C
// 0x1D100 (0x1EED0 - 0x1DD0)
class UABP_GirlBaseEXSpine3_C : public UGameCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1DD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_58;                   // 0x1DD8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_156;                   // 0x1F30(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_34;                             // 0x1F58(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_155;                   // 0x1FA0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_33;                             // 0x1FC8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_154;                   // 0x2010(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_23;                      // 0x2038(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_105;                 // 0x2100(0x00A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_37;            // 0x21A0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_42;            // 0x21C0(0x0020)()
	struct FAnimNode_SkeletalRotateSpine          AnimGraphNode_SkeletalRotateSpine_3;               // 0x21E0(0x0110)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_104;                 // 0x22F0(0x00A0)()
	struct FAnimNode_SkeletalRotateSpine          AnimGraphNode_SkeletalRotateSpine_2;               // 0x2390(0x0110)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_41;            // 0x24A0(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_57;                   // 0x24C0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_153;                   // 0x2618(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x2640(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x2670(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_56;                   // 0x2788(0x0158)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_27;                       // 0x28E0(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_36;            // 0x29E8(0x0020)()
	struct FAnimNode_CurveSequenceSlot            AnimGraphNode_CurveSequenceSlot_2;                 // 0x2A08(0x0038)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_40;            // 0x2A40(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_103;                 // 0x2A60(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_39;            // 0x2B00(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_152;                   // 0x2B20(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_26;                       // 0x2B48(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_35;            // 0x2C50(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_151;                   // 0x2C70(0x0028)()
	struct FAnimNode_SkeletalRotateSpine          AnimGraphNode_SkeletalRotateSpine_1;               // 0x2C98(0x0110)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_38;            // 0x2DA8(0x0020)()
	struct FAnimNode_SkeletalRotateSpine          AnimGraphNode_SkeletalRotateSpine;                 // 0x2DC8(0x0110)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_150;                   // 0x2ED8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_28;                 // 0x2F00(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_149;                   // 0x2FC0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_148;                   // 0x2FE8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_102;                 // 0x3010(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_147;                   // 0x30B0(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_34;            // 0x30D8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_33;            // 0x30F8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_37;            // 0x3118(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_101;                 // 0x3138(0x00A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_25;                       // 0x31D8(0x0108)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_8;                   // 0x32E0(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_55;                   // 0x3390(0x0158)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_100;                 // 0x34E8(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_146;                   // 0x3588(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x35B0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x35E0(0x0118)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x36F8(0x0118)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_145;                   // 0x3810(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_54;                   // 0x3838(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_53;                   // 0x3990(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_144;                   // 0x3AE8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_27;                 // 0x3B10(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_52;                   // 0x3BD0(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_51;                   // 0x3D28(0x0158)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_99;                  // 0x3E80(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_143;                   // 0x3F20(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_142;                   // 0x3F48(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_141;                   // 0x3F70(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_140;                   // 0x3F98(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_26;                 // 0x3FC0(0x00C0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_98;                  // 0x4080(0x00A0)()
	struct FAnimNode_UpperBodyMatchingUnder       AnimGraphNode_UpperBodyMatchingUnder;              // 0x4120(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_139;                   // 0x41A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_138;                   // 0x41D0(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_3;                      // 0x41F8(0x0018)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5;                     // 0x4210(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_137;                   // 0x42D8(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_7;                   // 0x4300(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_136;                   // 0x43B0(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_32;            // 0x43D8(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_97;                  // 0x43F8(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_135;                   // 0x4498(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_50;                   // 0x44C0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_134;                   // 0x4618(0x0028)()
	struct FAnimNode_SpeedWarping_UpperBody       AnimGraphNode_SpeedWarping_UpperBody;              // 0x4640(0x0190)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_6;                   // 0x47D0(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_133;                   // 0x4880(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_2;                      // 0x48A8(0x0018)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_32;                             // 0x48C0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_49;                   // 0x4908(0x0158)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_1;                      // 0x4A60(0x0018)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_31;                             // 0x4A78(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose;                        // 0x4AC0(0x0018)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_30;                             // 0x4AD8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_48;                   // 0x4B20(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_47;                   // 0x4C78(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_132;                   // 0x4DD0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_131;                   // 0x4DF8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_130;                   // 0x4E20(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_129;                   // 0x4E48(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_96;                  // 0x4E70(0x00A0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x4F10(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_5;                  // 0x4FD8(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_128;                   // 0x50C0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_127;                   // 0x50E8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_126;                   // 0x5110(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_4;                  // 0x5138(0x00E8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x5220(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_46;                   // 0x52E8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_125;                   // 0x5440(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_124;                   // 0x5468(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_95;                  // 0x5490(0x00A0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x5530(0x00E8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x5618(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_123;                   // 0x56E0(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_36;            // 0x5708(0x0020)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x5728(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x57F0(0x00E8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x58D8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x5908(0x0118)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x5A20(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_45;                   // 0x5B38(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_44;                   // 0x5C90(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_122;                   // 0x5DE8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_121;                   // 0x5E10(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_5;                   // 0x5E38(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_120;                   // 0x5EE8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_119;                   // 0x5F10(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_118;                   // 0x5F38(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_117;                   // 0x5F60(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_94;                  // 0x5F88(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_43;                   // 0x6028(0x0158)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_31;            // 0x6180(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_35;            // 0x61A0(0x0020)()
	struct FAnimNode_SpeedWarping                 AnimGraphNode_SpeedWarping;                        // 0x61C0(0x0160)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_93;                  // 0x6320(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_42;                   // 0x63C0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_116;                   // 0x6518(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_25;                 // 0x6540(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_115;                   // 0x6600(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_114;                   // 0x6628(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_113;                   // 0x6650(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_29;                             // 0x6678(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_112;                   // 0x66C0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_111;                   // 0x66E8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_92;                  // 0x6710(0x00A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x67B0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x67E0(0x0118)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x68F8(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_41;                   // 0x6A10(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_40;                   // 0x6B68(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_110;                   // 0x6CC0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_39;                   // 0x6CE8(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_28;                             // 0x6E40(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_27;                             // 0x6E88(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_26;                             // 0x6ED0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_25;                             // 0x6F18(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_38;                   // 0x6F60(0x0158)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x70B8(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x71D0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x7200(0x0118)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_6;            // 0x7318(0x00D0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_34;            // 0x73E8(0x0020)()
	uint8                                         Pad_7408[0x8];                                     // 0x7408(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AimOffset                    AnimGraphNode_AimOffset_7;                         // 0x7410(0x0200)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_30;            // 0x7610(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_7;                 // 0x7630(0x0050)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_91;                  // 0x7680(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_37;                   // 0x7720(0x0158)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_6;                 // 0x7878(0x0050)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_90;                  // 0x78C8(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_109;                   // 0x7968(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_22;                      // 0x7990(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_9;                      // 0x79C0(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x7A70(0x0030)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_5;                 // 0x7AA0(0x0050)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_5;            // 0x7AF0(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_108;                   // 0x7BC0(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_4;                 // 0x7BE8(0x0050)()
	struct FAnimNode_LayeredBoneBlendCustomFilter AnimGraphNode_LayerBlendPerBoneCustomFilter;       // 0x7C38(0x00D8)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_3;                 // 0x7D10(0x0050)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_89;                  // 0x7D60(0x00A0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2;                 // 0x7E00(0x0050)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_4;                   // 0x7E50(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_36;                   // 0x7F00(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_107;                   // 0x8058(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_106;                   // 0x8080(0x0028)()
	uint8                                         Pad_80A8[0x8];                                     // 0x80A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AimOffset                    AnimGraphNode_AimOffset_6;                         // 0x80B0(0x0200)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_29;            // 0x82B0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_33;            // 0x82D0(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_35;                   // 0x82F0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_105;                   // 0x8448(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_104;                   // 0x8470(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_103;                   // 0x8498(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_22;                      // 0x84C0(0x00C8)()
	struct FAnimNode_BlendWithRefPose             AnimGraphNode_BlendWithRefPose;                    // 0x8588(0x0098)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_21;                      // 0x8620(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_58;                   // 0x86E8(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_34;                   // 0x8768(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_102;                   // 0x88C0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_101;                   // 0x88E8(0x0028)()
	struct FAnimNode_RecoilSequenceNode           AnimGraphNode_RecoilSequenceNode_1;                // 0x8910(0x09A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_24;                             // 0x92B0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_33;                   // 0x92F8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_100;                   // 0x9450(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_99;                    // 0x9478(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_3;                   // 0x94A0(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_88;                  // 0x9550(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_57;                   // 0x95F0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_56;                   // 0x9670(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_87;                  // 0x96F0(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_24;                 // 0x9790(0x00C0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2;                   // 0x9850(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_86;                  // 0x9900(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_85;                  // 0x99A0(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_23;                 // 0x9A40(0x00C0)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_4;            // 0x9B00(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_84;                  // 0x9BD0(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_98;                    // 0x9C70(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_32;                   // 0x9C98(0x0158)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_3;            // 0x9DF0(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_31;                   // 0x9EC0(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_30;                   // 0xA018(0x0158)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_2;            // 0xA170(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_83;                  // 0xA240(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_82;                  // 0xA2E0(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_97;                    // 0xA380(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_23;                             // 0xA3A8(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_22;                 // 0xA3F0(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_96;                    // 0xA4B0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_95;                    // 0xA4D8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_29;                   // 0xA500(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_94;                    // 0xA658(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_93;                    // 0xA680(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_92;                    // 0xA6A8(0x0028)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_37;                       // 0xA6D0(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_22;                             // 0xA7C0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_21;                 // 0xA808(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_91;                    // 0xA8C8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_28;                   // 0xA8F0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_90;                    // 0xAA48(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_89;                    // 0xAA70(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_27;                   // 0xAA98(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_21;                             // 0xABF0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_20;                 // 0xAC38(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_88;                    // 0xACF8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_87;                    // 0xAD20(0x0028)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0xAD48(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0xAE60(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_20;                             // 0xAE90(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_26;                   // 0xAED8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_86;                    // 0xB030(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_25;                   // 0xB058(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_85;                    // 0xB1B0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_81;                  // 0xB1D8(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_19;                 // 0xB278(0x00C0)()
	uint8                                         Pad_B338[0x8];                                     // 0xB338(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBodyWithControl         AnimGraphNode_RigidBodyWithControl;                // 0xB340(0x0B20)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0xBE60(0x0650)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_24;                   // 0xC4B0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_84;                    // 0xC608(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_83;                    // 0xC630(0x0028)()
	struct FAnimNode_SaveBoneTransform            AnimGraphNode_SaveBoneTransform_1;                 // 0xC658(0x0150)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_28;            // 0xC7A8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_32;            // 0xC7C8(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_19;                             // 0xC7E8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_80;                  // 0xC830(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_31;            // 0xC8D0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_30;            // 0xC8F0(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_79;                  // 0xC910(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_29;            // 0xC9B0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_82;                    // 0xC9D0(0x0028)()
	struct FAnimNode_RotationWarping              AnimGraphNode_RotationWarping;                     // 0xC9F8(0x0050)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_78;                  // 0xCA48(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_81;                    // 0xCAE8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_77;                  // 0xCB10(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_80;                    // 0xCBB0(0x0028)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_36;                       // 0xCBD8(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_18;                             // 0xCCC8(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_18;                 // 0xCD10(0x00C0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_24;                       // 0xCDD0(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_27;            // 0xCED8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_28;            // 0xCEF8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_23;                       // 0xCF18(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_26;            // 0xD020(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_76;                  // 0xD040(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_27;            // 0xD0E0(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_75;                  // 0xD100(0x00A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_22;                       // 0xD1A0(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_25;            // 0xD2A8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_26;            // 0xD2C8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_21;                       // 0xD2E8(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_24;            // 0xD3F0(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_74;                  // 0xD410(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_25;            // 0xD4B0(0x0020)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_35;                       // 0xD4D0(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_79;                    // 0xD5C0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_78;                    // 0xD5E8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_77;                    // 0xD610(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_76;                    // 0xD638(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_73;                  // 0xD660(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_75;                    // 0xD700(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_72;                  // 0xD728(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_74;                    // 0xD7C8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_71;                  // 0xD7F0(0x00A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_20;                       // 0xD890(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_23;            // 0xD998(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_24;            // 0xD9B8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_19;                       // 0xD9D8(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_22;            // 0xDAE0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_23;            // 0xDB00(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_70;                  // 0xDB20(0x00A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_18;                       // 0xDBC0(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_21;            // 0xDCC8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_22;            // 0xDCE8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_17;                       // 0xDD08(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_20;            // 0xDE10(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_21;            // 0xDE30(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_69;                  // 0xDE50(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_68;                  // 0xDEF0(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_73;                    // 0xDF90(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_72;                    // 0xDFB8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_71;                    // 0xDFE0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_70;                    // 0xE008(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_23;                   // 0xE030(0x0158)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_67;                  // 0xE188(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_22;                   // 0xE228(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_69;                    // 0xE380(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_68;                    // 0xE3A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_67;                    // 0xE3D0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_17;                             // 0xE3F8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_66;                    // 0xE440(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_17;                 // 0xE468(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_65;                    // 0xE528(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_66;                  // 0xE550(0x00A0)()
	struct FAnimNode_RecoilSequenceNode           AnimGraphNode_RecoilSequenceNode;                  // 0xE5F0(0x09A0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_34;                       // 0xEF90(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_64;                    // 0xF080(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_63;                    // 0xF0A8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_65;                  // 0xF0D0(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_64;                  // 0xF170(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_63;                  // 0xF210(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_62;                    // 0xF2B0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_21;                   // 0xF2D8(0x0158)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_62;                  // 0xF430(0x00A0)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_1;            // 0xF4D0(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_55;                   // 0xF5A0(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_20;                   // 0xF620(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_61;                    // 0xF778(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_60;                    // 0xF7A0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_59;                    // 0xF7C8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_58;                    // 0xF7F0(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_16;                       // 0xF818(0x0108)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_61;                  // 0xF920(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_20;            // 0xF9C0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_15;                       // 0xF9E0(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_19;            // 0xFAE8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_57;                    // 0xFB08(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_19;                   // 0xFB30(0x0158)()
	uint8                                         Pad_FC88[0x8];                                     // 0xFC88(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AimOffset                    AnimGraphNode_AimOffset_5;                         // 0xFC90(0x0200)()
	struct FAnimNode_AimOffset                    AnimGraphNode_AimOffset_4;                         // 0xFE90(0x0200)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_18;                   // 0x10090(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_17;                   // 0x101E8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_56;                    // 0x10340(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_55;                    // 0x10368(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_18;            // 0x10390(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_14;                       // 0x103B0(0x0108)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_16;                             // 0x104B8(0x0048)()
	struct FAnimNode_CurveSequenceSlot            AnimGraphNode_CurveSequenceSlot_1;                 // 0x10500(0x0038)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_17;            // 0x10538(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_16;                   // 0x10558(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_54;                    // 0x106B0(0x0028)()
	struct FAnimNode_CurveSequenceSlot            AnimGraphNode_CurveSequenceSlot;                   // 0x106D8(0x0038)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_60;                  // 0x10710(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_19;            // 0x107B0(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_16;            // 0x107D0(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_15;                   // 0x107F0(0x0158)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_20;                      // 0x10948(0x00C8)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x10A10(0x00D0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x10AE0(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_53;                    // 0x10B30(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_14;                   // 0x10B58(0x0158)()
	struct FAnimNode_AimOffset                    AnimGraphNode_AimOffset_3;                         // 0x10CB0(0x0200)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_15;            // 0x10EB0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_18;            // 0x10ED0(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_59;                  // 0x10EF0(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_17;            // 0x10F90(0x0020)()
	struct FAnimNode_AimOffset                    AnimGraphNode_AimOffset_2;                         // 0x10FB0(0x0200)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_52;                    // 0x111B0(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_19;                      // 0x111D8(0x00C8)()
	struct FAnimNode_AimOffset                    AnimGraphNode_AimOffset_1;                         // 0x112A0(0x0200)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_14;            // 0x114A0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_16;            // 0x114C0(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_58;                  // 0x114E0(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_15;            // 0x11580(0x0020)()
	struct FAnimNode_AimOffset                    AnimGraphNode_AimOffset;                           // 0x115A0(0x0200)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_51;                    // 0x117A0(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_16;                 // 0x117C8(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_50;                    // 0x11888(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_18;                      // 0x118B0(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_57;                  // 0x11978(0x00A0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_33;                       // 0x11A18(0x00F0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_32;                       // 0x11B08(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_56;                  // 0x11BF8(0x00A0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_31;                       // 0x11C98(0x00F0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_30;                       // 0x11D88(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_55;                  // 0x11E78(0x00A0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_29;                       // 0x11F18(0x00F0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_28;                       // 0x12008(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_54;                  // 0x120F8(0x00A0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_27;                       // 0x12198(0x00F0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_26;                       // 0x12288(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_53;                  // 0x12378(0x00A0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_25;                       // 0x12418(0x00F0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_24;                       // 0x12508(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_52;                  // 0x125F8(0x00A0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_23;                       // 0x12698(0x00F0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_22;                       // 0x12788(0x00F0)()
	struct FAnimNode_SaveBoneTransform            AnimGraphNode_SaveBoneTransform;                   // 0x12878(0x0150)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x129C8(0x0050)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x12A18(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x12A48(0x0118)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_14;            // 0x12B60(0x0020)()
	struct FAnimNode_Grounder                     AnimGraphNode_Grounder;                            // 0x12B80(0x0170)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x12CF0(0x00B0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x12DA0(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_13;                   // 0x12E50(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_49;                    // 0x12FA8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_48;                    // 0x12FD0(0x0028)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x12FF8(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x13110(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_15;                             // 0x13140(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_15;                 // 0x13188(0x00C0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_13;            // 0x13248(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_47;                    // 0x13268(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_12;                   // 0x13290(0x0158)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x133E8(0x0018)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_46;                    // 0x13400(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_14;                             // 0x13428(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_13;                       // 0x13470(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_12;            // 0x13578(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_13;            // 0x13598(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_45;                    // 0x135B8(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_12;                       // 0x135E0(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_44;                    // 0x136E8(0x0028)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x13710(0x0118)()
	struct FAnimNode_SkillAim                     AnimGraphNode_SkillAim;                            // 0x13828(0x0310)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_12;            // 0x13B38(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_11;                   // 0x13B58(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_13;                             // 0x13CB0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_43;                    // 0x13CF8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_10;                   // 0x13D20(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_42;                    // 0x13E78(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_9;                    // 0x13EA0(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_12;                             // 0x13FF8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_41;                    // 0x14040(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8;                    // 0x14068(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_11;                             // 0x141C0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_40;                    // 0x14208(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7;                    // 0x14230(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_10;                             // 0x14388(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_39;                    // 0x143D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_38;                    // 0x143F8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_37;                    // 0x14420(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_36;                    // 0x14448(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_35;                    // 0x14470(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_34;                    // 0x14498(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_33;                    // 0x144C0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_32;                    // 0x144E8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_31;                    // 0x14510(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x14538(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0x14580(0x0158)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_14;                 // 0x146D8(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x14798(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_30;                    // 0x147C8(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x147F0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_29;                    // 0x148B8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x148E0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x14928(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_28;                    // 0x14A80(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x14AA8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x14AF0(0x0158)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_51;                  // 0x14C48(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_50;                  // 0x14CE8(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_27;                    // 0x14D88(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_26;                    // 0x14DB0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x14DD8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x14E20(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_13;                 // 0x14E68(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_25;                    // 0x14F28(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_49;                  // 0x14F50(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_24;                    // 0x14FF0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_23;                    // 0x15018(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_12;                 // 0x15040(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_22;                    // 0x15100(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_48;                  // 0x15128(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_21;                    // 0x151C8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_20;                    // 0x151F0(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_17;                      // 0x15218(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_47;                  // 0x152E0(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_11;                 // 0x15380(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19;                    // 0x15440(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_46;                  // 0x15468(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0x15508(0x0028)()
