#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Boss_102_Fight_Locomotion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Boss_102_Fight_Locomotion.ABP_Boss_102_Fight_Locomotion_C
// 0x0280 (0x05E0 - 0x0360)
class UABP_Boss_102_Fight_Locomotion_C final : public UAnimInstance_Locomotion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0368(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0398(0x0158)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x04F0(0x00E8)()
	int32                                         FightState;                                        // 0x05D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HighestDps2Self;                                   // 0x05DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_Boss_102_Fight_Locomotion(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Boss_102_Fight_Locomotion_C">();
	}
	static class UABP_Boss_102_Fight_Locomotion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Boss_102_Fight_Locomotion_C>();
	}
};
static_assert(alignof(UABP_Boss_102_Fight_Locomotion_C) == 0x000010, "Wrong alignment on UABP_Boss_102_Fight_Locomotion_C");
static_assert(sizeof(UABP_Boss_102_Fight_Locomotion_C) == 0x0005E0, "Wrong size on UABP_Boss_102_Fight_Locomotion_C");
static_assert(offsetof(UABP_Boss_102_Fight_Locomotion_C, UberGraphFrame) == 0x000360, "Member 'UABP_Boss_102_Fight_Locomotion_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Fight_Locomotion_C, AnimGraphNode_Root) == 0x000368, "Member 'UABP_Boss_102_Fight_Locomotion_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Fight_Locomotion_C, AnimGraphNode_SaveCachedPose) == 0x000398, "Member 'UABP_Boss_102_Fight_Locomotion_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Fight_Locomotion_C, AnimGraphNode_BlendSpacePlayer) == 0x0004F0, "Member 'UABP_Boss_102_Fight_Locomotion_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Fight_Locomotion_C, FightState) == 0x0005D8, "Member 'UABP_Boss_102_Fight_Locomotion_C::FightState' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Fight_Locomotion_C, HighestDps2Self) == 0x0005DC, "Member 'UABP_Boss_102_Fight_Locomotion_C::HighestDps2Self' has a wrong offset!");

}

