#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon013_Part02_Main

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Mon013_Part02_Main.ABP_Mon013_Part02_Main_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Mon013_Part02_Main_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_Mon013_Part02_Main_C_AnimGraph;

// Function ABP_Mon013_Part02_Main.ABP_Mon013_Part02_Main_C.ExecuteUbergraph_ABP_Mon013_Part02_Main
// 0x0008 (0x0008 - 0x0000)
struct ABP_Mon013_Part02_Main_C_ExecuteUbergraph_ABP_Mon013_Part02_Main final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAlive_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ABP_Mon013_Part02_Main_C_ExecuteUbergraph_ABP_Mon013_Part02_Main;

}

