#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Boss_203

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Boss_203.ABP_Boss_203_C
// 0x13C0 (0x18F0 - 0x0530)
class UABP_Boss_203_C final : public UAnimInstance_BaseTitan
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0530(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0538(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x0568(0x0158)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x06C0(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0760(0x0158)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x08B8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x08E0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0960(0x0030)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_1;                         // 0x0990(0x01E0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x0B70(0x0020)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x0B90(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0C30(0x00A0)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x0CD0(0x01E0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x0EB0(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x0ED0(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x0EF0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0F38(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x0F80(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0FA0(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x10A8(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x10D0(0x0108)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x11D8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1220(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1250(0x00B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x1300(0x01B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x14B0(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x14D8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x14F8(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1518(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1670(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1698(0x0028)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x16C0(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1760(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1800(0x00A0)()
	float                                         BlendWeights;                                      // 0x18A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Test_Count;                                        // 0x18A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                BreakParticle;                                     // 0x18A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInAbnormal;                                      // 0x18B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18B1[0x3];                                     // 0x18B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TargetPosition;                                    // 0x18B4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSkillStarted;                                     // 0x18C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18C1[0x3];                                     // 0x18C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SkillAlpha;                                        // 0x18C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OffsetPosition;                                    // 0x18C8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SkillHand;                                         // 0x18D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUsingHeadIK;                                      // 0x18D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bStage3;                                           // 0x18D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18DA[0x2];                                     // 0x18DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CalHeadIKLoc;                                      // 0x18DC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bActivePoses;                                      // 0x18E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsDead;                                           // 0x18E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void AnimNotify_BreakRP();
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimNotify_StartSkill();
	void AnimNotify_BreakLP();
	void AnimNotify_StartBreak();
	void AnimNotify_EndBreak();
	void ExecuteUbergraph_ABP_Boss_203(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Boss_203_C">();
	}
	static class UABP_Boss_203_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Boss_203_C>();
	}
};
static_assert(alignof(UABP_Boss_203_C) == 0x000010, "Wrong alignment on UABP_Boss_203_C");
static_assert(sizeof(UABP_Boss_203_C) == 0x0018F0, "Wrong size on UABP_Boss_203_C");
static_assert(offsetof(UABP_Boss_203_C, UberGraphFrame) == 0x000530, "Member 'UABP_Boss_203_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_Root) == 0x000538, "Member 'UABP_Boss_203_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_SaveCachedPose_2) == 0x000568, "Member 'UABP_Boss_203_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_LinkedAnimGraph_1) == 0x0006C0, "Member 'UABP_Boss_203_C::AnimGraphNode_LinkedAnimGraph_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_SaveCachedPose_1) == 0x000760, "Member 'UABP_Boss_203_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_TransitionResult) == 0x0008B8, "Member 'UABP_Boss_203_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_SequencePlayer) == 0x0008E0, "Member 'UABP_Boss_203_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_StateResult_1) == 0x000960, "Member 'UABP_Boss_203_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_TwoBoneIK_1) == 0x000990, "Member 'UABP_Boss_203_C::AnimGraphNode_TwoBoneIK_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_LocalToComponentSpace_2) == 0x000B70, "Member 'UABP_Boss_203_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_BlendListByInt) == 0x000B90, "Member 'UABP_Boss_203_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_BlendListByBool_2) == 0x000C30, "Member 'UABP_Boss_203_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_TwoBoneIK) == 0x000CD0, "Member 'UABP_Boss_203_C::AnimGraphNode_TwoBoneIK' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x000EB0, "Member 'UABP_Boss_203_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_LocalToComponentSpace_1) == 0x000ED0, "Member 'UABP_Boss_203_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_Slot_2) == 0x000EF0, "Member 'UABP_Boss_203_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_Slot_1) == 0x000F38, "Member 'UABP_Boss_203_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x000F80, "Member 'UABP_Boss_203_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_ModifyBone_1) == 0x000FA0, "Member 'UABP_Boss_203_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_UseCachedPose_3) == 0x0010A8, "Member 'UABP_Boss_203_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_ModifyBone) == 0x0010D0, "Member 'UABP_Boss_203_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_Slot) == 0x0011D8, "Member 'UABP_Boss_203_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_StateResult) == 0x001220, "Member 'UABP_Boss_203_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_StateMachine) == 0x001250, "Member 'UABP_Boss_203_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_LookAt) == 0x001300, "Member 'UABP_Boss_203_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_UseCachedPose_2) == 0x0014B0, "Member 'UABP_Boss_203_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_LocalToComponentSpace) == 0x0014D8, "Member 'UABP_Boss_203_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_ComponentToLocalSpace) == 0x0014F8, "Member 'UABP_Boss_203_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_SaveCachedPose) == 0x001518, "Member 'UABP_Boss_203_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_UseCachedPose_1) == 0x001670, "Member 'UABP_Boss_203_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_UseCachedPose) == 0x001698, "Member 'UABP_Boss_203_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_LinkedAnimGraph) == 0x0016C0, "Member 'UABP_Boss_203_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_BlendListByBool_1) == 0x001760, "Member 'UABP_Boss_203_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, AnimGraphNode_BlendListByBool) == 0x001800, "Member 'UABP_Boss_203_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, BlendWeights) == 0x0018A0, "Member 'UABP_Boss_203_C::BlendWeights' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, Test_Count) == 0x0018A4, "Member 'UABP_Boss_203_C::Test_Count' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, BreakParticle) == 0x0018A8, "Member 'UABP_Boss_203_C::BreakParticle' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, IsInAbnormal) == 0x0018B0, "Member 'UABP_Boss_203_C::IsInAbnormal' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, TargetPosition) == 0x0018B4, "Member 'UABP_Boss_203_C::TargetPosition' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, bSkillStarted) == 0x0018C0, "Member 'UABP_Boss_203_C::bSkillStarted' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, SkillAlpha) == 0x0018C4, "Member 'UABP_Boss_203_C::SkillAlpha' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, OffsetPosition) == 0x0018C8, "Member 'UABP_Boss_203_C::OffsetPosition' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, SkillHand) == 0x0018D4, "Member 'UABP_Boss_203_C::SkillHand' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, bUsingHeadIK) == 0x0018D8, "Member 'UABP_Boss_203_C::bUsingHeadIK' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, bStage3) == 0x0018D9, "Member 'UABP_Boss_203_C::bStage3' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, CalHeadIKLoc) == 0x0018DC, "Member 'UABP_Boss_203_C::CalHeadIKLoc' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, bActivePoses) == 0x0018E8, "Member 'UABP_Boss_203_C::bActivePoses' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_C, bIsDead) == 0x0018E9, "Member 'UABP_Boss_203_C::bIsDead' has a wrong offset!");

}

