#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Boss_203_BasePose

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Boss_203_BasePose.ABP_Boss_203_BasePose_C.ExecuteUbergraph_ABP_Boss_203_BasePose
// 0x0030 (0x0030 - 0x0000)
struct ABP_Boss_203_BasePose_C_ExecuteUbergraph_ABP_Boss_203_BasePose final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Boss_203_C*                         K2Node_DynamicCast_AsBP_Boss_203;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_Boss_203_BasePose_C_ExecuteUbergraph_ABP_Boss_203_BasePose) == 0x000008, "Wrong alignment on ABP_Boss_203_BasePose_C_ExecuteUbergraph_ABP_Boss_203_BasePose");
static_assert(sizeof(ABP_Boss_203_BasePose_C_ExecuteUbergraph_ABP_Boss_203_BasePose) == 0x000030, "Wrong size on ABP_Boss_203_BasePose_C_ExecuteUbergraph_ABP_Boss_203_BasePose");
static_assert(offsetof(ABP_Boss_203_BasePose_C_ExecuteUbergraph_ABP_Boss_203_BasePose, EntryPoint) == 0x000000, "Member 'ABP_Boss_203_BasePose_C_ExecuteUbergraph_ABP_Boss_203_BasePose::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_BasePose_C_ExecuteUbergraph_ABP_Boss_203_BasePose, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'ABP_Boss_203_BasePose_C_ExecuteUbergraph_ABP_Boss_203_BasePose::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_BasePose_C_ExecuteUbergraph_ABP_Boss_203_BasePose, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'ABP_Boss_203_BasePose_C_ExecuteUbergraph_ABP_Boss_203_BasePose::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_BasePose_C_ExecuteUbergraph_ABP_Boss_203_BasePose, K2Node_DynamicCast_AsGame_Character) == 0x000010, "Member 'ABP_Boss_203_BasePose_C_ExecuteUbergraph_ABP_Boss_203_BasePose::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_BasePose_C_ExecuteUbergraph_ABP_Boss_203_BasePose, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ABP_Boss_203_BasePose_C_ExecuteUbergraph_ABP_Boss_203_BasePose::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_BasePose_C_ExecuteUbergraph_ABP_Boss_203_BasePose, K2Node_DynamicCast_AsBP_Boss_203) == 0x000020, "Member 'ABP_Boss_203_BasePose_C_ExecuteUbergraph_ABP_Boss_203_BasePose::K2Node_DynamicCast_AsBP_Boss_203' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_BasePose_C_ExecuteUbergraph_ABP_Boss_203_BasePose, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'ABP_Boss_203_BasePose_C_ExecuteUbergraph_ABP_Boss_203_BasePose::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_BasePose_C_ExecuteUbergraph_ABP_Boss_203_BasePose, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'ABP_Boss_203_BasePose_C_ExecuteUbergraph_ABP_Boss_203_BasePose::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ABP_Boss_203_BasePose.ABP_Boss_203_BasePose_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Boss_203_BasePose_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Boss_203_BasePose_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Boss_203_BasePose_C_AnimGraph");
static_assert(sizeof(ABP_Boss_203_BasePose_C_AnimGraph) == 0x000010, "Wrong size on ABP_Boss_203_BasePose_C_AnimGraph");
static_assert(offsetof(ABP_Boss_203_BasePose_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Boss_203_BasePose_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Boss_203_BasePose.ABP_Boss_203_BasePose_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Boss_203_BasePose_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Boss_203_BasePose_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Boss_203_BasePose_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Boss_203_BasePose_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Boss_203_BasePose_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Boss_203_BasePose_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Boss_203_BasePose_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

