#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_NPCBase

#include "Basic.hpp"

#include "PhysicsControl_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "SeasunAnimGraph_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_NPCBase.ABP_NPCBase_C
// 0xAB80 (0xC190 - 0x1610)
class UABP_NPCBase_C : public UGameNPCAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x1618(0x0118)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_26;                             // 0x1730(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_25;                             // 0x1778(0x0048)()
	struct FAnimNode_CurveSequenceSlot            AnimGraphNode_CurveSequenceSlot;                   // 0x17C0(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_24;                             // 0x17F8(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x1840(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x1870(0x0118)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x1988(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_33;                   // 0x1AA0(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_32;                   // 0x1BF8(0x0158)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_3;                      // 0x1D50(0x0018)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_23;                             // 0x1D68(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_31;                   // 0x1DB0(0x0158)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_2;                      // 0x1F08(0x0018)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_22;                             // 0x1F20(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_1;                      // 0x1F68(0x0018)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_21;                             // 0x1F80(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_30;                   // 0x1FC8(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_29;                   // 0x2120(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_28;                   // 0x2278(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_78;                    // 0x23D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_77;                    // 0x23F8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_12;                 // 0x2420(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_76;                    // 0x24E0(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_11;                 // 0x2508(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_27;                   // 0x25C8(0x0158)()
	struct FAnimNode_UpperBodyMatchingUnder       AnimGraphNode_UpperBodyMatchingUnder;              // 0x2720(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_75;                    // 0x27A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_74;                    // 0x27D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_73;                    // 0x27F8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_24;                  // 0x2820(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_72;                    // 0x28C0(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose;                        // 0x28E8(0x0018)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x2900(0x00C8)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_6;                   // 0x29C8(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_71;                    // 0x2A78(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_70;                    // 0x2AA0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_69;                    // 0x2AC8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_68;                    // 0x2AF0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_67;                    // 0x2B18(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x2B40(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x2B70(0x0118)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x2C88(0x0118)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_66;                    // 0x2DA0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_65;                    // 0x2DC8(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_5;                   // 0x2DF0(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_64;                    // 0x2EA0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_63;                    // 0x2EC8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_62;                    // 0x2EF0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_61;                    // 0x2F18(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_23;                  // 0x2F40(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_60;                    // 0x2FE0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_26;                   // 0x3008(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_59;                    // 0x3160(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_20;                             // 0x3188(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_58;                    // 0x31D0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_22;                  // 0x31F8(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_25;                   // 0x3298(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_24;                   // 0x33F0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_57;                    // 0x3548(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x3570(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x35A0(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_23;                   // 0x36B8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_56;                    // 0x3810(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_19;                             // 0x3838(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_22;                   // 0x3880(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_18;                             // 0x39D8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_55;                    // 0x3A20(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_21;                   // 0x3A48(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_54;                    // 0x3BA0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_20;                   // 0x3BC8(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_17;                             // 0x3D20(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_53;                    // 0x3D68(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_19;                   // 0x3D90(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_16;                             // 0x3EE8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_52;                    // 0x3F30(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_18;                   // 0x3F58(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_15;                             // 0x40B0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_51;                    // 0x40F8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_14;                             // 0x4120(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_17;                   // 0x4168(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_50;                    // 0x42C0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_13;                             // 0x42E8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_16;                   // 0x4330(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_49;                    // 0x4488(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_12;                             // 0x44B0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_15;                   // 0x44F8(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_14;                   // 0x4650(0x0158)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_14;                       // 0x47A8(0x00F0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x4898(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_10;                 // 0x4960(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_48;                    // 0x4A20(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_47;                    // 0x4A48(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_4;                   // 0x4A70(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_46;                    // 0x4B20(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_45;                    // 0x4B48(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_44;                    // 0x4B70(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_21;                  // 0x4B98(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_43;                    // 0x4C38(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_20;                  // 0x4C60(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_42;                    // 0x4D00(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_41;                    // 0x4D28(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_11;                             // 0x4D50(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_10;                             // 0x4D98(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_3;                   // 0x4DE0(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_40;                    // 0x4E90(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_39;                    // 0x4EB8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_38;                    // 0x4EE0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_37;                    // 0x4F08(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_36;                    // 0x4F30(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_35;                    // 0x4F58(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_34;                    // 0x4F80(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_33;                    // 0x4FA8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_32;                    // 0x4FD0(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x4FF8(0x0020)()
	struct FAnimNode_SkillAim                     AnimGraphNode_SkillAim;                            // 0x5018(0x0310)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;             // 0x5328(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_31;                    // 0x5348(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x5370(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_9;                  // 0x53B8(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_13;                   // 0x5478(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_30;                    // 0x55D0(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x55F8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x5628(0x0118)()
	struct FAnimNode_RecoilSequenceNode           AnimGraphNode_RecoilSequenceNode;                  // 0x5740(0x09A0)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_2;            // 0x60E0(0x00D0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2;                 // 0x61B0(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_29;                    // 0x6200(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x6228(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_28;                    // 0x6270(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_8;                  // 0x6298(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x6358(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_12;                   // 0x63A0(0x0158)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2;                   // 0x64F8(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_27;                    // 0x65A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_26;                    // 0x65D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_25;                    // 0x65F8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_24;                    // 0x6620(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x6648(0x0020)()
	struct FAnimNode_BlendWithRefPose             AnimGraphNode_BlendWithRefPose;                    // 0x6668(0x0098)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_23;                    // 0x6700(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_11;                   // 0x6728(0x0158)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x6880(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_10;                   // 0x68A0(0x0158)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0x69F8(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_22;                    // 0x6AC0(0x0028)()
	uint8                                         Pad_6AE8[0x8];                                     // 0x6AE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBodyWithControl         AnimGraphNode_RigidBodyWithControl;                // 0x6AF0(0x0B20)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_9;                    // 0x7610(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8;                    // 0x7768(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_21;                    // 0x78C0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7;                    // 0x78E8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_20;                    // 0x7A40(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19;                    // 0x7A68(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0x7A90(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x7AB8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0x7B00(0x0158)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x7C58(0x00C8)()
	struct FAnimNode_AimOffset                    AnimGraphNode_AimOffset_3;                         // 0x7D20(0x0200)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x7F20(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x7F40(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_19;                  // 0x7F60(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x8000(0x0020)()
	struct FAnimNode_AimOffset                    AnimGraphNode_AimOffset_2;                         // 0x8020(0x0200)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_7;                  // 0x8220(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x82E0(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x8308(0x0050)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_18;                  // 0x8358(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x83F8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x8420(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x8578(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x85A0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x85C8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x85F0(0x0080)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_13;                       // 0x8670(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_17;                  // 0x8760(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_16;                  // 0x8800(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x88A0(0x0080)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_12;                       // 0x8920(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_15;                  // 0x8A10(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_14;                  // 0x8AB0(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_13;                  // 0x8B50(0x00A0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_11;                       // 0x8BF0(0x00F0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_10;                       // 0x8CE0(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_12;                  // 0x8DD0(0x00A0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_9;                        // 0x8E70(0x00F0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_8;                        // 0x8F60(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_11;                  // 0x9050(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_6;                  // 0x90F0(0x00C0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_5;                  // 0x91B0(0x00C0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_10;                  // 0x9270(0x00A0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_7;                        // 0x9310(0x00F0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_6;                        // 0x9400(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_9;                   // 0x94F0(0x00A0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_5;                        // 0x9590(0x00F0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_4;                        // 0x9680(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x9770(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x9798(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x97C0(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8;                   // 0x9870(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0x9910(0x00C0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0x99D0(0x00A0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_3;                        // 0x9A70(0x00F0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_2;                        // 0x9B60(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x9C50(0x00A0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_1;                        // 0x9CF0(0x00F0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx;                          // 0x9DE0(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x9ED0(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x9EF8(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x9FA8(0x00A0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0xA048(0x0050)()
	uint8                                         Pad_A098[0x8];                                     // 0xA098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AimOffset                    AnimGraphNode_AimOffset_1;                         // 0xA0A0(0x0200)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0xA2A0(0x0020)()
	struct FAnimNode_AimOffset                    AnimGraphNode_AimOffset;                           // 0xA2C0(0x0200)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0xA4C0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0xA4E0(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0xA500(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0xA5A0(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0xA6F8(0x0158)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0xA850(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0xA8F0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0xA918(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0xA960(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0xAA20(0x0028)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_1;            // 0xAA48(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0xAB18(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0xAB98(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0xABC0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0xAC08(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0xACC8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0xACF0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0xAD18(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0xAD60(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0xAE20(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0xAE48(0x0080)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0xAEC8(0x00D0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0xAF98(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0xAFE0(0x00C0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0xB0A0(0x00A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0xB140(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0xB170(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0xB198(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0xB1C0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0xB1E8(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0xB218(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0xB300(0x00A0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0xB3A0(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0xB488(0x00A0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0xB528(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0xB610(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0xB640(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0xB6C0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0xB6F0(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0xB7A0(0x0158)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0xB8F8(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0xB928(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0xB970(0x0030)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_5;                   // 0xB9A0(0x00B0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_4;                   // 0xBA50(0x00B0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_3;                   // 0xBB00(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0xBBB0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0xBD08(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0xBD30(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0xBE88(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0xBEB0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0xBED8(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0xBF00(0x00B0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0xBFB0(0x00B0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0xC060(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0xC110(0x0048)()
	class UAnimSequence*                          TransitionPose_Shoot_Base;                         // 0xC158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERecoilCorrectionType                         RecoilCorrectionType;                              // 0xC160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C161[0x7];                                     // 0xC161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            SkillFullBodyAimOffset;                            // 0xC168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FullSkillAddLHandLayerWeight;                      // 0xC170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         基础动作混合时间;                                  // 0xC174(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNewSpine;                                        // 0xC178(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bOverFire;                                         // 0xC179(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C17A[0x6];                                     // 0xC17A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          OverFirePose;                                      // 0xC180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void LowerBody(const struct FPoseLink& LowerBaseLoco, const struct FPoseLink& LowerSkill, struct FPoseLink* LowerBody_0);
	void Skill(const struct FPoseLink& InputLocomotion, struct FPoseLink* Skill_0);
	void Aim(const struct FPoseLink& InPose, struct FPoseLink* Aim_0);
	void Locomotion(struct FPoseLink* Locomotion_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPCBase_AnimGraphNode_BlendListByBool_428951B148AF9A74E58535A488F2BC76();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPCBase_AnimGraphNode_BlendListByBool_FDD627174DE42C401DECA6BC63488D97();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPCBase_AnimGraphNode_BlendListByBool_078740CA4B7E26F33C959D81F9C4D8EE();
