#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon110_WP01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Mon110_WP01.ABP_Mon110_WP01_C
// 0x0100 (0x03C0 - 0x02C0)
class UABP_Mon110_WP01_C final : public UAnimInstance_AccessoryBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x02F8(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0378(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ABP_Mon110_WP01(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Mon110_WP01_C">();
	}
	static class UABP_Mon110_WP01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Mon110_WP01_C>();
	}
};
static_assert(alignof(UABP_Mon110_WP01_C) == 0x000010, "Wrong alignment on UABP_Mon110_WP01_C");
static_assert(sizeof(UABP_Mon110_WP01_C) == 0x0003C0, "Wrong size on UABP_Mon110_WP01_C");
static_assert(offsetof(UABP_Mon110_WP01_C, UberGraphFrame) == 0x0002C0, "Member 'UABP_Mon110_WP01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Mon110_WP01_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UABP_Mon110_WP01_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Mon110_WP01_C, AnimGraphNode_SequencePlayer) == 0x0002F8, "Member 'UABP_Mon110_WP01_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon110_WP01_C, AnimGraphNode_Slot) == 0x000378, "Member 'UABP_Mon110_WP01_C::AnimGraphNode_Slot' has a wrong offset!");

}

