#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon_110_Main

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Mon_110_Main.ABP_Mon_110_Main_C
// 0x1670 (0x1C40 - 0x05D0)
class UABP_Mon_110_Main_C final : public UAnimInstance_Humanoid
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x05D8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x0608(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0720(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0750(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0868(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0898(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x09B0(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x09E0(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0B38(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x0C90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0CB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0CE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0D08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0D30(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0D58(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0DD8(0x0030)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x0E08(0x0190)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x0F98(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x1038(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x1080(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x10C8(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x1188(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x11D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x11F8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1220(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1250(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x12D0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x12F8(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1398(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x13E0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1410(0x00B0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x14C0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x14E0(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x1500(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x16B0(0x0158)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x1808(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x18B8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x18E0(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1980(0x0028)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x19A8(0x00A0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x1A48(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1AE8(0x00A0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x1B88(0x00B0)()
	bool                                          bNeedAimming;                                      // 0x1C38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void HitAddtiveLayer(const struct FPoseLink& HitInputPose, struct FPoseLink* HitAddtiveLayer_0);
	void CurveDataLayer(const struct FPoseLink& CurveInputPose, struct FPoseLink* CurveDataLayer_0);
	void GroundIKLayer(const struct FPoseLink& GroundIkInputPose, struct FPoseLink* GroundIKLayer_0);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_110_Main_AnimGraphNode_BlendListByBool_A1F569F94B4D877210D9819CC1671A41();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_110_Main_AnimGraphNode_SequencePlayer_7C572D1945F9B86F7370239554EC9146();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_110_Main_AnimGraphNode_TransitionResult_EAC041524CCFF7C2F3E2B1AF96176D95();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_110_Main_AnimGraphNode_TransitionResult_B2FDD2524B7C8B6DA99ABCA9F2B4ACC8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_110_Main_AnimGraphNode_TransitionResult_FC0840F541F878AC5567F8B76018AE02();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_110_Main_AnimGraphNode_TransitionResult_DF3697E84F027483C799368B4AF19BD4();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_Mon_110_Main(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Mon_110_Main_C">();
	}
	static class UABP_Mon_110_Main_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Mon_110_Main_C>();
	}
};
static_assert(alignof(UABP_Mon_110_Main_C) == 0x000010, "Wrong alignment on UABP_Mon_110_Main_C");
static_assert(sizeof(UABP_Mon_110_Main_C) == 0x001C40, "Wrong size on UABP_Mon_110_Main_C");
static_assert(offsetof(UABP_Mon_110_Main_C, UberGraphFrame) == 0x0005D0, "Member 'UABP_Mon_110_Main_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_Root_3) == 0x0005D8, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_LinkedInputPose_2) == 0x000608, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_Root_2) == 0x000720, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_LinkedInputPose_1) == 0x000750, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_Root_1) == 0x000868, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_LinkedInputPose) == 0x000898, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_Root) == 0x0009B0, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_SaveCachedPose_2) == 0x0009E0, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_SaveCachedPose_1) == 0x000B38, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_UseCachedPose_5) == 0x000C90, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_TransitionResult_3) == 0x000CB8, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_TransitionResult_2) == 0x000CE0, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_TransitionResult_1) == 0x000D08, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_TransitionResult) == 0x000D30, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_SequencePlayer_1) == 0x000D58, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_StateResult_2) == 0x000DD8, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x000E08, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_BlendListByBool_3) == 0x000F98, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_Slot_3) == 0x001038, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_Slot_2) == 0x001080, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_LayeredBoneBlend) == 0x0010C8, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_Slot_1) == 0x001188, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_UseCachedPose_4) == 0x0011D0, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_UseCachedPose_3) == 0x0011F8, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_StateResult_1) == 0x001220, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_SequencePlayer) == 0x001250, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_UseCachedPose_2) == 0x0012D0, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_BlendListByBool_2) == 0x0012F8, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_Slot) == 0x001398, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_StateResult) == 0x0013E0, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_StateMachine) == 0x001410, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_LocalToComponentSpace) == 0x0014C0, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_ComponentToLocalSpace) == 0x0014E0, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_LookAt) == 0x001500, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_SaveCachedPose) == 0x0016B0, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_LinkedAnimLayer_1) == 0x001808, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_LinkedAnimLayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_UseCachedPose_1) == 0x0018B8, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_BlendListByBool_1) == 0x0018E0, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_UseCachedPose) == 0x001980, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_LinkedAnimGraph_1) == 0x0019A8, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_LinkedAnimGraph_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_LinkedAnimGraph) == 0x001A48, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_BlendListByBool) == 0x001AE8, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, AnimGraphNode_LinkedAnimLayer) == 0x001B88, "Member 'UABP_Mon_110_Main_C::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Main_C, bNeedAimming) == 0x001C38, "Member 'UABP_Mon_110_Main_C::bNeedAimming' has a wrong offset!");

}

