#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon_005_Main

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Mon_005_Main.ABP_Mon_005_Main_C
// 0x16A0 (0x1C70 - 0x05D0)
class UABP_Mon_005_Main_C final : public UAnimInstance_Humanoid
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x05D8(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x06F0(0x0030)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0720(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0740(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x0760(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x0910(0x0158)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x0A68(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x0B18(0x0028)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x0B40(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0BE0(0x0158)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x0D38(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x0DE8(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x0E88(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0EB0(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0F50(0x0158)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x10A8(0x00A0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x1148(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x1170(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x1198(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x11C0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x11E8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x1230(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1258(0x00A0)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x12F8(0x0190)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x1488(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x1548(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x1590(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x15D8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1600(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1628(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1658(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x16D8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1708(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1788(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x17B0(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1850(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1898(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x18C8(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1978(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x19A0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x19D0(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1AE8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1B18(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1C30(0x0030)()
	bool                                          bUpperBodyAimming;                                 // 0x1C60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void HitAddtiveLayer(const struct FPoseLink& HitInputPose, struct FPoseLink* HitAddtiveLayer_0);
	void CurveDataLayer(const struct FPoseLink& CurveInputPose, struct FPoseLink* CurveDataLayer_0);
	void GroundIKLayer(const struct FPoseLink& GroundIkInputPose, struct FPoseLink* GroundIKLayer_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_005_Main_AnimGraphNode_TransitionResult_7A91EC534AEEF5D77ADE3885416DC5EE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_005_Main_AnimGraphNode_TransitionResult_2529B9D24853354FD43E299608A30390();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_005_Main_AnimGraphNode_TransitionResult_463ADEF64D6ED03F52F1CFB848B2EA13();
	void ExecuteUbergraph_ABP_Mon_005_Main(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_005_Main_AnimGraphNode_SequencePlayer_09837E9247BC00A9717D6D9F23C34D5C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_005_Main_AnimGraphNode_TransitionResult_0CB9CFB2450C111764CDB991ABEE00DB();
	void BlueprintUpdateAnimation(float DeltaTimeX);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Mon_005_Main_C">();
	}
	static class UABP_Mon_005_Main_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Mon_005_Main_C>();
	}
};
static_assert(alignof(UABP_Mon_005_Main_C) == 0x000010, "Wrong alignment on UABP_Mon_005_Main_C");
static_assert(sizeof(UABP_Mon_005_Main_C) == 0x001C70, "Wrong size on UABP_Mon_005_Main_C");
static_assert(offsetof(UABP_Mon_005_Main_C, UberGraphFrame) == 0x0005D0, "Member 'UABP_Mon_005_Main_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_LinkedInputPose_2) == 0x0005D8, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_Root_3) == 0x0006F0, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_LocalToComponentSpace) == 0x000720, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_ComponentToLocalSpace) == 0x000740, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_LookAt) == 0x000760, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_SaveCachedPose_2) == 0x000910, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_LinkedAnimLayer_1) == 0x000A68, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_LinkedAnimLayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_UseCachedPose_6) == 0x000B18, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_LinkedAnimGraph_1) == 0x000B40, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_LinkedAnimGraph_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_SaveCachedPose_1) == 0x000BE0, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_LinkedAnimLayer) == 0x000D38, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_BlendListByBool_3) == 0x000DE8, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_UseCachedPose_5) == 0x000E88, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_BlendListByBool_2) == 0x000EB0, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_SaveCachedPose) == 0x000F50, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_LinkedAnimGraph) == 0x0010A8, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_TransitionResult_3) == 0x001148, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_TransitionResult_2) == 0x001170, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_TransitionResult_1) == 0x001198, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_TransitionResult) == 0x0011C0, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_Slot_3) == 0x0011E8, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_UseCachedPose_4) == 0x001230, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_BlendListByBool_1) == 0x001258, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x0012F8, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_LayeredBoneBlend) == 0x001488, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_Slot_2) == 0x001548, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_Slot_1) == 0x001590, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_UseCachedPose_3) == 0x0015D8, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_UseCachedPose_2) == 0x001600, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_StateResult_2) == 0x001628, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_SequencePlayer_1) == 0x001658, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_StateResult_1) == 0x0016D8, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_SequencePlayer) == 0x001708, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_UseCachedPose_1) == 0x001788, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_BlendListByBool) == 0x0017B0, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_Slot) == 0x001850, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_StateResult) == 0x001898, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_StateMachine) == 0x0018C8, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_UseCachedPose) == 0x001978, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_Root_2) == 0x0019A0, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_LinkedInputPose_1) == 0x0019D0, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_Root_1) == 0x001AE8, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_LinkedInputPose) == 0x001B18, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, AnimGraphNode_Root) == 0x001C30, "Member 'UABP_Mon_005_Main_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Mon_005_Main_C, bUpperBodyAimming) == 0x001C60, "Member 'UABP_Mon_005_Main_C::bUpperBodyAimming' has a wrong offset!");

}

