#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon_006_Main

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function ABP_Mon_006_Main.ABP_Mon_006_Main_C.ExecuteUbergraph_ABP_Mon_006_Main
// 0x0220 (0x0220 - 0x0000)
struct ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FApplyDamageResultData& DamageResultData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBaseMovementComponent*                 K2Node_DynamicCast_AsBase_Movement_Component;      // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue_1;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_GetIdleAnim_ReturnValue;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue_2;                    // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInFightState_ReturnValue;               // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77[0x1];                                       // 0x0077(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_1;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseMonster_C*                         K2Node_DynamicCast_AsBase_Monster;                 // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FApplyDamageResultData                 K2Node_CustomEvent_DamageResultData;               // 0x0098(0x00B8)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter_C*                       K2Node_DynamicCast_AsBase_Character;               // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetWeaponType_ReturnValue;                // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAlive_ReturnValue_3;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_173[0x1];                                      // 0x0173(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x01A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_1;         // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInFightState_ReturnValue_1;             // 0x01EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_2;      // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DotProduct2D_ReturnValue;                 // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DotProduct2D_ReturnValue_1;               // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue;                      // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue_1;                    // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main) == 0x000008, "Wrong alignment on ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main");
static_assert(sizeof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main) == 0x000220, "Wrong size on ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, EntryPoint) == 0x000000, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_IsAlive_ReturnValue) == 0x000014, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_IsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, K2Node_Event_DeltaTimeX) == 0x000018, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_BreakRotator_Roll) == 0x00001C, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_BreakRotator_Pitch) == 0x000020, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_BreakRotator_Yaw) == 0x000024, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000028, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000030, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_MakeRotator_ReturnValue) == 0x000038, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_IsValid_ReturnValue_1) == 0x000045, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_GetMovementComponent_ReturnValue) == 0x000048, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, K2Node_DynamicCast_AsBase_Movement_Component) == 0x000050, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::K2Node_DynamicCast_AsBase_Movement_Component' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_IsAlive_ReturnValue_1) == 0x000059, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_IsAlive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_Not_PreBool_ReturnValue) == 0x00005A, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_VSize_ReturnValue) == 0x00005C, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_Less_FloatFloat_ReturnValue) == 0x000060, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_GetIdleAnim_ReturnValue) == 0x000068, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_GetIdleAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_Not_PreBool_ReturnValue_1) == 0x000070, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_BooleanAND_ReturnValue) == 0x000071, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_Not_PreBool_ReturnValue_2) == 0x000072, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_BooleanAND_ReturnValue_1) == 0x000073, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_IsAlive_ReturnValue_2) == 0x000074, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_IsAlive_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_IsInFightState_ReturnValue) == 0x000075, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_IsInFightState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_Not_PreBool_ReturnValue_3) == 0x000076, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_TryGetPawnOwner_ReturnValue_1) == 0x000078, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_TryGetPawnOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_BooleanAND_ReturnValue_2) == 0x000080, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, K2Node_DynamicCast_AsBase_Monster) == 0x000088, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::K2Node_DynamicCast_AsBase_Monster' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, K2Node_CustomEvent_DamageResultData) == 0x000098, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::K2Node_CustomEvent_DamageResultData' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000150, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_GetOwner_ReturnValue) == 0x000158, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, K2Node_DynamicCast_AsBase_Character) == 0x000160, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::K2Node_DynamicCast_AsBase_Character' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, K2Node_DynamicCast_bSuccess_2) == 0x000168, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_GetWeaponType_ReturnValue) == 0x00016C, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_GetWeaponType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_IsAlive_ReturnValue_3) == 0x000170, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_IsAlive_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_Not_PreBool_ReturnValue_4) == 0x000171, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, K2Node_SwitchInteger_CmpSuccess) == 0x000172, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_GetRightVector_ReturnValue) == 0x000174, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_Conv_FloatToString_ReturnValue) == 0x000180, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000190, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_GetForwardVector_ReturnValue) == 0x000198, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_Conv_VectorToVector2D_ReturnValue_1) == 0x0001A4, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_Conv_VectorToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_Conv_FloatToString_ReturnValue_1) == 0x0001B0, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_Conv_FloatToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_Concat_StrStr_ReturnValue) == 0x0001C0, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0001D0, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0001D8, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0001E8, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x0001E9, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x0001EA, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_IsInFightState_ReturnValue_1) == 0x0001EB, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_IsInFightState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_BooleanAND_ReturnValue_3) == 0x0001EC, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001F0, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_Normal_ReturnValue) == 0x0001FC, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_Conv_VectorToVector2D_ReturnValue_2) == 0x000208, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_Conv_VectorToVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_DotProduct2D_ReturnValue) == 0x000210, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_DotProduct2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_DotProduct2D_ReturnValue_1) == 0x000214, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_DotProduct2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_DegAcos_ReturnValue) == 0x000218, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main, CallFunc_DegAcos_ReturnValue_1) == 0x00021C, "Member 'ABP_Mon_006_Main_C_ExecuteUbergraph_ABP_Mon_006_Main::CallFunc_DegAcos_ReturnValue_1' has a wrong offset!");

// Function ABP_Mon_006_Main.ABP_Mon_006_Main_C.OnReceiveDamage_ܚ_0
// 0x00B8 (0x00B8 - 0x0000)
struct ABP_Mon_006_Main_C_OnReceiveDamage____0 final
{
public:
	struct FApplyDamageResultData                 DamageResultData;                                  // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(ABP_Mon_006_Main_C_OnReceiveDamage____0) == 0x000008, "Wrong alignment on ABP_Mon_006_Main_C_OnReceiveDamage____0");
static_assert(sizeof(ABP_Mon_006_Main_C_OnReceiveDamage____0) == 0x0000B8, "Wrong size on ABP_Mon_006_Main_C_OnReceiveDamage____0");
static_assert(offsetof(ABP_Mon_006_Main_C_OnReceiveDamage____0, DamageResultData) == 0x000000, "Member 'ABP_Mon_006_Main_C_OnReceiveDamage____0::DamageResultData' has a wrong offset!");

// Function ABP_Mon_006_Main.ABP_Mon_006_Main_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Mon_006_Main_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Mon_006_Main_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Mon_006_Main_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Mon_006_Main_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Mon_006_Main_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Mon_006_Main_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Mon_006_Main_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Mon_006_Main.ABP_Mon_006_Main_C.SwitchHitType
// 0x0028 (0x0028 - 0x0000)
struct ABP_Mon_006_Main_C_SwitchHitType final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Condition;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Condition2;                                        // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter_C*                       K2Node_DynamicCast_AsBase_Character;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetWeaponType_ReturnValue;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_Mon_006_Main_C_SwitchHitType) == 0x000008, "Wrong alignment on ABP_Mon_006_Main_C_SwitchHitType");
static_assert(sizeof(ABP_Mon_006_Main_C_SwitchHitType) == 0x000028, "Wrong size on ABP_Mon_006_Main_C_SwitchHitType");
static_assert(offsetof(ABP_Mon_006_Main_C_SwitchHitType, Object) == 0x000000, "Member 'ABP_Mon_006_Main_C_SwitchHitType::Object' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_SwitchHitType, Condition) == 0x000008, "Member 'ABP_Mon_006_Main_C_SwitchHitType::Condition' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_SwitchHitType, Condition2) == 0x000009, "Member 'ABP_Mon_006_Main_C_SwitchHitType::Condition2' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_SwitchHitType, K2Node_DynamicCast_AsBase_Character) == 0x000010, "Member 'ABP_Mon_006_Main_C_SwitchHitType::K2Node_DynamicCast_AsBase_Character' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_SwitchHitType, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ABP_Mon_006_Main_C_SwitchHitType::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_SwitchHitType, CallFunc_GetWeaponType_ReturnValue) == 0x00001C, "Member 'ABP_Mon_006_Main_C_SwitchHitType::CallFunc_GetWeaponType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_SwitchHitType, K2Node_SwitchInteger_CmpSuccess) == 0x000020, "Member 'ABP_Mon_006_Main_C_SwitchHitType::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function ABP_Mon_006_Main.ABP_Mon_006_Main_C.HitDirectionChoose
// 0x00B0 (0x00B0 - 0x0000)
struct ABP_Mon_006_Main_C_HitDirectionChoose final
{
public:
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_1;         // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_2;      // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DotProduct2D_ReturnValue;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DotProduct2D_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue;                      // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue_1;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Mon_006_Main_C_HitDirectionChoose) == 0x000008, "Wrong alignment on ABP_Mon_006_Main_C_HitDirectionChoose");
static_assert(sizeof(ABP_Mon_006_Main_C_HitDirectionChoose) == 0x0000B0, "Wrong size on ABP_Mon_006_Main_C_HitDirectionChoose");
static_assert(offsetof(ABP_Mon_006_Main_C_HitDirectionChoose, CallFunc_GetRightVector_ReturnValue) == 0x000000, "Member 'ABP_Mon_006_Main_C_HitDirectionChoose::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_HitDirectionChoose, CallFunc_Conv_FloatToString_ReturnValue) == 0x000010, "Member 'ABP_Mon_006_Main_C_HitDirectionChoose::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_HitDirectionChoose, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000020, "Member 'ABP_Mon_006_Main_C_HitDirectionChoose::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_HitDirectionChoose, CallFunc_GetForwardVector_ReturnValue) == 0x000028, "Member 'ABP_Mon_006_Main_C_HitDirectionChoose::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_HitDirectionChoose, CallFunc_Conv_VectorToVector2D_ReturnValue_1) == 0x000034, "Member 'ABP_Mon_006_Main_C_HitDirectionChoose::CallFunc_Conv_VectorToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_HitDirectionChoose, CallFunc_Conv_FloatToString_ReturnValue_1) == 0x000040, "Member 'ABP_Mon_006_Main_C_HitDirectionChoose::CallFunc_Conv_FloatToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_HitDirectionChoose, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'ABP_Mon_006_Main_C_HitDirectionChoose::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_HitDirectionChoose, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000060, "Member 'ABP_Mon_006_Main_C_HitDirectionChoose::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_HitDirectionChoose, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000068, "Member 'ABP_Mon_006_Main_C_HitDirectionChoose::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_HitDirectionChoose, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000078, "Member 'ABP_Mon_006_Main_C_HitDirectionChoose::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_HitDirectionChoose, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000079, "Member 'ABP_Mon_006_Main_C_HitDirectionChoose::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_HitDirectionChoose, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x00007A, "Member 'ABP_Mon_006_Main_C_HitDirectionChoose::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_HitDirectionChoose, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00007C, "Member 'ABP_Mon_006_Main_C_HitDirectionChoose::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_HitDirectionChoose, CallFunc_Normal_ReturnValue) == 0x000088, "Member 'ABP_Mon_006_Main_C_HitDirectionChoose::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_HitDirectionChoose, CallFunc_Conv_VectorToVector2D_ReturnValue_2) == 0x000094, "Member 'ABP_Mon_006_Main_C_HitDirectionChoose::CallFunc_Conv_VectorToVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_HitDirectionChoose, CallFunc_DotProduct2D_ReturnValue) == 0x00009C, "Member 'ABP_Mon_006_Main_C_HitDirectionChoose::CallFunc_DotProduct2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_HitDirectionChoose, CallFunc_DotProduct2D_ReturnValue_1) == 0x0000A0, "Member 'ABP_Mon_006_Main_C_HitDirectionChoose::CallFunc_DotProduct2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_HitDirectionChoose, CallFunc_DegAcos_ReturnValue) == 0x0000A4, "Member 'ABP_Mon_006_Main_C_HitDirectionChoose::CallFunc_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_HitDirectionChoose, CallFunc_DegAcos_ReturnValue_1) == 0x0000A8, "Member 'ABP_Mon_006_Main_C_HitDirectionChoose::CallFunc_DegAcos_ReturnValue_1' has a wrong offset!");

// Function ABP_Mon_006_Main.ABP_Mon_006_Main_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Mon_006_Main_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Mon_006_Main_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Mon_006_Main_C_AnimGraph");
static_assert(sizeof(ABP_Mon_006_Main_C_AnimGraph) == 0x000010, "Wrong size on ABP_Mon_006_Main_C_AnimGraph");
static_assert(offsetof(ABP_Mon_006_Main_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Mon_006_Main_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Mon_006_Main.ABP_Mon_006_Main_C.GroundIKLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_Mon_006_Main_C_GroundIKLayer final
{
public:
	struct FPoseLink                              GroundIkInputPose;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              GroundIKLayer_0;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Mon_006_Main_C_GroundIKLayer) == 0x000008, "Wrong alignment on ABP_Mon_006_Main_C_GroundIKLayer");
static_assert(sizeof(ABP_Mon_006_Main_C_GroundIKLayer) == 0x000020, "Wrong size on ABP_Mon_006_Main_C_GroundIKLayer");
static_assert(offsetof(ABP_Mon_006_Main_C_GroundIKLayer, GroundIkInputPose) == 0x000000, "Member 'ABP_Mon_006_Main_C_GroundIKLayer::GroundIkInputPose' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_GroundIKLayer, GroundIKLayer_0) == 0x000010, "Member 'ABP_Mon_006_Main_C_GroundIKLayer::GroundIKLayer_0' has a wrong offset!");

// Function ABP_Mon_006_Main.ABP_Mon_006_Main_C.CurveDataLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_Mon_006_Main_C_CurveDataLayer final
{
public:
	struct FPoseLink                              CurveInputPose;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              CurveDataLayer_0;                                  // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Mon_006_Main_C_CurveDataLayer) == 0x000008, "Wrong alignment on ABP_Mon_006_Main_C_CurveDataLayer");
static_assert(sizeof(ABP_Mon_006_Main_C_CurveDataLayer) == 0x000020, "Wrong size on ABP_Mon_006_Main_C_CurveDataLayer");
static_assert(offsetof(ABP_Mon_006_Main_C_CurveDataLayer, CurveInputPose) == 0x000000, "Member 'ABP_Mon_006_Main_C_CurveDataLayer::CurveInputPose' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_CurveDataLayer, CurveDataLayer_0) == 0x000010, "Member 'ABP_Mon_006_Main_C_CurveDataLayer::CurveDataLayer_0' has a wrong offset!");

// Function ABP_Mon_006_Main.ABP_Mon_006_Main_C.HitAddtiveLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_Mon_006_Main_C_HitAddtiveLayer final
{
public:
	struct FPoseLink                              HitInputPose;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              HitAddtiveLayer_0;                                 // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Mon_006_Main_C_HitAddtiveLayer) == 0x000008, "Wrong alignment on ABP_Mon_006_Main_C_HitAddtiveLayer");
static_assert(sizeof(ABP_Mon_006_Main_C_HitAddtiveLayer) == 0x000020, "Wrong size on ABP_Mon_006_Main_C_HitAddtiveLayer");
static_assert(offsetof(ABP_Mon_006_Main_C_HitAddtiveLayer, HitInputPose) == 0x000000, "Member 'ABP_Mon_006_Main_C_HitAddtiveLayer::HitInputPose' has a wrong offset!");
static_assert(offsetof(ABP_Mon_006_Main_C_HitAddtiveLayer, HitAddtiveLayer_0) == 0x000010, "Member 'ABP_Mon_006_Main_C_HitAddtiveLayer::HitAddtiveLayer_0' has a wrong offset!");

}

