#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon_113_Prop01

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Mon_113_Prop01.ABP_Mon_113_Prop01_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Mon_113_Prop01_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Mon_113_Prop01_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Mon_113_Prop01_C_AnimGraph");
static_assert(sizeof(ABP_Mon_113_Prop01_C_AnimGraph) == 0x000010, "Wrong size on ABP_Mon_113_Prop01_C_AnimGraph");
static_assert(offsetof(ABP_Mon_113_Prop01_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Mon_113_Prop01_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Mon_113_Prop01.ABP_Mon_113_Prop01_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Mon_113_Prop01_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Mon_113_Prop01_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Mon_113_Prop01_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Mon_113_Prop01_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Mon_113_Prop01_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Mon_113_Prop01_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Mon_113_Prop01_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Mon_113_Prop01.ABP_Mon_113_Prop01_C.ExecuteUbergraph_ABP_Mon_113_Prop01
// 0x0014 (0x0014 - 0x0000)
struct ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInFightState_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue_1;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue_2;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInFightState_ReturnValue_1;             // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue_3;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01) == 0x000004, "Wrong alignment on ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01");
static_assert(sizeof(ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01) == 0x000014, "Wrong size on ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01");
static_assert(offsetof(ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01, EntryPoint) == 0x000000, "Member 'ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01, CallFunc_IsInFightState_ReturnValue) == 0x000004, "Member 'ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01::CallFunc_IsInFightState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01, CallFunc_IsAlive_ReturnValue) == 0x000005, "Member 'ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01::CallFunc_IsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01, CallFunc_IsAlive_ReturnValue_1) == 0x000006, "Member 'ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01::CallFunc_IsAlive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01, CallFunc_Not_PreBool_ReturnValue) == 0x000007, "Member 'ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01, CallFunc_BooleanAND_ReturnValue) == 0x000008, "Member 'ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01, CallFunc_IsAlive_ReturnValue_2) == 0x000009, "Member 'ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01::CallFunc_IsAlive_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01, CallFunc_IsInFightState_ReturnValue_1) == 0x00000A, "Member 'ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01::CallFunc_IsInFightState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01, CallFunc_IsAlive_ReturnValue_3) == 0x00000B, "Member 'ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01::CallFunc_IsAlive_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01, CallFunc_Not_PreBool_ReturnValue_1) == 0x00000C, "Member 'ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01, CallFunc_Not_PreBool_ReturnValue_2) == 0x00000D, "Member 'ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01, CallFunc_BooleanAND_ReturnValue_1) == 0x00000E, "Member 'ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01, K2Node_Event_DeltaTimeX) == 0x000010, "Member 'ABP_Mon_113_Prop01_C_ExecuteUbergraph_ABP_Mon_113_Prop01::K2Node_Event_DeltaTimeX' has a wrong offset!");

}

