#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_GirlBase

#include "Basic.hpp"

#include "Game_classes.hpp"
#include "Engine_structs.hpp"
#include "SeasunAnimGraph_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_GirlBase.ABP_GirlBase_C
// 0x1A000 (0x1BDD0 - 0x1DD0)
class UABP_GirlBase_C : public UGameCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1DD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_145;                   // 0x1DD8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_27;                 // 0x1E00(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_144;                   // 0x1EC0(0x0028)()
	struct FAnimNode_CurveSequenceSlot            AnimGraphNode_CurveSequenceSlot_2;                 // 0x1EE8(0x0038)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_53;                   // 0x1F20(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_143;                   // 0x2078(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_34;                             // 0x20A0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_142;                   // 0x20E8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_33;                             // 0x2110(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_141;                   // 0x2158(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_20;                      // 0x2180(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_92;                  // 0x2248(0x00A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_35;            // 0x22E8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_38;            // 0x2308(0x0020)()
	struct FAnimNode_SkeletalRotateSpine          AnimGraphNode_SkeletalRotateSpine_3;               // 0x2328(0x0110)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_91;                  // 0x2438(0x00A0)()
	struct FAnimNode_SkeletalRotateSpine          AnimGraphNode_SkeletalRotateSpine_2;               // 0x24D8(0x0110)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_37;            // 0x25E8(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_52;                   // 0x2608(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_140;                   // 0x2760(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x2788(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x27B8(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_51;                   // 0x28D0(0x0158)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_29;                       // 0x2A28(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_34;            // 0x2B30(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_139;                   // 0x2B50(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_36;            // 0x2B78(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_90;                  // 0x2B98(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_35;            // 0x2C38(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_138;                   // 0x2C58(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_28;                       // 0x2C80(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_33;            // 0x2D88(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_137;                   // 0x2DA8(0x0028)()
	struct FAnimNode_SkeletalRotateSpine          AnimGraphNode_SkeletalRotateSpine_1;               // 0x2DD0(0x0110)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_34;            // 0x2EE0(0x0020)()
	struct FAnimNode_SkeletalRotateSpine          AnimGraphNode_SkeletalRotateSpine;                 // 0x2F00(0x0110)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_89;                  // 0x3010(0x00A0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_7;                   // 0x30B0(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_50;                   // 0x3160(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_136;                   // 0x32B8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_88;                  // 0x32E0(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_87;                  // 0x3380(0x00A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_32;            // 0x3420(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_31;            // 0x3440(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_33;            // 0x3460(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_135;                   // 0x3480(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_27;                       // 0x34A8(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_134;                   // 0x35B0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_86;                  // 0x35D8(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_133;                   // 0x3678(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_132;                   // 0x36A0(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x36C8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x36F8(0x0118)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x3810(0x0118)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_131;                   // 0x3928(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_49;                   // 0x3950(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_48;                   // 0x3AA8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_130;                   // 0x3C00(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_26;                 // 0x3C28(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_47;                   // 0x3CE8(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_46;                   // 0x3E40(0x0158)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_85;                  // 0x3F98(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_129;                   // 0x4038(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_45;                   // 0x4060(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_128;                   // 0x41B8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_127;                   // 0x41E0(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_25;                 // 0x4208(0x00C0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_84;                  // 0x42C8(0x00A0)()
	struct FAnimNode_UpperBodyMatchingUnder       AnimGraphNode_UpperBodyMatchingUnder;              // 0x4368(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_126;                   // 0x43F0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_125;                   // 0x4418(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_3;                      // 0x4440(0x0018)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5;                     // 0x4458(0x00C8)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_6;                   // 0x4520(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_83;                  // 0x45D0(0x00A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_30;            // 0x4670(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_24;                 // 0x4690(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_124;                   // 0x4750(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_32;            // 0x4778(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_123;                   // 0x4798(0x0028)()
	struct FAnimNode_SpeedWarping_UpperBody       AnimGraphNode_SpeedWarping_UpperBody;              // 0x47C0(0x0190)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_44;                   // 0x4950(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_32;                             // 0x4AA8(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_2;                      // 0x4AF0(0x0018)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_31;                             // 0x4B08(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_43;                   // 0x4B50(0x0158)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_1;                      // 0x4CA8(0x0018)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_30;                             // 0x4CC0(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose;                        // 0x4D08(0x0018)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_29;                             // 0x4D20(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_42;                   // 0x4D68(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_41;                   // 0x4EC0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_122;                   // 0x5018(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_121;                   // 0x5040(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_120;                   // 0x5068(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_119;                   // 0x5090(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_82;                  // 0x50B8(0x00A0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x5158(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_5;                  // 0x5220(0x00E8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_28;                             // 0x5308(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_118;                   // 0x5350(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_117;                   // 0x5378(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_4;                  // 0x53A0(0x00E8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x5488(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_40;                   // 0x5550(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_116;                   // 0x56A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_115;                   // 0x56D0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_81;                  // 0x56F8(0x00A0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x5798(0x00E8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x5880(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_114;                   // 0x5948(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_27;                             // 0x5970(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x59B8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x59E8(0x0118)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x5B00(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_39;                   // 0x5C18(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_38;                   // 0x5D70(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_113;                   // 0x5EC8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_112;                   // 0x5EF0(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_5;                   // 0x5F18(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_111;                   // 0x5FC8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_110;                   // 0x5FF0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_109;                   // 0x6018(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_108;                   // 0x6040(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_80;                  // 0x6068(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_26;                             // 0x6108(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_29;            // 0x6150(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_31;            // 0x6170(0x0020)()
	struct FAnimNode_SpeedWarping                 AnimGraphNode_SpeedWarping;                        // 0x6190(0x0160)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_37;                   // 0x62F0(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_36;                   // 0x6448(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_107;                   // 0x65A0(0x0028)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x65C8(0x0118)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_106;                   // 0x66E0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_22;                      // 0x6708(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_9;                      // 0x6738(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x67E8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_105;                   // 0x6818(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_25;                             // 0x6840(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_104;                   // 0x6888(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_103;                   // 0x68B0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_79;                  // 0x68D8(0x00A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x6978(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x69A8(0x0118)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x6AC0(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_35;                   // 0x6BD8(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_34;                   // 0x6D30(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_102;                   // 0x6E88(0x0028)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_5;            // 0x6EB0(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_101;                   // 0x6F80(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_5;                 // 0x6FA8(0x0050)()
	struct FAnimNode_LayeredBoneBlendCustomFilter AnimGraphNode_LayerBlendPerBoneCustomFilter;       // 0x6FF8(0x00D8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_58;                   // 0x70D0(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_33;                   // 0x7150(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_100;                   // 0x72A8(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x72D0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x7300(0x0118)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_4;            // 0x7418(0x00D0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_30;            // 0x74E8(0x0020)()
	uint8                                         Pad_7508[0x8];                                     // 0x7508(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AimOffset                    AnimGraphNode_AimOffset_3;                         // 0x7510(0x0200)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_28;            // 0x7710(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_4;                 // 0x7730(0x0050)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_78;                  // 0x7780(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_32;                   // 0x7820(0x0158)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_3;                 // 0x7978(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_99;                    // 0x79C8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_31;                   // 0x79F0(0x0158)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_77;                  // 0x7B48(0x00A0)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_3;            // 0x7BE8(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_76;                  // 0x7CB8(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_98;                    // 0x7D58(0x0028)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x7D80(0x0118)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2;                 // 0x7E98(0x0050)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x7EE8(0x0050)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_75;                  // 0x7F38(0x00A0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x7FD8(0x0050)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_4;                   // 0x8028(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_30;                   // 0x80D8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_97;                    // 0x8230(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_96;                    // 0x8258(0x0028)()
	struct FAnimNode_AimOffset                    AnimGraphNode_AimOffset_2;                         // 0x8280(0x0200)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_27;            // 0x8480(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_29;            // 0x84A0(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_29;                   // 0x84C0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_95;                    // 0x8618(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_94;                    // 0x8640(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_19;                      // 0x8668(0x00C8)()
	struct FAnimNode_BlendWithRefPose             AnimGraphNode_BlendWithRefPose;                    // 0x8730(0x0098)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_18;                      // 0x87C8(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x8890(0x0030)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x88C0(0x0650)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_28;            // 0x8F10(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_93;                    // 0x8F30(0x0028)()
	uint8                                         Pad_8F58[0x8];                                     // 0x8F58(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RecoilSequenceNode           AnimGraphNode_RecoilSequenceNode_1;                // 0x8F60(0x09A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_24;                             // 0x9900(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_28;                   // 0x9948(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_92;                    // 0x9AA0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_91;                    // 0x9AC8(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_3;                   // 0x9AF0(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_74;                  // 0x9BA0(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_57;                   // 0x9C40(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_56;                   // 0x9CC0(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_73;                  // 0x9D40(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_23;                 // 0x9DE0(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_90;                    // 0x9EA0(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2;                   // 0x9EC8(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_72;                  // 0x9F78(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_71;                  // 0xA018(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_22;                 // 0xA0B8(0x00C0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_27;                       // 0xA178(0x00F0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_26;                       // 0xA268(0x00F0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_25;                       // 0xA358(0x00F0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_26;            // 0xA448(0x0020)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_2;            // 0xA468(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_27;                   // 0xA538(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_26;                   // 0xA690(0x0158)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_26;                       // 0xA7E8(0x0108)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_70;                  // 0xA8F0(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_23;                             // 0xA990(0x0048)()
	struct FAnimNode_CurveSequenceSlot            AnimGraphNode_CurveSequenceSlot_1;                 // 0xA9D8(0x0038)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_1;            // 0xAA10(0x00D0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_22;                             // 0xAAE0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_21;                 // 0xAB28(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_89;                    // 0xABE8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_88;                    // 0xAC10(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_25;                   // 0xAC38(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_87;                    // 0xAD90(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_86;                    // 0xADB8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_85;                    // 0xADE0(0x0028)()
	uint8                                         Pad_AE08[0x8];                                     // 0xAE08(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AimOffset                    AnimGraphNode_AimOffset_1;                         // 0xAE10(0x0200)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_21;                             // 0xB010(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_20;                 // 0xB058(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_84;                    // 0xB118(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_24;                   // 0xB140(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_83;                    // 0xB298(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_82;                    // 0xB2C0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_23;                   // 0xB2E8(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_20;                             // 0xB440(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_19;                 // 0xB488(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_81;                    // 0xB548(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_80;                    // 0xB570(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_25;            // 0xB598(0x0020)()
	struct FAnimNode_CurveSequenceSlot            AnimGraphNode_CurveSequenceSlot;                   // 0xB5B8(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_19;                             // 0xB5F0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_22;                   // 0xB638(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_79;                    // 0xB790(0x0028)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_24;                       // 0xB7B8(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_21;                   // 0xB8A8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_78;                    // 0xBA00(0x0028)()
	uint8                                         Pad_BA28[0x8];                                     // 0xBA28(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AimOffset                    AnimGraphNode_AimOffset;                           // 0xBA30(0x0200)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_18;                 // 0xBC30(0x00C0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_27;            // 0xBCF0(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_24;            // 0xBD10(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_20;                   // 0xBD30(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_77;                    // 0xBE88(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_76;                    // 0xBEB0(0x0028)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_23;                       // 0xBED8(0x00F0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_22;                       // 0xBFC8(0x00F0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_21;                       // 0xC0B8(0x00F0)()
	struct FAnimNode_SaveBoneTransform            AnimGraphNode_SaveBoneTransform_1;                 // 0xC1A8(0x0150)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_23;            // 0xC2F8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_26;            // 0xC318(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_18;                             // 0xC338(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_19;                   // 0xC380(0x0158)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_69;                  // 0xC4D8(0x00A0)()
	struct FAnimNode_SaveBoneTransform            AnimGraphNode_SaveBoneTransform;                   // 0xC578(0x0150)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_25;            // 0xC6C8(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_68;                  // 0xC6E8(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_24;            // 0xC788(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_75;                    // 0xC7A8(0x0028)()
	struct FAnimNode_RotationWarping              AnimGraphNode_RotationWarping;                     // 0xC7D0(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_74;                    // 0xC820(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_67;                  // 0xC848(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_73;                    // 0xC8E8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_66;                  // 0xC910(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_72;                    // 0xC9B0(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_22;            // 0xC9D8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_25;                       // 0xC9F8(0x0108)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_17;                             // 0xCB00(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_17;                 // 0xCB48(0x00C0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_24;                       // 0xCC08(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_21;            // 0xCD10(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_23;            // 0xCD30(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_23;                       // 0xCD50(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_20;            // 0xCE58(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_65;                  // 0xCE78(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_22;            // 0xCF18(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_22;                       // 0xCF38(0x0108)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_64;                  // 0xD040(0x00A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_21;                       // 0xD0E0(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_19;            // 0xD1E8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_21;            // 0xD208(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_20;                       // 0xD228(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_18;            // 0xD330(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_63;                  // 0xD350(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_20;            // 0xD3F0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_71;                    // 0xD410(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_70;                    // 0xD438(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_69;                    // 0xD460(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_68;                    // 0xD488(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_62;                  // 0xD4B0(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_67;                    // 0xD550(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_61;                  // 0xD578(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_66;                    // 0xD618(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_60;                  // 0xD640(0x00A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_19;                       // 0xD6E0(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_17;            // 0xD7E8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_19;            // 0xD808(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_18;                       // 0xD828(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_16;            // 0xD930(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_18;            // 0xD950(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_59;                  // 0xD970(0x00A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_17;                       // 0xDA10(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_15;            // 0xDB18(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_17;            // 0xDB38(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_16;                       // 0xDB58(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_14;            // 0xDC60(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_16;            // 0xDC80(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_58;                  // 0xDCA0(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_15;            // 0xDD40(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_57;                  // 0xDD60(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_56;                  // 0xDE00(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_65;                    // 0xDEA0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_64;                    // 0xDEC8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_63;                    // 0xDEF0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_62;                    // 0xDF18(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_18;                   // 0xDF40(0x0158)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_55;                  // 0xE098(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_17;                   // 0xE138(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_61;                    // 0xE290(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_60;                    // 0xE2B8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_59;                    // 0xE2E0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_16;                             // 0xE308(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_58;                    // 0xE350(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_16;                 // 0xE378(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_57;                    // 0xE438(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_54;                  // 0xE460(0x00A0)()
	struct FAnimNode_RecoilSequenceNode           AnimGraphNode_RecoilSequenceNode;                  // 0xE500(0x09A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_56;                    // 0xEEA0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_55;                    // 0xEEC8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_53;                  // 0xEEF0(0x00A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_15;                       // 0xEF90(0x0108)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_52;                  // 0xF098(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_54;                    // 0xF138(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_16;                   // 0xF160(0x0158)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_51;                  // 0xF2B8(0x00A0)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0xF358(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_55;                   // 0xF428(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_53;                    // 0xF4A8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_15;                   // 0xF4D0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_52;                    // 0xF628(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_51;                    // 0xF650(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_14;                   // 0xF678(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_50;                    // 0xF7D0(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0xF7F8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0xF828(0x0118)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_49;                    // 0xF940(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0xF968(0x00B0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0xFA18(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_13;                   // 0xFAC8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_48;                    // 0xFC20(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_47;                    // 0xFC48(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_14;            // 0xFC70(0x0020)()
	struct FAnimNode_Grounder                     AnimGraphNode_Grounder;                            // 0xFC90(0x0170)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_15;                             // 0xFE00(0x0048)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0xFE48(0x0118)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0xFF60(0x00E8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_13;            // 0x10048(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_46;                    // 0x10068(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_12;                   // 0x10090(0x0158)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x101E8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_45;                    // 0x10218(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_14;                             // 0x10240(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_14;                       // 0x10288(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_12;            // 0x10390(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_13;            // 0x103B0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_13;                       // 0x103D0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_12;                       // 0x104D8(0x0108)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x105E0(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_15;                 // 0x106A8(0x00C0)()
	struct FAnimNode_SkillAim                     AnimGraphNode_SkillAim;                            // 0x10768(0x0310)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_12;            // 0x10A78(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_13;                             // 0x10A98(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_44;                    // 0x10AE0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_11;                   // 0x10B08(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_43;                    // 0x10C60(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_10;                   // 0x10C88(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_12;                             // 0x10DE0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_42;                    // 0x10E28(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_9;                    // 0x10E50(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_11;                             // 0x10FA8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_41;                    // 0x10FF0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8;                    // 0x11018(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_10;                             // 0x11170(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_40;                    // 0x111B8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_39;                    // 0x111E0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_38;                    // 0x11208(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_37;                    // 0x11230(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_36;                    // 0x11258(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_35;                    // 0x11280(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_34;                    // 0x112A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_33;                    // 0x112D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_32;                    // 0x112F8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x11320(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7;                    // 0x11368(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_31;                    // 0x114C0(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x114E8(0x0018)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x11500(0x0118)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_30;                    // 0x11618(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_29;                    // 0x11640(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x11668(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0x116B0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_28;                    // 0x11808(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x11830(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x11878(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x119D0(0x0158)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_50;                  // 0x11B28(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_49;                  // 0x11BC8(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_27;                    // 0x11C68(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_26;                    // 0x11C90(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x11CB8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x11D00(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_14;                 // 0x11D48(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_25;                    // 0x11E08(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_48;                  // 0x11E30(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_24;                    // 0x11ED0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_23;                    // 0x11EF8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_13;                 // 0x11F20(0x00C0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_12;                 // 0x11FE0(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_22;                    // 0x120A0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_47;                  // 0x120C8(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_21;                    // 0x12168(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_20;                    // 0x12190(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_17;                      // 0x121B8(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_46;                  // 0x12280(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_11;                 // 0x12320(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19;                    // 0x123E0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_45;                  // 0x12408(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0x124A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x124D0(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_10;                 // 0x124F8(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x125B8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_44;                  // 0x125E0(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x12680(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x126A8(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x126D0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x12700(0x0118)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_16;                      // 0x12818(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x128E0(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_43;                  // 0x129A8(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x12A48(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x12A70(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_11;            // 0x12B78(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_11;            // 0x12B98(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x12BB8(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_10;            // 0x12CC0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_10;            // 0x12CE0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x12D00(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x12D28(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x12D50(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_9;             // 0x12E58(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_42;                  // 0x12E78(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_9;             // 0x12F18(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x12F38(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8;             // 0x13040(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x13060(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8;             // 0x13088(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_41;                  // 0x130A8(0x00A0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_20;                       // 0x13148(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_40;                  // 0x13238(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x132D8(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x13300(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7;             // 0x13408(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7;             // 0x13428(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x13448(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x13470(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6;             // 0x13578(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_39;                  // 0x13598(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6;             // 0x13638(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_38;                  // 0x13658(0x00A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x136F8(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;             // 0x13800(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;             // 0x13820(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x13840(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x13868(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x13970(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x13990(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x139B8(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_37;                  // 0x139D8(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x13A78(0x0158)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x13BD0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0x13C00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0x13C28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x13C50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0x13C78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x13CA0(0x0028)()
