#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon_111_Main

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Mon_111_Main.ABP_Mon_111_Main_C
// 0x16A0 (0x1C70 - 0x05D0)
class UABP_Mon_111_Main_C final : public UAnimInstance_Humanoid
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x05D8(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x06F0(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x0720(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0878(0x0158)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x09D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x09F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0A20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0A48(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x0A70(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x0AB8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x0AE0(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x0B80(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x0BC8(0x0190)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0D58(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0DA0(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x0E60(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x0E88(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0EB0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0EE0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0F60(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0F90(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0FB8(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1038(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x1080(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1120(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1150(0x00B0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1200(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1220(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x1240(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x13F0(0x0158)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x1548(0x00B0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x15F8(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x16A8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x16D0(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1770(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1798(0x0028)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x17C0(0x00A0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x1860(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1900(0x00A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x19A0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x19D0(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1AE8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1B18(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1C30(0x0030)()
	bool                                          bNeedAimming;                                      // 0x1C60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void HitAddtiveLayer(const struct FPoseLink& HitInputPose, struct FPoseLink* HitAddtiveLayer_0);
	void CurveDataLayer(const struct FPoseLink& CurveInputPose, struct FPoseLink* CurveDataLayer_0);
	void GroundIKLayer(const struct FPoseLink& GroundIkInputPose, struct FPoseLink* GroundIKLayer_0);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_111_Main_AnimGraphNode_BlendListByBool_0B99AF194070D5F0253745B1B7A4692C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_111_Main_AnimGraphNode_SequencePlayer_3AE3D75E47053B62151AC3A5ECAA4DE1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_111_Main_AnimGraphNode_TransitionResult_1B8DCE64482A81104CC5FAB7854A47AF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_111_Main_AnimGraphNode_TransitionResult_999AF04B40D65CE0FEE223BC9D46E779();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_111_Main_AnimGraphNode_TransitionResult_E3D7924543A18BDB26708FAFCC8A0B47();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_111_Main_AnimGraphNode_TransitionResult_8D8014CF4D9638FF166A7F8EADD91437();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_Mon_111_Main(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Mon_111_Main_C">();
	}
	static class UABP_Mon_111_Main_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Mon_111_Main_C>();
	}
};
static_assert(alignof(UABP_Mon_111_Main_C) == 0x000010, "Wrong alignment on UABP_Mon_111_Main_C");
static_assert(sizeof(UABP_Mon_111_Main_C) == 0x001C70, "Wrong size on UABP_Mon_111_Main_C");
static_assert(offsetof(UABP_Mon_111_Main_C, UberGraphFrame) == 0x0005D0, "Member 'UABP_Mon_111_Main_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_LinkedInputPose_2) == 0x0005D8, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_Root_3) == 0x0006F0, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_SaveCachedPose_2) == 0x000720, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_SaveCachedPose_1) == 0x000878, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_TransitionResult_3) == 0x0009D0, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_TransitionResult_2) == 0x0009F8, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_TransitionResult_1) == 0x000A20, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_TransitionResult) == 0x000A48, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_Slot_3) == 0x000A70, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_UseCachedPose_6) == 0x000AB8, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_BlendListByBool_3) == 0x000AE0, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_Slot_2) == 0x000B80, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x000BC8, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_Slot_1) == 0x000D58, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_LayeredBoneBlend) == 0x000DA0, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_UseCachedPose_5) == 0x000E60, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_UseCachedPose_4) == 0x000E88, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_StateResult_2) == 0x000EB0, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_SequencePlayer_1) == 0x000EE0, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_StateResult_1) == 0x000F60, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_UseCachedPose_3) == 0x000F90, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_SequencePlayer) == 0x000FB8, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_Slot) == 0x001038, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_BlendListByBool_2) == 0x001080, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_StateResult) == 0x001120, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_StateMachine) == 0x001150, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_LocalToComponentSpace) == 0x001200, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_ComponentToLocalSpace) == 0x001220, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_LookAt) == 0x001240, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_SaveCachedPose) == 0x0013F0, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_LinkedAnimLayer_1) == 0x001548, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_LinkedAnimLayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_LinkedAnimLayer) == 0x0015F8, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_UseCachedPose_2) == 0x0016A8, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_BlendListByBool_1) == 0x0016D0, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_UseCachedPose_1) == 0x001770, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_UseCachedPose) == 0x001798, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_LinkedAnimGraph_1) == 0x0017C0, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_LinkedAnimGraph_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_LinkedAnimGraph) == 0x001860, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_BlendListByBool) == 0x001900, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_Root_2) == 0x0019A0, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_LinkedInputPose_1) == 0x0019D0, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_Root_1) == 0x001AE8, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_LinkedInputPose) == 0x001B18, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, AnimGraphNode_Root) == 0x001C30, "Member 'UABP_Mon_111_Main_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Mon_111_Main_C, bNeedAimming) == 0x001C60, "Member 'UABP_Mon_111_Main_C::bNeedAimming' has a wrong offset!");

}

