#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_OnlineSea_EnemyShipBase

#include "Basic.hpp"

#include "Game_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_OnlineSea_EnemyShipBase.ABP_OnlineSea_EnemyShipBase_C
// 0x00B0 (0x05D0 - 0x0520)
class UABP_OnlineSea_EnemyShipBase_C final : public UAnimInstanceBase
{
public:
	uint8                                         Pad_518[0x8];                                      // 0x0518(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0528(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0558(0x0048)()
	TMulticastInlineDelegate<void()>              PlayHitAnimation;                                  // 0x05A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              PlayDeadAnimation;                                 // 0x05B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAnimSequenceBase*                      HitAnimation;                                      // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      DeadAnimation;                                     // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void PlayHitAnimationEvent();
	void BlueprintInitializeAnimation();
	void PlayDeadAnimationEvent();
	void ExecuteUbergraph_ABP_OnlineSea_EnemyShipBase(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_OnlineSea_EnemyShipBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_OnlineSea_EnemyShipBase_C")
	}
	static class UABP_OnlineSea_EnemyShipBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_OnlineSea_EnemyShipBase_C>();
	}
};
DUMPER7_ASSERTS_UABP_OnlineSea_EnemyShipBase_C;

}

