#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_OnlineSea_EnemyShipBase

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_OnlineSea_EnemyShipBase.ABP_OnlineSea_EnemyShipBase_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_OnlineSea_EnemyShipBase_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_OnlineSea_EnemyShipBase_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_OnlineSea_EnemyShipBase_C_AnimGraph");
static_assert(sizeof(ABP_OnlineSea_EnemyShipBase_C_AnimGraph) == 0x000010, "Wrong size on ABP_OnlineSea_EnemyShipBase_C_AnimGraph");
static_assert(offsetof(ABP_OnlineSea_EnemyShipBase_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_OnlineSea_EnemyShipBase_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_OnlineSea_EnemyShipBase.ABP_OnlineSea_EnemyShipBase_C.ExecuteUbergraph_ABP_OnlineSea_EnemyShipBase
// 0x0038 (0x0038 - 0x0000)
struct ABP_OnlineSea_EnemyShipBase_C_ExecuteUbergraph_ABP_OnlineSea_EnemyShipBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_PlaySlotAnimation_ReturnValue;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PlayLoopSlotAnimationAsDynamicMontage_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_OnlineSea_EnemyShipBase_C_ExecuteUbergraph_ABP_OnlineSea_EnemyShipBase) == 0x000008, "Wrong alignment on ABP_OnlineSea_EnemyShipBase_C_ExecuteUbergraph_ABP_OnlineSea_EnemyShipBase");
static_assert(sizeof(ABP_OnlineSea_EnemyShipBase_C_ExecuteUbergraph_ABP_OnlineSea_EnemyShipBase) == 0x000038, "Wrong size on ABP_OnlineSea_EnemyShipBase_C_ExecuteUbergraph_ABP_OnlineSea_EnemyShipBase");
static_assert(offsetof(ABP_OnlineSea_EnemyShipBase_C_ExecuteUbergraph_ABP_OnlineSea_EnemyShipBase, EntryPoint) == 0x000000, "Member 'ABP_OnlineSea_EnemyShipBase_C_ExecuteUbergraph_ABP_OnlineSea_EnemyShipBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_OnlineSea_EnemyShipBase_C_ExecuteUbergraph_ABP_OnlineSea_EnemyShipBase, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ABP_OnlineSea_EnemyShipBase_C_ExecuteUbergraph_ABP_OnlineSea_EnemyShipBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ABP_OnlineSea_EnemyShipBase_C_ExecuteUbergraph_ABP_OnlineSea_EnemyShipBase, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'ABP_OnlineSea_EnemyShipBase_C_ExecuteUbergraph_ABP_OnlineSea_EnemyShipBase::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ABP_OnlineSea_EnemyShipBase_C_ExecuteUbergraph_ABP_OnlineSea_EnemyShipBase, CallFunc_PlaySlotAnimation_ReturnValue) == 0x000024, "Member 'ABP_OnlineSea_EnemyShipBase_C_ExecuteUbergraph_ABP_OnlineSea_EnemyShipBase::CallFunc_PlaySlotAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_OnlineSea_EnemyShipBase_C_ExecuteUbergraph_ABP_OnlineSea_EnemyShipBase, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000028, "Member 'ABP_OnlineSea_EnemyShipBase_C_ExecuteUbergraph_ABP_OnlineSea_EnemyShipBase::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_OnlineSea_EnemyShipBase_C_ExecuteUbergraph_ABP_OnlineSea_EnemyShipBase, CallFunc_PlayLoopSlotAnimationAsDynamicMontage_ReturnValue) == 0x000030, "Member 'ABP_OnlineSea_EnemyShipBase_C_ExecuteUbergraph_ABP_OnlineSea_EnemyShipBase::CallFunc_PlayLoopSlotAnimationAsDynamicMontage_ReturnValue' has a wrong offset!");

}

