#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon013_Part01_Main

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Mon013_Part01_Main.ABP_Mon013_Part01_Main_C.HitAddtiveLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_Mon013_Part01_Main_C_HitAddtiveLayer final
{
public:
	struct FPoseLink                              HitInputPose;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              HitAddtiveLayer_0;                                 // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Mon013_Part01_Main_C_HitAddtiveLayer) == 0x000008, "Wrong alignment on ABP_Mon013_Part01_Main_C_HitAddtiveLayer");
static_assert(sizeof(ABP_Mon013_Part01_Main_C_HitAddtiveLayer) == 0x000020, "Wrong size on ABP_Mon013_Part01_Main_C_HitAddtiveLayer");
static_assert(offsetof(ABP_Mon013_Part01_Main_C_HitAddtiveLayer, HitInputPose) == 0x000000, "Member 'ABP_Mon013_Part01_Main_C_HitAddtiveLayer::HitInputPose' has a wrong offset!");
static_assert(offsetof(ABP_Mon013_Part01_Main_C_HitAddtiveLayer, HitAddtiveLayer_0) == 0x000010, "Member 'ABP_Mon013_Part01_Main_C_HitAddtiveLayer::HitAddtiveLayer_0' has a wrong offset!");

// Function ABP_Mon013_Part01_Main.ABP_Mon013_Part01_Main_C.CurveDataLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_Mon013_Part01_Main_C_CurveDataLayer final
{
public:
	struct FPoseLink                              CurveInputPose;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              CurveDataLayer_0;                                  // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Mon013_Part01_Main_C_CurveDataLayer) == 0x000008, "Wrong alignment on ABP_Mon013_Part01_Main_C_CurveDataLayer");
static_assert(sizeof(ABP_Mon013_Part01_Main_C_CurveDataLayer) == 0x000020, "Wrong size on ABP_Mon013_Part01_Main_C_CurveDataLayer");
static_assert(offsetof(ABP_Mon013_Part01_Main_C_CurveDataLayer, CurveInputPose) == 0x000000, "Member 'ABP_Mon013_Part01_Main_C_CurveDataLayer::CurveInputPose' has a wrong offset!");
static_assert(offsetof(ABP_Mon013_Part01_Main_C_CurveDataLayer, CurveDataLayer_0) == 0x000010, "Member 'ABP_Mon013_Part01_Main_C_CurveDataLayer::CurveDataLayer_0' has a wrong offset!");

// Function ABP_Mon013_Part01_Main.ABP_Mon013_Part01_Main_C.GroundIKLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_Mon013_Part01_Main_C_GroundIKLayer final
{
public:
	struct FPoseLink                              GroundIkInputPose;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              GroundIKLayer_0;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Mon013_Part01_Main_C_GroundIKLayer) == 0x000008, "Wrong alignment on ABP_Mon013_Part01_Main_C_GroundIKLayer");
static_assert(sizeof(ABP_Mon013_Part01_Main_C_GroundIKLayer) == 0x000020, "Wrong size on ABP_Mon013_Part01_Main_C_GroundIKLayer");
static_assert(offsetof(ABP_Mon013_Part01_Main_C_GroundIKLayer, GroundIkInputPose) == 0x000000, "Member 'ABP_Mon013_Part01_Main_C_GroundIKLayer::GroundIkInputPose' has a wrong offset!");
static_assert(offsetof(ABP_Mon013_Part01_Main_C_GroundIKLayer, GroundIKLayer_0) == 0x000010, "Member 'ABP_Mon013_Part01_Main_C_GroundIKLayer::GroundIKLayer_0' has a wrong offset!");

// Function ABP_Mon013_Part01_Main.ABP_Mon013_Part01_Main_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Mon013_Part01_Main_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Mon013_Part01_Main_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Mon013_Part01_Main_C_AnimGraph");
static_assert(sizeof(ABP_Mon013_Part01_Main_C_AnimGraph) == 0x000010, "Wrong size on ABP_Mon013_Part01_Main_C_AnimGraph");
static_assert(offsetof(ABP_Mon013_Part01_Main_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Mon013_Part01_Main_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Mon013_Part01_Main.ABP_Mon013_Part01_Main_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Mon013_Part01_Main_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Mon013_Part01_Main_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Mon013_Part01_Main_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Mon013_Part01_Main_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Mon013_Part01_Main_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Mon013_Part01_Main_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Mon013_Part01_Main_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Mon013_Part01_Main.ABP_Mon013_Part01_Main_C.ExecuteUbergraph_ABP_Mon013_Part01_Main
// 0x0048 (0x0048 - 0x0000)
struct ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          CallFunc_GetIdleAnim_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAICharacter*                       K2Node_DynamicCast_AsGame_AICharacter;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInFightState_ReturnValue;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Mon_013_Part01_C*                   K2Node_DynamicCast_AsBP_Mon_013_Part_01;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main) == 0x000008, "Wrong alignment on ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main");
static_assert(sizeof(ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main) == 0x000048, "Wrong size on ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main");
static_assert(offsetof(ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main, EntryPoint) == 0x000000, "Member 'ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main, CallFunc_GetIdleAnim_ReturnValue) == 0x000010, "Member 'ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main::CallFunc_GetIdleAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main, K2Node_DynamicCast_AsGame_AICharacter) == 0x000020, "Member 'ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main::K2Node_DynamicCast_AsGame_AICharacter' has a wrong offset!");
static_assert(offsetof(ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main, CallFunc_IsInFightState_ReturnValue) == 0x000029, "Member 'ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main::CallFunc_IsInFightState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main, K2Node_DynamicCast_AsBP_Mon_013_Part_01) == 0x000030, "Member 'ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main::K2Node_DynamicCast_AsBP_Mon_013_Part_01' has a wrong offset!");
static_assert(offsetof(ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main, CallFunc_IsAlive_ReturnValue) == 0x000039, "Member 'ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main::CallFunc_IsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main, K2Node_Event_DeltaTimeX) == 0x00003C, "Member 'ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'ABP_Mon013_Part01_Main_C_ExecuteUbergraph_ABP_Mon013_Part01_Main::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

