#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon_003_Main

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"
#include "SeasunAnimGraph_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Mon_003_Main.ABP_Mon_003_Main_C
// 0x1480 (0x1A50 - 0x05D0)
class UABP_Mon_003_Main_C final : public UAnimInstance_Humanoid
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x05D8(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x06F0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0720(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0838(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0868(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0980(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x09B0(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0B08(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x0C60(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0C88(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0CB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0CE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0D08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0D30(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0D58(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0DD8(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x0E08(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x0E50(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0E98(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0F58(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x0FA0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0FC8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0FF0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1020(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1048(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x10C8(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1168(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x11B0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x11E0(0x00B0)()
	struct FAnimNode_CurveSequenceSlot            AnimGraphNode_CurveSequenceSlot;                   // 0x1290(0x0038)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x12C8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x12E8(0x0020)()
	uint8                                         Pad_1308[0x8];                                     // 0x1308(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x1310(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x14C0(0x0158)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x1618(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x16C8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x16F0(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1790(0x0028)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x17B8(0x00A0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x1858(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x18F8(0x00A0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x1998(0x00B0)()

public:
	void ExecuteUbergraph_ABP_Mon_003_Main(int32 EntryPoint);
	void HitAddtiveLayer(const struct FPoseLink& HitInputPose, struct FPoseLink* HitAddtiveLayer_0);
	void CurveDataLayer(const struct FPoseLink& CurveInputPose, struct FPoseLink* CurveDataLayer_0);
	void GroundIKLayer(const struct FPoseLink& GroundIkInputPose, struct FPoseLink* GroundIKLayer_0);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_003_Main_AnimGraphNode_SequencePlayer_3D7126774A1DC93E661AC885A14482D2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_003_Main_AnimGraphNode_TransitionResult_1F0DF82F499E85C0F65E25B2379A6202();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_003_Main_AnimGraphNode_TransitionResult_F495563146789DEAB3423C8BF5FD9650();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_003_Main_AnimGraphNode_TransitionResult_7DEA3D304EE8E6EC9AA13A937AE12B32();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_003_Main_AnimGraphNode_TransitionResult_D6EC6C934E6FE9949D1BC38F788C2310();
	void BlueprintUpdateAnimation(float DeltaTimeX);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Mon_003_Main_C">();
	}
	static class UABP_Mon_003_Main_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Mon_003_Main_C>();
	}
};
static_assert(alignof(UABP_Mon_003_Main_C) == 0x000010, "Wrong alignment on UABP_Mon_003_Main_C");
static_assert(sizeof(UABP_Mon_003_Main_C) == 0x001A50, "Wrong size on UABP_Mon_003_Main_C");
static_assert(offsetof(UABP_Mon_003_Main_C, UberGraphFrame) == 0x0005D0, "Member 'UABP_Mon_003_Main_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_LinkedInputPose_2) == 0x0005D8, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_Root_3) == 0x0006F0, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_LinkedInputPose_1) == 0x000720, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_Root_2) == 0x000838, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_LinkedInputPose) == 0x000868, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_Root_1) == 0x000980, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_SaveCachedPose_2) == 0x0009B0, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_SaveCachedPose_1) == 0x000B08, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_UseCachedPose_5) == 0x000C60, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_Root) == 0x000C88, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_TransitionResult_3) == 0x000CB8, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_TransitionResult_2) == 0x000CE0, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_TransitionResult_1) == 0x000D08, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_TransitionResult) == 0x000D30, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_SequencePlayer_1) == 0x000D58, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_StateResult_2) == 0x000DD8, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_Slot_3) == 0x000E08, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_Slot_2) == 0x000E50, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_LayeredBoneBlend) == 0x000E98, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_Slot_1) == 0x000F58, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_UseCachedPose_4) == 0x000FA0, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_UseCachedPose_3) == 0x000FC8, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_StateResult_1) == 0x000FF0, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_UseCachedPose_2) == 0x001020, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_SequencePlayer) == 0x001048, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_BlendListByBool_2) == 0x0010C8, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_Slot) == 0x001168, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_StateResult) == 0x0011B0, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_StateMachine) == 0x0011E0, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_CurveSequenceSlot) == 0x001290, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_CurveSequenceSlot' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_LocalToComponentSpace) == 0x0012C8, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_ComponentToLocalSpace) == 0x0012E8, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_LookAt) == 0x001310, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_SaveCachedPose) == 0x0014C0, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_LinkedAnimLayer_1) == 0x001618, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_LinkedAnimLayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_UseCachedPose_1) == 0x0016C8, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_BlendListByBool_1) == 0x0016F0, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_UseCachedPose) == 0x001790, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_LinkedAnimGraph_1) == 0x0017B8, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_LinkedAnimGraph_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_LinkedAnimGraph) == 0x001858, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_BlendListByBool) == 0x0018F8, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Mon_003_Main_C, AnimGraphNode_LinkedAnimLayer) == 0x001998, "Member 'UABP_Mon_003_Main_C::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");

}

