#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon_007_Main

#include "Basic.hpp"

#include "SeasunAnimGraph_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Mon_007_Main.ABP_Mon_007_Main_C
// 0x1980 (0x1F50 - 0x05D0)
class UABP_Mon_007_Main_C final : public UAnimInstance_Humanoid
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x05D8(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x0608(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0760(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x08B8(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x08E0(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0990(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x09B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x09E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0A08(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0A30(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0AB0(0x0080)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x0B30(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0BD0(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x0C00(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x0C48(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x0C70(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x0D10(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0D30(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x0E38(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x0E58(0x0190)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x0FE8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x1030(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x1078(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x1138(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x1180(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x11A8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x11D0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1200(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1228(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x12A8(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1348(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1390(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x13C0(0x00B0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x1470(0x00B0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1520(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1540(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x1560(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1710(0x0158)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x1868(0x0118)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1980(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x19A8(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1A48(0x0028)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x1A70(0x00A0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x1B10(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1BB0(0x00A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x1C50(0x0030)()
	struct FAnimNode_CurveSequenceSlot            AnimGraphNode_CurveSequenceSlot;                   // 0x1C80(0x0038)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x1CB8(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1DD0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1E00(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1F18(0x0030)()
	int32                                         DeadType;                                          // 0x1F48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UpperBodyAimming;                                  // 0x1F4C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_Mon_007_Main(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_007_Main_AnimGraphNode_TransitionResult_4C6AB9C94636836D4975A388B6387CEE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_007_Main_AnimGraphNode_TransitionResult_13DE87984E98E8D77126B7AAF6011F05();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_007_Main_AnimGraphNode_TransitionResult_61A48DEB48B539DDD807FF89A7D0F2B3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_007_Main_AnimGraphNode_TransitionResult_E92E837445EB21B623E48EB2E28CDF1B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_007_Main_AnimGraphNode_ModifyBone_6DEBE9CC469A394792BF2DB2538BB4D3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_007_Main_AnimGraphNode_SequencePlayer_BFC697314055BBBE426885A6C6BC300C();
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void GroundIKLayer(const struct FPoseLink& GroundIkInputPose, struct FPoseLink* GroundIKLayer_0);
	void CurveDataLayer(const struct FPoseLink& CurveInputPose, struct FPoseLink* CurveDataLayer_0);
	void HitAddtiveLayer(const struct FPoseLink& HitInputPose, struct FPoseLink* HitAddtiveLayer_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Mon_007_Main_C">();
	}
	static class UABP_Mon_007_Main_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Mon_007_Main_C>();
	}
};
static_assert(alignof(UABP_Mon_007_Main_C) == 0x000010, "Wrong alignment on UABP_Mon_007_Main_C");
static_assert(sizeof(UABP_Mon_007_Main_C) == 0x001F50, "Wrong size on UABP_Mon_007_Main_C");
static_assert(offsetof(UABP_Mon_007_Main_C, UberGraphFrame) == 0x0005D0, "Member 'UABP_Mon_007_Main_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_Root_3) == 0x0005D8, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_SaveCachedPose_2) == 0x000608, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_SaveCachedPose_1) == 0x000760, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_UseCachedPose_6) == 0x0008B8, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_LinkedAnimLayer_1) == 0x0008E0, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_LinkedAnimLayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_TransitionResult_3) == 0x000990, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_TransitionResult_2) == 0x0009B8, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_TransitionResult_1) == 0x0009E0, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_TransitionResult) == 0x000A08, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_SequencePlayer_2) == 0x000A30, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_SequencePlayer_1) == 0x000AB0, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_BlendListByInt) == 0x000B30, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_StateResult_2) == 0x000BD0, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_Slot_4) == 0x000C00, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_Slot_4' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_UseCachedPose_5) == 0x000C48, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_BlendListByBool_3) == 0x000C70, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x000D10, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_ModifyBone) == 0x000D30, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_LocalToComponentSpace_1) == 0x000E38, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x000E58, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_Slot_3) == 0x000FE8, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_Slot_2) == 0x001030, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_LayeredBoneBlend) == 0x001078, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_Slot_1) == 0x001138, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_UseCachedPose_4) == 0x001180, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_UseCachedPose_3) == 0x0011A8, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_StateResult_1) == 0x0011D0, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_UseCachedPose_2) == 0x001200, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_SequencePlayer) == 0x001228, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_BlendListByBool_2) == 0x0012A8, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_Slot) == 0x001348, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_StateResult) == 0x001390, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_StateMachine) == 0x0013C0, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_LinkedAnimLayer) == 0x001470, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_LocalToComponentSpace) == 0x001520, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_ComponentToLocalSpace) == 0x001540, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_LookAt) == 0x001560, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_SaveCachedPose) == 0x001710, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_LinkedInputPose_2) == 0x001868, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_UseCachedPose_1) == 0x001980, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_BlendListByBool_1) == 0x0019A8, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_UseCachedPose) == 0x001A48, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_LinkedAnimGraph_1) == 0x001A70, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_LinkedAnimGraph_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_LinkedAnimGraph) == 0x001B10, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_BlendListByBool) == 0x001BB0, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_Root_2) == 0x001C50, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_CurveSequenceSlot) == 0x001C80, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_CurveSequenceSlot' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_LinkedInputPose_1) == 0x001CB8, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_Root_1) == 0x001DD0, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_LinkedInputPose) == 0x001E00, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, AnimGraphNode_Root) == 0x001F18, "Member 'UABP_Mon_007_Main_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, DeadType) == 0x001F48, "Member 'UABP_Mon_007_Main_C::DeadType' has a wrong offset!");
static_assert(offsetof(UABP_Mon_007_Main_C, UpperBodyAimming) == 0x001F4C, "Member 'UABP_Mon_007_Main_C::UpperBodyAimming' has a wrong offset!");

}

