#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_GirlBaseGirl014b

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_GirlBaseGirl014b.ABP_GirlBaseGirl014b_C.FishingAnimLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_GirlBaseGirl014b_C_FishingAnimLayer final
{
public:
	struct FPoseLink                              FishingInput;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              FishingAnimLayer_0;                                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBaseGirl014b_C_FishingAnimLayer) == 0x000008, "Wrong alignment on ABP_GirlBaseGirl014b_C_FishingAnimLayer");
static_assert(sizeof(ABP_GirlBaseGirl014b_C_FishingAnimLayer) == 0x000020, "Wrong size on ABP_GirlBaseGirl014b_C_FishingAnimLayer");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_FishingAnimLayer, FishingInput) == 0x000000, "Member 'ABP_GirlBaseGirl014b_C_FishingAnimLayer::FishingInput' has a wrong offset!");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_FishingAnimLayer, FishingAnimLayer_0) == 0x000010, "Member 'ABP_GirlBaseGirl014b_C_FishingAnimLayer::FishingAnimLayer_0' has a wrong offset!");

// Function ABP_GirlBaseGirl014b.ABP_GirlBaseGirl014b_C.ForbiddenBreastAnimLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_GirlBaseGirl014b_C_ForbiddenBreastAnimLayer final
{
public:
	struct FPoseLink                              BreastAnim_Input;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ForbiddenBreastAnimLayer_0;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBaseGirl014b_C_ForbiddenBreastAnimLayer) == 0x000008, "Wrong alignment on ABP_GirlBaseGirl014b_C_ForbiddenBreastAnimLayer");
static_assert(sizeof(ABP_GirlBaseGirl014b_C_ForbiddenBreastAnimLayer) == 0x000020, "Wrong size on ABP_GirlBaseGirl014b_C_ForbiddenBreastAnimLayer");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_ForbiddenBreastAnimLayer, BreastAnim_Input) == 0x000000, "Member 'ABP_GirlBaseGirl014b_C_ForbiddenBreastAnimLayer::BreastAnim_Input' has a wrong offset!");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_ForbiddenBreastAnimLayer, ForbiddenBreastAnimLayer_0) == 0x000010, "Member 'ABP_GirlBaseGirl014b_C_ForbiddenBreastAnimLayer::ForbiddenBreastAnimLayer_0' has a wrong offset!");

// Function ABP_GirlBaseGirl014b.ABP_GirlBaseGirl014b_C.PostPhys&Rig
// 0x0020 (0x0020 - 0x0000)
struct ABP_GirlBaseGirl014b_C_PostPhys_Rig final
{
public:
	struct FPoseLink                              FootIKInput;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              PostPhys_Rig_0;                                    // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBaseGirl014b_C_PostPhys_Rig) == 0x000008, "Wrong alignment on ABP_GirlBaseGirl014b_C_PostPhys_Rig");
static_assert(sizeof(ABP_GirlBaseGirl014b_C_PostPhys_Rig) == 0x000020, "Wrong size on ABP_GirlBaseGirl014b_C_PostPhys_Rig");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_PostPhys_Rig, FootIKInput) == 0x000000, "Member 'ABP_GirlBaseGirl014b_C_PostPhys_Rig::FootIKInput' has a wrong offset!");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_PostPhys_Rig, PostPhys_Rig_0) == 0x000010, "Member 'ABP_GirlBaseGirl014b_C_PostPhys_Rig::PostPhys_Rig_0' has a wrong offset!");

// Function ABP_GirlBaseGirl014b.ABP_GirlBaseGirl014b_C.PostActionLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_GirlBaseGirl014b_C_PostActionLayer final
{
public:
	struct FPoseLink                              PassiveInpu;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              PostActionLayer_0;                                 // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBaseGirl014b_C_PostActionLayer) == 0x000008, "Wrong alignment on ABP_GirlBaseGirl014b_C_PostActionLayer");
static_assert(sizeof(ABP_GirlBaseGirl014b_C_PostActionLayer) == 0x000020, "Wrong size on ABP_GirlBaseGirl014b_C_PostActionLayer");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_PostActionLayer, PassiveInpu) == 0x000000, "Member 'ABP_GirlBaseGirl014b_C_PostActionLayer::PassiveInpu' has a wrong offset!");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_PostActionLayer, PostActionLayer_0) == 0x000010, "Member 'ABP_GirlBaseGirl014b_C_PostActionLayer::PostActionLayer_0' has a wrong offset!");

// Function ABP_GirlBaseGirl014b.ABP_GirlBaseGirl014b_C.ForcedActionLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_GirlBaseGirl014b_C_ForcedActionLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ForcedActionLayer_0;                               // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBaseGirl014b_C_ForcedActionLayer) == 0x000008, "Wrong alignment on ABP_GirlBaseGirl014b_C_ForcedActionLayer");
static_assert(sizeof(ABP_GirlBaseGirl014b_C_ForcedActionLayer) == 0x000020, "Wrong size on ABP_GirlBaseGirl014b_C_ForcedActionLayer");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_ForcedActionLayer, InPose) == 0x000000, "Member 'ABP_GirlBaseGirl014b_C_ForcedActionLayer::InPose' has a wrong offset!");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_ForcedActionLayer, ForcedActionLayer_0) == 0x000010, "Member 'ABP_GirlBaseGirl014b_C_ForcedActionLayer::ForcedActionLayer_0' has a wrong offset!");

// Function ABP_GirlBaseGirl014b.ABP_GirlBaseGirl014b_C.PartialBoneLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_GirlBaseGirl014b_C_PartialBoneLayer final
{
public:
	struct FPoseLink                              PartialBoneInput;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              PartialBoneLayer_0;                                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBaseGirl014b_C_PartialBoneLayer) == 0x000008, "Wrong alignment on ABP_GirlBaseGirl014b_C_PartialBoneLayer");
static_assert(sizeof(ABP_GirlBaseGirl014b_C_PartialBoneLayer) == 0x000020, "Wrong size on ABP_GirlBaseGirl014b_C_PartialBoneLayer");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_PartialBoneLayer, PartialBoneInput) == 0x000000, "Member 'ABP_GirlBaseGirl014b_C_PartialBoneLayer::PartialBoneInput' has a wrong offset!");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_PartialBoneLayer, PartialBoneLayer_0) == 0x000010, "Member 'ABP_GirlBaseGirl014b_C_PartialBoneLayer::PartialBoneLayer_0' has a wrong offset!");

// Function ABP_GirlBaseGirl014b.ABP_GirlBaseGirl014b_C.CompoisitionLayer
// 0x0030 (0x0030 - 0x0000)
struct ABP_GirlBaseGirl014b_C_CompoisitionLayer final
{
public:
	struct FPoseLink                              UpperBody;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              LowerBody;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              CompoisitionLayer_0;                               // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBaseGirl014b_C_CompoisitionLayer) == 0x000008, "Wrong alignment on ABP_GirlBaseGirl014b_C_CompoisitionLayer");
static_assert(sizeof(ABP_GirlBaseGirl014b_C_CompoisitionLayer) == 0x000030, "Wrong size on ABP_GirlBaseGirl014b_C_CompoisitionLayer");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_CompoisitionLayer, UpperBody) == 0x000000, "Member 'ABP_GirlBaseGirl014b_C_CompoisitionLayer::UpperBody' has a wrong offset!");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_CompoisitionLayer, LowerBody) == 0x000010, "Member 'ABP_GirlBaseGirl014b_C_CompoisitionLayer::LowerBody' has a wrong offset!");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_CompoisitionLayer, CompoisitionLayer_0) == 0x000020, "Member 'ABP_GirlBaseGirl014b_C_CompoisitionLayer::CompoisitionLayer_0' has a wrong offset!");

// Function ABP_GirlBaseGirl014b.ABP_GirlBaseGirl014b_C.LowerBody
// 0x0030 (0x0030 - 0x0000)
struct ABP_GirlBaseGirl014b_C_LowerBody final
{
public:
	struct FPoseLink                              LowerBaseLoco;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              LowerSkill;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              LowerBody_0;                                       // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBaseGirl014b_C_LowerBody) == 0x000008, "Wrong alignment on ABP_GirlBaseGirl014b_C_LowerBody");
static_assert(sizeof(ABP_GirlBaseGirl014b_C_LowerBody) == 0x000030, "Wrong size on ABP_GirlBaseGirl014b_C_LowerBody");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_LowerBody, LowerBaseLoco) == 0x000000, "Member 'ABP_GirlBaseGirl014b_C_LowerBody::LowerBaseLoco' has a wrong offset!");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_LowerBody, LowerSkill) == 0x000010, "Member 'ABP_GirlBaseGirl014b_C_LowerBody::LowerSkill' has a wrong offset!");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_LowerBody, LowerBody_0) == 0x000020, "Member 'ABP_GirlBaseGirl014b_C_LowerBody::LowerBody_0' has a wrong offset!");

// Function ABP_GirlBaseGirl014b.ABP_GirlBaseGirl014b_C.UpperBody
// 0x0030 (0x0030 - 0x0000)
struct ABP_GirlBaseGirl014b_C_UpperBody final
{
public:
	struct FPoseLink                              UpperBaseLoco;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              UpperSkill;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              UpperBody_0;                                       // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBaseGirl014b_C_UpperBody) == 0x000008, "Wrong alignment on ABP_GirlBaseGirl014b_C_UpperBody");
static_assert(sizeof(ABP_GirlBaseGirl014b_C_UpperBody) == 0x000030, "Wrong size on ABP_GirlBaseGirl014b_C_UpperBody");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_UpperBody, UpperBaseLoco) == 0x000000, "Member 'ABP_GirlBaseGirl014b_C_UpperBody::UpperBaseLoco' has a wrong offset!");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_UpperBody, UpperSkill) == 0x000010, "Member 'ABP_GirlBaseGirl014b_C_UpperBody::UpperSkill' has a wrong offset!");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_UpperBody, UpperBody_0) == 0x000020, "Member 'ABP_GirlBaseGirl014b_C_UpperBody::UpperBody_0' has a wrong offset!");

// Function ABP_GirlBaseGirl014b.ABP_GirlBaseGirl014b_C.Shoot&Aim
// 0x0020 (0x0020 - 0x0000)
struct ABP_GirlBaseGirl014b_C_Shoot_Aim final
{
public:
	struct FPoseLink                              BaseLocoInput;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Shoot_Aim_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBaseGirl014b_C_Shoot_Aim) == 0x000008, "Wrong alignment on ABP_GirlBaseGirl014b_C_Shoot_Aim");
static_assert(sizeof(ABP_GirlBaseGirl014b_C_Shoot_Aim) == 0x000020, "Wrong size on ABP_GirlBaseGirl014b_C_Shoot_Aim");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_Shoot_Aim, BaseLocoInput) == 0x000000, "Member 'ABP_GirlBaseGirl014b_C_Shoot_Aim::BaseLocoInput' has a wrong offset!");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_Shoot_Aim, Shoot_Aim_0) == 0x000010, "Member 'ABP_GirlBaseGirl014b_C_Shoot_Aim::Shoot_Aim_0' has a wrong offset!");

// Function ABP_GirlBaseGirl014b.ABP_GirlBaseGirl014b_C.BaseSkill
// 0x0020 (0x0020 - 0x0000)
struct ABP_GirlBaseGirl014b_C_BaseSkill final
{
public:
	struct FPoseLink                              InputLocomotion;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              BaseSkill_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBaseGirl014b_C_BaseSkill) == 0x000008, "Wrong alignment on ABP_GirlBaseGirl014b_C_BaseSkill");
static_assert(sizeof(ABP_GirlBaseGirl014b_C_BaseSkill) == 0x000020, "Wrong size on ABP_GirlBaseGirl014b_C_BaseSkill");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_BaseSkill, InputLocomotion) == 0x000000, "Member 'ABP_GirlBaseGirl014b_C_BaseSkill::InputLocomotion' has a wrong offset!");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_BaseSkill, BaseSkill_0) == 0x000010, "Member 'ABP_GirlBaseGirl014b_C_BaseSkill::BaseSkill_0' has a wrong offset!");

// Function ABP_GirlBaseGirl014b.ABP_GirlBaseGirl014b_C.BaseLocomotion
// 0x0010 (0x0010 - 0x0000)
struct ABP_GirlBaseGirl014b_C_BaseLocomotion final
{
public:
	struct FPoseLink                              BaseLocomotion_0;                                  // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBaseGirl014b_C_BaseLocomotion) == 0x000008, "Wrong alignment on ABP_GirlBaseGirl014b_C_BaseLocomotion");
static_assert(sizeof(ABP_GirlBaseGirl014b_C_BaseLocomotion) == 0x000010, "Wrong size on ABP_GirlBaseGirl014b_C_BaseLocomotion");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_BaseLocomotion, BaseLocomotion_0) == 0x000000, "Member 'ABP_GirlBaseGirl014b_C_BaseLocomotion::BaseLocomotion_0' has a wrong offset!");

// Function ABP_GirlBaseGirl014b.ABP_GirlBaseGirl014b_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_GirlBaseGirl014b_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBaseGirl014b_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_GirlBaseGirl014b_C_AnimGraph");
static_assert(sizeof(ABP_GirlBaseGirl014b_C_AnimGraph) == 0x000010, "Wrong size on ABP_GirlBaseGirl014b_C_AnimGraph");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_GirlBaseGirl014b_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_GirlBaseGirl014b.ABP_GirlBaseGirl014b_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_GirlBaseGirl014b_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GirlBaseGirl014b_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_GirlBaseGirl014b_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_GirlBaseGirl014b_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_GirlBaseGirl014b_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_GirlBaseGirl014b_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_GirlBaseGirl014b.ABP_GirlBaseGirl014b_C.ExecuteUbergraph_ABP_GirlBaseGirl014b
// 0x0280 (0x0280 - 0x0000)
struct ABP_GirlBaseGirl014b_C_ExecuteUbergraph_ABP_GirlBaseGirl014b final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsRushing_ReturnValue;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_9;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_10;       // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_11;       // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_12;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_11;                // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_12;                // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_13;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_14;                // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_15;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_13;       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetShootingPoseSwitchOffTime_ReturnValue; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetShootingPoseSwitchTime_ReturnValue; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue; // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_1; // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_2;                         // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_2; // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_14;       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_15;       // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_3;                         // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_3; // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_16;       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_16;                // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_4;                         // 0x00C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_4; // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_17;       // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_5;                         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_5; // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_Array_Get_Item_6;                         // 0x00F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_6; // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_Array_Get_Item_7;                         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_7; // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_17;                // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X_3;                        // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_3;                        // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_4;                        // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_4;                        // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue_1;        // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_18;                // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_19;                // 0x0136(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_9;                  // 0x0137(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_20;                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_21;                // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_10;                 // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_22;                // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_23;                // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAdvancedAction_ReturnValue;             // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_24;                // 0x013E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_11;                 // 0x013F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_12;                 // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_18;       // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_19;       // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_20;       // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_21;       // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_22;       // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_23;       // 0x0147(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_24;       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_9;                // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_10;               // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_25;       // 0x014B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_11;               // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_25;                // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_26;                // 0x014E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_26;       // 0x014F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_27;                // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_27;       // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_28;       // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_13;                 // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_29;       // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_30;       // 0x0156(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_12;               // 0x0157(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_31;       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15A[0x2];                                      // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X_5;                        // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_5;                        // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue_2;        // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_32;       // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_28;                // 0x0166(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_14;                 // 0x0167(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_33;       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_15;                 // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_34;       // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_13;               // 0x016B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_35;       // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_14;               // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_29;                // 0x016E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_36;       // 0x016F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_30;                // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_37;       // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_38;       // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_39;       // 0x0173(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_31;                // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_32;                // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_40;       // 0x0176(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_41;       // 0x0177(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_42;       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_43;       // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_44;       // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17B[0x1];                                      // 0x017B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_45;       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_46;       // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_47;       // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_48;       // 0x0183(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_49;       // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_50;       // 0x0185(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_51;       // 0x0186(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_16;                 // 0x0187(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_52;       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_53;       // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_17;                 // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_54;       // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_55;       // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_56;       // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_57;       // 0x018E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_58;       // 0x018F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_59;       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_18;                 // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_193[0x1];                                      // 0x0193(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_60;       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_61;       // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_19;                 // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_62;       // 0x019B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_63;       // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_64;       // 0x019D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_65;       // 0x019E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19F[0x1];                                      // 0x019F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X_6;                        // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_6;                        // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue_3;        // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_33;                // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AA[0x2];                                      // 0x01AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_8;                         // 0x01AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_8; // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_66;       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_9;                         // 0x01C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_9; // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_Array_Get_Item_10;                        // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_67;       // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_10; // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_Array_Get_Item_11;                        // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_12;                        // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_11; // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_12; // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_20;                 // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_13;                        // 0x021C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_13; // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_68;       // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_14;                        // 0x0234(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_14; // 0x023C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_69;       // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_70;       // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_21;                 // 0x024A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_71;       // 0x024B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_Array_Get_Item_15;                        // 0x024C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_15; // 0x0254(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_22;                 // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_15;               // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_34;                // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_263[0x1];                                      // 0x0263(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_7;                        // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_7;                        // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_275[0x3];                                      // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_GirlBaseGirl014b_C_ExecuteUbergraph_ABP_GirlBaseGirl014b) == 0x000004, "Wrong alignment on ABP_GirlBaseGirl014b_C_ExecuteUbergraph_ABP_GirlBaseGirl014b");
static_assert(sizeof(ABP_GirlBaseGirl014b_C_ExecuteUbergraph_ABP_GirlBaseGirl014b) == 0x000280, "Wrong size on ABP_GirlBaseGirl014b_C_ExecuteUbergraph_ABP_GirlBaseGirl014b");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_ExecuteUbergraph_ABP_GirlBaseGirl014b, EntryPoint) == 0x000000, "Member 'ABP_GirlBaseGirl014b_C_ExecuteUbergraph_ABP_GirlBaseGirl014b::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_GirlBaseGirl014b_C_ExecuteUbergraph_ABP_GirlBaseGirl014b, CallFunc_BreakVector2D_X) == 0x000004, "Member 'ABP_GirlBaseGirl014b_C_ExecuteUbergraph_ABP_GirlBaseGirl014b::CallFunc_BreakVector2D_X' has a wrong offset!");
