#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon_109_Abnormal

#include "Basic.hpp"


namespace SDK::Params
{

// Function ABP_Mon_109_Abnormal.ABP_Mon_109_Abnormal_C.ExecuteUbergraph_ABP_Mon_109_Abnormal
// 0x0048 (0x0048 - 0x0000)
struct ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameAICharacter*                       K2Node_DynamicCast_AsGame_AICharacter;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Mon_109b_NPC_C*                     K2Node_DynamicCast_AsBP_Mon_109b_NPC;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Mon_109_C*                          K2Node_DynamicCast_AsBP_Mon_109;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal) == 0x000008, "Wrong alignment on ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal");
static_assert(sizeof(ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal) == 0x000048, "Wrong size on ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal");
static_assert(offsetof(ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal, EntryPoint) == 0x000000, "Member 'ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal, ___bool_Has_Been_Initd_Variable) == 0x000004, "Member 'ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal, ___bool_IsClosed_Variable) == 0x000005, "Member 'ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal, K2Node_Event_DeltaTimeX) == 0x000008, "Member 'ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000010, "Member 'ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal, K2Node_DynamicCast_AsGame_AICharacter) == 0x000018, "Member 'ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal::K2Node_DynamicCast_AsGame_AICharacter' has a wrong offset!");
static_assert(offsetof(ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal, K2Node_DynamicCast_AsBP_Mon_109b_NPC) == 0x000028, "Member 'ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal::K2Node_DynamicCast_AsBP_Mon_109b_NPC' has a wrong offset!");
static_assert(offsetof(ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal, K2Node_DynamicCast_AsBP_Mon_109) == 0x000038, "Member 'ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal::K2Node_DynamicCast_AsBP_Mon_109' has a wrong offset!");
static_assert(offsetof(ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal, K2Node_DynamicCast_bSuccess_2) == 0x000040, "Member 'ABP_Mon_109_Abnormal_C_ExecuteUbergraph_ABP_Mon_109_Abnormal::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function ABP_Mon_109_Abnormal.ABP_Mon_109_Abnormal_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Mon_109_Abnormal_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Mon_109_Abnormal_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Mon_109_Abnormal_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Mon_109_Abnormal_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Mon_109_Abnormal_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Mon_109_Abnormal_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Mon_109_Abnormal_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

