#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_OnlineSea_EnemyShipBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_OnlineSea_EnemyShipBase.ABP_OnlineSea_EnemyShipBase_C
// 0x00B0 (0x05D0 - 0x0520)
class UABP_OnlineSea_EnemyShipBase_C final : public UAnimInstanceBase
{
public:
	uint8                                         Pad_518[0x8];                                      // 0x0518(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0528(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0558(0x0048)()
	FMulticastInlineDelegateProperty_             PlayHitAnimation;                                  // 0x05A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             PlayDeadAnimation;                                 // 0x05B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAnimSequenceBase*                      HitAnimation;                                      // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      DeadAnimation;                                     // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void PlayHitAnimationEvent();
	void BlueprintInitializeAnimation();
	void PlayDeadAnimationEvent();
	void ExecuteUbergraph_ABP_OnlineSea_EnemyShipBase(int32 EntryPoint);
	void PlayDeadAnimation__DelegateSignature();
	void PlayHitAnimation__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_OnlineSea_EnemyShipBase_C">();
	}
	static class UABP_OnlineSea_EnemyShipBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_OnlineSea_EnemyShipBase_C>();
	}
};
static_assert(alignof(UABP_OnlineSea_EnemyShipBase_C) == 0x000010, "Wrong alignment on UABP_OnlineSea_EnemyShipBase_C");
static_assert(sizeof(UABP_OnlineSea_EnemyShipBase_C) == 0x0005D0, "Wrong size on UABP_OnlineSea_EnemyShipBase_C");
static_assert(offsetof(UABP_OnlineSea_EnemyShipBase_C, UberGraphFrame) == 0x000520, "Member 'UABP_OnlineSea_EnemyShipBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_OnlineSea_EnemyShipBase_C, AnimGraphNode_Root) == 0x000528, "Member 'UABP_OnlineSea_EnemyShipBase_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_OnlineSea_EnemyShipBase_C, AnimGraphNode_Slot) == 0x000558, "Member 'UABP_OnlineSea_EnemyShipBase_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_OnlineSea_EnemyShipBase_C, PlayHitAnimation) == 0x0005A0, "Member 'UABP_OnlineSea_EnemyShipBase_C::PlayHitAnimation' has a wrong offset!");
static_assert(offsetof(UABP_OnlineSea_EnemyShipBase_C, PlayDeadAnimation) == 0x0005B0, "Member 'UABP_OnlineSea_EnemyShipBase_C::PlayDeadAnimation' has a wrong offset!");
static_assert(offsetof(UABP_OnlineSea_EnemyShipBase_C, HitAnimation) == 0x0005C0, "Member 'UABP_OnlineSea_EnemyShipBase_C::HitAnimation' has a wrong offset!");
static_assert(offsetof(UABP_OnlineSea_EnemyShipBase_C, DeadAnimation) == 0x0005C8, "Member 'UABP_OnlineSea_EnemyShipBase_C::DeadAnimation' has a wrong offset!");

}

