#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_girl002a_Phy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ControlRig_structs.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "SeasunAnimGraph_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_girl002a_Phy.ABP_girl002a_Phy_C
// 0x10690 (0x10950 - 0x02C0)
class UABP_girl002a_Phy_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x02C8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x02E8(0x0020)()
	struct FAnimNode_ReLocMesh                    AnimGraphNode_ReLocMesh;                           // 0x0308(0x00D8)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_71;                    // 0x03E0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_70;                    // 0x0770(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_69;                    // 0x0B00(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_68;                    // 0x0E90(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_67;                    // 0x1220(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_66;                    // 0x15B0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_65;                    // 0x1940(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_64;                    // 0x1CD0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_63;                    // 0x2060(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_62;                    // 0x23F0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_61;                    // 0x2780(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_60;                    // 0x2B10(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_59;                    // 0x2EA0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_58;                    // 0x3230(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_57;                    // 0x35C0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_56;                    // 0x3950(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_55;                    // 0x3CE0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_54;                    // 0x4070(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_53;                    // 0x4400(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_52;                    // 0x4790(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_51;                    // 0x4B20(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_50;                    // 0x4EB0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_49;                    // 0x5240(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_48;                    // 0x55D0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_47;                    // 0x5960(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_46;                    // 0x5CF0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_45;                    // 0x6080(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_44;                    // 0x6410(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_43;                    // 0x67A0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_42;                    // 0x6B30(0x0390)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x6EC0(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x6EE0(0x0368)()
	uint8                                         Pad_7248[0x8];                                     // 0x7248(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_41;                    // 0x7250(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_40;                    // 0x75E0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_39;                    // 0x7970(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_38;                    // 0x7D00(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_37;                    // 0x8090(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_36;                    // 0x8420(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_35;                    // 0x87B0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_34;                    // 0x8B40(0x0390)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x8ED0(0x0070)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x8F40(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_33;                    // 0x8F60(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_32;                    // 0x92F0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_31;                    // 0x9680(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_30;                    // 0x9A10(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_29;                    // 0x9DA0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_28;                    // 0xA130(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_27;                    // 0xA4C0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_26;                    // 0xA850(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_25;                    // 0xABE0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_24;                    // 0xAF70(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_23;                    // 0xB300(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_22;                    // 0xB690(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_21;                    // 0xBA20(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_20;                    // 0xBDB0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0xC140(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0xC4D0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0xC860(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0xCBF0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0xCF80(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0xD310(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0xD6A0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0xDA30(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0xDDC0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0xE150(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0xE4E0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0xE870(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0xEC00(0x0390)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0xEF90(0x00A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0xF030(0x0030)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0xF060(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0xF3F0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0xF780(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0xFB10(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0xFEA0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x10230(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x105C0(0x0390)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ABP_girl002a_Phy(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_girl002a_Phy_C">();
	}
	static class UABP_girl002a_Phy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_girl002a_Phy_C>();
	}
};
static_assert(alignof(UABP_girl002a_Phy_C) == 0x000010, "Wrong alignment on UABP_girl002a_Phy_C");
static_assert(sizeof(UABP_girl002a_Phy_C) == 0x010950, "Wrong size on UABP_girl002a_Phy_C");
static_assert(offsetof(UABP_girl002a_Phy_C, UberGraphFrame) == 0x0002C0, "Member 'UABP_girl002a_Phy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_LocalToComponentSpace_1) == 0x0002C8, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x0002E8, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_ReLocMesh) == 0x000308, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_ReLocMesh' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_71) == 0x0003E0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_71' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_70) == 0x000770, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_70' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_69) == 0x000B00, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_69' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_68) == 0x000E90, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_68' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_67) == 0x001220, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_67' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_66) == 0x0015B0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_66' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_65) == 0x001940, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_65' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_64) == 0x001CD0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_64' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_63) == 0x002060, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_63' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_62) == 0x0023F0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_62' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_61) == 0x002780, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_61' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_60) == 0x002B10, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_60' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_59) == 0x002EA0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_59' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_58) == 0x003230, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_58' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_57) == 0x0035C0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_57' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_56) == 0x003950, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_56' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_55) == 0x003CE0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_55' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_54) == 0x004070, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_54' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_53) == 0x004400, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_53' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_52) == 0x004790, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_52' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_51) == 0x004B20, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_51' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_50) == 0x004EB0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_50' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_49) == 0x005240, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_49' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_48) == 0x0055D0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_48' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_47) == 0x005960, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_47' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_46) == 0x005CF0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_46' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_45) == 0x006080, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_45' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_44) == 0x006410, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_44' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_43) == 0x0067A0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_43' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_42) == 0x006B30, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_42' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_LocalToComponentSpace) == 0x006EC0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_ControlRig) == 0x006EE0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_41) == 0x007250, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_41' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_40) == 0x0075E0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_40' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_39) == 0x007970, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_39' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_38) == 0x007D00, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_38' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_37) == 0x008090, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_37' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_36) == 0x008420, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_36' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_35) == 0x0087B0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_35' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_34) == 0x008B40, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_34' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_Inertialization) == 0x008ED0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_Inertialization' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_ComponentToLocalSpace) == 0x008F40, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_33) == 0x008F60, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_33' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_32) == 0x0092F0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_32' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_31) == 0x009680, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_31' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_30) == 0x009A10, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_30' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_29) == 0x009DA0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_29' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_28) == 0x00A130, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_28' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_27) == 0x00A4C0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_27' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_26) == 0x00A850, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_26' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_25) == 0x00ABE0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_25' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_24) == 0x00AF70, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_24' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_23) == 0x00B300, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_23' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_22) == 0x00B690, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_22' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_21) == 0x00BA20, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_21' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_20) == 0x00BDB0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_20' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_19) == 0x00C140, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_19' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_18) == 0x00C4D0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_18' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_17) == 0x00C860, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_17' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_16) == 0x00CBF0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_16' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_15) == 0x00CF80, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_15' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_14) == 0x00D310, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_14' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_13) == 0x00D6A0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_13' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_12) == 0x00DA30, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_12' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_11) == 0x00DDC0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_11' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_10) == 0x00E150, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_10' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_9) == 0x00E4E0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_8) == 0x00E870, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_7) == 0x00EC00, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_LinkedAnimGraph) == 0x00EF90, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_Root) == 0x00F030, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_6) == 0x00F060, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_5) == 0x00F3F0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_4) == 0x00F780, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_3) == 0x00FB10, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_2) == 0x00FEA0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics_1) == 0x010230, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_girl002a_Phy_C, AnimGraphNode_KawaiiPhysics) == 0x0105C0, "Member 'UABP_girl002a_Phy_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");

}

