#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Boss_203_BasePose

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Boss_203_BasePose.ABP_Boss_203_BasePose_C
// 0x00C0 (0x05F0 - 0x0530)
class UABP_Boss_203_BasePose_C final : public UAnimInstance_BaseTitan
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0530(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0538(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0568(0x0080)()
	bool                                          bStage3;                                           // 0x05E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_Boss_203_BasePose(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Boss_203_BasePose_C">();
	}
	static class UABP_Boss_203_BasePose_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Boss_203_BasePose_C>();
	}
};
static_assert(alignof(UABP_Boss_203_BasePose_C) == 0x000010, "Wrong alignment on UABP_Boss_203_BasePose_C");
static_assert(sizeof(UABP_Boss_203_BasePose_C) == 0x0005F0, "Wrong size on UABP_Boss_203_BasePose_C");
static_assert(offsetof(UABP_Boss_203_BasePose_C, UberGraphFrame) == 0x000530, "Member 'UABP_Boss_203_BasePose_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_BasePose_C, AnimGraphNode_Root) == 0x000538, "Member 'UABP_Boss_203_BasePose_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_BasePose_C, AnimGraphNode_SequencePlayer) == 0x000568, "Member 'UABP_Boss_203_BasePose_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Boss_203_BasePose_C, bStage3) == 0x0005E8, "Member 'UABP_Boss_203_BasePose_C::bStage3' has a wrong offset!");

}

