#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_FishingLayer

#include "Basic.hpp"

#include "Game_classes.hpp"
#include "Engine_structs.hpp"
#include "SeasunAnimGraph_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_FishingLayer.ABP_FishingLayer_C
// 0x06D0 (0x09E0 - 0x0310)
class UABP_FishingLayer_C : public UAnimInstance_Fishing
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0318(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0348(0x0118)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0460(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0488(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x04B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x04D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0500(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0528(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0550(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x05D0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0600(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0680(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x06B0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0730(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0760(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0810(0x0048)()
	struct FAnimNode_SkeletalRotateSpine          AnimGraphNode_SkeletalRotateSpine;                 // 0x0858(0x0110)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0968(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0988(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x09A8(0x0030)()

public:
	void FishingAnimLayer(const struct FPoseLink& FishingInput, struct FPoseLink* FishingAnimLayer_0);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FishingLayer_AnimGraphNode_TransitionResult_1E52ACA443CB98BDBE19E29581E4510A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FishingLayer_AnimGraphNode_TransitionResult_007A53DA48F18063D3DD11BF75697BD9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FishingLayer_AnimGraphNode_TransitionResult_DB0D82324B4BB2679D4E14B74D92D644();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FishingLayer_AnimGraphNode_TransitionResult_D457F20741FE61B5D41BCB80B034F935();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FishingLayer_AnimGraphNode_TransitionResult_01A98AB94F3FE6FE3A5B0D9F13588A43();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FishingLayer_AnimGraphNode_TransitionResult_21C41B7F4B0CCD4E7B39CFA715E3F3FC();
	void ExecuteUbergraph_ABP_FishingLayer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_FishingLayer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_FishingLayer_C")
	}
	static class UABP_FishingLayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_FishingLayer_C>();
	}
};
DUMPER7_ASSERTS_UABP_FishingLayer_C;

}

