#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_GirlBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "SeasunAnimGraph_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_GirlBase.ABP_GirlBase_C
// 0x19F40 (0x1BD10 - 0x1DD0)
class UABP_GirlBase_C : public UGameCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1DD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_91;                  // 0x1DD8(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_144;                   // 0x1E78(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_143;                   // 0x1EA0(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_27;                 // 0x1EC8(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_142;                   // 0x1F88(0x0028)()
	struct FAnimNode_CurveSequenceSlot            AnimGraphNode_CurveSequenceSlot_2;                 // 0x1FB0(0x0038)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_53;                   // 0x1FE8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_141;                   // 0x2140(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_34;                             // 0x2168(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_140;                   // 0x21B0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_33;                             // 0x21D8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_139;                   // 0x2220(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_20;                      // 0x2248(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_90;                  // 0x2310(0x00A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_35;            // 0x23B0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_38;            // 0x23D0(0x0020)()
	struct FAnimNode_SkeletalRotateSpine          AnimGraphNode_SkeletalRotateSpine_3;               // 0x23F0(0x0110)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_89;                  // 0x2500(0x00A0)()
	struct FAnimNode_SkeletalRotateSpine          AnimGraphNode_SkeletalRotateSpine_2;               // 0x25A0(0x0110)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_37;            // 0x26B0(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_52;                   // 0x26D0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_138;                   // 0x2828(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x2850(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x2880(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_51;                   // 0x2998(0x0158)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_29;                       // 0x2AF0(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_34;            // 0x2BF8(0x0020)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_7;                   // 0x2C18(0x00B0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_36;            // 0x2CC8(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_88;                  // 0x2CE8(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_35;            // 0x2D88(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_137;                   // 0x2DA8(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_28;                       // 0x2DD0(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_33;            // 0x2ED8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_136;                   // 0x2EF8(0x0028)()
	struct FAnimNode_SkeletalRotateSpine          AnimGraphNode_SkeletalRotateSpine_1;               // 0x2F20(0x0110)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_34;            // 0x3030(0x0020)()
	struct FAnimNode_SkeletalRotateSpine          AnimGraphNode_SkeletalRotateSpine;                 // 0x3050(0x0110)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_50;                   // 0x3160(0x0158)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_87;                  // 0x32B8(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_135;                   // 0x3358(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_134;                   // 0x3380(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_86;                  // 0x33A8(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_133;                   // 0x3448(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_32;            // 0x3470(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_31;            // 0x3490(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_33;            // 0x34B0(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_85;                  // 0x34D0(0x00A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_27;                       // 0x3570(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_132;                   // 0x3678(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_131;                   // 0x36A0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_49;                   // 0x36C8(0x0158)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_84;                  // 0x3820(0x00A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x38C0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x38F0(0x0118)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x3A08(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_48;                   // 0x3B20(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_47;                   // 0x3C78(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_130;                   // 0x3DD0(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_26;                 // 0x3DF8(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_46;                   // 0x3EB8(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_45;                   // 0x4010(0x0158)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_32;            // 0x4168(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_25;                 // 0x4188(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_129;                   // 0x4248(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_128;                   // 0x4270(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_127;                   // 0x4298(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_126;                   // 0x42C0(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_24;                 // 0x42E8(0x00C0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_83;                  // 0x43A8(0x00A0)()
	struct FAnimNode_UpperBodyMatchingUnder       AnimGraphNode_UpperBodyMatchingUnder;              // 0x4448(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_125;                   // 0x44D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_124;                   // 0x44F8(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_3;                      // 0x4520(0x0018)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5;                     // 0x4538(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_123;                   // 0x4600(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_6;                   // 0x4628(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_44;                   // 0x46D8(0x0158)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_30;            // 0x4830(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_32;                             // 0x4850(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_122;                   // 0x4898(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_31;                             // 0x48C0(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x4908(0x00C8)()
	struct FAnimNode_SpeedWarping_UpperBody       AnimGraphNode_SpeedWarping_UpperBody;              // 0x49D0(0x0190)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_5;                  // 0x4B60(0x00E8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_30;                             // 0x4C48(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_2;                      // 0x4C90(0x0018)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_29;                             // 0x4CA8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_43;                   // 0x4CF0(0x0158)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_1;                      // 0x4E48(0x0018)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_28;                             // 0x4E60(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose;                        // 0x4EA8(0x0018)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_27;                             // 0x4EC0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_42;                   // 0x4F08(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_41;                   // 0x5060(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_121;                   // 0x51B8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_120;                   // 0x51E0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_119;                   // 0x5208(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_118;                   // 0x5230(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_82;                  // 0x5258(0x00A0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x52F8(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_4;                  // 0x53C0(0x00E8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_26;                             // 0x54A8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_117;                   // 0x54F0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_116;                   // 0x5518(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x5540(0x00E8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x5628(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_40;                   // 0x56F0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_115;                   // 0x5848(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_114;                   // 0x5870(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_81;                  // 0x5898(0x00A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x5938(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x5968(0x0118)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x5A80(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_39;                   // 0x5B98(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_38;                   // 0x5CF0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_113;                   // 0x5E48(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_112;                   // 0x5E70(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_5;                   // 0x5E98(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_111;                   // 0x5F48(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_110;                   // 0x5F70(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_109;                   // 0x5F98(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_108;                   // 0x5FC0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_80;                  // 0x5FE8(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_37;                   // 0x6088(0x0158)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_29;            // 0x61E0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_31;            // 0x6200(0x0020)()
	struct FAnimNode_SpeedWarping                 AnimGraphNode_SpeedWarping;                        // 0x6220(0x0160)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x6380(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_36;                   // 0x6498(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_107;                   // 0x65F0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_106;                   // 0x6618(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_22;                      // 0x6640(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_9;                      // 0x6670(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x6720(0x0030)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_5;            // 0x6750(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_105;                   // 0x6820(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_25;                             // 0x6848(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_104;                   // 0x6890(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_103;                   // 0x68B8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_79;                  // 0x68E0(0x00A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x6980(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x69B0(0x0118)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x6AC8(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_35;                   // 0x6BE0(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_34;                   // 0x6D38(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_102;                   // 0x6E90(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_101;                   // 0x6EB8(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_5;                 // 0x6EE0(0x0050)()
	struct FAnimNode_LayeredBoneBlendCustomFilter AnimGraphNode_LayerBlendPerBoneCustomFilter;       // 0x6F30(0x00D8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_58;                   // 0x7008(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_33;                   // 0x7088(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_100;                   // 0x71E0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_99;                    // 0x7208(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x7230(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x7260(0x0118)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_4;            // 0x7378(0x00D0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_30;            // 0x7448(0x0020)()
	uint8                                         Pad_7468[0x8];                                     // 0x7468(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AimOffset                    AnimGraphNode_AimOffset_3;                         // 0x7470(0x0200)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_28;            // 0x7670(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_4;                 // 0x7690(0x0050)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_78;                  // 0x76E0(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_32;                   // 0x7780(0x0158)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_3;                 // 0x78D8(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_31;                   // 0x7928(0x0158)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_3;            // 0x7A80(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_77;                  // 0x7B50(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_76;                  // 0x7BF0(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_98;                    // 0x7C90(0x0028)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x7CB8(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x7DD0(0x0030)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2;                 // 0x7E00(0x0050)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x7E50(0x0050)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_75;                  // 0x7EA0(0x00A0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x7F40(0x0050)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_4;                   // 0x7F90(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_30;                   // 0x8040(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_97;                    // 0x8198(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_96;                    // 0x81C0(0x0028)()
	uint8                                         Pad_81E8[0x8];                                     // 0x81E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AimOffset                    AnimGraphNode_AimOffset_2;                         // 0x81F0(0x0200)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_27;            // 0x83F0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_29;            // 0x8410(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_29;                   // 0x8430(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_95;                    // 0x8588(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_94;                    // 0x85B0(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_19;                      // 0x85D8(0x00C8)()
	struct FAnimNode_BlendWithRefPose             AnimGraphNode_BlendWithRefPose;                    // 0x86A0(0x0098)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_18;                      // 0x8738(0x00C8)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x8800(0x0650)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_28;            // 0x8E50(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_26;            // 0x8E70(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_93;                    // 0x8E90(0x0028)()
	uint8                                         Pad_8EB8[0x8];                                     // 0x8EB8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RecoilSequenceNode           AnimGraphNode_RecoilSequenceNode_1;                // 0x8EC0(0x09A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_24;                             // 0x9860(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_28;                   // 0x98A8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_92;                    // 0x9A00(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_91;                    // 0x9A28(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_3;                   // 0x9A50(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_74;                  // 0x9B00(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_57;                   // 0x9BA0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_56;                   // 0x9C20(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_73;                  // 0x9CA0(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_23;                 // 0x9D40(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_90;                    // 0x9E00(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2;                   // 0x9E28(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_72;                  // 0x9ED8(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_71;                  // 0x9F78(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_22;                 // 0xA018(0x00C0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_27;                       // 0xA0D8(0x00F0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_26;                       // 0xA1C8(0x00F0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_25;                       // 0xA2B8(0x00F0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_26;                       // 0xA3A8(0x0108)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_2;            // 0xA4B0(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_27;                   // 0xA580(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_26;                   // 0xA6D8(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_23;                             // 0xA830(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_70;                  // 0xA878(0x00A0)()
	struct FAnimNode_CurveSequenceSlot            AnimGraphNode_CurveSequenceSlot_1;                 // 0xA918(0x0038)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_25;            // 0xA950(0x0020)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_1;            // 0xA970(0x00D0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_22;                             // 0xAA40(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_21;                 // 0xAA88(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_89;                    // 0xAB48(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_88;                    // 0xAB70(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_25;                   // 0xAB98(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_87;                    // 0xACF0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_86;                    // 0xAD18(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_85;                    // 0xAD40(0x0028)()
	uint8                                         Pad_AD68[0x8];                                     // 0xAD68(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AimOffset                    AnimGraphNode_AimOffset_1;                         // 0xAD70(0x0200)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_21;                             // 0xAF70(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_20;                 // 0xAFB8(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_84;                    // 0xB078(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_24;                   // 0xB0A0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_83;                    // 0xB1F8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_82;                    // 0xB220(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_23;                   // 0xB248(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_20;                             // 0xB3A0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_19;                 // 0xB3E8(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_81;                    // 0xB4A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_80;                    // 0xB4D0(0x0028)()
	struct FAnimNode_CurveSequenceSlot            AnimGraphNode_CurveSequenceSlot;                   // 0xB4F8(0x0038)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_27;            // 0xB530(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_19;                             // 0xB550(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_22;                   // 0xB598(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_79;                    // 0xB6F0(0x0028)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_24;                       // 0xB718(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_21;                   // 0xB808(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_78;                    // 0xB960(0x0028)()
	uint8                                         Pad_B988[0x8];                                     // 0xB988(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AimOffset                    AnimGraphNode_AimOffset;                           // 0xB990(0x0200)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_18;                 // 0xBB90(0x00C0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_24;            // 0xBC50(0x0020)()
	struct FAnimNode_SaveBoneTransform            AnimGraphNode_SaveBoneTransform_1;                 // 0xBC70(0x0150)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_20;                   // 0xBDC0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_77;                    // 0xBF18(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_76;                    // 0xBF40(0x0028)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_23;                       // 0xBF68(0x00F0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_22;                       // 0xC058(0x00F0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_21;                       // 0xC148(0x00F0)()
	struct FAnimNode_SaveBoneTransform            AnimGraphNode_SaveBoneTransform;                   // 0xC238(0x0150)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_23;            // 0xC388(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_26;            // 0xC3A8(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_18;                             // 0xC3C8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_19;                   // 0xC410(0x0158)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_69;                  // 0xC568(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_25;            // 0xC608(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_24;            // 0xC628(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_68;                  // 0xC648(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_23;            // 0xC6E8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_75;                    // 0xC708(0x0028)()
	struct FAnimNode_RotationWarping              AnimGraphNode_RotationWarping;                     // 0xC730(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_74;                    // 0xC780(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_67;                  // 0xC7A8(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_73;                    // 0xC848(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_66;                  // 0xC870(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_72;                    // 0xC910(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_22;            // 0xC938(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_25;                       // 0xC958(0x0108)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_17;                             // 0xCA60(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_17;                 // 0xCAA8(0x00C0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_24;                       // 0xCB68(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_21;            // 0xCC70(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_22;            // 0xCC90(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_23;                       // 0xCCB0(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_20;            // 0xCDB8(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_65;                  // 0xCDD8(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_21;            // 0xCE78(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_22;                       // 0xCE98(0x0108)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_64;                  // 0xCFA0(0x00A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_21;                       // 0xD040(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_19;            // 0xD148(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_20;            // 0xD168(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_20;                       // 0xD188(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_18;            // 0xD290(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_63;                  // 0xD2B0(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_19;            // 0xD350(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_71;                    // 0xD370(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_70;                    // 0xD398(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_69;                    // 0xD3C0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_68;                    // 0xD3E8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_62;                  // 0xD410(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_67;                    // 0xD4B0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_61;                  // 0xD4D8(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_66;                    // 0xD578(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_60;                  // 0xD5A0(0x00A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_19;                       // 0xD640(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_17;            // 0xD748(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_18;            // 0xD768(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_18;                       // 0xD788(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_16;            // 0xD890(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_17;            // 0xD8B0(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_59;                  // 0xD8D0(0x00A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_17;                       // 0xD970(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_15;            // 0xDA78(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_16;            // 0xDA98(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_16;                       // 0xDAB8(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_14;            // 0xDBC0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_15;            // 0xDBE0(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_58;                  // 0xDC00(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_14;            // 0xDCA0(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_57;                  // 0xDCC0(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_56;                  // 0xDD60(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_65;                    // 0xDE00(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_64;                    // 0xDE28(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_63;                    // 0xDE50(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_62;                    // 0xDE78(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_18;                   // 0xDEA0(0x0158)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_55;                  // 0xDFF8(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_17;                   // 0xE098(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_61;                    // 0xE1F0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_60;                    // 0xE218(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_59;                    // 0xE240(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_16;                             // 0xE268(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_58;                    // 0xE2B0(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_16;                 // 0xE2D8(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_57;                    // 0xE398(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_54;                  // 0xE3C0(0x00A0)()
	struct FAnimNode_RecoilSequenceNode           AnimGraphNode_RecoilSequenceNode;                  // 0xE460(0x09A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_56;                    // 0xEE00(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_55;                    // 0xEE28(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_53;                  // 0xEE50(0x00A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_15;                       // 0xEEF0(0x0108)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_52;                  // 0xEFF8(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_54;                    // 0xF098(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_16;                   // 0xF0C0(0x0158)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_51;                  // 0xF218(0x00A0)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0xF2B8(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_55;                   // 0xF388(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_53;                    // 0xF408(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_15;                   // 0xF430(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_52;                    // 0xF588(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_51;                    // 0xF5B0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_14;                   // 0xF5D8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_50;                    // 0xF730(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0xF758(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0xF788(0x0118)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_49;                    // 0xF8A0(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0xF8C8(0x00B0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0xF978(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_13;                   // 0xFA28(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_48;                    // 0xFB80(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_47;                    // 0xFBA8(0x0028)()
	struct FAnimNode_Grounder                     AnimGraphNode_Grounder;                            // 0xFBD0(0x0170)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0xFD40(0x0118)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_15;                             // 0xFE58(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0xFEA0(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0xFED0(0x00E8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_13;            // 0xFFB8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_46;                    // 0xFFD8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_12;                   // 0x10000(0x0158)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_15;                 // 0x10158(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_45;                    // 0x10218(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_14;                             // 0x10240(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_14;                       // 0x10288(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_12;            // 0x10390(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_13;            // 0x103B0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_13;                       // 0x103D0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_12;                       // 0x104D8(0x0108)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x105E0(0x00C8)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x106A8(0x0018)()
	struct FAnimNode_SkillAim                     AnimGraphNode_SkillAim;                            // 0x106C0(0x0310)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_12;            // 0x109D0(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_13;                             // 0x109F0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_44;                    // 0x10A38(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_11;                   // 0x10A60(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_43;                    // 0x10BB8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_10;                   // 0x10BE0(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_12;                             // 0x10D38(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_42;                    // 0x10D80(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_9;                    // 0x10DA8(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_11;                             // 0x10F00(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_41;                    // 0x10F48(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8;                    // 0x10F70(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_10;                             // 0x110C8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_40;                    // 0x11110(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_39;                    // 0x11138(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_38;                    // 0x11160(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_37;                    // 0x11188(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_36;                    // 0x111B0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_35;                    // 0x111D8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_34;                    // 0x11200(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_33;                    // 0x11228(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_32;                    // 0x11250(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x11278(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7;                    // 0x112C0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_31;                    // 0x11418(0x0028)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x11440(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x11558(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_30;                    // 0x11588(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_29;                    // 0x115B0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x115D8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0x11620(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_28;                    // 0x11778(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x117A0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x117E8(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x11940(0x0158)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_50;                  // 0x11A98(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_49;                  // 0x11B38(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_27;                    // 0x11BD8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_26;                    // 0x11C00(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x11C28(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x11C70(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_14;                 // 0x11CB8(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_25;                    // 0x11D78(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_48;                  // 0x11DA0(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_24;                    // 0x11E40(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_23;                    // 0x11E68(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_13;                 // 0x11E90(0x00C0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_12;                 // 0x11F50(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_22;                    // 0x12010(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_47;                  // 0x12038(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_21;                    // 0x120D8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_20;                    // 0x12100(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_17;                      // 0x12128(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_46;                  // 0x121F0(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_11;                 // 0x12290(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19;                    // 0x12350(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_45;                  // 0x12378(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0x12418(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x12440(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_10;                 // 0x12468(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x12528(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_44;                  // 0x12550(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x125F0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x12618(0x0028)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x12640(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x12758(0x0030)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_16;                      // 0x12788(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x12850(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_43;                  // 0x12918(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x129B8(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x129E0(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_11;            // 0x12AE8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_11;            // 0x12B08(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x12B28(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_10;            // 0x12C30(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_10;            // 0x12C50(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x12C70(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x12C98(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x12CC0(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_9;             // 0x12DC8(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_42;                  // 0x12DE8(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_9;             // 0x12E88(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x12EA8(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8;             // 0x12FB0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x12FD0(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8;             // 0x12FF8(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_41;                  // 0x13018(0x00A0)()
	struct FAnimNode_BSPlayerEx                   AnimGraphNode_BSPlayerEx_20;                       // 0x130B8(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_40;                  // 0x131A8(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x13248(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x13270(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7;             // 0x13378(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7;             // 0x13398(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x133B8(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x133E0(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6;             // 0x134E8(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_39;                  // 0x13508(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6;             // 0x135A8(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_38;                  // 0x135C8(0x00A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x13668(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;             // 0x13770(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;             // 0x13790(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x137B0(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x137D8(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x138E0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x13900(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x13928(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_37;                  // 0x13948(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x139E8(0x0158)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x13B40(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0x13B70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0x13B98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x13BC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0x13BE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x13C10(0x0028)()
