#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Boss_102_Main

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Boss_102_Main.ABP_Boss_102_Main_C
// 0x1C20 (0x21F0 - 0x05D0)
class UABP_Boss_102_Main_C final : public UAnimInstance_Humanoid
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x05D8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x0608(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0720(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0750(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0868(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0898(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x09B0(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x09E0(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0B38(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x0C90(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x0CB8(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0D68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0D90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0DB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0DE0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0E08(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0E88(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0EB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0EE0(0x0028)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_2;                    // 0x0F08(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0FA8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x1028(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x10A8(0x0030)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_1;                    // 0x10D8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1178(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x11F8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1278(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x12A8(0x00B0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x1358(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x1420(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x1468(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x1528(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x1570(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x1598(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x15C0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x15F0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1670(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x16F0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x1718(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x17B8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x1800(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x18A0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x18D0(0x00B0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x1980(0x00B0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1A30(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1A50(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x1A70(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1C20(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1D78(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1DA0(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1E40(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1E68(0x00A0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_2;                   // 0x1F08(0x00A0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x1FA8(0x00A0)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x2048(0x00A0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x20E8(0x00A0)()
	bool                                          RushType;                                          // 0x2188(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bBreak;                                            // 0x2189(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bBreakAnim;                                        // 0x218A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSimulate;                                        // 0x218B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         MaxWaitTime;                                       // 0x218C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaitTime;                                          // 0x2190(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2194[0x4];                                     // 0x2194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USkeletalMeshComponent>  NewVar_0;                                          // 0x2198(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, InstancedReference, HasGetValueTypeHash)
	bool                                          bCastingSkill;                                     // 0x21C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21C1[0x3];                                     // 0x21C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HurtStrengt;                                       // 0x21C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInAbnormal;                                      // 0x21C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21C9[0x3];                                     // 0x21C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DeadType;                                          // 0x21CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FightState;                                        // 0x21D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UpperBodyAimming;                                  // 0x21D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21D5[0x3];                                     // 0x21D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CalHeadIKLoc;                                      // 0x21D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_Boss_102_Main(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Boss_102_Main_AnimGraphNode_TransitionResult_CAC4A9DA44A8385BE3446587F59F3EA9();
	void AnimNotify_StopHurt();
	void ReceiveAdditive(const struct FVector& HitDirection_0, float Strength, const class FString& BoneName);
	void BlueprintBeginPlay();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Boss_102_Main_AnimGraphNode_TransitionResult_688AFAFC4C9C39CB35EAF29813EC940D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Boss_102_Main_AnimGraphNode_BlendListByBool_147F07DC4F9412D3E74B168DABD974BB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Boss_102_Main_AnimGraphNode_BlendListByBool_1E8C539047492B772A0D03A0FF067DDF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Boss_102_Main_AnimGraphNode_TransitionResult_402C8BF945619C8B95A38DA6C87DF19C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Boss_102_Main_AnimGraphNode_TransitionResult_6D41235F45719B11EC307A8497107EA2();
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void GroundIKLayer(const struct FPoseLink& GroundIkInputPose, struct FPoseLink* GroundIKLayer_0);
	void CurveDataLayer(const struct FPoseLink& CurveInputPose, struct FPoseLink* CurveDataLayer_0);
	void HitAddtiveLayer(const struct FPoseLink& HitInputPose, struct FPoseLink* HitAddtiveLayer_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Boss_102_Main_C">();
	}
	static class UABP_Boss_102_Main_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Boss_102_Main_C>();
	}
};
static_assert(alignof(UABP_Boss_102_Main_C) == 0x000010, "Wrong alignment on UABP_Boss_102_Main_C");
static_assert(sizeof(UABP_Boss_102_Main_C) == 0x0021F0, "Wrong size on UABP_Boss_102_Main_C");
static_assert(offsetof(UABP_Boss_102_Main_C, UberGraphFrame) == 0x0005D0, "Member 'UABP_Boss_102_Main_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_Root_3) == 0x0005D8, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_LinkedInputPose_2) == 0x000608, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_Root_2) == 0x000720, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_LinkedInputPose_1) == 0x000750, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_Root_1) == 0x000868, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_LinkedInputPose) == 0x000898, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_Root) == 0x0009B0, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_SaveCachedPose_2) == 0x0009E0, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_SaveCachedPose_1) == 0x000B38, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_UseCachedPose_5) == 0x000C90, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_LinkedAnimLayer_1) == 0x000CB8, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_LinkedAnimLayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_TransitionResult_5) == 0x000D68, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_TransitionResult_4) == 0x000D90, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_TransitionResult_3) == 0x000DB8, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_TransitionResult_2) == 0x000DE0, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_SequencePlayer_6) == 0x000E08, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_StateResult_4) == 0x000E88, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_TransitionResult_1) == 0x000EB8, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_TransitionResult) == 0x000EE0, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_BlendListByInt_2) == 0x000F08, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_BlendListByInt_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_SequencePlayer_5) == 0x000FA8, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_SequencePlayer_4) == 0x001028, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_StateResult_3) == 0x0010A8, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_BlendListByInt_1) == 0x0010D8, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_BlendListByInt_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_SequencePlayer_3) == 0x001178, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_SequencePlayer_2) == 0x0011F8, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_StateResult_2) == 0x001278, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_StateMachine_1) == 0x0012A8, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_ApplyAdditive) == 0x001358, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_Slot_2) == 0x001420, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_LayeredBoneBlend) == 0x001468, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_Slot_1) == 0x001528, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_UseCachedPose_4) == 0x001570, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_UseCachedPose_3) == 0x001598, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_StateResult_1) == 0x0015C0, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_SequencePlayer_1) == 0x0015F0, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_SequencePlayer) == 0x001670, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_UseCachedPose_2) == 0x0016F0, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_BlendListByBool_3) == 0x001718, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_Slot) == 0x0017B8, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_BlendListByBool_2) == 0x001800, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_StateResult) == 0x0018A0, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_StateMachine) == 0x0018D0, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_LinkedAnimLayer) == 0x001980, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_LocalToComponentSpace) == 0x001A30, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_ComponentToLocalSpace) == 0x001A50, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_LookAt) == 0x001A70, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_SaveCachedPose) == 0x001C20, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_UseCachedPose_1) == 0x001D78, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_BlendListByBool_1) == 0x001DA0, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_UseCachedPose) == 0x001E40, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_BlendListByBool) == 0x001E68, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_LinkedAnimGraph_2) == 0x001F08, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_LinkedAnimGraph_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_LinkedAnimGraph_1) == 0x001FA8, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_LinkedAnimGraph_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_BlendListByInt) == 0x002048, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, AnimGraphNode_LinkedAnimGraph) == 0x0020E8, "Member 'UABP_Boss_102_Main_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, RushType) == 0x002188, "Member 'UABP_Boss_102_Main_C::RushType' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, bBreak) == 0x002189, "Member 'UABP_Boss_102_Main_C::bBreak' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, bBreakAnim) == 0x00218A, "Member 'UABP_Boss_102_Main_C::bBreakAnim' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, IsSimulate) == 0x00218B, "Member 'UABP_Boss_102_Main_C::IsSimulate' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, MaxWaitTime) == 0x00218C, "Member 'UABP_Boss_102_Main_C::MaxWaitTime' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, WaitTime) == 0x002190, "Member 'UABP_Boss_102_Main_C::WaitTime' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, NewVar_0) == 0x002198, "Member 'UABP_Boss_102_Main_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, bCastingSkill) == 0x0021C0, "Member 'UABP_Boss_102_Main_C::bCastingSkill' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, HurtStrengt) == 0x0021C4, "Member 'UABP_Boss_102_Main_C::HurtStrengt' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, IsInAbnormal) == 0x0021C8, "Member 'UABP_Boss_102_Main_C::IsInAbnormal' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, DeadType) == 0x0021CC, "Member 'UABP_Boss_102_Main_C::DeadType' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, FightState) == 0x0021D0, "Member 'UABP_Boss_102_Main_C::FightState' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, UpperBodyAimming) == 0x0021D4, "Member 'UABP_Boss_102_Main_C::UpperBodyAimming' has a wrong offset!");
static_assert(offsetof(UABP_Boss_102_Main_C, CalHeadIKLoc) == 0x0021D8, "Member 'UABP_Boss_102_Main_C::CalHeadIKLoc' has a wrong offset!");

}

