#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon_109b_Main

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Mon_109b_Main.ABP_Mon_109b_Main_C
// 0x1640 (0x1C10 - 0x05D0)
class UABP_Mon_109b_Main_C final : public UAnimInstance_Humanoid
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x05D8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x0608(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0720(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0750(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0868(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x0898(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x09F0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x0B48(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x0B70(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0C20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0C48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0C70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0C98(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0CC0(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x0D40(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0DE0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0E60(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x0E90(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0ED8(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0F98(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x0FE0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x1008(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1030(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1060(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x10E0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1160(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x1188(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1228(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x1270(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1310(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1340(0x00B0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x13F0(0x00B0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x14A0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x14C0(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x14E0(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1690(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x17E8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1810(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x18B0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x18D8(0x00A0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x1978(0x00A0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x1A18(0x00A0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1AB8(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1BD0(0x0030)()
	int32                                         FightState;                                        // 0x1C00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_Mon_109b_Main(int32 EntryPoint);
	void BlueprintBeginPlay();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_109b_Main_AnimGraphNode_TransitionResult_AACB8CE849EC683701E572A7CA1A988C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_109b_Main_AnimGraphNode_BlendListByBool_CD4C991E4ED9D038BE51E89366293957();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_109b_Main_AnimGraphNode_BlendListByBool_1BF7025443656CC890C6928F44CFD0B3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_109b_Main_AnimGraphNode_BlendListByBool_298E0867403D6A7C2D3E7EB47BCBD4B2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_109b_Main_AnimGraphNode_TransitionResult_C130B7174506D3A02B3B75BC14B3696B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_109b_Main_AnimGraphNode_TransitionResult_4BB3F74F48B803780841609353B18C92();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_109b_Main_AnimGraphNode_TransitionResult_B9F867A44082D6738E2C66B41BC122A5();
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void GroundIKLayer(const struct FPoseLink& GroundIkInputPose, struct FPoseLink* GroundIKLayer_0);
	void CurveDataLayer(const struct FPoseLink& CurveInputPose, struct FPoseLink* CurveDataLayer_0);
	void HitAddtiveLayer(const struct FPoseLink& HitInputPose, struct FPoseLink* HitAddtiveLayer_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Mon_109b_Main_C">();
	}
	static class UABP_Mon_109b_Main_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Mon_109b_Main_C>();
	}
};
static_assert(alignof(UABP_Mon_109b_Main_C) == 0x000010, "Wrong alignment on UABP_Mon_109b_Main_C");
static_assert(sizeof(UABP_Mon_109b_Main_C) == 0x001C10, "Wrong size on UABP_Mon_109b_Main_C");
static_assert(offsetof(UABP_Mon_109b_Main_C, UberGraphFrame) == 0x0005D0, "Member 'UABP_Mon_109b_Main_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_Root_3) == 0x0005D8, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_LinkedInputPose_2) == 0x000608, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_Root_2) == 0x000720, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_LinkedInputPose_1) == 0x000750, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_Root_1) == 0x000868, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_SaveCachedPose_2) == 0x000898, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_SaveCachedPose_1) == 0x0009F0, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_UseCachedPose_5) == 0x000B48, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_LinkedAnimLayer_1) == 0x000B70, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_LinkedAnimLayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_TransitionResult_3) == 0x000C20, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_TransitionResult_2) == 0x000C48, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_TransitionResult_1) == 0x000C70, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_TransitionResult) == 0x000C98, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_SequencePlayer_3) == 0x000CC0, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_BlendListByBool_4) == 0x000D40, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_SequencePlayer_2) == 0x000DE0, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_StateResult_2) == 0x000E60, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_Slot_2) == 0x000E90, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_LayeredBoneBlend) == 0x000ED8, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_Slot_1) == 0x000F98, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_UseCachedPose_4) == 0x000FE0, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_UseCachedPose_3) == 0x001008, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_StateResult_1) == 0x001030, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_SequencePlayer_1) == 0x001060, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_SequencePlayer) == 0x0010E0, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_UseCachedPose_2) == 0x001160, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_BlendListByBool_3) == 0x001188, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_Slot) == 0x001228, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_BlendListByBool_2) == 0x001270, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_StateResult) == 0x001310, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_StateMachine) == 0x001340, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_LinkedAnimLayer) == 0x0013F0, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_LocalToComponentSpace) == 0x0014A0, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_ComponentToLocalSpace) == 0x0014C0, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_LookAt) == 0x0014E0, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_SaveCachedPose) == 0x001690, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_UseCachedPose_1) == 0x0017E8, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_BlendListByBool_1) == 0x001810, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_UseCachedPose) == 0x0018B0, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_BlendListByBool) == 0x0018D8, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_LinkedAnimGraph_1) == 0x001978, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_LinkedAnimGraph_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_LinkedAnimGraph) == 0x001A18, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_LinkedInputPose) == 0x001AB8, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, AnimGraphNode_Root) == 0x001BD0, "Member 'UABP_Mon_109b_Main_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Mon_109b_Main_C, FightState) == 0x001C00, "Member 'UABP_Mon_109b_Main_C::FightState' has a wrong offset!");

}

