#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PostProcessAnim

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_PostProcessAnim.ABP_PostProcessAnim_C.GroundIKLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_PostProcessAnim_C_GroundIKLayer final
{
public:
	struct FPoseLink                              GroundIkInputPose;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              GroundIKLayer_0;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_PostProcessAnim_C_GroundIKLayer) == 0x000008, "Wrong alignment on ABP_PostProcessAnim_C_GroundIKLayer");
static_assert(sizeof(ABP_PostProcessAnim_C_GroundIKLayer) == 0x000020, "Wrong size on ABP_PostProcessAnim_C_GroundIKLayer");
static_assert(offsetof(ABP_PostProcessAnim_C_GroundIKLayer, GroundIkInputPose) == 0x000000, "Member 'ABP_PostProcessAnim_C_GroundIKLayer::GroundIkInputPose' has a wrong offset!");
static_assert(offsetof(ABP_PostProcessAnim_C_GroundIKLayer, GroundIKLayer_0) == 0x000010, "Member 'ABP_PostProcessAnim_C_GroundIKLayer::GroundIKLayer_0' has a wrong offset!");

// Function ABP_PostProcessAnim.ABP_PostProcessAnim_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_PostProcessAnim_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_PostProcessAnim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_PostProcessAnim_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_PostProcessAnim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_PostProcessAnim_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_PostProcessAnim_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_PostProcessAnim_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_PostProcessAnim.ABP_PostProcessAnim_C.HitAddtiveLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_PostProcessAnim_C_HitAddtiveLayer final
{
public:
	struct FPoseLink                              HitInputPose;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              HitAddtiveLayer_0;                                 // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_PostProcessAnim_C_HitAddtiveLayer) == 0x000008, "Wrong alignment on ABP_PostProcessAnim_C_HitAddtiveLayer");
static_assert(sizeof(ABP_PostProcessAnim_C_HitAddtiveLayer) == 0x000020, "Wrong size on ABP_PostProcessAnim_C_HitAddtiveLayer");
static_assert(offsetof(ABP_PostProcessAnim_C_HitAddtiveLayer, HitInputPose) == 0x000000, "Member 'ABP_PostProcessAnim_C_HitAddtiveLayer::HitInputPose' has a wrong offset!");
static_assert(offsetof(ABP_PostProcessAnim_C_HitAddtiveLayer, HitAddtiveLayer_0) == 0x000010, "Member 'ABP_PostProcessAnim_C_HitAddtiveLayer::HitAddtiveLayer_0' has a wrong offset!");

// Function ABP_PostProcessAnim.ABP_PostProcessAnim_C.CurveDataLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_PostProcessAnim_C_CurveDataLayer final
{
public:
	struct FPoseLink                              CurveInputPose;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              CurveDataLayer_0;                                  // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_PostProcessAnim_C_CurveDataLayer) == 0x000008, "Wrong alignment on ABP_PostProcessAnim_C_CurveDataLayer");
static_assert(sizeof(ABP_PostProcessAnim_C_CurveDataLayer) == 0x000020, "Wrong size on ABP_PostProcessAnim_C_CurveDataLayer");
static_assert(offsetof(ABP_PostProcessAnim_C_CurveDataLayer, CurveInputPose) == 0x000000, "Member 'ABP_PostProcessAnim_C_CurveDataLayer::CurveInputPose' has a wrong offset!");
static_assert(offsetof(ABP_PostProcessAnim_C_CurveDataLayer, CurveDataLayer_0) == 0x000010, "Member 'ABP_PostProcessAnim_C_CurveDataLayer::CurveDataLayer_0' has a wrong offset!");

// Function ABP_PostProcessAnim.ABP_PostProcessAnim_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_PostProcessAnim_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_PostProcessAnim_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_PostProcessAnim_C_AnimGraph");
static_assert(sizeof(ABP_PostProcessAnim_C_AnimGraph) == 0x000010, "Wrong size on ABP_PostProcessAnim_C_AnimGraph");
static_assert(offsetof(ABP_PostProcessAnim_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_PostProcessAnim_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_PostProcessAnim.ABP_PostProcessAnim_C.ExecuteUbergraph_ABP_PostProcessAnim
// 0x0008 (0x0008 - 0x0000)
struct ABP_PostProcessAnim_C_ExecuteUbergraph_ABP_PostProcessAnim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_PostProcessAnim_C_ExecuteUbergraph_ABP_PostProcessAnim) == 0x000004, "Wrong alignment on ABP_PostProcessAnim_C_ExecuteUbergraph_ABP_PostProcessAnim");
static_assert(sizeof(ABP_PostProcessAnim_C_ExecuteUbergraph_ABP_PostProcessAnim) == 0x000008, "Wrong size on ABP_PostProcessAnim_C_ExecuteUbergraph_ABP_PostProcessAnim");
static_assert(offsetof(ABP_PostProcessAnim_C_ExecuteUbergraph_ABP_PostProcessAnim, EntryPoint) == 0x000000, "Member 'ABP_PostProcessAnim_C_ExecuteUbergraph_ABP_PostProcessAnim::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_PostProcessAnim_C_ExecuteUbergraph_ABP_PostProcessAnim, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'ABP_PostProcessAnim_C_ExecuteUbergraph_ABP_PostProcessAnim::K2Node_Event_DeltaTimeX' has a wrong offset!");

}

