#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_girl002_Phy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "ControlRig_structs.hpp"
#include "SeasunAnimGraph_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_girl002_Phy.ABP_girl002_Phy_C
// 0x94A0 (0x9760 - 0x02C0)
class UABP_girl002_Phy_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_39;                    // 0x02D0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_38;                    // 0x0660(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_37;                    // 0x09F0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_36;                    // 0x0D80(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_35;                    // 0x1110(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_34;                    // 0x14A0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_33;                    // 0x1830(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_32;                    // 0x1BC0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_31;                    // 0x1F50(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_30;                    // 0x22E0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_29;                    // 0x2670(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_28;                    // 0x2A00(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_27;                    // 0x2D90(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_26;                    // 0x3120(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_25;                    // 0x34B0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_24;                    // 0x3840(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_23;                    // 0x3BD0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_22;                    // 0x3F60(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_21;                    // 0x42F0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_20;                    // 0x4680(0x0390)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x4A10(0x0368)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x4D78(0x0070)()
	uint8                                         Pad_4DE8[0x8];                                     // 0x4DE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0x4DF0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0x5180(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0x5510(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0x58A0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0x5C30(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x5FC0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x6350(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x66E0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x6A70(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x6E00(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x7190(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x7520(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x78B0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x7C40(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x7FD0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x8360(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x86F0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x8A80(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x8E10(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x91A0(0x0390)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x9530(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x9550(0x0020)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x9570(0x00A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x9610(0x0030)()
	struct FAnimNode_ReLocMesh                    AnimGraphNode_ReLocMesh;                           // 0x9640(0x00D8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x9718(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x9738(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ABP_girl002_Phy(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_girl002_Phy_C">();
	}
	static class UABP_girl002_Phy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_girl002_Phy_C>();
	}
};
static_assert(alignof(UABP_girl002_Phy_C) == 0x000010, "Wrong alignment on UABP_girl002_Phy_C");
static_assert(sizeof(UABP_girl002_Phy_C) == 0x009760, "Wrong size on UABP_girl002_Phy_C");
static_assert(offsetof(UABP_girl002_Phy_C, UberGraphFrame) == 0x0002C0, "Member 'UABP_girl002_Phy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_39) == 0x0002D0, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_39' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_38) == 0x000660, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_38' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_37) == 0x0009F0, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_37' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_36) == 0x000D80, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_36' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_35) == 0x001110, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_35' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_34) == 0x0014A0, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_34' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_33) == 0x001830, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_33' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_32) == 0x001BC0, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_32' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_31) == 0x001F50, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_31' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_30) == 0x0022E0, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_30' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_29) == 0x002670, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_29' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_28) == 0x002A00, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_28' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_27) == 0x002D90, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_27' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_26) == 0x003120, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_26' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_25) == 0x0034B0, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_25' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_24) == 0x003840, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_24' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_23) == 0x003BD0, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_23' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_22) == 0x003F60, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_22' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_21) == 0x0042F0, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_21' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_20) == 0x004680, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_20' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_ControlRig) == 0x004A10, "Member 'UABP_girl002_Phy_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_Inertialization) == 0x004D78, "Member 'UABP_girl002_Phy_C::AnimGraphNode_Inertialization' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_19) == 0x004DF0, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_19' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_18) == 0x005180, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_18' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_17) == 0x005510, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_17' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_16) == 0x0058A0, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_16' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_15) == 0x005C30, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_15' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_14) == 0x005FC0, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_14' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_13) == 0x006350, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_13' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_12) == 0x0066E0, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_12' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_11) == 0x006A70, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_11' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_10) == 0x006E00, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_10' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_9) == 0x007190, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_8) == 0x007520, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_7) == 0x0078B0, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_6) == 0x007C40, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_5) == 0x007FD0, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_4) == 0x008360, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_3) == 0x0086F0, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_2) == 0x008A80, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics_1) == 0x008E10, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_KawaiiPhysics) == 0x0091A0, "Member 'UABP_girl002_Phy_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_LocalToComponentSpace_1) == 0x009530, "Member 'UABP_girl002_Phy_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x009550, "Member 'UABP_girl002_Phy_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_LinkedAnimGraph) == 0x009570, "Member 'UABP_girl002_Phy_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_Root) == 0x009610, "Member 'UABP_girl002_Phy_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_ReLocMesh) == 0x009640, "Member 'UABP_girl002_Phy_C::AnimGraphNode_ReLocMesh' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_LocalToComponentSpace) == 0x009718, "Member 'UABP_girl002_Phy_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_girl002_Phy_C, AnimGraphNode_ComponentToLocalSpace) == 0x009738, "Member 'UABP_girl002_Phy_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");

}

