#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Boss_102_Main

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_Boss_102_Main.ABP_Boss_102_Main_C.ExecuteUbergraph_ABP_Boss_102_Main
// 0x00F0 (0x00F0 - 0x0000)
struct ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAlive_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FVector& HitDirection, float Strength, const class FString& BoneName)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsInFightState_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue_1;                    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitDirection;                   // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Strength;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_BoneName;                       // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue_2;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_1;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character_1;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsInAbnormal_ReturnValue;              // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetBlackboardState_ReturnValue;           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue_3;                    // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_2;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character_2;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInFightState_ReturnValue_1;             // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAbilityCharacterInterface> CallFunc_GetAbilityComponent_self_CastInput;       // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilityComponentBase*                  CallFunc_GetAbilityComponent_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCastingSkill_ReturnValue;               // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CalcBoneLookAt_ReturnValue;               // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main) == 0x000008, "Wrong alignment on ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main");
static_assert(sizeof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main) == 0x0000F0, "Wrong size on ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, EntryPoint) == 0x000000, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000004, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_MakeLiteralByte_ReturnValue) == 0x000005, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000007, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_IsAlive_ReturnValue) == 0x000008, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_IsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_IsInFightState_ReturnValue) == 0x00001C, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_IsInFightState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_IsAlive_ReturnValue_1) == 0x00001D, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_IsAlive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_Not_PreBool_ReturnValue) == 0x00001E, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_Not_PreBool_ReturnValue_1) == 0x00001F, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_BooleanAND_ReturnValue) == 0x000020, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, K2Node_Event_DeltaTimeX) == 0x000024, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000028, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, K2Node_CustomEvent_HitDirection) == 0x000030, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::K2Node_CustomEvent_HitDirection' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, K2Node_CustomEvent_Strength) == 0x00003C, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::K2Node_CustomEvent_Strength' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, K2Node_CustomEvent_BoneName) == 0x000040, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, K2Node_DynamicCast_AsGame_Character) == 0x000050, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_IsAlive_ReturnValue_2) == 0x000059, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_IsAlive_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_TryGetPawnOwner_ReturnValue_1) == 0x000060, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_TryGetPawnOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_Not_PreBool_ReturnValue_2) == 0x000068, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, K2Node_DynamicCast_AsGame_Character_1) == 0x000070, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::K2Node_DynamicCast_AsGame_Character_1' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_IsValid_ReturnValue) == 0x000079, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_GetIsInAbnormal_ReturnValue) == 0x00007A, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_GetIsInAbnormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_RandomIntegerInRange_ReturnValue) == 0x00007C, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_GetBlackboardState_ReturnValue) == 0x000080, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_GetBlackboardState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000081, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000082, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000083, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_IsAlive_ReturnValue_3) == 0x000084, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_IsAlive_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_TryGetPawnOwner_ReturnValue_2) == 0x000088, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_TryGetPawnOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, K2Node_DynamicCast_AsGame_Character_2) == 0x000090, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::K2Node_DynamicCast_AsGame_Character_2' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, K2Node_DynamicCast_bSuccess_2) == 0x000098, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_IsInFightState_ReturnValue_1) == 0x000099, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_IsInFightState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_GetAbilityComponent_self_CastInput) == 0x0000A0, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_GetAbilityComponent_self_CastInput' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_GetAbilityComponent_ReturnValue) == 0x0000B0, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_GetAbilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_BooleanAND_ReturnValue_1) == 0x0000B8, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_IsCastingSkill_ReturnValue) == 0x0000B9, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_IsCastingSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_MakeLiteralName_ReturnValue) == 0x0000BC, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000C4, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_MakeVector_ReturnValue) == 0x0000C8, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_MakeVector_ReturnValue_1) == 0x0000D4, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main, CallFunc_CalcBoneLookAt_ReturnValue) == 0x0000E0, "Member 'ABP_Boss_102_Main_C_ExecuteUbergraph_ABP_Boss_102_Main::CallFunc_CalcBoneLookAt_ReturnValue' has a wrong offset!");

// Function ABP_Boss_102_Main.ABP_Boss_102_Main_C.ReceiveAdditive
// 0x0020 (0x0020 - 0x0000)
struct ABP_Boss_102_Main_C_ReceiveAdditive final
{
public:
	struct FVector                                HitDirection_0;                                    // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Strength;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 BoneName;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Boss_102_Main_C_ReceiveAdditive) == 0x000008, "Wrong alignment on ABP_Boss_102_Main_C_ReceiveAdditive");
static_assert(sizeof(ABP_Boss_102_Main_C_ReceiveAdditive) == 0x000020, "Wrong size on ABP_Boss_102_Main_C_ReceiveAdditive");
static_assert(offsetof(ABP_Boss_102_Main_C_ReceiveAdditive, HitDirection_0) == 0x000000, "Member 'ABP_Boss_102_Main_C_ReceiveAdditive::HitDirection_0' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ReceiveAdditive, Strength) == 0x00000C, "Member 'ABP_Boss_102_Main_C_ReceiveAdditive::Strength' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_ReceiveAdditive, BoneName) == 0x000010, "Member 'ABP_Boss_102_Main_C_ReceiveAdditive::BoneName' has a wrong offset!");

// Function ABP_Boss_102_Main.ABP_Boss_102_Main_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Boss_102_Main_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Boss_102_Main_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Boss_102_Main_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Boss_102_Main_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Boss_102_Main_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Boss_102_Main_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Boss_102_Main_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Boss_102_Main.ABP_Boss_102_Main_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Boss_102_Main_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Boss_102_Main_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Boss_102_Main_C_AnimGraph");
static_assert(sizeof(ABP_Boss_102_Main_C_AnimGraph) == 0x000010, "Wrong size on ABP_Boss_102_Main_C_AnimGraph");
static_assert(offsetof(ABP_Boss_102_Main_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Boss_102_Main_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Boss_102_Main.ABP_Boss_102_Main_C.GroundIKLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_Boss_102_Main_C_GroundIKLayer final
{
public:
	struct FPoseLink                              GroundIkInputPose;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              GroundIKLayer_0;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Boss_102_Main_C_GroundIKLayer) == 0x000008, "Wrong alignment on ABP_Boss_102_Main_C_GroundIKLayer");
static_assert(sizeof(ABP_Boss_102_Main_C_GroundIKLayer) == 0x000020, "Wrong size on ABP_Boss_102_Main_C_GroundIKLayer");
static_assert(offsetof(ABP_Boss_102_Main_C_GroundIKLayer, GroundIkInputPose) == 0x000000, "Member 'ABP_Boss_102_Main_C_GroundIKLayer::GroundIkInputPose' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_GroundIKLayer, GroundIKLayer_0) == 0x000010, "Member 'ABP_Boss_102_Main_C_GroundIKLayer::GroundIKLayer_0' has a wrong offset!");

// Function ABP_Boss_102_Main.ABP_Boss_102_Main_C.CurveDataLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_Boss_102_Main_C_CurveDataLayer final
{
public:
	struct FPoseLink                              CurveInputPose;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              CurveDataLayer_0;                                  // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Boss_102_Main_C_CurveDataLayer) == 0x000008, "Wrong alignment on ABP_Boss_102_Main_C_CurveDataLayer");
static_assert(sizeof(ABP_Boss_102_Main_C_CurveDataLayer) == 0x000020, "Wrong size on ABP_Boss_102_Main_C_CurveDataLayer");
static_assert(offsetof(ABP_Boss_102_Main_C_CurveDataLayer, CurveInputPose) == 0x000000, "Member 'ABP_Boss_102_Main_C_CurveDataLayer::CurveInputPose' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_CurveDataLayer, CurveDataLayer_0) == 0x000010, "Member 'ABP_Boss_102_Main_C_CurveDataLayer::CurveDataLayer_0' has a wrong offset!");

// Function ABP_Boss_102_Main.ABP_Boss_102_Main_C.HitAddtiveLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_Boss_102_Main_C_HitAddtiveLayer final
{
public:
	struct FPoseLink                              HitInputPose;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              HitAddtiveLayer_0;                                 // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Boss_102_Main_C_HitAddtiveLayer) == 0x000008, "Wrong alignment on ABP_Boss_102_Main_C_HitAddtiveLayer");
static_assert(sizeof(ABP_Boss_102_Main_C_HitAddtiveLayer) == 0x000020, "Wrong size on ABP_Boss_102_Main_C_HitAddtiveLayer");
static_assert(offsetof(ABP_Boss_102_Main_C_HitAddtiveLayer, HitInputPose) == 0x000000, "Member 'ABP_Boss_102_Main_C_HitAddtiveLayer::HitInputPose' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_Main_C_HitAddtiveLayer, HitAddtiveLayer_0) == 0x000010, "Member 'ABP_Boss_102_Main_C_HitAddtiveLayer::HitAddtiveLayer_0' has a wrong offset!");

}

