#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon_108_Main

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Mon_108_Main.ABP_Mon_108_Main_C.ExecuteUbergraph_ABP_Mon_108_Main
// 0x0028 (0x0028 - 0x0000)
struct ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInFightState_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue_1;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInFightState_ReturnValue_1;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue_2;                    // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue_3;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_GetIdleAnim_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main) == 0x000008, "Wrong alignment on ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main");
static_assert(sizeof(ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main) == 0x000028, "Wrong size on ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main");
static_assert(offsetof(ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main, EntryPoint) == 0x000000, "Member 'ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main, CallFunc_IsInFightState_ReturnValue) == 0x000008, "Member 'ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main::CallFunc_IsInFightState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main, CallFunc_IsAlive_ReturnValue) == 0x000009, "Member 'ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main::CallFunc_IsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main, CallFunc_IsAlive_ReturnValue_1) == 0x00000A, "Member 'ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main::CallFunc_IsAlive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main, CallFunc_Not_PreBool_ReturnValue) == 0x00000B, "Member 'ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main, CallFunc_IsInFightState_ReturnValue_1) == 0x00000C, "Member 'ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main::CallFunc_IsInFightState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main, CallFunc_Not_PreBool_ReturnValue_1) == 0x00000D, "Member 'ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main, CallFunc_IsAlive_ReturnValue_2) == 0x00000E, "Member 'ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main::CallFunc_IsAlive_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main, CallFunc_BooleanAND_ReturnValue) == 0x00000F, "Member 'ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main, CallFunc_Not_PreBool_ReturnValue_2) == 0x000010, "Member 'ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main, CallFunc_IsAlive_ReturnValue_3) == 0x000011, "Member 'ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main::CallFunc_IsAlive_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main, CallFunc_GetIdleAnim_ReturnValue) == 0x000018, "Member 'ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main::CallFunc_GetIdleAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main, CallFunc_BooleanAND_ReturnValue_1) == 0x000020, "Member 'ABP_Mon_108_Main_C_ExecuteUbergraph_ABP_Mon_108_Main::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function ABP_Mon_108_Main.ABP_Mon_108_Main_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Mon_108_Main_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Mon_108_Main_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Mon_108_Main_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Mon_108_Main_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Mon_108_Main_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Mon_108_Main_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Mon_108_Main_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Mon_108_Main.ABP_Mon_108_Main_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Mon_108_Main_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Mon_108_Main_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Mon_108_Main_C_AnimGraph");
static_assert(sizeof(ABP_Mon_108_Main_C_AnimGraph) == 0x000010, "Wrong size on ABP_Mon_108_Main_C_AnimGraph");
static_assert(offsetof(ABP_Mon_108_Main_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Mon_108_Main_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Mon_108_Main.ABP_Mon_108_Main_C.GroundIKLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_Mon_108_Main_C_GroundIKLayer final
{
public:
	struct FPoseLink                              GroundIkInputPose;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              GroundIKLayer_0;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Mon_108_Main_C_GroundIKLayer) == 0x000008, "Wrong alignment on ABP_Mon_108_Main_C_GroundIKLayer");
static_assert(sizeof(ABP_Mon_108_Main_C_GroundIKLayer) == 0x000020, "Wrong size on ABP_Mon_108_Main_C_GroundIKLayer");
static_assert(offsetof(ABP_Mon_108_Main_C_GroundIKLayer, GroundIkInputPose) == 0x000000, "Member 'ABP_Mon_108_Main_C_GroundIKLayer::GroundIkInputPose' has a wrong offset!");
static_assert(offsetof(ABP_Mon_108_Main_C_GroundIKLayer, GroundIKLayer_0) == 0x000010, "Member 'ABP_Mon_108_Main_C_GroundIKLayer::GroundIKLayer_0' has a wrong offset!");

// Function ABP_Mon_108_Main.ABP_Mon_108_Main_C.CurveDataLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_Mon_108_Main_C_CurveDataLayer final
{
public:
	struct FPoseLink                              CurveInputPose;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              CurveDataLayer_0;                                  // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Mon_108_Main_C_CurveDataLayer) == 0x000008, "Wrong alignment on ABP_Mon_108_Main_C_CurveDataLayer");
static_assert(sizeof(ABP_Mon_108_Main_C_CurveDataLayer) == 0x000020, "Wrong size on ABP_Mon_108_Main_C_CurveDataLayer");
static_assert(offsetof(ABP_Mon_108_Main_C_CurveDataLayer, CurveInputPose) == 0x000000, "Member 'ABP_Mon_108_Main_C_CurveDataLayer::CurveInputPose' has a wrong offset!");
static_assert(offsetof(ABP_Mon_108_Main_C_CurveDataLayer, CurveDataLayer_0) == 0x000010, "Member 'ABP_Mon_108_Main_C_CurveDataLayer::CurveDataLayer_0' has a wrong offset!");

// Function ABP_Mon_108_Main.ABP_Mon_108_Main_C.HitAddtiveLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_Mon_108_Main_C_HitAddtiveLayer final
{
public:
	struct FPoseLink                              HitInputPose;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              HitAddtiveLayer_0;                                 // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Mon_108_Main_C_HitAddtiveLayer) == 0x000008, "Wrong alignment on ABP_Mon_108_Main_C_HitAddtiveLayer");
static_assert(sizeof(ABP_Mon_108_Main_C_HitAddtiveLayer) == 0x000020, "Wrong size on ABP_Mon_108_Main_C_HitAddtiveLayer");
static_assert(offsetof(ABP_Mon_108_Main_C_HitAddtiveLayer, HitInputPose) == 0x000000, "Member 'ABP_Mon_108_Main_C_HitAddtiveLayer::HitInputPose' has a wrong offset!");
static_assert(offsetof(ABP_Mon_108_Main_C_HitAddtiveLayer, HitAddtiveLayer_0) == 0x000010, "Member 'ABP_Mon_108_Main_C_HitAddtiveLayer::HitAddtiveLayer_0' has a wrong offset!");

}

