#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Girl006a_Phy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "ControlRig_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Girl006a_Phy.ABP_Girl006a_Phy_C
// 0x13040 (0x13300 - 0x02C0)
class UABP_Girl006a_Phy_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_83;                    // 0x02D0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_82;                    // 0x0660(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_81;                    // 0x09F0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_80;                    // 0x0D80(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_79;                    // 0x1110(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_78;                    // 0x14A0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_77;                    // 0x1830(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_76;                    // 0x1BC0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_75;                    // 0x1F50(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_74;                    // 0x22E0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_73;                    // 0x2670(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_72;                    // 0x2A00(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_71;                    // 0x2D90(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_70;                    // 0x3120(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_69;                    // 0x34B0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_68;                    // 0x3840(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_67;                    // 0x3BD0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_66;                    // 0x3F60(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_65;                    // 0x42F0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_64;                    // 0x4680(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_63;                    // 0x4A10(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_62;                    // 0x4DA0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_61;                    // 0x5130(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_60;                    // 0x54C0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_59;                    // 0x5850(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_58;                    // 0x5BE0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_57;                    // 0x5F70(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_56;                    // 0x6300(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_55;                    // 0x6690(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_54;                    // 0x6A20(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_53;                    // 0x6DB0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_52;                    // 0x7140(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_51;                    // 0x74D0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_50;                    // 0x7860(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_49;                    // 0x7BF0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_48;                    // 0x7F80(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_47;                    // 0x8310(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_46;                    // 0x86A0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_45;                    // 0x8A30(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_44;                    // 0x8DC0(0x0390)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x9150(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x9170(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_43;                    // 0x9190(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_42;                    // 0x9520(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_41;                    // 0x98B0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_40;                    // 0x9C40(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_39;                    // 0x9FD0(0x0390)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0xA360(0x0368)()
	uint8                                         Pad_A6C8[0x8];                                     // 0xA6C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_38;                    // 0xA6D0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_37;                    // 0xAA60(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_36;                    // 0xADF0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_35;                    // 0xB180(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_34;                    // 0xB510(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_33;                    // 0xB8A0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_32;                    // 0xBC30(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_31;                    // 0xBFC0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_30;                    // 0xC350(0x0390)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0xC6E0(0x0070)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_29;                    // 0xC750(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_28;                    // 0xCAE0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_27;                    // 0xCE70(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_26;                    // 0xD200(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_25;                    // 0xD590(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_24;                    // 0xD920(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_23;                    // 0xDCB0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_22;                    // 0xE040(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_21;                    // 0xE3D0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_20;                    // 0xE760(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0xEAF0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0xEE80(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0xF210(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0xF5A0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0xF930(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0xFCC0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x10050(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x103E0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x10770(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x10B00(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x10E90(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x11220(0x0390)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x115B0(0x00A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x11650(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x119E0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x11D70(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x12100(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x12490(0x0390)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x12820(0x0030)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x12850(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x12BE0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x12F70(0x0390)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ABP_Girl006a_Phy(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Girl006a_Phy_C">();
	}
	static class UABP_Girl006a_Phy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Girl006a_Phy_C>();
	}
};
static_assert(alignof(UABP_Girl006a_Phy_C) == 0x000010, "Wrong alignment on UABP_Girl006a_Phy_C");
static_assert(sizeof(UABP_Girl006a_Phy_C) == 0x013300, "Wrong size on UABP_Girl006a_Phy_C");
static_assert(offsetof(UABP_Girl006a_Phy_C, UberGraphFrame) == 0x0002C0, "Member 'UABP_Girl006a_Phy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_83) == 0x0002D0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_83' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_82) == 0x000660, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_82' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_81) == 0x0009F0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_81' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_80) == 0x000D80, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_80' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_79) == 0x001110, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_79' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_78) == 0x0014A0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_78' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_77) == 0x001830, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_77' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_76) == 0x001BC0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_76' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_75) == 0x001F50, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_75' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_74) == 0x0022E0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_74' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_73) == 0x002670, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_73' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_72) == 0x002A00, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_72' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_71) == 0x002D90, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_71' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_70) == 0x003120, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_70' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_69) == 0x0034B0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_69' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_68) == 0x003840, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_68' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_67) == 0x003BD0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_67' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_66) == 0x003F60, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_66' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_65) == 0x0042F0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_65' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_64) == 0x004680, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_64' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_63) == 0x004A10, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_63' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_62) == 0x004DA0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_62' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_61) == 0x005130, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_61' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_60) == 0x0054C0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_60' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_59) == 0x005850, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_59' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_58) == 0x005BE0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_58' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_57) == 0x005F70, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_57' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_56) == 0x006300, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_56' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_55) == 0x006690, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_55' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_54) == 0x006A20, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_54' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_53) == 0x006DB0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_53' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_52) == 0x007140, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_52' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_51) == 0x0074D0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_51' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_50) == 0x007860, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_50' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_49) == 0x007BF0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_49' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_48) == 0x007F80, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_48' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_47) == 0x008310, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_47' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_46) == 0x0086A0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_46' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_45) == 0x008A30, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_45' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_44) == 0x008DC0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_44' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_ComponentToLocalSpace) == 0x009150, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_LocalToComponentSpace) == 0x009170, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_43) == 0x009190, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_43' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_42) == 0x009520, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_42' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_41) == 0x0098B0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_41' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_40) == 0x009C40, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_40' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_39) == 0x009FD0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_39' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_ControlRig) == 0x00A360, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_38) == 0x00A6D0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_38' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_37) == 0x00AA60, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_37' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_36) == 0x00ADF0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_36' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_35) == 0x00B180, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_35' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_34) == 0x00B510, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_34' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_33) == 0x00B8A0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_33' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_32) == 0x00BC30, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_32' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_31) == 0x00BFC0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_31' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_30) == 0x00C350, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_30' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_Inertialization) == 0x00C6E0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_Inertialization' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_29) == 0x00C750, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_29' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_28) == 0x00CAE0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_28' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_27) == 0x00CE70, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_27' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_26) == 0x00D200, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_26' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_25) == 0x00D590, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_25' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_24) == 0x00D920, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_24' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_23) == 0x00DCB0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_23' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_22) == 0x00E040, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_22' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_21) == 0x00E3D0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_21' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_20) == 0x00E760, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_20' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_19) == 0x00EAF0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_19' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_18) == 0x00EE80, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_18' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_17) == 0x00F210, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_17' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_16) == 0x00F5A0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_16' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_15) == 0x00F930, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_15' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_14) == 0x00FCC0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_14' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_13) == 0x010050, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_13' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_12) == 0x0103E0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_12' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_11) == 0x010770, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_11' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_10) == 0x010B00, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_10' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_9) == 0x010E90, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_8) == 0x011220, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_LinkedAnimGraph) == 0x0115B0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_7) == 0x011650, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_6) == 0x0119E0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_5) == 0x011D70, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_4) == 0x012100, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_3) == 0x012490, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_Root) == 0x012820, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_2) == 0x012850, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics_1) == 0x012BE0, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_Girl006a_Phy_C, AnimGraphNode_KawaiiPhysics) == 0x012F70, "Member 'UABP_Girl006a_Phy_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");

}

