#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon_110_Part01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Mon_110_Part01.ABP_Mon_110_Part01_C
// 0x03C0 (0x0680 - 0x02C0)
class UABP_Mon_110_Part01_C final : public UAnimInstance_AccessoryBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x02F8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0340(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0368(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0390(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x03B8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0438(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0468(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x04E8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0518(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0598(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x05C8(0x00B0)()
	bool                                          bInFight;                                          // 0x0678(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_110_Part01_AnimGraphNode_TransitionResult_EEAA5A9E41D83620E3F258A1157E323C();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_Mon_110_Part01(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Mon_110_Part01_C">();
	}
	static class UABP_Mon_110_Part01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Mon_110_Part01_C>();
	}
};
static_assert(alignof(UABP_Mon_110_Part01_C) == 0x000010, "Wrong alignment on UABP_Mon_110_Part01_C");
static_assert(sizeof(UABP_Mon_110_Part01_C) == 0x000680, "Wrong size on UABP_Mon_110_Part01_C");
static_assert(offsetof(UABP_Mon_110_Part01_C, UberGraphFrame) == 0x0002C0, "Member 'UABP_Mon_110_Part01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Part01_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UABP_Mon_110_Part01_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Part01_C, AnimGraphNode_Slot) == 0x0002F8, "Member 'UABP_Mon_110_Part01_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Part01_C, AnimGraphNode_TransitionResult_2) == 0x000340, "Member 'UABP_Mon_110_Part01_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Part01_C, AnimGraphNode_TransitionResult_1) == 0x000368, "Member 'UABP_Mon_110_Part01_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Part01_C, AnimGraphNode_TransitionResult) == 0x000390, "Member 'UABP_Mon_110_Part01_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Part01_C, AnimGraphNode_SequencePlayer_2) == 0x0003B8, "Member 'UABP_Mon_110_Part01_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Part01_C, AnimGraphNode_StateResult_2) == 0x000438, "Member 'UABP_Mon_110_Part01_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Part01_C, AnimGraphNode_SequencePlayer_1) == 0x000468, "Member 'UABP_Mon_110_Part01_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Part01_C, AnimGraphNode_StateResult_1) == 0x0004E8, "Member 'UABP_Mon_110_Part01_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Part01_C, AnimGraphNode_SequencePlayer) == 0x000518, "Member 'UABP_Mon_110_Part01_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Part01_C, AnimGraphNode_StateResult) == 0x000598, "Member 'UABP_Mon_110_Part01_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Part01_C, AnimGraphNode_StateMachine) == 0x0005C8, "Member 'UABP_Mon_110_Part01_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Mon_110_Part01_C, bInFight) == 0x000678, "Member 'UABP_Mon_110_Part01_C::bInFight' has a wrong offset!");

}

