#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_wpbase_wp08_FQ

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_wpbase_wp08_FQ.ABP_wpbase_wp08_FQ_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_wpbase_wp08_FQ_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_wpbase_wp08_FQ_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_wpbase_wp08_FQ_C_AnimGraph");
static_assert(sizeof(ABP_wpbase_wp08_FQ_C_AnimGraph) == 0x000010, "Wrong size on ABP_wpbase_wp08_FQ_C_AnimGraph");
static_assert(offsetof(ABP_wpbase_wp08_FQ_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_wpbase_wp08_FQ_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_wpbase_wp08_FQ.ABP_wpbase_wp08_FQ_C.ExecuteUbergraph_ABP_wpbase_wp08_FQ
// 0x001C (0x001C - 0x0000)
struct ABP_wpbase_wp08_FQ_C_ExecuteUbergraph_ABP_wpbase_wp08_FQ final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_wpbase_wp08_FQ_C_ExecuteUbergraph_ABP_wpbase_wp08_FQ) == 0x000004, "Wrong alignment on ABP_wpbase_wp08_FQ_C_ExecuteUbergraph_ABP_wpbase_wp08_FQ");
static_assert(sizeof(ABP_wpbase_wp08_FQ_C_ExecuteUbergraph_ABP_wpbase_wp08_FQ) == 0x00001C, "Wrong size on ABP_wpbase_wp08_FQ_C_ExecuteUbergraph_ABP_wpbase_wp08_FQ");
static_assert(offsetof(ABP_wpbase_wp08_FQ_C_ExecuteUbergraph_ABP_wpbase_wp08_FQ, EntryPoint) == 0x000000, "Member 'ABP_wpbase_wp08_FQ_C_ExecuteUbergraph_ABP_wpbase_wp08_FQ::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_wpbase_wp08_FQ_C_ExecuteUbergraph_ABP_wpbase_wp08_FQ, CallFunc_MakeRotator_ReturnValue) == 0x000004, "Member 'ABP_wpbase_wp08_FQ_C_ExecuteUbergraph_ABP_wpbase_wp08_FQ::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_wpbase_wp08_FQ_C_ExecuteUbergraph_ABP_wpbase_wp08_FQ, CallFunc_MakeRotator_ReturnValue_1) == 0x000010, "Member 'ABP_wpbase_wp08_FQ_C_ExecuteUbergraph_ABP_wpbase_wp08_FQ::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");

}

