#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_GirlBase_HeadBase

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_GirlBase_HeadBase.ABP_GirlBase_HeadBase_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_GirlBase_HeadBase_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBase_HeadBase_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_GirlBase_HeadBase_C_AnimGraph");
static_assert(sizeof(ABP_GirlBase_HeadBase_C_AnimGraph) == 0x000010, "Wrong size on ABP_GirlBase_HeadBase_C_AnimGraph");
static_assert(offsetof(ABP_GirlBase_HeadBase_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_GirlBase_HeadBase_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_GirlBase_HeadBase.ABP_GirlBase_HeadBase_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_GirlBase_HeadBase_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GirlBase_HeadBase_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_GirlBase_HeadBase_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_GirlBase_HeadBase_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_GirlBase_HeadBase_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_GirlBase_HeadBase_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_GirlBase_HeadBase_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_GirlBase_HeadBase.ABP_GirlBase_HeadBase_C.ExecuteUbergraph_ABP_GirlBase_HeadBase
// 0x0024 (0x0024 - 0x0000)
struct ABP_GirlBase_HeadBase_C_ExecuteUbergraph_ABP_GirlBase_HeadBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable;                                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Variable_1;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_GirlBase_HeadBase_C_ExecuteUbergraph_ABP_GirlBase_HeadBase) == 0x000004, "Wrong alignment on ABP_GirlBase_HeadBase_C_ExecuteUbergraph_ABP_GirlBase_HeadBase");
static_assert(sizeof(ABP_GirlBase_HeadBase_C_ExecuteUbergraph_ABP_GirlBase_HeadBase) == 0x000024, "Wrong size on ABP_GirlBase_HeadBase_C_ExecuteUbergraph_ABP_GirlBase_HeadBase");
static_assert(offsetof(ABP_GirlBase_HeadBase_C_ExecuteUbergraph_ABP_GirlBase_HeadBase, EntryPoint) == 0x000000, "Member 'ABP_GirlBase_HeadBase_C_ExecuteUbergraph_ABP_GirlBase_HeadBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_GirlBase_HeadBase_C_ExecuteUbergraph_ABP_GirlBase_HeadBase, ___int_Variable) == 0x000004, "Member 'ABP_GirlBase_HeadBase_C_ExecuteUbergraph_ABP_GirlBase_HeadBase::___int_Variable' has a wrong offset!");
static_assert(offsetof(ABP_GirlBase_HeadBase_C_ExecuteUbergraph_ABP_GirlBase_HeadBase, K2Node_Event_DeltaTimeX) == 0x000008, "Member 'ABP_GirlBase_HeadBase_C_ExecuteUbergraph_ABP_GirlBase_HeadBase::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_GirlBase_HeadBase_C_ExecuteUbergraph_ABP_GirlBase_HeadBase, CallFunc_RandomIntegerInRange_ReturnValue) == 0x00000C, "Member 'ABP_GirlBase_HeadBase_C_ExecuteUbergraph_ABP_GirlBase_HeadBase::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_GirlBase_HeadBase_C_ExecuteUbergraph_ABP_GirlBase_HeadBase, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'ABP_GirlBase_HeadBase_C_ExecuteUbergraph_ABP_GirlBase_HeadBase::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_GirlBase_HeadBase_C_ExecuteUbergraph_ABP_GirlBase_HeadBase, ___int_Variable_1) == 0x000014, "Member 'ABP_GirlBase_HeadBase_C_ExecuteUbergraph_ABP_GirlBase_HeadBase::___int_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_GirlBase_HeadBase_C_ExecuteUbergraph_ABP_GirlBase_HeadBase, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'ABP_GirlBase_HeadBase_C_ExecuteUbergraph_ABP_GirlBase_HeadBase::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_GirlBase_HeadBase_C_ExecuteUbergraph_ABP_GirlBase_HeadBase, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'ABP_GirlBase_HeadBase_C_ExecuteUbergraph_ABP_GirlBase_HeadBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_GirlBase_HeadBase_C_ExecuteUbergraph_ABP_GirlBase_HeadBase, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000020, "Member 'ABP_GirlBase_HeadBase_C_ExecuteUbergraph_ABP_GirlBase_HeadBase::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_GirlBase_HeadBase_C_ExecuteUbergraph_ABP_GirlBase_HeadBase, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000021, "Member 'ABP_GirlBase_HeadBase_C_ExecuteUbergraph_ABP_GirlBase_HeadBase::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");

}

