#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_girl002_prop02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_girl002_prop02.ABP_girl002_prop02_C
// 0x02E0 (0x05C0 - 0x02E0)
class UABP_girl002_prop02_C final : public UAnimInstance_Drone
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02E8(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0318(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0360(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x03E0(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x0428(0x0190)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_girl002_prop02(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_girl002_prop02_C">();
	}
	static class UABP_girl002_prop02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_girl002_prop02_C>();
	}
};
static_assert(alignof(UABP_girl002_prop02_C) == 0x000010, "Wrong alignment on UABP_girl002_prop02_C");
static_assert(sizeof(UABP_girl002_prop02_C) == 0x0005C0, "Wrong size on UABP_girl002_prop02_C");
static_assert(offsetof(UABP_girl002_prop02_C, UberGraphFrame) == 0x0002E0, "Member 'UABP_girl002_prop02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_girl002_prop02_C, AnimGraphNode_Root) == 0x0002E8, "Member 'UABP_girl002_prop02_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_girl002_prop02_C, AnimGraphNode_Slot_1) == 0x000318, "Member 'UABP_girl002_prop02_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_girl002_prop02_C, AnimGraphNode_SequencePlayer) == 0x000360, "Member 'UABP_girl002_prop02_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_girl002_prop02_C, AnimGraphNode_Slot) == 0x0003E0, "Member 'UABP_girl002_prop02_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_girl002_prop02_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x000428, "Member 'UABP_girl002_prop02_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");

}

