#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Boss_101_Main

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Boss_101_Main.ABP_Boss_101_Main_C
// 0x1D60 (0x2330 - 0x05D0)
class UABP_Boss_101_Main_C final : public UAnimInstance_Humanoid
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x05D8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x0608(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0720(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0750(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0868(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0898(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x09B0(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x09E0(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0B38(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x0C90(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x0CB8(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0D68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0D90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0DB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0DE0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0E08(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0E88(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x0EB8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x0F00(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x0F28(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x0F70(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x1030(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x1058(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x1078(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1098(0x0108)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x11A0(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x1240(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x1288(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x12B0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x12F8(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x13B8(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x13E0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x1400(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1420(0x0108)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x1528(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x1570(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x1598(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x1638(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x1680(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x1740(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1768(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1798(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1818(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1898(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x18C0(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1960(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x19A8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1A48(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1A78(0x00B0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1B28(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1B48(0x0020)()
	uint8                                         Pad_1B68[0x8];                                     // 0x1B68(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x1B70(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1D20(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1E78(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1EA0(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1F40(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1F68(0x00A0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_2;                   // 0x2008(0x00A0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x20A8(0x00A0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x2148(0x00A0)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x21E8(0x00A0)()
	bool                                          RushType;                                          // 0x2288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bBreak;                                            // 0x2289(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bBreakAnim;                                        // 0x228A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSimulate;                                        // 0x228B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         MaxWaitTime;                                       // 0x228C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaitTime;                                          // 0x2290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2294[0x4];                                     // 0x2294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USkeletalMeshComponent>  NewVar_0;                                          // 0x2298(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, InstancedReference, HasGetValueTypeHash)
	bool                                          bCastingSkill;                                     // 0x22C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22C1[0x3];                                     // 0x22C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HurtStrengt;                                       // 0x22C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInAbnormal;                                      // 0x22C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22C9[0x3];                                     // 0x22C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DeadType;                                          // 0x22CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FightState;                                        // 0x22D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UpperBodyAimming;                                  // 0x22D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22D5[0x3];                                     // 0x22D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnBreakStart;                                      // 0x22D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnBreakLoop;                                       // 0x22E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnBreakEnd;                                        // 0x22F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FRotator                               ModifiedAimoffset1;                                // 0x2308(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bSkill04Aimming;                                   // 0x2314(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2315[0x3];                                     // 0x2315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               ModifiedAimoffset2;                                // 0x2318(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                CalHeadIKLoc;                                      // 0x2324(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnBreakStart__DelegateSignature();
	void OnBreakLoop__DelegateSignature();
	void OnBreakEnd__DelegateSignature();
	void ExecuteUbergraph_ABP_Boss_101_Main(int32 EntryPoint);
	void AnimNotify_BreakEnd();
	void AnimNotify_BreakLoop();
	void AnimNotify_BreakStart();
	void AnimNotify_StopHurt();
	void ReceiveAdditive(const struct FVector& HitDirection_0, float Strength, const class FString& BoneName);
	void BlueprintBeginPlay();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Boss_101_Main_AnimGraphNode_TransitionResult_E0EAC5AC4D27CEB6BBF3ED9AA6A349E4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Boss_101_Main_AnimGraphNode_TransitionResult_69A0E2104591CAFA058535AD2CAEFA95();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Boss_101_Main_AnimGraphNode_TransitionResult_9CA8434243AD50366FCCDF9BDDBB9477();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Boss_101_Main_AnimGraphNode_ModifyBone_614AA2174A57D9A452D1B7B21CF1D4B8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Boss_101_Main_AnimGraphNode_ModifyBone_94B422474C0BC9E6A7DD00856DAF0A64();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Boss_101_Main_AnimGraphNode_BlendListByBool_7E12B84B415D059E77521B946F3EE65D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Boss_101_Main_AnimGraphNode_BlendListByBool_3F74DA2648C92C2BF4C6D0AC01D203B3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Boss_101_Main_AnimGraphNode_TransitionResult_2B19D0834CBA99FFFCD707BDD44157C0();
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void GroundIKLayer(const struct FPoseLink& GroundIkInputPose, struct FPoseLink* GroundIKLayer_0);
	void CurveDataLayer(const struct FPoseLink& CurveInputPose, struct FPoseLink* CurveDataLayer_0);
	void HitAddtiveLayer(const struct FPoseLink& HitInputPose, struct FPoseLink* HitAddtiveLayer_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Boss_101_Main_C">();
	}
	static class UABP_Boss_101_Main_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Boss_101_Main_C>();
	}
};
static_assert(alignof(UABP_Boss_101_Main_C) == 0x000010, "Wrong alignment on UABP_Boss_101_Main_C");
static_assert(sizeof(UABP_Boss_101_Main_C) == 0x002330, "Wrong size on UABP_Boss_101_Main_C");
static_assert(offsetof(UABP_Boss_101_Main_C, UberGraphFrame) == 0x0005D0, "Member 'UABP_Boss_101_Main_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_Root_3) == 0x0005D8, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_LinkedInputPose_2) == 0x000608, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_Root_2) == 0x000720, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_LinkedInputPose_1) == 0x000750, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_Root_1) == 0x000868, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_LinkedInputPose) == 0x000898, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_Root) == 0x0009B0, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_SaveCachedPose_2) == 0x0009E0, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_SaveCachedPose_1) == 0x000B38, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_UseCachedPose_9) == 0x000C90, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_UseCachedPose_9' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_LinkedAnimLayer) == 0x000CB8, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_TransitionResult_3) == 0x000D68, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_TransitionResult_2) == 0x000D90, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_TransitionResult_1) == 0x000DB8, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_TransitionResult) == 0x000DE0, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_SequencePlayer_2) == 0x000E08, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_StateResult_2) == 0x000E88, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_Slot_6) == 0x000EB8, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_Slot_6' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_UseCachedPose_8) == 0x000F00, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_UseCachedPose_8' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_Slot_5) == 0x000F28, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_Slot_5' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_LayeredBoneBlend_2) == 0x000F70, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_LayeredBoneBlend_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_UseCachedPose_7) == 0x001030, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_UseCachedPose_7' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_LocalToComponentSpace_2) == 0x001058, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x001078, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_ModifyBone_1) == 0x001098, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_BlendListByBool_5) == 0x0011A0, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_BlendListByBool_5' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_Slot_4) == 0x001240, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_Slot_4' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_UseCachedPose_6) == 0x001288, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_Slot_3) == 0x0012B0, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_LayeredBoneBlend_1) == 0x0012F8, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_UseCachedPose_5) == 0x0013B8, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_LocalToComponentSpace_1) == 0x0013E0, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x001400, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_ModifyBone) == 0x001420, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_Slot_2) == 0x001528, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_UseCachedPose_4) == 0x001570, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_BlendListByBool_4) == 0x001598, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_Slot_1) == 0x001638, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_LayeredBoneBlend) == 0x001680, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_UseCachedPose_3) == 0x001740, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_StateResult_1) == 0x001768, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_SequencePlayer_1) == 0x001798, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_SequencePlayer) == 0x001818, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_UseCachedPose_2) == 0x001898, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_BlendListByBool_3) == 0x0018C0, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_Slot) == 0x001960, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_BlendListByBool_2) == 0x0019A8, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_StateResult) == 0x001A48, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_StateMachine) == 0x001A78, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_LocalToComponentSpace) == 0x001B28, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_ComponentToLocalSpace) == 0x001B48, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_LookAt) == 0x001B70, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_SaveCachedPose) == 0x001D20, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_UseCachedPose_1) == 0x001E78, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_BlendListByBool_1) == 0x001EA0, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_UseCachedPose) == 0x001F40, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_BlendListByBool) == 0x001F68, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_LinkedAnimGraph_2) == 0x002008, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_LinkedAnimGraph_2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_LinkedAnimGraph_1) == 0x0020A8, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_LinkedAnimGraph_1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_LinkedAnimGraph) == 0x002148, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, AnimGraphNode_BlendListByInt) == 0x0021E8, "Member 'UABP_Boss_101_Main_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, RushType) == 0x002288, "Member 'UABP_Boss_101_Main_C::RushType' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, bBreak) == 0x002289, "Member 'UABP_Boss_101_Main_C::bBreak' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, bBreakAnim) == 0x00228A, "Member 'UABP_Boss_101_Main_C::bBreakAnim' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, IsSimulate) == 0x00228B, "Member 'UABP_Boss_101_Main_C::IsSimulate' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, MaxWaitTime) == 0x00228C, "Member 'UABP_Boss_101_Main_C::MaxWaitTime' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, WaitTime) == 0x002290, "Member 'UABP_Boss_101_Main_C::WaitTime' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, NewVar_0) == 0x002298, "Member 'UABP_Boss_101_Main_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, bCastingSkill) == 0x0022C0, "Member 'UABP_Boss_101_Main_C::bCastingSkill' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, HurtStrengt) == 0x0022C4, "Member 'UABP_Boss_101_Main_C::HurtStrengt' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, IsInAbnormal) == 0x0022C8, "Member 'UABP_Boss_101_Main_C::IsInAbnormal' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, DeadType) == 0x0022CC, "Member 'UABP_Boss_101_Main_C::DeadType' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, FightState) == 0x0022D0, "Member 'UABP_Boss_101_Main_C::FightState' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, UpperBodyAimming) == 0x0022D4, "Member 'UABP_Boss_101_Main_C::UpperBodyAimming' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, OnBreakStart) == 0x0022D8, "Member 'UABP_Boss_101_Main_C::OnBreakStart' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, OnBreakLoop) == 0x0022E8, "Member 'UABP_Boss_101_Main_C::OnBreakLoop' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, OnBreakEnd) == 0x0022F8, "Member 'UABP_Boss_101_Main_C::OnBreakEnd' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, ModifiedAimoffset1) == 0x002308, "Member 'UABP_Boss_101_Main_C::ModifiedAimoffset1' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, bSkill04Aimming) == 0x002314, "Member 'UABP_Boss_101_Main_C::bSkill04Aimming' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, ModifiedAimoffset2) == 0x002318, "Member 'UABP_Boss_101_Main_C::ModifiedAimoffset2' has a wrong offset!");
static_assert(offsetof(UABP_Boss_101_Main_C, CalHeadIKLoc) == 0x002324, "Member 'UABP_Boss_101_Main_C::CalHeadIKLoc' has a wrong offset!");

}

