#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon_004_Main

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Mon_004_Main.ABP_Mon_004_Main_C
// 0x1780 (0x1D50 - 0x05D0)
class UABP_Mon_004_Main_C final : public UAnimInstance_Humanoid
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x05D8(0x0158)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0730(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0758(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0780(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x07A8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x07D0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0818(0x00C0)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x08D8(0x0190)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0A68(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x0AB0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x0AD8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0B00(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0B30(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0BB0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0BE0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0C08(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0C88(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0CD0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0D70(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0DA0(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0E50(0x0158)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0FA8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0FC8(0x0020)()
	uint8                                         Pad_FE8[0x8];                                      // 0x0FE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x0FF0(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x11A0(0x0158)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x12F8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1328(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x13A8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x13D0(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1470(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1498(0x0028)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x14C0(0x00A0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x1560(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1600(0x00A0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x16A0(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x17B8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x17E8(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1900(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1930(0x0118)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0x1A48(0x00B0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x1AF8(0x00B0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x1BA8(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1C58(0x0030)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x1C88(0x00C8)()

public:
	void ExecuteUbergraph_ABP_Mon_004_Main(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_004_Main_AnimGraphNode_TransitionResult_03D78F7B4C1E47B550643CA4AE813114();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_004_Main_AnimGraphNode_TransitionResult_8FB0DAFB439082DDFABEE0A5880C55C4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_004_Main_AnimGraphNode_TransitionResult_9B22BE3E4998DB312CA95FAEC28506C5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_004_Main_AnimGraphNode_TransitionResult_10F7066E47F1E59233BAC9AC2D6BFD25();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_004_Main_AnimGraphNode_SequencePlayer_26F29F754F2EB95F1DC582A030F0EB0C();
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void GroundIKLayer(const struct FPoseLink& GroundIkInputPose, struct FPoseLink* GroundIKLayer_0);
	void CurveDataLayer(const struct FPoseLink& CurveInputPose, struct FPoseLink* CurveDataLayer_0);
	void HitAddtiveLayer(const struct FPoseLink& HitInputPose, struct FPoseLink* HitAddtiveLayer_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Mon_004_Main_C">();
	}
	static class UABP_Mon_004_Main_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Mon_004_Main_C>();
	}
};
static_assert(alignof(UABP_Mon_004_Main_C) == 0x000010, "Wrong alignment on UABP_Mon_004_Main_C");
static_assert(sizeof(UABP_Mon_004_Main_C) == 0x001D50, "Wrong size on UABP_Mon_004_Main_C");
static_assert(offsetof(UABP_Mon_004_Main_C, UberGraphFrame) == 0x0005D0, "Member 'UABP_Mon_004_Main_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_SaveCachedPose_2) == 0x0005D8, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_TransitionResult_3) == 0x000730, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_TransitionResult_2) == 0x000758, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_TransitionResult_1) == 0x000780, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_TransitionResult) == 0x0007A8, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_Slot_2) == 0x0007D0, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_LayeredBoneBlend) == 0x000818, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x0008D8, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_Slot_1) == 0x000A68, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_UseCachedPose_5) == 0x000AB0, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_UseCachedPose_4) == 0x000AD8, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_StateResult_2) == 0x000B00, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_SequencePlayer_2) == 0x000B30, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_StateResult_1) == 0x000BB0, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_UseCachedPose_3) == 0x000BE0, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_SequencePlayer_1) == 0x000C08, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_Slot) == 0x000C88, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_BlendListByBool_2) == 0x000CD0, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_StateResult) == 0x000D70, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_StateMachine) == 0x000DA0, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_SaveCachedPose_1) == 0x000E50, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_LocalToComponentSpace) == 0x000FA8, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_ComponentToLocalSpace) == 0x000FC8, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_LookAt) == 0x000FF0, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_SaveCachedPose) == 0x0011A0, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_Root_3) == 0x0012F8, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_SequencePlayer) == 0x001328, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_UseCachedPose_2) == 0x0013A8, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_BlendListByBool_1) == 0x0013D0, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_UseCachedPose_1) == 0x001470, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_UseCachedPose) == 0x001498, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_LinkedAnimGraph_1) == 0x0014C0, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_LinkedAnimGraph_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_LinkedAnimGraph) == 0x001560, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_BlendListByBool) == 0x001600, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_LinkedInputPose_2) == 0x0016A0, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_Root_2) == 0x0017B8, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_LinkedInputPose_1) == 0x0017E8, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_Root_1) == 0x001900, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_LinkedInputPose) == 0x001930, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_LinkedAnimLayer_2) == 0x001A48, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_LinkedAnimLayer_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_LinkedAnimLayer_1) == 0x001AF8, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_LinkedAnimLayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_LinkedAnimLayer) == 0x001BA8, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_Root) == 0x001C58, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Mon_004_Main_C, AnimGraphNode_ApplyAdditive) == 0x001C88, "Member 'UABP_Mon_004_Main_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");

}

