#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon_104_Main

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Mon_104_Main.ABP_Mon_104_Main_C
// 0x1340 (0x1910 - 0x05D0)
class UABP_Mon_104_Main_C final : public UAnimInstance_Humanoid
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x05D8(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x06F0(0x0030)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x0720(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x07D0(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0928(0x0158)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0A80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0AA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0AD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0AF8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x0B20(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0B68(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0C28(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x0C70(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x0C98(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0CC0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0CF0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0D70(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0DA0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0DC8(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0E48(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0E90(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0F30(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0F60(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x1010(0x0030)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1040(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1060(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x1080(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1230(0x0158)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x1388(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x14A0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x14D0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x14F8(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1598(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x15C0(0x0028)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x15E8(0x00A0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x1688(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1728(0x00A0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x17C8(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x18E0(0x0030)()

public:
	void HitAddtiveLayer(const struct FPoseLink& HitInputPose, struct FPoseLink* HitAddtiveLayer_0);
	void CurveDataLayer(const struct FPoseLink& CurveInputPose, struct FPoseLink* CurveDataLayer_0);
	void GroundIKLayer(const struct FPoseLink& GroundIkInputPose, struct FPoseLink* GroundIKLayer_0);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_104_Main_AnimGraphNode_SequencePlayer_27CF671D4D87E1B569DE49B79DD89AF5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_104_Main_AnimGraphNode_TransitionResult_2C8D44574694031110E9D7836BD5A5AE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_104_Main_AnimGraphNode_TransitionResult_9A063E1E4B4E0CC01CAC429FC3D85018();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_104_Main_AnimGraphNode_TransitionResult_941F8EB84E36698DDBCC07BD4B41BA44();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_104_Main_AnimGraphNode_TransitionResult_4B8528014B3213719F51E39BCB330B03();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_Mon_104_Main(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Mon_104_Main_C">();
	}
	static class UABP_Mon_104_Main_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Mon_104_Main_C>();
	}
};
static_assert(alignof(UABP_Mon_104_Main_C) == 0x000010, "Wrong alignment on UABP_Mon_104_Main_C");
static_assert(sizeof(UABP_Mon_104_Main_C) == 0x001910, "Wrong size on UABP_Mon_104_Main_C");
static_assert(offsetof(UABP_Mon_104_Main_C, UberGraphFrame) == 0x0005D0, "Member 'UABP_Mon_104_Main_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_LinkedInputPose_2) == 0x0005D8, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_Root_3) == 0x0006F0, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_LinkedAnimLayer) == 0x000720, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_SaveCachedPose_2) == 0x0007D0, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_SaveCachedPose_1) == 0x000928, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_TransitionResult_3) == 0x000A80, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_TransitionResult_2) == 0x000AA8, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_TransitionResult_1) == 0x000AD0, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_TransitionResult) == 0x000AF8, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_Slot_2) == 0x000B20, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_LayeredBoneBlend) == 0x000B68, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_Slot_1) == 0x000C28, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_UseCachedPose_5) == 0x000C70, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_UseCachedPose_4) == 0x000C98, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_StateResult_2) == 0x000CC0, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_SequencePlayer_1) == 0x000CF0, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_StateResult_1) == 0x000D70, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_UseCachedPose_3) == 0x000DA0, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_SequencePlayer) == 0x000DC8, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_Slot) == 0x000E48, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_BlendListByBool_2) == 0x000E90, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_StateResult) == 0x000F30, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_StateMachine) == 0x000F60, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_Root_2) == 0x001010, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_LocalToComponentSpace) == 0x001040, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_ComponentToLocalSpace) == 0x001060, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_LookAt) == 0x001080, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_SaveCachedPose) == 0x001230, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_LinkedInputPose_1) == 0x001388, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_Root_1) == 0x0014A0, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_UseCachedPose_2) == 0x0014D0, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_BlendListByBool_1) == 0x0014F8, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_UseCachedPose_1) == 0x001598, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_UseCachedPose) == 0x0015C0, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_LinkedAnimGraph_1) == 0x0015E8, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_LinkedAnimGraph_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_LinkedAnimGraph) == 0x001688, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_BlendListByBool) == 0x001728, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_LinkedInputPose) == 0x0017C8, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_104_Main_C, AnimGraphNode_Root) == 0x0018E0, "Member 'UABP_Mon_104_Main_C::AnimGraphNode_Root' has a wrong offset!");

}

