#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon_110_Part01

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Mon_110_Part01.ABP_Mon_110_Part01_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Mon_110_Part01_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Mon_110_Part01_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Mon_110_Part01_C_AnimGraph");
static_assert(sizeof(ABP_Mon_110_Part01_C_AnimGraph) == 0x000010, "Wrong size on ABP_Mon_110_Part01_C_AnimGraph");
static_assert(offsetof(ABP_Mon_110_Part01_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Mon_110_Part01_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Mon_110_Part01.ABP_Mon_110_Part01_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Mon_110_Part01_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Mon_110_Part01_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Mon_110_Part01_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Mon_110_Part01_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Mon_110_Part01_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Mon_110_Part01_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Mon_110_Part01_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Mon_110_Part01.ABP_Mon_110_Part01_C.ExecuteUbergraph_ABP_Mon_110_Part01
// 0x0040 (0x0040 - 0x0000)
struct ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterAccessory*                    K2Node_DynamicCast_AsCharacter_Accessory;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameAICharacter*                       K2Node_DynamicCast_AsGame_AICharacter;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01) == 0x000008, "Wrong alignment on ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01");
static_assert(sizeof(ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01) == 0x000040, "Wrong size on ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01");
static_assert(offsetof(ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01, EntryPoint) == 0x000000, "Member 'ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000004, "Member 'ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01, K2Node_Event_DeltaTimeX) == 0x00000C, "Member 'ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01, CallFunc_GetOwningActor_ReturnValue) == 0x000010, "Member 'ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01, K2Node_DynamicCast_AsCharacter_Accessory) == 0x000018, "Member 'ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01::K2Node_DynamicCast_AsCharacter_Accessory' has a wrong offset!");
static_assert(offsetof(ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01, CallFunc_IsValid_ReturnValue_1) == 0x000022, "Member 'ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01, K2Node_DynamicCast_AsGame_AICharacter) == 0x000030, "Member 'ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01::K2Node_DynamicCast_AsGame_AICharacter' has a wrong offset!");
static_assert(offsetof(ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01, CallFunc_IsValid_ReturnValue_2) == 0x000039, "Member 'ABP_Mon_110_Part01_C_ExecuteUbergraph_ABP_Mon_110_Part01::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

}

