#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_girl004_Prop02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_girl004_Prop02.ABP_Girl004_Prop02_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Girl004_Prop02_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Girl004_Prop02_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Girl004_Prop02_C_AnimGraph");
static_assert(sizeof(ABP_Girl004_Prop02_C_AnimGraph) == 0x000010, "Wrong size on ABP_Girl004_Prop02_C_AnimGraph");
static_assert(offsetof(ABP_Girl004_Prop02_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Girl004_Prop02_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_girl004_Prop02.ABP_Girl004_Prop02_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Girl004_Prop02_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Girl004_Prop02_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Girl004_Prop02_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Girl004_Prop02_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Girl004_Prop02_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Girl004_Prop02_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Girl004_Prop02_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_girl004_Prop02.ABP_Girl004_Prop02_C.ExecuteUbergraph_ABP_Girl004_Prop02
// 0x0050 (0x0050 - 0x0000)
struct ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameAICharacter*                       K2Node_DynamicCast_AsGame_AICharacter;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         CallFunc_GetCaptain_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameAIController*                      K2Node_DynamicCast_AsGame_AIController;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02) == 0x000008, "Wrong alignment on ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02");
static_assert(sizeof(ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02) == 0x000050, "Wrong size on ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02");
static_assert(offsetof(ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02, EntryPoint) == 0x000000, "Member 'ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02, K2Node_DynamicCast_AsGame_AICharacter) == 0x000010, "Member 'ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02::K2Node_DynamicCast_AsGame_AICharacter' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02, CallFunc_GetAIController_ReturnValue) == 0x000020, "Member 'ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02, CallFunc_GetCaptain_ReturnValue) == 0x000028, "Member 'ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02::CallFunc_GetCaptain_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02, K2Node_DynamicCast_AsGame_AIController) == 0x000030, "Member 'ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02::K2Node_DynamicCast_AsGame_AIController' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02, CallFunc_GetVelocity_ReturnValue) == 0x00003C, "Member 'ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02, CallFunc_VSize_ReturnValue) == 0x000048, "Member 'ABP_Girl004_Prop02_C_ExecuteUbergraph_ABP_Girl004_Prop02::CallFunc_VSize_ReturnValue' has a wrong offset!");

}

