#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_girl005a_phy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "ControlRig_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_girl005a_phy.ABP_girl005a_phy_C
// 0x9380 (0x9640 - 0x02C0)
class UABP_girl005a_phy_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_39;                    // 0x02D0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_38;                    // 0x0660(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_37;                    // 0x09F0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_36;                    // 0x0D80(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_35;                    // 0x1110(0x0390)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x14A0(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x14C0(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x14E0(0x0368)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x1848(0x0070)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x18B8(0x00A0)()
	uint8                                         Pad_1958[0x8];                                     // 0x1958(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_34;                    // 0x1960(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_33;                    // 0x1CF0(0x0390)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2080(0x0030)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_32;                    // 0x20B0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_31;                    // 0x2440(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_30;                    // 0x27D0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_29;                    // 0x2B60(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_28;                    // 0x2EF0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_27;                    // 0x3280(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_26;                    // 0x3610(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_25;                    // 0x39A0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_24;                    // 0x3D30(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_23;                    // 0x40C0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_22;                    // 0x4450(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_21;                    // 0x47E0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_20;                    // 0x4B70(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0x4F00(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0x5290(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0x5620(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0x59B0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0x5D40(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x60D0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x6460(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x67F0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x6B80(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x6F10(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x72A0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x7630(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x79C0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x7D50(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x80E0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x8470(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x8800(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x8B90(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x8F20(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x92B0(0x0390)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ABP_girl005a_phy(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_girl005a_phy_C">();
	}
	static class UABP_girl005a_phy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_girl005a_phy_C>();
	}
};
static_assert(alignof(UABP_girl005a_phy_C) == 0x000010, "Wrong alignment on UABP_girl005a_phy_C");
static_assert(sizeof(UABP_girl005a_phy_C) == 0x009640, "Wrong size on UABP_girl005a_phy_C");
static_assert(offsetof(UABP_girl005a_phy_C, UberGraphFrame) == 0x0002C0, "Member 'UABP_girl005a_phy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_39) == 0x0002D0, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_39' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_38) == 0x000660, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_38' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_37) == 0x0009F0, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_37' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_36) == 0x000D80, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_36' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_35) == 0x001110, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_35' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_ComponentToLocalSpace) == 0x0014A0, "Member 'UABP_girl005a_phy_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_LocalToComponentSpace) == 0x0014C0, "Member 'UABP_girl005a_phy_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_ControlRig) == 0x0014E0, "Member 'UABP_girl005a_phy_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_Inertialization) == 0x001848, "Member 'UABP_girl005a_phy_C::AnimGraphNode_Inertialization' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_LinkedAnimGraph) == 0x0018B8, "Member 'UABP_girl005a_phy_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_34) == 0x001960, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_34' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_33) == 0x001CF0, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_33' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_Root) == 0x002080, "Member 'UABP_girl005a_phy_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_32) == 0x0020B0, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_32' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_31) == 0x002440, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_31' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_30) == 0x0027D0, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_30' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_29) == 0x002B60, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_29' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_28) == 0x002EF0, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_28' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_27) == 0x003280, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_27' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_26) == 0x003610, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_26' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_25) == 0x0039A0, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_25' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_24) == 0x003D30, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_24' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_23) == 0x0040C0, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_23' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_22) == 0x004450, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_22' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_21) == 0x0047E0, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_21' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_20) == 0x004B70, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_20' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_19) == 0x004F00, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_19' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_18) == 0x005290, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_18' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_17) == 0x005620, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_17' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_16) == 0x0059B0, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_16' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_15) == 0x005D40, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_15' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_14) == 0x0060D0, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_14' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_13) == 0x006460, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_13' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_12) == 0x0067F0, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_12' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_11) == 0x006B80, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_11' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_10) == 0x006F10, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_10' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_9) == 0x0072A0, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_8) == 0x007630, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_7) == 0x0079C0, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_6) == 0x007D50, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_5) == 0x0080E0, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_4) == 0x008470, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_3) == 0x008800, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_2) == 0x008B90, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics_1) == 0x008F20, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_girl005a_phy_C, AnimGraphNode_KawaiiPhysics) == 0x0092B0, "Member 'UABP_girl005a_phy_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");

}

