#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon_113_Prop01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Mon_113_Prop01.ABP_Mon_113_Prop01_C
// 0x0C90 (0x1260 - 0x05D0)
class UABP_Mon_113_Prop01_C final : public UAnimInstance_Humanoid
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x05D8(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x0608(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0760(0x0158)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x08B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x08E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0908(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0930(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x0958(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0980(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x09A8(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x09F0(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x0AB0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0AF8(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0B28(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0B70(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0BF0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0C20(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0CA0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0CC8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0D10(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0DB0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0DE0(0x00B0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x0E90(0x00A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0F30(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0F50(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0F70(0x0158)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x10C8(0x00A0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x1168(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1208(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1230(0x0028)()
	bool                                          bCastingSkill;                                     // 0x1258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1259[0x3];                                     // 0x1259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DeadType;                                          // 0x125C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_113_Prop01_AnimGraphNode_TransitionResult_C8168AE6418251031A4A7F9A32A4FB67();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_113_Prop01_AnimGraphNode_TransitionResult_C36C67BA486CB5741C8721ACC3DA700B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_113_Prop01_AnimGraphNode_TransitionResult_9F43B6374982D3D9440476867C515161();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_113_Prop01_AnimGraphNode_TransitionResult_6F95AFB84B010E22F4345DBEA4A7E64C();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintBeginPlay();
	void AnimNotify_guangshu();
	void AnimNotify_I___();
	void ExecuteUbergraph_ABP_Mon_113_Prop01(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Mon_113_Prop01_C">();
	}
	static class UABP_Mon_113_Prop01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Mon_113_Prop01_C>();
	}
};
static_assert(alignof(UABP_Mon_113_Prop01_C) == 0x000010, "Wrong alignment on UABP_Mon_113_Prop01_C");
static_assert(sizeof(UABP_Mon_113_Prop01_C) == 0x001260, "Wrong size on UABP_Mon_113_Prop01_C");
static_assert(offsetof(UABP_Mon_113_Prop01_C, UberGraphFrame) == 0x0005D0, "Member 'UABP_Mon_113_Prop01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_Root) == 0x0005D8, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_SaveCachedPose_2) == 0x000608, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_SaveCachedPose_1) == 0x000760, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_TransitionResult_3) == 0x0008B8, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_TransitionResult_2) == 0x0008E0, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_TransitionResult_1) == 0x000908, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_TransitionResult) == 0x000930, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_UseCachedPose_4) == 0x000958, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_UseCachedPose_3) == 0x000980, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_Slot_3) == 0x0009A8, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_LayeredBoneBlend) == 0x0009F0, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_Slot_2) == 0x000AB0, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_StateResult_2) == 0x000AF8, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_Slot_1) == 0x000B28, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_SequencePlayer_1) == 0x000B70, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_StateResult_1) == 0x000BF0, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_SequencePlayer) == 0x000C20, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_UseCachedPose_2) == 0x000CA0, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_Slot) == 0x000CC8, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_BlendListByBool_1) == 0x000D10, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_StateResult) == 0x000DB0, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_StateMachine) == 0x000DE0, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_LinkedAnimGraph_1) == 0x000E90, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_LinkedAnimGraph_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_LocalToComponentSpace) == 0x000F30, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_ComponentToLocalSpace) == 0x000F50, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_SaveCachedPose) == 0x000F70, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_BlendListByBool) == 0x0010C8, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_LinkedAnimGraph) == 0x001168, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_UseCachedPose_1) == 0x001208, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, AnimGraphNode_UseCachedPose) == 0x001230, "Member 'UABP_Mon_113_Prop01_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, bCastingSkill) == 0x001258, "Member 'UABP_Mon_113_Prop01_C::bCastingSkill' has a wrong offset!");
static_assert(offsetof(UABP_Mon_113_Prop01_C, DeadType) == 0x00125C, "Member 'UABP_Mon_113_Prop01_C::DeadType' has a wrong offset!");

}

