#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon_116_Main

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Mon_116_Main.ABP_Mon_116_Main_C.HitAddtiveLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_Mon_116_Main_C_HitAddtiveLayer final
{
public:
	struct FPoseLink                              HitInputPose;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              HitAddtiveLayer_0;                                 // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Mon_116_Main_C_HitAddtiveLayer) == 0x000008, "Wrong alignment on ABP_Mon_116_Main_C_HitAddtiveLayer");
static_assert(sizeof(ABP_Mon_116_Main_C_HitAddtiveLayer) == 0x000020, "Wrong size on ABP_Mon_116_Main_C_HitAddtiveLayer");
static_assert(offsetof(ABP_Mon_116_Main_C_HitAddtiveLayer, HitInputPose) == 0x000000, "Member 'ABP_Mon_116_Main_C_HitAddtiveLayer::HitInputPose' has a wrong offset!");
static_assert(offsetof(ABP_Mon_116_Main_C_HitAddtiveLayer, HitAddtiveLayer_0) == 0x000010, "Member 'ABP_Mon_116_Main_C_HitAddtiveLayer::HitAddtiveLayer_0' has a wrong offset!");

// Function ABP_Mon_116_Main.ABP_Mon_116_Main_C.CurveDataLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_Mon_116_Main_C_CurveDataLayer final
{
public:
	struct FPoseLink                              CurveInputPose;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              CurveDataLayer_0;                                  // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Mon_116_Main_C_CurveDataLayer) == 0x000008, "Wrong alignment on ABP_Mon_116_Main_C_CurveDataLayer");
static_assert(sizeof(ABP_Mon_116_Main_C_CurveDataLayer) == 0x000020, "Wrong size on ABP_Mon_116_Main_C_CurveDataLayer");
static_assert(offsetof(ABP_Mon_116_Main_C_CurveDataLayer, CurveInputPose) == 0x000000, "Member 'ABP_Mon_116_Main_C_CurveDataLayer::CurveInputPose' has a wrong offset!");
static_assert(offsetof(ABP_Mon_116_Main_C_CurveDataLayer, CurveDataLayer_0) == 0x000010, "Member 'ABP_Mon_116_Main_C_CurveDataLayer::CurveDataLayer_0' has a wrong offset!");

// Function ABP_Mon_116_Main.ABP_Mon_116_Main_C.GroundIKLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_Mon_116_Main_C_GroundIKLayer final
{
public:
	struct FPoseLink                              GroundIkInputPose;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              GroundIKLayer_0;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Mon_116_Main_C_GroundIKLayer) == 0x000008, "Wrong alignment on ABP_Mon_116_Main_C_GroundIKLayer");
static_assert(sizeof(ABP_Mon_116_Main_C_GroundIKLayer) == 0x000020, "Wrong size on ABP_Mon_116_Main_C_GroundIKLayer");
static_assert(offsetof(ABP_Mon_116_Main_C_GroundIKLayer, GroundIkInputPose) == 0x000000, "Member 'ABP_Mon_116_Main_C_GroundIKLayer::GroundIkInputPose' has a wrong offset!");
static_assert(offsetof(ABP_Mon_116_Main_C_GroundIKLayer, GroundIKLayer_0) == 0x000010, "Member 'ABP_Mon_116_Main_C_GroundIKLayer::GroundIKLayer_0' has a wrong offset!");

// Function ABP_Mon_116_Main.ABP_Mon_116_Main_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Mon_116_Main_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Mon_116_Main_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Mon_116_Main_C_AnimGraph");
static_assert(sizeof(ABP_Mon_116_Main_C_AnimGraph) == 0x000010, "Wrong size on ABP_Mon_116_Main_C_AnimGraph");
static_assert(offsetof(ABP_Mon_116_Main_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Mon_116_Main_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Mon_116_Main.ABP_Mon_116_Main_C.ExecuteUbergraph_ABP_Mon_116_Main
// 0x0020 (0x0020 - 0x0000)
struct ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAlive_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_GetIdleAnim_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInFightState_ReturnValue;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue_1;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue_2;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue_3;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInFightState_ReturnValue_1;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main) == 0x000008, "Wrong alignment on ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main");
static_assert(sizeof(ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main) == 0x000020, "Wrong size on ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main");
static_assert(offsetof(ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main, EntryPoint) == 0x000000, "Member 'ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main, CallFunc_IsAlive_ReturnValue) == 0x000004, "Member 'ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main::CallFunc_IsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main, CallFunc_GetIdleAnim_ReturnValue) == 0x000008, "Member 'ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main::CallFunc_GetIdleAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main, CallFunc_IsInFightState_ReturnValue) == 0x000011, "Member 'ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main::CallFunc_IsInFightState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main, CallFunc_IsAlive_ReturnValue_1) == 0x000012, "Member 'ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main::CallFunc_IsAlive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main, CallFunc_Not_PreBool_ReturnValue_1) == 0x000013, "Member 'ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main, CallFunc_IsAlive_ReturnValue_2) == 0x000014, "Member 'ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main::CallFunc_IsAlive_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main, CallFunc_IsAlive_ReturnValue_3) == 0x000015, "Member 'ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main::CallFunc_IsAlive_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main, CallFunc_BooleanAND_ReturnValue) == 0x000016, "Member 'ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main, CallFunc_Not_PreBool_ReturnValue_2) == 0x000017, "Member 'ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main, CallFunc_IsInFightState_ReturnValue_1) == 0x000018, "Member 'ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main::CallFunc_IsInFightState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main, CallFunc_BooleanAND_ReturnValue_1) == 0x000019, "Member 'ABP_Mon_116_Main_C_ExecuteUbergraph_ABP_Mon_116_Main::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

}

