#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_GirlBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_GirlBase.ABP_GirlBase_C.FishingAnimLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_GirlBase_C_FishingAnimLayer final
{
public:
	struct FPoseLink                              FishingInput;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              FishingAnimLayer_0;                                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBase_C_FishingAnimLayer) == 0x000008, "Wrong alignment on ABP_GirlBase_C_FishingAnimLayer");
static_assert(sizeof(ABP_GirlBase_C_FishingAnimLayer) == 0x000020, "Wrong size on ABP_GirlBase_C_FishingAnimLayer");
static_assert(offsetof(ABP_GirlBase_C_FishingAnimLayer, FishingInput) == 0x000000, "Member 'ABP_GirlBase_C_FishingAnimLayer::FishingInput' has a wrong offset!");
static_assert(offsetof(ABP_GirlBase_C_FishingAnimLayer, FishingAnimLayer_0) == 0x000010, "Member 'ABP_GirlBase_C_FishingAnimLayer::FishingAnimLayer_0' has a wrong offset!");

// Function ABP_GirlBase.ABP_GirlBase_C.ForbiddenBreastAnimLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_GirlBase_C_ForbiddenBreastAnimLayer final
{
public:
	struct FPoseLink                              BreastAnim_Input;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ForbiddenBreastAnimLayer_0;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBase_C_ForbiddenBreastAnimLayer) == 0x000008, "Wrong alignment on ABP_GirlBase_C_ForbiddenBreastAnimLayer");
static_assert(sizeof(ABP_GirlBase_C_ForbiddenBreastAnimLayer) == 0x000020, "Wrong size on ABP_GirlBase_C_ForbiddenBreastAnimLayer");
static_assert(offsetof(ABP_GirlBase_C_ForbiddenBreastAnimLayer, BreastAnim_Input) == 0x000000, "Member 'ABP_GirlBase_C_ForbiddenBreastAnimLayer::BreastAnim_Input' has a wrong offset!");
static_assert(offsetof(ABP_GirlBase_C_ForbiddenBreastAnimLayer, ForbiddenBreastAnimLayer_0) == 0x000010, "Member 'ABP_GirlBase_C_ForbiddenBreastAnimLayer::ForbiddenBreastAnimLayer_0' has a wrong offset!");

// Function ABP_GirlBase.ABP_GirlBase_C.PostPhys&Rig
// 0x0020 (0x0020 - 0x0000)
struct ABP_GirlBase_C_PostPhys_Rig final
{
public:
	struct FPoseLink                              FootIKInput;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              PostPhys_Rig_0;                                    // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBase_C_PostPhys_Rig) == 0x000008, "Wrong alignment on ABP_GirlBase_C_PostPhys_Rig");
static_assert(sizeof(ABP_GirlBase_C_PostPhys_Rig) == 0x000020, "Wrong size on ABP_GirlBase_C_PostPhys_Rig");
static_assert(offsetof(ABP_GirlBase_C_PostPhys_Rig, FootIKInput) == 0x000000, "Member 'ABP_GirlBase_C_PostPhys_Rig::FootIKInput' has a wrong offset!");
static_assert(offsetof(ABP_GirlBase_C_PostPhys_Rig, PostPhys_Rig_0) == 0x000010, "Member 'ABP_GirlBase_C_PostPhys_Rig::PostPhys_Rig_0' has a wrong offset!");

// Function ABP_GirlBase.ABP_GirlBase_C.PostActionLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_GirlBase_C_PostActionLayer final
{
public:
	struct FPoseLink                              PassiveInpu;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              PostActionLayer_0;                                 // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBase_C_PostActionLayer) == 0x000008, "Wrong alignment on ABP_GirlBase_C_PostActionLayer");
static_assert(sizeof(ABP_GirlBase_C_PostActionLayer) == 0x000020, "Wrong size on ABP_GirlBase_C_PostActionLayer");
static_assert(offsetof(ABP_GirlBase_C_PostActionLayer, PassiveInpu) == 0x000000, "Member 'ABP_GirlBase_C_PostActionLayer::PassiveInpu' has a wrong offset!");
static_assert(offsetof(ABP_GirlBase_C_PostActionLayer, PostActionLayer_0) == 0x000010, "Member 'ABP_GirlBase_C_PostActionLayer::PostActionLayer_0' has a wrong offset!");

// Function ABP_GirlBase.ABP_GirlBase_C.ForcedActionLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_GirlBase_C_ForcedActionLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ForcedActionLayer_0;                               // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBase_C_ForcedActionLayer) == 0x000008, "Wrong alignment on ABP_GirlBase_C_ForcedActionLayer");
static_assert(sizeof(ABP_GirlBase_C_ForcedActionLayer) == 0x000020, "Wrong size on ABP_GirlBase_C_ForcedActionLayer");
static_assert(offsetof(ABP_GirlBase_C_ForcedActionLayer, InPose) == 0x000000, "Member 'ABP_GirlBase_C_ForcedActionLayer::InPose' has a wrong offset!");
static_assert(offsetof(ABP_GirlBase_C_ForcedActionLayer, ForcedActionLayer_0) == 0x000010, "Member 'ABP_GirlBase_C_ForcedActionLayer::ForcedActionLayer_0' has a wrong offset!");

// Function ABP_GirlBase.ABP_GirlBase_C.PartialBoneLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_GirlBase_C_PartialBoneLayer final
{
public:
	struct FPoseLink                              PartialBoneInput;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              PartialBoneLayer_0;                                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBase_C_PartialBoneLayer) == 0x000008, "Wrong alignment on ABP_GirlBase_C_PartialBoneLayer");
static_assert(sizeof(ABP_GirlBase_C_PartialBoneLayer) == 0x000020, "Wrong size on ABP_GirlBase_C_PartialBoneLayer");
static_assert(offsetof(ABP_GirlBase_C_PartialBoneLayer, PartialBoneInput) == 0x000000, "Member 'ABP_GirlBase_C_PartialBoneLayer::PartialBoneInput' has a wrong offset!");
static_assert(offsetof(ABP_GirlBase_C_PartialBoneLayer, PartialBoneLayer_0) == 0x000010, "Member 'ABP_GirlBase_C_PartialBoneLayer::PartialBoneLayer_0' has a wrong offset!");

// Function ABP_GirlBase.ABP_GirlBase_C.CompoisitionLayer
// 0x0030 (0x0030 - 0x0000)
struct ABP_GirlBase_C_CompoisitionLayer final
{
public:
	struct FPoseLink                              UpperBody;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              LowerBody;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              CompoisitionLayer_0;                               // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBase_C_CompoisitionLayer) == 0x000008, "Wrong alignment on ABP_GirlBase_C_CompoisitionLayer");
static_assert(sizeof(ABP_GirlBase_C_CompoisitionLayer) == 0x000030, "Wrong size on ABP_GirlBase_C_CompoisitionLayer");
static_assert(offsetof(ABP_GirlBase_C_CompoisitionLayer, UpperBody) == 0x000000, "Member 'ABP_GirlBase_C_CompoisitionLayer::UpperBody' has a wrong offset!");
static_assert(offsetof(ABP_GirlBase_C_CompoisitionLayer, LowerBody) == 0x000010, "Member 'ABP_GirlBase_C_CompoisitionLayer::LowerBody' has a wrong offset!");
static_assert(offsetof(ABP_GirlBase_C_CompoisitionLayer, CompoisitionLayer_0) == 0x000020, "Member 'ABP_GirlBase_C_CompoisitionLayer::CompoisitionLayer_0' has a wrong offset!");

// Function ABP_GirlBase.ABP_GirlBase_C.LowerBody
// 0x0030 (0x0030 - 0x0000)
struct ABP_GirlBase_C_LowerBody final
{
public:
	struct FPoseLink                              LowerBaseLoco;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              LowerSkill;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              LowerBody_0;                                       // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBase_C_LowerBody) == 0x000008, "Wrong alignment on ABP_GirlBase_C_LowerBody");
static_assert(sizeof(ABP_GirlBase_C_LowerBody) == 0x000030, "Wrong size on ABP_GirlBase_C_LowerBody");
static_assert(offsetof(ABP_GirlBase_C_LowerBody, LowerBaseLoco) == 0x000000, "Member 'ABP_GirlBase_C_LowerBody::LowerBaseLoco' has a wrong offset!");
static_assert(offsetof(ABP_GirlBase_C_LowerBody, LowerSkill) == 0x000010, "Member 'ABP_GirlBase_C_LowerBody::LowerSkill' has a wrong offset!");
static_assert(offsetof(ABP_GirlBase_C_LowerBody, LowerBody_0) == 0x000020, "Member 'ABP_GirlBase_C_LowerBody::LowerBody_0' has a wrong offset!");

// Function ABP_GirlBase.ABP_GirlBase_C.UpperBody
// 0x0030 (0x0030 - 0x0000)
struct ABP_GirlBase_C_UpperBody final
{
public:
	struct FPoseLink                              UpperBaseLoco;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              UpperSkill;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              UpperBody_0;                                       // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBase_C_UpperBody) == 0x000008, "Wrong alignment on ABP_GirlBase_C_UpperBody");
static_assert(sizeof(ABP_GirlBase_C_UpperBody) == 0x000030, "Wrong size on ABP_GirlBase_C_UpperBody");
static_assert(offsetof(ABP_GirlBase_C_UpperBody, UpperBaseLoco) == 0x000000, "Member 'ABP_GirlBase_C_UpperBody::UpperBaseLoco' has a wrong offset!");
static_assert(offsetof(ABP_GirlBase_C_UpperBody, UpperSkill) == 0x000010, "Member 'ABP_GirlBase_C_UpperBody::UpperSkill' has a wrong offset!");
static_assert(offsetof(ABP_GirlBase_C_UpperBody, UpperBody_0) == 0x000020, "Member 'ABP_GirlBase_C_UpperBody::UpperBody_0' has a wrong offset!");

// Function ABP_GirlBase.ABP_GirlBase_C.Shoot&Aim
// 0x0020 (0x0020 - 0x0000)
struct ABP_GirlBase_C_Shoot_Aim final
{
public:
	struct FPoseLink                              BaseLocoInput;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Shoot_Aim_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBase_C_Shoot_Aim) == 0x000008, "Wrong alignment on ABP_GirlBase_C_Shoot_Aim");
static_assert(sizeof(ABP_GirlBase_C_Shoot_Aim) == 0x000020, "Wrong size on ABP_GirlBase_C_Shoot_Aim");
static_assert(offsetof(ABP_GirlBase_C_Shoot_Aim, BaseLocoInput) == 0x000000, "Member 'ABP_GirlBase_C_Shoot_Aim::BaseLocoInput' has a wrong offset!");
static_assert(offsetof(ABP_GirlBase_C_Shoot_Aim, Shoot_Aim_0) == 0x000010, "Member 'ABP_GirlBase_C_Shoot_Aim::Shoot_Aim_0' has a wrong offset!");

// Function ABP_GirlBase.ABP_GirlBase_C.BaseSkill
// 0x0020 (0x0020 - 0x0000)
struct ABP_GirlBase_C_BaseSkill final
{
public:
	struct FPoseLink                              InputLocomotion;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              BaseSkill_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBase_C_BaseSkill) == 0x000008, "Wrong alignment on ABP_GirlBase_C_BaseSkill");
static_assert(sizeof(ABP_GirlBase_C_BaseSkill) == 0x000020, "Wrong size on ABP_GirlBase_C_BaseSkill");
static_assert(offsetof(ABP_GirlBase_C_BaseSkill, InputLocomotion) == 0x000000, "Member 'ABP_GirlBase_C_BaseSkill::InputLocomotion' has a wrong offset!");
static_assert(offsetof(ABP_GirlBase_C_BaseSkill, BaseSkill_0) == 0x000010, "Member 'ABP_GirlBase_C_BaseSkill::BaseSkill_0' has a wrong offset!");

// Function ABP_GirlBase.ABP_GirlBase_C.BaseLocomotion
// 0x0010 (0x0010 - 0x0000)
struct ABP_GirlBase_C_BaseLocomotion final
{
public:
	struct FPoseLink                              BaseLocomotion_0;                                  // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBase_C_BaseLocomotion) == 0x000008, "Wrong alignment on ABP_GirlBase_C_BaseLocomotion");
static_assert(sizeof(ABP_GirlBase_C_BaseLocomotion) == 0x000010, "Wrong size on ABP_GirlBase_C_BaseLocomotion");
static_assert(offsetof(ABP_GirlBase_C_BaseLocomotion, BaseLocomotion_0) == 0x000000, "Member 'ABP_GirlBase_C_BaseLocomotion::BaseLocomotion_0' has a wrong offset!");

// Function ABP_GirlBase.ABP_GirlBase_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_GirlBase_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GirlBase_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_GirlBase_C_AnimGraph");
static_assert(sizeof(ABP_GirlBase_C_AnimGraph) == 0x000010, "Wrong size on ABP_GirlBase_C_AnimGraph");
static_assert(offsetof(ABP_GirlBase_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_GirlBase_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_GirlBase.ABP_GirlBase_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_GirlBase_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GirlBase_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_GirlBase_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_GirlBase_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_GirlBase_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_GirlBase_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_GirlBase_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_GirlBase.ABP_GirlBase_C.ExecuteUbergraph_ABP_GirlBase
// 0x0224 (0x0224 - 0x0000)
struct ABP_GirlBase_C_ExecuteUbergraph_ABP_GirlBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue; // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_1; // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_2;                         // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_2; // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_3;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_3; // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsRushing_ReturnValue;                    // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_4;                         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_4; // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_Array_Get_Item_5;                         // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_5; // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_6;                         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_6; // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue_1;        // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D6[0x2];                                       // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_7;                         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_7; // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_9;                  // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_11;                // 0x00F7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_10;                 // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_12;                // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_11;                 // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_13;                // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_12;                 // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_14;                // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_15;                // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_16;                // 0x00FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue_2;        // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_17;                // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_18;                // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_19;                // 0x010F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_20;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_21;                // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_22;                // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_13;                 // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_14;                 // 0x0117(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X_3;                        // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_3;                        // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_9;        // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_23;                // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_15;                 // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12E[0x2];                                      // 0x012E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X_4;                        // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_4;                        // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_16;                 // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X_5;                        // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_5;                        // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_6;                        // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_6;                        // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue_3;        // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_24;                // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_17;                 // 0x0156(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_18;                 // 0x0157(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_Array_Get_Item_8;                         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_8; // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_Array_Get_Item_9;                         // 0x016C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_19;                 // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_9; // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_Array_Get_Item_10;                        // 0x0184(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_11;                        // 0x018C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_10; // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_11; // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_12;                        // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_12; // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_Array_Get_Item_13;                        // 0x01C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_13; // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_Array_Get_Item_14;                        // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_14; // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_15;                        // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBunkerSkillSpineOffsetData_ReturnValue_15; // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_10;       // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0205(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_25;                // 0x0206(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_9;                // 0x0207(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_26;                // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_7;                        // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_7;                        // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GirlBase_C_ExecuteUbergraph_ABP_GirlBase) == 0x000004, "Wrong alignment on ABP_GirlBase_C_ExecuteUbergraph_ABP_GirlBase");
static_assert(sizeof(ABP_GirlBase_C_ExecuteUbergraph_ABP_GirlBase) == 0x000224, "Wrong size on ABP_GirlBase_C_ExecuteUbergraph_ABP_GirlBase");
static_assert(offsetof(ABP_GirlBase_C_ExecuteUbergraph_ABP_GirlBase, EntryPoint) == 0x000000, "Member 'ABP_GirlBase_C_ExecuteUbergraph_ABP_GirlBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_GirlBase_C_ExecuteUbergraph_ABP_GirlBase, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'ABP_GirlBase_C_ExecuteUbergraph_ABP_GirlBase::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
