#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon_101_Main

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Mon_101_Main.ABP_Mon_101_Main_C
// 0x1D00 (0x22D0 - 0x05D0)
class UABP_Mon_101_Main_C final : public UAnimInstance_Humanoid
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x05D8(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x06F0(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x0720(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0878(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x09D0(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x09F8(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0AA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0AD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0AF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0B20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0B48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0B70(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0B98(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0C18(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0C48(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0CC8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0CF8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0D78(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x0DA8(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0E58(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x0E88(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x0ED0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x0EF8(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x0F40(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x1000(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x1028(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x1048(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1068(0x0108)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x1170(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x1210(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x1258(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x1280(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x12C8(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x1388(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x13B0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x13D0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x13F0(0x0108)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x14F8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x1540(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x1568(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x1608(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x1650(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x1710(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1738(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1768(0x0028)()
	struct FAnimNode_RandomPlayer                 AnimGraphNode_RandomPlayer;                        // 0x1790(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x1808(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x18A8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x18F0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1920(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x19D0(0x0030)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1A00(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1A20(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x1A40(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1BF0(0x0158)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x1D48(0x0118)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1E60(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1E88(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1F28(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1F50(0x00A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1FF0(0x0030)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x2020(0x00A0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x20C0(0x00A0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x2160(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2278(0x0030)()
	int32                                         DeadType;                                          // 0x22A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UpperBodyAimming;                                  // 0x22AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22AD[0x3];                                     // 0x22AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               ModifiedAimoffset1;                                // 0x22B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bSkill04Aimming;                                   // 0x22BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22BD[0x3];                                     // 0x22BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               ModifiedAimoffset2;                                // 0x22C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_Mon_101_Main(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_101_Main_AnimGraphNode_TransitionResult_1F5D83E14D11776A416FE4BF3429D60D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_101_Main_AnimGraphNode_TransitionResult_BFB7154543A7D00D4CAB48BBA26A0EE5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_101_Main_AnimGraphNode_TransitionResult_B20B7853425801109AFA349E3313CE0F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_101_Main_AnimGraphNode_TransitionResult_485F5F844352C7E61ADBA58715F2EA89();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_101_Main_AnimGraphNode_ModifyBone_304990804D9E67373C23C7ACB4B559C8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_101_Main_AnimGraphNode_ModifyBone_7077BAEC4100C18D950E4D88E4909C9F();
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void GroundIKLayer(const struct FPoseLink& GroundIkInputPose, struct FPoseLink* GroundIKLayer_0);
	void CurveDataLayer(const struct FPoseLink& CurveInputPose, struct FPoseLink* CurveDataLayer_0);
	void HitAddtiveLayer(const struct FPoseLink& HitInputPose, struct FPoseLink* HitAddtiveLayer_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Mon_101_Main_C">();
	}
	static class UABP_Mon_101_Main_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Mon_101_Main_C>();
	}
};
static_assert(alignof(UABP_Mon_101_Main_C) == 0x000010, "Wrong alignment on UABP_Mon_101_Main_C");
static_assert(sizeof(UABP_Mon_101_Main_C) == 0x0022D0, "Wrong size on UABP_Mon_101_Main_C");
static_assert(offsetof(UABP_Mon_101_Main_C, UberGraphFrame) == 0x0005D0, "Member 'UABP_Mon_101_Main_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_LinkedInputPose_2) == 0x0005D8, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_Root_3) == 0x0006F0, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_SaveCachedPose_2) == 0x000720, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_SaveCachedPose_1) == 0x000878, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_UseCachedPose_9) == 0x0009D0, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_UseCachedPose_9' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_LinkedAnimLayer) == 0x0009F8, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_TransitionResult_5) == 0x000AA8, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_TransitionResult_4) == 0x000AD0, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_TransitionResult_3) == 0x000AF8, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_TransitionResult_2) == 0x000B20, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_TransitionResult_1) == 0x000B48, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_TransitionResult) == 0x000B70, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_SequencePlayer_2) == 0x000B98, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_StateResult_5) == 0x000C18, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_SequencePlayer_1) == 0x000C48, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_StateResult_4) == 0x000CC8, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_SequencePlayer) == 0x000CF8, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_StateResult_3) == 0x000D78, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_StateMachine_1) == 0x000DA8, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_StateResult_2) == 0x000E58, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_Slot_6) == 0x000E88, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_Slot_6' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_UseCachedPose_8) == 0x000ED0, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_UseCachedPose_8' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_Slot_5) == 0x000EF8, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_Slot_5' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_LayeredBoneBlend_2) == 0x000F40, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_LayeredBoneBlend_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_UseCachedPose_7) == 0x001000, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_UseCachedPose_7' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_LocalToComponentSpace_2) == 0x001028, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x001048, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_ModifyBone_1) == 0x001068, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_BlendListByBool_4) == 0x001170, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_Slot_4) == 0x001210, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_Slot_4' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_UseCachedPose_6) == 0x001258, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_Slot_3) == 0x001280, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_LayeredBoneBlend_1) == 0x0012C8, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_UseCachedPose_5) == 0x001388, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_LocalToComponentSpace_1) == 0x0013B0, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x0013D0, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_ModifyBone) == 0x0013F0, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_Slot_2) == 0x0014F8, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_UseCachedPose_4) == 0x001540, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_BlendListByBool_3) == 0x001568, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_Slot_1) == 0x001608, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_LayeredBoneBlend) == 0x001650, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_UseCachedPose_3) == 0x001710, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_StateResult_1) == 0x001738, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_UseCachedPose_2) == 0x001768, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_RandomPlayer) == 0x001790, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_RandomPlayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_BlendListByBool_2) == 0x001808, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_Slot) == 0x0018A8, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_StateResult) == 0x0018F0, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_StateMachine) == 0x001920, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_Root_2) == 0x0019D0, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_LocalToComponentSpace) == 0x001A00, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_ComponentToLocalSpace) == 0x001A20, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_LookAt) == 0x001A40, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_SaveCachedPose) == 0x001BF0, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_LinkedInputPose_1) == 0x001D48, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_UseCachedPose_1) == 0x001E60, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_BlendListByBool_1) == 0x001E88, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_UseCachedPose) == 0x001F28, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_BlendListByBool) == 0x001F50, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_Root_1) == 0x001FF0, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_LinkedAnimGraph_1) == 0x002020, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_LinkedAnimGraph_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_LinkedAnimGraph) == 0x0020C0, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_LinkedInputPose) == 0x002160, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, AnimGraphNode_Root) == 0x002278, "Member 'UABP_Mon_101_Main_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, DeadType) == 0x0022A8, "Member 'UABP_Mon_101_Main_C::DeadType' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, UpperBodyAimming) == 0x0022AC, "Member 'UABP_Mon_101_Main_C::UpperBodyAimming' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, ModifiedAimoffset1) == 0x0022B0, "Member 'UABP_Mon_101_Main_C::ModifiedAimoffset1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, bSkill04Aimming) == 0x0022BC, "Member 'UABP_Mon_101_Main_C::bSkill04Aimming' has a wrong offset!");
static_assert(offsetof(UABP_Mon_101_Main_C, ModifiedAimoffset2) == 0x0022C0, "Member 'UABP_Mon_101_Main_C::ModifiedAimoffset2' has a wrong offset!");

}

