#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon013_Part02_Main

#include "Basic.hpp"

#include "Game_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Mon013_Part02_Main.ABP_Mon013_Part02_Main_C
// 0x0480 (0x1830 - 0x13B0)
class UABP_Mon013_Part02_Main_C final : public UAnimInstance_Humanoid
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x13B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x13B8(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x13E8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x1430(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x14D0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1550(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x15D0(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1670(0x0080)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x16F0(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1790(0x00A0)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon013_Part02_Main_AnimGraphNode_BlendListByBool_CEB28EEE4200842FAA2ED68882CCF47D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon013_Part02_Main_AnimGraphNode_BlendListByBool_0819C9D64A13200F306EB7B6C8DC9DF2();
	void ExecuteUbergraph_ABP_Mon013_Part02_Main(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Mon013_Part02_Main_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Mon013_Part02_Main_C")
	}
	static class UABP_Mon013_Part02_Main_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Mon013_Part02_Main_C>();
	}
};
DUMPER7_ASSERTS_UABP_Mon013_Part02_Main_C;

}

