#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon_114_Main

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Mon_114_Main.ABP_Mon_114_Main_C
// 0x1590 (0x1B60 - 0x05D0)
class UABP_Mon_114_Main_C final : public UAnimInstance_Humanoid
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x05D8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x0608(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0720(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0750(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0868(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0898(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x09B0(0x0030)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x09E0(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x0A90(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0BE8(0x0158)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0D40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0D68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0D90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0DB8(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0DE0(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0EA8(0x00E8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x0F90(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x0FD8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x1000(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x10A0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x10E8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1110(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1140(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x11C0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x11F0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1218(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1298(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x12E0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1380(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x13B0(0x00B0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x1460(0x00B0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1510(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1530(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x1550(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1700(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1858(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1880(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1920(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1948(0x0028)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x1970(0x00A0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x1A10(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1AB0(0x00A0)()
	bool                                          bNeedAimming;                                      // 0x1B50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void HitAddtiveLayer(const struct FPoseLink& HitInputPose, struct FPoseLink* HitAddtiveLayer_0);
	void CurveDataLayer(const struct FPoseLink& CurveInputPose, struct FPoseLink* CurveDataLayer_0);
	void GroundIKLayer(const struct FPoseLink& GroundIkInputPose, struct FPoseLink* GroundIKLayer_0);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_114_Main_AnimGraphNode_TransitionResult_D1CE6EA94358B103E9B42BB2B43AB727();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_114_Main_AnimGraphNode_TransitionResult_E7FD856B4F70E9856D6128AB8072EC7D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_114_Main_AnimGraphNode_TransitionResult_DE73DF8E41382133C04A138774C96170();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_114_Main_AnimGraphNode_TransitionResult_832A7C0349AD338F5F20328471438200();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_Mon_114_Main(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Mon_114_Main_C">();
	}
	static class UABP_Mon_114_Main_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Mon_114_Main_C>();
	}
};
static_assert(alignof(UABP_Mon_114_Main_C) == 0x000010, "Wrong alignment on UABP_Mon_114_Main_C");
static_assert(sizeof(UABP_Mon_114_Main_C) == 0x001B60, "Wrong size on UABP_Mon_114_Main_C");
static_assert(offsetof(UABP_Mon_114_Main_C, UberGraphFrame) == 0x0005D0, "Member 'UABP_Mon_114_Main_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_Root_3) == 0x0005D8, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_LinkedInputPose_2) == 0x000608, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_Root_2) == 0x000720, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_LinkedInputPose_1) == 0x000750, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_Root_1) == 0x000868, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_LinkedInputPose) == 0x000898, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_Root) == 0x0009B0, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_LinkedAnimLayer_1) == 0x0009E0, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_LinkedAnimLayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_SaveCachedPose_2) == 0x000A90, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_SaveCachedPose_1) == 0x000BE8, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_TransitionResult_3) == 0x000D40, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_TransitionResult_2) == 0x000D68, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_TransitionResult_1) == 0x000D90, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_TransitionResult) == 0x000DB8, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_ApplyAdditive) == 0x000DE0, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_BlendSpacePlayer) == 0x000EA8, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_Slot_2) == 0x000F90, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_UseCachedPose_5) == 0x000FD8, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_BlendListByBool_3) == 0x001000, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_Slot_1) == 0x0010A0, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_UseCachedPose_4) == 0x0010E8, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_StateResult_2) == 0x001110, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_SequencePlayer_1) == 0x001140, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_StateResult_1) == 0x0011C0, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_UseCachedPose_3) == 0x0011F0, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_SequencePlayer) == 0x001218, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_Slot) == 0x001298, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_BlendListByBool_2) == 0x0012E0, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_StateResult) == 0x001380, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_StateMachine) == 0x0013B0, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_LinkedAnimLayer) == 0x001460, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_LocalToComponentSpace) == 0x001510, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_ComponentToLocalSpace) == 0x001530, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_LookAt) == 0x001550, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_SaveCachedPose) == 0x001700, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_UseCachedPose_2) == 0x001858, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_BlendListByBool_1) == 0x001880, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_UseCachedPose_1) == 0x001920, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_UseCachedPose) == 0x001948, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_LinkedAnimGraph_1) == 0x001970, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_LinkedAnimGraph_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_LinkedAnimGraph) == 0x001A10, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, AnimGraphNode_BlendListByBool) == 0x001AB0, "Member 'UABP_Mon_114_Main_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Mon_114_Main_C, bNeedAimming) == 0x001B50, "Member 'UABP_Mon_114_Main_C::bNeedAimming' has a wrong offset!");

}

