#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Girl004b_Phy

#include "Basic.hpp"

#include "Game_classes.hpp"
#include "Engine_structs.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "SeasunAnimGraph_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Girl004b_Phy.ABP_Girl004b_Phy_C
// 0x177E0 (0x17DE0 - 0x0600)
class UABP_Girl004b_Phy_C final : public UAnimInstance_Girl015
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0600(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0608(0x0158)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0760(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x07E0(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x0828(0x0020)()
	uint8                                         Pad_848[0x8];                                      // 0x0848(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AimOffset                    AnimGraphNode_AimOffset;                           // 0x0850(0x0200)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0A50(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x0AF0(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0B10(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0C68(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0C90(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0CB8(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0D58(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0DA0(0x0080)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x0E20(0x00A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0EC0(0x0030)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_99;                    // 0x0EF0(0x0390)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1280(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x12A0(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_98;                    // 0x12C0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_97;                    // 0x1650(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_96;                    // 0x19E0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_95;                    // 0x1D70(0x0390)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x2100(0x0028)()
	uint8                                         Pad_2128[0x8];                                     // 0x2128(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_94;                    // 0x2130(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_93;                    // 0x24C0(0x0390)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x2850(0x00A0)()
	struct FAnimNode_RecoilSequenceNode           AnimGraphNode_RecoilSequenceNode;                  // 0x28F0(0x09A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_92;                    // 0x3290(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_91;                    // 0x3620(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_90;                    // 0x39B0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_89;                    // 0x3D40(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_88;                    // 0x40D0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_87;                    // 0x4460(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_86;                    // 0x47F0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_85;                    // 0x4B80(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_84;                    // 0x4F10(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_83;                    // 0x52A0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_82;                    // 0x5630(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_81;                    // 0x59C0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_80;                    // 0x5D50(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_79;                    // 0x60E0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_78;                    // 0x6470(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_77;                    // 0x6800(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_76;                    // 0x6B90(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_75;                    // 0x6F20(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_74;                    // 0x72B0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_73;                    // 0x7640(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_72;                    // 0x79D0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_71;                    // 0x7D60(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_70;                    // 0x80F0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_69;                    // 0x8480(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_68;                    // 0x8810(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_67;                    // 0x8BA0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_66;                    // 0x8F30(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_65;                    // 0x92C0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_64;                    // 0x9650(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_63;                    // 0x99E0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_62;                    // 0x9D70(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_61;                    // 0xA100(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_60;                    // 0xA490(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_59;                    // 0xA820(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_58;                    // 0xABB0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_57;                    // 0xAF40(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_56;                    // 0xB2D0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_55;                    // 0xB660(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_54;                    // 0xB9F0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_53;                    // 0xBD80(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_52;                    // 0xC110(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_51;                    // 0xC4A0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_50;                    // 0xC830(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_49;                    // 0xCBC0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_48;                    // 0xCF50(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_47;                    // 0xD2E0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_46;                    // 0xD670(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_45;                    // 0xDA00(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_44;                    // 0xDD90(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_43;                    // 0xE120(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_42;                    // 0xE4B0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_41;                    // 0xE840(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_40;                    // 0xEBD0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_39;                    // 0xEF60(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_38;                    // 0xF2F0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_37;                    // 0xF680(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_36;                    // 0xFA10(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_35;                    // 0xFDA0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_34;                    // 0x10130(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_33;                    // 0x104C0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_32;                    // 0x10850(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_31;                    // 0x10BE0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_30;                    // 0x10F70(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_29;                    // 0x11300(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_28;                    // 0x11690(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_27;                    // 0x11A20(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_26;                    // 0x11DB0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_25;                    // 0x12140(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_24;                    // 0x124D0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_23;                    // 0x12860(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_22;                    // 0x12BF0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_21;                    // 0x12F80(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_20;                    // 0x13310(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0x136A0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0x13A30(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0x13DC0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0x14150(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0x144E0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x14870(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x14C00(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x14F90(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x15320(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x156B0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x15A40(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x15DD0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x16160(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x164F0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x16880(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x16C10(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x16FA0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x17330(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x176C0(0x0390)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x17A50(0x0390)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Girl004b_Phy_AnimGraphNode_BlendListByBool_C6E4B3F3427071A2784EDC8A4EBA5988();
	void ExecuteUbergraph_ABP_Girl004b_Phy(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Girl004b_Phy_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Girl004b_Phy_C")
	}
	static class UABP_Girl004b_Phy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Girl004b_Phy_C>();
	}
};
DUMPER7_ASSERTS_UABP_Girl004b_Phy_C;

}

