#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mon_102

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Mon_102.ABP_Mon_102_C
// 0x1660 (0x1C30 - 0x05D0)
class UABP_Mon_102_C final : public UAnimInstance_Humanoid
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x05D8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x0608(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0720(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0750(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0868(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0898(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x09B0(0x0030)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x09E0(0x00B0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x0A90(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x0B40(0x0158)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0C98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0CC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0CE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0D10(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x0D38(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x0D58(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0D78(0x0108)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x0E80(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x0EC8(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x0F68(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x0F90(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0FD8(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x1098(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x10E0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x1108(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1130(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1160(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x11E0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x1210(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1238(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x12B8(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1358(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x13A0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x13D0(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x1480(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x15D8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1600(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x16A0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x16C8(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x16F0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1710(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x1730(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x18E0(0x0158)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x1A38(0x00A0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x1AD8(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1B78(0x00A0)()
	bool                                          IsAimming;                                         // 0x1C18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C19[0x3];                                     // 0x1C19(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               ModifiedAimOffset;                                 // 0x1C1C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void HitAddtiveLayer(const struct FPoseLink& HitInputPose, struct FPoseLink* HitAddtiveLayer_0);
	void CurveDataLayer(const struct FPoseLink& CurveInputPose, struct FPoseLink* CurveDataLayer_0);
	void GroundIKLayer(const struct FPoseLink& GroundIkInputPose, struct FPoseLink* GroundIKLayer_0);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_102_AnimGraphNode_TransitionResult_67DB1BAA4685AD1128542AB983BF7798();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_102_AnimGraphNode_SequencePlayer_C58A2187428FAF9CC2E71E8DE76DCB06();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_102_AnimGraphNode_TransitionResult_48F23C71460E3E28915503B15FE4AB14();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_102_AnimGraphNode_TransitionResult_9F3D3CC2440FEBB32AF4338EEDDCDB92();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_102_AnimGraphNode_TransitionResult_8F6834594701B17127A517A636286A12();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimNotify_AimEnd();
	void AnimNotify_AimStart();
	void BlueprintBeginPlay();
	void ExecuteUbergraph_ABP_Mon_102(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Mon_102_C">();
	}
	static class UABP_Mon_102_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Mon_102_C>();
	}
};
static_assert(alignof(UABP_Mon_102_C) == 0x000010, "Wrong alignment on UABP_Mon_102_C");
static_assert(sizeof(UABP_Mon_102_C) == 0x001C30, "Wrong size on UABP_Mon_102_C");
static_assert(offsetof(UABP_Mon_102_C, UberGraphFrame) == 0x0005D0, "Member 'UABP_Mon_102_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_Root_3) == 0x0005D8, "Member 'UABP_Mon_102_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_LinkedInputPose_2) == 0x000608, "Member 'UABP_Mon_102_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_Root_2) == 0x000720, "Member 'UABP_Mon_102_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_LinkedInputPose_1) == 0x000750, "Member 'UABP_Mon_102_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_Root_1) == 0x000868, "Member 'UABP_Mon_102_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_LinkedInputPose) == 0x000898, "Member 'UABP_Mon_102_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_Root) == 0x0009B0, "Member 'UABP_Mon_102_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_LinkedAnimLayer_1) == 0x0009E0, "Member 'UABP_Mon_102_C::AnimGraphNode_LinkedAnimLayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_LinkedAnimLayer) == 0x000A90, "Member 'UABP_Mon_102_C::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_SaveCachedPose_2) == 0x000B40, "Member 'UABP_Mon_102_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_TransitionResult_3) == 0x000C98, "Member 'UABP_Mon_102_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_TransitionResult_2) == 0x000CC0, "Member 'UABP_Mon_102_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_TransitionResult_1) == 0x000CE8, "Member 'UABP_Mon_102_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_TransitionResult) == 0x000D10, "Member 'UABP_Mon_102_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x000D38, "Member 'UABP_Mon_102_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_LocalToComponentSpace_1) == 0x000D58, "Member 'UABP_Mon_102_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_ModifyBone) == 0x000D78, "Member 'UABP_Mon_102_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_Slot_3) == 0x000E80, "Member 'UABP_Mon_102_C::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_BlendListByBool_3) == 0x000EC8, "Member 'UABP_Mon_102_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_UseCachedPose_6) == 0x000F68, "Member 'UABP_Mon_102_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_Slot_2) == 0x000F90, "Member 'UABP_Mon_102_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_LayeredBoneBlend) == 0x000FD8, "Member 'UABP_Mon_102_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_Slot_1) == 0x001098, "Member 'UABP_Mon_102_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_UseCachedPose_5) == 0x0010E0, "Member 'UABP_Mon_102_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_UseCachedPose_4) == 0x001108, "Member 'UABP_Mon_102_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_StateResult_2) == 0x001130, "Member 'UABP_Mon_102_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_SequencePlayer_1) == 0x001160, "Member 'UABP_Mon_102_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_StateResult_1) == 0x0011E0, "Member 'UABP_Mon_102_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_UseCachedPose_3) == 0x001210, "Member 'UABP_Mon_102_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_SequencePlayer) == 0x001238, "Member 'UABP_Mon_102_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_BlendListByBool_2) == 0x0012B8, "Member 'UABP_Mon_102_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_Slot) == 0x001358, "Member 'UABP_Mon_102_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_StateResult) == 0x0013A0, "Member 'UABP_Mon_102_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_StateMachine) == 0x0013D0, "Member 'UABP_Mon_102_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_SaveCachedPose_1) == 0x001480, "Member 'UABP_Mon_102_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_UseCachedPose_2) == 0x0015D8, "Member 'UABP_Mon_102_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_BlendListByBool_1) == 0x001600, "Member 'UABP_Mon_102_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_UseCachedPose_1) == 0x0016A0, "Member 'UABP_Mon_102_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_UseCachedPose) == 0x0016C8, "Member 'UABP_Mon_102_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_LocalToComponentSpace) == 0x0016F0, "Member 'UABP_Mon_102_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_ComponentToLocalSpace) == 0x001710, "Member 'UABP_Mon_102_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_LookAt) == 0x001730, "Member 'UABP_Mon_102_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_SaveCachedPose) == 0x0018E0, "Member 'UABP_Mon_102_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_LinkedAnimGraph_1) == 0x001A38, "Member 'UABP_Mon_102_C::AnimGraphNode_LinkedAnimGraph_1' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_LinkedAnimGraph) == 0x001AD8, "Member 'UABP_Mon_102_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, AnimGraphNode_BlendListByBool) == 0x001B78, "Member 'UABP_Mon_102_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, IsAimming) == 0x001C18, "Member 'UABP_Mon_102_C::IsAimming' has a wrong offset!");
static_assert(offsetof(UABP_Mon_102_C, ModifiedAimOffset) == 0x001C1C, "Member 'UABP_Mon_102_C::ModifiedAimOffset' has a wrong offset!");

}

