#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ACE_girl008

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ACE_girl008.ACE_Girl008_C
// 0x00B0 (0x02D8 - 0x0228)
class AACE_Girl008_C final : public AAbilityCollisionEditor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAbilityCollision_Box*                  AbilityCollision_Box8;                             // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Box*                  AbilityCollision_Box7;                             // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Box*                  AbilityCollision_Box6;                             // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Box*                  AbilityCollision_Box5;                             // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Box*                  AbilityCollision_Box4;                             // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Box*                  AbilityCollision_Box3;                             // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Box*                  AbilityCollision_Box2;                             // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Box*                  AbilityCollision_Box1;                             // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Skill02_08;                                        // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Skill02_07;                                        // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Skill02_06;                                        // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Skill02_05;                                        // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Skill02_04;                                        // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Skill02_03;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Skill02_02;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Skill02_01;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Skill02;                                           // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Box*                  AbilityCollision_QTE;                              // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Target;                                            // 0x02C8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_ACE_Girl008(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ACE_Girl008_C">();
	}
	static class AACE_Girl008_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AACE_Girl008_C>();
	}
};
static_assert(alignof(AACE_Girl008_C) == 0x000008, "Wrong alignment on AACE_Girl008_C");
static_assert(sizeof(AACE_Girl008_C) == 0x0002D8, "Wrong size on AACE_Girl008_C");
static_assert(offsetof(AACE_Girl008_C, UberGraphFrame) == 0x000228, "Member 'AACE_Girl008_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AACE_Girl008_C, AbilityCollision_Box8) == 0x000230, "Member 'AACE_Girl008_C::AbilityCollision_Box8' has a wrong offset!");
static_assert(offsetof(AACE_Girl008_C, AbilityCollision_Box7) == 0x000238, "Member 'AACE_Girl008_C::AbilityCollision_Box7' has a wrong offset!");
static_assert(offsetof(AACE_Girl008_C, AbilityCollision_Box6) == 0x000240, "Member 'AACE_Girl008_C::AbilityCollision_Box6' has a wrong offset!");
static_assert(offsetof(AACE_Girl008_C, AbilityCollision_Box5) == 0x000248, "Member 'AACE_Girl008_C::AbilityCollision_Box5' has a wrong offset!");
static_assert(offsetof(AACE_Girl008_C, AbilityCollision_Box4) == 0x000250, "Member 'AACE_Girl008_C::AbilityCollision_Box4' has a wrong offset!");
static_assert(offsetof(AACE_Girl008_C, AbilityCollision_Box3) == 0x000258, "Member 'AACE_Girl008_C::AbilityCollision_Box3' has a wrong offset!");
static_assert(offsetof(AACE_Girl008_C, AbilityCollision_Box2) == 0x000260, "Member 'AACE_Girl008_C::AbilityCollision_Box2' has a wrong offset!");
static_assert(offsetof(AACE_Girl008_C, AbilityCollision_Box1) == 0x000268, "Member 'AACE_Girl008_C::AbilityCollision_Box1' has a wrong offset!");
static_assert(offsetof(AACE_Girl008_C, Skill02_08) == 0x000270, "Member 'AACE_Girl008_C::Skill02_08' has a wrong offset!");
static_assert(offsetof(AACE_Girl008_C, Skill02_07) == 0x000278, "Member 'AACE_Girl008_C::Skill02_07' has a wrong offset!");
static_assert(offsetof(AACE_Girl008_C, Skill02_06) == 0x000280, "Member 'AACE_Girl008_C::Skill02_06' has a wrong offset!");
static_assert(offsetof(AACE_Girl008_C, Skill02_05) == 0x000288, "Member 'AACE_Girl008_C::Skill02_05' has a wrong offset!");
static_assert(offsetof(AACE_Girl008_C, Skill02_04) == 0x000290, "Member 'AACE_Girl008_C::Skill02_04' has a wrong offset!");
static_assert(offsetof(AACE_Girl008_C, Skill02_03) == 0x000298, "Member 'AACE_Girl008_C::Skill02_03' has a wrong offset!");
static_assert(offsetof(AACE_Girl008_C, Skill02_02) == 0x0002A0, "Member 'AACE_Girl008_C::Skill02_02' has a wrong offset!");
static_assert(offsetof(AACE_Girl008_C, Skill02_01) == 0x0002A8, "Member 'AACE_Girl008_C::Skill02_01' has a wrong offset!");
static_assert(offsetof(AACE_Girl008_C, Skill02) == 0x0002B0, "Member 'AACE_Girl008_C::Skill02' has a wrong offset!");
static_assert(offsetof(AACE_Girl008_C, AbilityCollision_QTE) == 0x0002B8, "Member 'AACE_Girl008_C::AbilityCollision_QTE' has a wrong offset!");
static_assert(offsetof(AACE_Girl008_C, SkeletalMesh) == 0x0002C0, "Member 'AACE_Girl008_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(AACE_Girl008_C, Target) == 0x0002C8, "Member 'AACE_Girl008_C::Target' has a wrong offset!");

}

