#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ACE_girl008

#include "Basic.hpp"


namespace SDK::Params
{

// Function ACE_girl008.ACE_Girl008_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct ACE_Girl008_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ACE_Girl008_C_ReceiveTick) == 0x000004, "Wrong alignment on ACE_Girl008_C_ReceiveTick");
static_assert(sizeof(ACE_Girl008_C_ReceiveTick) == 0x000004, "Wrong size on ACE_Girl008_C_ReceiveTick");
static_assert(offsetof(ACE_Girl008_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'ACE_Girl008_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function ACE_girl008.ACE_Girl008_C.ExecuteUbergraph_ACE_Girl008
// 0x0008 (0x0008 - 0x0000)
struct ACE_Girl008_C_ExecuteUbergraph_ACE_Girl008 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ACE_Girl008_C_ExecuteUbergraph_ACE_Girl008) == 0x000004, "Wrong alignment on ACE_Girl008_C_ExecuteUbergraph_ACE_Girl008");
static_assert(sizeof(ACE_Girl008_C_ExecuteUbergraph_ACE_Girl008) == 0x000008, "Wrong size on ACE_Girl008_C_ExecuteUbergraph_ACE_Girl008");
static_assert(offsetof(ACE_Girl008_C_ExecuteUbergraph_ACE_Girl008, EntryPoint) == 0x000000, "Member 'ACE_Girl008_C_ExecuteUbergraph_ACE_Girl008::EntryPoint' has a wrong offset!");
static_assert(offsetof(ACE_Girl008_C_ExecuteUbergraph_ACE_Girl008, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'ACE_Girl008_C_ExecuteUbergraph_ACE_Girl008::K2Node_Event_DeltaSeconds' has a wrong offset!");

}

