#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ACE_Girl006a

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ACE_Girl006a.ACE_Girl006a_C
// 0x0038 (0x0260 - 0x0228)
class AACE_Girl006a_C final : public AAbilityCollisionEditor
{
public:
	class UAbilityCollision_Box*                  AbilityCollision_skill03_01c4;                     // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Box*                  AbilityCollision_skill03_01c3;                     // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Box*                  AbilityCollision_skill03_01c2;                     // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Box*                  AbilityCollision_skill03_01c1;                     // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Box*                  AbilityCollision_skill04;                          // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Sphere*               AbilityCollision_skill03_01c;                      // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ACE_Girl006a_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ACE_Girl006a_C")
	}
	static class AACE_Girl006a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AACE_Girl006a_C>();
	}
};
DUMPER7_ASSERTS_AACE_Girl006a_C;

}

