#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ACE_Girl002a

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ACE_Girl002a.ACE_Girl002a_C
// 0x0020 (0x0248 - 0x0228)
class AACE_Girl002a_C final : public AAbilityCollisionEditor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAbilityCollision_Box*                  QTE02;                                             // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Box*                  QTE01;                                             // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_ACE_Girl002a(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ACE_Girl002a_C">();
	}
	static class AACE_Girl002a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AACE_Girl002a_C>();
	}
};
static_assert(alignof(AACE_Girl002a_C) == 0x000008, "Wrong alignment on AACE_Girl002a_C");
static_assert(sizeof(AACE_Girl002a_C) == 0x000248, "Wrong size on AACE_Girl002a_C");
static_assert(offsetof(AACE_Girl002a_C, UberGraphFrame) == 0x000228, "Member 'AACE_Girl002a_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AACE_Girl002a_C, QTE02) == 0x000230, "Member 'AACE_Girl002a_C::QTE02' has a wrong offset!");
static_assert(offsetof(AACE_Girl002a_C, QTE01) == 0x000238, "Member 'AACE_Girl002a_C::QTE01' has a wrong offset!");
static_assert(offsetof(AACE_Girl002a_C, SkeletalMesh) == 0x000240, "Member 'AACE_Girl002a_C::SkeletalMesh' has a wrong offset!");

}

