#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ACE_Girl004a

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ACE_Girl004a.ACE_Girl004a_C
// 0x0020 (0x0248 - 0x0228)
class AACE_Girl004a_C final : public AAbilityCollisionEditor
{
public:
	class UAbilityCollision_Box*                  AbilityCollision_Box;                              // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Capsual*              AbilityCollision_Capsual;                          // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Sphere*               AbilityCollision_Sphere;                           // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ACE_Girl004a_C">();
	}
	static class AACE_Girl004a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AACE_Girl004a_C>();
	}
};
static_assert(alignof(AACE_Girl004a_C) == 0x000008, "Wrong alignment on AACE_Girl004a_C");
static_assert(sizeof(AACE_Girl004a_C) == 0x000248, "Wrong size on AACE_Girl004a_C");
static_assert(offsetof(AACE_Girl004a_C, AbilityCollision_Box) == 0x000228, "Member 'AACE_Girl004a_C::AbilityCollision_Box' has a wrong offset!");
static_assert(offsetof(AACE_Girl004a_C, AbilityCollision_Capsual) == 0x000230, "Member 'AACE_Girl004a_C::AbilityCollision_Capsual' has a wrong offset!");
static_assert(offsetof(AACE_Girl004a_C, AbilityCollision_Sphere) == 0x000238, "Member 'AACE_Girl004a_C::AbilityCollision_Sphere' has a wrong offset!");
static_assert(offsetof(AACE_Girl004a_C, SkeletalMesh) == 0x000240, "Member 'AACE_Girl004a_C::SkeletalMesh' has a wrong offset!");

}

