#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ACE_Girl006a

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ACE_Girl006a.ACE_Girl006a_C
// 0x0038 (0x0258 - 0x0220)
class AACE_Girl006a_C final : public AAbilityCollisionEditor
{
public:
	class UAbilityCollision_Box*                  AbilityCollision_skill03_01c4;                     // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Box*                  AbilityCollision_skill03_01c3;                     // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Box*                  AbilityCollision_skill03_01c2;                     // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Box*                  AbilityCollision_skill03_01c1;                     // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Box*                  AbilityCollision_skill04;                          // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Sphere*               AbilityCollision_skill03_01c;                      // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ACE_Girl006a_C">();
	}
	static class AACE_Girl006a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AACE_Girl006a_C>();
	}
};
static_assert(alignof(AACE_Girl006a_C) == 0x000008, "Wrong alignment on AACE_Girl006a_C");
static_assert(sizeof(AACE_Girl006a_C) == 0x000258, "Wrong size on AACE_Girl006a_C");
static_assert(offsetof(AACE_Girl006a_C, AbilityCollision_skill03_01c4) == 0x000220, "Member 'AACE_Girl006a_C::AbilityCollision_skill03_01c4' has a wrong offset!");
static_assert(offsetof(AACE_Girl006a_C, AbilityCollision_skill03_01c3) == 0x000228, "Member 'AACE_Girl006a_C::AbilityCollision_skill03_01c3' has a wrong offset!");
static_assert(offsetof(AACE_Girl006a_C, AbilityCollision_skill03_01c2) == 0x000230, "Member 'AACE_Girl006a_C::AbilityCollision_skill03_01c2' has a wrong offset!");
static_assert(offsetof(AACE_Girl006a_C, AbilityCollision_skill03_01c1) == 0x000238, "Member 'AACE_Girl006a_C::AbilityCollision_skill03_01c1' has a wrong offset!");
static_assert(offsetof(AACE_Girl006a_C, AbilityCollision_skill04) == 0x000240, "Member 'AACE_Girl006a_C::AbilityCollision_skill04' has a wrong offset!");
static_assert(offsetof(AACE_Girl006a_C, AbilityCollision_skill03_01c) == 0x000248, "Member 'AACE_Girl006a_C::AbilityCollision_skill03_01c' has a wrong offset!");
static_assert(offsetof(AACE_Girl006a_C, SkeletalMesh) == 0x000250, "Member 'AACE_Girl006a_C::SkeletalMesh' has a wrong offset!");

}

