#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AddTextTip

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AddTextTip.AddTextTip_C.OnTrigger
// 0x0028 (0x0028 - 0x0000)
struct AddTextTip_C_OnTrigger final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSuccessed_Result;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AddTextTip_C_OnTrigger) == 0x000008, "Wrong alignment on AddTextTip_C_OnTrigger");
static_assert(sizeof(AddTextTip_C_OnTrigger) == 0x000028, "Wrong size on AddTextTip_C_OnTrigger");
static_assert(offsetof(AddTextTip_C_OnTrigger, ReturnValue) == 0x000000, "Member 'AddTextTip_C_OnTrigger::ReturnValue' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_OnTrigger, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AddTextTip_C_OnTrigger::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_OnTrigger, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000014, "Member 'AddTextTip_C_OnTrigger::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_OnTrigger, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'AddTextTip_C_OnTrigger::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_OnTrigger, CallFunc_IsSuccessed_Result) == 0x000020, "Member 'AddTextTip_C_OnTrigger::CallFunc_IsSuccessed_Result' has a wrong offset!");

// Function AddTextTip.AddTextTip_C.AddTip
// 0x01F0 (0x01F0 - 0x0000)
struct AddTextTip_C_AddTip final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   Desc;                                              // 0x0018(0x0018)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetLocalizationText_ReturnValue;          // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Format_Result;                            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	int32                                         CallFunc_GetTaskData_Res;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0080(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	class UObject*                                CallFunc_GetFightTips_ReturnValue;                 // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUw_fight_tips_C*                       K2Node_DynamicCast_AsUw_Fight_Tips;                // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTipsPool_Result;                       // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetLocalizationText_ReturnValue_1;        // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00F8(0x0018)()
	class FString                                 CallFunc_GetLocalizationText_ReturnValue_2;        // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0120(0x0018)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetLocalizationText_ReturnValue_3;        // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0170(0x0018)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetLocalizationText_ReturnValue_4;        // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x01C0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01D8(0x0018)()
};
static_assert(alignof(AddTextTip_C_AddTip) == 0x000008, "Wrong alignment on AddTextTip_C_AddTip");
static_assert(sizeof(AddTextTip_C_AddTip) == 0x0001F0, "Wrong size on AddTextTip_C_AddTip");
static_assert(offsetof(AddTextTip_C_AddTip, Title) == 0x000000, "Member 'AddTextTip_C_AddTip::Title' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, Desc) == 0x000018, "Member 'AddTextTip_C_AddTip::Desc' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'AddTextTip_C_AddTip::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, CallFunc_GetLocalizationText_ReturnValue) == 0x000038, "Member 'AddTextTip_C_AddTip::CallFunc_GetLocalizationText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, CallFunc_Greater_IntInt_ReturnValue) == 0x000048, "Member 'AddTextTip_C_AddTip::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, CallFunc_Format_Result) == 0x000050, "Member 'AddTextTip_C_AddTip::CallFunc_Format_Result' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'AddTextTip_C_AddTip::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, CallFunc_GetTaskData_Res) == 0x000078, "Member 'AddTextTip_C_AddTip::CallFunc_GetTaskData_Res' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00007C, "Member 'AddTextTip_C_AddTip::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, K2Node_MakeStruct_FormatArgumentData) == 0x000080, "Member 'AddTextTip_C_AddTip::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, K2Node_MakeArray_Array) == 0x0000C0, "Member 'AddTextTip_C_AddTip::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, CallFunc_GetFightTips_ReturnValue) == 0x0000D0, "Member 'AddTextTip_C_AddTip::CallFunc_GetFightTips_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, K2Node_DynamicCast_AsUw_Fight_Tips) == 0x0000D8, "Member 'AddTextTip_C_AddTip::K2Node_DynamicCast_AsUw_Fight_Tips' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'AddTextTip_C_AddTip::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, CallFunc_AddTipsPool_Result) == 0x0000E1, "Member 'AddTextTip_C_AddTip::CallFunc_AddTipsPool_Result' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, CallFunc_GetLocalizationText_ReturnValue_1) == 0x0000E8, "Member 'AddTextTip_C_AddTip::CallFunc_GetLocalizationText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000F8, "Member 'AddTextTip_C_AddTip::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, CallFunc_GetLocalizationText_ReturnValue_2) == 0x000110, "Member 'AddTextTip_C_AddTip::CallFunc_GetLocalizationText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000120, "Member 'AddTextTip_C_AddTip::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, CallFunc_Conv_IntToString_ReturnValue) == 0x000138, "Member 'AddTextTip_C_AddTip::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000148, "Member 'AddTextTip_C_AddTip::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, CallFunc_Concat_StrStr_ReturnValue) == 0x000150, "Member 'AddTextTip_C_AddTip::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, CallFunc_GetLocalizationText_ReturnValue_3) == 0x000160, "Member 'AddTextTip_C_AddTip::CallFunc_GetLocalizationText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000170, "Member 'AddTextTip_C_AddTip::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000188, "Member 'AddTextTip_C_AddTip::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000198, "Member 'AddTextTip_C_AddTip::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0001A8, "Member 'AddTextTip_C_AddTip::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, CallFunc_GetLocalizationText_ReturnValue_4) == 0x0001B0, "Member 'AddTextTip_C_AddTip::CallFunc_GetLocalizationText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, CallFunc_Conv_StringToText_ReturnValue_4) == 0x0001C0, "Member 'AddTextTip_C_AddTip::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_AddTip, CallFunc_Format_ReturnValue) == 0x0001D8, "Member 'AddTextTip_C_AddTip::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function AddTextTip.AddTextTip_C.GetTaskData
// 0x0018 (0x0018 - 0x0000)
struct AddTextTip_C_GetTaskData final
{
public:
	int32                                         Res;                                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameTaskActor*                         CallFunc_GetGameTaskActor_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetOrAddValue_ReturnValue;                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AddTextTip_C_GetTaskData) == 0x000008, "Wrong alignment on AddTextTip_C_GetTaskData");
static_assert(sizeof(AddTextTip_C_GetTaskData) == 0x000018, "Wrong size on AddTextTip_C_GetTaskData");
static_assert(offsetof(AddTextTip_C_GetTaskData, Res) == 0x000000, "Member 'AddTextTip_C_GetTaskData::Res' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_GetTaskData, CallFunc_GetGameTaskActor_ReturnValue) == 0x000008, "Member 'AddTextTip_C_GetTaskData::CallFunc_GetGameTaskActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_GetTaskData, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'AddTextTip_C_GetTaskData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_GetTaskData, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'AddTextTip_C_GetTaskData::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_GetTaskData, CallFunc_GetOrAddValue_ReturnValue) == 0x000014, "Member 'AddTextTip_C_GetTaskData::CallFunc_GetOrAddValue_ReturnValue' has a wrong offset!");

// Function AddTextTip.AddTextTip_C.IsSuccessed__Overridden
// 0x0001 (0x0001 - 0x0000)
struct AddTextTip_C_IsSuccessed__Overridden final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AddTextTip_C_IsSuccessed__Overridden) == 0x000001, "Wrong alignment on AddTextTip_C_IsSuccessed__Overridden");
static_assert(sizeof(AddTextTip_C_IsSuccessed__Overridden) == 0x000001, "Wrong size on AddTextTip_C_IsSuccessed__Overridden");
static_assert(offsetof(AddTextTip_C_IsSuccessed__Overridden, Result) == 0x000000, "Member 'AddTextTip_C_IsSuccessed__Overridden::Result' has a wrong offset!");

// Function AddTextTip.AddTextTip_C.Format__Overridden
// 0x0020 (0x0020 - 0x0000)
struct AddTextTip_C_Format__Overridden final
{
public:
	class FString                                 FormatText;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Result;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AddTextTip_C_Format__Overridden) == 0x000008, "Wrong alignment on AddTextTip_C_Format__Overridden");
static_assert(sizeof(AddTextTip_C_Format__Overridden) == 0x000020, "Wrong size on AddTextTip_C_Format__Overridden");
static_assert(offsetof(AddTextTip_C_Format__Overridden, FormatText) == 0x000000, "Member 'AddTextTip_C_Format__Overridden::FormatText' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_Format__Overridden, Result) == 0x000010, "Member 'AddTextTip_C_Format__Overridden::Result' has a wrong offset!");

// LuaFunction AddTextTip.AddTextTip_C.IsSuccessed
// 0x0001 (0x0001 - 0x0000)
struct AddTextTip_C_IsSuccessed final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AddTextTip_C_IsSuccessed) == 0x000001, "Wrong alignment on AddTextTip_C_IsSuccessed");
static_assert(sizeof(AddTextTip_C_IsSuccessed) == 0x000001, "Wrong size on AddTextTip_C_IsSuccessed");
static_assert(offsetof(AddTextTip_C_IsSuccessed, Result) == 0x000000, "Member 'AddTextTip_C_IsSuccessed::Result' has a wrong offset!");

// LuaFunction AddTextTip.AddTextTip_C.Format
// 0x0020 (0x0020 - 0x0000)
struct AddTextTip_C_Format final
{
public:
	class FString                                 FormatText;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Result;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AddTextTip_C_Format) == 0x000008, "Wrong alignment on AddTextTip_C_Format");
static_assert(sizeof(AddTextTip_C_Format) == 0x000020, "Wrong size on AddTextTip_C_Format");
static_assert(offsetof(AddTextTip_C_Format, FormatText) == 0x000000, "Member 'AddTextTip_C_Format::FormatText' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_Format, Result) == 0x000010, "Member 'AddTextTip_C_Format::Result' has a wrong offset!");

// Function AddTextTip.AddTextTip_C.GetSpecialStaticDescription
// 0x0080 (0x0080 - 0x0000)
struct AddTextTip_C_GetSpecialStaticDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AddTextTip_C_GetSpecialStaticDescription) == 0x000008, "Wrong alignment on AddTextTip_C_GetSpecialStaticDescription");
static_assert(sizeof(AddTextTip_C_GetSpecialStaticDescription) == 0x000080, "Wrong size on AddTextTip_C_GetSpecialStaticDescription");
static_assert(offsetof(AddTextTip_C_GetSpecialStaticDescription, ReturnValue) == 0x000000, "Member 'AddTextTip_C_GetSpecialStaticDescription::ReturnValue' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_GetSpecialStaticDescription, CallFunc_Conv_FloatToString_ReturnValue) == 0x000010, "Member 'AddTextTip_C_GetSpecialStaticDescription::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_GetSpecialStaticDescription, CallFunc_Conv_IntToString_ReturnValue) == 0x000020, "Member 'AddTextTip_C_GetSpecialStaticDescription::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'AddTextTip_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000040, "Member 'AddTextTip_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000050, "Member 'AddTextTip_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000060, "Member 'AddTextTip_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AddTextTip_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000070, "Member 'AddTextTip_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");

// Function AddTextTip.AddTextTip_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct AddTextTip_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(AddTextTip_C_GetModuleName) == 0x000008, "Wrong alignment on AddTextTip_C_GetModuleName");
static_assert(sizeof(AddTextTip_C_GetModuleName) == 0x000010, "Wrong size on AddTextTip_C_GetModuleName");
static_assert(offsetof(AddTextTip_C_GetModuleName, ReturnValue) == 0x000000, "Member 'AddTextTip_C_GetModuleName::ReturnValue' has a wrong offset!");

}

