#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AddTextTip

#include "Basic.hpp"

#include "EFightTipsType_structs.hpp"
#include "GameTask_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AddTextTip.AddTextTip_C
// 0x0080 (0x01D8 - 0x0158)
class UAddTextTip_C final : public UGameTaskEvent
{
public:
	int32                                         DescId;                                            // 0x0158(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TitleId;                                           // 0x015C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 DescText;                                          // 0x0160(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 TitleText;                                         // 0x0170(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	float                                         LastTime;                                          // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUw_fight_tips_C*                       Widget;                                            // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DescTaskData;                                      // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Key;                                               // 0x0198(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          UseKey;                                            // 0x01A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Args;                                              // 0x01B0(0x0010)(Edit, BlueprintVisible)
	EFightTipsType                                Type;                                              // 0x01C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CustomSoundEffects;                                // 0x01C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)

public:
	bool OnTrigger();
	void AddTip();
	void GetTaskData(int32* Res);
	void IsSuccessed__Overridden(bool* Result);
	void Format__Overridden(const class FString& FormatText, class FString* Result);
	void IsSuccessed(bool* Result);
	void Format(const class FString& FormatText, class FString* Result);

	class FString GetSpecialStaticDescription() const;
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AddTextTip_C">();
	}
	static class UAddTextTip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddTextTip_C>();
	}
};
static_assert(alignof(UAddTextTip_C) == 0x000008, "Wrong alignment on UAddTextTip_C");
static_assert(sizeof(UAddTextTip_C) == 0x0001D8, "Wrong size on UAddTextTip_C");
static_assert(offsetof(UAddTextTip_C, DescId) == 0x000158, "Member 'UAddTextTip_C::DescId' has a wrong offset!");
static_assert(offsetof(UAddTextTip_C, TitleId) == 0x00015C, "Member 'UAddTextTip_C::TitleId' has a wrong offset!");
static_assert(offsetof(UAddTextTip_C, DescText) == 0x000160, "Member 'UAddTextTip_C::DescText' has a wrong offset!");
static_assert(offsetof(UAddTextTip_C, TitleText) == 0x000170, "Member 'UAddTextTip_C::TitleText' has a wrong offset!");
static_assert(offsetof(UAddTextTip_C, LastTime) == 0x000180, "Member 'UAddTextTip_C::LastTime' has a wrong offset!");
static_assert(offsetof(UAddTextTip_C, Widget) == 0x000188, "Member 'UAddTextTip_C::Widget' has a wrong offset!");
static_assert(offsetof(UAddTextTip_C, DescTaskData) == 0x000190, "Member 'UAddTextTip_C::DescTaskData' has a wrong offset!");
static_assert(offsetof(UAddTextTip_C, Key) == 0x000198, "Member 'UAddTextTip_C::Key' has a wrong offset!");
static_assert(offsetof(UAddTextTip_C, UseKey) == 0x0001A8, "Member 'UAddTextTip_C::UseKey' has a wrong offset!");
static_assert(offsetof(UAddTextTip_C, Args) == 0x0001B0, "Member 'UAddTextTip_C::Args' has a wrong offset!");
static_assert(offsetof(UAddTextTip_C, Type) == 0x0001C0, "Member 'UAddTextTip_C::Type' has a wrong offset!");
static_assert(offsetof(UAddTextTip_C, CustomSoundEffects) == 0x0001C8, "Member 'UAddTextTip_C::CustomSoundEffects' has a wrong offset!");

}

