#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AddWarningTip

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AddWarningTip.AddWarningTip_C.AddWarning
// 0x0030 (0x0030 - 0x0000)
struct AddWarningTip_C_AddWarning final
{
public:
	class UUserWidget*                            CallFunc_CreateWidgetByCPP_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUw_fight_danger_retreat_C*             K2Node_DynamicCast_AsUw_Fight_Danger_Retreat;      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_CreateWidgetByCPP_ReturnValue_1;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUw_fight_danger_warning_C*             K2Node_DynamicCast_AsUw_Fight_Danger_Warning;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AddWarningTip_C_AddWarning) == 0x000008, "Wrong alignment on AddWarningTip_C_AddWarning");
static_assert(sizeof(AddWarningTip_C_AddWarning) == 0x000030, "Wrong size on AddWarningTip_C_AddWarning");
static_assert(offsetof(AddWarningTip_C_AddWarning, CallFunc_CreateWidgetByCPP_ReturnValue) == 0x000000, "Member 'AddWarningTip_C_AddWarning::CallFunc_CreateWidgetByCPP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddWarningTip_C_AddWarning, K2Node_DynamicCast_AsUw_Fight_Danger_Retreat) == 0x000008, "Member 'AddWarningTip_C_AddWarning::K2Node_DynamicCast_AsUw_Fight_Danger_Retreat' has a wrong offset!");
static_assert(offsetof(AddWarningTip_C_AddWarning, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'AddWarningTip_C_AddWarning::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AddWarningTip_C_AddWarning, K2Node_SwitchInteger_CmpSuccess) == 0x000011, "Member 'AddWarningTip_C_AddWarning::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AddWarningTip_C_AddWarning, CallFunc_CreateWidgetByCPP_ReturnValue_1) == 0x000018, "Member 'AddWarningTip_C_AddWarning::CallFunc_CreateWidgetByCPP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AddWarningTip_C_AddWarning, K2Node_DynamicCast_AsUw_Fight_Danger_Warning) == 0x000020, "Member 'AddWarningTip_C_AddWarning::K2Node_DynamicCast_AsUw_Fight_Danger_Warning' has a wrong offset!");
static_assert(offsetof(AddWarningTip_C_AddWarning, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'AddWarningTip_C_AddWarning::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function AddWarningTip.AddWarningTip_C.OnTrigger
// 0x0010 (0x0010 - 0x0000)
struct AddWarningTip_C_OnTrigger final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AddWarningTip_C_OnTrigger) == 0x000008, "Wrong alignment on AddWarningTip_C_OnTrigger");
static_assert(sizeof(AddWarningTip_C_OnTrigger) == 0x000010, "Wrong size on AddWarningTip_C_OnTrigger");
static_assert(offsetof(AddWarningTip_C_OnTrigger, ReturnValue) == 0x000000, "Member 'AddWarningTip_C_OnTrigger::ReturnValue' has a wrong offset!");
static_assert(offsetof(AddWarningTip_C_OnTrigger, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000001, "Member 'AddWarningTip_C_OnTrigger::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddWarningTip_C_OnTrigger, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'AddWarningTip_C_OnTrigger::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function AddWarningTip.AddWarningTip_C.GetSpecialStaticDescription
// 0x0060 (0x0060 - 0x0000)
struct AddWarningTip_C_GetSpecialStaticDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AddWarningTip_C_GetSpecialStaticDescription) == 0x000008, "Wrong alignment on AddWarningTip_C_GetSpecialStaticDescription");
static_assert(sizeof(AddWarningTip_C_GetSpecialStaticDescription) == 0x000060, "Wrong size on AddWarningTip_C_GetSpecialStaticDescription");
static_assert(offsetof(AddWarningTip_C_GetSpecialStaticDescription, ReturnValue) == 0x000000, "Member 'AddWarningTip_C_GetSpecialStaticDescription::ReturnValue' has a wrong offset!");
static_assert(offsetof(AddWarningTip_C_GetSpecialStaticDescription, CallFunc_Conv_FloatToString_ReturnValue) == 0x000010, "Member 'AddWarningTip_C_GetSpecialStaticDescription::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddWarningTip_C_GetSpecialStaticDescription, CallFunc_Conv_IntToString_ReturnValue) == 0x000020, "Member 'AddWarningTip_C_GetSpecialStaticDescription::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddWarningTip_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'AddWarningTip_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddWarningTip_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000040, "Member 'AddWarningTip_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AddWarningTip_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000050, "Member 'AddWarningTip_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");

}

