#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AICondition_CanRequestSkillToken

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function AICondition_CanRequestSkillToken.AICondition_CanRequestSkillToken_C.CheckSkillToken
// 0x0020 (0x0020 - 0x0000)
struct AICondition_CanRequestSkillToken_C_CheckSkillToken final
{
public:
	class AGameAICharacter*                       AIChar;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillRangeType                               SkillType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIDirectorSystem*                      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanRequestSkillToken_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AICondition_CanRequestSkillToken_C_CheckSkillToken) == 0x000008, "Wrong alignment on AICondition_CanRequestSkillToken_C_CheckSkillToken");
static_assert(sizeof(AICondition_CanRequestSkillToken_C_CheckSkillToken) == 0x000020, "Wrong size on AICondition_CanRequestSkillToken_C_CheckSkillToken");
static_assert(offsetof(AICondition_CanRequestSkillToken_C_CheckSkillToken, AIChar) == 0x000000, "Member 'AICondition_CanRequestSkillToken_C_CheckSkillToken::AIChar' has a wrong offset!");
static_assert(offsetof(AICondition_CanRequestSkillToken_C_CheckSkillToken, SkillType) == 0x000008, "Member 'AICondition_CanRequestSkillToken_C_CheckSkillToken::SkillType' has a wrong offset!");
static_assert(offsetof(AICondition_CanRequestSkillToken_C_CheckSkillToken, ReturnValue) == 0x000009, "Member 'AICondition_CanRequestSkillToken_C_CheckSkillToken::ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_CanRequestSkillToken_C_CheckSkillToken, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000010, "Member 'AICondition_CanRequestSkillToken_C_CheckSkillToken::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_CanRequestSkillToken_C_CheckSkillToken, CallFunc_CanRequestSkillToken_ReturnValue) == 0x000018, "Member 'AICondition_CanRequestSkillToken_C_CheckSkillToken::CallFunc_CanRequestSkillToken_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_CanRequestSkillToken_C_CheckSkillToken, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'AICondition_CanRequestSkillToken_C_CheckSkillToken::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AICondition_CanRequestSkillToken.AICondition_CanRequestSkillToken_C.PerformanceCheck
// 0x0030 (0x0030 - 0x0000)
struct AICondition_CanRequestSkillToken_C_PerformanceCheck final
{
public:
	const class AGameCharacter*                   Who;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAICharacter*                       AIChar;                                            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAICharacter*                       K2Node_DynamicCast_AsGame_AICharacter;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckSkillToken_ReturnValue;              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckSkillToken_ReturnValue_1;            // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckSkillToken_ReturnValue_2;            // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckSkillToken_ReturnValue_3;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AICondition_CanRequestSkillToken_C_PerformanceCheck) == 0x000008, "Wrong alignment on AICondition_CanRequestSkillToken_C_PerformanceCheck");
static_assert(sizeof(AICondition_CanRequestSkillToken_C_PerformanceCheck) == 0x000030, "Wrong size on AICondition_CanRequestSkillToken_C_PerformanceCheck");
static_assert(offsetof(AICondition_CanRequestSkillToken_C_PerformanceCheck, Who) == 0x000000, "Member 'AICondition_CanRequestSkillToken_C_PerformanceCheck::Who' has a wrong offset!");
static_assert(offsetof(AICondition_CanRequestSkillToken_C_PerformanceCheck, ReturnValue) == 0x000008, "Member 'AICondition_CanRequestSkillToken_C_PerformanceCheck::ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_CanRequestSkillToken_C_PerformanceCheck, AIChar) == 0x000010, "Member 'AICondition_CanRequestSkillToken_C_PerformanceCheck::AIChar' has a wrong offset!");
static_assert(offsetof(AICondition_CanRequestSkillToken_C_PerformanceCheck, Result) == 0x000018, "Member 'AICondition_CanRequestSkillToken_C_PerformanceCheck::Result' has a wrong offset!");
static_assert(offsetof(AICondition_CanRequestSkillToken_C_PerformanceCheck, K2Node_DynamicCast_AsGame_AICharacter) == 0x000020, "Member 'AICondition_CanRequestSkillToken_C_PerformanceCheck::K2Node_DynamicCast_AsGame_AICharacter' has a wrong offset!");
static_assert(offsetof(AICondition_CanRequestSkillToken_C_PerformanceCheck, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AICondition_CanRequestSkillToken_C_PerformanceCheck::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AICondition_CanRequestSkillToken_C_PerformanceCheck, CallFunc_CheckSkillToken_ReturnValue) == 0x000029, "Member 'AICondition_CanRequestSkillToken_C_PerformanceCheck::CallFunc_CheckSkillToken_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_CanRequestSkillToken_C_PerformanceCheck, CallFunc_CheckSkillToken_ReturnValue_1) == 0x00002A, "Member 'AICondition_CanRequestSkillToken_C_PerformanceCheck::CallFunc_CheckSkillToken_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AICondition_CanRequestSkillToken_C_PerformanceCheck, CallFunc_CheckSkillToken_ReturnValue_2) == 0x00002B, "Member 'AICondition_CanRequestSkillToken_C_PerformanceCheck::CallFunc_CheckSkillToken_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AICondition_CanRequestSkillToken_C_PerformanceCheck, CallFunc_CheckSkillToken_ReturnValue_3) == 0x00002C, "Member 'AICondition_CanRequestSkillToken_C_PerformanceCheck::CallFunc_CheckSkillToken_ReturnValue_3' has a wrong offset!");

}

