#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AICondition_InState

#include "Basic.hpp"


namespace SDK::Params
{

// Function AICondition_InState.AICondition_InState_C.PerformanceCheck
// 0x0078 (0x0078 - 0x0000)
struct AICondition_InState_C_PerformanceCheck final
{
public:
	const class AGameCharacter*                   Who;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAIController*                      K2Node_DynamicCast_AsGame_AIController;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGameCharacter*>                 CallFunc_GetAllMembersPtr_ReturnValue;             // 0x0030(0x0010)(ReferenceParm)
	class AGameCharacter*                         CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameAIController*                      K2Node_DynamicCast_AsGame_AIController_1;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsState_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsState_ReturnValue_1;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AICondition_InState_C_PerformanceCheck) == 0x000008, "Wrong alignment on AICondition_InState_C_PerformanceCheck");
static_assert(sizeof(AICondition_InState_C_PerformanceCheck) == 0x000078, "Wrong size on AICondition_InState_C_PerformanceCheck");
static_assert(offsetof(AICondition_InState_C_PerformanceCheck, Who) == 0x000000, "Member 'AICondition_InState_C_PerformanceCheck::Who' has a wrong offset!");
static_assert(offsetof(AICondition_InState_C_PerformanceCheck, ReturnValue) == 0x000008, "Member 'AICondition_InState_C_PerformanceCheck::ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_InState_C_PerformanceCheck, ___int_Array_Index_Variable) == 0x00000C, "Member 'AICondition_InState_C_PerformanceCheck::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AICondition_InState_C_PerformanceCheck, CallFunc_GetController_ReturnValue) == 0x000010, "Member 'AICondition_InState_C_PerformanceCheck::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_InState_C_PerformanceCheck, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'AICondition_InState_C_PerformanceCheck::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_InState_C_PerformanceCheck, K2Node_DynamicCast_AsGame_AIController) == 0x000020, "Member 'AICondition_InState_C_PerformanceCheck::K2Node_DynamicCast_AsGame_AIController' has a wrong offset!");
static_assert(offsetof(AICondition_InState_C_PerformanceCheck, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AICondition_InState_C_PerformanceCheck::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AICondition_InState_C_PerformanceCheck, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'AICondition_InState_C_PerformanceCheck::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AICondition_InState_C_PerformanceCheck, CallFunc_IsValid_ReturnValue_2) == 0x00002A, "Member 'AICondition_InState_C_PerformanceCheck::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AICondition_InState_C_PerformanceCheck, CallFunc_IsValid_ReturnValue_3) == 0x00002B, "Member 'AICondition_InState_C_PerformanceCheck::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AICondition_InState_C_PerformanceCheck, CallFunc_GetAllMembersPtr_ReturnValue) == 0x000030, "Member 'AICondition_InState_C_PerformanceCheck::CallFunc_GetAllMembersPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_InState_C_PerformanceCheck, CallFunc_Array_Get_Item) == 0x000040, "Member 'AICondition_InState_C_PerformanceCheck::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AICondition_InState_C_PerformanceCheck, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'AICondition_InState_C_PerformanceCheck::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_InState_C_PerformanceCheck, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00004C, "Member 'AICondition_InState_C_PerformanceCheck::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_InState_C_PerformanceCheck, CallFunc_GetController_ReturnValue_1) == 0x000050, "Member 'AICondition_InState_C_PerformanceCheck::CallFunc_GetController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AICondition_InState_C_PerformanceCheck, K2Node_DynamicCast_AsGame_AIController_1) == 0x000058, "Member 'AICondition_InState_C_PerformanceCheck::K2Node_DynamicCast_AsGame_AIController_1' has a wrong offset!");
static_assert(offsetof(AICondition_InState_C_PerformanceCheck, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'AICondition_InState_C_PerformanceCheck::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AICondition_InState_C_PerformanceCheck, ___int_Loop_Counter_Variable) == 0x000064, "Member 'AICondition_InState_C_PerformanceCheck::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AICondition_InState_C_PerformanceCheck, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'AICondition_InState_C_PerformanceCheck::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_InState_C_PerformanceCheck, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'AICondition_InState_C_PerformanceCheck::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_InState_C_PerformanceCheck, CallFunc_IsState_ReturnValue) == 0x000070, "Member 'AICondition_InState_C_PerformanceCheck::CallFunc_IsState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_InState_C_PerformanceCheck, CallFunc_IsState_ReturnValue_1) == 0x000071, "Member 'AICondition_InState_C_PerformanceCheck::CallFunc_IsState_ReturnValue_1' has a wrong offset!");

}

