#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AICondition_IsInTheFrontAreaOfTargetController

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AICondition_IsInTheFrontAreaOfTargetController.AICondition_IsInTheFrontAreaOfTargetController_C
// 0x0010 (0x0038 - 0x0028)
class UAICondition_IsInTheFrontAreaOfTargetController_C final : public UAICondition_BlueprintLogic
{
public:
	float                                         MinAngle;                                          // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxAngle;                                          // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BothSide;                                          // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	bool PerformanceCheck(const class AGameCharacter* Who);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AICondition_IsInTheFrontAreaOfTargetController_C">();
	}
	static class UAICondition_IsInTheFrontAreaOfTargetController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAICondition_IsInTheFrontAreaOfTargetController_C>();
	}
};
static_assert(alignof(UAICondition_IsInTheFrontAreaOfTargetController_C) == 0x000008, "Wrong alignment on UAICondition_IsInTheFrontAreaOfTargetController_C");
static_assert(sizeof(UAICondition_IsInTheFrontAreaOfTargetController_C) == 0x000038, "Wrong size on UAICondition_IsInTheFrontAreaOfTargetController_C");
static_assert(offsetof(UAICondition_IsInTheFrontAreaOfTargetController_C, MinAngle) == 0x000028, "Member 'UAICondition_IsInTheFrontAreaOfTargetController_C::MinAngle' has a wrong offset!");
static_assert(offsetof(UAICondition_IsInTheFrontAreaOfTargetController_C, MaxAngle) == 0x00002C, "Member 'UAICondition_IsInTheFrontAreaOfTargetController_C::MaxAngle' has a wrong offset!");
static_assert(offsetof(UAICondition_IsInTheFrontAreaOfTargetController_C, BothSide) == 0x000030, "Member 'UAICondition_IsInTheFrontAreaOfTargetController_C::BothSide' has a wrong offset!");

}

