#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AICondition_IsSelfImmortal

#include "Basic.hpp"


namespace SDK::Params
{

// Function AICondition_IsSelfImmortal.AICondition_IsSelfImmortal_C.PerformanceCheck
// 0x0020 (0x0020 - 0x0000)
struct AICondition_IsSelfImmortal_C_PerformanceCheck final
{
public:
	const class AGameCharacter*                   Who;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAICharacter*                       K2Node_DynamicCast_AsGame_AICharacter;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsImmortal_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AICondition_IsSelfImmortal_C_PerformanceCheck) == 0x000008, "Wrong alignment on AICondition_IsSelfImmortal_C_PerformanceCheck");
static_assert(sizeof(AICondition_IsSelfImmortal_C_PerformanceCheck) == 0x000020, "Wrong size on AICondition_IsSelfImmortal_C_PerformanceCheck");
static_assert(offsetof(AICondition_IsSelfImmortal_C_PerformanceCheck, Who) == 0x000000, "Member 'AICondition_IsSelfImmortal_C_PerformanceCheck::Who' has a wrong offset!");
static_assert(offsetof(AICondition_IsSelfImmortal_C_PerformanceCheck, ReturnValue) == 0x000008, "Member 'AICondition_IsSelfImmortal_C_PerformanceCheck::ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_IsSelfImmortal_C_PerformanceCheck, K2Node_DynamicCast_AsGame_AICharacter) == 0x000010, "Member 'AICondition_IsSelfImmortal_C_PerformanceCheck::K2Node_DynamicCast_AsGame_AICharacter' has a wrong offset!");
static_assert(offsetof(AICondition_IsSelfImmortal_C_PerformanceCheck, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AICondition_IsSelfImmortal_C_PerformanceCheck::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AICondition_IsSelfImmortal_C_PerformanceCheck, CallFunc_IsImmortal_ReturnValue) == 0x000019, "Member 'AICondition_IsSelfImmortal_C_PerformanceCheck::CallFunc_IsImmortal_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_IsSelfImmortal_C_PerformanceCheck, CallFunc_IsValid_ReturnValue) == 0x00001A, "Member 'AICondition_IsSelfImmortal_C_PerformanceCheck::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

