#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AICondition_IsTargetAttacking

#include "Basic.hpp"


namespace SDK::Params
{

// Function AICondition_IsTargetAttacking.AICondition_IsTargetAttacking_C.PerformanceCheck
// 0x0048 (0x0048 - 0x0000)
struct AICondition_IsTargetAttacking_C_PerformanceCheck final
{
public:
	const class AGameCharacter*                   Who;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetCaptain_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetTargetActor_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameAICharacter*                       K2Node_DynamicCast_AsGame_AICharacter;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetTargetActor_ReturnValue_1;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AICondition_IsTargetAttacking_C_PerformanceCheck) == 0x000008, "Wrong alignment on AICondition_IsTargetAttacking_C_PerformanceCheck");
static_assert(sizeof(AICondition_IsTargetAttacking_C_PerformanceCheck) == 0x000048, "Wrong size on AICondition_IsTargetAttacking_C_PerformanceCheck");
static_assert(offsetof(AICondition_IsTargetAttacking_C_PerformanceCheck, Who) == 0x000000, "Member 'AICondition_IsTargetAttacking_C_PerformanceCheck::Who' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetAttacking_C_PerformanceCheck, ReturnValue) == 0x000008, "Member 'AICondition_IsTargetAttacking_C_PerformanceCheck::ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetAttacking_C_PerformanceCheck, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'AICondition_IsTargetAttacking_C_PerformanceCheck::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetAttacking_C_PerformanceCheck, CallFunc_IsValid_ReturnValue_1) == 0x00000A, "Member 'AICondition_IsTargetAttacking_C_PerformanceCheck::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetAttacking_C_PerformanceCheck, CallFunc_IsValid_ReturnValue_2) == 0x00000B, "Member 'AICondition_IsTargetAttacking_C_PerformanceCheck::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetAttacking_C_PerformanceCheck, CallFunc_GetCaptain_ReturnValue) == 0x000010, "Member 'AICondition_IsTargetAttacking_C_PerformanceCheck::CallFunc_GetCaptain_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetAttacking_C_PerformanceCheck, CallFunc_IsValid_ReturnValue_3) == 0x000018, "Member 'AICondition_IsTargetAttacking_C_PerformanceCheck::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetAttacking_C_PerformanceCheck, CallFunc_GetTargetActor_ReturnValue) == 0x000020, "Member 'AICondition_IsTargetAttacking_C_PerformanceCheck::CallFunc_GetTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetAttacking_C_PerformanceCheck, K2Node_DynamicCast_AsGame_AICharacter) == 0x000028, "Member 'AICondition_IsTargetAttacking_C_PerformanceCheck::K2Node_DynamicCast_AsGame_AICharacter' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetAttacking_C_PerformanceCheck, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AICondition_IsTargetAttacking_C_PerformanceCheck::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetAttacking_C_PerformanceCheck, CallFunc_IsValid_ReturnValue_4) == 0x000031, "Member 'AICondition_IsTargetAttacking_C_PerformanceCheck::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetAttacking_C_PerformanceCheck, CallFunc_GetTargetActor_ReturnValue_1) == 0x000038, "Member 'AICondition_IsTargetAttacking_C_PerformanceCheck::CallFunc_GetTargetActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetAttacking_C_PerformanceCheck, CallFunc_IsValid_ReturnValue_5) == 0x000040, "Member 'AICondition_IsTargetAttacking_C_PerformanceCheck::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetAttacking_C_PerformanceCheck, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000041, "Member 'AICondition_IsTargetAttacking_C_PerformanceCheck::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

