#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AICondition_SelfToTargetDistance

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AICondition_SelfToTargetDistance.AICondition_SelfToTargetDistance_C.PerformanceCheck
// 0x0048 (0x0048 - 0x0000)
struct AICondition_SelfToTargetDistance_C_PerformanceCheck final
{
public:
	const class AGameCharacter*                   Who;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetTargetActor_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetCaptain_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AICondition_SelfToTargetDistance_C_PerformanceCheck) == 0x000008, "Wrong alignment on AICondition_SelfToTargetDistance_C_PerformanceCheck");
static_assert(sizeof(AICondition_SelfToTargetDistance_C_PerformanceCheck) == 0x000048, "Wrong size on AICondition_SelfToTargetDistance_C_PerformanceCheck");
static_assert(offsetof(AICondition_SelfToTargetDistance_C_PerformanceCheck, Who) == 0x000000, "Member 'AICondition_SelfToTargetDistance_C_PerformanceCheck::Who' has a wrong offset!");
static_assert(offsetof(AICondition_SelfToTargetDistance_C_PerformanceCheck, ReturnValue) == 0x000008, "Member 'AICondition_SelfToTargetDistance_C_PerformanceCheck::ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_SelfToTargetDistance_C_PerformanceCheck, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00000C, "Member 'AICondition_SelfToTargetDistance_C_PerformanceCheck::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_SelfToTargetDistance_C_PerformanceCheck, CallFunc_GetTargetActor_ReturnValue) == 0x000018, "Member 'AICondition_SelfToTargetDistance_C_PerformanceCheck::CallFunc_GetTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_SelfToTargetDistance_C_PerformanceCheck, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'AICondition_SelfToTargetDistance_C_PerformanceCheck::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_SelfToTargetDistance_C_PerformanceCheck, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'AICondition_SelfToTargetDistance_C_PerformanceCheck::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AICondition_SelfToTargetDistance_C_PerformanceCheck, CallFunc_GetCaptain_ReturnValue) == 0x000028, "Member 'AICondition_SelfToTargetDistance_C_PerformanceCheck::CallFunc_GetCaptain_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_SelfToTargetDistance_C_PerformanceCheck, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000030, "Member 'AICondition_SelfToTargetDistance_C_PerformanceCheck::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AICondition_SelfToTargetDistance_C_PerformanceCheck, CallFunc_IsValid_ReturnValue_2) == 0x00003C, "Member 'AICondition_SelfToTargetDistance_C_PerformanceCheck::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AICondition_SelfToTargetDistance_C_PerformanceCheck, CallFunc_Vector_Distance_ReturnValue) == 0x000040, "Member 'AICondition_SelfToTargetDistance_C_PerformanceCheck::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_SelfToTargetDistance_C_PerformanceCheck, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000044, "Member 'AICondition_SelfToTargetDistance_C_PerformanceCheck::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

