#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AICondition_HasTarget

#include "Basic.hpp"


namespace SDK::Params
{

// Function AICondition_HasTarget.AICondition_HasTarget_C.PerformanceCheck
// 0x0020 (0x0020 - 0x0000)
struct AICondition_HasTarget_C_PerformanceCheck final
{
public:
	const class AGameCharacter*                   Who;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetTargetActor_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AICondition_HasTarget_C_PerformanceCheck) == 0x000008, "Wrong alignment on AICondition_HasTarget_C_PerformanceCheck");
static_assert(sizeof(AICondition_HasTarget_C_PerformanceCheck) == 0x000020, "Wrong size on AICondition_HasTarget_C_PerformanceCheck");
static_assert(offsetof(AICondition_HasTarget_C_PerformanceCheck, Who) == 0x000000, "Member 'AICondition_HasTarget_C_PerformanceCheck::Who' has a wrong offset!");
static_assert(offsetof(AICondition_HasTarget_C_PerformanceCheck, ReturnValue) == 0x000008, "Member 'AICondition_HasTarget_C_PerformanceCheck::ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_HasTarget_C_PerformanceCheck, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'AICondition_HasTarget_C_PerformanceCheck::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_HasTarget_C_PerformanceCheck, CallFunc_IsValid_ReturnValue_1) == 0x00000A, "Member 'AICondition_HasTarget_C_PerformanceCheck::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AICondition_HasTarget_C_PerformanceCheck, CallFunc_GetTargetActor_ReturnValue) == 0x000010, "Member 'AICondition_HasTarget_C_PerformanceCheck::CallFunc_GetTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_HasTarget_C_PerformanceCheck, CallFunc_IsValid_ReturnValue_2) == 0x000018, "Member 'AICondition_HasTarget_C_PerformanceCheck::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

}

