#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AICondition_CapsuleTraceObjectBySpecialPoint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AICondition_CapsuleTraceObjectBySpecialPoint.AICondition_CapsuleTraceObjectBySpecialPoint_C.PerformanceCheck
// 0x01D0 (0x01D0 - 0x0000)
struct AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck final
{
public:
	const class AGameCharacter*                   Who;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         IgnoreActorsArray;                                 // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACharacterAccessory*>            CallFunc_GetCharacterAccessories_OutCharacterAccessories; // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetTargetActor_ReturnValue;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AOnlineReSpawn_C*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0070(0x0010)(ReferenceParm)
	TArray<class ABlockingVolume*>                CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0080(0x0010)(ReferenceParm)
	TArray<class ASnowEffectExceptControlVolume*> CallFunc_GetAllActorsOfClass_OutActors_2;          // 0x0090(0x0010)(ReferenceParm)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array_1;                          // 0x00A0(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_CapsuleTraceSingleForObjects_OutHit;      // 0x00BC(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_CapsuleTraceSingleForObjects_ReturnValue; // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B[0x1];                                      // 0x014B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance2D_ReturnValue;            // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck) == 0x000008, "Wrong alignment on AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck");
static_assert(sizeof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck) == 0x0001D0, "Wrong size on AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, Who) == 0x000000, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::Who' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, ReturnValue) == 0x000008, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, IgnoreActorsArray) == 0x000010, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::IgnoreActorsArray' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_GetCharacterAccessories_OutCharacterAccessories) == 0x000028, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_GetCharacterAccessories_OutCharacterAccessories' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, K2Node_MakeArray_Array) == 0x000040, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_Greater_IntInt_ReturnValue) == 0x000050, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_IsValid_ReturnValue_1) == 0x000051, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_GetTargetActor_ReturnValue) == 0x000058, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_GetTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_IsValid_ReturnValue_2) == 0x000060, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000064, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_GetAllActorsOfClass_OutActors) == 0x000070, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000080, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_GetAllActorsOfClass_OutActors_2) == 0x000090, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_GetAllActorsOfClass_OutActors_2' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, K2Node_MakeArray_Array_1) == 0x0000A0, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_GetSocketLocation_ReturnValue) == 0x0000B0, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_CapsuleTraceSingleForObjects_OutHit) == 0x0000BC, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_CapsuleTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_CapsuleTraceSingleForObjects_ReturnValue) == 0x000148, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_CapsuleTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_BreakHitResult_bBlockingHit) == 0x000149, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_BreakHitResult_bInitialOverlap) == 0x00014A, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_BreakHitResult_Time) == 0x00014C, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_BreakHitResult_Distance) == 0x000150, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_BreakHitResult_Location) == 0x000154, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_BreakHitResult_ImpactPoint) == 0x000160, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_BreakHitResult_Normal) == 0x00016C, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_BreakHitResult_ImpactNormal) == 0x000178, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_BreakHitResult_PhysMat) == 0x000188, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_BreakHitResult_HitActor) == 0x000190, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_BreakHitResult_HitComponent) == 0x000198, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_BreakHitResult_HitBoneName) == 0x0001A0, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_BreakHitResult_HitItem) == 0x0001A8, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_BreakHitResult_FaceIndex) == 0x0001AC, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_BreakHitResult_TraceStart) == 0x0001B0, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_BreakHitResult_TraceEnd) == 0x0001BC, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_Vector_Distance2D_ReturnValue) == 0x0001C8, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_Vector_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001CC, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0001CD, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck, CallFunc_BooleanOR_ReturnValue) == 0x0001CE, "Member 'AICondition_CapsuleTraceObjectBySpecialPoint_C_PerformanceCheck::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

