#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AICondition_Gril002Prop02TeamMateHasCastSkill01

#include "Basic.hpp"


namespace SDK::Params
{

// Function AICondition_Gril002Prop02TeamMateHasCastSkill01.AICondition_Gril002Prop02TeamMateHasCastSkill01_C.PerformanceCheck
// 0x0070 (0x0070 - 0x0000)
struct AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck final
{
public:
	const class AGameCharacter*                   Who;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGameCharacter*>                 CallFunc_GetAllMembersPtr_ReturnValue;             // 0x0018(0x0010)(ReferenceParm)
	class AGameCharacter*                         CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameAIController*                      K2Node_DynamicCast_AsGame_AIController;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIEvent*                               CallFunc_GetCurrentEvent_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIEvent_Girl002_prop01_Skill1MoveToTarget_C* K2Node_DynamicCast_AsAIEvent_Girl_002_Prop_01_Skill_1Move_to_Target; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck) == 0x000008, "Wrong alignment on AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck");
static_assert(sizeof(AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck) == 0x000070, "Wrong size on AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck");
static_assert(offsetof(AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck, Who) == 0x000000, "Member 'AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck::Who' has a wrong offset!");
static_assert(offsetof(AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck, ReturnValue) == 0x000008, "Member 'AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck::ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck, ___int_Array_Index_Variable) == 0x00000C, "Member 'AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck, CallFunc_GetAllMembersPtr_ReturnValue) == 0x000018, "Member 'AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck::CallFunc_GetAllMembersPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck, CallFunc_Array_Get_Item) == 0x000028, "Member 'AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck, CallFunc_GetController_ReturnValue) == 0x000038, "Member 'AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck, K2Node_DynamicCast_AsGame_AIController) == 0x000040, "Member 'AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck::K2Node_DynamicCast_AsGame_AIController' has a wrong offset!");
static_assert(offsetof(AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck, CallFunc_GetCurrentEvent_ReturnValue) == 0x000050, "Member 'AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck::CallFunc_GetCurrentEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck, ___int_Loop_Counter_Variable) == 0x000058, "Member 'AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck, K2Node_DynamicCast_AsAIEvent_Girl_002_Prop_01_Skill_1Move_to_Target) == 0x000060, "Member 'AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck::K2Node_DynamicCast_AsAIEvent_Girl_002_Prop_01_Skill_1Move_to_Target' has a wrong offset!");
static_assert(offsetof(AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck, CallFunc_Less_IntInt_ReturnValue) == 0x000069, "Member 'AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'AICondition_Gril002Prop02TeamMateHasCastSkill01_C_PerformanceCheck::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

