#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AICondition_StateKeepTime

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AICondition_StateKeepTime.AICondition_StateKeepTime_C
// 0x0010 (0x0038 - 0x0028)
class UAICondition_StateKeepTime_C final : public UAICondition_BlueprintLogic
{
public:
	EOperationType                                Operation;                                         // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Time;                                              // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IgnorePause;                                       // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	bool PerformanceCheck(const class AGameCharacter* Who);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AICondition_StateKeepTime_C">();
	}
	static class UAICondition_StateKeepTime_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAICondition_StateKeepTime_C>();
	}
};
static_assert(alignof(UAICondition_StateKeepTime_C) == 0x000008, "Wrong alignment on UAICondition_StateKeepTime_C");
static_assert(sizeof(UAICondition_StateKeepTime_C) == 0x000038, "Wrong size on UAICondition_StateKeepTime_C");
static_assert(offsetof(UAICondition_StateKeepTime_C, Operation) == 0x000028, "Member 'UAICondition_StateKeepTime_C::Operation' has a wrong offset!");
static_assert(offsetof(UAICondition_StateKeepTime_C, Time) == 0x00002C, "Member 'UAICondition_StateKeepTime_C::Time' has a wrong offset!");
static_assert(offsetof(UAICondition_StateKeepTime_C, IgnorePause) == 0x000030, "Member 'UAICondition_StateKeepTime_C::IgnorePause' has a wrong offset!");

}

