#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AICondition_CanRequestSkillToken

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AICondition_CanRequestSkillToken.AICondition_CanRequestSkillToken_C
// 0x0008 (0x0030 - 0x0028)
class UAICondition_CanRequestSkillToken_C final : public UAICondition_BlueprintLogic
{
public:
	bool                                          Melee;                                             // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          MidRange;                                          // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Range;                                             // 0x002A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Special;                                           // 0x002B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	bool CheckSkillToken(class AGameAICharacter* AIChar, ESkillRangeType SkillType);
	bool PerformanceCheck(const class AGameCharacter* Who);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AICondition_CanRequestSkillToken_C">();
	}
	static class UAICondition_CanRequestSkillToken_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAICondition_CanRequestSkillToken_C>();
	}
};
static_assert(alignof(UAICondition_CanRequestSkillToken_C) == 0x000008, "Wrong alignment on UAICondition_CanRequestSkillToken_C");
static_assert(sizeof(UAICondition_CanRequestSkillToken_C) == 0x000030, "Wrong size on UAICondition_CanRequestSkillToken_C");
static_assert(offsetof(UAICondition_CanRequestSkillToken_C, Melee) == 0x000028, "Member 'UAICondition_CanRequestSkillToken_C::Melee' has a wrong offset!");
static_assert(offsetof(UAICondition_CanRequestSkillToken_C, MidRange) == 0x000029, "Member 'UAICondition_CanRequestSkillToken_C::MidRange' has a wrong offset!");
static_assert(offsetof(UAICondition_CanRequestSkillToken_C, Range) == 0x00002A, "Member 'UAICondition_CanRequestSkillToken_C::Range' has a wrong offset!");
static_assert(offsetof(UAICondition_CanRequestSkillToken_C, Special) == 0x00002B, "Member 'UAICondition_CanRequestSkillToken_C::Special' has a wrong offset!");

}

