#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AICondition_GeTeamCaptaintIsModiferExist

#include "Basic.hpp"


namespace SDK::Params
{

// Function AICondition_GeTeamCaptaintIsModiferExist.AICondition_GeTeamCaptaintIsModiferExist_C.PerformanceCheck
// 0x0040 (0x0040 - 0x0000)
struct AICondition_GeTeamCaptaintIsModiferExist_C_PerformanceCheck final
{
public:
	const class AGameCharacter*                   Who;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetCaptain_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAbilityCharacterInterface> CallFunc_GetAbilityComponent_self_CastInput;       // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilityComponentBase*                  CallFunc_GetAbilityComponent_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsModifierExist_ReturnValue;              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AICondition_GeTeamCaptaintIsModiferExist_C_PerformanceCheck) == 0x000008, "Wrong alignment on AICondition_GeTeamCaptaintIsModiferExist_C_PerformanceCheck");
static_assert(sizeof(AICondition_GeTeamCaptaintIsModiferExist_C_PerformanceCheck) == 0x000040, "Wrong size on AICondition_GeTeamCaptaintIsModiferExist_C_PerformanceCheck");
static_assert(offsetof(AICondition_GeTeamCaptaintIsModiferExist_C_PerformanceCheck, Who) == 0x000000, "Member 'AICondition_GeTeamCaptaintIsModiferExist_C_PerformanceCheck::Who' has a wrong offset!");
static_assert(offsetof(AICondition_GeTeamCaptaintIsModiferExist_C_PerformanceCheck, ReturnValue) == 0x000008, "Member 'AICondition_GeTeamCaptaintIsModiferExist_C_PerformanceCheck::ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_GeTeamCaptaintIsModiferExist_C_PerformanceCheck, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'AICondition_GeTeamCaptaintIsModiferExist_C_PerformanceCheck::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_GeTeamCaptaintIsModiferExist_C_PerformanceCheck, CallFunc_GetCaptain_ReturnValue) == 0x000010, "Member 'AICondition_GeTeamCaptaintIsModiferExist_C_PerformanceCheck::CallFunc_GetCaptain_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_GeTeamCaptaintIsModiferExist_C_PerformanceCheck, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'AICondition_GeTeamCaptaintIsModiferExist_C_PerformanceCheck::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AICondition_GeTeamCaptaintIsModiferExist_C_PerformanceCheck, CallFunc_GetAbilityComponent_self_CastInput) == 0x000020, "Member 'AICondition_GeTeamCaptaintIsModiferExist_C_PerformanceCheck::CallFunc_GetAbilityComponent_self_CastInput' has a wrong offset!");
static_assert(offsetof(AICondition_GeTeamCaptaintIsModiferExist_C_PerformanceCheck, CallFunc_GetAbilityComponent_ReturnValue) == 0x000030, "Member 'AICondition_GeTeamCaptaintIsModiferExist_C_PerformanceCheck::CallFunc_GetAbilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_GeTeamCaptaintIsModiferExist_C_PerformanceCheck, CallFunc_IsValid_ReturnValue_2) == 0x000038, "Member 'AICondition_GeTeamCaptaintIsModiferExist_C_PerformanceCheck::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AICondition_GeTeamCaptaintIsModiferExist_C_PerformanceCheck, CallFunc_IsModifierExist_ReturnValue) == 0x000039, "Member 'AICondition_GeTeamCaptaintIsModiferExist_C_PerformanceCheck::CallFunc_IsModifierExist_ReturnValue' has a wrong offset!");

}

