#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AICondition_CheckIsMobilePhone

#include "Basic.hpp"


namespace SDK::Params
{

// Function AICondition_CheckIsMobilePhone.AICondition_CheckIsMobilePhone_C.PerformanceCheck
// 0x0010 (0x0010 - 0x0000)
struct AICondition_CheckIsMobilePhone_C_PerformanceCheck final
{
public:
	const class AGameCharacter*                   Who;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEditorMobile_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AICondition_CheckIsMobilePhone_C_PerformanceCheck) == 0x000008, "Wrong alignment on AICondition_CheckIsMobilePhone_C_PerformanceCheck");
static_assert(sizeof(AICondition_CheckIsMobilePhone_C_PerformanceCheck) == 0x000010, "Wrong size on AICondition_CheckIsMobilePhone_C_PerformanceCheck");
static_assert(offsetof(AICondition_CheckIsMobilePhone_C_PerformanceCheck, Who) == 0x000000, "Member 'AICondition_CheckIsMobilePhone_C_PerformanceCheck::Who' has a wrong offset!");
static_assert(offsetof(AICondition_CheckIsMobilePhone_C_PerformanceCheck, ReturnValue) == 0x000008, "Member 'AICondition_CheckIsMobilePhone_C_PerformanceCheck::ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_CheckIsMobilePhone_C_PerformanceCheck, CallFunc_IsEditorMobile_ReturnValue) == 0x000009, "Member 'AICondition_CheckIsMobilePhone_C_PerformanceCheck::CallFunc_IsEditorMobile_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_CheckIsMobilePhone_C_PerformanceCheck, CallFunc_IsMobilePlatform_ReturnValue) == 0x00000A, "Member 'AICondition_CheckIsMobilePhone_C_PerformanceCheck::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_CheckIsMobilePhone_C_PerformanceCheck, CallFunc_BooleanOR_ReturnValue) == 0x00000B, "Member 'AICondition_CheckIsMobilePhone_C_PerformanceCheck::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

