#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AICondition_StateKeepTime

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function AICondition_StateKeepTime.AICondition_StateKeepTime_C.PerformanceCheck
// 0x0050 (0x0050 - 0x0000)
struct AICondition_StateKeepTime_C_PerformanceCheck final
{
public:
	const class AGameCharacter*                   Who;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TargetTime;                                        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOperationType                                ___byte_Variable;                                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAIController*                      K2Node_DynamicCast_AsGame_AIController;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetStateKeepTimeIgnorePause_ReturnValue;  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStateKeepTime_ReturnValue;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOperationType                                ___byte_Variable_1;                                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue_1;        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_1;      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default_1;                           // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AICondition_StateKeepTime_C_PerformanceCheck) == 0x000008, "Wrong alignment on AICondition_StateKeepTime_C_PerformanceCheck");
static_assert(sizeof(AICondition_StateKeepTime_C_PerformanceCheck) == 0x000050, "Wrong size on AICondition_StateKeepTime_C_PerformanceCheck");
static_assert(offsetof(AICondition_StateKeepTime_C_PerformanceCheck, Who) == 0x000000, "Member 'AICondition_StateKeepTime_C_PerformanceCheck::Who' has a wrong offset!");
static_assert(offsetof(AICondition_StateKeepTime_C_PerformanceCheck, ReturnValue) == 0x000008, "Member 'AICondition_StateKeepTime_C_PerformanceCheck::ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_StateKeepTime_C_PerformanceCheck, TargetTime) == 0x00000C, "Member 'AICondition_StateKeepTime_C_PerformanceCheck::TargetTime' has a wrong offset!");
static_assert(offsetof(AICondition_StateKeepTime_C_PerformanceCheck, ___byte_Variable) == 0x000010, "Member 'AICondition_StateKeepTime_C_PerformanceCheck::___byte_Variable' has a wrong offset!");
static_assert(offsetof(AICondition_StateKeepTime_C_PerformanceCheck, CallFunc_GetController_ReturnValue) == 0x000018, "Member 'AICondition_StateKeepTime_C_PerformanceCheck::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_StateKeepTime_C_PerformanceCheck, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'AICondition_StateKeepTime_C_PerformanceCheck::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_StateKeepTime_C_PerformanceCheck, K2Node_DynamicCast_AsGame_AIController) == 0x000028, "Member 'AICondition_StateKeepTime_C_PerformanceCheck::K2Node_DynamicCast_AsGame_AIController' has a wrong offset!");
static_assert(offsetof(AICondition_StateKeepTime_C_PerformanceCheck, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AICondition_StateKeepTime_C_PerformanceCheck::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AICondition_StateKeepTime_C_PerformanceCheck, CallFunc_GetStateKeepTimeIgnorePause_ReturnValue) == 0x000034, "Member 'AICondition_StateKeepTime_C_PerformanceCheck::CallFunc_GetStateKeepTimeIgnorePause_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_StateKeepTime_C_PerformanceCheck, CallFunc_GetStateKeepTime_ReturnValue) == 0x000038, "Member 'AICondition_StateKeepTime_C_PerformanceCheck::CallFunc_GetStateKeepTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_StateKeepTime_C_PerformanceCheck, ___byte_Variable_1) == 0x00003C, "Member 'AICondition_StateKeepTime_C_PerformanceCheck::___byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AICondition_StateKeepTime_C_PerformanceCheck, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00003D, "Member 'AICondition_StateKeepTime_C_PerformanceCheck::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_StateKeepTime_C_PerformanceCheck, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00003E, "Member 'AICondition_StateKeepTime_C_PerformanceCheck::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_StateKeepTime_C_PerformanceCheck, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00003F, "Member 'AICondition_StateKeepTime_C_PerformanceCheck::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_StateKeepTime_C_PerformanceCheck, CallFunc_Less_FloatFloat_ReturnValue) == 0x000040, "Member 'AICondition_StateKeepTime_C_PerformanceCheck::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_StateKeepTime_C_PerformanceCheck, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000041, "Member 'AICondition_StateKeepTime_C_PerformanceCheck::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_StateKeepTime_C_PerformanceCheck, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000042, "Member 'AICondition_StateKeepTime_C_PerformanceCheck::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_StateKeepTime_C_PerformanceCheck, K2Node_Select_Default) == 0x000043, "Member 'AICondition_StateKeepTime_C_PerformanceCheck::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AICondition_StateKeepTime_C_PerformanceCheck, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x000044, "Member 'AICondition_StateKeepTime_C_PerformanceCheck::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AICondition_StateKeepTime_C_PerformanceCheck, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000045, "Member 'AICondition_StateKeepTime_C_PerformanceCheck::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AICondition_StateKeepTime_C_PerformanceCheck, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000046, "Member 'AICondition_StateKeepTime_C_PerformanceCheck::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AICondition_StateKeepTime_C_PerformanceCheck, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000047, "Member 'AICondition_StateKeepTime_C_PerformanceCheck::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AICondition_StateKeepTime_C_PerformanceCheck, CallFunc_NotEqual_FloatFloat_ReturnValue_1) == 0x000048, "Member 'AICondition_StateKeepTime_C_PerformanceCheck::CallFunc_NotEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AICondition_StateKeepTime_C_PerformanceCheck, CallFunc_EqualEqual_FloatFloat_ReturnValue_1) == 0x000049, "Member 'AICondition_StateKeepTime_C_PerformanceCheck::CallFunc_EqualEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AICondition_StateKeepTime_C_PerformanceCheck, K2Node_Select_Default_1) == 0x00004A, "Member 'AICondition_StateKeepTime_C_PerformanceCheck::K2Node_Select_Default_1' has a wrong offset!");

}

