#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AICondition_CapsuleTraceObjectBySpecialPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AICondition_CapsuleTraceObjectBySpecialPoint.AICondition_CapsuleTraceObjectBySpecialPoint_C
// 0x0018 (0x0040 - 0x0028)
class UAICondition_CapsuleTraceObjectBySpecialPoint_C final : public UAICondition_BlueprintLogic
{
public:
	EObjectTypeQuery                              ObjectType01;                                      // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EObjectTypeQuery                              ObjectType02;                                      // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EObjectTypeQuery                              ObjectType03;                                      // 0x002A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EObjectTypeQuery                              ObjectType04;                                      // 0x002B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EObjectTypeQuery                              ObjectType05;                                      // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   In_Socket_Name;                                    // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AcceptableRadius;                                  // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CapsuleRadius;                                     // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool PerformanceCheck(const class AGameCharacter* Who);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AICondition_CapsuleTraceObjectBySpecialPoint_C">();
	}
	static class UAICondition_CapsuleTraceObjectBySpecialPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAICondition_CapsuleTraceObjectBySpecialPoint_C>();
	}
};
static_assert(alignof(UAICondition_CapsuleTraceObjectBySpecialPoint_C) == 0x000008, "Wrong alignment on UAICondition_CapsuleTraceObjectBySpecialPoint_C");
static_assert(sizeof(UAICondition_CapsuleTraceObjectBySpecialPoint_C) == 0x000040, "Wrong size on UAICondition_CapsuleTraceObjectBySpecialPoint_C");
static_assert(offsetof(UAICondition_CapsuleTraceObjectBySpecialPoint_C, ObjectType01) == 0x000028, "Member 'UAICondition_CapsuleTraceObjectBySpecialPoint_C::ObjectType01' has a wrong offset!");
static_assert(offsetof(UAICondition_CapsuleTraceObjectBySpecialPoint_C, ObjectType02) == 0x000029, "Member 'UAICondition_CapsuleTraceObjectBySpecialPoint_C::ObjectType02' has a wrong offset!");
static_assert(offsetof(UAICondition_CapsuleTraceObjectBySpecialPoint_C, ObjectType03) == 0x00002A, "Member 'UAICondition_CapsuleTraceObjectBySpecialPoint_C::ObjectType03' has a wrong offset!");
static_assert(offsetof(UAICondition_CapsuleTraceObjectBySpecialPoint_C, ObjectType04) == 0x00002B, "Member 'UAICondition_CapsuleTraceObjectBySpecialPoint_C::ObjectType04' has a wrong offset!");
static_assert(offsetof(UAICondition_CapsuleTraceObjectBySpecialPoint_C, ObjectType05) == 0x00002C, "Member 'UAICondition_CapsuleTraceObjectBySpecialPoint_C::ObjectType05' has a wrong offset!");
static_assert(offsetof(UAICondition_CapsuleTraceObjectBySpecialPoint_C, In_Socket_Name) == 0x000030, "Member 'UAICondition_CapsuleTraceObjectBySpecialPoint_C::In_Socket_Name' has a wrong offset!");
static_assert(offsetof(UAICondition_CapsuleTraceObjectBySpecialPoint_C, AcceptableRadius) == 0x000038, "Member 'UAICondition_CapsuleTraceObjectBySpecialPoint_C::AcceptableRadius' has a wrong offset!");
static_assert(offsetof(UAICondition_CapsuleTraceObjectBySpecialPoint_C, CapsuleRadius) == 0x00003C, "Member 'UAICondition_CapsuleTraceObjectBySpecialPoint_C::CapsuleRadius' has a wrong offset!");

}

