#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AICondition_IsTargetFightPlayer

#include "Basic.hpp"


namespace SDK::Params
{

// Function AICondition_IsTargetFightPlayer.AICondition_IsTargetFightPlayer_C.PerformanceCheck
// 0x0090 (0x0090 - 0x0000)
struct AICondition_IsTargetFightPlayer_C_PerformanceCheck final
{
public:
	const class AGameCharacter*                   Who;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetTargetActor_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGameCharacter*>                 CallFunc_GetAllMembersPtr_ReturnValue;             // 0x0020(0x0010)(ReferenceParm)
	class ATrap*                                  K2Node_DynamicCast_AsTrap;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAICharacter*                       K2Node_DynamicCast_AsGame_AICharacter;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetTargetActor_ReturnValue_1;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrap*                                  K2Node_DynamicCast_AsTrap_1;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AICondition_IsTargetFightPlayer_C_PerformanceCheck) == 0x000008, "Wrong alignment on AICondition_IsTargetFightPlayer_C_PerformanceCheck");
static_assert(sizeof(AICondition_IsTargetFightPlayer_C_PerformanceCheck) == 0x000090, "Wrong size on AICondition_IsTargetFightPlayer_C_PerformanceCheck");
static_assert(offsetof(AICondition_IsTargetFightPlayer_C_PerformanceCheck, Who) == 0x000000, "Member 'AICondition_IsTargetFightPlayer_C_PerformanceCheck::Who' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetFightPlayer_C_PerformanceCheck, ReturnValue) == 0x000008, "Member 'AICondition_IsTargetFightPlayer_C_PerformanceCheck::ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetFightPlayer_C_PerformanceCheck, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'AICondition_IsTargetFightPlayer_C_PerformanceCheck::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetFightPlayer_C_PerformanceCheck, CallFunc_GetTargetActor_ReturnValue) == 0x000010, "Member 'AICondition_IsTargetFightPlayer_C_PerformanceCheck::CallFunc_GetTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetFightPlayer_C_PerformanceCheck, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'AICondition_IsTargetFightPlayer_C_PerformanceCheck::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetFightPlayer_C_PerformanceCheck, CallFunc_GetAllMembersPtr_ReturnValue) == 0x000020, "Member 'AICondition_IsTargetFightPlayer_C_PerformanceCheck::CallFunc_GetAllMembersPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetFightPlayer_C_PerformanceCheck, K2Node_DynamicCast_AsTrap) == 0x000030, "Member 'AICondition_IsTargetFightPlayer_C_PerformanceCheck::K2Node_DynamicCast_AsTrap' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetFightPlayer_C_PerformanceCheck, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'AICondition_IsTargetFightPlayer_C_PerformanceCheck::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetFightPlayer_C_PerformanceCheck, K2Node_DynamicCast_AsGame_AICharacter) == 0x000040, "Member 'AICondition_IsTargetFightPlayer_C_PerformanceCheck::K2Node_DynamicCast_AsGame_AICharacter' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetFightPlayer_C_PerformanceCheck, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'AICondition_IsTargetFightPlayer_C_PerformanceCheck::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetFightPlayer_C_PerformanceCheck, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000050, "Member 'AICondition_IsTargetFightPlayer_C_PerformanceCheck::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetFightPlayer_C_PerformanceCheck, CallFunc_GetTargetActor_ReturnValue_1) == 0x000058, "Member 'AICondition_IsTargetFightPlayer_C_PerformanceCheck::CallFunc_GetTargetActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetFightPlayer_C_PerformanceCheck, CallFunc_IsValid_ReturnValue_2) == 0x000060, "Member 'AICondition_IsTargetFightPlayer_C_PerformanceCheck::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetFightPlayer_C_PerformanceCheck, K2Node_DynamicCast_AsTrap_1) == 0x000068, "Member 'AICondition_IsTargetFightPlayer_C_PerformanceCheck::K2Node_DynamicCast_AsTrap_1' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetFightPlayer_C_PerformanceCheck, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'AICondition_IsTargetFightPlayer_C_PerformanceCheck::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetFightPlayer_C_PerformanceCheck, K2Node_DynamicCast_AsGame_Character) == 0x000078, "Member 'AICondition_IsTargetFightPlayer_C_PerformanceCheck::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetFightPlayer_C_PerformanceCheck, K2Node_DynamicCast_bSuccess_3) == 0x000080, "Member 'AICondition_IsTargetFightPlayer_C_PerformanceCheck::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetFightPlayer_C_PerformanceCheck, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000081, "Member 'AICondition_IsTargetFightPlayer_C_PerformanceCheck::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetFightPlayer_C_PerformanceCheck, CallFunc_Array_Find_ReturnValue) == 0x000084, "Member 'AICondition_IsTargetFightPlayer_C_PerformanceCheck::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetFightPlayer_C_PerformanceCheck, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000088, "Member 'AICondition_IsTargetFightPlayer_C_PerformanceCheck::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AICondition_IsTargetFightPlayer_C_PerformanceCheck, CallFunc_BooleanOR_ReturnValue) == 0x000089, "Member 'AICondition_IsTargetFightPlayer_C_PerformanceCheck::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

