#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIEvent_MoveToCullOutDamage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass AIEvent_MoveToCullOutDamage.AIEvent_MoveToCullOutDamage_C
// 0x0030 (0x00D8 - 0x00A8)
class UAIEvent_MoveToCullOutDamage_C final : public UAIEvent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Target;                                            // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AcceptRadius;                                      // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanInterrupt;                                      // 0x00BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         AIChar;                                            // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseSimpleMove;                                     // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SimpleMoveBrakeDistance;                           // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AcceptTolerance;                                   // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TryMoveTime;                                       // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool CanInterruptFight();
	void OnMoveFinished_84D3B10A45FF44B2FD32E989F4F29813(EPathFollowingResult Result, class AAIController* AIController_0);
	void OnRequestFailed_84D3B10A45FF44B2FD32E989F4F29813();
	void OnExecute(class AGameCharacter* Character);
	void OnTick(float DeltaTime);
	void ExecuteUbergraph_AIEvent_MoveToCullOutDamage(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AIEvent_MoveToCullOutDamage_C">();
	}
	static class UAIEvent_MoveToCullOutDamage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIEvent_MoveToCullOutDamage_C>();
	}
};
static_assert(alignof(UAIEvent_MoveToCullOutDamage_C) == 0x000008, "Wrong alignment on UAIEvent_MoveToCullOutDamage_C");
static_assert(sizeof(UAIEvent_MoveToCullOutDamage_C) == 0x0000D8, "Wrong size on UAIEvent_MoveToCullOutDamage_C");
static_assert(offsetof(UAIEvent_MoveToCullOutDamage_C, UberGraphFrame) == 0x0000A8, "Member 'UAIEvent_MoveToCullOutDamage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAIEvent_MoveToCullOutDamage_C, Target) == 0x0000B0, "Member 'UAIEvent_MoveToCullOutDamage_C::Target' has a wrong offset!");
static_assert(offsetof(UAIEvent_MoveToCullOutDamage_C, AcceptRadius) == 0x0000B8, "Member 'UAIEvent_MoveToCullOutDamage_C::AcceptRadius' has a wrong offset!");
static_assert(offsetof(UAIEvent_MoveToCullOutDamage_C, CanInterrupt) == 0x0000BC, "Member 'UAIEvent_MoveToCullOutDamage_C::CanInterrupt' has a wrong offset!");
static_assert(offsetof(UAIEvent_MoveToCullOutDamage_C, AIChar) == 0x0000C0, "Member 'UAIEvent_MoveToCullOutDamage_C::AIChar' has a wrong offset!");
static_assert(offsetof(UAIEvent_MoveToCullOutDamage_C, UseSimpleMove) == 0x0000C8, "Member 'UAIEvent_MoveToCullOutDamage_C::UseSimpleMove' has a wrong offset!");
static_assert(offsetof(UAIEvent_MoveToCullOutDamage_C, SimpleMoveBrakeDistance) == 0x0000CC, "Member 'UAIEvent_MoveToCullOutDamage_C::SimpleMoveBrakeDistance' has a wrong offset!");
static_assert(offsetof(UAIEvent_MoveToCullOutDamage_C, AcceptTolerance) == 0x0000D0, "Member 'UAIEvent_MoveToCullOutDamage_C::AcceptTolerance' has a wrong offset!");
static_assert(offsetof(UAIEvent_MoveToCullOutDamage_C, TryMoveTime) == 0x0000D4, "Member 'UAIEvent_MoveToCullOutDamage_C::TryMoveTime' has a wrong offset!");

}

