#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIEvent_MoveTo

#include "Basic.hpp"

#include "Game_classes.hpp"
#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass AIEvent_MoveTo.AIEvent_MoveTo_C
// 0x0030 (0x00D8 - 0x00A8)
class UAIEvent_MoveTo_C final : public UAIEvent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Target;                                            // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AcceptRadius;                                      // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanInterrupt;                                      // 0x00BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         AIChar;                                            // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseSimpleMove;                                     // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SimpleMoveBrakeDistance;                           // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AcceptTolerance;                                   // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TryMoveTime;                                       // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool CanInterruptFight();
	void OnMoveFinished_27A515F04C10695563425C91883D3501(EPathFollowingResult Result, class AAIController* AIController_0);
	void OnRequestFailed_27A515F04C10695563425C91883D3501();
	void OnExecute(class AGameCharacter* Character);
	void OnTick(float DeltaTime);
	void ExecuteUbergraph_AIEvent_MoveTo(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AIEvent_MoveTo_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AIEvent_MoveTo_C")
	}
	static class UAIEvent_MoveTo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIEvent_MoveTo_C>();
	}
};
DUMPER7_ASSERTS_UAIEvent_MoveTo_C;

}

