#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIEvent_AddEnmity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AIEvent_AddEnmity.AIEvent_AddEnmity_C
// 0x0018 (0x00C0 - 0x00A8)
class UAIEvent_AddEnmity_C final : public UAIEvent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   Tag;                                               // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Enmity;                                            // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool CanInterruptFight();
	void OnExecute(class AGameCharacter* Character);
	void ExecuteOnServer(class AActor* InCharacter);
	void ExecuteUbergraph_AIEvent_AddEnmity(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AIEvent_AddEnmity_C">();
	}
	static class UAIEvent_AddEnmity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIEvent_AddEnmity_C>();
	}
};
static_assert(alignof(UAIEvent_AddEnmity_C) == 0x000008, "Wrong alignment on UAIEvent_AddEnmity_C");
static_assert(sizeof(UAIEvent_AddEnmity_C) == 0x0000C0, "Wrong size on UAIEvent_AddEnmity_C");
static_assert(offsetof(UAIEvent_AddEnmity_C, UberGraphFrame) == 0x0000A8, "Member 'UAIEvent_AddEnmity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAIEvent_AddEnmity_C, Tag) == 0x0000B0, "Member 'UAIEvent_AddEnmity_C::Tag' has a wrong offset!");
static_assert(offsetof(UAIEvent_AddEnmity_C, Enmity) == 0x0000B8, "Member 'UAIEvent_AddEnmity_C::Enmity' has a wrong offset!");

}

