#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIEvent_AddEnmity

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AIEvent_AddEnmity.AIEvent_AddEnmity_C.CanInterruptFight
// 0x0001 (0x0001 - 0x0000)
struct AIEvent_AddEnmity_C_CanInterruptFight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIEvent_AddEnmity_C_CanInterruptFight) == 0x000001, "Wrong alignment on AIEvent_AddEnmity_C_CanInterruptFight");
static_assert(sizeof(AIEvent_AddEnmity_C_CanInterruptFight) == 0x000001, "Wrong size on AIEvent_AddEnmity_C_CanInterruptFight");
static_assert(offsetof(AIEvent_AddEnmity_C_CanInterruptFight, ReturnValue) == 0x000000, "Member 'AIEvent_AddEnmity_C_CanInterruptFight::ReturnValue' has a wrong offset!");

// Function AIEvent_AddEnmity.AIEvent_AddEnmity_C.OnExecute
// 0x0008 (0x0008 - 0x0000)
struct AIEvent_AddEnmity_C_OnExecute final
{
public:
	class AGameCharacter*                         Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIEvent_AddEnmity_C_OnExecute) == 0x000008, "Wrong alignment on AIEvent_AddEnmity_C_OnExecute");
static_assert(sizeof(AIEvent_AddEnmity_C_OnExecute) == 0x000008, "Wrong size on AIEvent_AddEnmity_C_OnExecute");
static_assert(offsetof(AIEvent_AddEnmity_C_OnExecute, Character) == 0x000000, "Member 'AIEvent_AddEnmity_C_OnExecute::Character' has a wrong offset!");

// Function AIEvent_AddEnmity.AIEvent_AddEnmity_C.ExecuteOnServer
// 0x0008 (0x0008 - 0x0000)
struct AIEvent_AddEnmity_C_ExecuteOnServer final
{
public:
	class AActor*                                 InCharacter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIEvent_AddEnmity_C_ExecuteOnServer) == 0x000008, "Wrong alignment on AIEvent_AddEnmity_C_ExecuteOnServer");
static_assert(sizeof(AIEvent_AddEnmity_C_ExecuteOnServer) == 0x000008, "Wrong size on AIEvent_AddEnmity_C_ExecuteOnServer");
static_assert(offsetof(AIEvent_AddEnmity_C_ExecuteOnServer, InCharacter) == 0x000000, "Member 'AIEvent_AddEnmity_C_ExecuteOnServer::InCharacter' has a wrong offset!");

// Function AIEvent_AddEnmity.AIEvent_AddEnmity_C.ExecuteUbergraph_AIEvent_AddEnmity
// 0x0088 (0x0088 - 0x0000)
struct AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_Event_Character;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_InCharacter;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class APlayerController*>              CallFunc_GetPlayerControllerList_OutPlayerCtrls;   // 0x0030(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_GetActorByString_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable;                      // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity) == 0x000008, "Wrong alignment on AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity");
static_assert(sizeof(AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity) == 0x000088, "Wrong size on AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity");
static_assert(offsetof(AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity, EntryPoint) == 0x000000, "Member 'AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity::EntryPoint' has a wrong offset!");
static_assert(offsetof(AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity, ___int_Array_Index_Variable) == 0x000004, "Member 'AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity, CallFunc_Conv_StringToFloat_ReturnValue) == 0x000008, "Member 'AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity::CallFunc_Conv_StringToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity, K2Node_Event_Character) == 0x000010, "Member 'AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity::K2Node_Event_Character' has a wrong offset!");
static_assert(offsetof(AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity, K2Node_CustomEvent_InCharacter) == 0x000018, "Member 'AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity::K2Node_CustomEvent_InCharacter' has a wrong offset!");
static_assert(offsetof(AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity, CallFunc_Conv_NameToString_ReturnValue) == 0x000020, "Member 'AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity, CallFunc_GetPlayerControllerList_OutPlayerCtrls) == 0x000030, "Member 'AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity::CallFunc_GetPlayerControllerList_OutPlayerCtrls' has a wrong offset!");
static_assert(offsetof(AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity, CallFunc_GetActorByString_ReturnValue) == 0x000040, "Member 'AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity::CallFunc_GetActorByString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity, CallFunc_Array_Get_Item) == 0x000048, "Member 'AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity, CallFunc_GetLocalRole_ReturnValue) == 0x000050, "Member 'AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity::CallFunc_GetLocalRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity, CallFunc_K2_GetPawn_ReturnValue) == 0x000058, "Member 'AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000060, "Member 'AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity, CallFunc_IsValid_ReturnValue) == 0x000061, "Member 'AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000068, "Member 'AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity, ___int_Loop_Counter_Variable) == 0x00006C, "Member 'AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000078, "Member 'AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity, CallFunc_Conv_StringToName_ReturnValue) == 0x00007C, "Member 'AIEvent_AddEnmity_C_ExecuteUbergraph_AIEvent_AddEnmity::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

}

