#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIEvent_SetPatrolPoint

#include "Basic.hpp"


namespace SDK::Params
{

// Function AIEvent_SetPatrolPoint.AIEvent_SetPatrolPoint_C.OnExecute
// 0x0008 (0x0008 - 0x0000)
struct AIEvent_SetPatrolPoint_C_OnExecute final
{
public:
	class AGameCharacter*                         Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIEvent_SetPatrolPoint_C_OnExecute) == 0x000008, "Wrong alignment on AIEvent_SetPatrolPoint_C_OnExecute");
static_assert(sizeof(AIEvent_SetPatrolPoint_C_OnExecute) == 0x000008, "Wrong size on AIEvent_SetPatrolPoint_C_OnExecute");
static_assert(offsetof(AIEvent_SetPatrolPoint_C_OnExecute, Character) == 0x000000, "Member 'AIEvent_SetPatrolPoint_C_OnExecute::Character' has a wrong offset!");

// Function AIEvent_SetPatrolPoint.AIEvent_SetPatrolPoint_C.ExecuteUbergraph_AIEvent_SetPatrolPoint
// 0x0030 (0x0030 - 0x0000)
struct AIEvent_SetPatrolPoint_C_ExecuteUbergraph_AIEvent_SetPatrolPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_Event_Character;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetActorByName_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APatrolPoint_New*                       K2Node_DynamicCast_AsPatrol_Point_New;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIEvent_SetPatrolPoint_C_ExecuteUbergraph_AIEvent_SetPatrolPoint) == 0x000008, "Wrong alignment on AIEvent_SetPatrolPoint_C_ExecuteUbergraph_AIEvent_SetPatrolPoint");
static_assert(sizeof(AIEvent_SetPatrolPoint_C_ExecuteUbergraph_AIEvent_SetPatrolPoint) == 0x000030, "Wrong size on AIEvent_SetPatrolPoint_C_ExecuteUbergraph_AIEvent_SetPatrolPoint");
static_assert(offsetof(AIEvent_SetPatrolPoint_C_ExecuteUbergraph_AIEvent_SetPatrolPoint, EntryPoint) == 0x000000, "Member 'AIEvent_SetPatrolPoint_C_ExecuteUbergraph_AIEvent_SetPatrolPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(AIEvent_SetPatrolPoint_C_ExecuteUbergraph_AIEvent_SetPatrolPoint, K2Node_Event_Character) == 0x000008, "Member 'AIEvent_SetPatrolPoint_C_ExecuteUbergraph_AIEvent_SetPatrolPoint::K2Node_Event_Character' has a wrong offset!");
static_assert(offsetof(AIEvent_SetPatrolPoint_C_ExecuteUbergraph_AIEvent_SetPatrolPoint, CallFunc_GetActorByName_ReturnValue) == 0x000010, "Member 'AIEvent_SetPatrolPoint_C_ExecuteUbergraph_AIEvent_SetPatrolPoint::CallFunc_GetActorByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIEvent_SetPatrolPoint_C_ExecuteUbergraph_AIEvent_SetPatrolPoint, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'AIEvent_SetPatrolPoint_C_ExecuteUbergraph_AIEvent_SetPatrolPoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIEvent_SetPatrolPoint_C_ExecuteUbergraph_AIEvent_SetPatrolPoint, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'AIEvent_SetPatrolPoint_C_ExecuteUbergraph_AIEvent_SetPatrolPoint::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIEvent_SetPatrolPoint_C_ExecuteUbergraph_AIEvent_SetPatrolPoint, K2Node_DynamicCast_AsPatrol_Point_New) == 0x000020, "Member 'AIEvent_SetPatrolPoint_C_ExecuteUbergraph_AIEvent_SetPatrolPoint::K2Node_DynamicCast_AsPatrol_Point_New' has a wrong offset!");
static_assert(offsetof(AIEvent_SetPatrolPoint_C_ExecuteUbergraph_AIEvent_SetPatrolPoint, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AIEvent_SetPatrolPoint_C_ExecuteUbergraph_AIEvent_SetPatrolPoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AIEvent_SetPatrolPoint_C_ExecuteUbergraph_AIEvent_SetPatrolPoint, CallFunc_IsEmpty_ReturnValue) == 0x000029, "Member 'AIEvent_SetPatrolPoint_C_ExecuteUbergraph_AIEvent_SetPatrolPoint::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");

}

