#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AirBarrier_b

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AirBarrier_b.AirBarrier_b_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct AirBarrier_b_C_UserConstructionScript final
{
public:
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AirBarrier_b_C_UserConstructionScript) == 0x000004, "Wrong alignment on AirBarrier_b_C_UserConstructionScript");
static_assert(sizeof(AirBarrier_b_C_UserConstructionScript) == 0x000010, "Wrong size on AirBarrier_b_C_UserConstructionScript");
static_assert(offsetof(AirBarrier_b_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000000, "Member 'AirBarrier_b_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_b_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000004, "Member 'AirBarrier_b_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function AirBarrier_b.AirBarrier_b_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct AirBarrier_b_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AirBarrier_b_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on AirBarrier_b_C_ReceiveActorEndOverlap");
static_assert(sizeof(AirBarrier_b_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on AirBarrier_b_C_ReceiveActorEndOverlap");
static_assert(offsetof(AirBarrier_b_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'AirBarrier_b_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// Function AirBarrier_b.AirBarrier_b_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct AirBarrier_b_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AirBarrier_b_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on AirBarrier_b_C_ReceiveActorBeginOverlap");
static_assert(sizeof(AirBarrier_b_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on AirBarrier_b_C_ReceiveActorBeginOverlap");
static_assert(offsetof(AirBarrier_b_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'AirBarrier_b_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function AirBarrier_b.AirBarrier_b_C.ExecuteUbergraph_AirBarrier_b
// 0x0050 (0x0050 - 0x0000)
struct AirBarrier_b_C_ExecuteUbergraph_AirBarrier_b final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetLocalizationText_ReturnValue;          // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AirBarrier_b_C_ExecuteUbergraph_AirBarrier_b) == 0x000008, "Wrong alignment on AirBarrier_b_C_ExecuteUbergraph_AirBarrier_b");
static_assert(sizeof(AirBarrier_b_C_ExecuteUbergraph_AirBarrier_b) == 0x000050, "Wrong size on AirBarrier_b_C_ExecuteUbergraph_AirBarrier_b");
static_assert(offsetof(AirBarrier_b_C_ExecuteUbergraph_AirBarrier_b, EntryPoint) == 0x000000, "Member 'AirBarrier_b_C_ExecuteUbergraph_AirBarrier_b::EntryPoint' has a wrong offset!");
static_assert(offsetof(AirBarrier_b_C_ExecuteUbergraph_AirBarrier_b, CallFunc_GetLocalizationText_ReturnValue) == 0x000008, "Member 'AirBarrier_b_C_ExecuteUbergraph_AirBarrier_b::CallFunc_GetLocalizationText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_b_C_ExecuteUbergraph_AirBarrier_b, K2Node_Event_OtherActor) == 0x000018, "Member 'AirBarrier_b_C_ExecuteUbergraph_AirBarrier_b::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(AirBarrier_b_C_ExecuteUbergraph_AirBarrier_b, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'AirBarrier_b_C_ExecuteUbergraph_AirBarrier_b::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_b_C_ExecuteUbergraph_AirBarrier_b, K2Node_DynamicCast_AsGame_Player) == 0x000038, "Member 'AirBarrier_b_C_ExecuteUbergraph_AirBarrier_b::K2Node_DynamicCast_AsGame_Player' has a wrong offset!");
static_assert(offsetof(AirBarrier_b_C_ExecuteUbergraph_AirBarrier_b, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'AirBarrier_b_C_ExecuteUbergraph_AirBarrier_b::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AirBarrier_b_C_ExecuteUbergraph_AirBarrier_b, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'AirBarrier_b_C_ExecuteUbergraph_AirBarrier_b::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_b_C_ExecuteUbergraph_AirBarrier_b, K2Node_Event_OtherActor_1) == 0x000048, "Member 'AirBarrier_b_C_ExecuteUbergraph_AirBarrier_b::K2Node_Event_OtherActor_1' has a wrong offset!");

}

