#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AirBlock_PlayerOnly

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AirBlock_PlayerOnly.AirBlock_PlayerOnly_C
// 0x0020 (0x0248 - 0x0228)
class AAirBlock_PlayerOnly_C final : public AActor
{
public:
	class UArrowComponent*                        Arrow;                                             // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillWallMeshComponent*                SkillWallMesh;                                     // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         LengthScale;                                       // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Opacity;                                           // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AirBlock_PlayerOnly_C">();
	}
	static class AAirBlock_PlayerOnly_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAirBlock_PlayerOnly_C>();
	}
};
static_assert(alignof(AAirBlock_PlayerOnly_C) == 0x000008, "Wrong alignment on AAirBlock_PlayerOnly_C");
static_assert(sizeof(AAirBlock_PlayerOnly_C) == 0x000248, "Wrong size on AAirBlock_PlayerOnly_C");
static_assert(offsetof(AAirBlock_PlayerOnly_C, Arrow) == 0x000228, "Member 'AAirBlock_PlayerOnly_C::Arrow' has a wrong offset!");
static_assert(offsetof(AAirBlock_PlayerOnly_C, SkillWallMesh) == 0x000230, "Member 'AAirBlock_PlayerOnly_C::SkillWallMesh' has a wrong offset!");
static_assert(offsetof(AAirBlock_PlayerOnly_C, DefaultSceneRoot) == 0x000238, "Member 'AAirBlock_PlayerOnly_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AAirBlock_PlayerOnly_C, LengthScale) == 0x000240, "Member 'AAirBlock_PlayerOnly_C::LengthScale' has a wrong offset!");
static_assert(offsetof(AAirBlock_PlayerOnly_C, Opacity) == 0x000244, "Member 'AAirBlock_PlayerOnly_C::Opacity' has a wrong offset!");

}

