#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AirBarrier_a

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AirBarrier_a.AirBarrier_a_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct AirBarrier_a_C_UserConstructionScript final
{
public:
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AirBarrier_a_C_UserConstructionScript) == 0x000004, "Wrong alignment on AirBarrier_a_C_UserConstructionScript");
static_assert(sizeof(AirBarrier_a_C_UserConstructionScript) == 0x000010, "Wrong size on AirBarrier_a_C_UserConstructionScript");
static_assert(offsetof(AirBarrier_a_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000000, "Member 'AirBarrier_a_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_a_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000004, "Member 'AirBarrier_a_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function AirBarrier_a.AirBarrier_a_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct AirBarrier_a_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AirBarrier_a_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on AirBarrier_a_C_ReceiveActorBeginOverlap");
static_assert(sizeof(AirBarrier_a_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on AirBarrier_a_C_ReceiveActorBeginOverlap");
static_assert(offsetof(AirBarrier_a_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'AirBarrier_a_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function AirBarrier_a.AirBarrier_a_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct AirBarrier_a_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AirBarrier_a_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on AirBarrier_a_C_ReceiveActorEndOverlap");
static_assert(sizeof(AirBarrier_a_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on AirBarrier_a_C_ReceiveActorEndOverlap");
static_assert(offsetof(AirBarrier_a_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'AirBarrier_a_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// Function AirBarrier_a.AirBarrier_a_C.ExecuteUbergraph_AirBarrier_a
// 0x0060 (0x0060 - 0x0000)
struct AirBarrier_a_C_ExecuteUbergraph_AirBarrier_a final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetLocalizationText_ReturnValue;          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AirBarrier_a_C_ExecuteUbergraph_AirBarrier_a) == 0x000008, "Wrong alignment on AirBarrier_a_C_ExecuteUbergraph_AirBarrier_a");
static_assert(sizeof(AirBarrier_a_C_ExecuteUbergraph_AirBarrier_a) == 0x000060, "Wrong size on AirBarrier_a_C_ExecuteUbergraph_AirBarrier_a");
static_assert(offsetof(AirBarrier_a_C_ExecuteUbergraph_AirBarrier_a, EntryPoint) == 0x000000, "Member 'AirBarrier_a_C_ExecuteUbergraph_AirBarrier_a::EntryPoint' has a wrong offset!");
static_assert(offsetof(AirBarrier_a_C_ExecuteUbergraph_AirBarrier_a, K2Node_Event_OtherActor) == 0x000008, "Member 'AirBarrier_a_C_ExecuteUbergraph_AirBarrier_a::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(AirBarrier_a_C_ExecuteUbergraph_AirBarrier_a, CallFunc_Concat_StrStr_ReturnValue) == 0x000010, "Member 'AirBarrier_a_C_ExecuteUbergraph_AirBarrier_a::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_a_C_ExecuteUbergraph_AirBarrier_a, CallFunc_GetLocalizationText_ReturnValue) == 0x000020, "Member 'AirBarrier_a_C_ExecuteUbergraph_AirBarrier_a::CallFunc_GetLocalizationText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_a_C_ExecuteUbergraph_AirBarrier_a, K2Node_Event_OtherActor_1) == 0x000030, "Member 'AirBarrier_a_C_ExecuteUbergraph_AirBarrier_a::K2Node_Event_OtherActor_1' has a wrong offset!");
static_assert(offsetof(AirBarrier_a_C_ExecuteUbergraph_AirBarrier_a, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'AirBarrier_a_C_ExecuteUbergraph_AirBarrier_a::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_a_C_ExecuteUbergraph_AirBarrier_a, K2Node_DynamicCast_AsGame_Player) == 0x000050, "Member 'AirBarrier_a_C_ExecuteUbergraph_AirBarrier_a::K2Node_DynamicCast_AsGame_Player' has a wrong offset!");
static_assert(offsetof(AirBarrier_a_C_ExecuteUbergraph_AirBarrier_a, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'AirBarrier_a_C_ExecuteUbergraph_AirBarrier_a::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AirBarrier_a_C_ExecuteUbergraph_AirBarrier_a, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'AirBarrier_a_C_ExecuteUbergraph_AirBarrier_a::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

