#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AirBarrier

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// LuaFunction AirBarrier.AirBarrier_C.DoRegionCheck
// 0x0001 (0x0001 - 0x0000)
struct AirBarrier_C_DoRegionCheck final
{
public:
	bool                                          bPassCheck;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AirBarrier_C_DoRegionCheck) == 0x000001, "Wrong alignment on AirBarrier_C_DoRegionCheck");
static_assert(sizeof(AirBarrier_C_DoRegionCheck) == 0x000001, "Wrong size on AirBarrier_C_DoRegionCheck");
static_assert(offsetof(AirBarrier_C_DoRegionCheck, bPassCheck) == 0x000000, "Member 'AirBarrier_C_DoRegionCheck::bPassCheck' has a wrong offset!");

// LuaFunction AirBarrier.AirBarrier_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct AirBarrier_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AirBarrier_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on AirBarrier_C_ReceiveActorBeginOverlap");
static_assert(sizeof(AirBarrier_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on AirBarrier_C_ReceiveActorBeginOverlap");
static_assert(offsetof(AirBarrier_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'AirBarrier_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// LuaFunction AirBarrier.AirBarrier_C.DoOnlineTDDutyCheck
// 0x0001 (0x0001 - 0x0000)
struct AirBarrier_C_DoOnlineTDDutyCheck final
{
public:
	bool                                          bPassCheck;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AirBarrier_C_DoOnlineTDDutyCheck) == 0x000001, "Wrong alignment on AirBarrier_C_DoOnlineTDDutyCheck");
static_assert(sizeof(AirBarrier_C_DoOnlineTDDutyCheck) == 0x000001, "Wrong size on AirBarrier_C_DoOnlineTDDutyCheck");
static_assert(offsetof(AirBarrier_C_DoOnlineTDDutyCheck, bPassCheck) == 0x000000, "Member 'AirBarrier_C_DoOnlineTDDutyCheck::bPassCheck' has a wrong offset!");

// Function AirBarrier.AirBarrier_C.ShouldOpenTick
// 0x0001 (0x0001 - 0x0000)
struct AirBarrier_C_ShouldOpenTick final
{
public:
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AirBarrier_C_ShouldOpenTick) == 0x000001, "Wrong alignment on AirBarrier_C_ShouldOpenTick");
static_assert(sizeof(AirBarrier_C_ShouldOpenTick) == 0x000001, "Wrong size on AirBarrier_C_ShouldOpenTick");
static_assert(offsetof(AirBarrier_C_ShouldOpenTick, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000000, "Member 'AirBarrier_C_ShouldOpenTick::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function AirBarrier.AirBarrier_C.Update
// 0x0024 (0x0024 - 0x0000)
struct AirBarrier_C_Update final
{
public:
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AirBarrier_C_Update) == 0x000004, "Wrong alignment on AirBarrier_C_Update");
static_assert(sizeof(AirBarrier_C_Update) == 0x000024, "Wrong size on AirBarrier_C_Update");
static_assert(offsetof(AirBarrier_C_Update, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000000, "Member 'AirBarrier_C_Update::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_Update, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'AirBarrier_C_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_Update, CallFunc_Divide_IntInt_ReturnValue) == 0x000008, "Member 'AirBarrier_C_Update::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_Update, CallFunc_Divide_IntInt_ReturnValue_1) == 0x00000C, "Member 'AirBarrier_C_Update::CallFunc_Divide_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_Update, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000010, "Member 'AirBarrier_C_Update::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_Update, CallFunc_IsValid_ReturnValue_1) == 0x000014, "Member 'AirBarrier_C_Update::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_Update, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'AirBarrier_C_Update::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function AirBarrier.AirBarrier_C.CheckTDDuty
// 0x0018 (0x0018 - 0x0000)
struct AirBarrier_C_CheckTDDuty final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoOnlineTDDutyCheck_bPassCheck;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOnlineClient_ReturnValue;               // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AirBarrier_C_CheckTDDuty) == 0x000008, "Wrong alignment on AirBarrier_C_CheckTDDuty");
static_assert(sizeof(AirBarrier_C_CheckTDDuty) == 0x000018, "Wrong size on AirBarrier_C_CheckTDDuty");
static_assert(offsetof(AirBarrier_C_CheckTDDuty, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'AirBarrier_C_CheckTDDuty::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_CheckTDDuty, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'AirBarrier_C_CheckTDDuty::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_CheckTDDuty, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'AirBarrier_C_CheckTDDuty::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_CheckTDDuty, CallFunc_DoOnlineTDDutyCheck_bPassCheck) == 0x000011, "Member 'AirBarrier_C_CheckTDDuty::CallFunc_DoOnlineTDDutyCheck_bPassCheck' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_CheckTDDuty, CallFunc_IsOnlineClient_ReturnValue) == 0x000012, "Member 'AirBarrier_C_CheckTDDuty::CallFunc_IsOnlineClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_CheckTDDuty, CallFunc_ActorHasTag_ReturnValue) == 0x000013, "Member 'AirBarrier_C_CheckTDDuty::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_CheckTDDuty, CallFunc_BooleanAND_ReturnValue) == 0x000014, "Member 'AirBarrier_C_CheckTDDuty::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_CheckTDDuty, CallFunc_BooleanAND_ReturnValue_1) == 0x000015, "Member 'AirBarrier_C_CheckTDDuty::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function AirBarrier.AirBarrier_C.OpenOrCloseBarrier
// 0x0003 (0x0003 - 0x0000)
struct AirBarrier_C_OpenOrCloseBarrier final
{
public:
	bool                                          ClientDutyCheckResult;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AirBarrier_C_OpenOrCloseBarrier) == 0x000001, "Wrong alignment on AirBarrier_C_OpenOrCloseBarrier");
static_assert(sizeof(AirBarrier_C_OpenOrCloseBarrier) == 0x000003, "Wrong size on AirBarrier_C_OpenOrCloseBarrier");
static_assert(offsetof(AirBarrier_C_OpenOrCloseBarrier, ClientDutyCheckResult) == 0x000000, "Member 'AirBarrier_C_OpenOrCloseBarrier::ClientDutyCheckResult' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_OpenOrCloseBarrier, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'AirBarrier_C_OpenOrCloseBarrier::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_OpenOrCloseBarrier, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'AirBarrier_C_OpenOrCloseBarrier::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function AirBarrier.AirBarrier_C.DoOnlineTDDutyCheck__Overridden
// 0x0001 (0x0001 - 0x0000)
struct AirBarrier_C_DoOnlineTDDutyCheck__Overridden final
{
public:
	bool                                          bPassCheck;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AirBarrier_C_DoOnlineTDDutyCheck__Overridden) == 0x000001, "Wrong alignment on AirBarrier_C_DoOnlineTDDutyCheck__Overridden");
static_assert(sizeof(AirBarrier_C_DoOnlineTDDutyCheck__Overridden) == 0x000001, "Wrong size on AirBarrier_C_DoOnlineTDDutyCheck__Overridden");
static_assert(offsetof(AirBarrier_C_DoOnlineTDDutyCheck__Overridden, bPassCheck) == 0x000000, "Member 'AirBarrier_C_DoOnlineTDDutyCheck__Overridden::bPassCheck' has a wrong offset!");

// Function AirBarrier.AirBarrier_C.TryOpen
// 0x0001 (0x0001 - 0x0000)
struct AirBarrier_C_TryOpen final
{
public:
	bool                                          CallFunc_DoRegionCheck_bPassCheck;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AirBarrier_C_TryOpen) == 0x000001, "Wrong alignment on AirBarrier_C_TryOpen");
static_assert(sizeof(AirBarrier_C_TryOpen) == 0x000001, "Wrong size on AirBarrier_C_TryOpen");
static_assert(offsetof(AirBarrier_C_TryOpen, CallFunc_DoRegionCheck_bPassCheck) == 0x000000, "Member 'AirBarrier_C_TryOpen::CallFunc_DoRegionCheck_bPassCheck' has a wrong offset!");

// Function AirBarrier.AirBarrier_C.DoRegionCheck__Overridden
// 0x0001 (0x0001 - 0x0000)
struct AirBarrier_C_DoRegionCheck__Overridden final
{
public:
	bool                                          bPassCheck;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AirBarrier_C_DoRegionCheck__Overridden) == 0x000001, "Wrong alignment on AirBarrier_C_DoRegionCheck__Overridden");
static_assert(sizeof(AirBarrier_C_DoRegionCheck__Overridden) == 0x000001, "Wrong size on AirBarrier_C_DoRegionCheck__Overridden");
static_assert(offsetof(AirBarrier_C_DoRegionCheck__Overridden, bPassCheck) == 0x000000, "Member 'AirBarrier_C_DoRegionCheck__Overridden::bPassCheck' has a wrong offset!");

// Function AirBarrier.AirBarrier_C.MonsterThroughWall
// 0x0028 (0x0028 - 0x0000)
struct AirBarrier_C_MonsterThroughWall final
{
public:
	bool                                          CanThrough;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECharacterType>                        K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	TArray<ECharacterType>                        K2Node_MakeArray_Array_1;                          // 0x0018(0x0010)(ReferenceParm)
};
static_assert(alignof(AirBarrier_C_MonsterThroughWall) == 0x000008, "Wrong alignment on AirBarrier_C_MonsterThroughWall");
static_assert(sizeof(AirBarrier_C_MonsterThroughWall) == 0x000028, "Wrong size on AirBarrier_C_MonsterThroughWall");
static_assert(offsetof(AirBarrier_C_MonsterThroughWall, CanThrough) == 0x000000, "Member 'AirBarrier_C_MonsterThroughWall::CanThrough' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_MonsterThroughWall, K2Node_MakeArray_Array) == 0x000008, "Member 'AirBarrier_C_MonsterThroughWall::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_MonsterThroughWall, K2Node_MakeArray_Array_1) == 0x000018, "Member 'AirBarrier_C_MonsterThroughWall::K2Node_MakeArray_Array_1' has a wrong offset!");

// Function AirBarrier.AirBarrier_C.OnRep_IsOn
// 0x0001 (0x0001 - 0x0000)
struct AirBarrier_C_OnRep_IsOn final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AirBarrier_C_OnRep_IsOn) == 0x000001, "Wrong alignment on AirBarrier_C_OnRep_IsOn");
static_assert(sizeof(AirBarrier_C_OnRep_IsOn) == 0x000001, "Wrong size on AirBarrier_C_OnRep_IsOn");
static_assert(offsetof(AirBarrier_C_OnRep_IsOn, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'AirBarrier_C_OnRep_IsOn::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function AirBarrier.AirBarrier_C.SpawnNav
// 0x0080 (0x0080 - 0x0000)
struct AirBarrier_C_SpawnNav final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAirBarrier_b_C*                        K2Node_DynamicCast_AsAir_Barrier_B;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAirBarrier_a_C*                        K2Node_DynamicCast_AsAir_Barrier_A;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0xE];                                       // 0x0022(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAirBarrier_b_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAirBarrier_a_C*                        CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AirBarrier_C_SpawnNav) == 0x000010, "Wrong alignment on AirBarrier_C_SpawnNav");
static_assert(sizeof(AirBarrier_C_SpawnNav) == 0x000080, "Wrong size on AirBarrier_C_SpawnNav");
static_assert(offsetof(AirBarrier_C_SpawnNav, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'AirBarrier_C_SpawnNav::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_SpawnNav, K2Node_DynamicCast_AsAir_Barrier_B) == 0x000008, "Member 'AirBarrier_C_SpawnNav::K2Node_DynamicCast_AsAir_Barrier_B' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_SpawnNav, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'AirBarrier_C_SpawnNav::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_SpawnNav, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'AirBarrier_C_SpawnNav::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_SpawnNav, K2Node_DynamicCast_AsAir_Barrier_A) == 0x000018, "Member 'AirBarrier_C_SpawnNav::K2Node_DynamicCast_AsAir_Barrier_A' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_SpawnNav, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'AirBarrier_C_SpawnNav::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_SpawnNav, K2Node_SwitchInteger_CmpSuccess) == 0x000021, "Member 'AirBarrier_C_SpawnNav::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_SpawnNav, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000030, "Member 'AirBarrier_C_SpawnNav::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_SpawnNav, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000060, "Member 'AirBarrier_C_SpawnNav::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_SpawnNav, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000068, "Member 'AirBarrier_C_SpawnNav::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_SpawnNav, CallFunc_FinishSpawningActor_ReturnValue) == 0x000070, "Member 'AirBarrier_C_SpawnNav::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_SpawnNav, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000078, "Member 'AirBarrier_C_SpawnNav::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");

// Function AirBarrier.AirBarrier_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct AirBarrier_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AirBarrier_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on AirBarrier_C_ReceiveEndPlay");
static_assert(sizeof(AirBarrier_C_ReceiveEndPlay) == 0x000001, "Wrong size on AirBarrier_C_ReceiveEndPlay");
static_assert(offsetof(AirBarrier_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'AirBarrier_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function AirBarrier.AirBarrier_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct AirBarrier_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AirBarrier_C_ReceiveTick) == 0x000004, "Wrong alignment on AirBarrier_C_ReceiveTick");
static_assert(sizeof(AirBarrier_C_ReceiveTick) == 0x000004, "Wrong size on AirBarrier_C_ReceiveTick");
static_assert(offsetof(AirBarrier_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'AirBarrier_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function AirBarrier.AirBarrier_C.ExecuteUbergraph_AirBarrier
// 0x0010 (0x0010 - 0x0000)
struct AirBarrier_C_ExecuteUbergraph_AirBarrier final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AirBarrier_C_ExecuteUbergraph_AirBarrier) == 0x000004, "Wrong alignment on AirBarrier_C_ExecuteUbergraph_AirBarrier");
static_assert(sizeof(AirBarrier_C_ExecuteUbergraph_AirBarrier) == 0x000010, "Wrong size on AirBarrier_C_ExecuteUbergraph_AirBarrier");
static_assert(offsetof(AirBarrier_C_ExecuteUbergraph_AirBarrier, EntryPoint) == 0x000000, "Member 'AirBarrier_C_ExecuteUbergraph_AirBarrier::EntryPoint' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_ExecuteUbergraph_AirBarrier, K2Node_Event_EndPlayReason) == 0x000004, "Member 'AirBarrier_C_ExecuteUbergraph_AirBarrier::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_ExecuteUbergraph_AirBarrier, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'AirBarrier_C_ExecuteUbergraph_AirBarrier::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_ExecuteUbergraph_AirBarrier, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000006, "Member 'AirBarrier_C_ExecuteUbergraph_AirBarrier::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_ExecuteUbergraph_AirBarrier, CallFunc_IsValid_ReturnValue) == 0x000007, "Member 'AirBarrier_C_ExecuteUbergraph_AirBarrier::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_ExecuteUbergraph_AirBarrier, CallFunc_BooleanAND_ReturnValue) == 0x000008, "Member 'AirBarrier_C_ExecuteUbergraph_AirBarrier::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AirBarrier_C_ExecuteUbergraph_AirBarrier, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'AirBarrier_C_ExecuteUbergraph_AirBarrier::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function AirBarrier.AirBarrier_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct AirBarrier_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(AirBarrier_C_GetModuleName) == 0x000008, "Wrong alignment on AirBarrier_C_GetModuleName");
static_assert(sizeof(AirBarrier_C_GetModuleName) == 0x000010, "Wrong size on AirBarrier_C_GetModuleName");
static_assert(offsetof(AirBarrier_C_GetModuleName, ReturnValue) == 0x000000, "Member 'AirBarrier_C_GetModuleName::ReturnValue' has a wrong offset!");

}

