#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AirBarrier_a

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AirBarrier_a.AirBarrier_a_C
// 0x0040 (0x0268 - 0x0228)
class AAirBarrier_a_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNavModifierComponent*                  NavModifier;                                       // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene1;                                            // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Length;                                            // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         EnterLimit;                                        // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanShowPrompt;                                     // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PromptString;                                      // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ExecuteUbergraph_AirBarrier_a(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AirBarrier_a_C">();
	}
	static class AAirBarrier_a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAirBarrier_a_C>();
	}
};
static_assert(alignof(AAirBarrier_a_C) == 0x000008, "Wrong alignment on AAirBarrier_a_C");
static_assert(sizeof(AAirBarrier_a_C) == 0x000268, "Wrong size on AAirBarrier_a_C");
static_assert(offsetof(AAirBarrier_a_C, UberGraphFrame) == 0x000228, "Member 'AAirBarrier_a_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAirBarrier_a_C, Box) == 0x000230, "Member 'AAirBarrier_a_C::Box' has a wrong offset!");
static_assert(offsetof(AAirBarrier_a_C, NavModifier) == 0x000238, "Member 'AAirBarrier_a_C::NavModifier' has a wrong offset!");
static_assert(offsetof(AAirBarrier_a_C, Scene1) == 0x000240, "Member 'AAirBarrier_a_C::Scene1' has a wrong offset!");
static_assert(offsetof(AAirBarrier_a_C, Length) == 0x000248, "Member 'AAirBarrier_a_C::Length' has a wrong offset!");
static_assert(offsetof(AAirBarrier_a_C, EnterLimit) == 0x00024C, "Member 'AAirBarrier_a_C::EnterLimit' has a wrong offset!");
static_assert(offsetof(AAirBarrier_a_C, CanShowPrompt) == 0x000250, "Member 'AAirBarrier_a_C::CanShowPrompt' has a wrong offset!");
static_assert(offsetof(AAirBarrier_a_C, PromptString) == 0x000258, "Member 'AAirBarrier_a_C::PromptString' has a wrong offset!");

}

