#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AISkillTargetTracker_girl002_Prop02_FireTarget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AISkillTargetTracker_girl002_Prop02_FireTarget.AISkillTargetTracker_girl002_Prop02_FireTarget_C.TickEvent
// 0x0010 (0x0010 - 0x0000)
struct AISkillTargetTracker_girl002_Prop02_FireTarget_C_TickEvent final
{
public:
	class UAIControlDataComponent*                AIControlData;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaTime;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AISkillTargetTracker_girl002_Prop02_FireTarget_C_TickEvent) == 0x000008, "Wrong alignment on AISkillTargetTracker_girl002_Prop02_FireTarget_C_TickEvent");
static_assert(sizeof(AISkillTargetTracker_girl002_Prop02_FireTarget_C_TickEvent) == 0x000010, "Wrong size on AISkillTargetTracker_girl002_Prop02_FireTarget_C_TickEvent");
static_assert(offsetof(AISkillTargetTracker_girl002_Prop02_FireTarget_C_TickEvent, AIControlData) == 0x000000, "Member 'AISkillTargetTracker_girl002_Prop02_FireTarget_C_TickEvent::AIControlData' has a wrong offset!");
static_assert(offsetof(AISkillTargetTracker_girl002_Prop02_FireTarget_C_TickEvent, DeltaTime) == 0x000008, "Member 'AISkillTargetTracker_girl002_Prop02_FireTarget_C_TickEvent::DeltaTime' has a wrong offset!");

// Function AISkillTargetTracker_girl002_Prop02_FireTarget.AISkillTargetTracker_girl002_Prop02_FireTarget_C.ExecuteUbergraph_AISkillTargetTracker_girl002_Prop02_FireTarget
// 0x0038 (0x0038 - 0x0000)
struct AISkillTargetTracker_girl002_Prop02_FireTarget_C_ExecuteUbergraph_AISkillTargetTracker_girl002_Prop02_FireTarget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIControlDataComponent*                K2Node_Event_AIControlData;                        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWednesdayDrone*                        K2Node_DynamicCast_AsWednesday_Drone;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OwnerFirePosition_bHit;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_OwnerFirePosition_Pos;                    // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AISkillTargetTracker_girl002_Prop02_FireTarget_C_ExecuteUbergraph_AISkillTargetTracker_girl002_Prop02_FireTarget) == 0x000008, "Wrong alignment on AISkillTargetTracker_girl002_Prop02_FireTarget_C_ExecuteUbergraph_AISkillTargetTracker_girl002_Prop02_FireTarget");
static_assert(sizeof(AISkillTargetTracker_girl002_Prop02_FireTarget_C_ExecuteUbergraph_AISkillTargetTracker_girl002_Prop02_FireTarget) == 0x000038, "Wrong size on AISkillTargetTracker_girl002_Prop02_FireTarget_C_ExecuteUbergraph_AISkillTargetTracker_girl002_Prop02_FireTarget");
static_assert(offsetof(AISkillTargetTracker_girl002_Prop02_FireTarget_C_ExecuteUbergraph_AISkillTargetTracker_girl002_Prop02_FireTarget, EntryPoint) == 0x000000, "Member 'AISkillTargetTracker_girl002_Prop02_FireTarget_C_ExecuteUbergraph_AISkillTargetTracker_girl002_Prop02_FireTarget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AISkillTargetTracker_girl002_Prop02_FireTarget_C_ExecuteUbergraph_AISkillTargetTracker_girl002_Prop02_FireTarget, K2Node_Event_AIControlData) == 0x000008, "Member 'AISkillTargetTracker_girl002_Prop02_FireTarget_C_ExecuteUbergraph_AISkillTargetTracker_girl002_Prop02_FireTarget::K2Node_Event_AIControlData' has a wrong offset!");
static_assert(offsetof(AISkillTargetTracker_girl002_Prop02_FireTarget_C_ExecuteUbergraph_AISkillTargetTracker_girl002_Prop02_FireTarget, K2Node_Event_DeltaTime) == 0x000010, "Member 'AISkillTargetTracker_girl002_Prop02_FireTarget_C_ExecuteUbergraph_AISkillTargetTracker_girl002_Prop02_FireTarget::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(AISkillTargetTracker_girl002_Prop02_FireTarget_C_ExecuteUbergraph_AISkillTargetTracker_girl002_Prop02_FireTarget, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'AISkillTargetTracker_girl002_Prop02_FireTarget_C_ExecuteUbergraph_AISkillTargetTracker_girl002_Prop02_FireTarget::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISkillTargetTracker_girl002_Prop02_FireTarget_C_ExecuteUbergraph_AISkillTargetTracker_girl002_Prop02_FireTarget, K2Node_DynamicCast_AsWednesday_Drone) == 0x000020, "Member 'AISkillTargetTracker_girl002_Prop02_FireTarget_C_ExecuteUbergraph_AISkillTargetTracker_girl002_Prop02_FireTarget::K2Node_DynamicCast_AsWednesday_Drone' has a wrong offset!");
static_assert(offsetof(AISkillTargetTracker_girl002_Prop02_FireTarget_C_ExecuteUbergraph_AISkillTargetTracker_girl002_Prop02_FireTarget, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AISkillTargetTracker_girl002_Prop02_FireTarget_C_ExecuteUbergraph_AISkillTargetTracker_girl002_Prop02_FireTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AISkillTargetTracker_girl002_Prop02_FireTarget_C_ExecuteUbergraph_AISkillTargetTracker_girl002_Prop02_FireTarget, CallFunc_OwnerFirePosition_bHit) == 0x000029, "Member 'AISkillTargetTracker_girl002_Prop02_FireTarget_C_ExecuteUbergraph_AISkillTargetTracker_girl002_Prop02_FireTarget::CallFunc_OwnerFirePosition_bHit' has a wrong offset!");
static_assert(offsetof(AISkillTargetTracker_girl002_Prop02_FireTarget_C_ExecuteUbergraph_AISkillTargetTracker_girl002_Prop02_FireTarget, CallFunc_OwnerFirePosition_Pos) == 0x00002C, "Member 'AISkillTargetTracker_girl002_Prop02_FireTarget_C_ExecuteUbergraph_AISkillTargetTracker_girl002_Prop02_FireTarget::CallFunc_OwnerFirePosition_Pos' has a wrong offset!");

}

