#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AISM_girl002_Prop02

#include "Basic.hpp"


namespace SDK::Params
{

// Function AISM_girl002_Prop02.AISM_girl002_Prop02_C.OnStateMachineUpdate
// 0x0004 (0x0004 - 0x0000)
struct AISM_girl002_Prop02_C_OnStateMachineUpdate final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AISM_girl002_Prop02_C_OnStateMachineUpdate) == 0x000004, "Wrong alignment on AISM_girl002_Prop02_C_OnStateMachineUpdate");
static_assert(sizeof(AISM_girl002_Prop02_C_OnStateMachineUpdate) == 0x000004, "Wrong size on AISM_girl002_Prop02_C_OnStateMachineUpdate");
static_assert(offsetof(AISM_girl002_Prop02_C_OnStateMachineUpdate, DeltaSeconds) == 0x000000, "Member 'AISM_girl002_Prop02_C_OnStateMachineUpdate::DeltaSeconds' has a wrong offset!");

// Function AISM_girl002_Prop02.AISM_girl002_Prop02_C.ExecuteUbergraph_AISM_girl002_Prop02
// 0x0040 (0x0040 - 0x0000)
struct AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameAIController*                      CallFunc_GameAIController_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameAIController*                      CallFunc_GameAIController_ReturnValue_1;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanInFight_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAIController*                      CallFunc_GameAIController_ReturnValue_2;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanInFight_ReturnValue_1;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02) == 0x000008, "Wrong alignment on AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02");
static_assert(sizeof(AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02) == 0x000040, "Wrong size on AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02");
static_assert(offsetof(AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02, EntryPoint) == 0x000000, "Member 'AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02::EntryPoint' has a wrong offset!");
static_assert(offsetof(AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02, CallFunc_GameAIController_ReturnValue) == 0x000008, "Member 'AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02::CallFunc_GameAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02, CallFunc_GameAIController_ReturnValue_1) == 0x000018, "Member 'AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02::CallFunc_GameAIController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02, K2Node_DynamicCast_AsGame_Character) == 0x000020, "Member 'AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02, CallFunc_CanInFight_ReturnValue) == 0x000029, "Member 'AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02::CallFunc_CanInFight_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02, CallFunc_GameAIController_ReturnValue_2) == 0x000030, "Member 'AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02::CallFunc_GameAIController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02, CallFunc_CanInFight_ReturnValue_1) == 0x000038, "Member 'AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02::CallFunc_CanInFight_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'AISM_girl002_Prop02_C_ExecuteUbergraph_AISM_girl002_Prop02::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

