#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AISM_Mon_110

#include "Basic.hpp"


namespace SDK::Params
{

// Function AISM_Mon_110.AISM_Mon_110_C.OnStateMachineUpdate
// 0x0004 (0x0004 - 0x0000)
struct AISM_Mon_110_C_OnStateMachineUpdate final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AISM_Mon_110_C_OnStateMachineUpdate) == 0x000004, "Wrong alignment on AISM_Mon_110_C_OnStateMachineUpdate");
static_assert(sizeof(AISM_Mon_110_C_OnStateMachineUpdate) == 0x000004, "Wrong size on AISM_Mon_110_C_OnStateMachineUpdate");
static_assert(offsetof(AISM_Mon_110_C_OnStateMachineUpdate, DeltaSeconds) == 0x000000, "Member 'AISM_Mon_110_C_OnStateMachineUpdate::DeltaSeconds' has a wrong offset!");

// Function AISM_Mon_110.AISM_Mon_110_C.ExecuteUbergraph_AISM_Mon_110
// 0x0090 (0x0090 - 0x0000)
struct AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanInFight_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDead_ReturnValue_1;                     // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDead_ReturnValue_2;                     // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanInFight_ReturnValue_1;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanInFight_ReturnValue_2;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_2;            // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAIController*                      CallFunc_GameAIController_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_SetCurrentStateId_ReturnValue;            // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameAIController*                      CallFunc_GameAIController_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetActorTarget_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameAICharacter*                       K2Node_DynamicCast_AsGame_AICharacter;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrap*                                  K2Node_DynamicCast_AsTrap;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter_C*                       K2Node_DynamicCast_AsBase_Character;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetSceneTarget_ReturnValue;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_SetCurrentStateId_ReturnValue_1;          // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110) == 0x000008, "Wrong alignment on AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110");
static_assert(sizeof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110) == 0x000090, "Wrong size on AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, EntryPoint) == 0x000000, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::EntryPoint' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_CanInFight_ReturnValue) == 0x000008, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_CanInFight_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_IsDead_ReturnValue) == 0x00000A, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_IsDead_ReturnValue_1) == 0x00000B, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_IsDead_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_IsDead_ReturnValue_2) == 0x00000C, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_IsDead_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_CanInFight_ReturnValue_1) == 0x00000D, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_CanInFight_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_Add_FloatFloat_ReturnValue) == 0x000010, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_GetTimeSeconds_ReturnValue) == 0x000014, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000018, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_CanInFight_ReturnValue_2) == 0x000019, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_CanInFight_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x00001C, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000021, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000022, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000023, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000024, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_NotEqual_IntInt_ReturnValue_2) == 0x000025, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_NotEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_GameAIController_ReturnValue) == 0x000028, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_GameAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_MakeLiteralByte_ReturnValue) == 0x000030, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_SetCurrentStateId_ReturnValue) == 0x000032, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_SetCurrentStateId_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_RandomFloatInRange_ReturnValue) == 0x000034, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_GameAIController_ReturnValue_1) == 0x000038, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_GameAIController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_GetActorTarget_ReturnValue) == 0x000048, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_GetActorTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, K2Node_DynamicCast_AsGame_AICharacter) == 0x000050, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::K2Node_DynamicCast_AsGame_AICharacter' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, K2Node_DynamicCast_AsTrap) == 0x000060, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::K2Node_DynamicCast_AsTrap' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, K2Node_DynamicCast_AsBase_Character) == 0x000070, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::K2Node_DynamicCast_AsBase_Character' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_GetSceneTarget_ReturnValue) == 0x000080, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_GetSceneTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000088, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_IsValid_ReturnValue_2) == 0x000089, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_Not_PreBool_ReturnValue_1) == 0x00008A, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110, CallFunc_SetCurrentStateId_ReturnValue_1) == 0x00008B, "Member 'AISM_Mon_110_C_ExecuteUbergraph_AISM_Mon_110::CallFunc_SetCurrentStateId_ReturnValue_1' has a wrong offset!");

}

