#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AISM_Mon_109

#include "Basic.hpp"

#include "SMSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "AISM_BASE_classes.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass AISM_Mon_109.AISM_Mon_109_C
// 0x1DE0 (0x25F8 - 0x0818)
class UAISM_Mon_109_C final : public UAISM_BASE_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AISM_Mon_109_C;                     // 0x0818(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          AISM_Mon_109_AISM_Mon_109_C;                       // 0x0820(0x01A8)()
	struct FSMTransition                          AISM_Mon_109_AISM_Mon_109_C_0;                     // 0x09C8(0x01A8)()
	struct FSMTransition                          AISM_Mon_109_AISM_Mon_109_C_1;                     // 0x0B70(0x01A8)()
	struct FSMTransition                          AISM_Mon_109_AISM_Mon_109_C_2;                     // 0x0D18(0x01A8)()
	struct FSMTransition                          AISM_Mon_109_AISM_Mon_109_C_3;                     // 0x0EC0(0x01A8)()
	struct FSMTransition                          AISM_Mon_109_AISM_Mon_109_C_4;                     // 0x1068(0x01A8)()
	struct FSMTransition                          AISM_Mon_109_AISM_Mon_109_C_5;                     // 0x1210(0x01A8)()
	struct FSMState                               AISM_Mon_109_AISM_Mon_109_C_6;                     // 0x13B8(0x01C8)()
	struct FSMState                               AISM_Mon_109_AISM_Mon_109_C_7;                     // 0x1580(0x01C8)()
	struct FSMState                               AISM_Mon_109_AISM_Mon_109_C_8;                     // 0x1748(0x01C8)()
	struct FSMTransition                          AISM_Mon_109_AISM_Mon_109_C_9;                     // 0x1910(0x01A8)()
	struct FSMState                               AISM_Mon_109_AISM_Mon_109_C_10;                    // 0x1AB8(0x01C8)()
	struct FSMState                               AISM_Mon_109_AISM_Mon_109_C_11;                    // 0x1C80(0x01C8)()
	struct FSMStateMachine                        AISM_Mon_109_AISM_Mon_109_C_12;                    // 0x1E48(0x03C0)()
	struct FSMStateMachine                        AISM_Mon_109_AISM_Mon_109_C_13;                    // 0x2208(0x03C0)()
	float                                         StartTime_Idle;                                    // 0x25C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentHealthRate;                                 // 0x25CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StageFlag;                                         // 0x25D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D4[0x4];                                     // 0x25D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  OwnerAbility;                                      // 0x25D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentShield;                                     // 0x25E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNormal;                                           // 0x25E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bStage2;                                           // 0x25E5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bStage3;                                           // 0x25E6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25E7[0x1];                                     // 0x25E7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Mon_109_C*                          As_BP_Mon_109;                                     // 0x25E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ABP_Mon_109b_NPC_C*                     As_BP_Mon_109b_NPC;                                // 0x25F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AISM_Mon_109(int32 EntryPoint);
	void OnStateMachineInitialized();
	void OnStateMachineUpdate(float DeltaSeconds);
	void Func_AISM_Mon_109_AISM_Mon_109_C_12();
	void Func_AISM_Mon_109_AISM_Mon_109_C_11();
	void Func_AISM_Mon_109_AISM_Mon_109_C_10();
	void Func_AISM_Mon_109_AISM_Mon_109_C_9();
	void Func_AISM_Mon_109_AISM_Mon_109_C_8();
	void Func_AISM_Mon_109_AISM_Mon_109_C_7();
	void Func_AISM_Mon_109_AISM_Mon_109_C_6();
	void Func_AISM_Mon_109_AISM_Mon_109_C_5();
	void Func_AISM_Mon_109_AISM_Mon_109_C_4();
	void Func_AISM_Mon_109_AISM_Mon_109_C_3();
	void Func_AISM_Mon_109_AISM_Mon_109_C_2();
	void Func_AISM_Mon_109_AISM_Mon_109_C_1();
	void Func_AISM_Mon_109_AISM_Mon_109_C_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AISM_Mon_109_C">();
	}
	static class UAISM_Mon_109_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISM_Mon_109_C>();
	}
};
static_assert(alignof(UAISM_Mon_109_C) == 0x000008, "Wrong alignment on UAISM_Mon_109_C");
static_assert(sizeof(UAISM_Mon_109_C) == 0x0025F8, "Wrong size on UAISM_Mon_109_C");
static_assert(offsetof(UAISM_Mon_109_C, UberGraphFrame_AISM_Mon_109_C) == 0x000818, "Member 'UAISM_Mon_109_C::UberGraphFrame_AISM_Mon_109_C' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_109_C, AISM_Mon_109_AISM_Mon_109_C) == 0x000820, "Member 'UAISM_Mon_109_C::AISM_Mon_109_AISM_Mon_109_C' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_109_C, AISM_Mon_109_AISM_Mon_109_C_0) == 0x0009C8, "Member 'UAISM_Mon_109_C::AISM_Mon_109_AISM_Mon_109_C_0' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_109_C, AISM_Mon_109_AISM_Mon_109_C_1) == 0x000B70, "Member 'UAISM_Mon_109_C::AISM_Mon_109_AISM_Mon_109_C_1' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_109_C, AISM_Mon_109_AISM_Mon_109_C_2) == 0x000D18, "Member 'UAISM_Mon_109_C::AISM_Mon_109_AISM_Mon_109_C_2' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_109_C, AISM_Mon_109_AISM_Mon_109_C_3) == 0x000EC0, "Member 'UAISM_Mon_109_C::AISM_Mon_109_AISM_Mon_109_C_3' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_109_C, AISM_Mon_109_AISM_Mon_109_C_4) == 0x001068, "Member 'UAISM_Mon_109_C::AISM_Mon_109_AISM_Mon_109_C_4' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_109_C, AISM_Mon_109_AISM_Mon_109_C_5) == 0x001210, "Member 'UAISM_Mon_109_C::AISM_Mon_109_AISM_Mon_109_C_5' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_109_C, AISM_Mon_109_AISM_Mon_109_C_6) == 0x0013B8, "Member 'UAISM_Mon_109_C::AISM_Mon_109_AISM_Mon_109_C_6' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_109_C, AISM_Mon_109_AISM_Mon_109_C_7) == 0x001580, "Member 'UAISM_Mon_109_C::AISM_Mon_109_AISM_Mon_109_C_7' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_109_C, AISM_Mon_109_AISM_Mon_109_C_8) == 0x001748, "Member 'UAISM_Mon_109_C::AISM_Mon_109_AISM_Mon_109_C_8' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_109_C, AISM_Mon_109_AISM_Mon_109_C_9) == 0x001910, "Member 'UAISM_Mon_109_C::AISM_Mon_109_AISM_Mon_109_C_9' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_109_C, AISM_Mon_109_AISM_Mon_109_C_10) == 0x001AB8, "Member 'UAISM_Mon_109_C::AISM_Mon_109_AISM_Mon_109_C_10' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_109_C, AISM_Mon_109_AISM_Mon_109_C_11) == 0x001C80, "Member 'UAISM_Mon_109_C::AISM_Mon_109_AISM_Mon_109_C_11' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_109_C, AISM_Mon_109_AISM_Mon_109_C_12) == 0x001E48, "Member 'UAISM_Mon_109_C::AISM_Mon_109_AISM_Mon_109_C_12' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_109_C, AISM_Mon_109_AISM_Mon_109_C_13) == 0x002208, "Member 'UAISM_Mon_109_C::AISM_Mon_109_AISM_Mon_109_C_13' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_109_C, StartTime_Idle) == 0x0025C8, "Member 'UAISM_Mon_109_C::StartTime_Idle' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_109_C, CurrentHealthRate) == 0x0025CC, "Member 'UAISM_Mon_109_C::CurrentHealthRate' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_109_C, StageFlag) == 0x0025D0, "Member 'UAISM_Mon_109_C::StageFlag' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_109_C, OwnerAbility) == 0x0025D8, "Member 'UAISM_Mon_109_C::OwnerAbility' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_109_C, CurrentShield) == 0x0025E0, "Member 'UAISM_Mon_109_C::CurrentShield' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_109_C, bNormal) == 0x0025E4, "Member 'UAISM_Mon_109_C::bNormal' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_109_C, bStage2) == 0x0025E5, "Member 'UAISM_Mon_109_C::bStage2' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_109_C, bStage3) == 0x0025E6, "Member 'UAISM_Mon_109_C::bStage3' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_109_C, As_BP_Mon_109) == 0x0025E8, "Member 'UAISM_Mon_109_C::As_BP_Mon_109' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_109_C, As_BP_Mon_109b_NPC) == 0x0025F0, "Member 'UAISM_Mon_109_C::As_BP_Mon_109b_NPC' has a wrong offset!");

}

