#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AISM_Mon_118

#include "Basic.hpp"

#include "SMSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "AISM_BASE_classes.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass AISM_Mon_118.AISM_Mon_118_C
// 0x1A48 (0x2260 - 0x0818)
class UAISM_Mon_118_C final : public UAISM_BASE_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AISM_Mon_118_C;                     // 0x0818(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          AISM_Mon_118_AISM_Mon_118_C;                       // 0x0820(0x01A8)()
	struct FSMTransition                          AISM_Mon_118_AISM_Mon_118_C_0;                     // 0x09C8(0x01A8)()
	struct FSMTransition                          AISM_Mon_118_AISM_Mon_118_C_1;                     // 0x0B70(0x01A8)()
	struct FSMTransition                          AISM_Mon_118_AISM_Mon_118_C_2;                     // 0x0D18(0x01A8)()
	struct FSMTransition                          AISM_Mon_118_AISM_Mon_118_C_3;                     // 0x0EC0(0x01A8)()
	struct FSMTransition                          AISM_Mon_118_AISM_Mon_118_C_4;                     // 0x1068(0x01A8)()
	struct FSMTransition                          AISM_Mon_118_AISM_Mon_118_C_5;                     // 0x1210(0x01A8)()
	struct FSMState                               AISM_Mon_118_AISM_Mon_118_C_6;                     // 0x13B8(0x01C8)()
	struct FSMState                               AISM_Mon_118_AISM_Mon_118_C_7;                     // 0x1580(0x01C8)()
	struct FSMState                               AISM_Mon_118_AISM_Mon_118_C_8;                     // 0x1748(0x01C8)()
	struct FSMState                               AISM_Mon_118_AISM_Mon_118_C_9;                     // 0x1910(0x01C8)()
	struct FSMStateMachine                        AISM_Mon_118_AISM_Mon_118_C_10;                    // 0x1AD8(0x03C0)()
	struct FSMStateMachine                        AISM_Mon_118_AISM_Mon_118_C_11;                    // 0x1E98(0x03C0)()
	float                                         StartTime_Idle;                                    // 0x2258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AISM_Mon_118(int32 EntryPoint);
	void Func_AISM_Mon_118_AISM_Mon_118_C_8();
	void Func_AISM_Mon_118_AISM_Mon_118_C_7();
	void Func_AISM_Mon_118_AISM_Mon_118_C_6();
	void Func_AISM_Mon_118_AISM_Mon_118_C_5();
	void Func_AISM_Mon_118_AISM_Mon_118_C_4();
	void Func_AISM_Mon_118_AISM_Mon_118_C_3();
	void Func_AISM_Mon_118_AISM_Mon_118_C_2();
	void Func_AISM_Mon_118_AISM_Mon_118_C_1();
	void Func_AISM_Mon_118_AISM_Mon_118_C_0();
	void GetSkeletalMesh(class USkeletalMeshComponent** SkeletalMesh);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AISM_Mon_118_C">();
	}
	static class UAISM_Mon_118_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISM_Mon_118_C>();
	}
};
static_assert(alignof(UAISM_Mon_118_C) == 0x000008, "Wrong alignment on UAISM_Mon_118_C");
static_assert(sizeof(UAISM_Mon_118_C) == 0x002260, "Wrong size on UAISM_Mon_118_C");
static_assert(offsetof(UAISM_Mon_118_C, UberGraphFrame_AISM_Mon_118_C) == 0x000818, "Member 'UAISM_Mon_118_C::UberGraphFrame_AISM_Mon_118_C' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_118_C, AISM_Mon_118_AISM_Mon_118_C) == 0x000820, "Member 'UAISM_Mon_118_C::AISM_Mon_118_AISM_Mon_118_C' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_118_C, AISM_Mon_118_AISM_Mon_118_C_0) == 0x0009C8, "Member 'UAISM_Mon_118_C::AISM_Mon_118_AISM_Mon_118_C_0' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_118_C, AISM_Mon_118_AISM_Mon_118_C_1) == 0x000B70, "Member 'UAISM_Mon_118_C::AISM_Mon_118_AISM_Mon_118_C_1' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_118_C, AISM_Mon_118_AISM_Mon_118_C_2) == 0x000D18, "Member 'UAISM_Mon_118_C::AISM_Mon_118_AISM_Mon_118_C_2' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_118_C, AISM_Mon_118_AISM_Mon_118_C_3) == 0x000EC0, "Member 'UAISM_Mon_118_C::AISM_Mon_118_AISM_Mon_118_C_3' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_118_C, AISM_Mon_118_AISM_Mon_118_C_4) == 0x001068, "Member 'UAISM_Mon_118_C::AISM_Mon_118_AISM_Mon_118_C_4' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_118_C, AISM_Mon_118_AISM_Mon_118_C_5) == 0x001210, "Member 'UAISM_Mon_118_C::AISM_Mon_118_AISM_Mon_118_C_5' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_118_C, AISM_Mon_118_AISM_Mon_118_C_6) == 0x0013B8, "Member 'UAISM_Mon_118_C::AISM_Mon_118_AISM_Mon_118_C_6' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_118_C, AISM_Mon_118_AISM_Mon_118_C_7) == 0x001580, "Member 'UAISM_Mon_118_C::AISM_Mon_118_AISM_Mon_118_C_7' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_118_C, AISM_Mon_118_AISM_Mon_118_C_8) == 0x001748, "Member 'UAISM_Mon_118_C::AISM_Mon_118_AISM_Mon_118_C_8' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_118_C, AISM_Mon_118_AISM_Mon_118_C_9) == 0x001910, "Member 'UAISM_Mon_118_C::AISM_Mon_118_AISM_Mon_118_C_9' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_118_C, AISM_Mon_118_AISM_Mon_118_C_10) == 0x001AD8, "Member 'UAISM_Mon_118_C::AISM_Mon_118_AISM_Mon_118_C_10' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_118_C, AISM_Mon_118_AISM_Mon_118_C_11) == 0x001E98, "Member 'UAISM_Mon_118_C::AISM_Mon_118_AISM_Mon_118_C_11' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_118_C, StartTime_Idle) == 0x002258, "Member 'UAISM_Mon_118_C::StartTime_Idle' has a wrong offset!");

}

