#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AISM_girl010_Prop01

#include "Basic.hpp"

#include "SMSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "AISM_BASE_classes.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass AISM_girl010_Prop01.AISM_girl010_Prop01_C
// 0x01E8 (0x0A00 - 0x0818)
class UAISM_girl010_Prop01_C final : public UAISM_BASE_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AISM_girl010_Prop01_C;              // 0x0818(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMState                               AISM_girl010_Prop01_AISM_girl010_Prop01_C;         // 0x0820(0x01C8)()
	float                                         StartTime_Idle;                                    // 0x09E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HighestDps2Self;                                   // 0x09EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShieldHoldingTime;                                 // 0x09F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnedOnce;                                       // 0x09F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9F5[0x3];                                      // 0x09F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         AIChar;                                            // 0x09F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnStateMachineStart();
	void OnStateMachineUpdate(float DeltaSeconds);
	void ExecuteUbergraph_AISM_girl010_Prop01(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AISM_girl010_Prop01_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AISM_girl010_Prop01_C")
	}
	static class UAISM_girl010_Prop01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISM_girl010_Prop01_C>();
	}
};
DUMPER7_ASSERTS_UAISM_girl010_Prop01_C;

}

