#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AISM_Mon_116

#include "Basic.hpp"


namespace SDK::Params
{

// Function AISM_Mon_116.AISM_Mon_116_C.GetSkeletalMesh
// 0x0038 (0x0038 - 0x0000)
struct AISM_Mon_116_C_GetSkeletalMesh final
{
public:
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_DynamicCast_AsAI___;                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AISM_Mon_116_C_GetSkeletalMesh) == 0x000008, "Wrong alignment on AISM_Mon_116_C_GetSkeletalMesh");
static_assert(sizeof(AISM_Mon_116_C_GetSkeletalMesh) == 0x000038, "Wrong size on AISM_Mon_116_C_GetSkeletalMesh");
static_assert(offsetof(AISM_Mon_116_C_GetSkeletalMesh, SkeletalMesh) == 0x000000, "Member 'AISM_Mon_116_C_GetSkeletalMesh::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(AISM_Mon_116_C_GetSkeletalMesh, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AISM_Mon_116_C_GetSkeletalMesh::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_Mon_116_C_GetSkeletalMesh, K2Node_DynamicCast_AsAI___) == 0x000010, "Member 'AISM_Mon_116_C_GetSkeletalMesh::K2Node_DynamicCast_AsAI___' has a wrong offset!");
static_assert(offsetof(AISM_Mon_116_C_GetSkeletalMesh, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AISM_Mon_116_C_GetSkeletalMesh::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AISM_Mon_116_C_GetSkeletalMesh, CallFunc_K2_GetPawn_ReturnValue) == 0x000020, "Member 'AISM_Mon_116_C_GetSkeletalMesh::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_Mon_116_C_GetSkeletalMesh, K2Node_DynamicCast_AsGame_Character) == 0x000028, "Member 'AISM_Mon_116_C_GetSkeletalMesh::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(AISM_Mon_116_C_GetSkeletalMesh, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'AISM_Mon_116_C_GetSkeletalMesh::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AISM_Mon_116_C_GetSkeletalMesh, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'AISM_Mon_116_C_GetSkeletalMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_Mon_116_C_GetSkeletalMesh, CallFunc_IsValid_ReturnValue_1) == 0x000032, "Member 'AISM_Mon_116_C_GetSkeletalMesh::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function AISM_Mon_116.AISM_Mon_116_C.OnStateMachineUpdate
// 0x0004 (0x0004 - 0x0000)
struct AISM_Mon_116_C_OnStateMachineUpdate final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AISM_Mon_116_C_OnStateMachineUpdate) == 0x000004, "Wrong alignment on AISM_Mon_116_C_OnStateMachineUpdate");
static_assert(sizeof(AISM_Mon_116_C_OnStateMachineUpdate) == 0x000004, "Wrong size on AISM_Mon_116_C_OnStateMachineUpdate");
static_assert(offsetof(AISM_Mon_116_C_OnStateMachineUpdate, DeltaSeconds) == 0x000000, "Member 'AISM_Mon_116_C_OnStateMachineUpdate::DeltaSeconds' has a wrong offset!");

// Function AISM_Mon_116.AISM_Mon_116_C.ExecuteUbergraph_AISM_Mon_116
// 0x0014 (0x0014 - 0x0000)
struct AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanInFight_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDead_ReturnValue_1;                     // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDead_ReturnValue_2;                     // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanInFight_ReturnValue_1;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanInFight_ReturnValue_2;                 // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_SetCurrentStateId_ReturnValue;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_SetCurrentStateId_ReturnValue_1;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116) == 0x000004, "Wrong alignment on AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116");
static_assert(sizeof(AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116) == 0x000014, "Wrong size on AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116");
static_assert(offsetof(AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116, EntryPoint) == 0x000000, "Member 'AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116::EntryPoint' has a wrong offset!");
static_assert(offsetof(AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116, CallFunc_CanInFight_ReturnValue) == 0x000008, "Member 'AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116::CallFunc_CanInFight_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116, CallFunc_IsDead_ReturnValue) == 0x00000A, "Member 'AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116, CallFunc_IsDead_ReturnValue_1) == 0x00000B, "Member 'AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116::CallFunc_IsDead_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116, CallFunc_IsDead_ReturnValue_2) == 0x00000C, "Member 'AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116::CallFunc_IsDead_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116, CallFunc_CanInFight_ReturnValue_1) == 0x00000D, "Member 'AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116::CallFunc_CanInFight_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116, CallFunc_MakeLiteralBool_ReturnValue) == 0x00000E, "Member 'AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116, CallFunc_CanInFight_ReturnValue_2) == 0x00000F, "Member 'AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116::CallFunc_CanInFight_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116, CallFunc_MakeLiteralByte_ReturnValue) == 0x000010, "Member 'AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000011, "Member 'AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116, CallFunc_SetCurrentStateId_ReturnValue) == 0x000012, "Member 'AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116::CallFunc_SetCurrentStateId_ReturnValue' has a wrong offset!");
static_assert(offsetof(AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116, CallFunc_SetCurrentStateId_ReturnValue_1) == 0x000013, "Member 'AISM_Mon_116_C_ExecuteUbergraph_AISM_Mon_116::CallFunc_SetCurrentStateId_ReturnValue_1' has a wrong offset!");

}

