#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AISM_Mon_013

#include "Basic.hpp"

#include "SMSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "AISM_BASE_classes.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass AISM_Mon_013.AISM_Mon_013_C
// 0x2988 (0x31A0 - 0x0818)
class UAISM_Mon_013_C final : public UAISM_BASE_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AISM_Mon_013_C;                     // 0x0818(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          AISM_Mon_013_AISM_Mon_013_C;                       // 0x0820(0x01A8)()
	struct FSMTransition                          AISM_Mon_013_AISM_Mon_013_C_0;                     // 0x09C8(0x01A8)()
	struct FSMTransition                          AISM_Mon_013_AISM_Mon_013_C_1;                     // 0x0B70(0x01A8)()
	struct FSMTransition                          AISM_Mon_013_AISM_Mon_013_C_2;                     // 0x0D18(0x01A8)()
	struct FSMTransition                          AISM_Mon_013_AISM_Mon_013_C_3;                     // 0x0EC0(0x01A8)()
	struct FSMTransition                          AISM_Mon_013_AISM_Mon_013_C_4;                     // 0x1068(0x01A8)()
	struct FSMTransition                          AISM_Mon_013_AISM_Mon_013_C_5;                     // 0x1210(0x01A8)()
	struct FSMState                               AISM_Mon_013_AISM_Mon_013_C_6;                     // 0x13B8(0x01C8)()
	struct FSMState                               AISM_Mon_013_AISM_Mon_013_C_7;                     // 0x1580(0x01C8)()
	struct FSMState                               AISM_Mon_013_AISM_Mon_013_C_8;                     // 0x1748(0x01C8)()
	struct FSMTransition                          AISM_Mon_013_AISM_Mon_013_C_9;                     // 0x1910(0x01A8)()
	struct FSMTransition                          AISM_Mon_013_AISM_Mon_013_C_10;                    // 0x1AB8(0x01A8)()
	struct FSMTransition                          AISM_Mon_013_AISM_Mon_013_C_11;                    // 0x1C60(0x01A8)()
	struct FSMTransition                          AISM_Mon_013_AISM_Mon_013_C_12;                    // 0x1E08(0x01A8)()
	struct FSMTransition                          AISM_Mon_013_AISM_Mon_013_C_13;                    // 0x1FB0(0x01A8)()
	struct FSMTransition                          AISM_Mon_013_AISM_Mon_013_C_14;                    // 0x2158(0x01A8)()
	struct FSMConduit                             AISM_Mon_013_AISM_Mon_013_C_15;                    // 0x2300(0x01B8)()
	struct FSMState                               AISM_Mon_013_AISM_Mon_013_C_16;                    // 0x24B8(0x01C8)()
	struct FSMState                               AISM_Mon_013_AISM_Mon_013_C_17;                    // 0x2680(0x01C8)()
	struct FSMState                               AISM_Mon_013_AISM_Mon_013_C_18;                    // 0x2848(0x01C8)()
	struct FSMStateMachine                        AISM_Mon_013_AISM_Mon_013_C_19;                    // 0x2A10(0x03C0)()
	struct FSMStateMachine                        AISM_Mon_013_AISM_Mon_013_C_20;                    // 0x2DD0(0x03C0)()
	float                                         StartTime_Idle;                                    // 0x3190(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTestFlag;                                         // 0x3194(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3195[0x3];                                     // 0x3195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StageFlag;                                         // 0x3198(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Func_AISM_Mon_013_AISM_Mon_013_C_0();
	void Func_AISM_Mon_013_AISM_Mon_013_C_1();
	void Func_AISM_Mon_013_AISM_Mon_013_C_3();
	void Func_AISM_Mon_013_AISM_Mon_013_C_5();
	void Func_AISM_Mon_013_AISM_Mon_013_C_6();
	void Func_AISM_Mon_013_AISM_Mon_013_C_7();
	void Func_AISM_Mon_013_AISM_Mon_013_C_8();
	void Func_AISM_Mon_013_AISM_Mon_013_C_9();
	void Func_AISM_Mon_013_AISM_Mon_013_C_10();
	void Func_AISM_Mon_013_AISM_Mon_013_C_11();
	void Func_AISM_Mon_013_AISM_Mon_013_C_13();
	void Func_AISM_Mon_013_AISM_Mon_013_C_15();
	void Func_AISM_Mon_013_AISM_Mon_013_C_16();
	void Func_AISM_Mon_013_AISM_Mon_013_C_2();
	void Func_AISM_Mon_013_AISM_Mon_013_C_4();
	void Func_AISM_Mon_013_AISM_Mon_013_C_12();
	void Func_AISM_Mon_013_AISM_Mon_013_C_14();
	void OnStateMachineStart();
	void OnStateMachineUpdate(float DeltaSeconds);
	void ExecuteUbergraph_AISM_Mon_013(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AISM_Mon_013_C">();
	}
	static class UAISM_Mon_013_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISM_Mon_013_C>();
	}
};
static_assert(alignof(UAISM_Mon_013_C) == 0x000008, "Wrong alignment on UAISM_Mon_013_C");
static_assert(sizeof(UAISM_Mon_013_C) == 0x0031A0, "Wrong size on UAISM_Mon_013_C");
static_assert(offsetof(UAISM_Mon_013_C, UberGraphFrame_AISM_Mon_013_C) == 0x000818, "Member 'UAISM_Mon_013_C::UberGraphFrame_AISM_Mon_013_C' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_013_C, AISM_Mon_013_AISM_Mon_013_C) == 0x000820, "Member 'UAISM_Mon_013_C::AISM_Mon_013_AISM_Mon_013_C' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_013_C, AISM_Mon_013_AISM_Mon_013_C_0) == 0x0009C8, "Member 'UAISM_Mon_013_C::AISM_Mon_013_AISM_Mon_013_C_0' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_013_C, AISM_Mon_013_AISM_Mon_013_C_1) == 0x000B70, "Member 'UAISM_Mon_013_C::AISM_Mon_013_AISM_Mon_013_C_1' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_013_C, AISM_Mon_013_AISM_Mon_013_C_2) == 0x000D18, "Member 'UAISM_Mon_013_C::AISM_Mon_013_AISM_Mon_013_C_2' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_013_C, AISM_Mon_013_AISM_Mon_013_C_3) == 0x000EC0, "Member 'UAISM_Mon_013_C::AISM_Mon_013_AISM_Mon_013_C_3' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_013_C, AISM_Mon_013_AISM_Mon_013_C_4) == 0x001068, "Member 'UAISM_Mon_013_C::AISM_Mon_013_AISM_Mon_013_C_4' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_013_C, AISM_Mon_013_AISM_Mon_013_C_5) == 0x001210, "Member 'UAISM_Mon_013_C::AISM_Mon_013_AISM_Mon_013_C_5' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_013_C, AISM_Mon_013_AISM_Mon_013_C_6) == 0x0013B8, "Member 'UAISM_Mon_013_C::AISM_Mon_013_AISM_Mon_013_C_6' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_013_C, AISM_Mon_013_AISM_Mon_013_C_7) == 0x001580, "Member 'UAISM_Mon_013_C::AISM_Mon_013_AISM_Mon_013_C_7' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_013_C, AISM_Mon_013_AISM_Mon_013_C_8) == 0x001748, "Member 'UAISM_Mon_013_C::AISM_Mon_013_AISM_Mon_013_C_8' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_013_C, AISM_Mon_013_AISM_Mon_013_C_9) == 0x001910, "Member 'UAISM_Mon_013_C::AISM_Mon_013_AISM_Mon_013_C_9' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_013_C, AISM_Mon_013_AISM_Mon_013_C_10) == 0x001AB8, "Member 'UAISM_Mon_013_C::AISM_Mon_013_AISM_Mon_013_C_10' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_013_C, AISM_Mon_013_AISM_Mon_013_C_11) == 0x001C60, "Member 'UAISM_Mon_013_C::AISM_Mon_013_AISM_Mon_013_C_11' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_013_C, AISM_Mon_013_AISM_Mon_013_C_12) == 0x001E08, "Member 'UAISM_Mon_013_C::AISM_Mon_013_AISM_Mon_013_C_12' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_013_C, AISM_Mon_013_AISM_Mon_013_C_13) == 0x001FB0, "Member 'UAISM_Mon_013_C::AISM_Mon_013_AISM_Mon_013_C_13' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_013_C, AISM_Mon_013_AISM_Mon_013_C_14) == 0x002158, "Member 'UAISM_Mon_013_C::AISM_Mon_013_AISM_Mon_013_C_14' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_013_C, AISM_Mon_013_AISM_Mon_013_C_15) == 0x002300, "Member 'UAISM_Mon_013_C::AISM_Mon_013_AISM_Mon_013_C_15' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_013_C, AISM_Mon_013_AISM_Mon_013_C_16) == 0x0024B8, "Member 'UAISM_Mon_013_C::AISM_Mon_013_AISM_Mon_013_C_16' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_013_C, AISM_Mon_013_AISM_Mon_013_C_17) == 0x002680, "Member 'UAISM_Mon_013_C::AISM_Mon_013_AISM_Mon_013_C_17' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_013_C, AISM_Mon_013_AISM_Mon_013_C_18) == 0x002848, "Member 'UAISM_Mon_013_C::AISM_Mon_013_AISM_Mon_013_C_18' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_013_C, AISM_Mon_013_AISM_Mon_013_C_19) == 0x002A10, "Member 'UAISM_Mon_013_C::AISM_Mon_013_AISM_Mon_013_C_19' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_013_C, AISM_Mon_013_AISM_Mon_013_C_20) == 0x002DD0, "Member 'UAISM_Mon_013_C::AISM_Mon_013_AISM_Mon_013_C_20' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_013_C, StartTime_Idle) == 0x003190, "Member 'UAISM_Mon_013_C::StartTime_Idle' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_013_C, bTestFlag) == 0x003194, "Member 'UAISM_Mon_013_C::bTestFlag' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_013_C, StageFlag) == 0x003198, "Member 'UAISM_Mon_013_C::StageFlag' has a wrong offset!");

}

