#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AISM_girl002_Prop02

#include "Basic.hpp"

#include "SMSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "AISM_BASE_classes.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass AISM_girl002_Prop02.AISM_girl002_Prop02_C
// 0x0700 (0x0F18 - 0x0818)
class UAISM_girl002_Prop02_C final : public UAISM_BASE_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AISM_girl002_Prop02_C;              // 0x0818(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          AISM_girl002_Prop02_AISM_girl002_Prop02_C;         // 0x0820(0x01A8)()
	struct FSMTransition                          AISM_girl002_Prop02_AISM_girl002_Prop02_C_0;       // 0x09C8(0x01A8)()
	struct FSMState                               AISM_girl002_Prop02_AISM_girl002_Prop02_C_1;       // 0x0B70(0x01C8)()
	struct FSMState                               AISM_girl002_Prop02_AISM_girl002_Prop02_C_2;       // 0x0D38(0x01C8)()
	float                                         StartTime_Idle;                                    // 0x0F00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HighestDps2Self;                                   // 0x0F04(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShieldHoldingTime;                                 // 0x0F08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnedOnce;                                       // 0x0F0C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F0D[0x3];                                      // 0x0F0D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         AIChar;                                            // 0x0F10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Func_AISM_girl002_Prop02_AISM_girl002_Prop02_C_0();
	void OnStateMachineUpdate(float DeltaSeconds);
	void OnStateMachineStart();
	void Func_AISM_girl002_Prop02_AISM_girl002_Prop02_C_1();
	void ExecuteUbergraph_AISM_girl002_Prop02(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AISM_girl002_Prop02_C">();
	}
	static class UAISM_girl002_Prop02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISM_girl002_Prop02_C>();
	}
};
static_assert(alignof(UAISM_girl002_Prop02_C) == 0x000008, "Wrong alignment on UAISM_girl002_Prop02_C");
static_assert(sizeof(UAISM_girl002_Prop02_C) == 0x000F18, "Wrong size on UAISM_girl002_Prop02_C");
static_assert(offsetof(UAISM_girl002_Prop02_C, UberGraphFrame_AISM_girl002_Prop02_C) == 0x000818, "Member 'UAISM_girl002_Prop02_C::UberGraphFrame_AISM_girl002_Prop02_C' has a wrong offset!");
static_assert(offsetof(UAISM_girl002_Prop02_C, AISM_girl002_Prop02_AISM_girl002_Prop02_C) == 0x000820, "Member 'UAISM_girl002_Prop02_C::AISM_girl002_Prop02_AISM_girl002_Prop02_C' has a wrong offset!");
static_assert(offsetof(UAISM_girl002_Prop02_C, AISM_girl002_Prop02_AISM_girl002_Prop02_C_0) == 0x0009C8, "Member 'UAISM_girl002_Prop02_C::AISM_girl002_Prop02_AISM_girl002_Prop02_C_0' has a wrong offset!");
static_assert(offsetof(UAISM_girl002_Prop02_C, AISM_girl002_Prop02_AISM_girl002_Prop02_C_1) == 0x000B70, "Member 'UAISM_girl002_Prop02_C::AISM_girl002_Prop02_AISM_girl002_Prop02_C_1' has a wrong offset!");
static_assert(offsetof(UAISM_girl002_Prop02_C, AISM_girl002_Prop02_AISM_girl002_Prop02_C_2) == 0x000D38, "Member 'UAISM_girl002_Prop02_C::AISM_girl002_Prop02_AISM_girl002_Prop02_C_2' has a wrong offset!");
static_assert(offsetof(UAISM_girl002_Prop02_C, StartTime_Idle) == 0x000F00, "Member 'UAISM_girl002_Prop02_C::StartTime_Idle' has a wrong offset!");
static_assert(offsetof(UAISM_girl002_Prop02_C, HighestDps2Self) == 0x000F04, "Member 'UAISM_girl002_Prop02_C::HighestDps2Self' has a wrong offset!");
static_assert(offsetof(UAISM_girl002_Prop02_C, ShieldHoldingTime) == 0x000F08, "Member 'UAISM_girl002_Prop02_C::ShieldHoldingTime' has a wrong offset!");
static_assert(offsetof(UAISM_girl002_Prop02_C, SpawnedOnce) == 0x000F0C, "Member 'UAISM_girl002_Prop02_C::SpawnedOnce' has a wrong offset!");
static_assert(offsetof(UAISM_girl002_Prop02_C, AIChar) == 0x000F10, "Member 'UAISM_girl002_Prop02_C::AIChar' has a wrong offset!");

}

