#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AISM_Mon_005

#include "Basic.hpp"

#include "SMSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "AISM_BASE_classes.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass AISM_Mon_005.AISM_Mon_005_C
// 0x3580 (0x3D98 - 0x0818)
class UAISM_Mon_005_C final : public UAISM_BASE_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AISM_Mon_005_C;                     // 0x0818(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          AISM_Mon_005_AISM_Mon_005_C;                       // 0x0820(0x01A8)()
	struct FSMTransition                          AISM_Mon_005_AISM_Mon_005_C_0;                     // 0x09C8(0x01A8)()
	struct FSMTransition                          AISM_Mon_005_AISM_Mon_005_C_1;                     // 0x0B70(0x01A8)()
	struct FSMTransition                          AISM_Mon_005_AISM_Mon_005_C_2;                     // 0x0D18(0x01A8)()
	struct FSMTransition                          AISM_Mon_005_AISM_Mon_005_C_3;                     // 0x0EC0(0x01A8)()
	struct FSMTransition                          AISM_Mon_005_AISM_Mon_005_C_4;                     // 0x1068(0x01A8)()
	struct FSMTransition                          AISM_Mon_005_AISM_Mon_005_C_5;                     // 0x1210(0x01A8)()
	struct FSMState                               AISM_Mon_005_AISM_Mon_005_C_6;                     // 0x13B8(0x01C8)()
	struct FSMState                               AISM_Mon_005_AISM_Mon_005_C_7;                     // 0x1580(0x01C8)()
	struct FSMState                               AISM_Mon_005_AISM_Mon_005_C_8;                     // 0x1748(0x01C8)()
	struct FSMTransition                          AISM_Mon_005_AISM_Mon_005_C_9;                     // 0x1910(0x01A8)()
	struct FSMTransition                          AISM_Mon_005_AISM_Mon_005_C_10;                    // 0x1AB8(0x01A8)()
	struct FSMTransition                          AISM_Mon_005_AISM_Mon_005_C_11;                    // 0x1C60(0x01A8)()
	struct FSMTransition                          AISM_Mon_005_AISM_Mon_005_C_12;                    // 0x1E08(0x01A8)()
	struct FSMTransition                          AISM_Mon_005_AISM_Mon_005_C_13;                    // 0x1FB0(0x01A8)()
	struct FSMTransition                          AISM_Mon_005_AISM_Mon_005_C_14;                    // 0x2158(0x01A8)()
	struct FSMTransition                          AISM_Mon_005_AISM_Mon_005_C_15;                    // 0x2300(0x01A8)()
	struct FSMTransition                          AISM_Mon_005_AISM_Mon_005_C_16;                    // 0x24A8(0x01A8)()
	struct FSMTransition                          AISM_Mon_005_AISM_Mon_005_C_17;                    // 0x2650(0x01A8)()
	struct FSMTransition                          AISM_Mon_005_AISM_Mon_005_C_18;                    // 0x27F8(0x01A8)()
	struct FSMState                               AISM_Mon_005_AISM_Mon_005_C_19;                    // 0x29A0(0x01C8)()
	struct FSMState                               AISM_Mon_005_AISM_Mon_005_C_20;                    // 0x2B68(0x01C8)()
	struct FSMConduit                             AISM_Mon_005_AISM_Mon_005_C_21;                    // 0x2D30(0x01B8)()
	struct FSMState                               AISM_Mon_005_AISM_Mon_005_C_22;                    // 0x2EE8(0x01C8)()
	struct FSMState                               AISM_Mon_005_AISM_Mon_005_C_23;                    // 0x30B0(0x01C8)()
	struct FSMState                               AISM_Mon_005_AISM_Mon_005_C_24;                    // 0x3278(0x01C8)()
	struct FSMState                               AISM_Mon_005_AISM_Mon_005_C_25;                    // 0x3440(0x01C8)()
	struct FSMStateMachine                        AISM_Mon_005_AISM_Mon_005_C_26;                    // 0x3608(0x03C0)()
	struct FSMStateMachine                        AISM_Mon_005_AISM_Mon_005_C_27;                    // 0x39C8(0x03C0)()
	float                                         StartTime_Idle;                                    // 0x3D88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomWaitTime;                                    // 0x3D8C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StageFlag;                                         // 0x3D90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Func_AISM_Mon_005_AISM_Mon_005_C_1();
	void Func_AISM_Mon_005_AISM_Mon_005_C_3();
	void Func_AISM_Mon_005_AISM_Mon_005_C_4();
	void Func_AISM_Mon_005_AISM_Mon_005_C_6();
	void Func_AISM_Mon_005_AISM_Mon_005_C_9();
	void Func_AISM_Mon_005_AISM_Mon_005_C_10();
	void Func_AISM_Mon_005_AISM_Mon_005_C_12();
	void Func_AISM_Mon_005_AISM_Mon_005_C_14();
	void Func_AISM_Mon_005_AISM_Mon_005_C_16();
	void Func_AISM_Mon_005_AISM_Mon_005_C_18();
	void Func_AISM_Mon_005_AISM_Mon_005_C_19();
	void OnStateMachineUpdate(float DeltaSeconds);
	void Func_AISM_Mon_005_AISM_Mon_005_C_0();
	void Func_AISM_Mon_005_AISM_Mon_005_C_2();
	void Func_AISM_Mon_005_AISM_Mon_005_C_5();
	void Func_AISM_Mon_005_AISM_Mon_005_C_7();
	void Func_AISM_Mon_005_AISM_Mon_005_C_8();
	void Func_AISM_Mon_005_AISM_Mon_005_C_11();
	void Func_AISM_Mon_005_AISM_Mon_005_C_13();
	void Func_AISM_Mon_005_AISM_Mon_005_C_15();
	void Func_AISM_Mon_005_AISM_Mon_005_C_17();
	void Func_AISM_Mon_005_AISM_Mon_005_C_20();
	void ExecuteUbergraph_AISM_Mon_005(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AISM_Mon_005_C">();
	}
	static class UAISM_Mon_005_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISM_Mon_005_C>();
	}
};
static_assert(alignof(UAISM_Mon_005_C) == 0x000008, "Wrong alignment on UAISM_Mon_005_C");
static_assert(sizeof(UAISM_Mon_005_C) == 0x003D98, "Wrong size on UAISM_Mon_005_C");
static_assert(offsetof(UAISM_Mon_005_C, UberGraphFrame_AISM_Mon_005_C) == 0x000818, "Member 'UAISM_Mon_005_C::UberGraphFrame_AISM_Mon_005_C' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C) == 0x000820, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_0) == 0x0009C8, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_0' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_1) == 0x000B70, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_1' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_2) == 0x000D18, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_2' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_3) == 0x000EC0, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_3' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_4) == 0x001068, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_4' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_5) == 0x001210, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_5' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_6) == 0x0013B8, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_6' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_7) == 0x001580, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_7' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_8) == 0x001748, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_8' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_9) == 0x001910, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_9' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_10) == 0x001AB8, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_10' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_11) == 0x001C60, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_11' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_12) == 0x001E08, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_12' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_13) == 0x001FB0, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_13' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_14) == 0x002158, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_14' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_15) == 0x002300, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_15' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_16) == 0x0024A8, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_16' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_17) == 0x002650, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_17' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_18) == 0x0027F8, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_18' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_19) == 0x0029A0, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_19' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_20) == 0x002B68, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_20' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_21) == 0x002D30, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_21' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_22) == 0x002EE8, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_22' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_23) == 0x0030B0, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_23' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_24) == 0x003278, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_24' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_25) == 0x003440, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_25' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_26) == 0x003608, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_26' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, AISM_Mon_005_AISM_Mon_005_C_27) == 0x0039C8, "Member 'UAISM_Mon_005_C::AISM_Mon_005_AISM_Mon_005_C_27' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, StartTime_Idle) == 0x003D88, "Member 'UAISM_Mon_005_C::StartTime_Idle' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, RandomWaitTime) == 0x003D8C, "Member 'UAISM_Mon_005_C::RandomWaitTime' has a wrong offset!");
static_assert(offsetof(UAISM_Mon_005_C, StageFlag) == 0x003D90, "Member 'UAISM_Mon_005_C::StageFlag' has a wrong offset!");

}

