#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AllAnimLayer_Monster

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AllAnimLayer_Monster.AllAnimLayer_Monster_C.GroundIKLayer
// 0x0020 (0x0020 - 0x0000)
struct AllAnimLayer_Monster_C_GroundIKLayer final
{
public:
	struct FPoseLink                              GroundIkInputPose;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              GroundIKLayer_0;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AllAnimLayer_Monster_C_GroundIKLayer) == 0x000008, "Wrong alignment on AllAnimLayer_Monster_C_GroundIKLayer");
static_assert(sizeof(AllAnimLayer_Monster_C_GroundIKLayer) == 0x000020, "Wrong size on AllAnimLayer_Monster_C_GroundIKLayer");
static_assert(offsetof(AllAnimLayer_Monster_C_GroundIKLayer, GroundIkInputPose) == 0x000000, "Member 'AllAnimLayer_Monster_C_GroundIKLayer::GroundIkInputPose' has a wrong offset!");
static_assert(offsetof(AllAnimLayer_Monster_C_GroundIKLayer, GroundIKLayer_0) == 0x000010, "Member 'AllAnimLayer_Monster_C_GroundIKLayer::GroundIKLayer_0' has a wrong offset!");

// Function AllAnimLayer_Monster.AllAnimLayer_Monster_C.CurveDataLayer
// 0x0020 (0x0020 - 0x0000)
struct AllAnimLayer_Monster_C_CurveDataLayer final
{
public:
	struct FPoseLink                              CurveInputPose;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              CurveDataLayer_0;                                  // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AllAnimLayer_Monster_C_CurveDataLayer) == 0x000008, "Wrong alignment on AllAnimLayer_Monster_C_CurveDataLayer");
static_assert(sizeof(AllAnimLayer_Monster_C_CurveDataLayer) == 0x000020, "Wrong size on AllAnimLayer_Monster_C_CurveDataLayer");
static_assert(offsetof(AllAnimLayer_Monster_C_CurveDataLayer, CurveInputPose) == 0x000000, "Member 'AllAnimLayer_Monster_C_CurveDataLayer::CurveInputPose' has a wrong offset!");
static_assert(offsetof(AllAnimLayer_Monster_C_CurveDataLayer, CurveDataLayer_0) == 0x000010, "Member 'AllAnimLayer_Monster_C_CurveDataLayer::CurveDataLayer_0' has a wrong offset!");

// Function AllAnimLayer_Monster.AllAnimLayer_Monster_C.HitAddtiveLayer
// 0x0020 (0x0020 - 0x0000)
struct AllAnimLayer_Monster_C_HitAddtiveLayer final
{
public:
	struct FPoseLink                              HitInputPose;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              HitAddtiveLayer_0;                                 // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AllAnimLayer_Monster_C_HitAddtiveLayer) == 0x000008, "Wrong alignment on AllAnimLayer_Monster_C_HitAddtiveLayer");
static_assert(sizeof(AllAnimLayer_Monster_C_HitAddtiveLayer) == 0x000020, "Wrong size on AllAnimLayer_Monster_C_HitAddtiveLayer");
static_assert(offsetof(AllAnimLayer_Monster_C_HitAddtiveLayer, HitInputPose) == 0x000000, "Member 'AllAnimLayer_Monster_C_HitAddtiveLayer::HitInputPose' has a wrong offset!");
static_assert(offsetof(AllAnimLayer_Monster_C_HitAddtiveLayer, HitAddtiveLayer_0) == 0x000010, "Member 'AllAnimLayer_Monster_C_HitAddtiveLayer::HitAddtiveLayer_0' has a wrong offset!");

}

