#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AllBulletEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AllBulletEffect.AllBulletEffect_C
// 0x0018 (0x0170 - 0x0158)
class UAllBulletEffect_C final : public UWeaponBulletEffectBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0158(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         NextBulletCount;                                   // 0x0160(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpawnBulletCount;                                  // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOnlyAim;                                          // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bOnlyNormal;                                       // 0x0169(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void CheckActive(ECharacterActionState InState, bool bSet);
	void K2_ReceiveActive(const class UObject* Instigator);
	void OnPlayerActionFlay(class AGameCharacter* CurCharacter, ECharacterActionState InType, bool bSet);
	void K2_ReceiveDeActive(const class UGameAbilityComponent* Pawn);
	void K2_ReceiveInitialize(const TArray<struct FParamInfo>& Info, const class UGameAbilityComponent* LpInstigator);
	void ExecuteUbergraph_AllBulletEffect(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AllBulletEffect_C">();
	}
	static class UAllBulletEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAllBulletEffect_C>();
	}
};
static_assert(alignof(UAllBulletEffect_C) == 0x000008, "Wrong alignment on UAllBulletEffect_C");
static_assert(sizeof(UAllBulletEffect_C) == 0x000170, "Wrong size on UAllBulletEffect_C");
static_assert(offsetof(UAllBulletEffect_C, UberGraphFrame) == 0x000158, "Member 'UAllBulletEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAllBulletEffect_C, NextBulletCount) == 0x000160, "Member 'UAllBulletEffect_C::NextBulletCount' has a wrong offset!");
static_assert(offsetof(UAllBulletEffect_C, SpawnBulletCount) == 0x000164, "Member 'UAllBulletEffect_C::SpawnBulletCount' has a wrong offset!");
static_assert(offsetof(UAllBulletEffect_C, bOnlyAim) == 0x000168, "Member 'UAllBulletEffect_C::bOnlyAim' has a wrong offset!");
static_assert(offsetof(UAllBulletEffect_C, bOnlyNormal) == 0x000169, "Member 'UAllBulletEffect_C::bOnlyNormal' has a wrong offset!");

}

