#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AllBulletEffect

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function AllBulletEffect.AllBulletEffect_C.CheckActive
// 0x0005 (0x0005 - 0x0000)
struct AllBulletEffect_C_CheckActive final
{
public:
	ECharacterActionState                         InState;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSet;                                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bTempSet;                                          // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AllBulletEffect_C_CheckActive) == 0x000001, "Wrong alignment on AllBulletEffect_C_CheckActive");
static_assert(sizeof(AllBulletEffect_C_CheckActive) == 0x000005, "Wrong size on AllBulletEffect_C_CheckActive");
static_assert(offsetof(AllBulletEffect_C_CheckActive, InState) == 0x000000, "Member 'AllBulletEffect_C_CheckActive::InState' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_CheckActive, bSet) == 0x000001, "Member 'AllBulletEffect_C_CheckActive::bSet' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_CheckActive, bTempSet) == 0x000002, "Member 'AllBulletEffect_C_CheckActive::bTempSet' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_CheckActive, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'AllBulletEffect_C_CheckActive::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_CheckActive, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'AllBulletEffect_C_CheckActive::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function AllBulletEffect.AllBulletEffect_C.K2_ReceiveActive
// 0x0008 (0x0008 - 0x0000)
struct AllBulletEffect_C_K2_ReceiveActive final
{
public:
	const class UObject*                          Instigator;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AllBulletEffect_C_K2_ReceiveActive) == 0x000008, "Wrong alignment on AllBulletEffect_C_K2_ReceiveActive");
static_assert(sizeof(AllBulletEffect_C_K2_ReceiveActive) == 0x000008, "Wrong size on AllBulletEffect_C_K2_ReceiveActive");
static_assert(offsetof(AllBulletEffect_C_K2_ReceiveActive, Instigator) == 0x000000, "Member 'AllBulletEffect_C_K2_ReceiveActive::Instigator' has a wrong offset!");

// Function AllBulletEffect.AllBulletEffect_C.OnPlayerActionFlay
// 0x0010 (0x0010 - 0x0000)
struct AllBulletEffect_C_OnPlayerActionFlay final
{
public:
	class AGameCharacter*                         CurCharacter;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterActionState                         InType;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSet;                                              // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AllBulletEffect_C_OnPlayerActionFlay) == 0x000008, "Wrong alignment on AllBulletEffect_C_OnPlayerActionFlay");
static_assert(sizeof(AllBulletEffect_C_OnPlayerActionFlay) == 0x000010, "Wrong size on AllBulletEffect_C_OnPlayerActionFlay");
static_assert(offsetof(AllBulletEffect_C_OnPlayerActionFlay, CurCharacter) == 0x000000, "Member 'AllBulletEffect_C_OnPlayerActionFlay::CurCharacter' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_OnPlayerActionFlay, InType) == 0x000008, "Member 'AllBulletEffect_C_OnPlayerActionFlay::InType' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_OnPlayerActionFlay, bSet) == 0x000009, "Member 'AllBulletEffect_C_OnPlayerActionFlay::bSet' has a wrong offset!");

// Function AllBulletEffect.AllBulletEffect_C.K2_ReceiveDeActive
// 0x0008 (0x0008 - 0x0000)
struct AllBulletEffect_C_K2_ReceiveDeActive final
{
public:
	const class UGameAbilityComponent*            Pawn;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AllBulletEffect_C_K2_ReceiveDeActive) == 0x000008, "Wrong alignment on AllBulletEffect_C_K2_ReceiveDeActive");
static_assert(sizeof(AllBulletEffect_C_K2_ReceiveDeActive) == 0x000008, "Wrong size on AllBulletEffect_C_K2_ReceiveDeActive");
static_assert(offsetof(AllBulletEffect_C_K2_ReceiveDeActive, Pawn) == 0x000000, "Member 'AllBulletEffect_C_K2_ReceiveDeActive::Pawn' has a wrong offset!");

// Function AllBulletEffect.AllBulletEffect_C.K2_ReceiveInitialize
// 0x0018 (0x0018 - 0x0000)
struct AllBulletEffect_C_K2_ReceiveInitialize final
{
public:
	TArray<struct FParamInfo>                     Info;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	const class UGameAbilityComponent*            LpInstigator;                                      // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AllBulletEffect_C_K2_ReceiveInitialize) == 0x000008, "Wrong alignment on AllBulletEffect_C_K2_ReceiveInitialize");
static_assert(sizeof(AllBulletEffect_C_K2_ReceiveInitialize) == 0x000018, "Wrong size on AllBulletEffect_C_K2_ReceiveInitialize");
static_assert(offsetof(AllBulletEffect_C_K2_ReceiveInitialize, Info) == 0x000000, "Member 'AllBulletEffect_C_K2_ReceiveInitialize::Info' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_K2_ReceiveInitialize, LpInstigator) == 0x000010, "Member 'AllBulletEffect_C_K2_ReceiveInitialize::LpInstigator' has a wrong offset!");

// Function AllBulletEffect.AllBulletEffect_C.ExecuteUbergraph_AllBulletEffect
// 0x0080 (0x0080 - 0x0000)
struct AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UObject*                          K2Node_Event_Instigator;                           // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AGameCharacter* CurCharacter, ECharacterActionState InType, bool bSet)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetOriginCharacter_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_CustomEvent_CurCharacter;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterActionState                         K2Node_CustomEvent_InType;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSet;                           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInAim_ReturnValue;                      // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetOriginCharacter_ReturnValue_1;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGameAbilityComponent*            K2Node_Event_Pawn;                                 // 0x0050(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParamInfo>                     K2Node_Event_Info;                                 // 0x0060(0x0010)(ConstParm, ReferenceParm)
	const class UGameAbilityComponent*            K2Node_Event_lpInstigator;                         // 0x0070(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect) == 0x000008, "Wrong alignment on AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect");
static_assert(sizeof(AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect) == 0x000080, "Wrong size on AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect");
static_assert(offsetof(AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect, EntryPoint) == 0x000000, "Member 'AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect, K2Node_Event_Instigator) == 0x000008, "Member 'AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect::K2Node_Event_Instigator' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect, CallFunc_GetOriginCharacter_ReturnValue) == 0x000028, "Member 'AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect::CallFunc_GetOriginCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect, K2Node_CustomEvent_CurCharacter) == 0x000030, "Member 'AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect::K2Node_CustomEvent_CurCharacter' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect, K2Node_CustomEvent_InType) == 0x000038, "Member 'AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect::K2Node_CustomEvent_InType' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect, K2Node_CustomEvent_bSet) == 0x000039, "Member 'AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect::K2Node_CustomEvent_bSet' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect, CallFunc_IsValid_ReturnValue_1) == 0x00003A, "Member 'AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect, CallFunc_IsInAim_ReturnValue) == 0x00003B, "Member 'AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect::CallFunc_IsInAim_ReturnValue' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect, CallFunc_Not_PreBool_ReturnValue) == 0x00003C, "Member 'AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect, CallFunc_IsValid_ReturnValue_2) == 0x00003D, "Member 'AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect, CallFunc_GetOriginCharacter_ReturnValue_1) == 0x000040, "Member 'AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect::CallFunc_GetOriginCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect, CallFunc_IsValid_ReturnValue_3) == 0x000048, "Member 'AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect, K2Node_Event_Pawn) == 0x000050, "Member 'AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect::K2Node_Event_Pawn' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect, CallFunc_BooleanAND_ReturnValue) == 0x000058, "Member 'AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect, CallFunc_BooleanAND_ReturnValue_1) == 0x000059, "Member 'AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect, K2Node_Event_Info) == 0x000060, "Member 'AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect::K2Node_Event_Info' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect, K2Node_Event_lpInstigator) == 0x000070, "Member 'AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect::K2Node_Event_lpInstigator' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect, CallFunc_Greater_IntInt_ReturnValue) == 0x00007C, "Member 'AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect, K2Node_SwitchString_CmpSuccess) == 0x00007D, "Member 'AllBulletEffect_C_ExecuteUbergraph_AllBulletEffect::K2Node_SwitchString_CmpSuccess' has a wrong offset!");

}

