#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AllBulletEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AllBulletEffect.AllBulletEffect_C
// 0x0018 (0x0170 - 0x0158)
class UAllBulletEffect_C final : public UWeaponBulletEffectBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0158(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         NextBulletCount;                                   // 0x0160(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpawnBulletCount;                                  // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOnlyAim;                                          // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bOnlyNormal;                                       // 0x0169(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void CheckActive(ECharacterActionState InState, bool bSet);
	void K2_ReceiveActive(const class UObject* Instigator);
	void OnPlayerActionFlay(class AGameCharacter* CurCharacter, ECharacterActionState InType, bool bSet);
	void K2_ReceiveDeActive(const class UGameAbilityComponent* Pawn);
	void K2_ReceiveInitialize(const TArray<struct FParamInfo>& Info, const class UGameAbilityComponent* lpInstigator);
	void ExecuteUbergraph_AllBulletEffect(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AllBulletEffect_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AllBulletEffect_C")
	}
	static class UAllBulletEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAllBulletEffect_C>();
	}
};
DUMPER7_ASSERTS_UAllBulletEffect_C;

}

