#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AN_ShowArrow

#include "Basic.hpp"


namespace SDK::Params
{

// Function AN_ShowArrow.AN_ShowArrow_C.Received_Notify
// 0x00B0 (0x00B0 - 0x0000)
struct AN_ShowArrow_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Girl_Preview_Base_C*                K2Node_DynamicCast_AsBP_Girl_Preview_Base;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x0040(0x0010)(ReferenceParm)
	class ABaseCharacter_C*                       K2Node_DynamicCast_AsBase_Character;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABp_wpbase_wp08_preview_C*              K2Node_DynamicCast_AsBp_Wpbase_Wp_08_Preview;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsModifierExist_ReturnValue;              // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73[0x1];                                       // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerWeapon*                          CallFunc_GetWeapon_ReturnValue;                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMesh_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeaponBase_Bow_C*                      K2Node_DynamicCast_AsWeapon_Base_Bow;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_SpawnAttachedPath_ReturnValue;            // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AN_ShowArrow_C_Received_Notify) == 0x000008, "Wrong alignment on AN_ShowArrow_C_Received_Notify");
static_assert(sizeof(AN_ShowArrow_C_Received_Notify) == 0x0000B0, "Wrong size on AN_ShowArrow_C_Received_Notify");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, MeshComp) == 0x000000, "Member 'AN_ShowArrow_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, Animation) == 0x000008, "Member 'AN_ShowArrow_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, ReturnValue) == 0x000010, "Member 'AN_ShowArrow_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, ___int_Array_Index_Variable) == 0x000014, "Member 'AN_ShowArrow_C_Received_Notify::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'AN_ShowArrow_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, K2Node_DynamicCast_AsBP_Girl_Preview_Base) == 0x000020, "Member 'AN_ShowArrow_C_Received_Notify::K2Node_DynamicCast_AsBP_Girl_Preview_Base' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AN_ShowArrow_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, K2Node_DynamicCast_AsGame_Player) == 0x000030, "Member 'AN_ShowArrow_C_Received_Notify::K2Node_DynamicCast_AsGame_Player' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'AN_ShowArrow_C_Received_Notify::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, CallFunc_GetAttachedActors_OutActors) == 0x000040, "Member 'AN_ShowArrow_C_Received_Notify::CallFunc_GetAttachedActors_OutActors' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, K2Node_DynamicCast_AsBase_Character) == 0x000050, "Member 'AN_ShowArrow_C_Received_Notify::K2Node_DynamicCast_AsBase_Character' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'AN_ShowArrow_C_Received_Notify::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, CallFunc_Array_Get_Item) == 0x000060, "Member 'AN_ShowArrow_C_Received_Notify::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, K2Node_DynamicCast_AsBp_Wpbase_Wp_08_Preview) == 0x000068, "Member 'AN_ShowArrow_C_Received_Notify::K2Node_DynamicCast_AsBp_Wpbase_Wp_08_Preview' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, K2Node_DynamicCast_bSuccess_3) == 0x000070, "Member 'AN_ShowArrow_C_Received_Notify::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, CallFunc_IsModifierExist_ReturnValue) == 0x000071, "Member 'AN_ShowArrow_C_Received_Notify::CallFunc_IsModifierExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000072, "Member 'AN_ShowArrow_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'AN_ShowArrow_C_Received_Notify::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, CallFunc_GetWeapon_ReturnValue) == 0x000078, "Member 'AN_ShowArrow_C_Received_Notify::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, ___int_Loop_Counter_Variable) == 0x000080, "Member 'AN_ShowArrow_C_Received_Notify::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, CallFunc_GetSkeletalMesh_ReturnValue) == 0x000088, "Member 'AN_ShowArrow_C_Received_Notify::CallFunc_GetSkeletalMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'AN_ShowArrow_C_Received_Notify::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'AN_ShowArrow_C_Received_Notify::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, K2Node_DynamicCast_AsWeapon_Base_Bow) == 0x000098, "Member 'AN_ShowArrow_C_Received_Notify::K2Node_DynamicCast_AsWeapon_Base_Bow' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, K2Node_DynamicCast_bSuccess_4) == 0x0000A0, "Member 'AN_ShowArrow_C_Received_Notify::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, CallFunc_IsValid_ReturnValue_1) == 0x0000A1, "Member 'AN_ShowArrow_C_Received_Notify::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AN_ShowArrow_C_Received_Notify, CallFunc_SpawnAttachedPath_ReturnValue) == 0x0000A8, "Member 'AN_ShowArrow_C_Received_Notify::CallFunc_SpawnAttachedPath_ReturnValue' has a wrong offset!");

// Function AN_ShowArrow.AN_ShowArrow_C.GetNotifyName
// 0x0010 (0x0010 - 0x0000)
struct AN_ShowArrow_C_GetNotifyName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(AN_ShowArrow_C_GetNotifyName) == 0x000008, "Wrong alignment on AN_ShowArrow_C_GetNotifyName");
static_assert(sizeof(AN_ShowArrow_C_GetNotifyName) == 0x000010, "Wrong size on AN_ShowArrow_C_GetNotifyName");
static_assert(offsetof(AN_ShowArrow_C_GetNotifyName, ReturnValue) == 0x000000, "Member 'AN_ShowArrow_C_GetNotifyName::ReturnValue' has a wrong offset!");

}

