#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AN_ShowArrow

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AN_ShowArrow.AN_ShowArrow_C
// 0x0028 (0x0060 - 0x0038)
class UAN_ShowArrow_C final : public UAnimNotify
{
public:
	bool                                          bHide;                                             // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         PreFire;                                           // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        PrefireNiagara;                                    // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation) const;
	class FString GetNotifyName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AN_ShowArrow_C">();
	}
	static class UAN_ShowArrow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAN_ShowArrow_C>();
	}
};
static_assert(alignof(UAN_ShowArrow_C) == 0x000008, "Wrong alignment on UAN_ShowArrow_C");
static_assert(sizeof(UAN_ShowArrow_C) == 0x000060, "Wrong size on UAN_ShowArrow_C");
static_assert(offsetof(UAN_ShowArrow_C, bHide) == 0x000038, "Member 'UAN_ShowArrow_C::bHide' has a wrong offset!");
static_assert(offsetof(UAN_ShowArrow_C, PreFire) == 0x000040, "Member 'UAN_ShowArrow_C::PreFire' has a wrong offset!");
static_assert(offsetof(UAN_ShowArrow_C, PrefireNiagara) == 0x000048, "Member 'UAN_ShowArrow_C::PrefireNiagara' has a wrong offset!");

}

