#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotifyState_RefreshBones

#include "Basic.hpp"


namespace SDK::Params
{

// Function AnimNotifyState_RefreshBones.AnimNotifyState_RefreshBones_C.ReceiveStop
// 0x0020 (0x0020 - 0x0000)
struct AnimNotifyState_RefreshBones_C_ReceiveStop final
{
public:
	class AActor*                                 Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AGameSkill*                       GameSkillRef;                                      // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HashValue;                                         // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimNotifyState_RefreshBones_C_ReceiveStop) == 0x000008, "Wrong alignment on AnimNotifyState_RefreshBones_C_ReceiveStop");
static_assert(sizeof(AnimNotifyState_RefreshBones_C_ReceiveStop) == 0x000020, "Wrong size on AnimNotifyState_RefreshBones_C_ReceiveStop");
static_assert(offsetof(AnimNotifyState_RefreshBones_C_ReceiveStop, Character) == 0x000000, "Member 'AnimNotifyState_RefreshBones_C_ReceiveStop::Character' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_RefreshBones_C_ReceiveStop, Animation) == 0x000008, "Member 'AnimNotifyState_RefreshBones_C_ReceiveStop::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_RefreshBones_C_ReceiveStop, GameSkillRef) == 0x000010, "Member 'AnimNotifyState_RefreshBones_C_ReceiveStop::GameSkillRef' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_RefreshBones_C_ReceiveStop, HashValue) == 0x000018, "Member 'AnimNotifyState_RefreshBones_C_ReceiveStop::HashValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_RefreshBones_C_ReceiveStop, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'AnimNotifyState_RefreshBones_C_ReceiveStop::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AnimNotifyState_RefreshBones.AnimNotifyState_RefreshBones_C.ReceiveActive
// 0x0028 (0x0028 - 0x0000)
struct AnimNotifyState_RefreshBones_C_ReceiveActive final
{
public:
	class AActor*                                 Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      AnimSquence;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AGameSkill*                       GameSkillRef;                                      // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HashValue;                                         // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimNotifyState_RefreshBones_C_ReceiveActive) == 0x000008, "Wrong alignment on AnimNotifyState_RefreshBones_C_ReceiveActive");
static_assert(sizeof(AnimNotifyState_RefreshBones_C_ReceiveActive) == 0x000028, "Wrong size on AnimNotifyState_RefreshBones_C_ReceiveActive");
static_assert(offsetof(AnimNotifyState_RefreshBones_C_ReceiveActive, Character) == 0x000000, "Member 'AnimNotifyState_RefreshBones_C_ReceiveActive::Character' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_RefreshBones_C_ReceiveActive, AnimSquence) == 0x000008, "Member 'AnimNotifyState_RefreshBones_C_ReceiveActive::AnimSquence' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_RefreshBones_C_ReceiveActive, TotalDuration) == 0x000010, "Member 'AnimNotifyState_RefreshBones_C_ReceiveActive::TotalDuration' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_RefreshBones_C_ReceiveActive, GameSkillRef) == 0x000018, "Member 'AnimNotifyState_RefreshBones_C_ReceiveActive::GameSkillRef' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_RefreshBones_C_ReceiveActive, HashValue) == 0x000020, "Member 'AnimNotifyState_RefreshBones_C_ReceiveActive::HashValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_RefreshBones_C_ReceiveActive, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'AnimNotifyState_RefreshBones_C_ReceiveActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

