#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ApmSdk

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct ApmSdk.ApmRunInfoDetail
// 0x000C (0x000C - 0x0000)
struct FApmRunInfoDetail final
{
public:
	int32                                         Time;                                              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Upload_Enable;                                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FApmRunInfoDetail) == 0x000004, "Wrong alignment on FApmRunInfoDetail");
static_assert(sizeof(FApmRunInfoDetail) == 0x00000C, "Wrong size on FApmRunInfoDetail");
static_assert(offsetof(FApmRunInfoDetail, Time) == 0x000000, "Member 'FApmRunInfoDetail::Time' has a wrong offset!");
static_assert(offsetof(FApmRunInfoDetail, Count) == 0x000004, "Member 'FApmRunInfoDetail::Count' has a wrong offset!");
static_assert(offsetof(FApmRunInfoDetail, Upload_Enable) == 0x000008, "Member 'FApmRunInfoDetail::Upload_Enable' has a wrong offset!");

// ScriptStruct ApmSdk.ApmRunInfo
// 0x0038 (0x0038 - 0x0000)
struct FApmRunInfo final
{
public:
	int32                                         Ret;                                               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Err_msg;                                           // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FApmRunInfoDetail                      S_conf;                                            // 0x0018(0x000C)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Device_grade;                                      // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FApmRunInfo) == 0x000008, "Wrong alignment on FApmRunInfo");
static_assert(sizeof(FApmRunInfo) == 0x000038, "Wrong size on FApmRunInfo");
static_assert(offsetof(FApmRunInfo, Ret) == 0x000000, "Member 'FApmRunInfo::Ret' has a wrong offset!");
static_assert(offsetof(FApmRunInfo, Err_msg) == 0x000008, "Member 'FApmRunInfo::Err_msg' has a wrong offset!");
static_assert(offsetof(FApmRunInfo, S_conf) == 0x000018, "Member 'FApmRunInfo::S_conf' has a wrong offset!");
static_assert(offsetof(FApmRunInfo, Device_grade) == 0x000028, "Member 'FApmRunInfo::Device_grade' has a wrong offset!");

// ScriptStruct ApmSdk.ApmPlatformSettings
// 0x0018 (0x0018 - 0x0000)
struct FApmPlatformSettings final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AppKey;                                            // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FApmPlatformSettings) == 0x000008, "Wrong alignment on FApmPlatformSettings");
static_assert(sizeof(FApmPlatformSettings) == 0x000018, "Wrong size on FApmPlatformSettings");
static_assert(offsetof(FApmPlatformSettings, bEnabled) == 0x000000, "Member 'FApmPlatformSettings::bEnabled' has a wrong offset!");
static_assert(offsetof(FApmPlatformSettings, AppKey) == 0x000008, "Member 'FApmPlatformSettings::AppKey' has a wrong offset!");

}

