#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ApmSdk

#include "Basic.hpp"


namespace SDK::Params
{

// Function ApmSdk.ApmSubsystem.SetChannel
// 0x0010 (0x0010 - 0x0000)
struct ApmSubsystem_SetChannel final
{
public:
	class FString                                 InChannel;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ApmSubsystem_SetChannel) == 0x000008, "Wrong alignment on ApmSubsystem_SetChannel");
static_assert(sizeof(ApmSubsystem_SetChannel) == 0x000010, "Wrong size on ApmSubsystem_SetChannel");
static_assert(offsetof(ApmSubsystem_SetChannel, InChannel) == 0x000000, "Member 'ApmSubsystem_SetChannel::InChannel' has a wrong offset!");

// Function ApmSdk.ApmSubsystem.SetDeviceProfileLevel
// 0x0004 (0x0004 - 0x0000)
struct ApmSubsystem_SetDeviceProfileLevel final
{
public:
	int32                                         InLevel;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ApmSubsystem_SetDeviceProfileLevel) == 0x000004, "Wrong alignment on ApmSubsystem_SetDeviceProfileLevel");
static_assert(sizeof(ApmSubsystem_SetDeviceProfileLevel) == 0x000004, "Wrong size on ApmSubsystem_SetDeviceProfileLevel");
static_assert(offsetof(ApmSubsystem_SetDeviceProfileLevel, InLevel) == 0x000000, "Member 'ApmSubsystem_SetDeviceProfileLevel::InLevel' has a wrong offset!");

// Function ApmSdk.ApmSubsystem.SetGraphicsQuality
// 0x0004 (0x0004 - 0x0000)
struct ApmSubsystem_SetGraphicsQuality final
{
public:
	int32                                         InQuality;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ApmSubsystem_SetGraphicsQuality) == 0x000004, "Wrong alignment on ApmSubsystem_SetGraphicsQuality");
static_assert(sizeof(ApmSubsystem_SetGraphicsQuality) == 0x000004, "Wrong size on ApmSubsystem_SetGraphicsQuality");
static_assert(offsetof(ApmSubsystem_SetGraphicsQuality, InQuality) == 0x000000, "Member 'ApmSubsystem_SetGraphicsQuality::InQuality' has a wrong offset!");

// Function ApmSdk.ApmSubsystem.SetGraphicsQualityDetail
// 0x0008 (0x0008 - 0x0000)
struct ApmSubsystem_SetGraphicsQualityDetail final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InValue;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ApmSubsystem_SetGraphicsQualityDetail) == 0x000004, "Wrong alignment on ApmSubsystem_SetGraphicsQualityDetail");
static_assert(sizeof(ApmSubsystem_SetGraphicsQualityDetail) == 0x000008, "Wrong size on ApmSubsystem_SetGraphicsQualityDetail");
static_assert(offsetof(ApmSubsystem_SetGraphicsQualityDetail, InIndex) == 0x000000, "Member 'ApmSubsystem_SetGraphicsQualityDetail::InIndex' has a wrong offset!");
static_assert(offsetof(ApmSubsystem_SetGraphicsQualityDetail, InValue) == 0x000004, "Member 'ApmSubsystem_SetGraphicsQualityDetail::InValue' has a wrong offset!");

// Function ApmSdk.ApmSubsystem.SetGraphicsQualityDetails
// 0x0010 (0x0010 - 0x0000)
struct ApmSubsystem_SetGraphicsQualityDetails final
{
public:
	TArray<int32>                                 InQualityDetails;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ApmSubsystem_SetGraphicsQualityDetails) == 0x000008, "Wrong alignment on ApmSubsystem_SetGraphicsQualityDetails");
static_assert(sizeof(ApmSubsystem_SetGraphicsQualityDetails) == 0x000010, "Wrong size on ApmSubsystem_SetGraphicsQualityDetails");
static_assert(offsetof(ApmSubsystem_SetGraphicsQualityDetails, InQualityDetails) == 0x000000, "Member 'ApmSubsystem_SetGraphicsQualityDetails::InQualityDetails' has a wrong offset!");

// Function ApmSdk.ApmSubsystem.SetRoleName
// 0x0010 (0x0010 - 0x0000)
struct ApmSubsystem_SetRoleName final
{
public:
	class FString                                 InRoleName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ApmSubsystem_SetRoleName) == 0x000008, "Wrong alignment on ApmSubsystem_SetRoleName");
static_assert(sizeof(ApmSubsystem_SetRoleName) == 0x000010, "Wrong size on ApmSubsystem_SetRoleName");
static_assert(offsetof(ApmSubsystem_SetRoleName, InRoleName) == 0x000000, "Member 'ApmSubsystem_SetRoleName::InRoleName' has a wrong offset!");

// Function ApmSdk.ApmSubsystem.SetUserAccount
// 0x0010 (0x0010 - 0x0000)
struct ApmSubsystem_SetUserAccount final
{
public:
	class FString                                 InUserAccount;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ApmSubsystem_SetUserAccount) == 0x000008, "Wrong alignment on ApmSubsystem_SetUserAccount");
static_assert(sizeof(ApmSubsystem_SetUserAccount) == 0x000010, "Wrong size on ApmSubsystem_SetUserAccount");
static_assert(offsetof(ApmSubsystem_SetUserAccount, InUserAccount) == 0x000000, "Member 'ApmSubsystem_SetUserAccount::InUserAccount' has a wrong offset!");

}

