#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ApmSdk

#include "Basic.hpp"

#include "ApmSdk_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class ApmSdk.ApmSettings
// 0x0098 (0x00C0 - 0x0028)
class UApmSettings final : public UObject
{
public:
	class FString                                 AppID;                                             // 0x0028(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReportURL;                                         // 0x0038(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReportURLOversea;                                  // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ConfigURL;                                         // 0x0058(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ConfigURLOversea;                                  // 0x0068(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FApmPlatformSettings                   Windows;                                           // 0x0078(0x0018)(Edit, Config, NativeAccessSpecifierPublic)
	struct FApmPlatformSettings                   Android;                                           // 0x0090(0x0018)(Edit, Config, NativeAccessSpecifierPublic)
	struct FApmPlatformSettings                   IOS;                                               // 0x00A8(0x0018)(Edit, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ApmSettings">();
	}
	static class UApmSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UApmSettings>();
	}
};
static_assert(alignof(UApmSettings) == 0x000008, "Wrong alignment on UApmSettings");
static_assert(sizeof(UApmSettings) == 0x0000C0, "Wrong size on UApmSettings");
static_assert(offsetof(UApmSettings, AppID) == 0x000028, "Member 'UApmSettings::AppID' has a wrong offset!");
static_assert(offsetof(UApmSettings, ReportURL) == 0x000038, "Member 'UApmSettings::ReportURL' has a wrong offset!");
static_assert(offsetof(UApmSettings, ReportURLOversea) == 0x000048, "Member 'UApmSettings::ReportURLOversea' has a wrong offset!");
static_assert(offsetof(UApmSettings, ConfigURL) == 0x000058, "Member 'UApmSettings::ConfigURL' has a wrong offset!");
static_assert(offsetof(UApmSettings, ConfigURLOversea) == 0x000068, "Member 'UApmSettings::ConfigURLOversea' has a wrong offset!");
static_assert(offsetof(UApmSettings, Windows) == 0x000078, "Member 'UApmSettings::Windows' has a wrong offset!");
static_assert(offsetof(UApmSettings, Android) == 0x000090, "Member 'UApmSettings::Android' has a wrong offset!");
static_assert(offsetof(UApmSettings, IOS) == 0x0000A8, "Member 'UApmSettings::IOS' has a wrong offset!");

// Class ApmSdk.ApmSubsystem
// 0x0398 (0x03C8 - 0x0030)
class UApmSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x398];                                     // 0x0030(0x0398)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void SetChannel(const class FString& InChannel);
	static void SetDeviceProfileLevel(int32 InLevel);
	static void SetGraphicsQuality(int32 InQuality);
	static void SetGraphicsQualityDetail(int32 InIndex, int32 InValue);
	static void SetGraphicsQualityDetails(const TArray<int32>& InQualityDetails);
	static void SetRoleName(const class FString& InRoleName);
	static void SetUserAccount(const class FString& InUserAccount);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ApmSubsystem">();
	}
	static class UApmSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UApmSubsystem>();
	}
};
static_assert(alignof(UApmSubsystem) == 0x000008, "Wrong alignment on UApmSubsystem");
static_assert(sizeof(UApmSubsystem) == 0x0003C8, "Wrong size on UApmSubsystem");

}

