#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ApplyHit_TargetControType

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "ApplyHit_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ApplyHit_TargetControType.ApplyHit_TargetControType_C
// 0x0028 (0x0138 - 0x0110)
class UApplyHit_TargetControType_C final : public UApplyHit_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0110(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAbilityComponentBase*                  Target;                                            // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ControType;                                        // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayTag                           ControTag;                                         // 0x0130(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void K2_InitCondition();
	void FindModifierTag(class UAbilityComponentBase* InAbility, const struct FGameplayTag& InTag, bool* bHave);
	bool OnReceiveNotify(bool bApplyHit, const struct FApplyHitResultData& HitData);
	void ExecuteUbergraph_ApplyHit_TargetControType(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ApplyHit_TargetControType_C">();
	}
	static class UApplyHit_TargetControType_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UApplyHit_TargetControType_C>();
	}
};
static_assert(alignof(UApplyHit_TargetControType_C) == 0x000008, "Wrong alignment on UApplyHit_TargetControType_C");
static_assert(sizeof(UApplyHit_TargetControType_C) == 0x000138, "Wrong size on UApplyHit_TargetControType_C");
static_assert(offsetof(UApplyHit_TargetControType_C, UberGraphFrame) == 0x000110, "Member 'UApplyHit_TargetControType_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UApplyHit_TargetControType_C, Target) == 0x000118, "Member 'UApplyHit_TargetControType_C::Target' has a wrong offset!");
static_assert(offsetof(UApplyHit_TargetControType_C, ControType) == 0x000120, "Member 'UApplyHit_TargetControType_C::ControType' has a wrong offset!");
static_assert(offsetof(UApplyHit_TargetControType_C, ControTag) == 0x000130, "Member 'UApplyHit_TargetControType_C::ControTag' has a wrong offset!");

}

