#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: area02_02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass area02_02.area02_02_C
// 0x0040 (0x0270 - 0x0230)
class Aarea02_02_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class Agear001_01_bp_C*                       Zero2_switch_06_ExecuteUbergraph_area02_02_RefProperty; // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Agear001_01_bp_C*                       Zero2_switch_01_ExecuteUbergraph_area02_02_RefProperty; // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Agear001_01_bp_C*                       Zero2_switch_02_ExecuteUbergraph_area02_02_RefProperty; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Agear001_01_bp_C*                       Zero2_switch_03_ExecuteUbergraph_area02_02_RefProperty; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Agear001_01_bp_C*                       Zero2_switch_04_ExecuteUbergraph_area02_02_RefProperty; // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Agear001_01_bp_C*                       Zero2_switch_05_ExecuteUbergraph_area02_02_RefProperty; // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Agear001_01_bp_C*                       Zero2_switch_07_ExecuteUbergraph_area02_02_RefProperty; // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void Zero2_switch_01();
	void Zero2_switch_02();
	void Zero2_switch_03();
	void Zero2_switch_04();
	void Zero2_switch_05();
	void Zero2_switch_06();
	void Zero2_switch_07();
	void ExecuteUbergraph_area02_02(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("area02_02_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"area02_02_C")
	}
	static class Aarea02_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Aarea02_02_C>();
	}
};
DUMPER7_ASSERTS_Aarea02_02_C;

}

