#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: area02_05

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass area02_05.area02_05_C
// 0x0098 (0x02C8 - 0x0230)
class Aarea02_05_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class Agear001_01_bp_C*                       Zero5_switch_01_ExecuteUbergraph_area02_05_RefProperty; // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Agear001_01_bp_C*                       Zero5_switch_02_ExecuteUbergraph_area02_05_RefProperty; // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Agear001_01_bp_C*                       Zero5_switch_03_ExecuteUbergraph_area02_05_RefProperty; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Agear001_01_bp_C*                       Zero5_switch_04_ExecuteUbergraph_area02_05_RefProperty; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Agear001_01_bp_C*                       Zero5_switch_05_ExecuteUbergraph_area02_05_RefProperty; // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Agear001_01_bp_C*                       Zero5_switch_06_ExecuteUbergraph_area02_05_RefProperty; // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Agear001_01_bp_C*                       Zero5_switch_07_ExecuteUbergraph_area02_05_RefProperty; // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Agear001_01_bp_C*                       Zero5_switch_08_ExecuteUbergraph_area02_05_RefProperty; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Agear001_01_bp_C*                       Zero5_switch_10_ExecuteUbergraph_area02_05_RefProperty; // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Agear001_01_bp_C*                       Zero5_switch_11_ExecuteUbergraph_area02_05_RefProperty; // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Agear001_01_bp_C*                       Zero5_switch_12_ExecuteUbergraph_area02_05_RefProperty; // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Agear001_01_bp_C*                       Zero5_switch_13_ExecuteUbergraph_area02_05_RefProperty; // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Agear001_01_bp_C*                       Zero5_switch_14_ExecuteUbergraph_area02_05_RefProperty; // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Agear001_01_bp_C*                       Zero5_switch_15_ExecuteUbergraph_area02_05_RefProperty; // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Agear001_01_bp_C*                       Zero5_switch_16_ExecuteUbergraph_area02_05_RefProperty; // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Agear001_01_bp_C*                       Zero5_switch_17_ExecuteUbergraph_area02_05_RefProperty; // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Agear001_01_bp_C*                       Zero5_switch_18_ExecuteUbergraph_area02_05_RefProperty; // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Agear001_01_bp_C*                       Zero5_switch_19_ExecuteUbergraph_area02_05_RefProperty; // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Zero5_switch_02();
	void Zero5_switch_03();
	void Zero5_switch_04();
	void Zero5_switch_05();
	void Zero5_switch_06();
	void Zero5_switch_07();
	void Zero5_switch_08();
	void Zero5_switch_09();
	void Zero5_switch_10();
	void Zero5_switch_11();
	void Zero5_switch_12();
	void Zero5_switch_13();
	void Zero5_switch_14();
	void Zero5_switch_15();
	void Zero5_switch_16();
	void Zero5_switch_17();
	void Zero5_switch_18();
	void Zero5_switch_19();
	void Zero5_switch_01();
	void ExecuteUbergraph_area02_05(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("area02_05_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"area02_05_C")
	}
	static class Aarea02_05_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Aarea02_05_C>();
	}
};
DUMPER7_ASSERTS_Aarea02_05_C;

}

