#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Area16

#include "Basic.hpp"


namespace SDK::Params
{

// Function area16.area16_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Area16_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Area16_C_ReceiveTick) == 0x000004, "Wrong alignment on Area16_C_ReceiveTick");
static_assert(sizeof(Area16_C_ReceiveTick) == 0x000004, "Wrong size on Area16_C_ReceiveTick");
static_assert(offsetof(Area16_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Area16_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function area16.area16_C.ExecuteUbergraph_area16
// 0x0008 (0x0008 - 0x0000)
struct Area16_C_ExecuteUbergraph_area16 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Area16_C_ExecuteUbergraph_area16) == 0x000004, "Wrong alignment on Area16_C_ExecuteUbergraph_area16");
static_assert(sizeof(Area16_C_ExecuteUbergraph_area16) == 0x000008, "Wrong size on Area16_C_ExecuteUbergraph_area16");
static_assert(offsetof(Area16_C_ExecuteUbergraph_area16, EntryPoint) == 0x000000, "Member 'Area16_C_ExecuteUbergraph_area16::EntryPoint' has a wrong offset!");
static_assert(offsetof(Area16_C_ExecuteUbergraph_area16, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Area16_C_ExecuteUbergraph_area16::K2Node_Event_DeltaSeconds' has a wrong offset!");

}

