#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AreaTrigger

#include "Basic.hpp"


namespace SDK::Params
{

// LuaFunction AreaTrigger.AreaTrigger_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct AreaTrigger_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AreaTrigger_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on AreaTrigger_C_ReceiveActorEndOverlap");
static_assert(sizeof(AreaTrigger_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on AreaTrigger_C_ReceiveActorEndOverlap");
static_assert(offsetof(AreaTrigger_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'AreaTrigger_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// LuaFunction AreaTrigger.AreaTrigger_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct AreaTrigger_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AreaTrigger_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on AreaTrigger_C_ReceiveActorBeginOverlap");
static_assert(sizeof(AreaTrigger_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on AreaTrigger_C_ReceiveActorBeginOverlap");
static_assert(offsetof(AreaTrigger_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'AreaTrigger_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function AreaTrigger.AreaTrigger_C.ActiveEffect
// 0x0001 (0x0001 - 0x0000)
struct AreaTrigger_C_ActiveEffect final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AreaTrigger_C_ActiveEffect) == 0x000001, "Wrong alignment on AreaTrigger_C_ActiveEffect");
static_assert(sizeof(AreaTrigger_C_ActiveEffect) == 0x000001, "Wrong size on AreaTrigger_C_ActiveEffect");
static_assert(offsetof(AreaTrigger_C_ActiveEffect, IsActive) == 0x000000, "Member 'AreaTrigger_C_ActiveEffect::IsActive' has a wrong offset!");

// Function AreaTrigger.AreaTrigger_C.IsOverLap
// 0x0040 (0x0040 - 0x0000)
struct AreaTrigger_C_IsOverLap final
{
public:
	bool                                          bOverlap;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AreaTrigger_C_IsOverLap) == 0x000008, "Wrong alignment on AreaTrigger_C_IsOverLap");
static_assert(sizeof(AreaTrigger_C_IsOverLap) == 0x000040, "Wrong size on AreaTrigger_C_IsOverLap");
static_assert(offsetof(AreaTrigger_C_IsOverLap, bOverlap) == 0x000000, "Member 'AreaTrigger_C_IsOverLap::bOverlap' has a wrong offset!");
static_assert(offsetof(AreaTrigger_C_IsOverLap, ___int_Array_Index_Variable) == 0x000004, "Member 'AreaTrigger_C_IsOverLap::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AreaTrigger_C_IsOverLap, ___int_Loop_Counter_Variable) == 0x000008, "Member 'AreaTrigger_C_IsOverLap::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AreaTrigger_C_IsOverLap, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'AreaTrigger_C_IsOverLap::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AreaTrigger_C_IsOverLap, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000010, "Member 'AreaTrigger_C_IsOverLap::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(AreaTrigger_C_IsOverLap, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000018, "Member 'AreaTrigger_C_IsOverLap::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(AreaTrigger_C_IsOverLap, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'AreaTrigger_C_IsOverLap::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AreaTrigger_C_IsOverLap, CallFunc_Array_Get_Item) == 0x000030, "Member 'AreaTrigger_C_IsOverLap::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AreaTrigger_C_IsOverLap, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'AreaTrigger_C_IsOverLap::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AreaTrigger_C_IsOverLap, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000039, "Member 'AreaTrigger_C_IsOverLap::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function AreaTrigger.AreaTrigger_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct AreaTrigger_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(AreaTrigger_C_GetModuleName) == 0x000008, "Wrong alignment on AreaTrigger_C_GetModuleName");
static_assert(sizeof(AreaTrigger_C_GetModuleName) == 0x000010, "Wrong size on AreaTrigger_C_GetModuleName");
static_assert(offsetof(AreaTrigger_C_GetModuleName, ReturnValue) == 0x000000, "Member 'AreaTrigger_C_GetModuleName::ReturnValue' has a wrong offset!");

}

