#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Area16_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass area16_01.area16_01_C
// 0x0028 (0x0250 - 0x0228)
class AArea16_01_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AGear001_03_bp_C*                       Gear001_03_bp2_ExecuteUbergraph_area16_01_RefProperty; // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGear001_03_bp_C*                       Gear001_03_bp3_ExecuteUbergraph_area16_01_RefProperty; // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGear001_03_bp_C*                       Gear001_03_bp4_ExecuteUbergraph_area16_01_RefProperty; // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGear001_03_bp_C*                       Gear001_03_bp5_ExecuteUbergraph_area16_01_RefProperty; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Gear001_03_bp3();
	void Gear001_03_bp2();
	void Gear001_03_bp4();
	void Gear001_03_bp5();
	void ExecuteUbergraph_area16_01(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"area16_01_C">();
	}
	static class AArea16_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AArea16_01_C>();
	}
};
static_assert(alignof(AArea16_01_C) == 0x000008, "Wrong alignment on AArea16_01_C");
static_assert(sizeof(AArea16_01_C) == 0x000250, "Wrong size on AArea16_01_C");
static_assert(offsetof(AArea16_01_C, UberGraphFrame) == 0x000228, "Member 'AArea16_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AArea16_01_C, Gear001_03_bp2_ExecuteUbergraph_area16_01_RefProperty) == 0x000230, "Member 'AArea16_01_C::Gear001_03_bp2_ExecuteUbergraph_area16_01_RefProperty' has a wrong offset!");
static_assert(offsetof(AArea16_01_C, Gear001_03_bp3_ExecuteUbergraph_area16_01_RefProperty) == 0x000238, "Member 'AArea16_01_C::Gear001_03_bp3_ExecuteUbergraph_area16_01_RefProperty' has a wrong offset!");
static_assert(offsetof(AArea16_01_C, Gear001_03_bp4_ExecuteUbergraph_area16_01_RefProperty) == 0x000240, "Member 'AArea16_01_C::Gear001_03_bp4_ExecuteUbergraph_area16_01_RefProperty' has a wrong offset!");
static_assert(offsetof(AArea16_01_C, Gear001_03_bp5_ExecuteUbergraph_area16_01_RefProperty) == 0x000248, "Member 'AArea16_01_C::Gear001_03_bp5_ExecuteUbergraph_area16_01_RefProperty' has a wrong offset!");

}

