#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AreaEffectTrigger

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AreaEffectTrigger.AreaEffectTrigger_C.SpawnEffect
// 0x00A8 (0x00A8 - 0x0000)
struct AreaEffectTrigger_C_SpawnEffect final
{
public:
	struct FLinearColor                           Color2;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color1;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_2;    // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_3;    // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_2;      // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_3;      // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AreaEffectTrigger_C_SpawnEffect) == 0x000008, "Wrong alignment on AreaEffectTrigger_C_SpawnEffect");
static_assert(sizeof(AreaEffectTrigger_C_SpawnEffect) == 0x0000A8, "Wrong size on AreaEffectTrigger_C_SpawnEffect");
static_assert(offsetof(AreaEffectTrigger_C_SpawnEffect, Color2) == 0x000000, "Member 'AreaEffectTrigger_C_SpawnEffect::Color2' has a wrong offset!");
static_assert(offsetof(AreaEffectTrigger_C_SpawnEffect, Color1) == 0x000010, "Member 'AreaEffectTrigger_C_SpawnEffect::Color1' has a wrong offset!");
static_assert(offsetof(AreaEffectTrigger_C_SpawnEffect, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000020, "Member 'AreaEffectTrigger_C_SpawnEffect::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AreaEffectTrigger_C_SpawnEffect, CallFunc_K2_GetComponentRotation_ReturnValue_1) == 0x00002C, "Member 'AreaEffectTrigger_C_SpawnEffect::CallFunc_K2_GetComponentRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AreaEffectTrigger_C_SpawnEffect, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000038, "Member 'AreaEffectTrigger_C_SpawnEffect::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AreaEffectTrigger_C_SpawnEffect, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000044, "Member 'AreaEffectTrigger_C_SpawnEffect::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AreaEffectTrigger_C_SpawnEffect, CallFunc_K2_GetComponentRotation_ReturnValue_2) == 0x000050, "Member 'AreaEffectTrigger_C_SpawnEffect::CallFunc_K2_GetComponentRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AreaEffectTrigger_C_SpawnEffect, CallFunc_K2_GetComponentRotation_ReturnValue_3) == 0x00005C, "Member 'AreaEffectTrigger_C_SpawnEffect::CallFunc_K2_GetComponentRotation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AreaEffectTrigger_C_SpawnEffect, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000068, "Member 'AreaEffectTrigger_C_SpawnEffect::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AreaEffectTrigger_C_SpawnEffect, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x000074, "Member 'AreaEffectTrigger_C_SpawnEffect::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AreaEffectTrigger_C_SpawnEffect, K2Node_SwitchInteger_CmpSuccess) == 0x000080, "Member 'AreaEffectTrigger_C_SpawnEffect::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AreaEffectTrigger_C_SpawnEffect, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000088, "Member 'AreaEffectTrigger_C_SpawnEffect::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AreaEffectTrigger_C_SpawnEffect, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x000090, "Member 'AreaEffectTrigger_C_SpawnEffect::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AreaEffectTrigger_C_SpawnEffect, CallFunc_SpawnSystemAtLocation_ReturnValue_2) == 0x000098, "Member 'AreaEffectTrigger_C_SpawnEffect::CallFunc_SpawnSystemAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AreaEffectTrigger_C_SpawnEffect, CallFunc_SpawnSystemAtLocation_ReturnValue_3) == 0x0000A0, "Member 'AreaEffectTrigger_C_SpawnEffect::CallFunc_SpawnSystemAtLocation_ReturnValue_3' has a wrong offset!");

// Function AreaEffectTrigger.AreaEffectTrigger_C.ActiveEffect
// 0x0003 (0x0003 - 0x0000)
struct AreaEffectTrigger_C_ActiveEffect final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AreaEffectTrigger_C_ActiveEffect) == 0x000001, "Wrong alignment on AreaEffectTrigger_C_ActiveEffect");
static_assert(sizeof(AreaEffectTrigger_C_ActiveEffect) == 0x000003, "Wrong size on AreaEffectTrigger_C_ActiveEffect");
static_assert(offsetof(AreaEffectTrigger_C_ActiveEffect, IsActive) == 0x000000, "Member 'AreaEffectTrigger_C_ActiveEffect::IsActive' has a wrong offset!");
static_assert(offsetof(AreaEffectTrigger_C_ActiveEffect, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'AreaEffectTrigger_C_ActiveEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AreaEffectTrigger_C_ActiveEffect, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'AreaEffectTrigger_C_ActiveEffect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function AreaEffectTrigger.AreaEffectTrigger_C.ExecuteUbergraph_AreaEffectTrigger
// 0x0004 (0x0004 - 0x0000)
struct AreaEffectTrigger_C_ExecuteUbergraph_AreaEffectTrigger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AreaEffectTrigger_C_ExecuteUbergraph_AreaEffectTrigger) == 0x000004, "Wrong alignment on AreaEffectTrigger_C_ExecuteUbergraph_AreaEffectTrigger");
static_assert(sizeof(AreaEffectTrigger_C_ExecuteUbergraph_AreaEffectTrigger) == 0x000004, "Wrong size on AreaEffectTrigger_C_ExecuteUbergraph_AreaEffectTrigger");
static_assert(offsetof(AreaEffectTrigger_C_ExecuteUbergraph_AreaEffectTrigger, EntryPoint) == 0x000000, "Member 'AreaEffectTrigger_C_ExecuteUbergraph_AreaEffectTrigger::EntryPoint' has a wrong offset!");

// LuaFunction AreaEffectTrigger.AreaEffectTrigger_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct AreaEffectTrigger_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AreaEffectTrigger_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on AreaEffectTrigger_C_ReceiveActorBeginOverlap");
static_assert(sizeof(AreaEffectTrigger_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on AreaEffectTrigger_C_ReceiveActorBeginOverlap");
static_assert(offsetof(AreaEffectTrigger_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'AreaEffectTrigger_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// LuaFunction AreaEffectTrigger.AreaEffectTrigger_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct AreaEffectTrigger_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AreaEffectTrigger_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on AreaEffectTrigger_C_ReceiveActorEndOverlap");
static_assert(sizeof(AreaEffectTrigger_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on AreaEffectTrigger_C_ReceiveActorEndOverlap");
static_assert(offsetof(AreaEffectTrigger_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'AreaEffectTrigger_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

}

