#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AttributeAgentInstance

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AttributeAgentInstance.AttributeAgentInstance_C
// 0x00B8 (0x01B8 - 0x0100)
class UAttributeAgentInstance_C final : public UAbilityAttributeAgent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0100(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCurveFloat*                            EnergyStrengthCurve;                               // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystem*>                EnergyFullEmitter;                                 // 0x0110(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UParticleSystem*                        EnergyEmitter;                                     // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               EnergyEmitterRef;                                  // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             EnergySound;                                       // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        EnergySoundRef;                                    // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            BurnStrengthCurve;                                 // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        BurnEmitter;                                       // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        BurnFullEmitter;                                   // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             BurnSound;                                         // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     BurnEmitterRef;                                    // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        BurnSoundRef;                                      // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               BurnEmitterFullRef;                                // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        BurnFullEmitter_2;                                 // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 EnergyFullWise;                                    // 0x0180(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 BurnFullWise;                                      // 0x0190(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UFXSystemComponent*>             EnergyFullEmitterRef;                              // 0x01A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         BurnOutlinePPValue;                                // 0x01B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterRenderStateType                     EnergyRenderStateType;                             // 0x01B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterRenderStateType                     BurnRenderStateType;                               // 0x01B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int32 AttributeLeaveEmpty(EAttributeAgentType Type, class UAbilityComponentBase* Ability, float CurrentEnergy, float MaxEnergy);
	int32 AttributeInit(EAttributeAgentType Type, class UAbilityComponentBase* Ability, float CurrentEnergy, float MaxEnergy);
	void Energy_AttributeInit(class UAbilityComponentBase* Ability, float CurrentValue, float MaxValue, int32* Index_0);
	void Energy_AttributeaLevelEmpty(class UAbilityComponentBase* Ability, float CurrentValue, float MaxValue, int32* Index_0);
	void Burn_AttributeInit(class UAbilityComponentBase* Ability, float CurrentValue, float MaxValue, int32* Index_0);
	void Burn_AttributeLeavelEmpty(class UAbilityComponentBase* Ability, float CurrentValue, float MaxValue, int32* Index_0);
	void AttributeEmpty(EAttributeAgentType Type, class UAbilityComponentBase* Ability, int32 Index_0);
	void AttributeFull(EAttributeAgentType Type, class UAbilityComponentBase* Ability, float CurrentEnergy, float MaxEnergy, int32 Index_0);
	void AttributeLeaveFull(EAttributeAgentType Type, class UAbilityComponentBase* Ability, float CurrentEnergy, float MaxEnergy, int32 Index_0);
	void AttributeTick(EAttributeAgentType Type, float DeltaTime, class UAbilityComponentBase* Ability, float CurrentEnergy, float MaxEnergy, int32 Index_0);
	void Burn_AttributeEmpty(class UAbilityComponentBase* Ability, int32 Index_0);
	void Burn_AttributeTick(float DeltaTime, class UAbilityComponentBase* Ability, float CurrentEnergy, float MaxEnergy, int32 Index_0);
	void Burn_AttributeLevelFull(class UAbilityComponentBase* Ability, float CurrentEnergy, float MaxEnergy, int32 Index_0);
	void Burn_AttributeFull(class UAbilityComponentBase* Ability, float CurrentEnergy, float MaxEnergy, int32 Index_0);
	void Energy_AttributeFull(class UAbilityComponentBase* Ability, float CurrentValue, float MaxValue, int32 Index_0);
	void Energy_AttributeTick(float DeltaTime, class UAbilityComponentBase* Ability, float CurrentValue, float MaxValue, int32 Index_0);
	void Energy_AttributeLevelFull(class UAbilityComponentBase* Ability, float CurrentEnergy, float MaxEnergy, int32 Index_0);
	void Energy_AttributeEmpty(class UAbilityComponentBase* Ability, int32 Index_0);
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_AttributeAgentInstance(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AttributeAgentInstance_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AttributeAgentInstance_C")
	}
	static class UAttributeAgentInstance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttributeAgentInstance_C>();
	}
};
DUMPER7_ASSERTS_UAttributeAgentInstance_C;

}

