#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AttributeAgentInstance

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AttributeAgentInstance.AttributeAgentInstance_C.AttributeLeaveEmpty
// 0x0028 (0x0028 - 0x0000)
struct AttributeAgentInstance_C_AttributeLeaveEmpty final
{
public:
	EAttributeAgentType                           Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  Ability;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentEnergy;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxEnergy;                                         // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Burn_AttributeLeavelEmpty_Index;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Energy_AttributeaLevelEmpty_Index;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AttributeAgentInstance_C_AttributeLeaveEmpty) == 0x000008, "Wrong alignment on AttributeAgentInstance_C_AttributeLeaveEmpty");
static_assert(sizeof(AttributeAgentInstance_C_AttributeLeaveEmpty) == 0x000028, "Wrong size on AttributeAgentInstance_C_AttributeLeaveEmpty");
static_assert(offsetof(AttributeAgentInstance_C_AttributeLeaveEmpty, Type) == 0x000000, "Member 'AttributeAgentInstance_C_AttributeLeaveEmpty::Type' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeLeaveEmpty, Ability) == 0x000008, "Member 'AttributeAgentInstance_C_AttributeLeaveEmpty::Ability' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeLeaveEmpty, CurrentEnergy) == 0x000010, "Member 'AttributeAgentInstance_C_AttributeLeaveEmpty::CurrentEnergy' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeLeaveEmpty, MaxEnergy) == 0x000014, "Member 'AttributeAgentInstance_C_AttributeLeaveEmpty::MaxEnergy' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeLeaveEmpty, ReturnValue) == 0x000018, "Member 'AttributeAgentInstance_C_AttributeLeaveEmpty::ReturnValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeLeaveEmpty, K2Node_SwitchEnum_CmpSuccess) == 0x00001C, "Member 'AttributeAgentInstance_C_AttributeLeaveEmpty::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeLeaveEmpty, CallFunc_Burn_AttributeLeavelEmpty_Index) == 0x000020, "Member 'AttributeAgentInstance_C_AttributeLeaveEmpty::CallFunc_Burn_AttributeLeavelEmpty_Index' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeLeaveEmpty, CallFunc_Energy_AttributeaLevelEmpty_Index) == 0x000024, "Member 'AttributeAgentInstance_C_AttributeLeaveEmpty::CallFunc_Energy_AttributeaLevelEmpty_Index' has a wrong offset!");

// Function AttributeAgentInstance.AttributeAgentInstance_C.AttributeInit
// 0x0028 (0x0028 - 0x0000)
struct AttributeAgentInstance_C_AttributeInit final
{
public:
	EAttributeAgentType                           Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  Ability;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentEnergy;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxEnergy;                                         // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Energy_AttributeInit_Index;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Burn_AttributeInit_Index;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AttributeAgentInstance_C_AttributeInit) == 0x000008, "Wrong alignment on AttributeAgentInstance_C_AttributeInit");
static_assert(sizeof(AttributeAgentInstance_C_AttributeInit) == 0x000028, "Wrong size on AttributeAgentInstance_C_AttributeInit");
static_assert(offsetof(AttributeAgentInstance_C_AttributeInit, Type) == 0x000000, "Member 'AttributeAgentInstance_C_AttributeInit::Type' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeInit, Ability) == 0x000008, "Member 'AttributeAgentInstance_C_AttributeInit::Ability' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeInit, CurrentEnergy) == 0x000010, "Member 'AttributeAgentInstance_C_AttributeInit::CurrentEnergy' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeInit, MaxEnergy) == 0x000014, "Member 'AttributeAgentInstance_C_AttributeInit::MaxEnergy' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeInit, ReturnValue) == 0x000018, "Member 'AttributeAgentInstance_C_AttributeInit::ReturnValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeInit, K2Node_SwitchEnum_CmpSuccess) == 0x00001C, "Member 'AttributeAgentInstance_C_AttributeInit::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeInit, CallFunc_Energy_AttributeInit_Index) == 0x000020, "Member 'AttributeAgentInstance_C_AttributeInit::CallFunc_Energy_AttributeInit_Index' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeInit, CallFunc_Burn_AttributeInit_Index) == 0x000024, "Member 'AttributeAgentInstance_C_AttributeInit::CallFunc_Burn_AttributeInit_Index' has a wrong offset!");

// Function AttributeAgentInstance.AttributeAgentInstance_C.Energy_AttributeInit
// 0x0088 (0x0088 - 0x0000)
struct AttributeAgentInstance_C_Energy_AttributeInit final
{
public:
	class UAbilityComponentBase*                  Ability;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentValue;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxValue;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAbilityCharacterInterface> K2Node_DynamicCast_AsAbility_Character_Interface;  // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ___object_Variable;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnGameEmitterAttached_ReturnValue;     // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_StartCharacterStateSimple_ReturnValue;    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AttributeAgentInstance_C_Energy_AttributeInit) == 0x000008, "Wrong alignment on AttributeAgentInstance_C_Energy_AttributeInit");
static_assert(sizeof(AttributeAgentInstance_C_Energy_AttributeInit) == 0x000088, "Wrong size on AttributeAgentInstance_C_Energy_AttributeInit");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeInit, Ability) == 0x000000, "Member 'AttributeAgentInstance_C_Energy_AttributeInit::Ability' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeInit, CurrentValue) == 0x000008, "Member 'AttributeAgentInstance_C_Energy_AttributeInit::CurrentValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeInit, MaxValue) == 0x00000C, "Member 'AttributeAgentInstance_C_Energy_AttributeInit::MaxValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeInit, Index_0) == 0x000010, "Member 'AttributeAgentInstance_C_Energy_AttributeInit::Index_0' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeInit, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'AttributeAgentInstance_C_Energy_AttributeInit::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeInit, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'AttributeAgentInstance_C_Energy_AttributeInit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeInit, CallFunc_GetOwner_ReturnValue_1) == 0x000028, "Member 'AttributeAgentInstance_C_Energy_AttributeInit::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeInit, K2Node_DynamicCast_AsAbility_Character_Interface) == 0x000030, "Member 'AttributeAgentInstance_C_Energy_AttributeInit::K2Node_DynamicCast_AsAbility_Character_Interface' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeInit, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'AttributeAgentInstance_C_Energy_AttributeInit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeInit, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'AttributeAgentInstance_C_Energy_AttributeInit::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeInit, CallFunc_GetOwnerActor_ReturnValue) == 0x000050, "Member 'AttributeAgentInstance_C_Energy_AttributeInit::CallFunc_GetOwnerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeInit, ___object_Variable) == 0x000058, "Member 'AttributeAgentInstance_C_Energy_AttributeInit::___object_Variable' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeInit, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000060, "Member 'AttributeAgentInstance_C_Energy_AttributeInit::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeInit, K2Node_DynamicCast_AsGame_Character) == 0x000068, "Member 'AttributeAgentInstance_C_Energy_AttributeInit::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeInit, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'AttributeAgentInstance_C_Energy_AttributeInit::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeInit, CallFunc_SpawnGameEmitterAttached_ReturnValue) == 0x000078, "Member 'AttributeAgentInstance_C_Energy_AttributeInit::CallFunc_SpawnGameEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeInit, CallFunc_StartCharacterStateSimple_ReturnValue) == 0x000080, "Member 'AttributeAgentInstance_C_Energy_AttributeInit::CallFunc_StartCharacterStateSimple_ReturnValue' has a wrong offset!");

// Function AttributeAgentInstance.AttributeAgentInstance_C.Energy_AttributeaLevelEmpty
// 0x0068 (0x0068 - 0x0000)
struct AttributeAgentInstance_C_Energy_AttributeaLevelEmpty final
{
public:
	class UAbilityComponentBase*                  Ability;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentValue;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxValue;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ___object_Variable;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAbilityCharacterInterface> K2Node_DynamicCast_AsAbility_Character_Interface;  // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_StartCharacterStateSimple_ReturnValue;    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AttributeAgentInstance_C_Energy_AttributeaLevelEmpty) == 0x000008, "Wrong alignment on AttributeAgentInstance_C_Energy_AttributeaLevelEmpty");
static_assert(sizeof(AttributeAgentInstance_C_Energy_AttributeaLevelEmpty) == 0x000068, "Wrong size on AttributeAgentInstance_C_Energy_AttributeaLevelEmpty");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeaLevelEmpty, Ability) == 0x000000, "Member 'AttributeAgentInstance_C_Energy_AttributeaLevelEmpty::Ability' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeaLevelEmpty, CurrentValue) == 0x000008, "Member 'AttributeAgentInstance_C_Energy_AttributeaLevelEmpty::CurrentValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeaLevelEmpty, MaxValue) == 0x00000C, "Member 'AttributeAgentInstance_C_Energy_AttributeaLevelEmpty::MaxValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeaLevelEmpty, Index_0) == 0x000010, "Member 'AttributeAgentInstance_C_Energy_AttributeaLevelEmpty::Index_0' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeaLevelEmpty, ___object_Variable) == 0x000018, "Member 'AttributeAgentInstance_C_Energy_AttributeaLevelEmpty::___object_Variable' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeaLevelEmpty, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'AttributeAgentInstance_C_Energy_AttributeaLevelEmpty::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeaLevelEmpty, K2Node_DynamicCast_AsGame_Character) == 0x000028, "Member 'AttributeAgentInstance_C_Energy_AttributeaLevelEmpty::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeaLevelEmpty, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AttributeAgentInstance_C_Energy_AttributeaLevelEmpty::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeaLevelEmpty, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'AttributeAgentInstance_C_Energy_AttributeaLevelEmpty::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeaLevelEmpty, K2Node_DynamicCast_AsAbility_Character_Interface) == 0x000040, "Member 'AttributeAgentInstance_C_Energy_AttributeaLevelEmpty::K2Node_DynamicCast_AsAbility_Character_Interface' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeaLevelEmpty, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'AttributeAgentInstance_C_Energy_AttributeaLevelEmpty::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeaLevelEmpty, CallFunc_GetOwnerActor_ReturnValue) == 0x000058, "Member 'AttributeAgentInstance_C_Energy_AttributeaLevelEmpty::CallFunc_GetOwnerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeaLevelEmpty, CallFunc_StartCharacterStateSimple_ReturnValue) == 0x000060, "Member 'AttributeAgentInstance_C_Energy_AttributeaLevelEmpty::CallFunc_StartCharacterStateSimple_ReturnValue' has a wrong offset!");

// Function AttributeAgentInstance.AttributeAgentInstance_C.Burn_AttributeInit
// 0x0090 (0x0090 - 0x0000)
struct AttributeAgentInstance_C_Burn_AttributeInit final
{
public:
	class UAbilityComponentBase*                  Ability;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentValue;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxValue;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAbilityCharacterInterface> K2Node_DynamicCast_AsAbility_Character_Interface;  // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnGameEmitterAttached_ReturnValue;     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ___object_Variable;                                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartCharacterState_ReturnValue;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AttributeAgentInstance_C_Burn_AttributeInit) == 0x000008, "Wrong alignment on AttributeAgentInstance_C_Burn_AttributeInit");
static_assert(sizeof(AttributeAgentInstance_C_Burn_AttributeInit) == 0x000090, "Wrong size on AttributeAgentInstance_C_Burn_AttributeInit");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeInit, Ability) == 0x000000, "Member 'AttributeAgentInstance_C_Burn_AttributeInit::Ability' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeInit, CurrentValue) == 0x000008, "Member 'AttributeAgentInstance_C_Burn_AttributeInit::CurrentValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeInit, MaxValue) == 0x00000C, "Member 'AttributeAgentInstance_C_Burn_AttributeInit::MaxValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeInit, Index_0) == 0x000010, "Member 'AttributeAgentInstance_C_Burn_AttributeInit::Index_0' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeInit, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'AttributeAgentInstance_C_Burn_AttributeInit::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeInit, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'AttributeAgentInstance_C_Burn_AttributeInit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeInit, CallFunc_GetOwner_ReturnValue_1) == 0x000028, "Member 'AttributeAgentInstance_C_Burn_AttributeInit::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeInit, K2Node_DynamicCast_AsAbility_Character_Interface) == 0x000030, "Member 'AttributeAgentInstance_C_Burn_AttributeInit::K2Node_DynamicCast_AsAbility_Character_Interface' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeInit, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'AttributeAgentInstance_C_Burn_AttributeInit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeInit, K2Node_MakeArray_Array) == 0x000048, "Member 'AttributeAgentInstance_C_Burn_AttributeInit::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeInit, CallFunc_GetOwnerActor_ReturnValue) == 0x000058, "Member 'AttributeAgentInstance_C_Burn_AttributeInit::CallFunc_GetOwnerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeInit, CallFunc_GetComponentByClass_ReturnValue) == 0x000060, "Member 'AttributeAgentInstance_C_Burn_AttributeInit::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeInit, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000068, "Member 'AttributeAgentInstance_C_Burn_AttributeInit::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeInit, CallFunc_SpawnGameEmitterAttached_ReturnValue) == 0x000070, "Member 'AttributeAgentInstance_C_Burn_AttributeInit::CallFunc_SpawnGameEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeInit, ___object_Variable) == 0x000078, "Member 'AttributeAgentInstance_C_Burn_AttributeInit::___object_Variable' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeInit, K2Node_DynamicCast_AsGame_Character) == 0x000080, "Member 'AttributeAgentInstance_C_Burn_AttributeInit::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeInit, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'AttributeAgentInstance_C_Burn_AttributeInit::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeInit, CallFunc_StartCharacterState_ReturnValue) == 0x00008C, "Member 'AttributeAgentInstance_C_Burn_AttributeInit::CallFunc_StartCharacterState_ReturnValue' has a wrong offset!");

// Function AttributeAgentInstance.AttributeAgentInstance_C.Burn_AttributeLeavelEmpty
// 0x0078 (0x0078 - 0x0000)
struct AttributeAgentInstance_C_Burn_AttributeLeavelEmpty final
{
public:
	class UAbilityComponentBase*                  Ability;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentValue;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxValue;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ___object_Variable;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAbilityCharacterInterface> K2Node_DynamicCast_AsAbility_Character_Interface;  // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_StartCharacterState_ReturnValue;          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AttributeAgentInstance_C_Burn_AttributeLeavelEmpty) == 0x000008, "Wrong alignment on AttributeAgentInstance_C_Burn_AttributeLeavelEmpty");
static_assert(sizeof(AttributeAgentInstance_C_Burn_AttributeLeavelEmpty) == 0x000078, "Wrong size on AttributeAgentInstance_C_Burn_AttributeLeavelEmpty");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeLeavelEmpty, Ability) == 0x000000, "Member 'AttributeAgentInstance_C_Burn_AttributeLeavelEmpty::Ability' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeLeavelEmpty, CurrentValue) == 0x000008, "Member 'AttributeAgentInstance_C_Burn_AttributeLeavelEmpty::CurrentValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeLeavelEmpty, MaxValue) == 0x00000C, "Member 'AttributeAgentInstance_C_Burn_AttributeLeavelEmpty::MaxValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeLeavelEmpty, Index_0) == 0x000010, "Member 'AttributeAgentInstance_C_Burn_AttributeLeavelEmpty::Index_0' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeLeavelEmpty, ___object_Variable) == 0x000018, "Member 'AttributeAgentInstance_C_Burn_AttributeLeavelEmpty::___object_Variable' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeLeavelEmpty, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'AttributeAgentInstance_C_Burn_AttributeLeavelEmpty::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeLeavelEmpty, K2Node_DynamicCast_AsGame_Character) == 0x000028, "Member 'AttributeAgentInstance_C_Burn_AttributeLeavelEmpty::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeLeavelEmpty, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AttributeAgentInstance_C_Burn_AttributeLeavelEmpty::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeLeavelEmpty, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'AttributeAgentInstance_C_Burn_AttributeLeavelEmpty::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeLeavelEmpty, K2Node_DynamicCast_AsAbility_Character_Interface) == 0x000040, "Member 'AttributeAgentInstance_C_Burn_AttributeLeavelEmpty::K2Node_DynamicCast_AsAbility_Character_Interface' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeLeavelEmpty, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'AttributeAgentInstance_C_Burn_AttributeLeavelEmpty::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeLeavelEmpty, K2Node_MakeArray_Array) == 0x000058, "Member 'AttributeAgentInstance_C_Burn_AttributeLeavelEmpty::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeLeavelEmpty, CallFunc_GetOwnerActor_ReturnValue) == 0x000068, "Member 'AttributeAgentInstance_C_Burn_AttributeLeavelEmpty::CallFunc_GetOwnerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeLeavelEmpty, CallFunc_StartCharacterState_ReturnValue) == 0x000070, "Member 'AttributeAgentInstance_C_Burn_AttributeLeavelEmpty::CallFunc_StartCharacterState_ReturnValue' has a wrong offset!");

// Function AttributeAgentInstance.AttributeAgentInstance_C.AttributeEmpty
// 0x0018 (0x0018 - 0x0000)
struct AttributeAgentInstance_C_AttributeEmpty final
{
public:
	EAttributeAgentType                           Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  Ability;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AttributeAgentInstance_C_AttributeEmpty) == 0x000008, "Wrong alignment on AttributeAgentInstance_C_AttributeEmpty");
static_assert(sizeof(AttributeAgentInstance_C_AttributeEmpty) == 0x000018, "Wrong size on AttributeAgentInstance_C_AttributeEmpty");
static_assert(offsetof(AttributeAgentInstance_C_AttributeEmpty, Type) == 0x000000, "Member 'AttributeAgentInstance_C_AttributeEmpty::Type' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeEmpty, Ability) == 0x000008, "Member 'AttributeAgentInstance_C_AttributeEmpty::Ability' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeEmpty, Index_0) == 0x000010, "Member 'AttributeAgentInstance_C_AttributeEmpty::Index_0' has a wrong offset!");

// Function AttributeAgentInstance.AttributeAgentInstance_C.AttributeFull
// 0x0020 (0x0020 - 0x0000)
struct AttributeAgentInstance_C_AttributeFull final
{
public:
	EAttributeAgentType                           Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  Ability;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentEnergy;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxEnergy;                                         // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AttributeAgentInstance_C_AttributeFull) == 0x000008, "Wrong alignment on AttributeAgentInstance_C_AttributeFull");
static_assert(sizeof(AttributeAgentInstance_C_AttributeFull) == 0x000020, "Wrong size on AttributeAgentInstance_C_AttributeFull");
static_assert(offsetof(AttributeAgentInstance_C_AttributeFull, Type) == 0x000000, "Member 'AttributeAgentInstance_C_AttributeFull::Type' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeFull, Ability) == 0x000008, "Member 'AttributeAgentInstance_C_AttributeFull::Ability' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeFull, CurrentEnergy) == 0x000010, "Member 'AttributeAgentInstance_C_AttributeFull::CurrentEnergy' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeFull, MaxEnergy) == 0x000014, "Member 'AttributeAgentInstance_C_AttributeFull::MaxEnergy' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeFull, Index_0) == 0x000018, "Member 'AttributeAgentInstance_C_AttributeFull::Index_0' has a wrong offset!");

// Function AttributeAgentInstance.AttributeAgentInstance_C.AttributeLeaveFull
// 0x0020 (0x0020 - 0x0000)
struct AttributeAgentInstance_C_AttributeLeaveFull final
{
public:
	EAttributeAgentType                           Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  Ability;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentEnergy;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxEnergy;                                         // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AttributeAgentInstance_C_AttributeLeaveFull) == 0x000008, "Wrong alignment on AttributeAgentInstance_C_AttributeLeaveFull");
static_assert(sizeof(AttributeAgentInstance_C_AttributeLeaveFull) == 0x000020, "Wrong size on AttributeAgentInstance_C_AttributeLeaveFull");
static_assert(offsetof(AttributeAgentInstance_C_AttributeLeaveFull, Type) == 0x000000, "Member 'AttributeAgentInstance_C_AttributeLeaveFull::Type' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeLeaveFull, Ability) == 0x000008, "Member 'AttributeAgentInstance_C_AttributeLeaveFull::Ability' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeLeaveFull, CurrentEnergy) == 0x000010, "Member 'AttributeAgentInstance_C_AttributeLeaveFull::CurrentEnergy' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeLeaveFull, MaxEnergy) == 0x000014, "Member 'AttributeAgentInstance_C_AttributeLeaveFull::MaxEnergy' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeLeaveFull, Index_0) == 0x000018, "Member 'AttributeAgentInstance_C_AttributeLeaveFull::Index_0' has a wrong offset!");

// Function AttributeAgentInstance.AttributeAgentInstance_C.AttributeTick
// 0x0020 (0x0020 - 0x0000)
struct AttributeAgentInstance_C_AttributeTick final
{
public:
	EAttributeAgentType                           Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeltaTime;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponentBase*                  Ability;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentEnergy;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxEnergy;                                         // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AttributeAgentInstance_C_AttributeTick) == 0x000008, "Wrong alignment on AttributeAgentInstance_C_AttributeTick");
static_assert(sizeof(AttributeAgentInstance_C_AttributeTick) == 0x000020, "Wrong size on AttributeAgentInstance_C_AttributeTick");
static_assert(offsetof(AttributeAgentInstance_C_AttributeTick, Type) == 0x000000, "Member 'AttributeAgentInstance_C_AttributeTick::Type' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeTick, DeltaTime) == 0x000004, "Member 'AttributeAgentInstance_C_AttributeTick::DeltaTime' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeTick, Ability) == 0x000008, "Member 'AttributeAgentInstance_C_AttributeTick::Ability' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeTick, CurrentEnergy) == 0x000010, "Member 'AttributeAgentInstance_C_AttributeTick::CurrentEnergy' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeTick, MaxEnergy) == 0x000014, "Member 'AttributeAgentInstance_C_AttributeTick::MaxEnergy' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_AttributeTick, Index_0) == 0x000018, "Member 'AttributeAgentInstance_C_AttributeTick::Index_0' has a wrong offset!");

// Function AttributeAgentInstance.AttributeAgentInstance_C.Burn_AttributeEmpty
// 0x0010 (0x0010 - 0x0000)
struct AttributeAgentInstance_C_Burn_AttributeEmpty final
{
public:
	class UAbilityComponentBase*                  Ability;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AttributeAgentInstance_C_Burn_AttributeEmpty) == 0x000008, "Wrong alignment on AttributeAgentInstance_C_Burn_AttributeEmpty");
static_assert(sizeof(AttributeAgentInstance_C_Burn_AttributeEmpty) == 0x000010, "Wrong size on AttributeAgentInstance_C_Burn_AttributeEmpty");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeEmpty, Ability) == 0x000000, "Member 'AttributeAgentInstance_C_Burn_AttributeEmpty::Ability' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeEmpty, Index_0) == 0x000008, "Member 'AttributeAgentInstance_C_Burn_AttributeEmpty::Index_0' has a wrong offset!");

// Function AttributeAgentInstance.AttributeAgentInstance_C.Burn_AttributeTick
// 0x0020 (0x0020 - 0x0000)
struct AttributeAgentInstance_C_Burn_AttributeTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  Ability;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentEnergy;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxEnergy;                                         // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AttributeAgentInstance_C_Burn_AttributeTick) == 0x000008, "Wrong alignment on AttributeAgentInstance_C_Burn_AttributeTick");
static_assert(sizeof(AttributeAgentInstance_C_Burn_AttributeTick) == 0x000020, "Wrong size on AttributeAgentInstance_C_Burn_AttributeTick");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeTick, DeltaTime) == 0x000000, "Member 'AttributeAgentInstance_C_Burn_AttributeTick::DeltaTime' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeTick, Ability) == 0x000008, "Member 'AttributeAgentInstance_C_Burn_AttributeTick::Ability' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeTick, CurrentEnergy) == 0x000010, "Member 'AttributeAgentInstance_C_Burn_AttributeTick::CurrentEnergy' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeTick, MaxEnergy) == 0x000014, "Member 'AttributeAgentInstance_C_Burn_AttributeTick::MaxEnergy' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeTick, Index_0) == 0x000018, "Member 'AttributeAgentInstance_C_Burn_AttributeTick::Index_0' has a wrong offset!");

// Function AttributeAgentInstance.AttributeAgentInstance_C.Burn_AttributeLevelFull
// 0x0018 (0x0018 - 0x0000)
struct AttributeAgentInstance_C_Burn_AttributeLevelFull final
{
public:
	class UAbilityComponentBase*                  Ability;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentEnergy;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxEnergy;                                         // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AttributeAgentInstance_C_Burn_AttributeLevelFull) == 0x000008, "Wrong alignment on AttributeAgentInstance_C_Burn_AttributeLevelFull");
static_assert(sizeof(AttributeAgentInstance_C_Burn_AttributeLevelFull) == 0x000018, "Wrong size on AttributeAgentInstance_C_Burn_AttributeLevelFull");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeLevelFull, Ability) == 0x000000, "Member 'AttributeAgentInstance_C_Burn_AttributeLevelFull::Ability' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeLevelFull, CurrentEnergy) == 0x000008, "Member 'AttributeAgentInstance_C_Burn_AttributeLevelFull::CurrentEnergy' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeLevelFull, MaxEnergy) == 0x00000C, "Member 'AttributeAgentInstance_C_Burn_AttributeLevelFull::MaxEnergy' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeLevelFull, Index_0) == 0x000010, "Member 'AttributeAgentInstance_C_Burn_AttributeLevelFull::Index_0' has a wrong offset!");

// Function AttributeAgentInstance.AttributeAgentInstance_C.Burn_AttributeFull
// 0x0018 (0x0018 - 0x0000)
struct AttributeAgentInstance_C_Burn_AttributeFull final
{
public:
	class UAbilityComponentBase*                  Ability;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentEnergy;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxEnergy;                                         // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AttributeAgentInstance_C_Burn_AttributeFull) == 0x000008, "Wrong alignment on AttributeAgentInstance_C_Burn_AttributeFull");
static_assert(sizeof(AttributeAgentInstance_C_Burn_AttributeFull) == 0x000018, "Wrong size on AttributeAgentInstance_C_Burn_AttributeFull");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeFull, Ability) == 0x000000, "Member 'AttributeAgentInstance_C_Burn_AttributeFull::Ability' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeFull, CurrentEnergy) == 0x000008, "Member 'AttributeAgentInstance_C_Burn_AttributeFull::CurrentEnergy' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeFull, MaxEnergy) == 0x00000C, "Member 'AttributeAgentInstance_C_Burn_AttributeFull::MaxEnergy' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Burn_AttributeFull, Index_0) == 0x000010, "Member 'AttributeAgentInstance_C_Burn_AttributeFull::Index_0' has a wrong offset!");

// Function AttributeAgentInstance.AttributeAgentInstance_C.Energy_AttributeFull
// 0x0018 (0x0018 - 0x0000)
struct AttributeAgentInstance_C_Energy_AttributeFull final
{
public:
	class UAbilityComponentBase*                  Ability;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentValue;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxValue;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AttributeAgentInstance_C_Energy_AttributeFull) == 0x000008, "Wrong alignment on AttributeAgentInstance_C_Energy_AttributeFull");
static_assert(sizeof(AttributeAgentInstance_C_Energy_AttributeFull) == 0x000018, "Wrong size on AttributeAgentInstance_C_Energy_AttributeFull");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeFull, Ability) == 0x000000, "Member 'AttributeAgentInstance_C_Energy_AttributeFull::Ability' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeFull, CurrentValue) == 0x000008, "Member 'AttributeAgentInstance_C_Energy_AttributeFull::CurrentValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeFull, MaxValue) == 0x00000C, "Member 'AttributeAgentInstance_C_Energy_AttributeFull::MaxValue' has a wrong offset!");
static_assert(offsetof(AttributeAgentInstance_C_Energy_AttributeFull, Index_0) == 0x000010, "Member 'AttributeAgentInstance_C_Energy_AttributeFull::Index_0' has a wrong offset!");

// Function AttributeAgentInstance.AttributeAgentInstance_C.Energy_AttributeTick
// 0x0020 (0x0020 - 0x0000)
struct AttributeAgentInstance_C_Energy_AttributeTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  Ability;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentValue;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
