#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BaseSummon

#include "Basic.hpp"


namespace SDK::Params
{

// Function BaseSummon.BaseSummon_C.Abnormal_RepelAnimTime
// 0x0048 (0x0048 - 0x0000)
struct BaseSummon_C_Abnormal_RepelAnimTime final
{
public:
	int32                                         AnimType;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsBack;                                           // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abnormal_RepelAnimTime_ReturnValue;       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbnormalAnimBP_C*                      K2Node_DynamicCast_AsAbnormal_Anim_BP;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayLength_ReturnValue_1;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayLength_ReturnValue_2;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseSummon_C_Abnormal_RepelAnimTime) == 0x000008, "Wrong alignment on BaseSummon_C_Abnormal_RepelAnimTime");
static_assert(sizeof(BaseSummon_C_Abnormal_RepelAnimTime) == 0x000048, "Wrong size on BaseSummon_C_Abnormal_RepelAnimTime");
static_assert(offsetof(BaseSummon_C_Abnormal_RepelAnimTime, AnimType) == 0x000000, "Member 'BaseSummon_C_Abnormal_RepelAnimTime::AnimType' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_RepelAnimTime, bIsBack) == 0x000004, "Member 'BaseSummon_C_Abnormal_RepelAnimTime::bIsBack' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_RepelAnimTime, ReturnValue) == 0x000008, "Member 'BaseSummon_C_Abnormal_RepelAnimTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_RepelAnimTime, CallFunc_Abnormal_RepelAnimTime_ReturnValue) == 0x00000C, "Member 'BaseSummon_C_Abnormal_RepelAnimTime::CallFunc_Abnormal_RepelAnimTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_RepelAnimTime, CallFunc_GetAnimInstance_ReturnValue) == 0x000010, "Member 'BaseSummon_C_Abnormal_RepelAnimTime::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_RepelAnimTime, K2Node_SwitchInteger_CmpSuccess) == 0x000018, "Member 'BaseSummon_C_Abnormal_RepelAnimTime::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_RepelAnimTime, CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue) == 0x000020, "Member 'BaseSummon_C_Abnormal_RepelAnimTime::CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_RepelAnimTime, K2Node_DynamicCast_AsAbnormal_Anim_BP) == 0x000028, "Member 'BaseSummon_C_Abnormal_RepelAnimTime::K2Node_DynamicCast_AsAbnormal_Anim_BP' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_RepelAnimTime, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BaseSummon_C_Abnormal_RepelAnimTime::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_RepelAnimTime, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'BaseSummon_C_Abnormal_RepelAnimTime::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_RepelAnimTime, CallFunc_GetPlayLength_ReturnValue) == 0x000034, "Member 'BaseSummon_C_Abnormal_RepelAnimTime::CallFunc_GetPlayLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_RepelAnimTime, CallFunc_GetPlayLength_ReturnValue_1) == 0x000038, "Member 'BaseSummon_C_Abnormal_RepelAnimTime::CallFunc_GetPlayLength_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_RepelAnimTime, CallFunc_GetPlayLength_ReturnValue_2) == 0x00003C, "Member 'BaseSummon_C_Abnormal_RepelAnimTime::CallFunc_GetPlayLength_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_RepelAnimTime, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'BaseSummon_C_Abnormal_RepelAnimTime::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BaseSummon.BaseSummon_C.Abnormal_LieDownAnimTime
// 0x0030 (0x0030 - 0x0000)
struct BaseSummon_C_Abnormal_LieDownAnimTime final
{
public:
	int32                                         AnimType;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abnormal_LieDownAnimTime_ReturnValue;     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbnormalAnimBP_C*                      K2Node_DynamicCast_AsAbnormal_Anim_BP;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseSummon_C_Abnormal_LieDownAnimTime) == 0x000008, "Wrong alignment on BaseSummon_C_Abnormal_LieDownAnimTime");
static_assert(sizeof(BaseSummon_C_Abnormal_LieDownAnimTime) == 0x000030, "Wrong size on BaseSummon_C_Abnormal_LieDownAnimTime");
static_assert(offsetof(BaseSummon_C_Abnormal_LieDownAnimTime, AnimType) == 0x000000, "Member 'BaseSummon_C_Abnormal_LieDownAnimTime::AnimType' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_LieDownAnimTime, ReturnValue) == 0x000004, "Member 'BaseSummon_C_Abnormal_LieDownAnimTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_LieDownAnimTime, CallFunc_Abnormal_LieDownAnimTime_ReturnValue) == 0x000008, "Member 'BaseSummon_C_Abnormal_LieDownAnimTime::CallFunc_Abnormal_LieDownAnimTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_LieDownAnimTime, CallFunc_GetAnimInstance_ReturnValue) == 0x000010, "Member 'BaseSummon_C_Abnormal_LieDownAnimTime::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_LieDownAnimTime, CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue) == 0x000018, "Member 'BaseSummon_C_Abnormal_LieDownAnimTime::CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_LieDownAnimTime, K2Node_DynamicCast_AsAbnormal_Anim_BP) == 0x000020, "Member 'BaseSummon_C_Abnormal_LieDownAnimTime::K2Node_DynamicCast_AsAbnormal_Anim_BP' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_LieDownAnimTime, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BaseSummon_C_Abnormal_LieDownAnimTime::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_LieDownAnimTime, CallFunc_GetPlayLength_ReturnValue) == 0x00002C, "Member 'BaseSummon_C_Abnormal_LieDownAnimTime::CallFunc_GetPlayLength_ReturnValue' has a wrong offset!");

// Function BaseSummon.BaseSummon_C.Abnormal_GetUpAnimTime
// 0x0030 (0x0030 - 0x0000)
struct BaseSummon_C_Abnormal_GetUpAnimTime final
{
public:
	int32                                         AnimType;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abnormal_GetUpAnimTime_ReturnValue;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbnormalAnimBP_C*                      K2Node_DynamicCast_AsAbnormal_Anim_BP;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseSummon_C_Abnormal_GetUpAnimTime) == 0x000008, "Wrong alignment on BaseSummon_C_Abnormal_GetUpAnimTime");
static_assert(sizeof(BaseSummon_C_Abnormal_GetUpAnimTime) == 0x000030, "Wrong size on BaseSummon_C_Abnormal_GetUpAnimTime");
static_assert(offsetof(BaseSummon_C_Abnormal_GetUpAnimTime, AnimType) == 0x000000, "Member 'BaseSummon_C_Abnormal_GetUpAnimTime::AnimType' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_GetUpAnimTime, ReturnValue) == 0x000004, "Member 'BaseSummon_C_Abnormal_GetUpAnimTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_GetUpAnimTime, CallFunc_Abnormal_GetUpAnimTime_ReturnValue) == 0x000008, "Member 'BaseSummon_C_Abnormal_GetUpAnimTime::CallFunc_Abnormal_GetUpAnimTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_GetUpAnimTime, CallFunc_GetAnimInstance_ReturnValue) == 0x000010, "Member 'BaseSummon_C_Abnormal_GetUpAnimTime::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_GetUpAnimTime, CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue) == 0x000018, "Member 'BaseSummon_C_Abnormal_GetUpAnimTime::CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_GetUpAnimTime, K2Node_DynamicCast_AsAbnormal_Anim_BP) == 0x000020, "Member 'BaseSummon_C_Abnormal_GetUpAnimTime::K2Node_DynamicCast_AsAbnormal_Anim_BP' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_GetUpAnimTime, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BaseSummon_C_Abnormal_GetUpAnimTime::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BaseSummon_C_Abnormal_GetUpAnimTime, CallFunc_GetPlayLength_ReturnValue) == 0x00002C, "Member 'BaseSummon_C_Abnormal_GetUpAnimTime::CallFunc_GetPlayLength_ReturnValue' has a wrong offset!");

// Function BaseSummon.BaseSummon_C.SetMeshTransSortPriority
// 0x0004 (0x0004 - 0x0000)
struct BaseSummon_C_SetMeshTransSortPriority final
{
public:
	int32                                         NewSort;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseSummon_C_SetMeshTransSortPriority) == 0x000004, "Wrong alignment on BaseSummon_C_SetMeshTransSortPriority");
static_assert(sizeof(BaseSummon_C_SetMeshTransSortPriority) == 0x000004, "Wrong size on BaseSummon_C_SetMeshTransSortPriority");
static_assert(offsetof(BaseSummon_C_SetMeshTransSortPriority, NewSort) == 0x000000, "Member 'BaseSummon_C_SetMeshTransSortPriority::NewSort' has a wrong offset!");

}

