#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BasePlayerStateMachine

#include "Basic.hpp"

#include "SMSystem_classes.hpp"
#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "FireStateEvent_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BasePlayerStateMachine.BasePlayerStateMachine_C
// 0x0018 (0x0660 - 0x0648)
class UBasePlayerStateMachine_C : public USMInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0648(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCharacterStateMachineComponent*        CharacterStateMachine;                             // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         GameCharacter;                                     // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetDodgeDirection();
	void SetHoldWeapon(bool bHoldWeapon);
	void SetPreFireTime();
	void ClearPlayerAction(EPlayerAction PlayerAction);
	void SetFireStateEventId();
	void SetWeaponState(EWeaponState WeaponState);
	void GetPlayerStateId(uint8 StateMachineIdx, uint8* StateId);
	void CheckCharacterActionState(ECharacterActionState CharacterStateFlag, bool* Result);
	void ClearCharacterActionState(ECharacterActionState CharacterStateFlag);
	void SetCharacterActionState(ECharacterActionState CharacterStateFlag);
	void OnStateMachineInitialized();
	void ExecuteUbergraph_BasePlayerStateMachine(int32 EntryPoint);

	void CheckPlayerAction(EPlayerAction PlayerAction, bool* bResult) const;
	void CanBreakSkill(bool* bResult) const;
	void IsMoving(bool* bResult) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BasePlayerStateMachine_C">();
	}
	static class UBasePlayerStateMachine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasePlayerStateMachine_C>();
	}
};
static_assert(alignof(UBasePlayerStateMachine_C) == 0x000008, "Wrong alignment on UBasePlayerStateMachine_C");
static_assert(sizeof(UBasePlayerStateMachine_C) == 0x000660, "Wrong size on UBasePlayerStateMachine_C");
static_assert(offsetof(UBasePlayerStateMachine_C, UberGraphFrame) == 0x000648, "Member 'UBasePlayerStateMachine_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBasePlayerStateMachine_C, CharacterStateMachine) == 0x000650, "Member 'UBasePlayerStateMachine_C::CharacterStateMachine' has a wrong offset!");
static_assert(offsetof(UBasePlayerStateMachine_C, GameCharacter) == 0x000658, "Member 'UBasePlayerStateMachine_C::GameCharacter' has a wrong offset!");

}

