#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BasePlayerStateMachine

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "FireStateEvent_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BasePlayerStateMachine.BasePlayerStateMachine_C.SetDodgeDirection
// 0x0020 (0x0020 - 0x0000)
struct BasePlayerStateMachine_C_SetDodgeDirection final
{
public:
	class UObject*                                CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterStateMachineComponent*        CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BasePlayerStateMachine_C_SetDodgeDirection) == 0x000008, "Wrong alignment on BasePlayerStateMachine_C_SetDodgeDirection");
static_assert(sizeof(BasePlayerStateMachine_C_SetDodgeDirection) == 0x000020, "Wrong size on BasePlayerStateMachine_C_SetDodgeDirection");
static_assert(offsetof(BasePlayerStateMachine_C_SetDodgeDirection, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'BasePlayerStateMachine_C_SetDodgeDirection::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetDodgeDirection, K2Node_DynamicCast_AsGame_Player) == 0x000008, "Member 'BasePlayerStateMachine_C_SetDodgeDirection::K2Node_DynamicCast_AsGame_Player' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetDodgeDirection, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BasePlayerStateMachine_C_SetDodgeDirection::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetDodgeDirection, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'BasePlayerStateMachine_C_SetDodgeDirection::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function BasePlayerStateMachine.BasePlayerStateMachine_C.SetHoldWeapon
// 0x0030 (0x0030 - 0x0000)
struct BasePlayerStateMachine_C_SetHoldWeapon final
{
public:
	bool                                          bHoldWeapon;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterStateMachineComponent*        CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BasePlayerStateMachine_C_SetHoldWeapon) == 0x000008, "Wrong alignment on BasePlayerStateMachine_C_SetHoldWeapon");
static_assert(sizeof(BasePlayerStateMachine_C_SetHoldWeapon) == 0x000030, "Wrong size on BasePlayerStateMachine_C_SetHoldWeapon");
static_assert(offsetof(BasePlayerStateMachine_C_SetHoldWeapon, bHoldWeapon) == 0x000000, "Member 'BasePlayerStateMachine_C_SetHoldWeapon::bHoldWeapon' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetHoldWeapon, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'BasePlayerStateMachine_C_SetHoldWeapon::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetHoldWeapon, K2Node_DynamicCast_AsGame_Player) == 0x000010, "Member 'BasePlayerStateMachine_C_SetHoldWeapon::K2Node_DynamicCast_AsGame_Player' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetHoldWeapon, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BasePlayerStateMachine_C_SetHoldWeapon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetHoldWeapon, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BasePlayerStateMachine_C_SetHoldWeapon::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetHoldWeapon, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BasePlayerStateMachine_C_SetHoldWeapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BasePlayerStateMachine.BasePlayerStateMachine_C.SetPreFireTime
// 0x0018 (0x0018 - 0x0000)
struct BasePlayerStateMachine_C_SetPreFireTime final
{
public:
	class UObject*                                CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BasePlayerStateMachine_C_SetPreFireTime) == 0x000008, "Wrong alignment on BasePlayerStateMachine_C_SetPreFireTime");
static_assert(sizeof(BasePlayerStateMachine_C_SetPreFireTime) == 0x000018, "Wrong size on BasePlayerStateMachine_C_SetPreFireTime");
static_assert(offsetof(BasePlayerStateMachine_C_SetPreFireTime, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'BasePlayerStateMachine_C_SetPreFireTime::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetPreFireTime, K2Node_DynamicCast_AsGame_Player) == 0x000008, "Member 'BasePlayerStateMachine_C_SetPreFireTime::K2Node_DynamicCast_AsGame_Player' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetPreFireTime, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BasePlayerStateMachine_C_SetPreFireTime::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BasePlayerStateMachine.BasePlayerStateMachine_C.ClearPlayerAction
// 0x0002 (0x0002 - 0x0000)
struct BasePlayerStateMachine_C_ClearPlayerAction final
{
public:
	EPlayerAction                                 PlayerAction;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BasePlayerStateMachine_C_ClearPlayerAction) == 0x000001, "Wrong alignment on BasePlayerStateMachine_C_ClearPlayerAction");
static_assert(sizeof(BasePlayerStateMachine_C_ClearPlayerAction) == 0x000002, "Wrong size on BasePlayerStateMachine_C_ClearPlayerAction");
static_assert(offsetof(BasePlayerStateMachine_C_ClearPlayerAction, PlayerAction) == 0x000000, "Member 'BasePlayerStateMachine_C_ClearPlayerAction::PlayerAction' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_ClearPlayerAction, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BasePlayerStateMachine_C_ClearPlayerAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BasePlayerStateMachine.BasePlayerStateMachine_C.SetFireStateEventId
// 0x0020 (0x0020 - 0x0000)
struct BasePlayerStateMachine_C_SetFireStateEventId final
{
public:
	bool                                          ___bool_Variable;                                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFireStateEvent                               ___byte_Variable;                                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable_1;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFireStateEvent                               ___byte_Variable_1;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFireStateEvent                               ___byte_Variable_2;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckPlayerActionFlag_ReturnValue;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckPlayerActionFlag_ReturnValue_1;      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFireStateEvent                               K2Node_Select_Default;                             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFireStateEvent                               K2Node_Select_Default_1;                           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStateEventId_ReturnValue;              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BasePlayerStateMachine_C_SetFireStateEventId) == 0x000008, "Wrong alignment on BasePlayerStateMachine_C_SetFireStateEventId");
static_assert(sizeof(BasePlayerStateMachine_C_SetFireStateEventId) == 0x000020, "Wrong size on BasePlayerStateMachine_C_SetFireStateEventId");
static_assert(offsetof(BasePlayerStateMachine_C_SetFireStateEventId, ___bool_Variable) == 0x000000, "Member 'BasePlayerStateMachine_C_SetFireStateEventId::___bool_Variable' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetFireStateEventId, ___byte_Variable) == 0x000001, "Member 'BasePlayerStateMachine_C_SetFireStateEventId::___byte_Variable' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetFireStateEventId, ___bool_Variable_1) == 0x000002, "Member 'BasePlayerStateMachine_C_SetFireStateEventId::___bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetFireStateEventId, ___byte_Variable_1) == 0x000003, "Member 'BasePlayerStateMachine_C_SetFireStateEventId::___byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetFireStateEventId, ___byte_Variable_2) == 0x000004, "Member 'BasePlayerStateMachine_C_SetFireStateEventId::___byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetFireStateEventId, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'BasePlayerStateMachine_C_SetFireStateEventId::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetFireStateEventId, K2Node_DynamicCast_AsGame_Character) == 0x000010, "Member 'BasePlayerStateMachine_C_SetFireStateEventId::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetFireStateEventId, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BasePlayerStateMachine_C_SetFireStateEventId::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetFireStateEventId, CallFunc_CheckPlayerActionFlag_ReturnValue) == 0x000019, "Member 'BasePlayerStateMachine_C_SetFireStateEventId::CallFunc_CheckPlayerActionFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetFireStateEventId, CallFunc_CheckPlayerActionFlag_ReturnValue_1) == 0x00001A, "Member 'BasePlayerStateMachine_C_SetFireStateEventId::CallFunc_CheckPlayerActionFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetFireStateEventId, K2Node_Select_Default) == 0x00001B, "Member 'BasePlayerStateMachine_C_SetFireStateEventId::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetFireStateEventId, K2Node_Select_Default_1) == 0x00001C, "Member 'BasePlayerStateMachine_C_SetFireStateEventId::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetFireStateEventId, CallFunc_SetStateEventId_ReturnValue) == 0x00001D, "Member 'BasePlayerStateMachine_C_SetFireStateEventId::CallFunc_SetStateEventId_ReturnValue' has a wrong offset!");

// Function BasePlayerStateMachine.BasePlayerStateMachine_C.SetWeaponState
// 0x0020 (0x0020 - 0x0000)
struct BasePlayerStateMachine_C_SetWeaponState final
{
public:
	EWeaponState                                  WeaponState;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BasePlayerStateMachine_C_SetWeaponState) == 0x000008, "Wrong alignment on BasePlayerStateMachine_C_SetWeaponState");
static_assert(sizeof(BasePlayerStateMachine_C_SetWeaponState) == 0x000020, "Wrong size on BasePlayerStateMachine_C_SetWeaponState");
static_assert(offsetof(BasePlayerStateMachine_C_SetWeaponState, WeaponState) == 0x000000, "Member 'BasePlayerStateMachine_C_SetWeaponState::WeaponState' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetWeaponState, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'BasePlayerStateMachine_C_SetWeaponState::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetWeaponState, K2Node_DynamicCast_AsGame_Character) == 0x000010, "Member 'BasePlayerStateMachine_C_SetWeaponState::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetWeaponState, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BasePlayerStateMachine_C_SetWeaponState::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BasePlayerStateMachine.BasePlayerStateMachine_C.GetPlayerStateId
// 0x0004 (0x0004 - 0x0000)
struct BasePlayerStateMachine_C_GetPlayerStateId final
{
public:
	uint8                                         StateMachineIdx;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         StateId;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetCurrentStateId_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BasePlayerStateMachine_C_GetPlayerStateId) == 0x000001, "Wrong alignment on BasePlayerStateMachine_C_GetPlayerStateId");
static_assert(sizeof(BasePlayerStateMachine_C_GetPlayerStateId) == 0x000004, "Wrong size on BasePlayerStateMachine_C_GetPlayerStateId");
static_assert(offsetof(BasePlayerStateMachine_C_GetPlayerStateId, StateMachineIdx) == 0x000000, "Member 'BasePlayerStateMachine_C_GetPlayerStateId::StateMachineIdx' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_GetPlayerStateId, StateId) == 0x000001, "Member 'BasePlayerStateMachine_C_GetPlayerStateId::StateId' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_GetPlayerStateId, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'BasePlayerStateMachine_C_GetPlayerStateId::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_GetPlayerStateId, CallFunc_GetCurrentStateId_ReturnValue) == 0x000003, "Member 'BasePlayerStateMachine_C_GetPlayerStateId::CallFunc_GetCurrentStateId_ReturnValue' has a wrong offset!");

// Function BasePlayerStateMachine.BasePlayerStateMachine_C.CheckCharacterActionState
// 0x0004 (0x0004 - 0x0000)
struct BasePlayerStateMachine_C_CheckCharacterActionState final
{
public:
	ECharacterActionState                         CharacterStateFlag;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCharacterActionState_ReturnValue;    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BasePlayerStateMachine_C_CheckCharacterActionState) == 0x000001, "Wrong alignment on BasePlayerStateMachine_C_CheckCharacterActionState");
static_assert(sizeof(BasePlayerStateMachine_C_CheckCharacterActionState) == 0x000004, "Wrong size on BasePlayerStateMachine_C_CheckCharacterActionState");
static_assert(offsetof(BasePlayerStateMachine_C_CheckCharacterActionState, CharacterStateFlag) == 0x000000, "Member 'BasePlayerStateMachine_C_CheckCharacterActionState::CharacterStateFlag' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_CheckCharacterActionState, Result) == 0x000001, "Member 'BasePlayerStateMachine_C_CheckCharacterActionState::Result' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_CheckCharacterActionState, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'BasePlayerStateMachine_C_CheckCharacterActionState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_CheckCharacterActionState, CallFunc_CheckCharacterActionState_ReturnValue) == 0x000003, "Member 'BasePlayerStateMachine_C_CheckCharacterActionState::CallFunc_CheckCharacterActionState_ReturnValue' has a wrong offset!");

// Function BasePlayerStateMachine.BasePlayerStateMachine_C.ClearCharacterActionState
// 0x0002 (0x0002 - 0x0000)
struct BasePlayerStateMachine_C_ClearCharacterActionState final
{
public:
	ECharacterActionState                         CharacterStateFlag;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BasePlayerStateMachine_C_ClearCharacterActionState) == 0x000001, "Wrong alignment on BasePlayerStateMachine_C_ClearCharacterActionState");
static_assert(sizeof(BasePlayerStateMachine_C_ClearCharacterActionState) == 0x000002, "Wrong size on BasePlayerStateMachine_C_ClearCharacterActionState");
static_assert(offsetof(BasePlayerStateMachine_C_ClearCharacterActionState, CharacterStateFlag) == 0x000000, "Member 'BasePlayerStateMachine_C_ClearCharacterActionState::CharacterStateFlag' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_ClearCharacterActionState, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BasePlayerStateMachine_C_ClearCharacterActionState::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BasePlayerStateMachine.BasePlayerStateMachine_C.SetCharacterActionState
// 0x0002 (0x0002 - 0x0000)
struct BasePlayerStateMachine_C_SetCharacterActionState final
{
public:
	ECharacterActionState                         CharacterStateFlag;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BasePlayerStateMachine_C_SetCharacterActionState) == 0x000001, "Wrong alignment on BasePlayerStateMachine_C_SetCharacterActionState");
static_assert(sizeof(BasePlayerStateMachine_C_SetCharacterActionState) == 0x000002, "Wrong size on BasePlayerStateMachine_C_SetCharacterActionState");
static_assert(offsetof(BasePlayerStateMachine_C_SetCharacterActionState, CharacterStateFlag) == 0x000000, "Member 'BasePlayerStateMachine_C_SetCharacterActionState::CharacterStateFlag' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_SetCharacterActionState, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BasePlayerStateMachine_C_SetCharacterActionState::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BasePlayerStateMachine.BasePlayerStateMachine_C.ExecuteUbergraph_BasePlayerStateMachine
// 0x0028 (0x0028 - 0x0000)
struct BasePlayerStateMachine_C_ExecuteUbergraph_BasePlayerStateMachine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterStateMachineComponent*        CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BasePlayerStateMachine_C_ExecuteUbergraph_BasePlayerStateMachine) == 0x000008, "Wrong alignment on BasePlayerStateMachine_C_ExecuteUbergraph_BasePlayerStateMachine");
static_assert(sizeof(BasePlayerStateMachine_C_ExecuteUbergraph_BasePlayerStateMachine) == 0x000028, "Wrong size on BasePlayerStateMachine_C_ExecuteUbergraph_BasePlayerStateMachine");
static_assert(offsetof(BasePlayerStateMachine_C_ExecuteUbergraph_BasePlayerStateMachine, EntryPoint) == 0x000000, "Member 'BasePlayerStateMachine_C_ExecuteUbergraph_BasePlayerStateMachine::EntryPoint' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_ExecuteUbergraph_BasePlayerStateMachine, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'BasePlayerStateMachine_C_ExecuteUbergraph_BasePlayerStateMachine::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_ExecuteUbergraph_BasePlayerStateMachine, K2Node_DynamicCast_AsGame_Character) == 0x000010, "Member 'BasePlayerStateMachine_C_ExecuteUbergraph_BasePlayerStateMachine::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_ExecuteUbergraph_BasePlayerStateMachine, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BasePlayerStateMachine_C_ExecuteUbergraph_BasePlayerStateMachine::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_ExecuteUbergraph_BasePlayerStateMachine, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BasePlayerStateMachine_C_ExecuteUbergraph_BasePlayerStateMachine::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function BasePlayerStateMachine.BasePlayerStateMachine_C.CheckPlayerAction
// 0x0004 (0x0004 - 0x0000)
struct BasePlayerStateMachine_C_CheckPlayerAction final
{
public:
	EPlayerAction                                 PlayerAction;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bResult;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckPlayerActionFlag_ReturnValue;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BasePlayerStateMachine_C_CheckPlayerAction) == 0x000001, "Wrong alignment on BasePlayerStateMachine_C_CheckPlayerAction");
static_assert(sizeof(BasePlayerStateMachine_C_CheckPlayerAction) == 0x000004, "Wrong size on BasePlayerStateMachine_C_CheckPlayerAction");
static_assert(offsetof(BasePlayerStateMachine_C_CheckPlayerAction, PlayerAction) == 0x000000, "Member 'BasePlayerStateMachine_C_CheckPlayerAction::PlayerAction' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_CheckPlayerAction, bResult) == 0x000001, "Member 'BasePlayerStateMachine_C_CheckPlayerAction::bResult' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_CheckPlayerAction, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'BasePlayerStateMachine_C_CheckPlayerAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_CheckPlayerAction, CallFunc_CheckPlayerActionFlag_ReturnValue) == 0x000003, "Member 'BasePlayerStateMachine_C_CheckPlayerAction::CallFunc_CheckPlayerActionFlag_ReturnValue' has a wrong offset!");

// Function BasePlayerStateMachine.BasePlayerStateMachine_C.CanBreakSkill
// 0x0020 (0x0020 - 0x0000)
struct BasePlayerStateMachine_C_CanBreakSkill final
{
public:
	bool                                          bResult;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckSkillPriority_ReturnValue;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BasePlayerStateMachine_C_CanBreakSkill) == 0x000008, "Wrong alignment on BasePlayerStateMachine_C_CanBreakSkill");
static_assert(sizeof(BasePlayerStateMachine_C_CanBreakSkill) == 0x000020, "Wrong size on BasePlayerStateMachine_C_CanBreakSkill");
static_assert(offsetof(BasePlayerStateMachine_C_CanBreakSkill, bResult) == 0x000000, "Member 'BasePlayerStateMachine_C_CanBreakSkill::bResult' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_CanBreakSkill, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'BasePlayerStateMachine_C_CanBreakSkill::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_CanBreakSkill, K2Node_DynamicCast_AsGame_Character) == 0x000010, "Member 'BasePlayerStateMachine_C_CanBreakSkill::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_CanBreakSkill, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BasePlayerStateMachine_C_CanBreakSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_CanBreakSkill, CallFunc_CheckSkillPriority_ReturnValue) == 0x000019, "Member 'BasePlayerStateMachine_C_CanBreakSkill::CallFunc_CheckSkillPriority_ReturnValue' has a wrong offset!");

// Function BasePlayerStateMachine.BasePlayerStateMachine_C.IsMoving
// 0x0040 (0x0040 - 0x0000)
struct BasePlayerStateMachine_C_IsMoving final
{
public:
	bool                                          bResult;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_As__;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCurrentAcceleration_ReturnValue;       // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNearlyZero2D_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNearlyZero2D_ReturnValue_1;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BasePlayerStateMachine_C_IsMoving) == 0x000008, "Wrong alignment on BasePlayerStateMachine_C_IsMoving");
static_assert(sizeof(BasePlayerStateMachine_C_IsMoving) == 0x000040, "Wrong size on BasePlayerStateMachine_C_IsMoving");
static_assert(offsetof(BasePlayerStateMachine_C_IsMoving, bResult) == 0x000000, "Member 'BasePlayerStateMachine_C_IsMoving::bResult' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_IsMoving, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'BasePlayerStateMachine_C_IsMoving::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasePlayerStateMachine_C_IsMoving, K2Node_DynamicCast_As__) == 0x000010, "Member 'BasePlayerStateMachine_C_IsMoving::K2Node_DynamicCast_As__' has a wrong offset!");
