#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BaseCharacter

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CharacterStateEvent_structs.hpp"


namespace SDK::Params
{

// Function BaseCharacter.BaseCharacter_C.RemoveEnchantEmitter
// 0x0004 (0x0004 - 0x0000)
struct BaseCharacter_C_RemoveEnchantEmitter final
{
public:
	int32                                         EmitterID;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseCharacter_C_RemoveEnchantEmitter) == 0x000004, "Wrong alignment on BaseCharacter_C_RemoveEnchantEmitter");
static_assert(sizeof(BaseCharacter_C_RemoveEnchantEmitter) == 0x000004, "Wrong size on BaseCharacter_C_RemoveEnchantEmitter");
static_assert(offsetof(BaseCharacter_C_RemoveEnchantEmitter, EmitterID) == 0x000000, "Member 'BaseCharacter_C_RemoveEnchantEmitter::EmitterID' has a wrong offset!");

// Function BaseCharacter.BaseCharacter_C.AddEnchantEmitter
// 0x0018 (0x0018 - 0x0000)
struct BaseCharacter_C_AddEnchantEmitter final
{
public:
	int32                                         EmitterID;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  Launcher;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bApplyBySource;                                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Level_0;                                           // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseCharacter_C_AddEnchantEmitter) == 0x000008, "Wrong alignment on BaseCharacter_C_AddEnchantEmitter");
static_assert(sizeof(BaseCharacter_C_AddEnchantEmitter) == 0x000018, "Wrong size on BaseCharacter_C_AddEnchantEmitter");
static_assert(offsetof(BaseCharacter_C_AddEnchantEmitter, EmitterID) == 0x000000, "Member 'BaseCharacter_C_AddEnchantEmitter::EmitterID' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_AddEnchantEmitter, Launcher) == 0x000008, "Member 'BaseCharacter_C_AddEnchantEmitter::Launcher' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_AddEnchantEmitter, bApplyBySource) == 0x000010, "Member 'BaseCharacter_C_AddEnchantEmitter::bApplyBySource' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_AddEnchantEmitter, Level_0) == 0x000014, "Member 'BaseCharacter_C_AddEnchantEmitter::Level_0' has a wrong offset!");

// Function BaseCharacter.BaseCharacter_C.Set Camera Lag
// 0x0001 (0x0001 - 0x0000)
struct BaseCharacter_C_Set_Camera_Lag final
{
public:
	bool                                          CameraLag;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseCharacter_C_Set_Camera_Lag) == 0x000001, "Wrong alignment on BaseCharacter_C_Set_Camera_Lag");
static_assert(sizeof(BaseCharacter_C_Set_Camera_Lag) == 0x000001, "Wrong size on BaseCharacter_C_Set_Camera_Lag");
static_assert(offsetof(BaseCharacter_C_Set_Camera_Lag, CameraLag) == 0x000000, "Member 'BaseCharacter_C_Set_Camera_Lag::CameraLag' has a wrong offset!");

// Function BaseCharacter.BaseCharacter_C.IsInPerfectDodge
// 0x000C (0x000C - 0x0000)
struct BaseCharacter_C_IsInPerfectDodge final
{
public:
	bool                                          InPerfectDodge;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCastingSkillIDInAnim_ReturnValue;      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDodgeSkill_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseCharacter_C_IsInPerfectDodge) == 0x000004, "Wrong alignment on BaseCharacter_C_IsInPerfectDodge");
static_assert(sizeof(BaseCharacter_C_IsInPerfectDodge) == 0x00000C, "Wrong size on BaseCharacter_C_IsInPerfectDodge");
static_assert(offsetof(BaseCharacter_C_IsInPerfectDodge, InPerfectDodge) == 0x000000, "Member 'BaseCharacter_C_IsInPerfectDodge::InPerfectDodge' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_IsInPerfectDodge, CallFunc_GetCastingSkillIDInAnim_ReturnValue) == 0x000004, "Member 'BaseCharacter_C_IsInPerfectDodge::CallFunc_GetCastingSkillIDInAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_IsInPerfectDodge, CallFunc_IsDodgeSkill_ReturnValue) == 0x000008, "Member 'BaseCharacter_C_IsInPerfectDodge::CallFunc_IsDodgeSkill_ReturnValue' has a wrong offset!");

// Function BaseCharacter.BaseCharacter_C.IsPerfectDodge
// 0x0040 (0x0040 - 0x0000)
struct BaseCharacter_C_IsPerfectDodge final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InDamageCollision;                                 // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            CallFunc_GetOverlappingComponents_OverlappingComponents; // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDodgeSkill_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ComponentHasTag_ReturnValue;              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseCharacter_C_IsPerfectDodge) == 0x000008, "Wrong alignment on BaseCharacter_C_IsPerfectDodge");
static_assert(sizeof(BaseCharacter_C_IsPerfectDodge) == 0x000040, "Wrong size on BaseCharacter_C_IsPerfectDodge");
static_assert(offsetof(BaseCharacter_C_IsPerfectDodge, SkillID) == 0x000000, "Member 'BaseCharacter_C_IsPerfectDodge::SkillID' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_IsPerfectDodge, Result) == 0x000004, "Member 'BaseCharacter_C_IsPerfectDodge::Result' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_IsPerfectDodge, InDamageCollision) == 0x000005, "Member 'BaseCharacter_C_IsPerfectDodge::InDamageCollision' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_IsPerfectDodge, ___int_Array_Index_Variable) == 0x000008, "Member 'BaseCharacter_C_IsPerfectDodge::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_IsPerfectDodge, ___int_Loop_Counter_Variable) == 0x00000C, "Member 'BaseCharacter_C_IsPerfectDodge::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_IsPerfectDodge, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BaseCharacter_C_IsPerfectDodge::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_IsPerfectDodge, CallFunc_GetOverlappingComponents_OverlappingComponents) == 0x000018, "Member 'BaseCharacter_C_IsPerfectDodge::CallFunc_GetOverlappingComponents_OverlappingComponents' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_IsPerfectDodge, CallFunc_Array_Get_Item) == 0x000028, "Member 'BaseCharacter_C_IsPerfectDodge::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_IsPerfectDodge, CallFunc_IsDodgeSkill_ReturnValue) == 0x000030, "Member 'BaseCharacter_C_IsPerfectDodge::CallFunc_IsDodgeSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_IsPerfectDodge, CallFunc_ComponentHasTag_ReturnValue) == 0x000031, "Member 'BaseCharacter_C_IsPerfectDodge::CallFunc_ComponentHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_IsPerfectDodge, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'BaseCharacter_C_IsPerfectDodge::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_IsPerfectDodge, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BaseCharacter_C_IsPerfectDodge::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BaseCharacter.BaseCharacter_C.Abnormal_RepelAnimTime
// 0x0040 (0x0040 - 0x0000)
struct BaseCharacter_C_Abnormal_RepelAnimTime final
{
public:
	int32                                         AnimType;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsBack;                                           // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          RepelAnim;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetGameAnimInstance_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameCharacterAnimInstance*             K2Node_DynamicCast_AsGame_Character_Anim_Instance; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetRepelMontage_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseCharacter_C_Abnormal_RepelAnimTime) == 0x000008, "Wrong alignment on BaseCharacter_C_Abnormal_RepelAnimTime");
static_assert(sizeof(BaseCharacter_C_Abnormal_RepelAnimTime) == 0x000040, "Wrong size on BaseCharacter_C_Abnormal_RepelAnimTime");
static_assert(offsetof(BaseCharacter_C_Abnormal_RepelAnimTime, AnimType) == 0x000000, "Member 'BaseCharacter_C_Abnormal_RepelAnimTime::AnimType' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_Abnormal_RepelAnimTime, bIsBack) == 0x000004, "Member 'BaseCharacter_C_Abnormal_RepelAnimTime::bIsBack' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_Abnormal_RepelAnimTime, ReturnValue) == 0x000008, "Member 'BaseCharacter_C_Abnormal_RepelAnimTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_Abnormal_RepelAnimTime, RepelAnim) == 0x000010, "Member 'BaseCharacter_C_Abnormal_RepelAnimTime::RepelAnim' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_Abnormal_RepelAnimTime, CallFunc_GetGameAnimInstance_ReturnValue) == 0x000018, "Member 'BaseCharacter_C_Abnormal_RepelAnimTime::CallFunc_GetGameAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_Abnormal_RepelAnimTime, K2Node_DynamicCast_AsGame_Character_Anim_Instance) == 0x000020, "Member 'BaseCharacter_C_Abnormal_RepelAnimTime::K2Node_DynamicCast_AsGame_Character_Anim_Instance' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_Abnormal_RepelAnimTime, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BaseCharacter_C_Abnormal_RepelAnimTime::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_Abnormal_RepelAnimTime, CallFunc_GetRepelMontage_ReturnValue) == 0x000030, "Member 'BaseCharacter_C_Abnormal_RepelAnimTime::CallFunc_GetRepelMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_Abnormal_RepelAnimTime, CallFunc_GetPlayLength_ReturnValue) == 0x000038, "Member 'BaseCharacter_C_Abnormal_RepelAnimTime::CallFunc_GetPlayLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_Abnormal_RepelAnimTime, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'BaseCharacter_C_Abnormal_RepelAnimTime::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BaseCharacter.BaseCharacter_C.Abnormal_GetUpAnimTime
// 0x0028 (0x0028 - 0x0000)
struct BaseCharacter_C_Abnormal_GetUpAnimTime final
{
public:
	int32                                         AnimType;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetGameAnimInstance_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameCharacterAnimInstance*             K2Node_DynamicCast_AsGame_Character_Anim_Instance; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseCharacter_C_Abnormal_GetUpAnimTime) == 0x000008, "Wrong alignment on BaseCharacter_C_Abnormal_GetUpAnimTime");
static_assert(sizeof(BaseCharacter_C_Abnormal_GetUpAnimTime) == 0x000028, "Wrong size on BaseCharacter_C_Abnormal_GetUpAnimTime");
static_assert(offsetof(BaseCharacter_C_Abnormal_GetUpAnimTime, AnimType) == 0x000000, "Member 'BaseCharacter_C_Abnormal_GetUpAnimTime::AnimType' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_Abnormal_GetUpAnimTime, ReturnValue) == 0x000004, "Member 'BaseCharacter_C_Abnormal_GetUpAnimTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_Abnormal_GetUpAnimTime, CallFunc_GetGameAnimInstance_ReturnValue) == 0x000008, "Member 'BaseCharacter_C_Abnormal_GetUpAnimTime::CallFunc_GetGameAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_Abnormal_GetUpAnimTime, K2Node_DynamicCast_AsGame_Character_Anim_Instance) == 0x000010, "Member 'BaseCharacter_C_Abnormal_GetUpAnimTime::K2Node_DynamicCast_AsGame_Character_Anim_Instance' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_Abnormal_GetUpAnimTime, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BaseCharacter_C_Abnormal_GetUpAnimTime::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_Abnormal_GetUpAnimTime, CallFunc_GetPlayLength_ReturnValue) == 0x00001C, "Member 'BaseCharacter_C_Abnormal_GetUpAnimTime::CallFunc_GetPlayLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_Abnormal_GetUpAnimTime, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BaseCharacter_C_Abnormal_GetUpAnimTime::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BaseCharacter.BaseCharacter_C.ReceiveSkillEnd
// 0x0002 (0x0002 - 0x0000)
struct BaseCharacter_C_ReceiveSkillEnd final
{
public:
	bool                                          bHalfSkill;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHalfSkillInAim;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseCharacter_C_ReceiveSkillEnd) == 0x000001, "Wrong alignment on BaseCharacter_C_ReceiveSkillEnd");
static_assert(sizeof(BaseCharacter_C_ReceiveSkillEnd) == 0x000002, "Wrong size on BaseCharacter_C_ReceiveSkillEnd");
static_assert(offsetof(BaseCharacter_C_ReceiveSkillEnd, bHalfSkill) == 0x000000, "Member 'BaseCharacter_C_ReceiveSkillEnd::bHalfSkill' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ReceiveSkillEnd, bHalfSkillInAim) == 0x000001, "Member 'BaseCharacter_C_ReceiveSkillEnd::bHalfSkillInAim' has a wrong offset!");

// Function BaseCharacter.BaseCharacter_C.ReceiveSkillStart
// 0x0002 (0x0002 - 0x0000)
struct BaseCharacter_C_ReceiveSkillStart final
{
public:
	bool                                          bHalfSkill;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHalfSkillInAim;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseCharacter_C_ReceiveSkillStart) == 0x000001, "Wrong alignment on BaseCharacter_C_ReceiveSkillStart");
static_assert(sizeof(BaseCharacter_C_ReceiveSkillStart) == 0x000002, "Wrong size on BaseCharacter_C_ReceiveSkillStart");
static_assert(offsetof(BaseCharacter_C_ReceiveSkillStart, bHalfSkill) == 0x000000, "Member 'BaseCharacter_C_ReceiveSkillStart::bHalfSkill' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ReceiveSkillStart, bHalfSkillInAim) == 0x000001, "Member 'BaseCharacter_C_ReceiveSkillStart::bHalfSkillInAim' has a wrong offset!");

// Function BaseCharacter.BaseCharacter_C.OnDie
// 0x01C0 (0x01C0 - 0x0000)
struct BaseCharacter_C_OnDie final
{
public:
	class AGameCharacter*                         Who;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         Killer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     HealthChangeValue;                                 // 0x0010(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BaseCharacter_C_OnDie) == 0x000008, "Wrong alignment on BaseCharacter_C_OnDie");
static_assert(sizeof(BaseCharacter_C_OnDie) == 0x0001C0, "Wrong size on BaseCharacter_C_OnDie");
static_assert(offsetof(BaseCharacter_C_OnDie, Who) == 0x000000, "Member 'BaseCharacter_C_OnDie::Who' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_OnDie, Killer) == 0x000008, "Member 'BaseCharacter_C_OnDie::Killer' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_OnDie, HealthChangeValue) == 0x000010, "Member 'BaseCharacter_C_OnDie::HealthChangeValue' has a wrong offset!");

// Function BaseCharacter.BaseCharacter_C.OnAbilityCastSkill_Event_0
// 0x0020 (0x0020 - 0x0000)
struct BaseCharacter_C_OnAbilityCastSkill_Event_0 final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OriginSkills;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UGameAbilityComponent*                  AbilityRef;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseCharacter_C_OnAbilityCastSkill_Event_0) == 0x000008, "Wrong alignment on BaseCharacter_C_OnAbilityCastSkill_Event_0");
static_assert(sizeof(BaseCharacter_C_OnAbilityCastSkill_Event_0) == 0x000020, "Wrong size on BaseCharacter_C_OnAbilityCastSkill_Event_0");
static_assert(offsetof(BaseCharacter_C_OnAbilityCastSkill_Event_0, SkillID) == 0x000000, "Member 'BaseCharacter_C_OnAbilityCastSkill_Event_0::SkillID' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_OnAbilityCastSkill_Event_0, OriginSkills) == 0x000008, "Member 'BaseCharacter_C_OnAbilityCastSkill_Event_0::OriginSkills' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_OnAbilityCastSkill_Event_0, AbilityRef) == 0x000018, "Member 'BaseCharacter_C_OnAbilityCastSkill_Event_0::AbilityRef' has a wrong offset!");

// Function BaseCharacter.BaseCharacter_C.ActiveReviveGod
// 0x0008 (0x0008 - 0x0000)
struct BaseCharacter_C_ActiveReviveGod final
{
public:
	class AGamePlayer*                            RevivePlayer;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseCharacter_C_ActiveReviveGod) == 0x000008, "Wrong alignment on BaseCharacter_C_ActiveReviveGod");
static_assert(sizeof(BaseCharacter_C_ActiveReviveGod) == 0x000008, "Wrong size on BaseCharacter_C_ActiveReviveGod");
static_assert(offsetof(BaseCharacter_C_ActiveReviveGod, RevivePlayer) == 0x000000, "Member 'BaseCharacter_C_ActiveReviveGod::RevivePlayer' has a wrong offset!");

// Function BaseCharacter.BaseCharacter_C.ShowFightMaskEvent
// 0x0004 (0x0004 - 0x0000)
struct BaseCharacter_C_ShowFightMaskEvent final
{
public:
	float                                         BlackOutTime;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseCharacter_C_ShowFightMaskEvent) == 0x000004, "Wrong alignment on BaseCharacter_C_ShowFightMaskEvent");
static_assert(sizeof(BaseCharacter_C_ShowFightMaskEvent) == 0x000004, "Wrong size on BaseCharacter_C_ShowFightMaskEvent");
static_assert(offsetof(BaseCharacter_C_ShowFightMaskEvent, BlackOutTime) == 0x000000, "Member 'BaseCharacter_C_ShowFightMaskEvent::BlackOutTime' has a wrong offset!");

// Function BaseCharacter.BaseCharacter_C.ExecuteUbergraph_BaseCharacter
// 0x02D0 (0x02D0 - 0x0000)
struct BaseCharacter_C_ExecuteUbergraph_BaseCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStateEventId_ReturnValue;              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStateEventId_ReturnValue_1;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStateEventId_ReturnValue_2;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AGamePlayer* RevivePlayer)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UDefaultCharacterStateMachine_C*        CallFunc_GetComponentByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHalfSkill_1;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bHalfSkillInAim_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCharacterActionState_ReturnValue;    // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable;                                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bHalfSkill;                           // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bHalfSkillInAim;                      // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         K2Node_Select_Default;                             // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ___byte_Variable;                                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ___byte_Variable_1;                                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameCharacterAnimInstance*             K2Node_DynamicCast_AsGame_Character_Anim_Instance; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameCharacterAnimInstance*             K2Node_DynamicCast_AsGame_Character_Anim_Instance_1; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_Event_Who;                                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_Killer;                               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_Event_HealthChangeValue;                    // 0x0088(0x01B0)(ConstParm, ContainsInstancedReference)
	int32                                         K2Node_CustomEvent_SkillID;                        // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_CustomEvent_OriginSkills;                   // 0x0240(0x0010)(ConstParm, ReferenceParm)
	class UGameAbilityComponent*                  K2Node_CustomEvent_AbilityRef;                     // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPerfectDodge_Result;                    // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25A[0x6];                                      // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayer*                            K2Node_CustomEvent_RevivePlayer;                   // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable_1;                                // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameAbilityBuffer*                     CallFunc_ActiveAbilityBuffer_ReturnValue;          // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Select_Default_1;                           // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_BlackOutTime;                   // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStateEventId_ReturnValue_3;            // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable_2;                                // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28A[0x6];                                      // 0x028A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_CreateWidgetByCPP_ReturnValue;            // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterStateEvent                          K2Node_Select_Default_2;                           // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStateEventId_ReturnValue_4;            // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidgetAnimation*>               CallFunc_GetWidgetAnimations_OutAnims;             // 0x02A0(0x0010)(ReferenceParm)
	class UWidgetAnimation*                       CallFunc_Array_Get_Item;                           // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter) == 0x000008, "Wrong alignment on BaseCharacter_C_ExecuteUbergraph_BaseCharacter");
static_assert(sizeof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter) == 0x0002D0, "Wrong size on BaseCharacter_C_ExecuteUbergraph_BaseCharacter");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, EntryPoint) == 0x000000, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::EntryPoint' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000006, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_SetStateEventId_ReturnValue) == 0x000007, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_SetStateEventId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000008, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_SetStateEventId_ReturnValue_1) == 0x000009, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_SetStateEventId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_SetStateEventId_ReturnValue_2) == 0x00000A, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_SetStateEventId_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x00002C, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_GetComponentByClass_ReturnValue) == 0x000030, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, K2Node_Event_bHalfSkill_1) == 0x000038, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::K2Node_Event_bHalfSkill_1' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, K2Node_Event_bHalfSkillInAim_1) == 0x000039, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::K2Node_Event_bHalfSkillInAim_1' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_IsValid_ReturnValue) == 0x00003A, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_CheckCharacterActionState_ReturnValue) == 0x00003B, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_CheckCharacterActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, ___bool_Variable) == 0x00003C, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::___bool_Variable' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, K2Node_Event_bHalfSkill) == 0x00003D, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::K2Node_Event_bHalfSkill' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, K2Node_Event_bHalfSkillInAim) == 0x00003E, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::K2Node_Event_bHalfSkillInAim' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, K2Node_Select_Default) == 0x00003F, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, ___byte_Variable) == 0x000040, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::___byte_Variable' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, ___byte_Variable_1) == 0x000041, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::___byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_GetAnimInstance_ReturnValue) == 0x000048, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000050, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, K2Node_DynamicCast_AsGame_Character_Anim_Instance) == 0x000058, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::K2Node_DynamicCast_AsGame_Character_Anim_Instance' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, K2Node_DynamicCast_AsGame_Character_Anim_Instance_1) == 0x000068, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::K2Node_DynamicCast_AsGame_Character_Anim_Instance_1' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, K2Node_Event_Who) == 0x000078, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::K2Node_Event_Who' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, K2Node_Event_Killer) == 0x000080, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::K2Node_Event_Killer' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, K2Node_Event_HealthChangeValue) == 0x000088, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::K2Node_Event_HealthChangeValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, K2Node_CustomEvent_SkillID) == 0x000238, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::K2Node_CustomEvent_SkillID' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, K2Node_CustomEvent_OriginSkills) == 0x000240, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::K2Node_CustomEvent_OriginSkills' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, K2Node_CustomEvent_AbilityRef) == 0x000250, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::K2Node_CustomEvent_AbilityRef' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000258, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_IsPerfectDodge_Result) == 0x000259, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_IsPerfectDodge_Result' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, K2Node_CustomEvent_RevivePlayer) == 0x000260, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::K2Node_CustomEvent_RevivePlayer' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, ___bool_Variable_1) == 0x000268, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::___bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_ActiveAbilityBuffer_ReturnValue) == 0x000270, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_ActiveAbilityBuffer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, K2Node_Select_Default_1) == 0x000278, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, K2Node_CustomEvent_BlackOutTime) == 0x00027C, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::K2Node_CustomEvent_BlackOutTime' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_SetStateEventId_ReturnValue_3) == 0x000280, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_SetStateEventId_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000284, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, ___bool_Variable_2) == 0x000288, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::___bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000289, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_CreateWidgetByCPP_ReturnValue) == 0x000290, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_CreateWidgetByCPP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, K2Node_Select_Default_2) == 0x000298, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_IsValid_ReturnValue_1) == 0x000299, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_SetStateEventId_ReturnValue_4) == 0x00029A, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_SetStateEventId_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_IsInViewport_ReturnValue) == 0x00029B, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_IsValid_ReturnValue_2) == 0x00029C, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_GetWidgetAnimations_OutAnims) == 0x0002A0, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_GetWidgetAnimations_OutAnims' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_Array_Get_Item) == 0x0002B0, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0002B8, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0002C0, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ExecuteUbergraph_BaseCharacter, CallFunc_IsValid_ReturnValue_3) == 0x0002C8, "Member 'BaseCharacter_C_ExecuteUbergraph_BaseCharacter::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function BaseCharacter.BaseCharacter_C.CanJumpInternal
// 0x0003 (0x0003 - 0x0000)
struct BaseCharacter_C_CanJumpInternal final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerInQTESwitch_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanJumpInternal_ReturnValue;              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseCharacter_C_CanJumpInternal) == 0x000001, "Wrong alignment on BaseCharacter_C_CanJumpInternal");
static_assert(sizeof(BaseCharacter_C_CanJumpInternal) == 0x000003, "Wrong size on BaseCharacter_C_CanJumpInternal");
static_assert(offsetof(BaseCharacter_C_CanJumpInternal, ReturnValue) == 0x000000, "Member 'BaseCharacter_C_CanJumpInternal::ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_CanJumpInternal, CallFunc_IsPlayerInQTESwitch_ReturnValue) == 0x000001, "Member 'BaseCharacter_C_CanJumpInternal::CallFunc_IsPlayerInQTESwitch_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_CanJumpInternal, CallFunc_CanJumpInternal_ReturnValue) == 0x000002, "Member 'BaseCharacter_C_CanJumpInternal::CallFunc_CanJumpInternal_ReturnValue' has a wrong offset!");

// Function BaseCharacter.BaseCharacter_C.ReceiveIsAiming
// 0x0004 (0x0004 - 0x0000)
struct BaseCharacter_C_ReceiveIsAiming final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCharacterActionState_ReturnValue;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckPlayerActionFlag_ReturnValue;        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseCharacter_C_ReceiveIsAiming) == 0x000001, "Wrong alignment on BaseCharacter_C_ReceiveIsAiming");
static_assert(sizeof(BaseCharacter_C_ReceiveIsAiming) == 0x000004, "Wrong size on BaseCharacter_C_ReceiveIsAiming");
static_assert(offsetof(BaseCharacter_C_ReceiveIsAiming, ReturnValue) == 0x000000, "Member 'BaseCharacter_C_ReceiveIsAiming::ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ReceiveIsAiming, CallFunc_CheckCharacterActionState_ReturnValue) == 0x000001, "Member 'BaseCharacter_C_ReceiveIsAiming::CallFunc_CheckCharacterActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacter_C_ReceiveIsAiming, CallFunc_CheckPlayerActionFlag_ReturnValue) == 0x000002, "Member 'BaseCharacter_C_ReceiveIsAiming::CallFunc_CheckPlayerActionFlag_ReturnValue' has a wrong offset!");
