#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BaseMonster

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BaseMonster.BaseMonster_C
// 0x0100 (0x1400 - 0x1300)
class ABaseMonster_C final : public AGameAICharacter
{
public:
	uint8                                         Pad_12F8[0x8];                                     // 0x12F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         ____0______0_F099B516489440C18E75FAA222800AA7;     // 0x1308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____0__Direction_F099B516489440C18E75FAA222800AA7; // 0x130C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_130D[0x3];                                     // 0x130D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     __t_0;                                             // 0x1310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SpecializedParticle01;                             // 0x1318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SpecializedParticle02;                             // 0x1320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SpecializedParticle03;                             // 0x1328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitBlendWeight;                                    // 0x1330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Hit_Bone_Name;                                     // 0x1334(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hit;                                               // 0x133C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_133D[0x3];                                     // 0x133D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class FName>                HitBoneNameChose;                                  // 0x1340(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, float>                      HitBlendWeightChose;                               // 0x1390(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bParticle;                                         // 0x13E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13E1[0x7];                                     // 0x13E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      BlockSpecializedParticle;                          // 0x13E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              SpecializedParticles;                              // 0x13F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void TitanCheckTeammate(class UAbilityComponent* Ability_0);
	void SpecializedEffect(bool bSpecialized, TArray<int32>& SpecializedSkills, const struct FVector& BodyScale, class UCharacterRenderComponent* CharacterRender, float Effect1Scaler, const struct FLinearColor& Effect1LinearColor);
	void CheckIfSelfSpecialized(class UAbilityComponent* Ability_0, bool* bSpecialized, TArray<int32>* SpecializedSkillIDs);
	float Abnormal_LieDownAnimTime(int32 AnimType);
	float Abnormal_RepelAnimTime(int32 AnimType, bool bIsBack);
	float Abnormal_GetUpAnimTime(int32 AnimType);
	void __t_0__FinishedFunc();
	void __t_0__UpdateFunc();
	void Spwaned();
	void ReceiveBeginPlay();
	void BroadcastDeadlyDamage(const struct FApplyDamageResultData& DamageResult);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveDeadlyDamage(const struct FApplyDamageResultData& DamageResultData);
	void ReceiveHitAction(const struct FHitResult& Hit_0);
	void ExecuteUbergraph_BaseMonster(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BaseMonster_C">();
	}
	static class ABaseMonster_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABaseMonster_C>();
	}
};
static_assert(alignof(ABaseMonster_C) == 0x000010, "Wrong alignment on ABaseMonster_C");
static_assert(sizeof(ABaseMonster_C) == 0x001400, "Wrong size on ABaseMonster_C");
static_assert(offsetof(ABaseMonster_C, UberGraphFrame) == 0x001300, "Member 'ABaseMonster_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABaseMonster_C, ____0______0_F099B516489440C18E75FAA222800AA7) == 0x001308, "Member 'ABaseMonster_C::____0______0_F099B516489440C18E75FAA222800AA7' has a wrong offset!");
static_assert(offsetof(ABaseMonster_C, ____0__Direction_F099B516489440C18E75FAA222800AA7) == 0x00130C, "Member 'ABaseMonster_C::____0__Direction_F099B516489440C18E75FAA222800AA7' has a wrong offset!");
static_assert(offsetof(ABaseMonster_C, __t_0) == 0x001310, "Member 'ABaseMonster_C::__t_0' has a wrong offset!");
static_assert(offsetof(ABaseMonster_C, SpecializedParticle01) == 0x001318, "Member 'ABaseMonster_C::SpecializedParticle01' has a wrong offset!");
static_assert(offsetof(ABaseMonster_C, SpecializedParticle02) == 0x001320, "Member 'ABaseMonster_C::SpecializedParticle02' has a wrong offset!");
static_assert(offsetof(ABaseMonster_C, SpecializedParticle03) == 0x001328, "Member 'ABaseMonster_C::SpecializedParticle03' has a wrong offset!");
static_assert(offsetof(ABaseMonster_C, HitBlendWeight) == 0x001330, "Member 'ABaseMonster_C::HitBlendWeight' has a wrong offset!");
static_assert(offsetof(ABaseMonster_C, Hit_Bone_Name) == 0x001334, "Member 'ABaseMonster_C::Hit_Bone_Name' has a wrong offset!");
static_assert(offsetof(ABaseMonster_C, Hit) == 0x00133C, "Member 'ABaseMonster_C::Hit' has a wrong offset!");
static_assert(offsetof(ABaseMonster_C, HitBoneNameChose) == 0x001340, "Member 'ABaseMonster_C::HitBoneNameChose' has a wrong offset!");
static_assert(offsetof(ABaseMonster_C, HitBlendWeightChose) == 0x001390, "Member 'ABaseMonster_C::HitBlendWeightChose' has a wrong offset!");
static_assert(offsetof(ABaseMonster_C, bParticle) == 0x0013E0, "Member 'ABaseMonster_C::bParticle' has a wrong offset!");
static_assert(offsetof(ABaseMonster_C, BlockSpecializedParticle) == 0x0013E8, "Member 'ABaseMonster_C::BlockSpecializedParticle' has a wrong offset!");
static_assert(offsetof(ABaseMonster_C, SpecializedParticles) == 0x0013F0, "Member 'ABaseMonster_C::SpecializedParticles' has a wrong offset!");

}

