#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BaseMonster

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BaseMonster.BaseMonster_C.TitanCheckTeammate
// 0x0030 (0x0030 - 0x0000)
struct BaseMonster_C_TitanCheckTeammate final
{
public:
	class UAbilityComponent*                      Ability_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 TitanEliteID;                                      // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         MemberCount;                                       // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
};
static_assert(alignof(BaseMonster_C_TitanCheckTeammate) == 0x000008, "Wrong alignment on BaseMonster_C_TitanCheckTeammate");
static_assert(sizeof(BaseMonster_C_TitanCheckTeammate) == 0x000030, "Wrong size on BaseMonster_C_TitanCheckTeammate");
static_assert(offsetof(BaseMonster_C_TitanCheckTeammate, Ability_0) == 0x000000, "Member 'BaseMonster_C_TitanCheckTeammate::Ability_0' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_TitanCheckTeammate, TitanEliteID) == 0x000008, "Member 'BaseMonster_C_TitanCheckTeammate::TitanEliteID' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_TitanCheckTeammate, MemberCount) == 0x000018, "Member 'BaseMonster_C_TitanCheckTeammate::MemberCount' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_TitanCheckTeammate, K2Node_MakeArray_Array) == 0x000020, "Member 'BaseMonster_C_TitanCheckTeammate::K2Node_MakeArray_Array' has a wrong offset!");

// Function BaseMonster.BaseMonster_C.SpecializedEffect
// 0x0108 (0x0108 - 0x0000)
struct BaseMonster_C_SpecializedEffect final
{
public:
	bool                                          bSpecialized;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 SpecializedSkills;                                 // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                BodyScale;                                         // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterRenderComponent*              CharacterRender;                                   // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Effect1Scaler;                                     // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Effect1LinearColor;                                // 0x0034(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EffectId;                                          // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStandalone_ReturnValue;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        CallFunc_MakeSoftObjectPath_ReturnValue;           // 0x0058(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         CallFunc_LoadNiagaraAsset_ReturnValue;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBaseValue_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttributeChangeValue                  K2Node_MakeStruct_AttributeChangeValue;            // 0x0088(0x0020)(NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttributeChangeValue                  K2Node_MakeStruct_AttributeChangeValue_1;          // 0x00B0(0x0020)(NoDestructor, ContainsInstancedReference)
	class UAbilityComponentBase*                  CallFunc_ApplyAttributeChange_ReturnValue;         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponentBase*                  CallFunc_ApplyAttributeChange_ReturnValue_1;       // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_1;        // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_2;        // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseMonster_C_SpecializedEffect) == 0x000008, "Wrong alignment on BaseMonster_C_SpecializedEffect");
static_assert(sizeof(BaseMonster_C_SpecializedEffect) == 0x000108, "Wrong size on BaseMonster_C_SpecializedEffect");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, bSpecialized) == 0x000000, "Member 'BaseMonster_C_SpecializedEffect::bSpecialized' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, SpecializedSkills) == 0x000008, "Member 'BaseMonster_C_SpecializedEffect::SpecializedSkills' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, BodyScale) == 0x000018, "Member 'BaseMonster_C_SpecializedEffect::BodyScale' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, CharacterRender) == 0x000028, "Member 'BaseMonster_C_SpecializedEffect::CharacterRender' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, Effect1Scaler) == 0x000030, "Member 'BaseMonster_C_SpecializedEffect::Effect1Scaler' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, Effect1LinearColor) == 0x000034, "Member 'BaseMonster_C_SpecializedEffect::Effect1LinearColor' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, EffectId) == 0x000044, "Member 'BaseMonster_C_SpecializedEffect::EffectId' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, CallFunc_IsStandalone_ReturnValue) == 0x000048, "Member 'BaseMonster_C_SpecializedEffect::CallFunc_IsStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, CallFunc_Array_Add_ReturnValue) == 0x00004C, "Member 'BaseMonster_C_SpecializedEffect::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, CallFunc_IsServer_ReturnValue) == 0x000050, "Member 'BaseMonster_C_SpecializedEffect::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, CallFunc_MakeSoftObjectPath_ReturnValue) == 0x000058, "Member 'BaseMonster_C_SpecializedEffect::CallFunc_MakeSoftObjectPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, CallFunc_Not_PreBool_ReturnValue) == 0x000070, "Member 'BaseMonster_C_SpecializedEffect::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, CallFunc_LoadNiagaraAsset_ReturnValue) == 0x000078, "Member 'BaseMonster_C_SpecializedEffect::CallFunc_LoadNiagaraAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, CallFunc_BooleanOR_ReturnValue) == 0x000080, "Member 'BaseMonster_C_SpecializedEffect::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, CallFunc_GetBaseValue_ReturnValue) == 0x000084, "Member 'BaseMonster_C_SpecializedEffect::CallFunc_GetBaseValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, K2Node_MakeStruct_AttributeChangeValue) == 0x000088, "Member 'BaseMonster_C_SpecializedEffect::K2Node_MakeStruct_AttributeChangeValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000A8, "Member 'BaseMonster_C_SpecializedEffect::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, K2Node_MakeStruct_AttributeChangeValue_1) == 0x0000B0, "Member 'BaseMonster_C_SpecializedEffect::K2Node_MakeStruct_AttributeChangeValue_1' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, CallFunc_ApplyAttributeChange_ReturnValue) == 0x0000D0, "Member 'BaseMonster_C_SpecializedEffect::CallFunc_ApplyAttributeChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, CallFunc_ApplyAttributeChange_ReturnValue_1) == 0x0000D8, "Member 'BaseMonster_C_SpecializedEffect::CallFunc_ApplyAttributeChange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, CallFunc_SpawnSystemAttached_ReturnValue) == 0x0000E0, "Member 'BaseMonster_C_SpecializedEffect::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, CallFunc_Array_Add_ReturnValue_1) == 0x0000E8, "Member 'BaseMonster_C_SpecializedEffect::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, CallFunc_SpawnSystemAttached_ReturnValue_1) == 0x0000F0, "Member 'BaseMonster_C_SpecializedEffect::CallFunc_SpawnSystemAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, CallFunc_SpawnSystemAttached_ReturnValue_2) == 0x0000F8, "Member 'BaseMonster_C_SpecializedEffect::CallFunc_SpawnSystemAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, CallFunc_Array_Add_ReturnValue_2) == 0x000100, "Member 'BaseMonster_C_SpecializedEffect::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_SpecializedEffect, CallFunc_IsValid_ReturnValue) == 0x000104, "Member 'BaseMonster_C_SpecializedEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BaseMonster.BaseMonster_C.CheckIfSelfSpecialized
// 0x0070 (0x0070 - 0x0000)
struct BaseMonster_C_CheckIfSelfSpecialized final
{
public:
	class UAbilityComponent*                      Ability_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSpecialized;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 SpecializedSkillIDs;                               // 0x0010(0x0010)(Parm, OutParm)
	TArray<int32>                                 Array;                                             // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         Count;                                             // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable;                                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseMonster_C_CheckIfSelfSpecialized) == 0x000008, "Wrong alignment on BaseMonster_C_CheckIfSelfSpecialized");
static_assert(sizeof(BaseMonster_C_CheckIfSelfSpecialized) == 0x000070, "Wrong size on BaseMonster_C_CheckIfSelfSpecialized");
static_assert(offsetof(BaseMonster_C_CheckIfSelfSpecialized, Ability_0) == 0x000000, "Member 'BaseMonster_C_CheckIfSelfSpecialized::Ability_0' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_CheckIfSelfSpecialized, bSpecialized) == 0x000008, "Member 'BaseMonster_C_CheckIfSelfSpecialized::bSpecialized' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_CheckIfSelfSpecialized, SpecializedSkillIDs) == 0x000010, "Member 'BaseMonster_C_CheckIfSelfSpecialized::SpecializedSkillIDs' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_CheckIfSelfSpecialized, Array) == 0x000020, "Member 'BaseMonster_C_CheckIfSelfSpecialized::Array' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_CheckIfSelfSpecialized, Count) == 0x000030, "Member 'BaseMonster_C_CheckIfSelfSpecialized::Count' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_CheckIfSelfSpecialized, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'BaseMonster_C_CheckIfSelfSpecialized::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_CheckIfSelfSpecialized, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BaseMonster_C_CheckIfSelfSpecialized::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_CheckIfSelfSpecialized, CallFunc_Array_Length_ReturnValue_1) == 0x00003C, "Member 'BaseMonster_C_CheckIfSelfSpecialized::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_CheckIfSelfSpecialized, ___int_Array_Index_Variable) == 0x000040, "Member 'BaseMonster_C_CheckIfSelfSpecialized::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_CheckIfSelfSpecialized, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000044, "Member 'BaseMonster_C_CheckIfSelfSpecialized::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_CheckIfSelfSpecialized, CallFunc_Array_Get_Item) == 0x000048, "Member 'BaseMonster_C_CheckIfSelfSpecialized::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_CheckIfSelfSpecialized, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'BaseMonster_C_CheckIfSelfSpecialized::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_CheckIfSelfSpecialized, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00004D, "Member 'BaseMonster_C_CheckIfSelfSpecialized::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_CheckIfSelfSpecialized, CallFunc_BooleanAND_ReturnValue) == 0x00004E, "Member 'BaseMonster_C_CheckIfSelfSpecialized::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_CheckIfSelfSpecialized, ___int_Loop_Counter_Variable) == 0x000050, "Member 'BaseMonster_C_CheckIfSelfSpecialized::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_CheckIfSelfSpecialized, CallFunc_Less_IntInt_ReturnValue_1) == 0x000054, "Member 'BaseMonster_C_CheckIfSelfSpecialized::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_CheckIfSelfSpecialized, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'BaseMonster_C_CheckIfSelfSpecialized::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_CheckIfSelfSpecialized, ___int_Variable) == 0x00005C, "Member 'BaseMonster_C_CheckIfSelfSpecialized::___int_Variable' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_CheckIfSelfSpecialized, CallFunc_Array_Add_ReturnValue) == 0x000060, "Member 'BaseMonster_C_CheckIfSelfSpecialized::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_CheckIfSelfSpecialized, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000064, "Member 'BaseMonster_C_CheckIfSelfSpecialized::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_CheckIfSelfSpecialized, CallFunc_Add_IntInt_ReturnValue_1) == 0x000068, "Member 'BaseMonster_C_CheckIfSelfSpecialized::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BaseMonster.BaseMonster_C.Abnormal_LieDownAnimTime
// 0x0028 (0x0028 - 0x0000)
struct BaseMonster_C_Abnormal_LieDownAnimTime final
{
public:
	int32                                         AnimType;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbnormalAnimBP_C*                      K2Node_DynamicCast_AsAbnormal_Anim_BP;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseMonster_C_Abnormal_LieDownAnimTime) == 0x000008, "Wrong alignment on BaseMonster_C_Abnormal_LieDownAnimTime");
static_assert(sizeof(BaseMonster_C_Abnormal_LieDownAnimTime) == 0x000028, "Wrong size on BaseMonster_C_Abnormal_LieDownAnimTime");
static_assert(offsetof(BaseMonster_C_Abnormal_LieDownAnimTime, AnimType) == 0x000000, "Member 'BaseMonster_C_Abnormal_LieDownAnimTime::AnimType' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_Abnormal_LieDownAnimTime, ReturnValue) == 0x000004, "Member 'BaseMonster_C_Abnormal_LieDownAnimTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_Abnormal_LieDownAnimTime, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'BaseMonster_C_Abnormal_LieDownAnimTime::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_Abnormal_LieDownAnimTime, CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue) == 0x000010, "Member 'BaseMonster_C_Abnormal_LieDownAnimTime::CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_Abnormal_LieDownAnimTime, K2Node_DynamicCast_AsAbnormal_Anim_BP) == 0x000018, "Member 'BaseMonster_C_Abnormal_LieDownAnimTime::K2Node_DynamicCast_AsAbnormal_Anim_BP' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_Abnormal_LieDownAnimTime, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BaseMonster_C_Abnormal_LieDownAnimTime::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_Abnormal_LieDownAnimTime, CallFunc_GetPlayLength_ReturnValue) == 0x000024, "Member 'BaseMonster_C_Abnormal_LieDownAnimTime::CallFunc_GetPlayLength_ReturnValue' has a wrong offset!");

// Function BaseMonster.BaseMonster_C.Abnormal_RepelAnimTime
// 0x0040 (0x0040 - 0x0000)
struct BaseMonster_C_Abnormal_RepelAnimTime final
{
public:
	int32                                         AnimType;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsBack;                                           // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbnormalAnimBP_C*                      K2Node_DynamicCast_AsAbnormal_Anim_BP;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayLength_ReturnValue_1;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayLength_ReturnValue_2;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseMonster_C_Abnormal_RepelAnimTime) == 0x000008, "Wrong alignment on BaseMonster_C_Abnormal_RepelAnimTime");
static_assert(sizeof(BaseMonster_C_Abnormal_RepelAnimTime) == 0x000040, "Wrong size on BaseMonster_C_Abnormal_RepelAnimTime");
static_assert(offsetof(BaseMonster_C_Abnormal_RepelAnimTime, AnimType) == 0x000000, "Member 'BaseMonster_C_Abnormal_RepelAnimTime::AnimType' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_Abnormal_RepelAnimTime, bIsBack) == 0x000004, "Member 'BaseMonster_C_Abnormal_RepelAnimTime::bIsBack' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_Abnormal_RepelAnimTime, ReturnValue) == 0x000008, "Member 'BaseMonster_C_Abnormal_RepelAnimTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_Abnormal_RepelAnimTime, K2Node_SwitchInteger_CmpSuccess) == 0x00000C, "Member 'BaseMonster_C_Abnormal_RepelAnimTime::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_Abnormal_RepelAnimTime, CallFunc_GetAnimInstance_ReturnValue) == 0x000010, "Member 'BaseMonster_C_Abnormal_RepelAnimTime::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_Abnormal_RepelAnimTime, CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue) == 0x000018, "Member 'BaseMonster_C_Abnormal_RepelAnimTime::CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_Abnormal_RepelAnimTime, K2Node_DynamicCast_AsAbnormal_Anim_BP) == 0x000020, "Member 'BaseMonster_C_Abnormal_RepelAnimTime::K2Node_DynamicCast_AsAbnormal_Anim_BP' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_Abnormal_RepelAnimTime, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BaseMonster_C_Abnormal_RepelAnimTime::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_Abnormal_RepelAnimTime, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BaseMonster_C_Abnormal_RepelAnimTime::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_Abnormal_RepelAnimTime, CallFunc_GetPlayLength_ReturnValue) == 0x00002C, "Member 'BaseMonster_C_Abnormal_RepelAnimTime::CallFunc_GetPlayLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_Abnormal_RepelAnimTime, CallFunc_GetPlayLength_ReturnValue_1) == 0x000030, "Member 'BaseMonster_C_Abnormal_RepelAnimTime::CallFunc_GetPlayLength_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_Abnormal_RepelAnimTime, CallFunc_GetPlayLength_ReturnValue_2) == 0x000034, "Member 'BaseMonster_C_Abnormal_RepelAnimTime::CallFunc_GetPlayLength_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_Abnormal_RepelAnimTime, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BaseMonster_C_Abnormal_RepelAnimTime::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BaseMonster.BaseMonster_C.Abnormal_GetUpAnimTime
// 0x0028 (0x0028 - 0x0000)
struct BaseMonster_C_Abnormal_GetUpAnimTime final
{
public:
	int32                                         AnimType;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbnormalAnimBP_C*                      K2Node_DynamicCast_AsAbnormal_Anim_BP;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseMonster_C_Abnormal_GetUpAnimTime) == 0x000008, "Wrong alignment on BaseMonster_C_Abnormal_GetUpAnimTime");
static_assert(sizeof(BaseMonster_C_Abnormal_GetUpAnimTime) == 0x000028, "Wrong size on BaseMonster_C_Abnormal_GetUpAnimTime");
static_assert(offsetof(BaseMonster_C_Abnormal_GetUpAnimTime, AnimType) == 0x000000, "Member 'BaseMonster_C_Abnormal_GetUpAnimTime::AnimType' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_Abnormal_GetUpAnimTime, ReturnValue) == 0x000004, "Member 'BaseMonster_C_Abnormal_GetUpAnimTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_Abnormal_GetUpAnimTime, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'BaseMonster_C_Abnormal_GetUpAnimTime::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_Abnormal_GetUpAnimTime, CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue) == 0x000010, "Member 'BaseMonster_C_Abnormal_GetUpAnimTime::CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_Abnormal_GetUpAnimTime, K2Node_DynamicCast_AsAbnormal_Anim_BP) == 0x000018, "Member 'BaseMonster_C_Abnormal_GetUpAnimTime::K2Node_DynamicCast_AsAbnormal_Anim_BP' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_Abnormal_GetUpAnimTime, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BaseMonster_C_Abnormal_GetUpAnimTime::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_Abnormal_GetUpAnimTime, CallFunc_GetPlayLength_ReturnValue) == 0x000024, "Member 'BaseMonster_C_Abnormal_GetUpAnimTime::CallFunc_GetPlayLength_ReturnValue' has a wrong offset!");

// Function BaseMonster.BaseMonster_C.BroadcastDeadlyDamage
// 0x00C0 (0x00C0 - 0x0000)
struct BaseMonster_C_BroadcastDeadlyDamage final
{
public:
	struct FApplyDamageResultData                 DamageResult;                                      // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BaseMonster_C_BroadcastDeadlyDamage) == 0x000008, "Wrong alignment on BaseMonster_C_BroadcastDeadlyDamage");
static_assert(sizeof(BaseMonster_C_BroadcastDeadlyDamage) == 0x0000C0, "Wrong size on BaseMonster_C_BroadcastDeadlyDamage");
static_assert(offsetof(BaseMonster_C_BroadcastDeadlyDamage, DamageResult) == 0x000000, "Member 'BaseMonster_C_BroadcastDeadlyDamage::DamageResult' has a wrong offset!");

// Function BaseMonster.BaseMonster_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BaseMonster_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseMonster_C_ReceiveTick) == 0x000004, "Wrong alignment on BaseMonster_C_ReceiveTick");
static_assert(sizeof(BaseMonster_C_ReceiveTick) == 0x000004, "Wrong size on BaseMonster_C_ReceiveTick");
static_assert(offsetof(BaseMonster_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BaseMonster_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BaseMonster.BaseMonster_C.ReceiveDeadlyDamage
// 0x00C0 (0x00C0 - 0x0000)
struct BaseMonster_C_ReceiveDeadlyDamage final
{
public:
	struct FApplyDamageResultData                 DamageResultData;                                  // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BaseMonster_C_ReceiveDeadlyDamage) == 0x000008, "Wrong alignment on BaseMonster_C_ReceiveDeadlyDamage");
static_assert(sizeof(BaseMonster_C_ReceiveDeadlyDamage) == 0x0000C0, "Wrong size on BaseMonster_C_ReceiveDeadlyDamage");
static_assert(offsetof(BaseMonster_C_ReceiveDeadlyDamage, DamageResultData) == 0x000000, "Member 'BaseMonster_C_ReceiveDeadlyDamage::DamageResultData' has a wrong offset!");

// Function BaseMonster.BaseMonster_C.ReceiveHitAction
// 0x008C (0x008C - 0x0000)
struct BaseMonster_C_ReceiveHitAction final
{
public:
	struct FHitResult                             Hit_0;                                             // 0x0000(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BaseMonster_C_ReceiveHitAction) == 0x000004, "Wrong alignment on BaseMonster_C_ReceiveHitAction");
static_assert(sizeof(BaseMonster_C_ReceiveHitAction) == 0x00008C, "Wrong size on BaseMonster_C_ReceiveHitAction");
static_assert(offsetof(BaseMonster_C_ReceiveHitAction, Hit_0) == 0x000000, "Member 'BaseMonster_C_ReceiveHitAction::Hit_0' has a wrong offset!");

// Function BaseMonster.BaseMonster_C.ExecuteUbergraph_BaseMonster
// 0x0258 (0x0258 - 0x0000)
struct BaseMonster_C_ExecuteUbergraph_BaseMonster final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FApplyDamageResultData                 K2Node_CustomEvent_DamageResult;                   // 0x0008(0x00C0)(ContainsInstancedReference)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FApplyDamageResultData                 K2Node_CustomEvent_DamageResultData;               // 0x00D0(0x00C0)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_193[0x1];                                      // 0x0193(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0194(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void(struct FApplyDamageResultData& DamageResultData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0220(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CheckIfSelfSpecialized_bSpecialized;      // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_CheckIfSelfSpecialized_SpecializedSkillIDs; // 0x0238(0x0010)(ReferenceParm)
	bool                                          CallFunc_K2_SpecializedTick_ReturnValue;           // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseMonster_C_ExecuteUbergraph_BaseMonster) == 0x000008, "Wrong alignment on BaseMonster_C_ExecuteUbergraph_BaseMonster");
static_assert(sizeof(BaseMonster_C_ExecuteUbergraph_BaseMonster) == 0x000258, "Wrong size on BaseMonster_C_ExecuteUbergraph_BaseMonster");
static_assert(offsetof(BaseMonster_C_ExecuteUbergraph_BaseMonster, EntryPoint) == 0x000000, "Member 'BaseMonster_C_ExecuteUbergraph_BaseMonster::EntryPoint' has a wrong offset!");
static_assert(offsetof(BaseMonster_C_ExecuteUbergraph_BaseMonster, K2Node_CustomEvent_DamageResult) == 0x000008, "Member 'BaseMonster_C_ExecuteUbergraph_BaseMonster::K2Node_CustomEvent_DamageResult' has a wrong offset!");
