#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BaseCharacter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"
#include "CharacterStateEvent_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BaseCharacter.BaseCharacter_C
// 0x0050 (0x2360 - 0x2310)
#pragma pack(push, 0x1)
class alignas(0x10) ABaseCharacter_C : public AGamePlayer
{
public:
	uint8                                         Pad_2308[0x8];                                     // 0x2308(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAttributeAgentInstance_C*              AttributeAgentInstance;                            // 0x2318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          RepelAnimRef;                                      // 0x2320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          GetUpAnimRef;                                      // 0x2328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GetUpEndTerminationEarly;                          // 0x2330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInPerfectDodge;                                   // 0x2334(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2335[0x3];                                     // 0x2335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameAbilityBuffer>         ReviveGodBuffer;                                   // 0x2338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<struct FParamInfo>                     ParamInfos;                                        // 0x2340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MinLOD;                                            // 0x2350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoSpeedWarping;                                    // 0x2354(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void RemoveEnchantEmitterForFire();
	void AddEnchantEmitterForFire();
	void RemoveEnchantEmitter(int32 EmitterID);
	void AddEnchantEmitter(int32 EmitterID, class UAbilityComponentBase* Launcher, bool bApplyBySource, int32 Level_0);
	void Set_Camera_Lag(bool CameraLag);
	void IsInPerfectDodge(bool* InPerfectDodge);
	void IsPerfectDodge(int32 SkillID, bool* Result);
	float Abnormal_RepelAnimTime(int32 AnimType, bool bIsBack);
	float Abnormal_GetUpAnimTime(int32 AnimType);
	void Finished_FF22B03A46B8695D518850B1FF8A56E3();
	void ReceiveBeginPlay();
	void ReceiveSkillEnd(bool bHalfSkill, bool bHalfSkillInAim);
	void ReceiveSkillStart(bool bHalfSkill, bool bHalfSkillInAim);
	void OnDie(class AGameCharacter* Who, class AGameCharacter* Killer, const struct FHealthChangeValue& HealthChangeValue);
	void OnAbilityCastSkill_Event_0(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void ActiveReviveGod(class AGamePlayer* RevivePlayer);
	void ShowFightMaskEvent(float BlackOutTime);
	void ExecuteUbergraph_BaseCharacter(int32 EntryPoint);

	bool CanJumpInternal() const;
	bool ReceiveIsAiming() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BaseCharacter_C">();
	}
	static class ABaseCharacter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABaseCharacter_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(ABaseCharacter_C) == 0x000010, "Wrong alignment on ABaseCharacter_C");
static_assert(sizeof(ABaseCharacter_C) == 0x002360, "Wrong size on ABaseCharacter_C");
static_assert(offsetof(ABaseCharacter_C, UberGraphFrame) == 0x002310, "Member 'ABaseCharacter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABaseCharacter_C, AttributeAgentInstance) == 0x002318, "Member 'ABaseCharacter_C::AttributeAgentInstance' has a wrong offset!");
static_assert(offsetof(ABaseCharacter_C, RepelAnimRef) == 0x002320, "Member 'ABaseCharacter_C::RepelAnimRef' has a wrong offset!");
static_assert(offsetof(ABaseCharacter_C, GetUpAnimRef) == 0x002328, "Member 'ABaseCharacter_C::GetUpAnimRef' has a wrong offset!");
static_assert(offsetof(ABaseCharacter_C, GetUpEndTerminationEarly) == 0x002330, "Member 'ABaseCharacter_C::GetUpEndTerminationEarly' has a wrong offset!");
static_assert(offsetof(ABaseCharacter_C, bInPerfectDodge) == 0x002334, "Member 'ABaseCharacter_C::bInPerfectDodge' has a wrong offset!");
static_assert(offsetof(ABaseCharacter_C, ReviveGodBuffer) == 0x002338, "Member 'ABaseCharacter_C::ReviveGodBuffer' has a wrong offset!");
static_assert(offsetof(ABaseCharacter_C, ParamInfos) == 0x002340, "Member 'ABaseCharacter_C::ParamInfos' has a wrong offset!");
static_assert(offsetof(ABaseCharacter_C, MinLOD) == 0x002350, "Member 'ABaseCharacter_C::MinLOD' has a wrong offset!");
static_assert(offsetof(ABaseCharacter_C, NoSpeedWarping) == 0x002354, "Member 'ABaseCharacter_C::NoSpeedWarping' has a wrong offset!");

}

