#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Blindage

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Blindage_structs.hpp"


namespace SDK::Params
{

// Function Blindage.BlindageGenerateInterface.OnBlindageGenerated
// 0x0008 (0x0008 - 0x0000)
struct BlindageGenerateInterface_OnBlindageGenerated final
{
public:
	class ABlindage*                              Blindage;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlindageGenerateInterface_OnBlindageGenerated) == 0x000008, "Wrong alignment on BlindageGenerateInterface_OnBlindageGenerated");
static_assert(sizeof(BlindageGenerateInterface_OnBlindageGenerated) == 0x000008, "Wrong size on BlindageGenerateInterface_OnBlindageGenerated");
static_assert(offsetof(BlindageGenerateInterface_OnBlindageGenerated, Blindage) == 0x000000, "Member 'BlindageGenerateInterface_OnBlindageGenerated::Blindage' has a wrong offset!");

// Function Blindage.BlindageInteract.GetLeftBufferTime
// 0x0004 (0x0004 - 0x0000)
struct BlindageInteract_GetLeftBufferTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlindageInteract_GetLeftBufferTime) == 0x000004, "Wrong alignment on BlindageInteract_GetLeftBufferTime");
static_assert(sizeof(BlindageInteract_GetLeftBufferTime) == 0x000004, "Wrong size on BlindageInteract_GetLeftBufferTime");
static_assert(offsetof(BlindageInteract_GetLeftBufferTime, ReturnValue) == 0x000000, "Member 'BlindageInteract_GetLeftBufferTime::ReturnValue' has a wrong offset!");

// Function Blindage.BlindageInteract.GetPlayerLocationInBlindage
// 0x0018 (0x0018 - 0x0000)
struct BlindageInteract_GetPlayerLocationInBlindage final
{
public:
	class ABlindage*                              Blindage;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BlindageInteract_GetPlayerLocationInBlindage) == 0x000008, "Wrong alignment on BlindageInteract_GetPlayerLocationInBlindage");
static_assert(sizeof(BlindageInteract_GetPlayerLocationInBlindage) == 0x000018, "Wrong size on BlindageInteract_GetPlayerLocationInBlindage");
static_assert(offsetof(BlindageInteract_GetPlayerLocationInBlindage, Blindage) == 0x000000, "Member 'BlindageInteract_GetPlayerLocationInBlindage::Blindage' has a wrong offset!");
static_assert(offsetof(BlindageInteract_GetPlayerLocationInBlindage, ReturnValue) == 0x000008, "Member 'BlindageInteract_GetPlayerLocationInBlindage::ReturnValue' has a wrong offset!");

// Function Blindage.BlindageInteract.GetRightBufferTime
// 0x0004 (0x0004 - 0x0000)
struct BlindageInteract_GetRightBufferTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlindageInteract_GetRightBufferTime) == 0x000004, "Wrong alignment on BlindageInteract_GetRightBufferTime");
static_assert(sizeof(BlindageInteract_GetRightBufferTime) == 0x000004, "Wrong size on BlindageInteract_GetRightBufferTime");
static_assert(offsetof(BlindageInteract_GetRightBufferTime, ReturnValue) == 0x000000, "Member 'BlindageInteract_GetRightBufferTime::ReturnValue' has a wrong offset!");

// Function Blindage.BlindageInteract.IsLeftMoveBuffering
// 0x0001 (0x0001 - 0x0000)
struct BlindageInteract_IsLeftMoveBuffering final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlindageInteract_IsLeftMoveBuffering) == 0x000001, "Wrong alignment on BlindageInteract_IsLeftMoveBuffering");
static_assert(sizeof(BlindageInteract_IsLeftMoveBuffering) == 0x000001, "Wrong size on BlindageInteract_IsLeftMoveBuffering");
static_assert(offsetof(BlindageInteract_IsLeftMoveBuffering, ReturnValue) == 0x000000, "Member 'BlindageInteract_IsLeftMoveBuffering::ReturnValue' has a wrong offset!");

// Function Blindage.BlindageInteract.IsPlayerBlindageEdgeMove
// 0x0010 (0x0010 - 0x0000)
struct BlindageInteract_IsPlayerBlindageEdgeMove final
{
public:
	class ABlindage*                              Blindage;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BlindageInteract_IsPlayerBlindageEdgeMove) == 0x000008, "Wrong alignment on BlindageInteract_IsPlayerBlindageEdgeMove");
static_assert(sizeof(BlindageInteract_IsPlayerBlindageEdgeMove) == 0x000010, "Wrong size on BlindageInteract_IsPlayerBlindageEdgeMove");
static_assert(offsetof(BlindageInteract_IsPlayerBlindageEdgeMove, Blindage) == 0x000000, "Member 'BlindageInteract_IsPlayerBlindageEdgeMove::Blindage' has a wrong offset!");
static_assert(offsetof(BlindageInteract_IsPlayerBlindageEdgeMove, ReturnValue) == 0x000008, "Member 'BlindageInteract_IsPlayerBlindageEdgeMove::ReturnValue' has a wrong offset!");

// Function Blindage.BlindageInteract.IsPlayerInBlindageState
// 0x0001 (0x0001 - 0x0000)
struct BlindageInteract_IsPlayerInBlindageState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlindageInteract_IsPlayerInBlindageState) == 0x000001, "Wrong alignment on BlindageInteract_IsPlayerInBlindageState");
static_assert(sizeof(BlindageInteract_IsPlayerInBlindageState) == 0x000001, "Wrong size on BlindageInteract_IsPlayerInBlindageState");
static_assert(offsetof(BlindageInteract_IsPlayerInBlindageState, ReturnValue) == 0x000000, "Member 'BlindageInteract_IsPlayerInBlindageState::ReturnValue' has a wrong offset!");

// Function Blindage.BlindageInteract.IsRightMoveBuffering
// 0x0001 (0x0001 - 0x0000)
struct BlindageInteract_IsRightMoveBuffering final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlindageInteract_IsRightMoveBuffering) == 0x000001, "Wrong alignment on BlindageInteract_IsRightMoveBuffering");
static_assert(sizeof(BlindageInteract_IsRightMoveBuffering) == 0x000001, "Wrong size on BlindageInteract_IsRightMoveBuffering");
static_assert(offsetof(BlindageInteract_IsRightMoveBuffering, ReturnValue) == 0x000000, "Member 'BlindageInteract_IsRightMoveBuffering::ReturnValue' has a wrong offset!");

// Function Blindage.BlindageInteract.LeftMoveBuffering
// 0x0001 (0x0001 - 0x0000)
struct BlindageInteract_LeftMoveBuffering final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlindageInteract_LeftMoveBuffering) == 0x000001, "Wrong alignment on BlindageInteract_LeftMoveBuffering");
static_assert(sizeof(BlindageInteract_LeftMoveBuffering) == 0x000001, "Wrong size on BlindageInteract_LeftMoveBuffering");
static_assert(offsetof(BlindageInteract_LeftMoveBuffering, bValue) == 0x000000, "Member 'BlindageInteract_LeftMoveBuffering::bValue' has a wrong offset!");

// Function Blindage.BlindageInteract.OnBlindageDestroy
// 0x0008 (0x0008 - 0x0000)
struct BlindageInteract_OnBlindageDestroy final
{
public:
	class ABlindage*                              Blindage;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlindageInteract_OnBlindageDestroy) == 0x000008, "Wrong alignment on BlindageInteract_OnBlindageDestroy");
static_assert(sizeof(BlindageInteract_OnBlindageDestroy) == 0x000008, "Wrong size on BlindageInteract_OnBlindageDestroy");
static_assert(offsetof(BlindageInteract_OnBlindageDestroy, Blindage) == 0x000000, "Member 'BlindageInteract_OnBlindageDestroy::Blindage' has a wrong offset!");

// Function Blindage.BlindageInteract.OnCatchedByBlindage
// 0x0008 (0x0008 - 0x0000)
struct BlindageInteract_OnCatchedByBlindage final
{
public:
	class ABlindage*                              Blindage;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlindageInteract_OnCatchedByBlindage) == 0x000008, "Wrong alignment on BlindageInteract_OnCatchedByBlindage");
static_assert(sizeof(BlindageInteract_OnCatchedByBlindage) == 0x000008, "Wrong size on BlindageInteract_OnCatchedByBlindage");
static_assert(offsetof(BlindageInteract_OnCatchedByBlindage, Blindage) == 0x000000, "Member 'BlindageInteract_OnCatchedByBlindage::Blindage' has a wrong offset!");

// Function Blindage.BlindageInteract.OnEnterBlindageCollision
// 0x0008 (0x0008 - 0x0000)
struct BlindageInteract_OnEnterBlindageCollision final
{
public:
	class ABlindage*                              Blindage;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlindageInteract_OnEnterBlindageCollision) == 0x000008, "Wrong alignment on BlindageInteract_OnEnterBlindageCollision");
static_assert(sizeof(BlindageInteract_OnEnterBlindageCollision) == 0x000008, "Wrong size on BlindageInteract_OnEnterBlindageCollision");
static_assert(offsetof(BlindageInteract_OnEnterBlindageCollision, Blindage) == 0x000000, "Member 'BlindageInteract_OnEnterBlindageCollision::Blindage' has a wrong offset!");

// Function Blindage.BlindageInteract.OnLeaveBlindage
// 0x0008 (0x0008 - 0x0000)
struct BlindageInteract_OnLeaveBlindage final
{
public:
	class ABlindage*                              Blindage;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlindageInteract_OnLeaveBlindage) == 0x000008, "Wrong alignment on BlindageInteract_OnLeaveBlindage");
static_assert(sizeof(BlindageInteract_OnLeaveBlindage) == 0x000008, "Wrong size on BlindageInteract_OnLeaveBlindage");
static_assert(offsetof(BlindageInteract_OnLeaveBlindage, Blindage) == 0x000000, "Member 'BlindageInteract_OnLeaveBlindage::Blindage' has a wrong offset!");

// Function Blindage.BlindageInteract.OnLeaveBlindageCollision
// 0x0008 (0x0008 - 0x0000)
struct BlindageInteract_OnLeaveBlindageCollision final
{
public:
	class ABlindage*                              Blindage;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlindageInteract_OnLeaveBlindageCollision) == 0x000008, "Wrong alignment on BlindageInteract_OnLeaveBlindageCollision");
static_assert(sizeof(BlindageInteract_OnLeaveBlindageCollision) == 0x000008, "Wrong size on BlindageInteract_OnLeaveBlindageCollision");
static_assert(offsetof(BlindageInteract_OnLeaveBlindageCollision, Blindage) == 0x000000, "Member 'BlindageInteract_OnLeaveBlindageCollision::Blindage' has a wrong offset!");

// Function Blindage.BlindageInteract.RightMoveBuffering
// 0x0001 (0x0001 - 0x0000)
struct BlindageInteract_RightMoveBuffering final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlindageInteract_RightMoveBuffering) == 0x000001, "Wrong alignment on BlindageInteract_RightMoveBuffering");
static_assert(sizeof(BlindageInteract_RightMoveBuffering) == 0x000001, "Wrong size on BlindageInteract_RightMoveBuffering");
static_assert(offsetof(BlindageInteract_RightMoveBuffering, bValue) == 0x000000, "Member 'BlindageInteract_RightMoveBuffering::bValue' has a wrong offset!");

// Function Blindage.BlindageInteract.SetLeftBufferTime
// 0x0004 (0x0004 - 0x0000)
struct BlindageInteract_SetLeftBufferTime final
{
public:
	float                                         FValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlindageInteract_SetLeftBufferTime) == 0x000004, "Wrong alignment on BlindageInteract_SetLeftBufferTime");
static_assert(sizeof(BlindageInteract_SetLeftBufferTime) == 0x000004, "Wrong size on BlindageInteract_SetLeftBufferTime");
static_assert(offsetof(BlindageInteract_SetLeftBufferTime, FValue) == 0x000000, "Member 'BlindageInteract_SetLeftBufferTime::FValue' has a wrong offset!");

// Function Blindage.BlindageInteract.SetRightBufferTime
// 0x0004 (0x0004 - 0x0000)
struct BlindageInteract_SetRightBufferTime final
{
public:
	float                                         FValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlindageInteract_SetRightBufferTime) == 0x000004, "Wrong alignment on BlindageInteract_SetRightBufferTime");
static_assert(sizeof(BlindageInteract_SetRightBufferTime) == 0x000004, "Wrong size on BlindageInteract_SetRightBufferTime");
static_assert(offsetof(BlindageInteract_SetRightBufferTime, FValue) == 0x000000, "Member 'BlindageInteract_SetRightBufferTime::FValue' has a wrong offset!");

// Function Blindage.BlindageInteract.GetEnterPositionMaxAngle
// 0x0004 (0x0004 - 0x0000)
struct BlindageInteract_GetEnterPositionMaxAngle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlindageInteract_GetEnterPositionMaxAngle) == 0x000004, "Wrong alignment on BlindageInteract_GetEnterPositionMaxAngle");
static_assert(sizeof(BlindageInteract_GetEnterPositionMaxAngle) == 0x000004, "Wrong size on BlindageInteract_GetEnterPositionMaxAngle");
static_assert(offsetof(BlindageInteract_GetEnterPositionMaxAngle, ReturnValue) == 0x000000, "Member 'BlindageInteract_GetEnterPositionMaxAngle::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.ShowDebugArea
// 0x0010 (0x0010 - 0x0000)
struct Blindage_ShowDebugArea final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShow;                                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Blindage_ShowDebugArea) == 0x000008, "Wrong alignment on Blindage_ShowDebugArea");
static_assert(sizeof(Blindage_ShowDebugArea) == 0x000010, "Wrong size on Blindage_ShowDebugArea");
static_assert(offsetof(Blindage_ShowDebugArea, WorldContextObject) == 0x000000, "Member 'Blindage_ShowDebugArea::WorldContextObject' has a wrong offset!");
static_assert(offsetof(Blindage_ShowDebugArea, bShow) == 0x000008, "Member 'Blindage_ShowDebugArea::bShow' has a wrong offset!");

// Function Blindage.Blindage.GetBlindageLinks_Left
// 0x0010 (0x0010 - 0x0000)
struct Blindage_GetBlindageLinks_Left final
{
public:
	TArray<struct FBlindageLinkInfo>              ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetBlindageLinks_Left) == 0x000008, "Wrong alignment on Blindage_GetBlindageLinks_Left");
static_assert(sizeof(Blindage_GetBlindageLinks_Left) == 0x000010, "Wrong size on Blindage_GetBlindageLinks_Left");
static_assert(offsetof(Blindage_GetBlindageLinks_Left, ReturnValue) == 0x000000, "Member 'Blindage_GetBlindageLinks_Left::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetBlindageLinks_Right
// 0x0010 (0x0010 - 0x0000)
struct Blindage_GetBlindageLinks_Right final
{
public:
	TArray<struct FBlindageLinkInfo>              ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetBlindageLinks_Right) == 0x000008, "Wrong alignment on Blindage_GetBlindageLinks_Right");
static_assert(sizeof(Blindage_GetBlindageLinks_Right) == 0x000010, "Wrong size on Blindage_GetBlindageLinks_Right");
static_assert(offsetof(Blindage_GetBlindageLinks_Right, ReturnValue) == 0x000000, "Member 'Blindage_GetBlindageLinks_Right::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetEnterArea
// 0x0018 (0x0018 - 0x0000)
struct Blindage_GetEnterArea final
{
public:
	class ACharacter*                             GameCharacter;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ProjectPos;                                        // 0x0008(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBlindageEnterType                            ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Blindage_GetEnterArea) == 0x000008, "Wrong alignment on Blindage_GetEnterArea");
static_assert(sizeof(Blindage_GetEnterArea) == 0x000018, "Wrong size on Blindage_GetEnterArea");
static_assert(offsetof(Blindage_GetEnterArea, GameCharacter) == 0x000000, "Member 'Blindage_GetEnterArea::GameCharacter' has a wrong offset!");
static_assert(offsetof(Blindage_GetEnterArea, ProjectPos) == 0x000008, "Member 'Blindage_GetEnterArea::ProjectPos' has a wrong offset!");
static_assert(offsetof(Blindage_GetEnterArea, ReturnValue) == 0x000014, "Member 'Blindage_GetEnterArea::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.IsInForbidShootArea
// 0x0010 (0x0010 - 0x0000)
struct Blindage_IsInForbidShootArea final
{
public:
	struct FVector                                Pos;                                               // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Blindage_IsInForbidShootArea) == 0x000004, "Wrong alignment on Blindage_IsInForbidShootArea");
static_assert(sizeof(Blindage_IsInForbidShootArea) == 0x000010, "Wrong size on Blindage_IsInForbidShootArea");
static_assert(offsetof(Blindage_IsInForbidShootArea, Pos) == 0x000000, "Member 'Blindage_IsInForbidShootArea::Pos' has a wrong offset!");
static_assert(offsetof(Blindage_IsInForbidShootArea, ReturnValue) == 0x00000C, "Member 'Blindage_IsInForbidShootArea::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.OnBeginOverLap
// 0x00B0 (0x00B0 - 0x0000)
struct Blindage_OnBeginOverLap final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Blindage_OnBeginOverLap) == 0x000008, "Wrong alignment on Blindage_OnBeginOverLap");
static_assert(sizeof(Blindage_OnBeginOverLap) == 0x0000B0, "Wrong size on Blindage_OnBeginOverLap");
static_assert(offsetof(Blindage_OnBeginOverLap, OverlappedComp) == 0x000000, "Member 'Blindage_OnBeginOverLap::OverlappedComp' has a wrong offset!");
static_assert(offsetof(Blindage_OnBeginOverLap, OtherActor) == 0x000008, "Member 'Blindage_OnBeginOverLap::OtherActor' has a wrong offset!");
static_assert(offsetof(Blindage_OnBeginOverLap, OtherComp) == 0x000010, "Member 'Blindage_OnBeginOverLap::OtherComp' has a wrong offset!");
static_assert(offsetof(Blindage_OnBeginOverLap, OtherBodyIndex) == 0x000018, "Member 'Blindage_OnBeginOverLap::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Blindage_OnBeginOverLap, bFromSweep) == 0x00001C, "Member 'Blindage_OnBeginOverLap::bFromSweep' has a wrong offset!");
static_assert(offsetof(Blindage_OnBeginOverLap, SweepResult) == 0x000020, "Member 'Blindage_OnBeginOverLap::SweepResult' has a wrong offset!");

// Function Blindage.Blindage.OnEndOverLap
// 0x0020 (0x0020 - 0x0000)
struct Blindage_OnEndOverLap final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Blindage_OnEndOverLap) == 0x000008, "Wrong alignment on Blindage_OnEndOverLap");
static_assert(sizeof(Blindage_OnEndOverLap) == 0x000020, "Wrong size on Blindage_OnEndOverLap");
static_assert(offsetof(Blindage_OnEndOverLap, OverlappedComp) == 0x000000, "Member 'Blindage_OnEndOverLap::OverlappedComp' has a wrong offset!");
static_assert(offsetof(Blindage_OnEndOverLap, OtherActor) == 0x000008, "Member 'Blindage_OnEndOverLap::OtherActor' has a wrong offset!");
static_assert(offsetof(Blindage_OnEndOverLap, OtherComp) == 0x000010, "Member 'Blindage_OnEndOverLap::OtherComp' has a wrong offset!");
static_assert(offsetof(Blindage_OnEndOverLap, OtherBodyIndex) == 0x000018, "Member 'Blindage_OnEndOverLap::OtherBodyIndex' has a wrong offset!");

// Function Blindage.Blindage.SetBlindageTickEnable
// 0x0001 (0x0001 - 0x0000)
struct Blindage_SetBlindageTickEnable final
{
public:
	bool                                          bInEnabled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_SetBlindageTickEnable) == 0x000001, "Wrong alignment on Blindage_SetBlindageTickEnable");
static_assert(sizeof(Blindage_SetBlindageTickEnable) == 0x000001, "Wrong size on Blindage_SetBlindageTickEnable");
static_assert(offsetof(Blindage_SetBlindageTickEnable, bInEnabled) == 0x000000, "Member 'Blindage_SetBlindageTickEnable::bInEnabled' has a wrong offset!");

// Function Blindage.Blindage.SetClimbMeshInfo
// 0x0040 (0x0040 - 0x0000)
struct Blindage_SetClimbMeshInfo final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Width;                                             // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Length;                                            // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Blindage_SetClimbMeshInfo) == 0x000010, "Wrong alignment on Blindage_SetClimbMeshInfo");
static_assert(sizeof(Blindage_SetClimbMeshInfo) == 0x000040, "Wrong size on Blindage_SetClimbMeshInfo");
static_assert(offsetof(Blindage_SetClimbMeshInfo, Transform) == 0x000000, "Member 'Blindage_SetClimbMeshInfo::Transform' has a wrong offset!");
static_assert(offsetof(Blindage_SetClimbMeshInfo, Width) == 0x000030, "Member 'Blindage_SetClimbMeshInfo::Width' has a wrong offset!");
static_assert(offsetof(Blindage_SetClimbMeshInfo, Length) == 0x000034, "Member 'Blindage_SetClimbMeshInfo::Length' has a wrong offset!");
static_assert(offsetof(Blindage_SetClimbMeshInfo, Height) == 0x000038, "Member 'Blindage_SetClimbMeshInfo::Height' has a wrong offset!");

// Function Blindage.Blindage.CheckClimbInfo
// 0x0038 (0x0038 - 0x0000)
struct Blindage_CheckClimbInfo final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InClimbDir;                                        // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxCrossDistance;                                  // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtraEndOffset;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FClimbCheckInfo                        ReturnValue;                                       // 0x001C(0x001C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_CheckClimbInfo) == 0x000008, "Wrong alignment on Blindage_CheckClimbInfo");
static_assert(sizeof(Blindage_CheckClimbInfo) == 0x000038, "Wrong size on Blindage_CheckClimbInfo");
static_assert(offsetof(Blindage_CheckClimbInfo, Character) == 0x000000, "Member 'Blindage_CheckClimbInfo::Character' has a wrong offset!");
static_assert(offsetof(Blindage_CheckClimbInfo, InClimbDir) == 0x000008, "Member 'Blindage_CheckClimbInfo::InClimbDir' has a wrong offset!");
static_assert(offsetof(Blindage_CheckClimbInfo, MaxCrossDistance) == 0x000014, "Member 'Blindage_CheckClimbInfo::MaxCrossDistance' has a wrong offset!");
static_assert(offsetof(Blindage_CheckClimbInfo, ExtraEndOffset) == 0x000018, "Member 'Blindage_CheckClimbInfo::ExtraEndOffset' has a wrong offset!");
static_assert(offsetof(Blindage_CheckClimbInfo, ReturnValue) == 0x00001C, "Member 'Blindage_CheckClimbInfo::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetBackMoveDistance
// 0x0004 (0x0004 - 0x0000)
struct Blindage_GetBackMoveDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetBackMoveDistance) == 0x000004, "Wrong alignment on Blindage_GetBackMoveDistance");
static_assert(sizeof(Blindage_GetBackMoveDistance) == 0x000004, "Wrong size on Blindage_GetBackMoveDistance");
static_assert(offsetof(Blindage_GetBackMoveDistance, ReturnValue) == 0x000000, "Member 'Blindage_GetBackMoveDistance::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetBlindageForward
// 0x000C (0x000C - 0x0000)
struct Blindage_GetBlindageForward final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetBlindageForward) == 0x000004, "Wrong alignment on Blindage_GetBlindageForward");
static_assert(sizeof(Blindage_GetBlindageForward) == 0x00000C, "Wrong size on Blindage_GetBlindageForward");
static_assert(offsetof(Blindage_GetBlindageForward, ReturnValue) == 0x000000, "Member 'Blindage_GetBlindageForward::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetBlindageHorizontalForward
// 0x000C (0x000C - 0x0000)
struct Blindage_GetBlindageHorizontalForward final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetBlindageHorizontalForward) == 0x000004, "Wrong alignment on Blindage_GetBlindageHorizontalForward");
static_assert(sizeof(Blindage_GetBlindageHorizontalForward) == 0x00000C, "Wrong size on Blindage_GetBlindageHorizontalForward");
static_assert(offsetof(Blindage_GetBlindageHorizontalForward, ReturnValue) == 0x000000, "Member 'Blindage_GetBlindageHorizontalForward::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetBlindageHorizontalRight
// 0x000C (0x000C - 0x0000)
struct Blindage_GetBlindageHorizontalRight final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetBlindageHorizontalRight) == 0x000004, "Wrong alignment on Blindage_GetBlindageHorizontalRight");
static_assert(sizeof(Blindage_GetBlindageHorizontalRight) == 0x00000C, "Wrong size on Blindage_GetBlindageHorizontalRight");
static_assert(offsetof(Blindage_GetBlindageHorizontalRight, ReturnValue) == 0x000000, "Member 'Blindage_GetBlindageHorizontalRight::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetBlindageOrientation
// 0x000C (0x000C - 0x0000)
struct Blindage_GetBlindageOrientation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetBlindageOrientation) == 0x000004, "Wrong alignment on Blindage_GetBlindageOrientation");
static_assert(sizeof(Blindage_GetBlindageOrientation) == 0x00000C, "Wrong size on Blindage_GetBlindageOrientation");
static_assert(offsetof(Blindage_GetBlindageOrientation, ReturnValue) == 0x000000, "Member 'Blindage_GetBlindageOrientation::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetBlindageRight
// 0x000C (0x000C - 0x0000)
struct Blindage_GetBlindageRight final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetBlindageRight) == 0x000004, "Wrong alignment on Blindage_GetBlindageRight");
static_assert(sizeof(Blindage_GetBlindageRight) == 0x00000C, "Wrong size on Blindage_GetBlindageRight");
static_assert(offsetof(Blindage_GetBlindageRight, ReturnValue) == 0x000000, "Member 'Blindage_GetBlindageRight::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetBlindageType
// 0x0001 (0x0001 - 0x0000)
struct Blindage_GetBlindageType final
{
public:
	EBlindageType                                 ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetBlindageType) == 0x000001, "Wrong alignment on Blindage_GetBlindageType");
static_assert(sizeof(Blindage_GetBlindageType) == 0x000001, "Wrong size on Blindage_GetBlindageType");
static_assert(offsetof(Blindage_GetBlindageType, ReturnValue) == 0x000000, "Member 'Blindage_GetBlindageType::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetClimbOffsetEnd
// 0x0004 (0x0004 - 0x0000)
struct Blindage_GetClimbOffsetEnd final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetClimbOffsetEnd) == 0x000004, "Wrong alignment on Blindage_GetClimbOffsetEnd");
static_assert(sizeof(Blindage_GetClimbOffsetEnd) == 0x000004, "Wrong size on Blindage_GetClimbOffsetEnd");
static_assert(offsetof(Blindage_GetClimbOffsetEnd, ReturnValue) == 0x000000, "Member 'Blindage_GetClimbOffsetEnd::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetClimbOffsetStart
// 0x0004 (0x0004 - 0x0000)
struct Blindage_GetClimbOffsetStart final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetClimbOffsetStart) == 0x000004, "Wrong alignment on Blindage_GetClimbOffsetStart");
static_assert(sizeof(Blindage_GetClimbOffsetStart) == 0x000004, "Wrong size on Blindage_GetClimbOffsetStart");
static_assert(offsetof(Blindage_GetClimbOffsetStart, ReturnValue) == 0x000000, "Member 'Blindage_GetClimbOffsetStart::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetEnterPosition
// 0x0018 (0x0018 - 0x0000)
struct Blindage_GetEnterPosition final
{
public:
	const class ACharacter*                       GameCharacter;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Blindage_GetEnterPosition) == 0x000008, "Wrong alignment on Blindage_GetEnterPosition");
static_assert(sizeof(Blindage_GetEnterPosition) == 0x000018, "Wrong size on Blindage_GetEnterPosition");
static_assert(offsetof(Blindage_GetEnterPosition, GameCharacter) == 0x000000, "Member 'Blindage_GetEnterPosition::GameCharacter' has a wrong offset!");
static_assert(offsetof(Blindage_GetEnterPosition, ReturnValue) == 0x000008, "Member 'Blindage_GetEnterPosition::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetEnterPosition_WithPos
// 0x0020 (0x0020 - 0x0000)
struct Blindage_GetEnterPosition_WithPos final
{
public:
	const class ACharacter*                       GameCharacter;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PredictPos;                                        // 0x0008(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0014(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetEnterPosition_WithPos) == 0x000008, "Wrong alignment on Blindage_GetEnterPosition_WithPos");
static_assert(sizeof(Blindage_GetEnterPosition_WithPos) == 0x000020, "Wrong size on Blindage_GetEnterPosition_WithPos");
static_assert(offsetof(Blindage_GetEnterPosition_WithPos, GameCharacter) == 0x000000, "Member 'Blindage_GetEnterPosition_WithPos::GameCharacter' has a wrong offset!");
static_assert(offsetof(Blindage_GetEnterPosition_WithPos, PredictPos) == 0x000008, "Member 'Blindage_GetEnterPosition_WithPos::PredictPos' has a wrong offset!");
static_assert(offsetof(Blindage_GetEnterPosition_WithPos, ReturnValue) == 0x000014, "Member 'Blindage_GetEnterPosition_WithPos::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetFrontEdge
// 0x000C (0x000C - 0x0000)
struct Blindage_GetFrontEdge final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetFrontEdge) == 0x000004, "Wrong alignment on Blindage_GetFrontEdge");
static_assert(sizeof(Blindage_GetFrontEdge) == 0x00000C, "Wrong size on Blindage_GetFrontEdge");
static_assert(offsetof(Blindage_GetFrontEdge, ReturnValue) == 0x000000, "Member 'Blindage_GetFrontEdge::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetFullBlindageForbidShootAngle
// 0x0004 (0x0004 - 0x0000)
struct Blindage_GetFullBlindageForbidShootAngle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetFullBlindageForbidShootAngle) == 0x000004, "Wrong alignment on Blindage_GetFullBlindageForbidShootAngle");
static_assert(sizeof(Blindage_GetFullBlindageForbidShootAngle) == 0x000004, "Wrong size on Blindage_GetFullBlindageForbidShootAngle");
static_assert(offsetof(Blindage_GetFullBlindageForbidShootAngle, ReturnValue) == 0x000000, "Member 'Blindage_GetFullBlindageForbidShootAngle::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetFullBunkerBackMoveDistance
// 0x0004 (0x0004 - 0x0000)
struct Blindage_GetFullBunkerBackMoveDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetFullBunkerBackMoveDistance) == 0x000004, "Wrong alignment on Blindage_GetFullBunkerBackMoveDistance");
static_assert(sizeof(Blindage_GetFullBunkerBackMoveDistance) == 0x000004, "Wrong size on Blindage_GetFullBunkerBackMoveDistance");
static_assert(offsetof(Blindage_GetFullBunkerBackMoveDistance, ReturnValue) == 0x000000, "Member 'Blindage_GetFullBunkerBackMoveDistance::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetHalfBunkerBackMoveDistance
// 0x0004 (0x0004 - 0x0000)
struct Blindage_GetHalfBunkerBackMoveDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetHalfBunkerBackMoveDistance) == 0x000004, "Wrong alignment on Blindage_GetHalfBunkerBackMoveDistance");
static_assert(sizeof(Blindage_GetHalfBunkerBackMoveDistance) == 0x000004, "Wrong size on Blindage_GetHalfBunkerBackMoveDistance");
static_assert(offsetof(Blindage_GetHalfBunkerBackMoveDistance, ReturnValue) == 0x000000, "Member 'Blindage_GetHalfBunkerBackMoveDistance::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetLeftEdge
// 0x000C (0x000C - 0x0000)
struct Blindage_GetLeftEdge final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetLeftEdge) == 0x000004, "Wrong alignment on Blindage_GetLeftEdge");
static_assert(sizeof(Blindage_GetLeftEdge) == 0x00000C, "Wrong size on Blindage_GetLeftEdge");
static_assert(offsetof(Blindage_GetLeftEdge, ReturnValue) == 0x000000, "Member 'Blindage_GetLeftEdge::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetLeftEdge_WithOutStandOffset
// 0x000C (0x000C - 0x0000)
struct Blindage_GetLeftEdge_WithOutStandOffset final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetLeftEdge_WithOutStandOffset) == 0x000004, "Wrong alignment on Blindage_GetLeftEdge_WithOutStandOffset");
static_assert(sizeof(Blindage_GetLeftEdge_WithOutStandOffset) == 0x00000C, "Wrong size on Blindage_GetLeftEdge_WithOutStandOffset");
static_assert(offsetof(Blindage_GetLeftEdge_WithOutStandOffset, ReturnValue) == 0x000000, "Member 'Blindage_GetLeftEdge_WithOutStandOffset::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetLeftEnterPoint
// 0x000C (0x000C - 0x0000)
struct Blindage_GetLeftEnterPoint final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetLeftEnterPoint) == 0x000004, "Wrong alignment on Blindage_GetLeftEnterPoint");
static_assert(sizeof(Blindage_GetLeftEnterPoint) == 0x00000C, "Wrong size on Blindage_GetLeftEnterPoint");
static_assert(offsetof(Blindage_GetLeftEnterPoint, ReturnValue) == 0x000000, "Member 'Blindage_GetLeftEnterPoint::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetLeftShootPoint
// 0x000C (0x000C - 0x0000)
struct Blindage_GetLeftShootPoint final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetLeftShootPoint) == 0x000004, "Wrong alignment on Blindage_GetLeftShootPoint");
static_assert(sizeof(Blindage_GetLeftShootPoint) == 0x00000C, "Wrong size on Blindage_GetLeftShootPoint");
static_assert(offsetof(Blindage_GetLeftShootPoint, ReturnValue) == 0x000000, "Member 'Blindage_GetLeftShootPoint::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetMeshClimbActualLength
// 0x0004 (0x0004 - 0x0000)
struct Blindage_GetMeshClimbActualLength final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetMeshClimbActualLength) == 0x000004, "Wrong alignment on Blindage_GetMeshClimbActualLength");
static_assert(sizeof(Blindage_GetMeshClimbActualLength) == 0x000004, "Wrong size on Blindage_GetMeshClimbActualLength");
static_assert(offsetof(Blindage_GetMeshClimbActualLength, ReturnValue) == 0x000000, "Member 'Blindage_GetMeshClimbActualLength::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetMeshClimbHeight
// 0x0004 (0x0004 - 0x0000)
struct Blindage_GetMeshClimbHeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetMeshClimbHeight) == 0x000004, "Wrong alignment on Blindage_GetMeshClimbHeight");
static_assert(sizeof(Blindage_GetMeshClimbHeight) == 0x000004, "Wrong size on Blindage_GetMeshClimbHeight");
static_assert(offsetof(Blindage_GetMeshClimbHeight, ReturnValue) == 0x000000, "Member 'Blindage_GetMeshClimbHeight::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetMeshClimbLength
// 0x0004 (0x0004 - 0x0000)
struct Blindage_GetMeshClimbLength final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetMeshClimbLength) == 0x000004, "Wrong alignment on Blindage_GetMeshClimbLength");
static_assert(sizeof(Blindage_GetMeshClimbLength) == 0x000004, "Wrong size on Blindage_GetMeshClimbLength");
static_assert(offsetof(Blindage_GetMeshClimbLength, ReturnValue) == 0x000000, "Member 'Blindage_GetMeshClimbLength::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetMeshClimbWidth
// 0x0004 (0x0004 - 0x0000)
struct Blindage_GetMeshClimbWidth final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetMeshClimbWidth) == 0x000004, "Wrong alignment on Blindage_GetMeshClimbWidth");
static_assert(sizeof(Blindage_GetMeshClimbWidth) == 0x000004, "Wrong size on Blindage_GetMeshClimbWidth");
static_assert(offsetof(Blindage_GetMeshClimbWidth, ReturnValue) == 0x000000, "Member 'Blindage_GetMeshClimbWidth::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetMoveQuitLeftPos
// 0x000C (0x000C - 0x0000)
struct Blindage_GetMoveQuitLeftPos final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetMoveQuitLeftPos) == 0x000004, "Wrong alignment on Blindage_GetMoveQuitLeftPos");
static_assert(sizeof(Blindage_GetMoveQuitLeftPos) == 0x00000C, "Wrong size on Blindage_GetMoveQuitLeftPos");
static_assert(offsetof(Blindage_GetMoveQuitLeftPos, ReturnValue) == 0x000000, "Member 'Blindage_GetMoveQuitLeftPos::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetMoveQuitRightPos
// 0x000C (0x000C - 0x0000)
struct Blindage_GetMoveQuitRightPos final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetMoveQuitRightPos) == 0x000004, "Wrong alignment on Blindage_GetMoveQuitRightPos");
static_assert(sizeof(Blindage_GetMoveQuitRightPos) == 0x00000C, "Wrong size on Blindage_GetMoveQuitRightPos");
static_assert(offsetof(Blindage_GetMoveQuitRightPos, ReturnValue) == 0x000000, "Member 'Blindage_GetMoveQuitRightPos::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetRightEdge
// 0x000C (0x000C - 0x0000)
struct Blindage_GetRightEdge final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetRightEdge) == 0x000004, "Wrong alignment on Blindage_GetRightEdge");
static_assert(sizeof(Blindage_GetRightEdge) == 0x00000C, "Wrong size on Blindage_GetRightEdge");
static_assert(offsetof(Blindage_GetRightEdge, ReturnValue) == 0x000000, "Member 'Blindage_GetRightEdge::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetRightEdge_WithOutStandOffset
// 0x000C (0x000C - 0x0000)
struct Blindage_GetRightEdge_WithOutStandOffset final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetRightEdge_WithOutStandOffset) == 0x000004, "Wrong alignment on Blindage_GetRightEdge_WithOutStandOffset");
static_assert(sizeof(Blindage_GetRightEdge_WithOutStandOffset) == 0x00000C, "Wrong size on Blindage_GetRightEdge_WithOutStandOffset");
static_assert(offsetof(Blindage_GetRightEdge_WithOutStandOffset, ReturnValue) == 0x000000, "Member 'Blindage_GetRightEdge_WithOutStandOffset::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetRightEnterPoint
// 0x000C (0x000C - 0x0000)
struct Blindage_GetRightEnterPoint final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetRightEnterPoint) == 0x000004, "Wrong alignment on Blindage_GetRightEnterPoint");
static_assert(sizeof(Blindage_GetRightEnterPoint) == 0x00000C, "Wrong size on Blindage_GetRightEnterPoint");
static_assert(offsetof(Blindage_GetRightEnterPoint, ReturnValue) == 0x000000, "Member 'Blindage_GetRightEnterPoint::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetRightShootPoint
// 0x000C (0x000C - 0x0000)
struct Blindage_GetRightShootPoint final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_GetRightShootPoint) == 0x000004, "Wrong alignment on Blindage_GetRightShootPoint");
static_assert(sizeof(Blindage_GetRightShootPoint) == 0x00000C, "Wrong size on Blindage_GetRightShootPoint");
static_assert(offsetof(Blindage_GetRightShootPoint, ReturnValue) == 0x000000, "Member 'Blindage_GetRightShootPoint::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetSpecificDirTouchPosition
// 0x0018 (0x0018 - 0x0000)
struct Blindage_GetSpecificDirTouchPosition final
{
public:
	const class ACharacter*                       GameCharacter;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Blindage_GetSpecificDirTouchPosition) == 0x000008, "Wrong alignment on Blindage_GetSpecificDirTouchPosition");
static_assert(sizeof(Blindage_GetSpecificDirTouchPosition) == 0x000018, "Wrong size on Blindage_GetSpecificDirTouchPosition");
static_assert(offsetof(Blindage_GetSpecificDirTouchPosition, GameCharacter) == 0x000000, "Member 'Blindage_GetSpecificDirTouchPosition::GameCharacter' has a wrong offset!");
static_assert(offsetof(Blindage_GetSpecificDirTouchPosition, ReturnValue) == 0x000008, "Member 'Blindage_GetSpecificDirTouchPosition::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.GetTouchPosition
// 0x0018 (0x0018 - 0x0000)
struct Blindage_GetTouchPosition final
{
public:
	const class ACharacter*                       GameCharacter;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Blindage_GetTouchPosition) == 0x000008, "Wrong alignment on Blindage_GetTouchPosition");
static_assert(sizeof(Blindage_GetTouchPosition) == 0x000018, "Wrong size on Blindage_GetTouchPosition");
static_assert(offsetof(Blindage_GetTouchPosition, GameCharacter) == 0x000000, "Member 'Blindage_GetTouchPosition::GameCharacter' has a wrong offset!");
static_assert(offsetof(Blindage_GetTouchPosition, ReturnValue) == 0x000008, "Member 'Blindage_GetTouchPosition::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.IsClimbable
// 0x0001 (0x0001 - 0x0000)
struct Blindage_IsClimbable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Blindage_IsClimbable) == 0x000001, "Wrong alignment on Blindage_IsClimbable");
static_assert(sizeof(Blindage_IsClimbable) == 0x000001, "Wrong size on Blindage_IsClimbable");
static_assert(offsetof(Blindage_IsClimbable, ReturnValue) == 0x000000, "Member 'Blindage_IsClimbable::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.IsInAutoCatchArea
// 0x0010 (0x0010 - 0x0000)
struct Blindage_IsInAutoCatchArea final
{
public:
	const class ACharacter*                       Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Blindage_IsInAutoCatchArea) == 0x000008, "Wrong alignment on Blindage_IsInAutoCatchArea");
static_assert(sizeof(Blindage_IsInAutoCatchArea) == 0x000010, "Wrong size on Blindage_IsInAutoCatchArea");
static_assert(offsetof(Blindage_IsInAutoCatchArea, Actor) == 0x000000, "Member 'Blindage_IsInAutoCatchArea::Actor' has a wrong offset!");
static_assert(offsetof(Blindage_IsInAutoCatchArea, ReturnValue) == 0x000008, "Member 'Blindage_IsInAutoCatchArea::ReturnValue' has a wrong offset!");

// Function Blindage.Blindage.IsInBackEnterArea
// 0x0010 (0x0010 - 0x0000)
struct Blindage_IsInBackEnterArea final
{
public:
