#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Blindage

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum Blindage.EBlindageEnterType
// NumValues: 0x0005
enum class EBlindageEnterType : uint8
{
	ENTER_INVALID                            = 0,
	ENTER_LEFT                               = 1,
	ENTER_RIGHT                              = 2,
	ENTER_MIDDLE                             = 3,
	ENTER_MAX                                = 4,
};

// Enum Blindage.EBlindageType
// NumValues: 0x0005
enum class EBlindageType : uint8
{
	Invalid                                  = 0,
	Half                                     = 1,
	Full                                     = 2,
	ClimbOnly                                = 3,
	EBlindageType_MAX                        = 4,
};

// Enum Blindage.EBlindageLinkMoveType
// NumValues: 0x0004
enum class EBlindageLinkMoveType : uint8
{
	Dodge                                    = 0,
	SwitchOver                               = 1,
	WalkTo                                   = 2,
	EBlindageLinkMoveType_MAX                = 3,
};

// Enum Blindage.EBlindageLinkType
// NumValues: 0x0005
enum class EBlindageLinkType : uint8
{
	Left                                     = 0,
	Right                                    = 1,
	Center                                   = 2,
	Custom                                   = 3,
	EBlindageLinkType_MAX                    = 4,
};

// ScriptStruct Blindage.ClimbCheckInfo
// 0x001C (0x001C - 0x0000)
struct FClimbCheckInfo final
{
public:
	struct FVector                                PosBegin;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PosEnd;                                            // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClimbable;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FClimbCheckInfo) == 0x000004, "Wrong alignment on FClimbCheckInfo");
static_assert(sizeof(FClimbCheckInfo) == 0x00001C, "Wrong size on FClimbCheckInfo");
static_assert(offsetof(FClimbCheckInfo, PosBegin) == 0x000000, "Member 'FClimbCheckInfo::PosBegin' has a wrong offset!");
static_assert(offsetof(FClimbCheckInfo, PosEnd) == 0x00000C, "Member 'FClimbCheckInfo::PosEnd' has a wrong offset!");
static_assert(offsetof(FClimbCheckInfo, bClimbable) == 0x000018, "Member 'FClimbCheckInfo::bClimbable' has a wrong offset!");

// ScriptStruct Blindage.BlindageForbidShootArea
// 0x0008 (0x0008 - 0x0000)
struct FBlindageForbidShootArea final
{
public:
	float                                         ForbitShootStart;                                  // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForbitShootEnd;                                    // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBlindageForbidShootArea) == 0x000004, "Wrong alignment on FBlindageForbidShootArea");
static_assert(sizeof(FBlindageForbidShootArea) == 0x000008, "Wrong size on FBlindageForbidShootArea");
static_assert(offsetof(FBlindageForbidShootArea, ForbitShootStart) == 0x000000, "Member 'FBlindageForbidShootArea::ForbitShootStart' has a wrong offset!");
static_assert(offsetof(FBlindageForbidShootArea, ForbitShootEnd) == 0x000004, "Member 'FBlindageForbidShootArea::ForbitShootEnd' has a wrong offset!");

// ScriptStruct Blindage.BlindageModifier
// 0x0010 (0x0010 - 0x0000)
struct FBlindageModifier final
{
public:
	class FName                                   CollisionName;                                     // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerate;                                         // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCombined;                                         // 0x0009(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bModifyClimbable;                                  // 0x000A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClimbable;                                        // 0x000B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Angle;                                             // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBlindageModifier) == 0x000004, "Wrong alignment on FBlindageModifier");
static_assert(sizeof(FBlindageModifier) == 0x000010, "Wrong size on FBlindageModifier");
static_assert(offsetof(FBlindageModifier, CollisionName) == 0x000000, "Member 'FBlindageModifier::CollisionName' has a wrong offset!");
static_assert(offsetof(FBlindageModifier, bGenerate) == 0x000008, "Member 'FBlindageModifier::bGenerate' has a wrong offset!");
static_assert(offsetof(FBlindageModifier, bCombined) == 0x000009, "Member 'FBlindageModifier::bCombined' has a wrong offset!");
static_assert(offsetof(FBlindageModifier, bModifyClimbable) == 0x00000A, "Member 'FBlindageModifier::bModifyClimbable' has a wrong offset!");
static_assert(offsetof(FBlindageModifier, bClimbable) == 0x00000B, "Member 'FBlindageModifier::bClimbable' has a wrong offset!");
static_assert(offsetof(FBlindageModifier, Angle) == 0x00000C, "Member 'FBlindageModifier::Angle' has a wrong offset!");

// ScriptStruct Blindage.BlindageInfo
// 0x0018 (0x0018 - 0x0000)
struct FBlindageInfo final
{
public:
	int32                                         Index;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBlindageModifier>              Modifiers;                                         // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBlindageInfo) == 0x000008, "Wrong alignment on FBlindageInfo");
static_assert(sizeof(FBlindageInfo) == 0x000018, "Wrong size on FBlindageInfo");
static_assert(offsetof(FBlindageInfo, Index) == 0x000000, "Member 'FBlindageInfo::Index' has a wrong offset!");
static_assert(offsetof(FBlindageInfo, Modifiers) == 0x000008, "Member 'FBlindageInfo::Modifiers' has a wrong offset!");

// ScriptStruct Blindage.BlindageLinkInfo
// 0x000C (0x000C - 0x0000)
struct FBlindageLinkInfo final
{
public:
	TWeakObjectPtr<class ABlindage>               LinkBlindage;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBlindageLinkType                             LinkType;                                          // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBlindageLinkMoveType                         MoveType;                                          // 0x0009(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBlindageLinkType                             FromLinkType;                                      // 0x000A(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FBlindageLinkInfo) == 0x000004, "Wrong alignment on FBlindageLinkInfo");
static_assert(sizeof(FBlindageLinkInfo) == 0x00000C, "Wrong size on FBlindageLinkInfo");
static_assert(offsetof(FBlindageLinkInfo, LinkBlindage) == 0x000000, "Member 'FBlindageLinkInfo::LinkBlindage' has a wrong offset!");
static_assert(offsetof(FBlindageLinkInfo, LinkType) == 0x000008, "Member 'FBlindageLinkInfo::LinkType' has a wrong offset!");
static_assert(offsetof(FBlindageLinkInfo, MoveType) == 0x000009, "Member 'FBlindageLinkInfo::MoveType' has a wrong offset!");
static_assert(offsetof(FBlindageLinkInfo, FromLinkType) == 0x00000A, "Member 'FBlindageLinkInfo::FromLinkType' has a wrong offset!");

}

