#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Boss203_FakeSkillLand

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Boss203_FakeSkillLand.Boss203_FakeSkillLand_C
// 0x0020 (0x0248 - 0x0228)
class ABoss203_FakeSkillLand_C final : public AActor
{
public:
	class UBoxComponent*                          FakeSkillLand;                                     // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FakeSkillLandExtent;                               // 0x0238(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Boss203_FakeSkillLand_C">();
	}
	static class ABoss203_FakeSkillLand_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABoss203_FakeSkillLand_C>();
	}
};
static_assert(alignof(ABoss203_FakeSkillLand_C) == 0x000008, "Wrong alignment on ABoss203_FakeSkillLand_C");
static_assert(sizeof(ABoss203_FakeSkillLand_C) == 0x000248, "Wrong size on ABoss203_FakeSkillLand_C");
static_assert(offsetof(ABoss203_FakeSkillLand_C, FakeSkillLand) == 0x000228, "Member 'ABoss203_FakeSkillLand_C::FakeSkillLand' has a wrong offset!");
static_assert(offsetof(ABoss203_FakeSkillLand_C, DefaultSceneRoot) == 0x000230, "Member 'ABoss203_FakeSkillLand_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABoss203_FakeSkillLand_C, FakeSkillLandExtent) == 0x000238, "Member 'ABoss203_FakeSkillLand_C::FakeSkillLandExtent' has a wrong offset!");

}

