#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BowArrowResidueBuffer

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BowArrowResidueBuffer.BowArrowResidueBuffer_C.OnGetAssetPath
// 0x0090 (0x0090 - 0x0000)
struct BowArrowResidueBuffer_C_OnGetAssetPath final
{
public:
	TArray<struct FParamInfo>                     InParams;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 CharacterIDs;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 SkillIDs;                                          // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 ModifierIDs;                                       // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 EmitterIDs;                                        // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FSoftObjectPath>                ReturnValue;                                       // 0x0050(0x0010)(Parm, OutParm, ReturnParm)
	TArray<struct FSoftObjectPath>                OutPath;                                           // 0x0060(0x0010)(Edit, BlueprintVisible)
	struct FSoftObjectPath                        CallFunc_MakeSoftObjectPath_ReturnValue;           // 0x0070(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BowArrowResidueBuffer_C_OnGetAssetPath) == 0x000008, "Wrong alignment on BowArrowResidueBuffer_C_OnGetAssetPath");
static_assert(sizeof(BowArrowResidueBuffer_C_OnGetAssetPath) == 0x000090, "Wrong size on BowArrowResidueBuffer_C_OnGetAssetPath");
static_assert(offsetof(BowArrowResidueBuffer_C_OnGetAssetPath, InParams) == 0x000000, "Member 'BowArrowResidueBuffer_C_OnGetAssetPath::InParams' has a wrong offset!");
static_assert(offsetof(BowArrowResidueBuffer_C_OnGetAssetPath, CharacterIDs) == 0x000010, "Member 'BowArrowResidueBuffer_C_OnGetAssetPath::CharacterIDs' has a wrong offset!");
static_assert(offsetof(BowArrowResidueBuffer_C_OnGetAssetPath, SkillIDs) == 0x000020, "Member 'BowArrowResidueBuffer_C_OnGetAssetPath::SkillIDs' has a wrong offset!");
static_assert(offsetof(BowArrowResidueBuffer_C_OnGetAssetPath, ModifierIDs) == 0x000030, "Member 'BowArrowResidueBuffer_C_OnGetAssetPath::ModifierIDs' has a wrong offset!");
static_assert(offsetof(BowArrowResidueBuffer_C_OnGetAssetPath, EmitterIDs) == 0x000040, "Member 'BowArrowResidueBuffer_C_OnGetAssetPath::EmitterIDs' has a wrong offset!");
static_assert(offsetof(BowArrowResidueBuffer_C_OnGetAssetPath, ReturnValue) == 0x000050, "Member 'BowArrowResidueBuffer_C_OnGetAssetPath::ReturnValue' has a wrong offset!");
static_assert(offsetof(BowArrowResidueBuffer_C_OnGetAssetPath, OutPath) == 0x000060, "Member 'BowArrowResidueBuffer_C_OnGetAssetPath::OutPath' has a wrong offset!");
static_assert(offsetof(BowArrowResidueBuffer_C_OnGetAssetPath, CallFunc_MakeSoftObjectPath_ReturnValue) == 0x000070, "Member 'BowArrowResidueBuffer_C_OnGetAssetPath::CallFunc_MakeSoftObjectPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BowArrowResidueBuffer_C_OnGetAssetPath, CallFunc_Array_Add_ReturnValue) == 0x000088, "Member 'BowArrowResidueBuffer_C_OnGetAssetPath::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BowArrowResidueBuffer_C_OnGetAssetPath, CallFunc_Array_Add_ReturnValue_1) == 0x00008C, "Member 'BowArrowResidueBuffer_C_OnGetAssetPath::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

}

