#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BowSkillToFire

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BowSkillToFire.BowSkillToFire_C
// 0x0020 (0x0148 - 0x0128)
class UBowSkillToFire_C final : public UCustomGameAbilityBuffer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0128(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         AddValue;                                          // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AddPercent;                                        // 0x0134(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         JoinRaiseSpeed;                                    // 0x0138(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         JoinPreheatSpeed;                                  // 0x013C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         JoinOverloadSpeed;                                 // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void K2_ReceiveInitialize(const TArray<struct FParamInfo>& Info, const class UGameAbilityComponent* LpInstigator);
	void K2_ReceiveTick(float DeltaSeconds, const class UGameAbilityComponent* Pawn);
	void K2_ReceiveDeActive(const class UGameAbilityComponent* Pawn);
	void AddBulletCount(bool bAdd);
	void K2_ReceiveInitialize__Overridden(const TArray<struct FParamInfo>& Info, const class UGameAbilityComponent* LpInstigator);
	void ExecuteUbergraph_BowSkillToFire(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BowSkillToFire_C">();
	}
	static class UBowSkillToFire_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBowSkillToFire_C>();
	}
};
static_assert(alignof(UBowSkillToFire_C) == 0x000008, "Wrong alignment on UBowSkillToFire_C");
static_assert(sizeof(UBowSkillToFire_C) == 0x000148, "Wrong size on UBowSkillToFire_C");
static_assert(offsetof(UBowSkillToFire_C, UberGraphFrame) == 0x000128, "Member 'UBowSkillToFire_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBowSkillToFire_C, AddValue) == 0x000130, "Member 'UBowSkillToFire_C::AddValue' has a wrong offset!");
static_assert(offsetof(UBowSkillToFire_C, AddPercent) == 0x000134, "Member 'UBowSkillToFire_C::AddPercent' has a wrong offset!");
static_assert(offsetof(UBowSkillToFire_C, JoinRaiseSpeed) == 0x000138, "Member 'UBowSkillToFire_C::JoinRaiseSpeed' has a wrong offset!");
static_assert(offsetof(UBowSkillToFire_C, JoinPreheatSpeed) == 0x00013C, "Member 'UBowSkillToFire_C::JoinPreheatSpeed' has a wrong offset!");
static_assert(offsetof(UBowSkillToFire_C, JoinOverloadSpeed) == 0x000140, "Member 'UBowSkillToFire_C::JoinOverloadSpeed' has a wrong offset!");

}

