#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Boss_102

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Boss_102.BP_Boss_102_C.ExecuteUbergraph_BP_Boss_102
// 0x0100 (0x0100 - 0x0000)
struct BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Has_Been_Initd_Variable_1;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsModifierExist_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbnormalInfo                          CallFunc_GetCurrentAbnormalInfo_Info;              // 0x0010(0x0058)()
	bool                                          CallFunc_IsInAbnormal_ReturnValue;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeModifier_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_IsClosed_Variable_1;                       // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetLocalizationText_ReturnValue;          // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A0(0x0018)()
	class UObject*                                CallFunc_GetFightTips_ReturnValue;                 // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUw_fight_tips_C*                       K2Node_DynamicCast_AsUw_Fight_Tips;                // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable;                                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsAlive_ReturnValue;                   // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D6[0x2];                                       // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCastingSkillIDInAnim_ReturnValue;      // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCastingSkillInAnim_ReturnValue;         // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetCurrentMontage_ReturnValue;            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsModifierExist_ReturnValue_1;            // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Montage_GetCurrentSection_ReturnValue;    // 0x00F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CancleSpecificSkill_ReturnValue;          // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsClient_ReturnValue;                     // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102) == 0x000008, "Wrong alignment on BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102");
static_assert(sizeof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102) == 0x000100, "Wrong size on BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, EntryPoint) == 0x000000, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, ___bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, ___bool_Has_Been_Initd_Variable_1) == 0x000005, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::___bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, ___bool_IsClosed_Variable) == 0x000006, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, CallFunc_IsModifierExist_ReturnValue) == 0x00000C, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::CallFunc_IsModifierExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, CallFunc_GetCurrentAbnormalInfo_Info) == 0x000010, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::CallFunc_GetCurrentAbnormalInfo_Info' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, CallFunc_IsInAbnormal_ReturnValue) == 0x000068, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::CallFunc_IsInAbnormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000069, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00006C, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, CallFunc_MakeModifier_ReturnValue) == 0x000078, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::CallFunc_MakeModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, ___bool_IsClosed_Variable_1) == 0x00007C, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::___bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, CallFunc_Concat_StrStr_ReturnValue) == 0x000080, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, CallFunc_GetLocalizationText_ReturnValue) == 0x000090, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::CallFunc_GetLocalizationText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A0, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, CallFunc_GetFightTips_ReturnValue) == 0x0000B8, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::CallFunc_GetFightTips_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, K2Node_DynamicCast_AsUw_Fight_Tips) == 0x0000C0, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::K2Node_DynamicCast_AsUw_Fight_Tips' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, CallFunc_IsValid_ReturnValue) == 0x0000C9, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, CallFunc_Add_IntInt_ReturnValue) == 0x0000CC, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, ___int_Variable) == 0x0000D0, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::___int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, CallFunc_IsValid_ReturnValue_1) == 0x0000D4, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, CallFunc_K2_IsAlive_ReturnValue) == 0x0000D5, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::CallFunc_K2_IsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, CallFunc_GetCastingSkillIDInAnim_ReturnValue) == 0x0000D8, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::CallFunc_GetCastingSkillIDInAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, CallFunc_IsCastingSkillInAnim_ReturnValue) == 0x0000DC, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::CallFunc_IsCastingSkillInAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000DD, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, CallFunc_GetCurrentMontage_ReturnValue) == 0x0000E0, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::CallFunc_GetCurrentMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, CallFunc_GetAnimInstance_ReturnValue) == 0x0000E8, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, CallFunc_IsModifierExist_ReturnValue_1) == 0x0000F0, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::CallFunc_IsModifierExist_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, CallFunc_Montage_GetCurrentSection_ReturnValue) == 0x0000F4, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::CallFunc_Montage_GetCurrentSection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000FC, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, CallFunc_CancleSpecificSkill_ReturnValue) == 0x0000FD, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::CallFunc_CancleSpecificSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102, CallFunc_IsClient_ReturnValue) == 0x0000FE, "Member 'BP_Boss_102_C_ExecuteUbergraph_BP_Boss_102::CallFunc_IsClient_ReturnValue' has a wrong offset!");

// Function BP_Boss_102.BP_Boss_102_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Boss_102_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Boss_102_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Boss_102_C_ReceiveTick");
static_assert(sizeof(BP_Boss_102_C_ReceiveTick) == 0x000004, "Wrong size on BP_Boss_102_C_ReceiveTick");
static_assert(offsetof(BP_Boss_102_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Boss_102_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Boss_102.BP_Boss_102_C.Get Current Health Rate
// 0x0010 (0x0010 - 0x0000)
struct BP_Boss_102_C_Get_Current_Health_Rate final
{
public:
	float                                         HealthRate;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRolePropertieMaxValue_ReturnValue;     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRolePropertieValue_ReturnValue;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Boss_102_C_Get_Current_Health_Rate) == 0x000004, "Wrong alignment on BP_Boss_102_C_Get_Current_Health_Rate");
static_assert(sizeof(BP_Boss_102_C_Get_Current_Health_Rate) == 0x000010, "Wrong size on BP_Boss_102_C_Get_Current_Health_Rate");
static_assert(offsetof(BP_Boss_102_C_Get_Current_Health_Rate, HealthRate) == 0x000000, "Member 'BP_Boss_102_C_Get_Current_Health_Rate::HealthRate' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_Get_Current_Health_Rate, CallFunc_GetRolePropertieMaxValue_ReturnValue) == 0x000004, "Member 'BP_Boss_102_C_Get_Current_Health_Rate::CallFunc_GetRolePropertieMaxValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_Get_Current_Health_Rate, CallFunc_GetRolePropertieValue_ReturnValue) == 0x000008, "Member 'BP_Boss_102_C_Get_Current_Health_Rate::CallFunc_GetRolePropertieValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_Get_Current_Health_Rate, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_Boss_102_C_Get_Current_Health_Rate::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_Boss_102.BP_Boss_102_C.CheckStageWake
// 0x0008 (0x0008 - 0x0000)
struct BP_Boss_102_C_CheckStageWake final
{
public:
	int32                                         _stage;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsInBreathless_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Boss_102_C_CheckStageWake) == 0x000004, "Wrong alignment on BP_Boss_102_C_CheckStageWake");
static_assert(sizeof(BP_Boss_102_C_CheckStageWake) == 0x000008, "Wrong size on BP_Boss_102_C_CheckStageWake");
static_assert(offsetof(BP_Boss_102_C_CheckStageWake, _stage) == 0x000000, "Member 'BP_Boss_102_C_CheckStageWake::_stage' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_CheckStageWake, CallFunc_GetIsInBreathless_ReturnValue) == 0x000004, "Member 'BP_Boss_102_C_CheckStageWake::CallFunc_GetIsInBreathless_ReturnValue' has a wrong offset!");

// Function BP_Boss_102.BP_Boss_102_C.ReceiveIsAllowAimed
// 0x0010 (0x0010 - 0x0000)
struct BP_Boss_102_C_ReceiveIsAllowAimed final
{
public:
	const class AGameCharacter*                   CurrentInstigator;                                 // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Boss_102_C_ReceiveIsAllowAimed) == 0x000008, "Wrong alignment on BP_Boss_102_C_ReceiveIsAllowAimed");
static_assert(sizeof(BP_Boss_102_C_ReceiveIsAllowAimed) == 0x000010, "Wrong size on BP_Boss_102_C_ReceiveIsAllowAimed");
static_assert(offsetof(BP_Boss_102_C_ReceiveIsAllowAimed, CurrentInstigator) == 0x000000, "Member 'BP_Boss_102_C_ReceiveIsAllowAimed::CurrentInstigator' has a wrong offset!");
static_assert(offsetof(BP_Boss_102_C_ReceiveIsAllowAimed, ReturnValue) == 0x000008, "Member 'BP_Boss_102_C_ReceiveIsAllowAimed::ReturnValue' has a wrong offset!");

}

