#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Bunker

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_Bunker.BP_Bunker_C.SpawnBunkerCollisionActor
// 0x0060 (0x0060 - 0x0000)
struct BP_Bunker_C_SpawnBunkerCollisionActor final
{
public:
	class AActor*                                 OutActor;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_SpawnActorFromClass_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Bunker_C_SpawnBunkerCollisionActor) == 0x000010, "Wrong alignment on BP_Bunker_C_SpawnBunkerCollisionActor");
static_assert(sizeof(BP_Bunker_C_SpawnBunkerCollisionActor) == 0x000060, "Wrong size on BP_Bunker_C_SpawnBunkerCollisionActor");
static_assert(offsetof(BP_Bunker_C_SpawnBunkerCollisionActor, OutActor) == 0x000000, "Member 'BP_Bunker_C_SpawnBunkerCollisionActor::OutActor' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_SpawnBunkerCollisionActor, CallFunc_HasAuthority_ReturnValue) == 0x000008, "Member 'BP_Bunker_C_SpawnBunkerCollisionActor::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_SpawnBunkerCollisionActor, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'BP_Bunker_C_SpawnBunkerCollisionActor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_SpawnBunkerCollisionActor, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'BP_Bunker_C_SpawnBunkerCollisionActor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_SpawnBunkerCollisionActor, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'BP_Bunker_C_SpawnBunkerCollisionActor::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_SpawnBunkerCollisionActor, CallFunc_SpawnActorFromClass_ReturnValue) == 0x000040, "Member 'BP_Bunker_C_SpawnBunkerCollisionActor::CallFunc_SpawnActorFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_SpawnBunkerCollisionActor, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'BP_Bunker_C_SpawnBunkerCollisionActor::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_SpawnBunkerCollisionActor, CallFunc_SetStaticMesh_ReturnValue) == 0x000050, "Member 'BP_Bunker_C_SpawnBunkerCollisionActor::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function BP_Bunker.BP_Bunker_C.InactiveAbility
// 0x0001 (0x0001 - 0x0000)
struct BP_Bunker_C_InactiveAbility final
{
public:
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Bunker_C_InactiveAbility) == 0x000001, "Wrong alignment on BP_Bunker_C_InactiveAbility");
static_assert(sizeof(BP_Bunker_C_InactiveAbility) == 0x000001, "Wrong size on BP_Bunker_C_InactiveAbility");
static_assert(offsetof(BP_Bunker_C_InactiveAbility, CallFunc_IsActive_ReturnValue) == 0x000000, "Member 'BP_Bunker_C_InactiveAbility::CallFunc_IsActive_ReturnValue' has a wrong offset!");

// Function BP_Bunker.BP_Bunker_C.SetupInShadow
// 0x0060 (0x0060 - 0x0000)
struct BP_Bunker_C_SetupInShadow final
{
public:
	int32                                         ___int_Array_Index_Variable;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceConstant*              K2Node_DynamicCast_As______;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Bunker_C_SetupInShadow) == 0x000008, "Wrong alignment on BP_Bunker_C_SetupInShadow");
static_assert(sizeof(BP_Bunker_C_SetupInShadow) == 0x000060, "Wrong size on BP_Bunker_C_SetupInShadow");
static_assert(offsetof(BP_Bunker_C_SetupInShadow, ___int_Array_Index_Variable) == 0x000000, "Member 'BP_Bunker_C_SetupInShadow::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_SetupInShadow, ___int_Loop_Counter_Variable) == 0x000004, "Member 'BP_Bunker_C_SetupInShadow::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_SetupInShadow, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_Bunker_C_SetupInShadow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_SetupInShadow, CallFunc_GetMaterials_ReturnValue) == 0x000010, "Member 'BP_Bunker_C_SetupInShadow::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_SetupInShadow, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_Bunker_C_SetupInShadow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_SetupInShadow, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_Bunker_C_SetupInShadow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_SetupInShadow, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_Bunker_C_SetupInShadow::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_SetupInShadow, K2Node_DynamicCast_As______) == 0x000038, "Member 'BP_Bunker_C_SetupInShadow::K2Node_DynamicCast_As______' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_SetupInShadow, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_Bunker_C_SetupInShadow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_SetupInShadow, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000048, "Member 'BP_Bunker_C_SetupInShadow::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_SetupInShadow, CallFunc_GetObjectClass_ReturnValue) == 0x000050, "Member 'BP_Bunker_C_SetupInShadow::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_SetupInShadow, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000058, "Member 'BP_Bunker_C_SetupInShadow::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");

// Function BP_Bunker.BP_Bunker_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_Bunker_C_UserConstructionScript final
{
public:
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Bunker_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Bunker_C_UserConstructionScript");
static_assert(sizeof(BP_Bunker_C_UserConstructionScript) == 0x000018, "Wrong size on BP_Bunker_C_UserConstructionScript");
static_assert(offsetof(BP_Bunker_C_UserConstructionScript, CallFunc_GetObjectName_ReturnValue) == 0x000000, "Member 'BP_Bunker_C_UserConstructionScript::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_UserConstructionScript, CallFunc_Contains_ReturnValue) == 0x000010, "Member 'BP_Bunker_C_UserConstructionScript::CallFunc_Contains_ReturnValue' has a wrong offset!");

// Function BP_Bunker.BP_Bunker_C.OnDie
// 0x01C0 (0x01C0 - 0x0000)
struct BP_Bunker_C_OnDie final
{
public:
	class AGameCharacter*                         Who;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         Killer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     HealthChangeValue;                                 // 0x0010(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Bunker_C_OnDie) == 0x000008, "Wrong alignment on BP_Bunker_C_OnDie");
static_assert(sizeof(BP_Bunker_C_OnDie) == 0x0001C0, "Wrong size on BP_Bunker_C_OnDie");
static_assert(offsetof(BP_Bunker_C_OnDie, Who) == 0x000000, "Member 'BP_Bunker_C_OnDie::Who' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_OnDie, Killer) == 0x000008, "Member 'BP_Bunker_C_OnDie::Killer' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_OnDie, HealthChangeValue) == 0x000010, "Member 'BP_Bunker_C_OnDie::HealthChangeValue' has a wrong offset!");

// Function BP_Bunker.BP_Bunker_C.ExecuteUbergraph_BP_Bunker
// 0x0230 (0x0230 - 0x0000)
struct BP_Bunker_C_ExecuteUbergraph_BP_Bunker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_Event_Who;                                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_Killer;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_Event_HealthChangeValue;                    // 0x0018(0x01B0)(ConstParm, ContainsInstancedReference)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseComponent*                        CallFunc_PostEventAtLocation_ReturnValue;          // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_202[0x6];                                      // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnGameNiagaraAtLocation_ReturnValue;   // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_SpawnBunkerCollisionActor_OutActor;       // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_SpawnBunkerCollisionActor_OutActor_1;     // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Bunker_C_ExecuteUbergraph_BP_Bunker) == 0x000008, "Wrong alignment on BP_Bunker_C_ExecuteUbergraph_BP_Bunker");
static_assert(sizeof(BP_Bunker_C_ExecuteUbergraph_BP_Bunker) == 0x000230, "Wrong size on BP_Bunker_C_ExecuteUbergraph_BP_Bunker");
static_assert(offsetof(BP_Bunker_C_ExecuteUbergraph_BP_Bunker, EntryPoint) == 0x000000, "Member 'BP_Bunker_C_ExecuteUbergraph_BP_Bunker::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_ExecuteUbergraph_BP_Bunker, K2Node_Event_Who) == 0x000008, "Member 'BP_Bunker_C_ExecuteUbergraph_BP_Bunker::K2Node_Event_Who' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_ExecuteUbergraph_BP_Bunker, K2Node_Event_Killer) == 0x000010, "Member 'BP_Bunker_C_ExecuteUbergraph_BP_Bunker::K2Node_Event_Killer' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_ExecuteUbergraph_BP_Bunker, K2Node_Event_HealthChangeValue) == 0x000018, "Member 'BP_Bunker_C_ExecuteUbergraph_BP_Bunker::K2Node_Event_HealthChangeValue' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_ExecuteUbergraph_BP_Bunker, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x0001C8, "Member 'BP_Bunker_C_ExecuteUbergraph_BP_Bunker::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_ExecuteUbergraph_BP_Bunker, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0001D4, "Member 'BP_Bunker_C_ExecuteUbergraph_BP_Bunker::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_ExecuteUbergraph_BP_Bunker, CallFunc_K2_GetComponentRotation_ReturnValue_1) == 0x0001E0, "Member 'BP_Bunker_C_ExecuteUbergraph_BP_Bunker::CallFunc_K2_GetComponentRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_ExecuteUbergraph_BP_Bunker, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0001EC, "Member 'BP_Bunker_C_ExecuteUbergraph_BP_Bunker::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_ExecuteUbergraph_BP_Bunker, CallFunc_PostEventAtLocation_ReturnValue) == 0x0001F8, "Member 'BP_Bunker_C_ExecuteUbergraph_BP_Bunker::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_ExecuteUbergraph_BP_Bunker, CallFunc_SetStaticMesh_ReturnValue) == 0x000200, "Member 'BP_Bunker_C_ExecuteUbergraph_BP_Bunker::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_ExecuteUbergraph_BP_Bunker, CallFunc_IsActive_ReturnValue) == 0x000201, "Member 'BP_Bunker_C_ExecuteUbergraph_BP_Bunker::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_ExecuteUbergraph_BP_Bunker, CallFunc_SpawnGameNiagaraAtLocation_ReturnValue) == 0x000208, "Member 'BP_Bunker_C_ExecuteUbergraph_BP_Bunker::CallFunc_SpawnGameNiagaraAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_ExecuteUbergraph_BP_Bunker, CallFunc_IsValid_ReturnValue) == 0x000210, "Member 'BP_Bunker_C_ExecuteUbergraph_BP_Bunker::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_ExecuteUbergraph_BP_Bunker, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000211, "Member 'BP_Bunker_C_ExecuteUbergraph_BP_Bunker::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_ExecuteUbergraph_BP_Bunker, CallFunc_SpawnBunkerCollisionActor_OutActor) == 0x000218, "Member 'BP_Bunker_C_ExecuteUbergraph_BP_Bunker::CallFunc_SpawnBunkerCollisionActor_OutActor' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_ExecuteUbergraph_BP_Bunker, CallFunc_IsValid_ReturnValue_1) == 0x000220, "Member 'BP_Bunker_C_ExecuteUbergraph_BP_Bunker::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bunker_C_ExecuteUbergraph_BP_Bunker, CallFunc_SpawnBunkerCollisionActor_OutActor_1) == 0x000228, "Member 'BP_Bunker_C_ExecuteUbergraph_BP_Bunker::CallFunc_SpawnBunkerCollisionActor_OutActor_1' has a wrong offset!");

}

