#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Boss_203_LongChallenge

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Boss_203_LongChallenge.BP_Boss_203_LongChallenge_C.BossBreakFunction
// 0x0098 (0x0098 - 0x0000)
struct BP_Boss_203_LongChallenge_C_BossBreakFunction final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OriginSkills;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UGameAbilityComponent*                  AbilityRef;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGameCharacter*>                 CallFunc_GetAllMembersPtr_ReturnValue;             // 0x0038(0x0010)(ReferenceParm)
	class AGameCharacter*                         CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxAttributeValue_ReturnValue;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttributeChangeValue                  K2Node_MakeStruct_AttributeChangeValue;            // 0x0070(0x0020)(NoDestructor, ContainsInstancedReference)
	class UAbilityComponentBase*                  CallFunc_ApplyAttributeChange_ReturnValue;         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Boss_203_LongChallenge_C_BossBreakFunction) == 0x000008, "Wrong alignment on BP_Boss_203_LongChallenge_C_BossBreakFunction");
static_assert(sizeof(BP_Boss_203_LongChallenge_C_BossBreakFunction) == 0x000098, "Wrong size on BP_Boss_203_LongChallenge_C_BossBreakFunction");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_BossBreakFunction, SkillID) == 0x000000, "Member 'BP_Boss_203_LongChallenge_C_BossBreakFunction::SkillID' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_BossBreakFunction, OriginSkills) == 0x000008, "Member 'BP_Boss_203_LongChallenge_C_BossBreakFunction::OriginSkills' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_BossBreakFunction, AbilityRef) == 0x000018, "Member 'BP_Boss_203_LongChallenge_C_BossBreakFunction::AbilityRef' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_BossBreakFunction, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'BP_Boss_203_LongChallenge_C_BossBreakFunction::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_BossBreakFunction, ___int_Loop_Counter_Variable) == 0x000024, "Member 'BP_Boss_203_LongChallenge_C_BossBreakFunction::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_BossBreakFunction, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'BP_Boss_203_LongChallenge_C_BossBreakFunction::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_BossBreakFunction, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00002C, "Member 'BP_Boss_203_LongChallenge_C_BossBreakFunction::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_BossBreakFunction, ___int_Array_Index_Variable) == 0x000030, "Member 'BP_Boss_203_LongChallenge_C_BossBreakFunction::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_BossBreakFunction, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'BP_Boss_203_LongChallenge_C_BossBreakFunction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_BossBreakFunction, CallFunc_IsValid_ReturnValue_1) == 0x000035, "Member 'BP_Boss_203_LongChallenge_C_BossBreakFunction::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_BossBreakFunction, CallFunc_IsValid_ReturnValue_2) == 0x000036, "Member 'BP_Boss_203_LongChallenge_C_BossBreakFunction::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_BossBreakFunction, CallFunc_GetAllMembersPtr_ReturnValue) == 0x000038, "Member 'BP_Boss_203_LongChallenge_C_BossBreakFunction::CallFunc_GetAllMembersPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_BossBreakFunction, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_Boss_203_LongChallenge_C_BossBreakFunction::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_BossBreakFunction, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_Boss_203_LongChallenge_C_BossBreakFunction::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_BossBreakFunction, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000054, "Member 'BP_Boss_203_LongChallenge_C_BossBreakFunction::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_BossBreakFunction, CallFunc_IsValid_ReturnValue_3) == 0x000058, "Member 'BP_Boss_203_LongChallenge_C_BossBreakFunction::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_BossBreakFunction, CallFunc_Max_ReturnValue) == 0x00005C, "Member 'BP_Boss_203_LongChallenge_C_BossBreakFunction::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_BossBreakFunction, CallFunc_GetMaxAttributeValue_ReturnValue) == 0x000060, "Member 'BP_Boss_203_LongChallenge_C_BossBreakFunction::CallFunc_GetMaxAttributeValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_BossBreakFunction, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000064, "Member 'BP_Boss_203_LongChallenge_C_BossBreakFunction::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_BossBreakFunction, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000068, "Member 'BP_Boss_203_LongChallenge_C_BossBreakFunction::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_BossBreakFunction, K2Node_MakeStruct_AttributeChangeValue) == 0x000070, "Member 'BP_Boss_203_LongChallenge_C_BossBreakFunction::K2Node_MakeStruct_AttributeChangeValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_BossBreakFunction, CallFunc_ApplyAttributeChange_ReturnValue) == 0x000090, "Member 'BP_Boss_203_LongChallenge_C_BossBreakFunction::CallFunc_ApplyAttributeChange_ReturnValue' has a wrong offset!");

// Function BP_Boss_203_LongChallenge.BP_Boss_203_LongChallenge_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_Boss_203_LongChallenge_C_UserConstructionScript final
{
public:
	TDelegate<void(int32 SkillID, TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityComponentBase*                  CallFunc_GetAbilityComponent_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Boss_203_LongChallenge_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Boss_203_LongChallenge_C_UserConstructionScript");
static_assert(sizeof(BP_Boss_203_LongChallenge_C_UserConstructionScript) == 0x000018, "Wrong size on BP_Boss_203_LongChallenge_C_UserConstructionScript");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_UserConstructionScript, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_Boss_203_LongChallenge_C_UserConstructionScript::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_UserConstructionScript, CallFunc_GetAbilityComponent_ReturnValue) == 0x000010, "Member 'BP_Boss_203_LongChallenge_C_UserConstructionScript::CallFunc_GetAbilityComponent_ReturnValue' has a wrong offset!");

// Function BP_Boss_203_LongChallenge.BP_Boss_203_LongChallenge_C.WeakPoint01Dead
// 0x01C0 (0x01C0 - 0x0000)
struct BP_Boss_203_LongChallenge_C_WeakPoint01Dead final
{
public:
	bool                                          bDead;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  InLauncher;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     HealthChangeData;                                  // 0x0010(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Boss_203_LongChallenge_C_WeakPoint01Dead) == 0x000008, "Wrong alignment on BP_Boss_203_LongChallenge_C_WeakPoint01Dead");
static_assert(sizeof(BP_Boss_203_LongChallenge_C_WeakPoint01Dead) == 0x0001C0, "Wrong size on BP_Boss_203_LongChallenge_C_WeakPoint01Dead");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_WeakPoint01Dead, bDead) == 0x000000, "Member 'BP_Boss_203_LongChallenge_C_WeakPoint01Dead::bDead' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_WeakPoint01Dead, InLauncher) == 0x000008, "Member 'BP_Boss_203_LongChallenge_C_WeakPoint01Dead::InLauncher' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_WeakPoint01Dead, HealthChangeData) == 0x000010, "Member 'BP_Boss_203_LongChallenge_C_WeakPoint01Dead::HealthChangeData' has a wrong offset!");

// Function BP_Boss_203_LongChallenge.BP_Boss_203_LongChallenge_C.WeakPoint02Dead
// 0x01C0 (0x01C0 - 0x0000)
struct BP_Boss_203_LongChallenge_C_WeakPoint02Dead final
{
public:
	bool                                          bDead;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  InLauncher;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     HealthChangeData;                                  // 0x0010(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Boss_203_LongChallenge_C_WeakPoint02Dead) == 0x000008, "Wrong alignment on BP_Boss_203_LongChallenge_C_WeakPoint02Dead");
static_assert(sizeof(BP_Boss_203_LongChallenge_C_WeakPoint02Dead) == 0x0001C0, "Wrong size on BP_Boss_203_LongChallenge_C_WeakPoint02Dead");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_WeakPoint02Dead, bDead) == 0x000000, "Member 'BP_Boss_203_LongChallenge_C_WeakPoint02Dead::bDead' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_WeakPoint02Dead, InLauncher) == 0x000008, "Member 'BP_Boss_203_LongChallenge_C_WeakPoint02Dead::InLauncher' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_WeakPoint02Dead, HealthChangeData) == 0x000010, "Member 'BP_Boss_203_LongChallenge_C_WeakPoint02Dead::HealthChangeData' has a wrong offset!");

// Function BP_Boss_203_LongChallenge.BP_Boss_203_LongChallenge_C.WeakPoint03Dead
// 0x01C0 (0x01C0 - 0x0000)
struct BP_Boss_203_LongChallenge_C_WeakPoint03Dead final
{
public:
	bool                                          bDead;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  InLauncher;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     HealthChangeData;                                  // 0x0010(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Boss_203_LongChallenge_C_WeakPoint03Dead) == 0x000008, "Wrong alignment on BP_Boss_203_LongChallenge_C_WeakPoint03Dead");
static_assert(sizeof(BP_Boss_203_LongChallenge_C_WeakPoint03Dead) == 0x0001C0, "Wrong size on BP_Boss_203_LongChallenge_C_WeakPoint03Dead");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_WeakPoint03Dead, bDead) == 0x000000, "Member 'BP_Boss_203_LongChallenge_C_WeakPoint03Dead::bDead' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_WeakPoint03Dead, InLauncher) == 0x000008, "Member 'BP_Boss_203_LongChallenge_C_WeakPoint03Dead::InLauncher' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_WeakPoint03Dead, HealthChangeData) == 0x000010, "Member 'BP_Boss_203_LongChallenge_C_WeakPoint03Dead::HealthChangeData' has a wrong offset!");

// Function BP_Boss_203_LongChallenge.BP_Boss_203_LongChallenge_C.WeakPoint04Dead
// 0x01C0 (0x01C0 - 0x0000)
struct BP_Boss_203_LongChallenge_C_WeakPoint04Dead final
{
public:
	bool                                          bDead;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  InLauncher;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     HealthChangeData;                                  // 0x0010(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Boss_203_LongChallenge_C_WeakPoint04Dead) == 0x000008, "Wrong alignment on BP_Boss_203_LongChallenge_C_WeakPoint04Dead");
static_assert(sizeof(BP_Boss_203_LongChallenge_C_WeakPoint04Dead) == 0x0001C0, "Wrong size on BP_Boss_203_LongChallenge_C_WeakPoint04Dead");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_WeakPoint04Dead, bDead) == 0x000000, "Member 'BP_Boss_203_LongChallenge_C_WeakPoint04Dead::bDead' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_WeakPoint04Dead, InLauncher) == 0x000008, "Member 'BP_Boss_203_LongChallenge_C_WeakPoint04Dead::InLauncher' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_WeakPoint04Dead, HealthChangeData) == 0x000010, "Member 'BP_Boss_203_LongChallenge_C_WeakPoint04Dead::HealthChangeData' has a wrong offset!");

// Function BP_Boss_203_LongChallenge.BP_Boss_203_LongChallenge_C.SpecificSkillEnd&SetRoundSkillFlag
// 0x0004 (0x0004 - 0x0000)
struct BP_Boss_203_LongChallenge_C_SpecificSkillEnd_SetRoundSkillFlag final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Boss_203_LongChallenge_C_SpecificSkillEnd_SetRoundSkillFlag) == 0x000004, "Wrong alignment on BP_Boss_203_LongChallenge_C_SpecificSkillEnd_SetRoundSkillFlag");
static_assert(sizeof(BP_Boss_203_LongChallenge_C_SpecificSkillEnd_SetRoundSkillFlag) == 0x000004, "Wrong size on BP_Boss_203_LongChallenge_C_SpecificSkillEnd_SetRoundSkillFlag");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_SpecificSkillEnd_SetRoundSkillFlag, SkillID) == 0x000000, "Member 'BP_Boss_203_LongChallenge_C_SpecificSkillEnd_SetRoundSkillFlag::SkillID' has a wrong offset!");

// Function BP_Boss_203_LongChallenge.BP_Boss_203_LongChallenge_C.ExecuteUbergraph_BP_Boss_203_LongChallenge
// 0x09C0 (0x09C0 - 0x0000)
struct BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bDead, class UAbilityComponentBase* InLauncher, struct FHealthChangeValue& HealthChangeData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bDead, class UAbilityComponentBase* InLauncher, struct FHealthChangeValue& HealthChangeData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bDead, class UAbilityComponentBase* InLauncher, struct FHealthChangeValue& HealthChangeData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bDead, class UAbilityComponentBase* InLauncher, struct FHealthChangeValue& HealthChangeData)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         ___int_Array_Index_Variable;                       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SkillID)>                K2Node_CreateDelegate_OutputDelegate_6;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_2;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_3;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_2;                     // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRolePropertieMaxValue_ReturnValue;     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRolePropertieValue_ReturnValue;        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRolePropertieMaxValue_ReturnValue_1;   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRolePropertieValue_ReturnValue_1;      // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0xC];                                       // 0x00C4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00D0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class ATrap*                                  CallFunc_SpawnTrap_ReturnValue;                    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0110(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class ATrap*                                  CallFunc_SpawnTrap_ReturnValue_1;                  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_2;               // 0x0150(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class ATrap*                                  CallFunc_SpawnTrap_ReturnValue_2;                  // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_3;               // 0x0190(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class ATrap*                                  CallFunc_SpawnTrap_ReturnValue_3;                  // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_3;                     // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bDead_3;                        // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_CustomEvent_InLauncher_3;                   // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_CustomEvent_HealthChangeData_3;             // 0x01E8(0x01B0)(ConstParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrap*                                  CallFunc_Array_Get_Item;                           // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x03AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bDead_2;                        // 0x03AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilityComponentBase*                  K2Node_CustomEvent_InLauncher_2;                   // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_CustomEvent_HealthChangeData_2;             // 0x03B8(0x01B0)(ConstParm, ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_bDead_1;                        // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_569[0x7];                                      // 0x0569(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_CustomEvent_InLauncher_1;                   // 0x0570(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_CustomEvent_HealthChangeData_1;             // 0x0578(0x01B0)(ConstParm, ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_bDead;                          // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_729[0x7];                                      // 0x0729(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_CustomEvent_InLauncher;                     // 0x0730(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_CustomEvent_HealthChangeData;               // 0x0738(0x01B0)(ConstParm, ContainsInstancedReference)
	class ATrap*                                  CallFunc_Array_Get_Item_1;                         // 0x08E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x08F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x08F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x08F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDead_ReturnValue_1;                     // 0x08F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8F7[0x1];                                      // 0x08F7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrap*                                  CallFunc_Array_Get_Item_2;                         // 0x08F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0900(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue_2;                     // 0x0904(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0905(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_2;           // 0x0906(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_907[0x1];                                      // 0x0907(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrap*                                  CallFunc_Array_Get_Item_3;                         // 0x0908(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0910(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue_3;                     // 0x0914(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0915(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_3;           // 0x0916(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_917[0x9];                                      // 0x0917(0x0009)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_4;               // 0x0920(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0950(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABoss203_FakeSkillLand_C*               CallFunc_FinishSpawningActor_ReturnValue;          // 0x0958(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_5;               // 0x0960(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0990(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABoss203_FakeSkillLand_C*               CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0998(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SkillID;                        // 0x09A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x09A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x09A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x09A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x09A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x09A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x09A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x09AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_6;          // 0x09AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_7;          // 0x09AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_8;          // 0x09AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_9;          // 0x09AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_10;         // 0x09AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_11;         // 0x09B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x09B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_12;         // 0x09B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x09B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge) == 0x000010, "Wrong alignment on BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge");
static_assert(sizeof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge) == 0x0009C0, "Wrong size on BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, EntryPoint) == 0x000000, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, K2Node_CreateDelegate_OutputDelegate_3) == 0x000038, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, K2Node_CreateDelegate_OutputDelegate_4) == 0x000048, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, K2Node_CreateDelegate_OutputDelegate_5) == 0x000058, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, ___int_Array_Index_Variable) == 0x000068, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, K2Node_CreateDelegate_OutputDelegate_6) == 0x00006C, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, ___int_Loop_Counter_Variable) == 0x00007C, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, ___int_Array_Index_Variable_1) == 0x000084, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, ___int_Loop_Counter_Variable_1) == 0x000088, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, ___int_Loop_Counter_Variable_2) == 0x00008C, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::___int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_Add_IntInt_ReturnValue_1) == 0x000090, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_Add_IntInt_ReturnValue_2) == 0x000094, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, ___int_Loop_Counter_Variable_3) == 0x000098, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::___int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_Add_IntInt_ReturnValue_3) == 0x00009C, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, ___int_Array_Index_Variable_2) == 0x0000A0, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::___int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_GetRolePropertieMaxValue_ReturnValue) == 0x0000A4, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_GetRolePropertieMaxValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_SpawnSystemAttached_ReturnValue) == 0x0000A8, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_GetRolePropertieValue_ReturnValue) == 0x0000B0, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_GetRolePropertieValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_GetRolePropertieMaxValue_ReturnValue_1) == 0x0000B4, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_GetRolePropertieMaxValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000B8, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_GetRolePropertieValue_ReturnValue_1) == 0x0000BC, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_GetRolePropertieValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0000C0, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_GetTransform_ReturnValue) == 0x0000D0, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_SpawnTrap_ReturnValue) == 0x000100, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_SpawnTrap_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_GetTransform_ReturnValue_1) == 0x000110, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_SpawnTrap_ReturnValue_1) == 0x000140, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_SpawnTrap_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_GetTransform_ReturnValue_2) == 0x000150, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_GetTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_SpawnTrap_ReturnValue_2) == 0x000180, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_SpawnTrap_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_GetTransform_ReturnValue_3) == 0x000190, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_GetTransform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_SpawnTrap_ReturnValue_3) == 0x0001C0, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_SpawnTrap_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, ___int_Array_Index_Variable_3) == 0x0001C8, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::___int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_Array_Add_ReturnValue) == 0x0001CC, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_Array_Add_ReturnValue_1) == 0x0001D0, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_Array_Add_ReturnValue_2) == 0x0001D4, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, K2Node_CustomEvent_bDead_3) == 0x0001D8, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::K2Node_CustomEvent_bDead_3' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, K2Node_CustomEvent_InLauncher_3) == 0x0001E0, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::K2Node_CustomEvent_InLauncher_3' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, K2Node_CustomEvent_HealthChangeData_3) == 0x0001E8, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::K2Node_CustomEvent_HealthChangeData_3' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_Array_Add_ReturnValue_3) == 0x000398, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_Array_Get_Item) == 0x0003A0, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_Array_Length_ReturnValue) == 0x0003A8, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_Array_RemoveItem_ReturnValue) == 0x0003AC, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_Less_IntInt_ReturnValue) == 0x0003AD, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_IsDead_ReturnValue) == 0x0003AE, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, K2Node_CustomEvent_bDead_2) == 0x0003AF, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::K2Node_CustomEvent_bDead_2' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, K2Node_CustomEvent_InLauncher_2) == 0x0003B0, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::K2Node_CustomEvent_InLauncher_2' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, K2Node_CustomEvent_HealthChangeData_2) == 0x0003B8, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::K2Node_CustomEvent_HealthChangeData_2' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, K2Node_CustomEvent_bDead_1) == 0x000568, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::K2Node_CustomEvent_bDead_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, K2Node_CustomEvent_InLauncher_1) == 0x000570, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::K2Node_CustomEvent_InLauncher_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, K2Node_CustomEvent_HealthChangeData_1) == 0x000578, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::K2Node_CustomEvent_HealthChangeData_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, K2Node_CustomEvent_bDead) == 0x000728, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::K2Node_CustomEvent_bDead' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, K2Node_CustomEvent_InLauncher) == 0x000730, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::K2Node_CustomEvent_InLauncher' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, K2Node_CustomEvent_HealthChangeData) == 0x000738, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::K2Node_CustomEvent_HealthChangeData' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_Array_Get_Item_1) == 0x0008E8, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_Array_Length_ReturnValue_1) == 0x0008F0, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_Array_RemoveItem_ReturnValue_1) == 0x0008F4, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_Array_RemoveItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_Less_IntInt_ReturnValue_1) == 0x0008F5, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_IsDead_ReturnValue_1) == 0x0008F6, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_IsDead_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_Array_Get_Item_2) == 0x0008F8, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_Array_Length_ReturnValue_2) == 0x000900, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_IsDead_ReturnValue_2) == 0x000904, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_IsDead_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_Less_IntInt_ReturnValue_2) == 0x000905, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_Array_RemoveItem_ReturnValue_2) == 0x000906, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_Array_RemoveItem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_Array_Get_Item_3) == 0x000908, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_Array_Length_ReturnValue_3) == 0x000910, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_IsDead_ReturnValue_3) == 0x000914, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_IsDead_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge, CallFunc_Less_IntInt_ReturnValue_3) == 0x000915, "Member 'BP_Boss_203_LongChallenge_C_ExecuteUbergraph_BP_Boss_203_LongChallenge::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
