#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Bunker_Crate

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_Bunker_Crate.BP_Bunker_Crate_C.OnDie
// 0x01C0 (0x01C0 - 0x0000)
struct BP_Bunker_Crate_C_OnDie final
{
public:
	class AGameCharacter*                         Who;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         Killer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     HealthChangeValue;                                 // 0x0010(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Bunker_Crate_C_OnDie) == 0x000008, "Wrong alignment on BP_Bunker_Crate_C_OnDie");
static_assert(sizeof(BP_Bunker_Crate_C_OnDie) == 0x0001C0, "Wrong size on BP_Bunker_Crate_C_OnDie");
static_assert(offsetof(BP_Bunker_Crate_C_OnDie, Who) == 0x000000, "Member 'BP_Bunker_Crate_C_OnDie::Who' has a wrong offset!");
static_assert(offsetof(BP_Bunker_Crate_C_OnDie, Killer) == 0x000008, "Member 'BP_Bunker_Crate_C_OnDie::Killer' has a wrong offset!");
static_assert(offsetof(BP_Bunker_Crate_C_OnDie, HealthChangeValue) == 0x000010, "Member 'BP_Bunker_Crate_C_OnDie::HealthChangeValue' has a wrong offset!");

// Function BP_Bunker_Crate.BP_Bunker_Crate_C.ExecuteUbergraph_BP_Bunker_Crate
// 0x01C8 (0x01C8 - 0x0000)
struct BP_Bunker_Crate_C_ExecuteUbergraph_BP_Bunker_Crate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_Event_Who;                                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_Killer;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_Event_HealthChangeValue;                    // 0x0018(0x01B0)(ConstParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Bunker_Crate_C_ExecuteUbergraph_BP_Bunker_Crate) == 0x000008, "Wrong alignment on BP_Bunker_Crate_C_ExecuteUbergraph_BP_Bunker_Crate");
static_assert(sizeof(BP_Bunker_Crate_C_ExecuteUbergraph_BP_Bunker_Crate) == 0x0001C8, "Wrong size on BP_Bunker_Crate_C_ExecuteUbergraph_BP_Bunker_Crate");
static_assert(offsetof(BP_Bunker_Crate_C_ExecuteUbergraph_BP_Bunker_Crate, EntryPoint) == 0x000000, "Member 'BP_Bunker_Crate_C_ExecuteUbergraph_BP_Bunker_Crate::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Bunker_Crate_C_ExecuteUbergraph_BP_Bunker_Crate, K2Node_Event_Who) == 0x000008, "Member 'BP_Bunker_Crate_C_ExecuteUbergraph_BP_Bunker_Crate::K2Node_Event_Who' has a wrong offset!");
static_assert(offsetof(BP_Bunker_Crate_C_ExecuteUbergraph_BP_Bunker_Crate, K2Node_Event_Killer) == 0x000010, "Member 'BP_Bunker_Crate_C_ExecuteUbergraph_BP_Bunker_Crate::K2Node_Event_Killer' has a wrong offset!");
static_assert(offsetof(BP_Bunker_Crate_C_ExecuteUbergraph_BP_Bunker_Crate, K2Node_Event_HealthChangeValue) == 0x000018, "Member 'BP_Bunker_Crate_C_ExecuteUbergraph_BP_Bunker_Crate::K2Node_Event_HealthChangeValue' has a wrong offset!");

}

