#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Bunker_Fence03

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Bunker_Fence03.BP_Bunker_Fence03_C.SwitchMaterial
// 0x0020 (0x0020 - 0x0000)
struct BP_Bunker_Fence03_C_SwitchMaterial final
{
public:
	class UMaterialInterface*                     mat;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_Bunker_Fence03_C_SwitchMaterial;

// Function BP_Bunker_Fence03.BP_Bunker_Fence03_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct BP_Bunker_Fence03_C_UserConstructionScript final
{
public:
	class UMaterialInterface*                     CallFunc_SwitchMaterial_mat;                       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_Bunker_Fence03_C_UserConstructionScript;

// Function BP_Bunker_Fence03.BP_Bunker_Fence03_C.ExecuteUbergraph_BP_Bunker_Fence03
// 0x0010 (0x0010 - 0x0000)
struct BP_Bunker_Fence03_C_ExecuteUbergraph_BP_Bunker_Fence03 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_SwitchMaterial_mat;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Bunker_Fence03_C_ExecuteUbergraph_BP_Bunker_Fence03;

}

