#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Boss_203

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Boss_203.BP_Boss_203_C
// 0x00F0 (0x1490 - 0x13A0)
class ABP_Boss_203_C final : public ABaseTitan
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x13A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNpcAIDebugComponent*                   NpcAIDebug;                                        // 0x13A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_73F8900D45E4857F8D82949E23C918A2; // 0x13B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_73F8900D45E4857F8D82949E23C918A2; // 0x13B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13B5[0x3];                                     // 0x13B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x13B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSpawned;                                          // 0x13C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bAllowAimed;                                       // 0x13C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bStage2;                                           // 0x13C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13C3[0x1];                                     // 0x13C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentHealthRate;                                 // 0x13C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      WeakPointEffect;                                   // 0x13C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AppearanceEffectId;                                // 0x13D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentShieldRate;                                 // 0x13D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bStage1CanCastSkill;                               // 0x13D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWeakPointSpawned;                                 // 0x13D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13DA[0x6];                                     // 0x13DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATrap*>                          WeakPointArray;                                    // 0x13E0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             BreakLeftPlatform;                                 // 0x13F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             BreakRightPlatform;                                // 0x1400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             DisableWeakPoint01;                                // 0x1410(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             DisableWeakPoint02;                                // 0x1420(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             DisableWeakPoint03;                                // 0x1430(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             DisableWeakPoint04;                                // 0x1440(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             Stage1BreakProgressStart;                          // 0x1450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             Stage1BreakProgressEnd;                            // 0x1460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UUw_test_boss203_break_progress_C*      Progress;                                          // 0x1470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABoss203_FakeSkillLand_C*               FakeSkillLand01;                                   // 0x1478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABoss203_FakeSkillLand_C*               FakeSkillLand02;                                   // 0x1480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ControlCount;                                      // 0x1488(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FrozenTime;                                        // 0x148C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void WeakPoint04Dead(bool bDead, class UAbilityComponentBase* InLauncher, const struct FHealthChangeValue& HealthChangeData);
	void BossEndBreak();
	void Stage1BreakProgressEnd__DelegateSignature();
	void BossBreakFunction(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void UserConstructionScript();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void ReceiveTick(float DeltaSeconds);
	void OnDie(class AGameCharacter* Who, class AGameCharacter* Killer, const struct FHealthChangeValue& HealthChangeValue);
	void ReceiveBeginPlay();
	void SpawnWeakTrap();
	void WeakPoint01Dead(bool bDead, class UAbilityComponentBase* InLauncher, const struct FHealthChangeValue& HealthChangeData);
	void WeakPoint02Dead(bool bDead, class UAbilityComponentBase* InLauncher, const struct FHealthChangeValue& HealthChangeData);
	void WeakPoint03Dead(bool bDead, class UAbilityComponentBase* InLauncher, const struct FHealthChangeValue& HealthChangeData);
	void BreakProgressStart();
	void BreakProgressEnd();
	void BossStartBreak();
	void SpawnFakeSkillLand();
	void SpecialAbnormalStateUpdateEvent(const struct FAbnormalInfo& AbnormalInfo, bool bAdd, bool bNewApply, bool bForceRemove);
	void ReceiveSpecialModifier(class UModifier* InModifier);
	void ExecuteUbergraph_BP_Boss_203(int32 EntryPoint);
	void Stage1BreakProgressStart__DelegateSignature();
	void DisableWeakPoint04__DelegateSignature();
	void DisableWeakPoint03__DelegateSignature();
	void DisableWeakPoint02__DelegateSignature();
	void DisableWeakPoint01__DelegateSignature();
	void BreakRightPlatform__DelegateSignature();
	void BreakLeftPlatform__DelegateSignature();

	bool ReceiveIsAllowAimed(const class AGameCharacter* CurrentInstigator) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Boss_203_C">();
	}
	static class ABP_Boss_203_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Boss_203_C>();
	}
};
static_assert(alignof(ABP_Boss_203_C) == 0x000010, "Wrong alignment on ABP_Boss_203_C");
static_assert(sizeof(ABP_Boss_203_C) == 0x001490, "Wrong size on ABP_Boss_203_C");
static_assert(offsetof(ABP_Boss_203_C, UberGraphFrame) == 0x0013A0, "Member 'ABP_Boss_203_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, NpcAIDebug) == 0x0013A8, "Member 'ABP_Boss_203_C::NpcAIDebug' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, Timeline_0_NewTrack_0_73F8900D45E4857F8D82949E23C918A2) == 0x0013B0, "Member 'ABP_Boss_203_C::Timeline_0_NewTrack_0_73F8900D45E4857F8D82949E23C918A2' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, Timeline_0__Direction_73F8900D45E4857F8D82949E23C918A2) == 0x0013B4, "Member 'ABP_Boss_203_C::Timeline_0__Direction_73F8900D45E4857F8D82949E23C918A2' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, Timeline_0) == 0x0013B8, "Member 'ABP_Boss_203_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, bSpawned) == 0x0013C0, "Member 'ABP_Boss_203_C::bSpawned' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, bAllowAimed) == 0x0013C1, "Member 'ABP_Boss_203_C::bAllowAimed' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, bStage2) == 0x0013C2, "Member 'ABP_Boss_203_C::bStage2' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, CurrentHealthRate) == 0x0013C4, "Member 'ABP_Boss_203_C::CurrentHealthRate' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, WeakPointEffect) == 0x0013C8, "Member 'ABP_Boss_203_C::WeakPointEffect' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, AppearanceEffectId) == 0x0013D0, "Member 'ABP_Boss_203_C::AppearanceEffectId' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, CurrentShieldRate) == 0x0013D4, "Member 'ABP_Boss_203_C::CurrentShieldRate' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, bStage1CanCastSkill) == 0x0013D8, "Member 'ABP_Boss_203_C::bStage1CanCastSkill' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, bWeakPointSpawned) == 0x0013D9, "Member 'ABP_Boss_203_C::bWeakPointSpawned' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, WeakPointArray) == 0x0013E0, "Member 'ABP_Boss_203_C::WeakPointArray' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, BreakLeftPlatform) == 0x0013F0, "Member 'ABP_Boss_203_C::BreakLeftPlatform' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, BreakRightPlatform) == 0x001400, "Member 'ABP_Boss_203_C::BreakRightPlatform' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, DisableWeakPoint01) == 0x001410, "Member 'ABP_Boss_203_C::DisableWeakPoint01' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, DisableWeakPoint02) == 0x001420, "Member 'ABP_Boss_203_C::DisableWeakPoint02' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, DisableWeakPoint03) == 0x001430, "Member 'ABP_Boss_203_C::DisableWeakPoint03' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, DisableWeakPoint04) == 0x001440, "Member 'ABP_Boss_203_C::DisableWeakPoint04' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, Stage1BreakProgressStart) == 0x001450, "Member 'ABP_Boss_203_C::Stage1BreakProgressStart' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, Stage1BreakProgressEnd) == 0x001460, "Member 'ABP_Boss_203_C::Stage1BreakProgressEnd' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, Progress) == 0x001470, "Member 'ABP_Boss_203_C::Progress' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, FakeSkillLand01) == 0x001478, "Member 'ABP_Boss_203_C::FakeSkillLand01' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, FakeSkillLand02) == 0x001480, "Member 'ABP_Boss_203_C::FakeSkillLand02' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, ControlCount) == 0x001488, "Member 'ABP_Boss_203_C::ControlCount' has a wrong offset!");
static_assert(offsetof(ABP_Boss_203_C, FrozenTime) == 0x00148C, "Member 'ABP_Boss_203_C::FrozenTime' has a wrong offset!");

}

