#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Boss_102

#include "Basic.hpp"

#include "BaseMonster_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Boss_102.BP_Boss_102_C
// 0x0030 (0x13C0 - 0x1390)
class ABP_Boss_102_C final : public ABaseMonster_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Boss_102_C;                      // 0x1390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Weak;                                              // 0x1398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Friction;                                          // 0x13A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BuffParticle;                                      // 0x13A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TrapCount;                                         // 0x13B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bStage2;                                           // 0x13B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Boss_102(int32 EntryPoint);
	void RemoveUlitimateSkillModifier();
	void AddTrapCount();
	void Hide_Tip();
	void Add_Tip();
	void ReceiveTick(float DeltaSeconds);
	void Get_Current_Health_Rate(float* HealthRate);
	void CheckStageWake();

	bool ReceiveIsAllowAimed(const class AGameCharacter* CurrentInstigator) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Boss_102_C">();
	}
	static class ABP_Boss_102_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Boss_102_C>();
	}
};
static_assert(alignof(ABP_Boss_102_C) == 0x000010, "Wrong alignment on ABP_Boss_102_C");
static_assert(sizeof(ABP_Boss_102_C) == 0x0013C0, "Wrong size on ABP_Boss_102_C");
static_assert(offsetof(ABP_Boss_102_C, UberGraphFrame_BP_Boss_102_C) == 0x001390, "Member 'ABP_Boss_102_C::UberGraphFrame_BP_Boss_102_C' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_C, Weak) == 0x001398, "Member 'ABP_Boss_102_C::Weak' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_C, Friction) == 0x0013A0, "Member 'ABP_Boss_102_C::Friction' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_C, BuffParticle) == 0x0013A8, "Member 'ABP_Boss_102_C::BuffParticle' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_C, TrapCount) == 0x0013B0, "Member 'ABP_Boss_102_C::TrapCount' has a wrong offset!");
static_assert(offsetof(ABP_Boss_102_C, bStage2) == 0x0013B4, "Member 'ABP_Boss_102_C::bStage2' has a wrong offset!");

}

