#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Bunker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Bunker.BP_Bunker_C
// 0x0080 (0x1380 - 0x1300)
class ABP_Bunker_C : public AMonsterBunker
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          NavBox;                                            // 0x1308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    BillBoard;                                         // 0x1310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBunkerPointComponent*                  BunkerPoint04;                                     // 0x1318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBunkerPointComponent*                  BunkerPoint03;                                     // 0x1320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBunkerPointComponent*                  BunkerPoint02;                                     // 0x1328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBunkerPointComponent*                  BunkerPoint01;                                     // 0x1330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          NoColAfterBroken;                                  // 0x1338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HideMesh;                                          // 0x1339(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CastShadow;                                        // 0x133A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_133B[0x5];                                     // 0x133B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         DieEffect;                                         // 0x1340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            BrokenMesh;                                        // 0x1348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 WwiseDie;                                          // 0x1350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UStaticMesh*                            OrgMesh;                                           // 0x1360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     NewMaterial;                                       // 0x1368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 BunkerCollisionActor;                              // 0x1370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasSpawned;                                       // 0x1378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void SpawnBunkerCollisionActor(class AActor** OutActor);
	void InactiveAbility();
	void SetShadow();
	void SetCullDistance();
	void SetupInShadow();
	void UserConstructionScript();
	void OnDie(class AGameCharacter* Who, class AGameCharacter* Killer, const struct FHealthChangeValue& HealthChangeValue);
	void ReceiveBeginPlay();
	void OnSpawn();
	void UpdateData();
	void OnRecycle();
	void ExecuteUbergraph_BP_Bunker(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Bunker_C">();
	}
	static class ABP_Bunker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Bunker_C>();
	}
};
static_assert(alignof(ABP_Bunker_C) == 0x000010, "Wrong alignment on ABP_Bunker_C");
static_assert(sizeof(ABP_Bunker_C) == 0x001380, "Wrong size on ABP_Bunker_C");
static_assert(offsetof(ABP_Bunker_C, UberGraphFrame) == 0x001300, "Member 'ABP_Bunker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Bunker_C, NavBox) == 0x001308, "Member 'ABP_Bunker_C::NavBox' has a wrong offset!");
static_assert(offsetof(ABP_Bunker_C, BillBoard) == 0x001310, "Member 'ABP_Bunker_C::BillBoard' has a wrong offset!");
static_assert(offsetof(ABP_Bunker_C, BunkerPoint04) == 0x001318, "Member 'ABP_Bunker_C::BunkerPoint04' has a wrong offset!");
static_assert(offsetof(ABP_Bunker_C, BunkerPoint03) == 0x001320, "Member 'ABP_Bunker_C::BunkerPoint03' has a wrong offset!");
static_assert(offsetof(ABP_Bunker_C, BunkerPoint02) == 0x001328, "Member 'ABP_Bunker_C::BunkerPoint02' has a wrong offset!");
static_assert(offsetof(ABP_Bunker_C, BunkerPoint01) == 0x001330, "Member 'ABP_Bunker_C::BunkerPoint01' has a wrong offset!");
static_assert(offsetof(ABP_Bunker_C, NoColAfterBroken) == 0x001338, "Member 'ABP_Bunker_C::NoColAfterBroken' has a wrong offset!");
static_assert(offsetof(ABP_Bunker_C, HideMesh) == 0x001339, "Member 'ABP_Bunker_C::HideMesh' has a wrong offset!");
static_assert(offsetof(ABP_Bunker_C, CastShadow) == 0x00133A, "Member 'ABP_Bunker_C::CastShadow' has a wrong offset!");
static_assert(offsetof(ABP_Bunker_C, DieEffect) == 0x001340, "Member 'ABP_Bunker_C::DieEffect' has a wrong offset!");
static_assert(offsetof(ABP_Bunker_C, BrokenMesh) == 0x001348, "Member 'ABP_Bunker_C::BrokenMesh' has a wrong offset!");
static_assert(offsetof(ABP_Bunker_C, WwiseDie) == 0x001350, "Member 'ABP_Bunker_C::WwiseDie' has a wrong offset!");
static_assert(offsetof(ABP_Bunker_C, OrgMesh) == 0x001360, "Member 'ABP_Bunker_C::OrgMesh' has a wrong offset!");
static_assert(offsetof(ABP_Bunker_C, NewMaterial) == 0x001368, "Member 'ABP_Bunker_C::NewMaterial' has a wrong offset!");
static_assert(offsetof(ABP_Bunker_C, BunkerCollisionActor) == 0x001370, "Member 'ABP_Bunker_C::BunkerCollisionActor' has a wrong offset!");
static_assert(offsetof(ABP_Bunker_C, bHasSpawned) == 0x001378, "Member 'ABP_Bunker_C::bHasSpawned' has a wrong offset!");

}

