#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BlintageHint

#include "Basic.hpp"


namespace SDK::Params
{

// LuaFunction BP_BlintageHint.BP_BlintageHint_C.TriggerHandle
// 0x0010 (0x0010 - 0x0000)
struct BP_BlintageHint_C_TriggerHandle final
{
public:
	bool                                          bIsBeginOverlap;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BlintageHint_C_TriggerHandle) == 0x000008, "Wrong alignment on BP_BlintageHint_C_TriggerHandle");
static_assert(sizeof(BP_BlintageHint_C_TriggerHandle) == 0x000010, "Wrong size on BP_BlintageHint_C_TriggerHandle");
static_assert(offsetof(BP_BlintageHint_C_TriggerHandle, bIsBeginOverlap) == 0x000000, "Member 'BP_BlintageHint_C_TriggerHandle::bIsBeginOverlap' has a wrong offset!");
static_assert(offsetof(BP_BlintageHint_C_TriggerHandle, OtherActor) == 0x000008, "Member 'BP_BlintageHint_C_TriggerHandle::OtherActor' has a wrong offset!");

// Function BP_BlintageHint.BP_BlintageHint_C.TriggerHandle__Overridden
// 0x0010 (0x0010 - 0x0000)
struct BP_BlintageHint_C_TriggerHandle__Overridden final
{
public:
	bool                                          bIsBeginOverlap;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BlintageHint_C_TriggerHandle__Overridden) == 0x000008, "Wrong alignment on BP_BlintageHint_C_TriggerHandle__Overridden");
static_assert(sizeof(BP_BlintageHint_C_TriggerHandle__Overridden) == 0x000010, "Wrong size on BP_BlintageHint_C_TriggerHandle__Overridden");
static_assert(offsetof(BP_BlintageHint_C_TriggerHandle__Overridden, bIsBeginOverlap) == 0x000000, "Member 'BP_BlintageHint_C_TriggerHandle__Overridden::bIsBeginOverlap' has a wrong offset!");
static_assert(offsetof(BP_BlintageHint_C_TriggerHandle__Overridden, OtherActor) == 0x000008, "Member 'BP_BlintageHint_C_TriggerHandle__Overridden::OtherActor' has a wrong offset!");

// Function BP_BlintageHint.BP_BlintageHint_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_BlintageHint_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BlintageHint_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_BlintageHint_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_BlintageHint_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_BlintageHint_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_BlintageHint_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_BlintageHint_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_BlintageHint.BP_BlintageHint_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_BlintageHint_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BlintageHint_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on BP_BlintageHint_C_ReceiveActorEndOverlap");
static_assert(sizeof(BP_BlintageHint_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on BP_BlintageHint_C_ReceiveActorEndOverlap");
static_assert(offsetof(BP_BlintageHint_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'BP_BlintageHint_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// Function BP_BlintageHint.BP_BlintageHint_C.ExecuteUbergraph_BP_BlintageHint
// 0x0018 (0x0018 - 0x0000)
struct BP_BlintageHint_C_ExecuteUbergraph_BP_BlintageHint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BlintageHint_C_ExecuteUbergraph_BP_BlintageHint) == 0x000008, "Wrong alignment on BP_BlintageHint_C_ExecuteUbergraph_BP_BlintageHint");
static_assert(sizeof(BP_BlintageHint_C_ExecuteUbergraph_BP_BlintageHint) == 0x000018, "Wrong size on BP_BlintageHint_C_ExecuteUbergraph_BP_BlintageHint");
static_assert(offsetof(BP_BlintageHint_C_ExecuteUbergraph_BP_BlintageHint, EntryPoint) == 0x000000, "Member 'BP_BlintageHint_C_ExecuteUbergraph_BP_BlintageHint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BlintageHint_C_ExecuteUbergraph_BP_BlintageHint, K2Node_Event_OtherActor_1) == 0x000008, "Member 'BP_BlintageHint_C_ExecuteUbergraph_BP_BlintageHint::K2Node_Event_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_BlintageHint_C_ExecuteUbergraph_BP_BlintageHint, K2Node_Event_OtherActor) == 0x000010, "Member 'BP_BlintageHint_C_ExecuteUbergraph_BP_BlintageHint::K2Node_Event_OtherActor' has a wrong offset!");

// Function BP_BlintageHint.BP_BlintageHint_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_BlintageHint_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_BlintageHint_C_GetModuleName) == 0x000008, "Wrong alignment on BP_BlintageHint_C_GetModuleName");
static_assert(sizeof(BP_BlintageHint_C_GetModuleName) == 0x000010, "Wrong size on BP_BlintageHint_C_GetModuleName");
static_assert(offsetof(BP_BlintageHint_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_BlintageHint_C_GetModuleName::ReturnValue' has a wrong offset!");

}

