#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Bunker

#include "Basic.hpp"

#include "Game_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Bunker.BP_Bunker_C
// 0x0080 (0x1410 - 0x1390)
class ABP_Bunker_C : public AMonsterBunker
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          NavBox;                                            // 0x1398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    BillBoard;                                         // 0x13A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBunkerPointComponent*                  BunkerPoint04;                                     // 0x13A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBunkerPointComponent*                  BunkerPoint03;                                     // 0x13B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBunkerPointComponent*                  BunkerPoint02;                                     // 0x13B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBunkerPointComponent*                  BunkerPoint01;                                     // 0x13C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          NoColAfterBroken;                                  // 0x13C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HideMesh;                                          // 0x13C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CastShadow;                                        // 0x13CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13CB[0x5];                                     // 0x13CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         DieEffect;                                         // 0x13D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            BrokenMesh;                                        // 0x13D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 WwiseDie;                                          // 0x13E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UStaticMesh*                            OrgMesh;                                           // 0x13F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     NewMaterial;                                       // 0x13F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 BunkerCollisionActor;                              // 0x1400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasSpawned;                                       // 0x1408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void SpawnBunkerCollisionActor(class AActor** OutActor);
	void InactiveAbility();
	void SetShadow();
	void SetCullDistance();
	void SetupInShadow();
	void UserConstructionScript();
	void OnDie(class AGameCharacter* Who, class AGameCharacter* Killer, const struct FHealthChangeValue& HealthChangeValue);
	void ReceiveBeginPlay();
	void OnSpawn();
	void UpdateData();
	void OnRecycle();
	void ExecuteUbergraph_BP_Bunker(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Bunker_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Bunker_C")
	}
	static class ABP_Bunker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Bunker_C>();
	}
};
DUMPER7_ASSERTS_ABP_Bunker_C;

}

