#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Boss_203

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Boss_203.BP_Boss_203_C.WeakPoint04Dead
// 0x01C0 (0x01C0 - 0x0000)
struct BP_Boss_203_C_WeakPoint04Dead final
{
public:
	bool                                          bDead;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  InLauncher;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     HealthChangeData;                                  // 0x0010(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Boss_203_C_WeakPoint04Dead) == 0x000008, "Wrong alignment on BP_Boss_203_C_WeakPoint04Dead");
static_assert(sizeof(BP_Boss_203_C_WeakPoint04Dead) == 0x0001C0, "Wrong size on BP_Boss_203_C_WeakPoint04Dead");
static_assert(offsetof(BP_Boss_203_C_WeakPoint04Dead, bDead) == 0x000000, "Member 'BP_Boss_203_C_WeakPoint04Dead::bDead' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_WeakPoint04Dead, InLauncher) == 0x000008, "Member 'BP_Boss_203_C_WeakPoint04Dead::InLauncher' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_WeakPoint04Dead, HealthChangeData) == 0x000010, "Member 'BP_Boss_203_C_WeakPoint04Dead::HealthChangeData' has a wrong offset!");

// Function BP_Boss_203.BP_Boss_203_C.BossBreakFunction
// 0x0098 (0x0098 - 0x0000)
struct BP_Boss_203_C_BossBreakFunction final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OriginSkills;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UGameAbilityComponent*                  AbilityRef;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGameCharacter*>                 CallFunc_GetAllMembersPtr_ReturnValue;             // 0x0038(0x0010)(ReferenceParm)
	class AGameCharacter*                         CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxAttributeValue_ReturnValue;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttributeChangeValue                  K2Node_MakeStruct_AttributeChangeValue;            // 0x0070(0x0020)(NoDestructor, ContainsInstancedReference)
	class UAbilityComponentBase*                  CallFunc_ApplyAttributeChange_ReturnValue;         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Boss_203_C_BossBreakFunction) == 0x000008, "Wrong alignment on BP_Boss_203_C_BossBreakFunction");
static_assert(sizeof(BP_Boss_203_C_BossBreakFunction) == 0x000098, "Wrong size on BP_Boss_203_C_BossBreakFunction");
static_assert(offsetof(BP_Boss_203_C_BossBreakFunction, SkillID) == 0x000000, "Member 'BP_Boss_203_C_BossBreakFunction::SkillID' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_BossBreakFunction, OriginSkills) == 0x000008, "Member 'BP_Boss_203_C_BossBreakFunction::OriginSkills' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_BossBreakFunction, AbilityRef) == 0x000018, "Member 'BP_Boss_203_C_BossBreakFunction::AbilityRef' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_BossBreakFunction, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'BP_Boss_203_C_BossBreakFunction::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_BossBreakFunction, ___int_Loop_Counter_Variable) == 0x000024, "Member 'BP_Boss_203_C_BossBreakFunction::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_BossBreakFunction, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'BP_Boss_203_C_BossBreakFunction::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_BossBreakFunction, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00002C, "Member 'BP_Boss_203_C_BossBreakFunction::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_BossBreakFunction, ___int_Array_Index_Variable) == 0x000030, "Member 'BP_Boss_203_C_BossBreakFunction::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_BossBreakFunction, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'BP_Boss_203_C_BossBreakFunction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_BossBreakFunction, CallFunc_IsValid_ReturnValue_1) == 0x000035, "Member 'BP_Boss_203_C_BossBreakFunction::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_BossBreakFunction, CallFunc_IsValid_ReturnValue_2) == 0x000036, "Member 'BP_Boss_203_C_BossBreakFunction::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_BossBreakFunction, CallFunc_GetAllMembersPtr_ReturnValue) == 0x000038, "Member 'BP_Boss_203_C_BossBreakFunction::CallFunc_GetAllMembersPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_BossBreakFunction, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_Boss_203_C_BossBreakFunction::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_BossBreakFunction, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_Boss_203_C_BossBreakFunction::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_BossBreakFunction, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000054, "Member 'BP_Boss_203_C_BossBreakFunction::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_BossBreakFunction, CallFunc_IsValid_ReturnValue_3) == 0x000058, "Member 'BP_Boss_203_C_BossBreakFunction::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_BossBreakFunction, CallFunc_Max_ReturnValue) == 0x00005C, "Member 'BP_Boss_203_C_BossBreakFunction::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_BossBreakFunction, CallFunc_GetMaxAttributeValue_ReturnValue) == 0x000060, "Member 'BP_Boss_203_C_BossBreakFunction::CallFunc_GetMaxAttributeValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_BossBreakFunction, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000064, "Member 'BP_Boss_203_C_BossBreakFunction::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_BossBreakFunction, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000068, "Member 'BP_Boss_203_C_BossBreakFunction::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_BossBreakFunction, K2Node_MakeStruct_AttributeChangeValue) == 0x000070, "Member 'BP_Boss_203_C_BossBreakFunction::K2Node_MakeStruct_AttributeChangeValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_BossBreakFunction, CallFunc_ApplyAttributeChange_ReturnValue) == 0x000090, "Member 'BP_Boss_203_C_BossBreakFunction::CallFunc_ApplyAttributeChange_ReturnValue' has a wrong offset!");

// Function BP_Boss_203.BP_Boss_203_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_Boss_203_C_UserConstructionScript final
{
public:
	TDelegate<void(int32 SkillID, TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityComponentBase*                  CallFunc_GetAbilityComponent_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Boss_203_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Boss_203_C_UserConstructionScript");
static_assert(sizeof(BP_Boss_203_C_UserConstructionScript) == 0x000018, "Wrong size on BP_Boss_203_C_UserConstructionScript");
static_assert(offsetof(BP_Boss_203_C_UserConstructionScript, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_Boss_203_C_UserConstructionScript::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_UserConstructionScript, CallFunc_GetAbilityComponent_ReturnValue) == 0x000010, "Member 'BP_Boss_203_C_UserConstructionScript::CallFunc_GetAbilityComponent_ReturnValue' has a wrong offset!");

// Function BP_Boss_203.BP_Boss_203_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Boss_203_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Boss_203_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Boss_203_C_ReceiveTick");
static_assert(sizeof(BP_Boss_203_C_ReceiveTick) == 0x000004, "Wrong size on BP_Boss_203_C_ReceiveTick");
static_assert(offsetof(BP_Boss_203_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Boss_203_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Boss_203.BP_Boss_203_C.OnDie
// 0x01C0 (0x01C0 - 0x0000)
struct BP_Boss_203_C_OnDie final
{
public:
	class AGameCharacter*                         Who;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         Killer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     HealthChangeValue;                                 // 0x0010(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Boss_203_C_OnDie) == 0x000008, "Wrong alignment on BP_Boss_203_C_OnDie");
static_assert(sizeof(BP_Boss_203_C_OnDie) == 0x0001C0, "Wrong size on BP_Boss_203_C_OnDie");
static_assert(offsetof(BP_Boss_203_C_OnDie, Who) == 0x000000, "Member 'BP_Boss_203_C_OnDie::Who' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_OnDie, Killer) == 0x000008, "Member 'BP_Boss_203_C_OnDie::Killer' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_OnDie, HealthChangeValue) == 0x000010, "Member 'BP_Boss_203_C_OnDie::HealthChangeValue' has a wrong offset!");

// Function BP_Boss_203.BP_Boss_203_C.WeakPoint01Dead
// 0x01C0 (0x01C0 - 0x0000)
struct BP_Boss_203_C_WeakPoint01Dead final
{
public:
	bool                                          bDead;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  InLauncher;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     HealthChangeData;                                  // 0x0010(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Boss_203_C_WeakPoint01Dead) == 0x000008, "Wrong alignment on BP_Boss_203_C_WeakPoint01Dead");
static_assert(sizeof(BP_Boss_203_C_WeakPoint01Dead) == 0x0001C0, "Wrong size on BP_Boss_203_C_WeakPoint01Dead");
static_assert(offsetof(BP_Boss_203_C_WeakPoint01Dead, bDead) == 0x000000, "Member 'BP_Boss_203_C_WeakPoint01Dead::bDead' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_WeakPoint01Dead, InLauncher) == 0x000008, "Member 'BP_Boss_203_C_WeakPoint01Dead::InLauncher' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_WeakPoint01Dead, HealthChangeData) == 0x000010, "Member 'BP_Boss_203_C_WeakPoint01Dead::HealthChangeData' has a wrong offset!");

// Function BP_Boss_203.BP_Boss_203_C.WeakPoint02Dead
// 0x01C0 (0x01C0 - 0x0000)
struct BP_Boss_203_C_WeakPoint02Dead final
{
public:
	bool                                          bDead;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  InLauncher;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     HealthChangeData;                                  // 0x0010(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Boss_203_C_WeakPoint02Dead) == 0x000008, "Wrong alignment on BP_Boss_203_C_WeakPoint02Dead");
static_assert(sizeof(BP_Boss_203_C_WeakPoint02Dead) == 0x0001C0, "Wrong size on BP_Boss_203_C_WeakPoint02Dead");
static_assert(offsetof(BP_Boss_203_C_WeakPoint02Dead, bDead) == 0x000000, "Member 'BP_Boss_203_C_WeakPoint02Dead::bDead' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_WeakPoint02Dead, InLauncher) == 0x000008, "Member 'BP_Boss_203_C_WeakPoint02Dead::InLauncher' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_WeakPoint02Dead, HealthChangeData) == 0x000010, "Member 'BP_Boss_203_C_WeakPoint02Dead::HealthChangeData' has a wrong offset!");

// Function BP_Boss_203.BP_Boss_203_C.WeakPoint03Dead
// 0x01C0 (0x01C0 - 0x0000)
struct BP_Boss_203_C_WeakPoint03Dead final
{
public:
	bool                                          bDead;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  InLauncher;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     HealthChangeData;                                  // 0x0010(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Boss_203_C_WeakPoint03Dead) == 0x000008, "Wrong alignment on BP_Boss_203_C_WeakPoint03Dead");
static_assert(sizeof(BP_Boss_203_C_WeakPoint03Dead) == 0x0001C0, "Wrong size on BP_Boss_203_C_WeakPoint03Dead");
static_assert(offsetof(BP_Boss_203_C_WeakPoint03Dead, bDead) == 0x000000, "Member 'BP_Boss_203_C_WeakPoint03Dead::bDead' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_WeakPoint03Dead, InLauncher) == 0x000008, "Member 'BP_Boss_203_C_WeakPoint03Dead::InLauncher' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_WeakPoint03Dead, HealthChangeData) == 0x000010, "Member 'BP_Boss_203_C_WeakPoint03Dead::HealthChangeData' has a wrong offset!");

// Function BP_Boss_203.BP_Boss_203_C.SpecialAbnormalStateUpdateEvent
// 0x0068 (0x0068 - 0x0000)
struct BP_Boss_203_C_SpecialAbnormalStateUpdateEvent final
{
public:
	struct FAbnormalInfo                          AbnormalInfo;                                      // 0x0000(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bAdd;                                              // 0x0060(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bNewApply;                                         // 0x0061(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bForceRemove;                                      // 0x0062(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Boss_203_C_SpecialAbnormalStateUpdateEvent) == 0x000008, "Wrong alignment on BP_Boss_203_C_SpecialAbnormalStateUpdateEvent");
static_assert(sizeof(BP_Boss_203_C_SpecialAbnormalStateUpdateEvent) == 0x000068, "Wrong size on BP_Boss_203_C_SpecialAbnormalStateUpdateEvent");
static_assert(offsetof(BP_Boss_203_C_SpecialAbnormalStateUpdateEvent, AbnormalInfo) == 0x000000, "Member 'BP_Boss_203_C_SpecialAbnormalStateUpdateEvent::AbnormalInfo' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_SpecialAbnormalStateUpdateEvent, bAdd) == 0x000060, "Member 'BP_Boss_203_C_SpecialAbnormalStateUpdateEvent::bAdd' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_SpecialAbnormalStateUpdateEvent, bNewApply) == 0x000061, "Member 'BP_Boss_203_C_SpecialAbnormalStateUpdateEvent::bNewApply' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_SpecialAbnormalStateUpdateEvent, bForceRemove) == 0x000062, "Member 'BP_Boss_203_C_SpecialAbnormalStateUpdateEvent::bForceRemove' has a wrong offset!");

// Function BP_Boss_203.BP_Boss_203_C.ReceiveSpecialModifier
// 0x0008 (0x0008 - 0x0000)
struct BP_Boss_203_C_ReceiveSpecialModifier final
{
public:
	class UModifier*                              InModifier;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Boss_203_C_ReceiveSpecialModifier) == 0x000008, "Wrong alignment on BP_Boss_203_C_ReceiveSpecialModifier");
static_assert(sizeof(BP_Boss_203_C_ReceiveSpecialModifier) == 0x000008, "Wrong size on BP_Boss_203_C_ReceiveSpecialModifier");
static_assert(offsetof(BP_Boss_203_C_ReceiveSpecialModifier, InModifier) == 0x000000, "Member 'BP_Boss_203_C_ReceiveSpecialModifier::InModifier' has a wrong offset!");

// Function BP_Boss_203.BP_Boss_203_C.ExecuteUbergraph_BP_Boss_203
// 0x0CF0 (0x0CF0 - 0x0000)
struct BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bDead, class UAbilityComponentBase* InLauncher, struct FHealthChangeValue& HealthChangeData)> K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_2;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_2;                     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_IsClosed_Variable;                         // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRolePropertieMaxValue_ReturnValue;     // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_Who;                                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_Killer;                               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_Event_HealthChangeValue;                    // 0x0090(0x01B0)(ConstParm, ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0240(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         ___int_Array_Index_Variable_3;                     // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0254(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         ___int_Variable;                                   // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRolePropertieValue_ReturnValue;        // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRolePropertieMaxValue_ReturnValue_1;   // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRolePropertieValue_ReturnValue_1;      // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CancleAllSkill_ReturnValue;               // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_282[0xE];                                      // 0x0282(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0290(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class ATrap*                                  CallFunc_SpawnTrap_ReturnValue;                    // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x02D0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class ATrap*                                  CallFunc_SpawnTrap_ReturnValue_1;                  // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_308[0x8];                                      // 0x0308(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_2;               // 0x0310(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class ATrap*                                  CallFunc_SpawnTrap_ReturnValue_2;                  // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_3;               // 0x0350(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class ATrap*                                  CallFunc_SpawnTrap_ReturnValue_3;                  // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_3;                    // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bDead_3;                        // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A5[0x3];                                      // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_CustomEvent_InLauncher_3;                   // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_CustomEvent_HealthChangeData_3;             // 0x03B0(0x01B0)(ConstParm, ContainsInstancedReference)
	class ATrap*                                  CallFunc_Array_Get_Item;                           // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x056C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x056D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x056E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bDead_2;                        // 0x056F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilityComponentBase*                  K2Node_CustomEvent_InLauncher_2;                   // 0x0570(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_CustomEvent_HealthChangeData_2;             // 0x0578(0x01B0)(ConstParm, ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_bDead_1;                        // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_729[0x7];                                      // 0x0729(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_CustomEvent_InLauncher_1;                   // 0x0730(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_CustomEvent_HealthChangeData_1;             // 0x0738(0x01B0)(ConstParm, ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_bDead;                          // 0x08E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E9[0x7];                                      // 0x08E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_CustomEvent_InLauncher;                     // 0x08F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_CustomEvent_HealthChangeData;               // 0x08F8(0x01B0)(ConstParm, ContainsInstancedReference)
	class ATrap*                                  CallFunc_Array_Get_Item_1;                         // 0x0AA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue_1;                     // 0x0AB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AB1[0x3];                                      // 0x0AB1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0AB4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0AB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x0AB9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ABA[0x6];                                      // 0x0ABA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrap*                                  CallFunc_Array_Get_Item_2;                         // 0x0AC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bDead, class UAbilityComponentBase* InLauncher, struct FHealthChangeValue& HealthChangeData)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0AC8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDead_ReturnValue_2;                     // 0x0AD8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD9[0x3];                                      // 0x0AD9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0ADC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0AE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_2;           // 0x0AE1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AE2[0x6];                                      // 0x0AE2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrap*                                  CallFunc_Array_Get_Item_3;                         // 0x0AE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0AF0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_3;           // 0x0AF4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0AF5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDead_ReturnValue_3;                     // 0x0AF6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AF7[0x1];                                      // 0x0AF7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0AF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0AFC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0AFD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0AFE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AFF[0x1];                                      // 0x0AFF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_4;               // 0x0B00(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0B30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABoss203_FakeSkillLand_C*               CallFunc_FinishSpawningActor_ReturnValue;          // 0x0B38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_5;               // 0x0B40(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0B70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bDead, class UAbilityComponentBase* InLauncher, struct FHealthChangeValue& HealthChangeData)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0B78(0x0010)(ZeroConstructor, NoDestructor)
	class ABoss203_FakeSkillLand_C*               CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0B88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAbnormalInfo                          K2Node_CustomEvent_AbnormalInfo;                   // 0x0B90(0x0060)(ConstParm)
	bool                                          K2Node_CustomEvent_bAdd;                           // 0x0BF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bNewApply;                      // 0x0BF1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bForceRemove;                   // 0x0BF2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0BF3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_MakeModifier_ReturnValue;                 // 0x0BF4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0BF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0BF9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BFA[0x2];                                      // 0x0BFA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bDead, class UAbilityComponentBase* InLauncher, struct FHealthChangeValue& HealthChangeData)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0BFC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0C0C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C0D[0x3];                                      // 0x0C0D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Variable_1;                                 // 0x0C10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C14[0x4];                                      // 0x0C14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UModifier*                              K2Node_CustomEvent_InModifier;                     // 0x0C18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0C20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C24[0x4];                                      // 0x0C24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetClassTag_ReturnValue;                  // 0x0C28(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0C38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C39[0x3];                                      // 0x0C39(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0C3C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0C40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0C44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeModifier_ReturnValue_1;               // 0x0C48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0C4C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0C50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C54[0x4];                                      // 0x0C54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModifierExhibitionData                CallFunc_FindModifierDataInfo_ReturnValue;         // 0x0C58(0x0088)(ConstParm, ContainsInstancedReference)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0CE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0CE4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203) == 0x000010, "Wrong alignment on BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203");
static_assert(sizeof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203) == 0x000CF0, "Wrong size on BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, EntryPoint) == 0x000000, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_Add_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_MakeVector_ReturnValue_1) == 0x000014, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_MakeVector_ReturnValue_2) == 0x000020, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_MakeVector_ReturnValue_3) == 0x00002C, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, ___int_Array_Index_Variable) == 0x000038, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, ___int_Loop_Counter_Variable) == 0x00004C, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, ___int_Array_Index_Variable_1) == 0x000054, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, ___int_Loop_Counter_Variable_1) == 0x000058, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_Add_IntInt_ReturnValue_1) == 0x00005C, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, ___int_Loop_Counter_Variable_2) == 0x000060, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::___int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_Add_IntInt_ReturnValue_2) == 0x000064, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, ___int_Array_Index_Variable_2) == 0x000068, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::___int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, ___bool_IsClosed_Variable) == 0x00006C, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, K2Node_Event_DeltaSeconds) == 0x000070, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_GetRolePropertieMaxValue_ReturnValue) == 0x000074, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_GetRolePropertieMaxValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000078, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, K2Node_Event_Who) == 0x000080, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::K2Node_Event_Who' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, K2Node_Event_Killer) == 0x000088, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::K2Node_Event_Killer' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, K2Node_Event_HealthChangeValue) == 0x000090, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::K2Node_Event_HealthChangeValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, K2Node_CreateDelegate_OutputDelegate_1) == 0x000240, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, ___int_Array_Index_Variable_3) == 0x000250, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::___int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, K2Node_CreateDelegate_OutputDelegate_2) == 0x000254, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, ___int_Variable) == 0x000264, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::___int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_GetRolePropertieValue_ReturnValue) == 0x000268, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_GetRolePropertieValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_GetRolePropertieMaxValue_ReturnValue_1) == 0x00026C, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_GetRolePropertieMaxValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000270, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_GetRolePropertieValue_ReturnValue_1) == 0x000274, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_GetRolePropertieValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000278, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00027C, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_CancleAllSkill_ReturnValue) == 0x000280, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_CancleAllSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000281, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_GetTransform_ReturnValue) == 0x000290, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_SpawnTrap_ReturnValue) == 0x0002C0, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_SpawnTrap_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_GetTransform_ReturnValue_1) == 0x0002D0, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_SpawnTrap_ReturnValue_1) == 0x000300, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_SpawnTrap_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_GetTransform_ReturnValue_2) == 0x000310, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_GetTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_SpawnTrap_ReturnValue_2) == 0x000340, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_SpawnTrap_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_GetTransform_ReturnValue_3) == 0x000350, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_GetTransform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_SpawnTrap_ReturnValue_3) == 0x000380, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_SpawnTrap_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, ___int_Loop_Counter_Variable_3) == 0x000388, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::___int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, ___bool_Has_Been_Initd_Variable) == 0x00038C, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_Add_IntInt_ReturnValue_3) == 0x000390, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_Array_Add_ReturnValue) == 0x000394, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_Array_Add_ReturnValue_1) == 0x000398, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_Array_Add_ReturnValue_2) == 0x00039C, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_Array_Add_ReturnValue_3) == 0x0003A0, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, K2Node_CustomEvent_bDead_3) == 0x0003A4, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::K2Node_CustomEvent_bDead_3' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, K2Node_CustomEvent_InLauncher_3) == 0x0003A8, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::K2Node_CustomEvent_InLauncher_3' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, K2Node_CustomEvent_HealthChangeData_3) == 0x0003B0, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::K2Node_CustomEvent_HealthChangeData_3' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_Array_Get_Item) == 0x000560, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203, CallFunc_Array_Length_ReturnValue) == 0x000568, "Member 'BP_Boss_203_C_ExecuteUbergraph_BP_Boss_203::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
