#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Bunker_Fence03

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Bunker_Fence03.BP_Bunker_Fence03_C.SwitchMaterial
// 0x0020 (0x0020 - 0x0000)
struct BP_Bunker_Fence03_C_SwitchMaterial final
{
public:
	class UMaterialInterface*                     Mat;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Bunker_Fence03_C_SwitchMaterial) == 0x000008, "Wrong alignment on BP_Bunker_Fence03_C_SwitchMaterial");
static_assert(sizeof(BP_Bunker_Fence03_C_SwitchMaterial) == 0x000020, "Wrong size on BP_Bunker_Fence03_C_SwitchMaterial");
static_assert(offsetof(BP_Bunker_Fence03_C_SwitchMaterial, Mat) == 0x000000, "Member 'BP_Bunker_Fence03_C_SwitchMaterial::Mat' has a wrong offset!");
static_assert(offsetof(BP_Bunker_Fence03_C_SwitchMaterial, Temp) == 0x000008, "Member 'BP_Bunker_Fence03_C_SwitchMaterial::Temp' has a wrong offset!");
static_assert(offsetof(BP_Bunker_Fence03_C_SwitchMaterial, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000010, "Member 'BP_Bunker_Fence03_C_SwitchMaterial::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bunker_Fence03_C_SwitchMaterial, CallFunc_Array_Get_Item) == 0x000014, "Member 'BP_Bunker_Fence03_C_SwitchMaterial::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Bunker_Fence03_C_SwitchMaterial, K2Node_SwitchInteger_CmpSuccess) == 0x000018, "Member 'BP_Bunker_Fence03_C_SwitchMaterial::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function BP_Bunker_Fence03.BP_Bunker_Fence03_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct BP_Bunker_Fence03_C_UserConstructionScript final
{
public:
	class UMaterialInterface*                     CallFunc_SwitchMaterial_mat;                       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Bunker_Fence03_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Bunker_Fence03_C_UserConstructionScript");
static_assert(sizeof(BP_Bunker_Fence03_C_UserConstructionScript) == 0x000020, "Wrong size on BP_Bunker_Fence03_C_UserConstructionScript");
static_assert(offsetof(BP_Bunker_Fence03_C_UserConstructionScript, CallFunc_SwitchMaterial_mat) == 0x000000, "Member 'BP_Bunker_Fence03_C_UserConstructionScript::CallFunc_SwitchMaterial_mat' has a wrong offset!");
static_assert(offsetof(BP_Bunker_Fence03_C_UserConstructionScript, CallFunc_GetObjectName_ReturnValue) == 0x000008, "Member 'BP_Bunker_Fence03_C_UserConstructionScript::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bunker_Fence03_C_UserConstructionScript, CallFunc_Contains_ReturnValue) == 0x000018, "Member 'BP_Bunker_Fence03_C_UserConstructionScript::CallFunc_Contains_ReturnValue' has a wrong offset!");

// Function BP_Bunker_Fence03.BP_Bunker_Fence03_C.ExecuteUbergraph_BP_Bunker_Fence03
// 0x0010 (0x0010 - 0x0000)
struct BP_Bunker_Fence03_C_ExecuteUbergraph_BP_Bunker_Fence03 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_SwitchMaterial_mat;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Bunker_Fence03_C_ExecuteUbergraph_BP_Bunker_Fence03) == 0x000008, "Wrong alignment on BP_Bunker_Fence03_C_ExecuteUbergraph_BP_Bunker_Fence03");
static_assert(sizeof(BP_Bunker_Fence03_C_ExecuteUbergraph_BP_Bunker_Fence03) == 0x000010, "Wrong size on BP_Bunker_Fence03_C_ExecuteUbergraph_BP_Bunker_Fence03");
static_assert(offsetof(BP_Bunker_Fence03_C_ExecuteUbergraph_BP_Bunker_Fence03, EntryPoint) == 0x000000, "Member 'BP_Bunker_Fence03_C_ExecuteUbergraph_BP_Bunker_Fence03::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Bunker_Fence03_C_ExecuteUbergraph_BP_Bunker_Fence03, CallFunc_SwitchMaterial_mat) == 0x000008, "Member 'BP_Bunker_Fence03_C_ExecuteUbergraph_BP_Bunker_Fence03::CallFunc_SwitchMaterial_mat' has a wrong offset!");

}

