#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DarkZoneGameMode

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// LuaFunction BP_DarkZoneGameMode.BP_DarkZoneGameMode_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_DarkZoneGameMode_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_DarkZoneGameMode_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_DarkZoneGameMode_C_ReceiveEndPlay");
static_assert(sizeof(BP_DarkZoneGameMode_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_DarkZoneGameMode_C_ReceiveEndPlay");
static_assert(offsetof(BP_DarkZoneGameMode_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_DarkZoneGameMode_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_DarkZoneGameMode.BP_DarkZoneGameMode_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_DarkZoneGameMode_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_DarkZoneGameMode_C_GetModuleName) == 0x000008, "Wrong alignment on BP_DarkZoneGameMode_C_GetModuleName");
static_assert(sizeof(BP_DarkZoneGameMode_C_GetModuleName) == 0x000010, "Wrong size on BP_DarkZoneGameMode_C_GetModuleName");
static_assert(offsetof(BP_DarkZoneGameMode_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_DarkZoneGameMode_C_GetModuleName::ReturnValue' has a wrong offset!");

}

