#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DirectionalLight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DirectionalLight.BP_DirectionalLight_C
// 0x0030 (0x0268 - 0x0238)
class ABP_DirectionalLight_C final : public ADirectionalLight
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         IndirectLightOffset;                               // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SceneIntensity;                                    // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SceneLightColor;                                   // 0x0248(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SceneLightVector;                                  // 0x0258(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 ShaodwColor;                                       // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UseToSequence();
	void RefrashRoleLightParameter();
	void RefrashLightParameter();
	void IgnoreDynamicShadow();
	void CastDynamicShadow();
	void RuntimeInitLight();
	void ConstructInitLight();
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_DirectionalLight(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DirectionalLight_C">();
	}
	static class ABP_DirectionalLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DirectionalLight_C>();
	}
};
static_assert(alignof(ABP_DirectionalLight_C) == 0x000008, "Wrong alignment on ABP_DirectionalLight_C");
static_assert(sizeof(ABP_DirectionalLight_C) == 0x000268, "Wrong size on ABP_DirectionalLight_C");
static_assert(offsetof(ABP_DirectionalLight_C, UberGraphFrame) == 0x000238, "Member 'ABP_DirectionalLight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DirectionalLight_C, IndirectLightOffset) == 0x000240, "Member 'ABP_DirectionalLight_C::IndirectLightOffset' has a wrong offset!");
static_assert(offsetof(ABP_DirectionalLight_C, SceneIntensity) == 0x000244, "Member 'ABP_DirectionalLight_C::SceneIntensity' has a wrong offset!");
static_assert(offsetof(ABP_DirectionalLight_C, SceneLightColor) == 0x000248, "Member 'ABP_DirectionalLight_C::SceneLightColor' has a wrong offset!");
static_assert(offsetof(ABP_DirectionalLight_C, SceneLightVector) == 0x000258, "Member 'ABP_DirectionalLight_C::SceneLightVector' has a wrong offset!");
static_assert(offsetof(ABP_DirectionalLight_C, ShaodwColor) == 0x000264, "Member 'ABP_DirectionalLight_C::ShaodwColor' has a wrong offset!");

}

