#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EternalBunker

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_EternalBunker.BP_EternalBunker_C.SetupInShadow
// 0x0060 (0x0060 - 0x0000)
struct BP_EternalBunker_C_SetupInShadow final
{
public:
	int32                                         ___int_Array_Index_Variable;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceConstant*              K2Node_DynamicCast_As______;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EternalBunker_C_SetupInShadow) == 0x000008, "Wrong alignment on BP_EternalBunker_C_SetupInShadow");
static_assert(sizeof(BP_EternalBunker_C_SetupInShadow) == 0x000060, "Wrong size on BP_EternalBunker_C_SetupInShadow");
static_assert(offsetof(BP_EternalBunker_C_SetupInShadow, ___int_Array_Index_Variable) == 0x000000, "Member 'BP_EternalBunker_C_SetupInShadow::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EternalBunker_C_SetupInShadow, ___int_Loop_Counter_Variable) == 0x000004, "Member 'BP_EternalBunker_C_SetupInShadow::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EternalBunker_C_SetupInShadow, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_EternalBunker_C_SetupInShadow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EternalBunker_C_SetupInShadow, CallFunc_GetMaterials_ReturnValue) == 0x000010, "Member 'BP_EternalBunker_C_SetupInShadow::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EternalBunker_C_SetupInShadow, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_EternalBunker_C_SetupInShadow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EternalBunker_C_SetupInShadow, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_EternalBunker_C_SetupInShadow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EternalBunker_C_SetupInShadow, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_EternalBunker_C_SetupInShadow::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EternalBunker_C_SetupInShadow, K2Node_DynamicCast_As______) == 0x000038, "Member 'BP_EternalBunker_C_SetupInShadow::K2Node_DynamicCast_As______' has a wrong offset!");
static_assert(offsetof(BP_EternalBunker_C_SetupInShadow, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_EternalBunker_C_SetupInShadow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EternalBunker_C_SetupInShadow, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000048, "Member 'BP_EternalBunker_C_SetupInShadow::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EternalBunker_C_SetupInShadow, CallFunc_GetObjectClass_ReturnValue) == 0x000050, "Member 'BP_EternalBunker_C_SetupInShadow::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EternalBunker_C_SetupInShadow, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000058, "Member 'BP_EternalBunker_C_SetupInShadow::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");

// Function BP_EternalBunker.BP_EternalBunker_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_EternalBunker_C_UserConstructionScript final
{
public:
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EternalBunker_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_EternalBunker_C_UserConstructionScript");
static_assert(sizeof(BP_EternalBunker_C_UserConstructionScript) == 0x000018, "Wrong size on BP_EternalBunker_C_UserConstructionScript");
static_assert(offsetof(BP_EternalBunker_C_UserConstructionScript, CallFunc_GetObjectName_ReturnValue) == 0x000000, "Member 'BP_EternalBunker_C_UserConstructionScript::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EternalBunker_C_UserConstructionScript, CallFunc_Contains_ReturnValue) == 0x000010, "Member 'BP_EternalBunker_C_UserConstructionScript::CallFunc_Contains_ReturnValue' has a wrong offset!");

// Function BP_EternalBunker.BP_EternalBunker_C.ExecuteUbergraph_BP_EternalBunker
// 0x0008 (0x0008 - 0x0000)
struct BP_EternalBunker_C_ExecuteUbergraph_BP_EternalBunker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EternalBunker_C_ExecuteUbergraph_BP_EternalBunker) == 0x000004, "Wrong alignment on BP_EternalBunker_C_ExecuteUbergraph_BP_EternalBunker");
static_assert(sizeof(BP_EternalBunker_C_ExecuteUbergraph_BP_EternalBunker) == 0x000008, "Wrong size on BP_EternalBunker_C_ExecuteUbergraph_BP_EternalBunker");
static_assert(offsetof(BP_EternalBunker_C_ExecuteUbergraph_BP_EternalBunker, EntryPoint) == 0x000000, "Member 'BP_EternalBunker_C_ExecuteUbergraph_BP_EternalBunker::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EternalBunker_C_ExecuteUbergraph_BP_EternalBunker, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_EternalBunker_C_ExecuteUbergraph_BP_EternalBunker::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EternalBunker_C_ExecuteUbergraph_BP_EternalBunker, CallFunc_SetStaticMesh_ReturnValue) == 0x000005, "Member 'BP_EternalBunker_C_ExecuteUbergraph_BP_EternalBunker::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

}

