#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EternalBunker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EternalBunker.BP_EternalBunker_C
// 0x0070 (0x04F8 - 0x0488)
class ABP_EternalBunker_C : public AEternalBunker
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0488(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          NavBox;                                            // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    BillBoard;                                         // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBunkerPointComponent*                  BunkerPoint04;                                     // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBunkerPointComponent*                  BunkerPoint03;                                     // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBunkerPointComponent*                  BunkerPoint02;                                     // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBunkerPointComponent*                  BunkerPoint01;                                     // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          NoColAfterBroken;                                  // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HideMesh;                                          // 0x04C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CastShadow;                                        // 0x04C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C3[0x5];                                      // 0x04C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         DieEffect;                                         // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            BrokenMesh;                                        // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 WwiseDie;                                          // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UStaticMesh*                            OrgMesh;                                           // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     NewMaterial;                                       // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetShadow();
	void SetCullDistance();
	void SetupInShadow();
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void UpdateData();
	void Pre_Spawn();
	void Pre_Recycle();
	void ExecuteUbergraph_BP_EternalBunker(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EternalBunker_C">();
	}
	static class ABP_EternalBunker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EternalBunker_C>();
	}
};
static_assert(alignof(ABP_EternalBunker_C) == 0x000008, "Wrong alignment on ABP_EternalBunker_C");
static_assert(sizeof(ABP_EternalBunker_C) == 0x0004F8, "Wrong size on ABP_EternalBunker_C");
static_assert(offsetof(ABP_EternalBunker_C, UberGraphFrame) == 0x000488, "Member 'ABP_EternalBunker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EternalBunker_C, NavBox) == 0x000490, "Member 'ABP_EternalBunker_C::NavBox' has a wrong offset!");
static_assert(offsetof(ABP_EternalBunker_C, BillBoard) == 0x000498, "Member 'ABP_EternalBunker_C::BillBoard' has a wrong offset!");
static_assert(offsetof(ABP_EternalBunker_C, BunkerPoint04) == 0x0004A0, "Member 'ABP_EternalBunker_C::BunkerPoint04' has a wrong offset!");
static_assert(offsetof(ABP_EternalBunker_C, BunkerPoint03) == 0x0004A8, "Member 'ABP_EternalBunker_C::BunkerPoint03' has a wrong offset!");
static_assert(offsetof(ABP_EternalBunker_C, BunkerPoint02) == 0x0004B0, "Member 'ABP_EternalBunker_C::BunkerPoint02' has a wrong offset!");
static_assert(offsetof(ABP_EternalBunker_C, BunkerPoint01) == 0x0004B8, "Member 'ABP_EternalBunker_C::BunkerPoint01' has a wrong offset!");
static_assert(offsetof(ABP_EternalBunker_C, NoColAfterBroken) == 0x0004C0, "Member 'ABP_EternalBunker_C::NoColAfterBroken' has a wrong offset!");
static_assert(offsetof(ABP_EternalBunker_C, HideMesh) == 0x0004C1, "Member 'ABP_EternalBunker_C::HideMesh' has a wrong offset!");
static_assert(offsetof(ABP_EternalBunker_C, CastShadow) == 0x0004C2, "Member 'ABP_EternalBunker_C::CastShadow' has a wrong offset!");
static_assert(offsetof(ABP_EternalBunker_C, DieEffect) == 0x0004C8, "Member 'ABP_EternalBunker_C::DieEffect' has a wrong offset!");
static_assert(offsetof(ABP_EternalBunker_C, BrokenMesh) == 0x0004D0, "Member 'ABP_EternalBunker_C::BrokenMesh' has a wrong offset!");
static_assert(offsetof(ABP_EternalBunker_C, WwiseDie) == 0x0004D8, "Member 'ABP_EternalBunker_C::WwiseDie' has a wrong offset!");
static_assert(offsetof(ABP_EternalBunker_C, OrgMesh) == 0x0004E8, "Member 'ABP_EternalBunker_C::OrgMesh' has a wrong offset!");
static_assert(offsetof(ABP_EternalBunker_C, NewMaterial) == 0x0004F0, "Member 'ABP_EternalBunker_C::NewMaterial' has a wrong offset!");

}

