#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FollowNPC_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_FollowNPC_Base.BP_FollowNPC_Base_C.AddFightTargetEnmity
// 0x0058 (0x0058 - 0x0000)
struct BP_FollowNPC_Base_C_AddFightTargetEnmity final
{
public:
	int32                                         ___int_Array_Index_Variable;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetTargetActor_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameAICharacter*                       K2Node_DynamicCast_AsGame_AICharacter;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGameCharacter*>                 CallFunc_GetAllMembersPtr_ReturnValue;             // 0x0028(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FollowNPC_Base_C_AddFightTargetEnmity) == 0x000008, "Wrong alignment on BP_FollowNPC_Base_C_AddFightTargetEnmity");
static_assert(sizeof(BP_FollowNPC_Base_C_AddFightTargetEnmity) == 0x000058, "Wrong size on BP_FollowNPC_Base_C_AddFightTargetEnmity");
static_assert(offsetof(BP_FollowNPC_Base_C_AddFightTargetEnmity, ___int_Array_Index_Variable) == 0x000000, "Member 'BP_FollowNPC_Base_C_AddFightTargetEnmity::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_AddFightTargetEnmity, ___int_Loop_Counter_Variable) == 0x000004, "Member 'BP_FollowNPC_Base_C_AddFightTargetEnmity::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_AddFightTargetEnmity, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'BP_FollowNPC_Base_C_AddFightTargetEnmity::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_AddFightTargetEnmity, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000C, "Member 'BP_FollowNPC_Base_C_AddFightTargetEnmity::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_AddFightTargetEnmity, CallFunc_GetTargetActor_ReturnValue) == 0x000010, "Member 'BP_FollowNPC_Base_C_AddFightTargetEnmity::CallFunc_GetTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_AddFightTargetEnmity, K2Node_DynamicCast_AsGame_AICharacter) == 0x000018, "Member 'BP_FollowNPC_Base_C_AddFightTargetEnmity::K2Node_DynamicCast_AsGame_AICharacter' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_AddFightTargetEnmity, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_FollowNPC_Base_C_AddFightTargetEnmity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_AddFightTargetEnmity, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BP_FollowNPC_Base_C_AddFightTargetEnmity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_AddFightTargetEnmity, CallFunc_GetAllMembersPtr_ReturnValue) == 0x000028, "Member 'BP_FollowNPC_Base_C_AddFightTargetEnmity::CallFunc_GetAllMembersPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_AddFightTargetEnmity, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BP_FollowNPC_Base_C_AddFightTargetEnmity::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_AddFightTargetEnmity, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_FollowNPC_Base_C_AddFightTargetEnmity::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_AddFightTargetEnmity, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_FollowNPC_Base_C_AddFightTargetEnmity::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_AddFightTargetEnmity, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00004C, "Member 'BP_FollowNPC_Base_C_AddFightTargetEnmity::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_AddFightTargetEnmity, CallFunc_Max_ReturnValue) == 0x000050, "Member 'BP_FollowNPC_Base_C_AddFightTargetEnmity::CallFunc_Max_ReturnValue' has a wrong offset!");

// Function BP_FollowNPC_Base.BP_FollowNPC_Base_C.LevelSetapproachRoad
// 0x0010 (0x0010 - 0x0000)
struct BP_FollowNPC_Base_C_LevelSetapproachRoad final
{
public:
	float                                         X_0;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Y_0;                                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Z_0;                                               // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FollowNPC_Base_C_LevelSetapproachRoad) == 0x000004, "Wrong alignment on BP_FollowNPC_Base_C_LevelSetapproachRoad");
static_assert(sizeof(BP_FollowNPC_Base_C_LevelSetapproachRoad) == 0x000010, "Wrong size on BP_FollowNPC_Base_C_LevelSetapproachRoad");
static_assert(offsetof(BP_FollowNPC_Base_C_LevelSetapproachRoad, X_0) == 0x000000, "Member 'BP_FollowNPC_Base_C_LevelSetapproachRoad::X_0' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_LevelSetapproachRoad, Y_0) == 0x000004, "Member 'BP_FollowNPC_Base_C_LevelSetapproachRoad::Y_0' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_LevelSetapproachRoad, Z_0) == 0x000008, "Member 'BP_FollowNPC_Base_C_LevelSetapproachRoad::Z_0' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_LevelSetapproachRoad, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'BP_FollowNPC_Base_C_LevelSetapproachRoad::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_FollowNPC_Base.BP_FollowNPC_Base_C.LevelSetApproachPlayerFunction
// 0x0001 (0x0001 - 0x0000)
struct BP_FollowNPC_Base_C_LevelSetApproachPlayerFunction final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FollowNPC_Base_C_LevelSetApproachPlayerFunction) == 0x000001, "Wrong alignment on BP_FollowNPC_Base_C_LevelSetApproachPlayerFunction");
static_assert(sizeof(BP_FollowNPC_Base_C_LevelSetApproachPlayerFunction) == 0x000001, "Wrong size on BP_FollowNPC_Base_C_LevelSetApproachPlayerFunction");
static_assert(offsetof(BP_FollowNPC_Base_C_LevelSetApproachPlayerFunction, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'BP_FollowNPC_Base_C_LevelSetApproachPlayerFunction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_FollowNPC_Base.BP_FollowNPC_Base_C.LevelSetFollowFunction
// 0x0001 (0x0001 - 0x0000)
struct BP_FollowNPC_Base_C_LevelSetFollowFunction final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FollowNPC_Base_C_LevelSetFollowFunction) == 0x000001, "Wrong alignment on BP_FollowNPC_Base_C_LevelSetFollowFunction");
static_assert(sizeof(BP_FollowNPC_Base_C_LevelSetFollowFunction) == 0x000001, "Wrong size on BP_FollowNPC_Base_C_LevelSetFollowFunction");
static_assert(offsetof(BP_FollowNPC_Base_C_LevelSetFollowFunction, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'BP_FollowNPC_Base_C_LevelSetFollowFunction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_FollowNPC_Base.BP_FollowNPC_Base_C.ResetLogicAndSpeed
// 0x0004 (0x0004 - 0x0000)
struct BP_FollowNPC_Base_C_ResetLogicAndSpeed final
{
public:
	float                                         WalkSpeed;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FollowNPC_Base_C_ResetLogicAndSpeed) == 0x000004, "Wrong alignment on BP_FollowNPC_Base_C_ResetLogicAndSpeed");
static_assert(sizeof(BP_FollowNPC_Base_C_ResetLogicAndSpeed) == 0x000004, "Wrong size on BP_FollowNPC_Base_C_ResetLogicAndSpeed");
static_assert(offsetof(BP_FollowNPC_Base_C_ResetLogicAndSpeed, WalkSpeed) == 0x000000, "Member 'BP_FollowNPC_Base_C_ResetLogicAndSpeed::WalkSpeed' has a wrong offset!");

// Function BP_FollowNPC_Base.BP_FollowNPC_Base_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_FollowNPC_Base_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FollowNPC_Base_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_FollowNPC_Base_C_ReceiveTick");
static_assert(sizeof(BP_FollowNPC_Base_C_ReceiveTick) == 0x000004, "Wrong size on BP_FollowNPC_Base_C_ReceiveTick");
static_assert(offsetof(BP_FollowNPC_Base_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_FollowNPC_Base_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_FollowNPC_Base.BP_FollowNPC_Base_C.ExecuteUbergraph_BP_FollowNPC_Base
// 0x0060 (0x0060 - 0x0000)
struct BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CancleAllSkill_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Array_Random_OutItem;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance_Humanoid*                 K2Node_DynamicCast_AsAnim_Instance_Humanoid;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_WalkSpeed;                      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPlayersFightCheckResult_ReturnValue;   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeModifier_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base) == 0x000008, "Wrong alignment on BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base");
static_assert(sizeof(BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base) == 0x000060, "Wrong size on BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base");
static_assert(offsetof(BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base, EntryPoint) == 0x000000, "Member 'BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base, CallFunc_CancleAllSkill_ReturnValue) == 0x000004, "Member 'BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base::CallFunc_CancleAllSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base, CallFunc_Array_Random_OutItem) == 0x000008, "Member 'BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base, CallFunc_Array_Random_OutIndex) == 0x000010, "Member 'BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base, CallFunc_GetAnimInstance_ReturnValue) == 0x000018, "Member 'BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base, K2Node_DynamicCast_AsAnim_Instance_Humanoid) == 0x000020, "Member 'BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base::K2Node_DynamicCast_AsAnim_Instance_Humanoid' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base, K2Node_CustomEvent_WalkSpeed) == 0x00002C, "Member 'BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base::K2Node_CustomEvent_WalkSpeed' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base, ___bool_Has_Been_Initd_Variable) == 0x000030, "Member 'BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base, ___bool_IsClosed_Variable) == 0x000031, "Member 'BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base, CallFunc_MakeVector_ReturnValue) == 0x000034, "Member 'BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base, K2Node_Event_DeltaSeconds) == 0x000040, "Member 'BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base, CallFunc_MakeVector_ReturnValue_1) == 0x000044, "Member 'BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base, CallFunc_GetPlayersFightCheckResult_ReturnValue) == 0x000050, "Member 'BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base::CallFunc_GetPlayersFightCheckResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base, CallFunc_MakeModifier_ReturnValue) == 0x000054, "Member 'BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base::CallFunc_MakeModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base, CallFunc_BooleanAND_ReturnValue) == 0x000058, "Member 'BP_FollowNPC_Base_C_ExecuteUbergraph_BP_FollowNPC_Base::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

