#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FollowNPC_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BaseSummon_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FollowNPC_Base.BP_FollowNPC_Base_C
// 0x0070 (0x13F0 - 0x1380)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_FollowNPC_Base_C : public ABaseSummon_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNpcAIDebugComponent*                   NpcAIDebug;                                        // 0x1380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNPCFollowComponent_C*                  NpcFollowComponent;                                // 0x1388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Weak;                                              // 0x1390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Friction;                                          // 0x1398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bMoveFinished;                                     // 0x13A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A1[0x3];                                     // 0x13A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GoalDistance;                                      // 0x13A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GoalLocation;                                      // 0x13A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13B4[0x4];                                     // 0x13B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  GoalActor;                                         // 0x13B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLevelNeedFollow;                                  // 0x13C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13C1[0x3];                                     // 0x13C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         X;                                                 // 0x13C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Y;                                                 // 0x13C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Z;                                                 // 0x13CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLevelNeedApproach_Road;                           // 0x13D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bLevelNeedApproachPlayer;                          // 0x13D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D2[0x6];                                     // 0x13D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimSequence*>                  Used_Idle_Anim;                                    // 0x13D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AddFightTargetEnmity();
	void LevelSetapproachRoad(float X_0, float Y_0, float Z_0);
	void LevelSetApproachPlayerFunction();
	void LevelSetFollowFunction();
	void Spwaned();
	void ResetLogicAndSpeed(float WalkSpeed);
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_BP_FollowNPC_Base(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FollowNPC_Base_C">();
	}
	static class ABP_FollowNPC_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FollowNPC_Base_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(ABP_FollowNPC_Base_C) == 0x000010, "Wrong alignment on ABP_FollowNPC_Base_C");
static_assert(sizeof(ABP_FollowNPC_Base_C) == 0x0013F0, "Wrong size on ABP_FollowNPC_Base_C");
static_assert(offsetof(ABP_FollowNPC_Base_C, UberGraphFrame) == 0x001378, "Member 'ABP_FollowNPC_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FollowNPC_Base_C, NpcAIDebug) == 0x001380, "Member 'ABP_FollowNPC_Base_C::NpcAIDebug' has a wrong offset!");
static_assert(offsetof(ABP_FollowNPC_Base_C, NpcFollowComponent) == 0x001388, "Member 'ABP_FollowNPC_Base_C::NpcFollowComponent' has a wrong offset!");
static_assert(offsetof(ABP_FollowNPC_Base_C, Weak) == 0x001390, "Member 'ABP_FollowNPC_Base_C::Weak' has a wrong offset!");
static_assert(offsetof(ABP_FollowNPC_Base_C, Friction) == 0x001398, "Member 'ABP_FollowNPC_Base_C::Friction' has a wrong offset!");
static_assert(offsetof(ABP_FollowNPC_Base_C, bMoveFinished) == 0x0013A0, "Member 'ABP_FollowNPC_Base_C::bMoveFinished' has a wrong offset!");
static_assert(offsetof(ABP_FollowNPC_Base_C, GoalDistance) == 0x0013A4, "Member 'ABP_FollowNPC_Base_C::GoalDistance' has a wrong offset!");
static_assert(offsetof(ABP_FollowNPC_Base_C, GoalLocation) == 0x0013A8, "Member 'ABP_FollowNPC_Base_C::GoalLocation' has a wrong offset!");
static_assert(offsetof(ABP_FollowNPC_Base_C, GoalActor) == 0x0013B8, "Member 'ABP_FollowNPC_Base_C::GoalActor' has a wrong offset!");
static_assert(offsetof(ABP_FollowNPC_Base_C, bLevelNeedFollow) == 0x0013C0, "Member 'ABP_FollowNPC_Base_C::bLevelNeedFollow' has a wrong offset!");
static_assert(offsetof(ABP_FollowNPC_Base_C, X) == 0x0013C4, "Member 'ABP_FollowNPC_Base_C::X' has a wrong offset!");
static_assert(offsetof(ABP_FollowNPC_Base_C, Y) == 0x0013C8, "Member 'ABP_FollowNPC_Base_C::Y' has a wrong offset!");
static_assert(offsetof(ABP_FollowNPC_Base_C, Z) == 0x0013CC, "Member 'ABP_FollowNPC_Base_C::Z' has a wrong offset!");
static_assert(offsetof(ABP_FollowNPC_Base_C, bLevelNeedApproach_Road) == 0x0013D0, "Member 'ABP_FollowNPC_Base_C::bLevelNeedApproach_Road' has a wrong offset!");
static_assert(offsetof(ABP_FollowNPC_Base_C, bLevelNeedApproachPlayer) == 0x0013D1, "Member 'ABP_FollowNPC_Base_C::bLevelNeedApproachPlayer' has a wrong offset!");
static_assert(offsetof(ABP_FollowNPC_Base_C, Used_Idle_Anim) == 0x0013D8, "Member 'ABP_FollowNPC_Base_C::Used_Idle_Anim' has a wrong offset!");

}

