#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girll005a

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BaseCharacter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Girll005a.BP_Girll005a_C
// 0x0010 (0x22C0 - 0x22B0)
class ABP_Girll005a_C final : public ABaseCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Girll005a_C;                     // 0x22A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCameraComponent*                       AimCamera;                                         // 0x22B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWednesdayDroneManagerComponent*        WednesdayDroneManager;                             // 0x22B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ReceiveTick__Overridden(float DeltaSeconds);
	void OnSwitchEnter(const struct FTransform& Trans);
	void OnSwitchLeave(const struct FTransform& Trans);
	void ExecuteUbergraph_BP_Girll005a(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Girll005a_C">();
	}
	static class ABP_Girll005a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Girll005a_C>();
	}
};
static_assert(alignof(ABP_Girll005a_C) == 0x000010, "Wrong alignment on ABP_Girll005a_C");
static_assert(sizeof(ABP_Girll005a_C) == 0x0022C0, "Wrong size on ABP_Girll005a_C");
static_assert(offsetof(ABP_Girll005a_C, UberGraphFrame_BP_Girll005a_C) == 0x0022A8, "Member 'ABP_Girll005a_C::UberGraphFrame_BP_Girll005a_C' has a wrong offset!");
static_assert(offsetof(ABP_Girll005a_C, AimCamera) == 0x0022B0, "Member 'ABP_Girll005a_C::AimCamera' has a wrong offset!");
static_assert(offsetof(ABP_Girll005a_C, WednesdayDroneManager) == 0x0022B8, "Member 'ABP_Girll005a_C::WednesdayDroneManager' has a wrong offset!");

}

