#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girll005a

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// LuaFunction BP_Girll005a.BP_Girll005a_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Girll005a_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girll005a_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Girll005a_C_ReceiveTick");
static_assert(sizeof(BP_Girll005a_C_ReceiveTick) == 0x000004, "Wrong size on BP_Girll005a_C_ReceiveTick");
static_assert(offsetof(BP_Girll005a_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Girll005a_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Girll005a.BP_Girll005a_C.ReceiveTick__Overridden
// 0x0004 (0x0004 - 0x0000)
struct BP_Girll005a_C_ReceiveTick__Overridden final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girll005a_C_ReceiveTick__Overridden) == 0x000004, "Wrong alignment on BP_Girll005a_C_ReceiveTick__Overridden");
static_assert(sizeof(BP_Girll005a_C_ReceiveTick__Overridden) == 0x000004, "Wrong size on BP_Girll005a_C_ReceiveTick__Overridden");
static_assert(offsetof(BP_Girll005a_C_ReceiveTick__Overridden, DeltaSeconds) == 0x000000, "Member 'BP_Girll005a_C_ReceiveTick__Overridden::DeltaSeconds' has a wrong offset!");

// Function BP_Girll005a.BP_Girll005a_C.OnSwitchEnter
// 0x0030 (0x0030 - 0x0000)
struct BP_Girll005a_C_OnSwitchEnter final
{
public:
	struct FTransform                             Trans;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Girll005a_C_OnSwitchEnter) == 0x000010, "Wrong alignment on BP_Girll005a_C_OnSwitchEnter");
static_assert(sizeof(BP_Girll005a_C_OnSwitchEnter) == 0x000030, "Wrong size on BP_Girll005a_C_OnSwitchEnter");
static_assert(offsetof(BP_Girll005a_C_OnSwitchEnter, Trans) == 0x000000, "Member 'BP_Girll005a_C_OnSwitchEnter::Trans' has a wrong offset!");

// Function BP_Girll005a.BP_Girll005a_C.OnSwitchLeave
// 0x0030 (0x0030 - 0x0000)
struct BP_Girll005a_C_OnSwitchLeave final
{
public:
	struct FTransform                             Trans;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Girll005a_C_OnSwitchLeave) == 0x000010, "Wrong alignment on BP_Girll005a_C_OnSwitchLeave");
static_assert(sizeof(BP_Girll005a_C_OnSwitchLeave) == 0x000030, "Wrong size on BP_Girll005a_C_OnSwitchLeave");
static_assert(offsetof(BP_Girll005a_C_OnSwitchLeave, Trans) == 0x000000, "Member 'BP_Girll005a_C_OnSwitchLeave::Trans' has a wrong offset!");

// Function BP_Girll005a.BP_Girll005a_C.ExecuteUbergraph_BP_Girll005a
// 0x0070 (0x0070 - 0x0000)
struct BP_Girll005a_C_ExecuteUbergraph_BP_Girll005a final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Event_Trans_1;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             K2Node_Event_Trans;                                // 0x0040(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Girll005a_C_ExecuteUbergraph_BP_Girll005a) == 0x000010, "Wrong alignment on BP_Girll005a_C_ExecuteUbergraph_BP_Girll005a");
static_assert(sizeof(BP_Girll005a_C_ExecuteUbergraph_BP_Girll005a) == 0x000070, "Wrong size on BP_Girll005a_C_ExecuteUbergraph_BP_Girll005a");
static_assert(offsetof(BP_Girll005a_C_ExecuteUbergraph_BP_Girll005a, EntryPoint) == 0x000000, "Member 'BP_Girll005a_C_ExecuteUbergraph_BP_Girll005a::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Girll005a_C_ExecuteUbergraph_BP_Girll005a, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_Girll005a_C_ExecuteUbergraph_BP_Girll005a::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Girll005a_C_ExecuteUbergraph_BP_Girll005a, K2Node_Event_Trans_1) == 0x000010, "Member 'BP_Girll005a_C_ExecuteUbergraph_BP_Girll005a::K2Node_Event_Trans_1' has a wrong offset!");
static_assert(offsetof(BP_Girll005a_C_ExecuteUbergraph_BP_Girll005a, K2Node_Event_Trans) == 0x000040, "Member 'BP_Girll005a_C_ExecuteUbergraph_BP_Girll005a::K2Node_Event_Trans' has a wrong offset!");

// Function BP_Girll005a.BP_Girll005a_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_Girll005a_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girll005a_C_GetModuleName) == 0x000008, "Wrong alignment on BP_Girll005a_C_GetModuleName");
static_assert(sizeof(BP_Girll005a_C_GetModuleName) == 0x000010, "Wrong size on BP_Girll005a_C_GetModuleName");
static_assert(offsetof(BP_Girll005a_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_Girll005a_C_GetModuleName::ReturnValue' has a wrong offset!");

}

