#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_girl010_prop02

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BaseSummon_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_girl010_prop02.BP_girl010_prop02_C
// 0x0070 (0x14A0 - 0x1430)
class ABP_girl010_prop02_C final : public ABaseSummon_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1428(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                ____1______1_E32395374517DCCD7D4A6DB66A8E1E59;     // 0x1430(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____1______0_E32395374517DCCD7D4A6DB66A8E1E59;     // 0x143C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____1__Direction_E32395374517DCCD7D4A6DB66A8E1E59; // 0x1440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1441[0x7];                                     // 0x1441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_1;                                          // 0x1448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____0______0_58C2A8CE435004DFD7D7279B32AC970E;     // 0x1450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____0__Direction_58C2A8CE435004DFD7D7279B32AC970E; // 0x1454(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1455[0x3];                                     // 0x1455(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_0;                                          // 0x1458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomFloatValue                      Base_ZValue;                                       // 0x1460(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         Time;                                              // 0x146C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Range;                                             // 0x1470(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_147C[0x4];                                     // 0x147C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAvailableSkill*>                NewVar_0;                                          // 0x1480(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bMoveFinished;                                     // 0x1490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1491[0x3];                                     // 0x1491(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SideDeceleration;                                  // 0x1494(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void 时间轴_1__FinishedFunc();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick__Overridden(float DeltaSeconds);
	void ReceiveBeginPlay();
	void OnModifierRemove_Event_0(class UModifier* InModifier);
	void 时间轴_1__UpdateFunc();
	void 时间轴_0__FinishedFunc();
	void 时间轴_0__UpdateFunc();
	void OnAILeave_事件_0();
	void ExecuteUbergraph_BP_girl010_prop02(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_girl010_prop02_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_girl010_prop02_C")
	}
	static class ABP_girl010_prop02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_girl010_prop02_C>();
	}
};
DUMPER7_ASSERTS_ABP_girl010_prop02_C;

}

