#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl_Head_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Girl_Head_Base.BP_Girl_Head_Base_C
// 0x0068 (0x0520 - 0x04B8)
class ABP_Girl_Head_Base_C : public AAccessory_HeadBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Head;                                              // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BlushingTimeLine_Alpha_9DC42A9E4B22CDE3E57DF18B007CE461; // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            BlushingTimeLine__Direction_9DC42A9E4B22CDE3E57DF18B007CE461; // 0x04CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CD[0x3];                                      // 0x04CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     BlushingTimeLine;                                  // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MinLOD;                                            // 0x04D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DC[0x4];                                      // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterRenderComponent*              RC;                                                // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               OldDefault;                                        // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MeshOriginMat;                                     // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               FaceChangingMat;                                   // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFaceChanging;                                     // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        FaceChangeMI;                                      // 0x0508(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void UpdateForwardVector();
	void BlushingTimeLine__FinishedFunc();
	void BlushingTimeLine__UpdateFunc();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void StartBlush();
	void StopBlush();
	void ExecuteUbergraph_BP_Girl_Head_Base(int32 EntryPoint);

	class USkeletalMeshComponent* GetSkeletalMesh() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Girl_Head_Base_C">();
	}
	static class ABP_Girl_Head_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Girl_Head_Base_C>();
	}
};
static_assert(alignof(ABP_Girl_Head_Base_C) == 0x000008, "Wrong alignment on ABP_Girl_Head_Base_C");
static_assert(sizeof(ABP_Girl_Head_Base_C) == 0x000520, "Wrong size on ABP_Girl_Head_Base_C");
static_assert(offsetof(ABP_Girl_Head_Base_C, UberGraphFrame) == 0x0004B8, "Member 'ABP_Girl_Head_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Girl_Head_Base_C, Head) == 0x0004C0, "Member 'ABP_Girl_Head_Base_C::Head' has a wrong offset!");
static_assert(offsetof(ABP_Girl_Head_Base_C, BlushingTimeLine_Alpha_9DC42A9E4B22CDE3E57DF18B007CE461) == 0x0004C8, "Member 'ABP_Girl_Head_Base_C::BlushingTimeLine_Alpha_9DC42A9E4B22CDE3E57DF18B007CE461' has a wrong offset!");
static_assert(offsetof(ABP_Girl_Head_Base_C, BlushingTimeLine__Direction_9DC42A9E4B22CDE3E57DF18B007CE461) == 0x0004CC, "Member 'ABP_Girl_Head_Base_C::BlushingTimeLine__Direction_9DC42A9E4B22CDE3E57DF18B007CE461' has a wrong offset!");
static_assert(offsetof(ABP_Girl_Head_Base_C, BlushingTimeLine) == 0x0004D0, "Member 'ABP_Girl_Head_Base_C::BlushingTimeLine' has a wrong offset!");
static_assert(offsetof(ABP_Girl_Head_Base_C, MinLOD) == 0x0004D8, "Member 'ABP_Girl_Head_Base_C::MinLOD' has a wrong offset!");
static_assert(offsetof(ABP_Girl_Head_Base_C, RC) == 0x0004E0, "Member 'ABP_Girl_Head_Base_C::RC' has a wrong offset!");
static_assert(offsetof(ABP_Girl_Head_Base_C, OldDefault) == 0x0004E8, "Member 'ABP_Girl_Head_Base_C::OldDefault' has a wrong offset!");
static_assert(offsetof(ABP_Girl_Head_Base_C, MeshOriginMat) == 0x0004F0, "Member 'ABP_Girl_Head_Base_C::MeshOriginMat' has a wrong offset!");
static_assert(offsetof(ABP_Girl_Head_Base_C, FaceChangingMat) == 0x0004F8, "Member 'ABP_Girl_Head_Base_C::FaceChangingMat' has a wrong offset!");
static_assert(offsetof(ABP_Girl_Head_Base_C, bFaceChanging) == 0x000500, "Member 'ABP_Girl_Head_Base_C::bFaceChanging' has a wrong offset!");
static_assert(offsetof(ABP_Girl_Head_Base_C, FaceChangeMI) == 0x000508, "Member 'ABP_Girl_Head_Base_C::FaceChangeMI' has a wrong offset!");

}

