#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl015_Movement

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_Girl015_Movement.BP_Girl015_Movement_C.ReceiveCustomSpeedCurve
// 0x0070 (0x0070 - 0x0000)
struct BP_Girl015_Movement_C_ReceiveCustomSpeedCurve final
{
public:
	struct FCustomSpeedCurve                      CustomSpeedCurve;                                  // 0x0000(0x0030)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomSpeedCurve                      CallFunc_ReceiveCustomSpeedCurve_CustomSpeedCurve; // 0x0038(0x0030)()
	bool                                          CallFunc_ReceiveCustomSpeedCurve_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_Girl015_Movement_C_ReceiveCustomSpeedCurve;

// Function BP_Girl015_Movement.BP_Girl015_Movement_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Girl015_Movement_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Girl015_Movement_C_ReceiveTick;

// Function BP_Girl015_Movement.BP_Girl015_Movement_C.ExecuteUbergraph_BP_Girl015_Movement
// 0x0008 (0x0008 - 0x0000)
struct BP_Girl015_Movement_C_ExecuteUbergraph_BP_Girl015_Movement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Girl015_Movement_C_ExecuteUbergraph_BP_Girl015_Movement;

// Function BP_Girl015_Movement.BP_Girl015_Movement_C.ReceiveCustomRotation
// 0x0034 (0x0034 - 0x0000)
struct BP_Girl015_Movement_C_ReceiveCustomRotation final
{
public:
	struct FRotator                               CurrentRotation;                                   // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               TargetRotation;                                    // 0x000C(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         DeltaTime;                                         // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ReturnValue;                                       // 0x001C(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_Girl015_Movement_C_ReceiveCustomRotation;

}

