#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl006a_Movement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DefaultPlayerMoveComponent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Girl006a_Movement.BP_Girl006a_Movement_C
// 0x0010 (0x13C0 - 0x13B0)
class UBP_Girl006a_Movement_C final : public UDefaultPlayerMoveComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Girl006a_Movement_C;             // 0x13A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          NewVar_0_0;                                        // 0x13B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          New_Var_0;                                         // 0x13B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	bool ReceiveCustomSpeedCurve(struct FCustomSpeedCurve* CustomSpeedCurve);
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_BP_Girl006a_Movement(int32 EntryPoint);

	struct FRotator ReceiveCustomRotation(const struct FRotator& CurrentRotation, const struct FRotator& TargetRotation, float DeltaTime) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Girl006a_Movement_C">();
	}
	static class UBP_Girl006a_Movement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Girl006a_Movement_C>();
	}
};
static_assert(alignof(UBP_Girl006a_Movement_C) == 0x000010, "Wrong alignment on UBP_Girl006a_Movement_C");
static_assert(sizeof(UBP_Girl006a_Movement_C) == 0x0013C0, "Wrong size on UBP_Girl006a_Movement_C");
static_assert(offsetof(UBP_Girl006a_Movement_C, UberGraphFrame_BP_Girl006a_Movement_C) == 0x0013A8, "Member 'UBP_Girl006a_Movement_C::UberGraphFrame_BP_Girl006a_Movement_C' has a wrong offset!");
static_assert(offsetof(UBP_Girl006a_Movement_C, NewVar_0_0) == 0x0013B0, "Member 'UBP_Girl006a_Movement_C::NewVar_0_0' has a wrong offset!");
static_assert(offsetof(UBP_Girl006a_Movement_C, New_Var_0) == 0x0013B1, "Member 'UBP_Girl006a_Movement_C::New_Var_0' has a wrong offset!");

}

