#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl015_prop02

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Girl015_prop02.BP_Girl015_prop02_C
// 0x0060 (0x0500 - 0x04A0)
class ABP_Girl015_prop02_C final : public ACharacterAccessory
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        MeshPath;                                          // 0x04B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         CastSkillID;                                       // 0x04C8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	int32                                         CurCastSkilID;                                     // 0x04CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBegunPlay;                                        // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Montage02;                                         // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage04;                                         // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage07;                                         // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WineID;                                            // 0x04F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHiden;                                            // 0x04F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bAin;                                              // 0x04F5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F6[0x2];                                      // 0x04F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Montage08;                                         // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ShowWine();
	void HideWine();
	void OnRep_CastSkillID();
	void SkinReplace();
	TArray<struct FSoftObjectPath> OnGetAssetPath(TArray<int32>& CharacterIDs, TArray<int32>& SkillIDs);
	void OnNotifyEnd_BE4F4DDB4D2AB15C559C298FEAD543C2(class FName NotifyName);
	void OnNotifyBegin_BE4F4DDB4D2AB15C559C298FEAD543C2(class FName NotifyName);
	void OnInterrupted_BE4F4DDB4D2AB15C559C298FEAD543C2(class FName NotifyName);
	void OnBlendOut_BE4F4DDB4D2AB15C559C298FEAD543C2(class FName NotifyName);
	void OnCompleted_BE4F4DDB4D2AB15C559C298FEAD543C2(class FName NotifyName);
	void OnNotifyEnd_DC6BDBB24C69D3BCC69F89A691593D90(class FName NotifyName);
	void OnNotifyBegin_DC6BDBB24C69D3BCC69F89A691593D90(class FName NotifyName);
	void OnInterrupted_DC6BDBB24C69D3BCC69F89A691593D90(class FName NotifyName);
	void OnBlendOut_DC6BDBB24C69D3BCC69F89A691593D90(class FName NotifyName);
	void OnCompleted_DC6BDBB24C69D3BCC69F89A691593D90(class FName NotifyName);
	void OnNotifyEnd_15E405234E55C2A1E52DE99BCED7CB26(class FName NotifyName);
	void OnNotifyBegin_15E405234E55C2A1E52DE99BCED7CB26(class FName NotifyName);
	void OnInterrupted_15E405234E55C2A1E52DE99BCED7CB26(class FName NotifyName);
	void OnBlendOut_15E405234E55C2A1E52DE99BCED7CB26(class FName NotifyName);
	void OnCompleted_15E405234E55C2A1E52DE99BCED7CB26(class FName NotifyName);
	void OnNotifyEnd_A8FCA3FA46BD1EE9882796BC23CC3686(class FName NotifyName);
	void OnNotifyBegin_A8FCA3FA46BD1EE9882796BC23CC3686(class FName NotifyName);
	void OnInterrupted_A8FCA3FA46BD1EE9882796BC23CC3686(class FName NotifyName);
	void OnBlendOut_A8FCA3FA46BD1EE9882796BC23CC3686(class FName NotifyName);
	void OnCompleted_A8FCA3FA46BD1EE9882796BC23CC3686(class FName NotifyName);
	void ReceiveBeginPlay();
	void SkillEnd(int32 SkillID);
	void OnAbilityCastSkill____0(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void PlaySkillMontage();
	void Aim(bool bInAiming);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ExecuteUbergraph_BP_Girl015_prop02(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Girl015_prop02_C">();
	}
	static class ABP_Girl015_prop02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Girl015_prop02_C>();
	}
};
static_assert(alignof(ABP_Girl015_prop02_C) == 0x000008, "Wrong alignment on ABP_Girl015_prop02_C");
static_assert(sizeof(ABP_Girl015_prop02_C) == 0x000500, "Wrong size on ABP_Girl015_prop02_C");
static_assert(offsetof(ABP_Girl015_prop02_C, UberGraphFrame) == 0x0004A0, "Member 'ABP_Girl015_prop02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Girl015_prop02_C, SkeletalMesh) == 0x0004A8, "Member 'ABP_Girl015_prop02_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_Girl015_prop02_C, MeshPath) == 0x0004B0, "Member 'ABP_Girl015_prop02_C::MeshPath' has a wrong offset!");
static_assert(offsetof(ABP_Girl015_prop02_C, CastSkillID) == 0x0004C8, "Member 'ABP_Girl015_prop02_C::CastSkillID' has a wrong offset!");
static_assert(offsetof(ABP_Girl015_prop02_C, CurCastSkilID) == 0x0004CC, "Member 'ABP_Girl015_prop02_C::CurCastSkilID' has a wrong offset!");
static_assert(offsetof(ABP_Girl015_prop02_C, bBegunPlay) == 0x0004D0, "Member 'ABP_Girl015_prop02_C::bBegunPlay' has a wrong offset!");
static_assert(offsetof(ABP_Girl015_prop02_C, Montage02) == 0x0004D8, "Member 'ABP_Girl015_prop02_C::Montage02' has a wrong offset!");
static_assert(offsetof(ABP_Girl015_prop02_C, Montage04) == 0x0004E0, "Member 'ABP_Girl015_prop02_C::Montage04' has a wrong offset!");
static_assert(offsetof(ABP_Girl015_prop02_C, Montage07) == 0x0004E8, "Member 'ABP_Girl015_prop02_C::Montage07' has a wrong offset!");
static_assert(offsetof(ABP_Girl015_prop02_C, WineID) == 0x0004F0, "Member 'ABP_Girl015_prop02_C::WineID' has a wrong offset!");
static_assert(offsetof(ABP_Girl015_prop02_C, bHiden) == 0x0004F4, "Member 'ABP_Girl015_prop02_C::bHiden' has a wrong offset!");
static_assert(offsetof(ABP_Girl015_prop02_C, bAin) == 0x0004F5, "Member 'ABP_Girl015_prop02_C::bAin' has a wrong offset!");
static_assert(offsetof(ABP_Girl015_prop02_C, Montage08) == 0x0004F8, "Member 'ABP_Girl015_prop02_C::Montage08' has a wrong offset!");

}

