#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl004b_Afterimage

#include "Basic.hpp"

#include "Game_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Girl004b_Afterimage.BP_Girl004b_Afterimage_C
// 0x0108 (0x03A8 - 0x02A0)
class ABP_Girl004b_Afterimage_C final : public APlayerAfterimage
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         CurPercent;                                        // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, class UMaterialInterface*>        MatInst;                                           // 0x02B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class UMaterialInstanceDynamic*>  Mats;                                              // 0x0300(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         SkinID;                                            // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, class UClass*>                    AnimInstanceReplace;                               // 0x0358(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void GetMat(class UMaterialInstanceDynamic** NewParam);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void OnSpawn();
	void ExecuteUbergraph_BP_Girl004b_Afterimage(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Girl004b_Afterimage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Girl004b_Afterimage_C")
	}
	static class ABP_Girl004b_Afterimage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Girl004b_Afterimage_C>();
	}
};
DUMPER7_ASSERTS_ABP_Girl004b_Afterimage_C;

}

