#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// LuaFunction BP_GameController.BP_GameController_C.LuaImpl_CallDSExec
// 0x0018 (0x0018 - 0x0000)
struct BP_GameController_C_LuaImpl_CallDSExec final
{
public:
	int32                                         InCmd;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InContent;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_GameController_C_LuaImpl_CallDSExec) == 0x000008, "Wrong alignment on BP_GameController_C_LuaImpl_CallDSExec");
static_assert(sizeof(BP_GameController_C_LuaImpl_CallDSExec) == 0x000018, "Wrong size on BP_GameController_C_LuaImpl_CallDSExec");
static_assert(offsetof(BP_GameController_C_LuaImpl_CallDSExec, InCmd) == 0x000000, "Member 'BP_GameController_C_LuaImpl_CallDSExec::InCmd' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_LuaImpl_CallDSExec, InContent) == 0x000008, "Member 'BP_GameController_C_LuaImpl_CallDSExec::InContent' has a wrong offset!");

// LuaFunction BP_GameController.BP_GameController_C.LuaImpl_CallClientExec
// 0x0018 (0x0018 - 0x0000)
struct BP_GameController_C_LuaImpl_CallClientExec final
{
public:
	int32                                         InCmd;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InContent;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_GameController_C_LuaImpl_CallClientExec) == 0x000008, "Wrong alignment on BP_GameController_C_LuaImpl_CallClientExec");
static_assert(sizeof(BP_GameController_C_LuaImpl_CallClientExec) == 0x000018, "Wrong size on BP_GameController_C_LuaImpl_CallClientExec");
static_assert(offsetof(BP_GameController_C_LuaImpl_CallClientExec, InCmd) == 0x000000, "Member 'BP_GameController_C_LuaImpl_CallClientExec::InCmd' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_LuaImpl_CallClientExec, InContent) == 0x000008, "Member 'BP_GameController_C_LuaImpl_CallClientExec::InContent' has a wrong offset!");

// Function BP_GameController.BP_GameController_C.CalcSideLength
// 0x0034 (0x0034 - 0x0000)
struct BP_GameController_C_CalcSideLength final
{
public:
	float                                         InVal;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LineVal;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnVal;                                         // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TempLength;                                        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_1;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sqrt_ReturnValue;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_2;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GameController_C_CalcSideLength) == 0x000004, "Wrong alignment on BP_GameController_C_CalcSideLength");
static_assert(sizeof(BP_GameController_C_CalcSideLength) == 0x000034, "Wrong size on BP_GameController_C_CalcSideLength");
static_assert(offsetof(BP_GameController_C_CalcSideLength, InVal) == 0x000000, "Member 'BP_GameController_C_CalcSideLength::InVal' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_CalcSideLength, LineVal) == 0x000004, "Member 'BP_GameController_C_CalcSideLength::LineVal' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_CalcSideLength, ReturnVal) == 0x000008, "Member 'BP_GameController_C_CalcSideLength::ReturnVal' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_CalcSideLength, TempLength) == 0x00000C, "Member 'BP_GameController_C_CalcSideLength::TempLength' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_CalcSideLength, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_GameController_C_CalcSideLength::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_CalcSideLength, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_GameController_C_CalcSideLength::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_CalcSideLength, CallFunc_Abs_ReturnValue) == 0x000018, "Member 'BP_GameController_C_CalcSideLength::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_CalcSideLength, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1) == 0x00001C, "Member 'BP_GameController_C_CalcSideLength::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_CalcSideLength, CallFunc_EqualEqual_FloatFloat_ReturnValue_1) == 0x000020, "Member 'BP_GameController_C_CalcSideLength::CallFunc_EqualEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_CalcSideLength, CallFunc_Add_FloatFloat_ReturnValue) == 0x000024, "Member 'BP_GameController_C_CalcSideLength::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_CalcSideLength, CallFunc_Abs_ReturnValue_1) == 0x000028, "Member 'BP_GameController_C_CalcSideLength::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_CalcSideLength, CallFunc_Sqrt_ReturnValue) == 0x00002C, "Member 'BP_GameController_C_CalcSideLength::CallFunc_Sqrt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_CalcSideLength, CallFunc_EqualEqual_FloatFloat_ReturnValue_2) == 0x000030, "Member 'BP_GameController_C_CalcSideLength::CallFunc_EqualEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_CalcSideLength, CallFunc_BooleanOR_ReturnValue) == 0x000031, "Member 'BP_GameController_C_CalcSideLength::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_GameController.BP_GameController_C.SetRushButtonType
// 0x0004 (0x0004 - 0x0000)
struct BP_GameController_C_SetRushButtonType final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameController_C_SetRushButtonType) == 0x000004, "Wrong alignment on BP_GameController_C_SetRushButtonType");
static_assert(sizeof(BP_GameController_C_SetRushButtonType) == 0x000004, "Wrong size on BP_GameController_C_SetRushButtonType");
static_assert(offsetof(BP_GameController_C_SetRushButtonType, InType) == 0x000000, "Member 'BP_GameController_C_SetRushButtonType::InType' has a wrong offset!");

// Function BP_GameController.BP_GameController_C.AutoFireToRush
// 0x0002 (0x0002 - 0x0000)
struct BP_GameController_C_AutoFireToRush final
{
public:
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GameController_C_AutoFireToRush) == 0x000001, "Wrong alignment on BP_GameController_C_AutoFireToRush");
static_assert(sizeof(BP_GameController_C_AutoFireToRush) == 0x000002, "Wrong size on BP_GameController_C_AutoFireToRush");
static_assert(offsetof(BP_GameController_C_AutoFireToRush, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000000, "Member 'BP_GameController_C_AutoFireToRush::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_AutoFireToRush, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'BP_GameController_C_AutoFireToRush::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_GameController.BP_GameController_C.RushNotAutoFire
// 0x0001 (0x0001 - 0x0000)
struct BP_GameController_C_RushNotAutoFire final
{
public:
	bool                                          bNotAutoFire;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GameController_C_RushNotAutoFire) == 0x000001, "Wrong alignment on BP_GameController_C_RushNotAutoFire");
static_assert(sizeof(BP_GameController_C_RushNotAutoFire) == 0x000001, "Wrong size on BP_GameController_C_RushNotAutoFire");
static_assert(offsetof(BP_GameController_C_RushNotAutoFire, bNotAutoFire) == 0x000000, "Member 'BP_GameController_C_RushNotAutoFire::bNotAutoFire' has a wrong offset!");

// Function BP_GameController.BP_GameController_C.CheckInAutoFire
// 0x0001 (0x0001 - 0x0000)
struct BP_GameController_C_CheckInAutoFire final
{
public:
	bool                                          bInAutoFire;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GameController_C_CheckInAutoFire) == 0x000001, "Wrong alignment on BP_GameController_C_CheckInAutoFire");
static_assert(sizeof(BP_GameController_C_CheckInAutoFire) == 0x000001, "Wrong size on BP_GameController_C_CheckInAutoFire");
static_assert(offsetof(BP_GameController_C_CheckInAutoFire, bInAutoFire) == 0x000000, "Member 'BP_GameController_C_CheckInAutoFire::bInAutoFire' has a wrong offset!");

// Function BP_GameController.BP_GameController_C.SetSensitivityCamera
// 0x0010 (0x0010 - 0x0000)
struct BP_GameController_C_SetSensitivityCamera final
{
public:
	int32                                         InCameraNormal;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InCameraShotGun;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InGyrosopeNormal;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InGyrosopeShotGun;                                 // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameController_C_SetSensitivityCamera) == 0x000004, "Wrong alignment on BP_GameController_C_SetSensitivityCamera");
static_assert(sizeof(BP_GameController_C_SetSensitivityCamera) == 0x000010, "Wrong size on BP_GameController_C_SetSensitivityCamera");
static_assert(offsetof(BP_GameController_C_SetSensitivityCamera, InCameraNormal) == 0x000000, "Member 'BP_GameController_C_SetSensitivityCamera::InCameraNormal' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_SetSensitivityCamera, InCameraShotGun) == 0x000004, "Member 'BP_GameController_C_SetSensitivityCamera::InCameraShotGun' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_SetSensitivityCamera, InGyrosopeNormal) == 0x000008, "Member 'BP_GameController_C_SetSensitivityCamera::InGyrosopeNormal' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_SetSensitivityCamera, InGyrosopeShotGun) == 0x00000C, "Member 'BP_GameController_C_SetSensitivityCamera::InGyrosopeShotGun' has a wrong offset!");

// Function BP_GameController.BP_GameController_C.ResetSensitivityCamera
// 0x0028 (0x0028 - 0x0000)
struct BP_GameController_C_ResetSensitivityCamera final
{
public:
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerWeapon*                          CallFunc_GetWeapon_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GameController_C_ResetSensitivityCamera) == 0x000008, "Wrong alignment on BP_GameController_C_ResetSensitivityCamera");
static_assert(sizeof(BP_GameController_C_ResetSensitivityCamera) == 0x000028, "Wrong size on BP_GameController_C_ResetSensitivityCamera");
static_assert(offsetof(BP_GameController_C_ResetSensitivityCamera, CallFunc_K2_GetPawn_ReturnValue) == 0x000000, "Member 'BP_GameController_C_ResetSensitivityCamera::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_ResetSensitivityCamera, K2Node_DynamicCast_AsGame_Character) == 0x000008, "Member 'BP_GameController_C_ResetSensitivityCamera::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_ResetSensitivityCamera, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_GameController_C_ResetSensitivityCamera::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_ResetSensitivityCamera, CallFunc_GetWeapon_ReturnValue) == 0x000018, "Member 'BP_GameController_C_ResetSensitivityCamera::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_ResetSensitivityCamera, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_GameController_C_ResetSensitivityCamera::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_ResetSensitivityCamera, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000021, "Member 'BP_GameController_C_ResetSensitivityCamera::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_ResetSensitivityCamera, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000022, "Member 'BP_GameController_C_ResetSensitivityCamera::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_ResetSensitivityCamera, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000023, "Member 'BP_GameController_C_ResetSensitivityCamera::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_ResetSensitivityCamera, CallFunc_BooleanOR_ReturnValue) == 0x000024, "Member 'BP_GameController_C_ResetSensitivityCamera::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_GameController.BP_GameController_C.ForceStopAutoFireInBunker
// 0x0001 (0x0001 - 0x0000)
struct BP_GameController_C_ForceStopAutoFireInBunker final
{
public:
	bool                                          bStop;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GameController_C_ForceStopAutoFireInBunker) == 0x000001, "Wrong alignment on BP_GameController_C_ForceStopAutoFireInBunker");
static_assert(sizeof(BP_GameController_C_ForceStopAutoFireInBunker) == 0x000001, "Wrong size on BP_GameController_C_ForceStopAutoFireInBunker");
static_assert(offsetof(BP_GameController_C_ForceStopAutoFireInBunker, bStop) == 0x000000, "Member 'BP_GameController_C_ForceStopAutoFireInBunker::bStop' has a wrong offset!");

// Function BP_GameController.BP_GameController_C.ResetAutoFireInBunker
// 0x0020 (0x0020 - 0x0000)
struct BP_GameController_C_ResetAutoFireInBunker final
{
public:
	bool                                          CallFunc_IsEditorMobile_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHalfBunker_ReturnValue;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFullBunker_ReturnValue;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GameController_C_ResetAutoFireInBunker) == 0x000008, "Wrong alignment on BP_GameController_C_ResetAutoFireInBunker");
static_assert(sizeof(BP_GameController_C_ResetAutoFireInBunker) == 0x000020, "Wrong size on BP_GameController_C_ResetAutoFireInBunker");
static_assert(offsetof(BP_GameController_C_ResetAutoFireInBunker, CallFunc_IsEditorMobile_ReturnValue) == 0x000000, "Member 'BP_GameController_C_ResetAutoFireInBunker::CallFunc_IsEditorMobile_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_ResetAutoFireInBunker, CallFunc_IsMobilePlatform_ReturnValue) == 0x000001, "Member 'BP_GameController_C_ResetAutoFireInBunker::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_ResetAutoFireInBunker, CallFunc_BooleanOR_ReturnValue) == 0x000002, "Member 'BP_GameController_C_ResetAutoFireInBunker::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_ResetAutoFireInBunker, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'BP_GameController_C_ResetAutoFireInBunker::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_ResetAutoFireInBunker, CallFunc_BooleanAND_ReturnValue) == 0x000004, "Member 'BP_GameController_C_ResetAutoFireInBunker::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_ResetAutoFireInBunker, CallFunc_BooleanOR_ReturnValue_1) == 0x000005, "Member 'BP_GameController_C_ResetAutoFireInBunker::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_ResetAutoFireInBunker, CallFunc_K2_GetPawn_ReturnValue) == 0x000008, "Member 'BP_GameController_C_ResetAutoFireInBunker::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_ResetAutoFireInBunker, K2Node_DynamicCast_AsGame_Player) == 0x000010, "Member 'BP_GameController_C_ResetAutoFireInBunker::K2Node_DynamicCast_AsGame_Player' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_ResetAutoFireInBunker, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_GameController_C_ResetAutoFireInBunker::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_ResetAutoFireInBunker, CallFunc_IsHalfBunker_ReturnValue) == 0x000019, "Member 'BP_GameController_C_ResetAutoFireInBunker::CallFunc_IsHalfBunker_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_ResetAutoFireInBunker, CallFunc_IsFullBunker_ReturnValue) == 0x00001A, "Member 'BP_GameController_C_ResetAutoFireInBunker::CallFunc_IsFullBunker_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_ResetAutoFireInBunker, CallFunc_BooleanOR_ReturnValue_2) == 0x00001B, "Member 'BP_GameController_C_ResetAutoFireInBunker::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function BP_GameController.BP_GameController_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_GameController_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameController_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_GameController_C_ReceiveTick");
static_assert(sizeof(BP_GameController_C_ReceiveTick) == 0x000004, "Wrong size on BP_GameController_C_ReceiveTick");
static_assert(offsetof(BP_GameController_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_GameController_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_GameController.BP_GameController_C.NotifyAutoFire
// 0x0001 (0x0001 - 0x0000)
struct BP_GameController_C_NotifyAutoFire final
{
public:
	bool                                          bFire;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GameController_C_NotifyAutoFire) == 0x000001, "Wrong alignment on BP_GameController_C_NotifyAutoFire");
static_assert(sizeof(BP_GameController_C_NotifyAutoFire) == 0x000001, "Wrong size on BP_GameController_C_NotifyAutoFire");
static_assert(offsetof(BP_GameController_C_NotifyAutoFire, bFire) == 0x000000, "Member 'BP_GameController_C_NotifyAutoFire::bFire' has a wrong offset!");

// Function BP_GameController.BP_GameController_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_GameController_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameController_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_GameController_C_ReceiveEndPlay");
static_assert(sizeof(BP_GameController_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_GameController_C_ReceiveEndPlay");
static_assert(offsetof(BP_GameController_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_GameController_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_GameController.BP_GameController_C.Client_ResumePlayerOperation
// 0x0001 (0x0001 - 0x0000)
struct BP_GameController_C_Client_ResumePlayerOperation final
{
public:
	EPlayerAction                                 Action;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameController_C_Client_ResumePlayerOperation) == 0x000001, "Wrong alignment on BP_GameController_C_Client_ResumePlayerOperation");
static_assert(sizeof(BP_GameController_C_Client_ResumePlayerOperation) == 0x000001, "Wrong size on BP_GameController_C_Client_ResumePlayerOperation");
static_assert(offsetof(BP_GameController_C_Client_ResumePlayerOperation, Action) == 0x000000, "Member 'BP_GameController_C_Client_ResumePlayerOperation::Action' has a wrong offset!");

// Function BP_GameController.BP_GameController_C.Client_ClearPlayerActionFlag
// 0x0010 (0x0010 - 0x0000)
struct BP_GameController_C_Client_ClearPlayerActionFlag final
{
public:
	EPlayerAction                                 Action;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayer*                            TargetPlayer;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameController_C_Client_ClearPlayerActionFlag) == 0x000008, "Wrong alignment on BP_GameController_C_Client_ClearPlayerActionFlag");
static_assert(sizeof(BP_GameController_C_Client_ClearPlayerActionFlag) == 0x000010, "Wrong size on BP_GameController_C_Client_ClearPlayerActionFlag");
static_assert(offsetof(BP_GameController_C_Client_ClearPlayerActionFlag, Action) == 0x000000, "Member 'BP_GameController_C_Client_ClearPlayerActionFlag::Action' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_Client_ClearPlayerActionFlag, TargetPlayer) == 0x000008, "Member 'BP_GameController_C_Client_ClearPlayerActionFlag::TargetPlayer' has a wrong offset!");

// Function BP_GameController.BP_GameController_C.ExecuteUbergraph_BP_GameController
// 0x0180 (0x0180 - 0x0000)
struct BP_GameController_C_ExecuteUbergraph_BP_GameController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bFire)>                   K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0060(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class ABaseCharacter_C*                       K2Node_DynamicCast_AsBase_Character;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x00A0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bFire;                          // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DF[0x1];                                       // 0x00DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSettingValue_ReturnValue;              // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSettingValue_ReturnValue_1;            // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSettingValue_ReturnValue_2;            // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSettingValue_ReturnValue_3;            // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSettingValue_ReturnValue_4;            // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_3;                     // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_4;                     // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSettingValue_ReturnValue_5;            // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSettingValue_ReturnValue_6;            // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_5;                     // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_6;                     // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerAction                                 K2Node_CustomEvent_Action_1;                       // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerAction                                 K2Node_CustomEvent_Action;                         // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_146[0x2];                                      // 0x0146(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayer*                            K2Node_CustomEvent_TargetPlayer;                   // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterStateMachineComponent*        K2Node_DynamicCast_AsCharacter_State_Machine_Component; // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetCurrentChar_ReturnValue;               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GameController_C_ExecuteUbergraph_BP_GameController) == 0x000010, "Wrong alignment on BP_GameController_C_ExecuteUbergraph_BP_GameController");
static_assert(sizeof(BP_GameController_C_ExecuteUbergraph_BP_GameController) == 0x000180, "Wrong size on BP_GameController_C_ExecuteUbergraph_BP_GameController");
static_assert(offsetof(BP_GameController_C_ExecuteUbergraph_BP_GameController, EntryPoint) == 0x000000, "Member 'BP_GameController_C_ExecuteUbergraph_BP_GameController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GameController_C_ExecuteUbergraph_BP_GameController, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_GameController_C_ExecuteUbergraph_BP_GameController::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
