#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl_Preview_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Girl_Preview_Base.BP_Girl_Preview_Base_C.ShowOrHideRing
// 0x0001 (0x0001 - 0x0000)
struct BP_Girl_Preview_Base_C_ShowOrHideRing final
{
public:
	bool                                          InShow;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Girl_Preview_Base_C_ShowOrHideRing) == 0x000001, "Wrong alignment on BP_Girl_Preview_Base_C_ShowOrHideRing");
static_assert(sizeof(BP_Girl_Preview_Base_C_ShowOrHideRing) == 0x000001, "Wrong size on BP_Girl_Preview_Base_C_ShowOrHideRing");
static_assert(offsetof(BP_Girl_Preview_Base_C_ShowOrHideRing, InShow) == 0x000000, "Member 'BP_Girl_Preview_Base_C_ShowOrHideRing::InShow' has a wrong offset!");

// Function BP_Girl_Preview_Base.BP_Girl_Preview_Base_C.WeaponHiddenEvent
// 0x0001 (0x0001 - 0x0000)
struct BP_Girl_Preview_Base_C_WeaponHiddenEvent final
{
public:
	bool                                          bWeaponHidden;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Girl_Preview_Base_C_WeaponHiddenEvent) == 0x000001, "Wrong alignment on BP_Girl_Preview_Base_C_WeaponHiddenEvent");
static_assert(sizeof(BP_Girl_Preview_Base_C_WeaponHiddenEvent) == 0x000001, "Wrong size on BP_Girl_Preview_Base_C_WeaponHiddenEvent");
static_assert(offsetof(BP_Girl_Preview_Base_C_WeaponHiddenEvent, bWeaponHidden) == 0x000000, "Member 'BP_Girl_Preview_Base_C_WeaponHiddenEvent::bWeaponHidden' has a wrong offset!");

// Function BP_Girl_Preview_Base.BP_Girl_Preview_Base_C.ExecuteUbergraph_BP_Girl_Preview_Base
// 0x0058 (0x0058 - 0x0000)
struct BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InShow;                               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APreviewModel*                          CallFunc_GetAttachActorByTag_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x0028(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABp_wpbase_preview_C*                   K2Node_DynamicCast_AsBp_Wpbase_Preview;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bWeaponHidden;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base) == 0x000008, "Wrong alignment on BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base");
static_assert(sizeof(BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base) == 0x000058, "Wrong size on BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base");
static_assert(offsetof(BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base, EntryPoint) == 0x000000, "Member 'BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base, ___int_Loop_Counter_Variable) == 0x000004, "Member 'BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base, ___int_Array_Index_Variable) == 0x000008, "Member 'BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000010, "Member 'BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base, K2Node_Event_InShow) == 0x000011, "Member 'BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base::K2Node_Event_InShow' has a wrong offset!");
static_assert(offsetof(BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base, CallFunc_GetAttachActorByTag_ReturnValue) == 0x000018, "Member 'BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base::CallFunc_GetAttachActorByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base, CallFunc_GetAttachedActors_OutActors) == 0x000028, "Member 'BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base::CallFunc_GetAttachedActors_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base, CallFunc_IsValid_ReturnValue_1) == 0x000044, "Member 'BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base, CallFunc_Less_IntInt_ReturnValue) == 0x000045, "Member 'BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base, K2Node_DynamicCast_AsBp_Wpbase_Preview) == 0x000048, "Member 'BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base::K2Node_DynamicCast_AsBp_Wpbase_Preview' has a wrong offset!");
static_assert(offsetof(BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base, K2Node_CustomEvent_bWeaponHidden) == 0x000051, "Member 'BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base::K2Node_CustomEvent_bWeaponHidden' has a wrong offset!");
static_assert(offsetof(BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base, CallFunc_Not_PreBool_ReturnValue_1) == 0x000052, "Member 'BP_Girl_Preview_Base_C_ExecuteUbergraph_BP_Girl_Preview_Base::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

}

