#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl_Head_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Girl_Head_Base.BP_Girl_Head_Base_C.UpdateForwardVector
// 0x00B0 (0x00B0 - 0x0000)
struct BP_Girl_Head_Base_C_UpdateForwardVector final
{
public:
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue;         // 0x0000(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Split_LeftS_1;                            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS_1;                           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue_1;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Girl_Head_Base_C_UpdateForwardVector) == 0x000008, "Wrong alignment on BP_Girl_Head_Base_C_UpdateForwardVector");
static_assert(sizeof(BP_Girl_Head_Base_C_UpdateForwardVector) == 0x0000B0, "Wrong size on BP_Girl_Head_Base_C_UpdateForwardVector");
static_assert(offsetof(BP_Girl_Head_Base_C_UpdateForwardVector, CallFunc_GetMaterialSlotNames_ReturnValue) == 0x000000, "Member 'BP_Girl_Head_Base_C_UpdateForwardVector::CallFunc_GetMaterialSlotNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_UpdateForwardVector, CallFunc_GetObjectName_ReturnValue) == 0x000010, "Member 'BP_Girl_Head_Base_C_UpdateForwardVector::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_UpdateForwardVector, CallFunc_Split_LeftS) == 0x000020, "Member 'BP_Girl_Head_Base_C_UpdateForwardVector::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_UpdateForwardVector, CallFunc_Split_RightS) == 0x000030, "Member 'BP_Girl_Head_Base_C_UpdateForwardVector::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_UpdateForwardVector, CallFunc_Split_ReturnValue) == 0x000040, "Member 'BP_Girl_Head_Base_C_UpdateForwardVector::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_UpdateForwardVector, CallFunc_Split_LeftS_1) == 0x000048, "Member 'BP_Girl_Head_Base_C_UpdateForwardVector::CallFunc_Split_LeftS_1' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_UpdateForwardVector, CallFunc_Split_RightS_1) == 0x000058, "Member 'BP_Girl_Head_Base_C_UpdateForwardVector::CallFunc_Split_RightS_1' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_UpdateForwardVector, CallFunc_Split_ReturnValue_1) == 0x000068, "Member 'BP_Girl_Head_Base_C_UpdateForwardVector::CallFunc_Split_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_UpdateForwardVector, CallFunc_Concat_StrStr_ReturnValue) == 0x000070, "Member 'BP_Girl_Head_Base_C_UpdateForwardVector::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_UpdateForwardVector, CallFunc_Conv_StringToName_ReturnValue) == 0x000080, "Member 'BP_Girl_Head_Base_C_UpdateForwardVector::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_UpdateForwardVector, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000088, "Member 'BP_Girl_Head_Base_C_UpdateForwardVector::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_UpdateForwardVector, CallFunc_Array_Find_ReturnValue) == 0x000098, "Member 'BP_Girl_Head_Base_C_UpdateForwardVector::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_UpdateForwardVector, CallFunc_Conv_StringToName_ReturnValue_1) == 0x00009C, "Member 'BP_Girl_Head_Base_C_UpdateForwardVector::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_UpdateForwardVector, CallFunc_Greater_IntInt_ReturnValue) == 0x0000A4, "Member 'BP_Girl_Head_Base_C_UpdateForwardVector::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_UpdateForwardVector, CallFunc_Array_Find_ReturnValue_1) == 0x0000A8, "Member 'BP_Girl_Head_Base_C_UpdateForwardVector::CallFunc_Array_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_UpdateForwardVector, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000AC, "Member 'BP_Girl_Head_Base_C_UpdateForwardVector::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_Girl_Head_Base.BP_Girl_Head_Base_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Girl_Head_Base_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl_Head_Base_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Girl_Head_Base_C_ReceiveTick");
static_assert(sizeof(BP_Girl_Head_Base_C_ReceiveTick) == 0x000004, "Wrong size on BP_Girl_Head_Base_C_ReceiveTick");
static_assert(offsetof(BP_Girl_Head_Base_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Girl_Head_Base_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Girl_Head_Base.BP_Girl_Head_Base_C.ExecuteUbergraph_BP_Girl_Head_Base
// 0x0088 (0x0088 - 0x0000)
struct BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMaterialParameterInfo                 K2Node_MakeStruct_MaterialParameterInfo;           // 0x0004(0x0010)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGraphicsSettingManager*                CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInMainMap_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APreviewActor*                          K2Node_DynamicCast_AsPreview_Actor;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_As______;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadUObject_ReturnValue;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_DynamicCast_As____;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base) == 0x000008, "Wrong alignment on BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base");
static_assert(sizeof(BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base) == 0x000088, "Wrong size on BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base");
static_assert(offsetof(BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base, EntryPoint) == 0x000000, "Member 'BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base, K2Node_MakeStruct_MaterialParameterInfo) == 0x000004, "Member 'BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base::K2Node_MakeStruct_MaterialParameterInfo' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000018, "Member 'BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base, CallFunc_IsInMainMap_ReturnValue) == 0x000021, "Member 'BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base::CallFunc_IsInMainMap_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base, CallFunc_GetMaterial_ReturnValue) == 0x000028, "Member 'BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base, CallFunc_GetOwner_ReturnValue) == 0x000030, "Member 'BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base, CallFunc_GetOwner_ReturnValue_1) == 0x000040, "Member 'BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base, K2Node_DynamicCast_AsPreview_Actor) == 0x000048, "Member 'BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base::K2Node_DynamicCast_AsPreview_Actor' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base, CallFunc_IsValid_ReturnValue_2) == 0x000051, "Member 'BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base, CallFunc_IsValid_ReturnValue_3) == 0x000052, "Member 'BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base, K2Node_DynamicCast_As______) == 0x000058, "Member 'BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base::K2Node_DynamicCast_As______' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base, CallFunc_LoadUObject_ReturnValue) == 0x000068, "Member 'BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base::CallFunc_LoadUObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base, K2Node_DynamicCast_As____) == 0x000070, "Member 'BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base::K2Node_DynamicCast_As____' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000080, "Member 'BP_Girl_Head_Base_C_ExecuteUbergraph_BP_Girl_Head_Base::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_Girl_Head_Base.BP_Girl_Head_Base_C.GetSkeletalMesh
// 0x0008 (0x0008 - 0x0000)
struct BP_Girl_Head_Base_C_GetSkeletalMesh final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl_Head_Base_C_GetSkeletalMesh) == 0x000008, "Wrong alignment on BP_Girl_Head_Base_C_GetSkeletalMesh");
static_assert(sizeof(BP_Girl_Head_Base_C_GetSkeletalMesh) == 0x000008, "Wrong size on BP_Girl_Head_Base_C_GetSkeletalMesh");
static_assert(offsetof(BP_Girl_Head_Base_C_GetSkeletalMesh, ReturnValue) == 0x000000, "Member 'BP_Girl_Head_Base_C_GetSkeletalMesh::ReturnValue' has a wrong offset!");

}

