#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl002a

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Girl002a.BP_Girl002a_C.OnSwitchLeave
// 0x0030 (0x0030 - 0x0000)
struct BP_Girl002a_C_OnSwitchLeave final
{
public:
	struct FTransform                             Trans;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Girl002a_C_OnSwitchLeave) == 0x000010, "Wrong alignment on BP_Girl002a_C_OnSwitchLeave");
static_assert(sizeof(BP_Girl002a_C_OnSwitchLeave) == 0x000030, "Wrong size on BP_Girl002a_C_OnSwitchLeave");
static_assert(offsetof(BP_Girl002a_C_OnSwitchLeave, Trans) == 0x000000, "Member 'BP_Girl002a_C_OnSwitchLeave::Trans' has a wrong offset!");

// Function BP_Girl002a.BP_Girl002a_C.OnSwitchEnter
// 0x0030 (0x0030 - 0x0000)
struct BP_Girl002a_C_OnSwitchEnter final
{
public:
	struct FTransform                             Trans;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Girl002a_C_OnSwitchEnter) == 0x000010, "Wrong alignment on BP_Girl002a_C_OnSwitchEnter");
static_assert(sizeof(BP_Girl002a_C_OnSwitchEnter) == 0x000030, "Wrong size on BP_Girl002a_C_OnSwitchEnter");
static_assert(offsetof(BP_Girl002a_C_OnSwitchEnter, Trans) == 0x000000, "Member 'BP_Girl002a_C_OnSwitchEnter::Trans' has a wrong offset!");

// Function BP_Girl002a.BP_Girl002a_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Girl002a_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl002a_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Girl002a_C_ReceiveTick");
static_assert(sizeof(BP_Girl002a_C_ReceiveTick) == 0x000004, "Wrong size on BP_Girl002a_C_ReceiveTick");
static_assert(offsetof(BP_Girl002a_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Girl002a_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Girl002a.BP_Girl002a_C.ExecuteUbergraph_BP_Girl002a
// 0x0080 (0x0080 - 0x0000)
struct BP_Girl002a_C_ExecuteUbergraph_BP_Girl002a final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Event_Trans_1;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             K2Node_Event_Trans;                                // 0x0040(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl002a_C_ExecuteUbergraph_BP_Girl002a) == 0x000010, "Wrong alignment on BP_Girl002a_C_ExecuteUbergraph_BP_Girl002a");
static_assert(sizeof(BP_Girl002a_C_ExecuteUbergraph_BP_Girl002a) == 0x000080, "Wrong size on BP_Girl002a_C_ExecuteUbergraph_BP_Girl002a");
static_assert(offsetof(BP_Girl002a_C_ExecuteUbergraph_BP_Girl002a, EntryPoint) == 0x000000, "Member 'BP_Girl002a_C_ExecuteUbergraph_BP_Girl002a::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Girl002a_C_ExecuteUbergraph_BP_Girl002a, K2Node_Event_Trans_1) == 0x000010, "Member 'BP_Girl002a_C_ExecuteUbergraph_BP_Girl002a::K2Node_Event_Trans_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002a_C_ExecuteUbergraph_BP_Girl002a, K2Node_Event_Trans) == 0x000040, "Member 'BP_Girl002a_C_ExecuteUbergraph_BP_Girl002a::K2Node_Event_Trans' has a wrong offset!");
static_assert(offsetof(BP_Girl002a_C_ExecuteUbergraph_BP_Girl002a, K2Node_Event_DeltaSeconds) == 0x000070, "Member 'BP_Girl002a_C_ExecuteUbergraph_BP_Girl002a::K2Node_Event_DeltaSeconds' has a wrong offset!");

}

