#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_girl004_Prop02_2_New

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_girl004_Prop02_2_New.BP_Girl004_Prop02_2_New_C.dither
// 0x0018 (0x0018 - 0x0000)
struct BP_Girl004_Prop02_2_New_C_Dither final
{
public:
	bool                                          Condition;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_StartCharacterStateSimple_ReturnValue;    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl004_Prop02_2_New_C_Dither) == 0x000004, "Wrong alignment on BP_Girl004_Prop02_2_New_C_Dither");
static_assert(sizeof(BP_Girl004_Prop02_2_New_C_Dither) == 0x000018, "Wrong size on BP_Girl004_Prop02_2_New_C_Dither");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_Dither, Condition) == 0x000000, "Member 'BP_Girl004_Prop02_2_New_C_Dither::Condition' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_Dither, CallFunc_MakeColor_ReturnValue) == 0x000004, "Member 'BP_Girl004_Prop02_2_New_C_Dither::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_Dither, CallFunc_StartCharacterStateSimple_ReturnValue) == 0x000014, "Member 'BP_Girl004_Prop02_2_New_C_Dither::CallFunc_StartCharacterStateSimple_ReturnValue' has a wrong offset!");

// Function BP_girl004_Prop02_2_New.BP_Girl004_Prop02_2_New_C.GenerateAngle
// 0x0060 (0x0060 - 0x0000)
struct BP_Girl004_Prop02_2_New_C_GenerateAngle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Angle;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl004_Prop02_2_New_C_GenerateAngle) == 0x000004, "Wrong alignment on BP_Girl004_Prop02_2_New_C_GenerateAngle");
static_assert(sizeof(BP_Girl004_Prop02_2_New_C_GenerateAngle) == 0x000060, "Wrong size on BP_Girl004_Prop02_2_New_C_GenerateAngle");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_GenerateAngle, ReturnValue) == 0x000000, "Member 'BP_Girl004_Prop02_2_New_C_GenerateAngle::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_GenerateAngle, Angle) == 0x000004, "Member 'BP_Girl004_Prop02_2_New_C_GenerateAngle::Angle' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_GenerateAngle, CallFunc_Add_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_Girl004_Prop02_2_New_C_GenerateAngle::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_GenerateAngle, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00000C, "Member 'BP_Girl004_Prop02_2_New_C_GenerateAngle::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_GenerateAngle, CallFunc_Less_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_Girl004_Prop02_2_New_C_GenerateAngle::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_GenerateAngle, CallFunc_SelectFloat_ReturnValue) == 0x000014, "Member 'BP_Girl004_Prop02_2_New_C_GenerateAngle::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_GenerateAngle, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000018, "Member 'BP_Girl004_Prop02_2_New_C_GenerateAngle::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_GenerateAngle, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_Girl004_Prop02_2_New_C_GenerateAngle::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_GenerateAngle, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_Girl004_Prop02_2_New_C_GenerateAngle::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_GenerateAngle, CallFunc_Less_FloatFloat_ReturnValue_2) == 0x000021, "Member 'BP_Girl004_Prop02_2_New_C_GenerateAngle::CallFunc_Less_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_GenerateAngle, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000022, "Member 'BP_Girl004_Prop02_2_New_C_GenerateAngle::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_GenerateAngle, CallFunc_BooleanOR_ReturnValue) == 0x000023, "Member 'BP_Girl004_Prop02_2_New_C_GenerateAngle::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_GenerateAngle, CallFunc_GetControlRotation_ReturnValue) == 0x000024, "Member 'BP_Girl004_Prop02_2_New_C_GenerateAngle::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_GenerateAngle, CallFunc_BreakRotator_Roll) == 0x000030, "Member 'BP_Girl004_Prop02_2_New_C_GenerateAngle::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_GenerateAngle, CallFunc_BreakRotator_Pitch) == 0x000034, "Member 'BP_Girl004_Prop02_2_New_C_GenerateAngle::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_GenerateAngle, CallFunc_BreakRotator_Yaw) == 0x000038, "Member 'BP_Girl004_Prop02_2_New_C_GenerateAngle::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_GenerateAngle, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00003C, "Member 'BP_Girl004_Prop02_2_New_C_GenerateAngle::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_GenerateAngle, CallFunc_BreakRotator_Roll_1) == 0x000048, "Member 'BP_Girl004_Prop02_2_New_C_GenerateAngle::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_GenerateAngle, CallFunc_BreakRotator_Pitch_1) == 0x00004C, "Member 'BP_Girl004_Prop02_2_New_C_GenerateAngle::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_GenerateAngle, CallFunc_BreakRotator_Yaw_1) == 0x000050, "Member 'BP_Girl004_Prop02_2_New_C_GenerateAngle::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_GenerateAngle, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000054, "Member 'BP_Girl004_Prop02_2_New_C_GenerateAngle::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_GenerateAngle, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000058, "Member 'BP_Girl004_Prop02_2_New_C_GenerateAngle::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_GenerateAngle, CallFunc_SelectFloat_ReturnValue_1) == 0x00005C, "Member 'BP_Girl004_Prop02_2_New_C_GenerateAngle::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");

// Function BP_girl004_Prop02_2_New.BP_Girl004_Prop02_2_New_C.RotateAroundCaptain
// 0x0160 (0x0160 - 0x0000)
struct BP_Girl004_Prop02_2_New_C_RotateAroundCaptain final
{
public:
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetSceneTarget_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RInterpTo_Constant_ReturnValue;           // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_Constant_ReturnValue;           // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeRange_MinTime;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeRange_MaxTime;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_2;       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Girl004_C*                          K2Node_DynamicCast_AsBP_Girl_004;                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x00D0(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain) == 0x000008, "Wrong alignment on BP_Girl004_Prop02_2_New_C_RotateAroundCaptain");
static_assert(sizeof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain) == 0x000160, "Wrong size on BP_Girl004_Prop02_2_New_C_RotateAroundCaptain");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_SelectFloat_ReturnValue) == 0x000000, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_MakeVector_ReturnValue) == 0x000004, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000010, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_BreakRotator_Roll) == 0x000014, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_BreakRotator_Pitch) == 0x000018, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_BreakRotator_Yaw) == 0x00001C, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000020, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_GetSceneTarget_ReturnValue) == 0x000030, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_GetSceneTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x000038, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000044, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_RInterpTo_Constant_ReturnValue) == 0x000048, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_RInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000054, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_GetFloatValue_ReturnValue) == 0x000058, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_FInterpTo_Constant_ReturnValue) == 0x00005C, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_GetTimeRange_MinTime) == 0x000060, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_GetTimeRange_MinTime' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_GetTimeRange_MaxTime) == 0x000064, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_GetTimeRange_MaxTime' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000068, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_GetWorldDeltaSeconds_ReturnValue_2) == 0x00006C, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_GetWorldDeltaSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_Add_FloatFloat_ReturnValue) == 0x000070, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_GetFloatValue_ReturnValue_1) == 0x000074, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000078, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_RotateAngleAxis_ReturnValue) == 0x00007C, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000088, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000094, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, K2Node_DynamicCast_AsBP_Girl_004) == 0x0000A0, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::K2Node_DynamicCast_AsBP_Girl_004' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_Add_VectorVector_ReturnValue) == 0x0000AC, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_BreakVector_X) == 0x0000B8, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_BreakVector_Y) == 0x0000BC, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_BreakVector_Z) == 0x0000C0, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_MakeVector_ReturnValue_1) == 0x0000C4, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0000D0, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_RotateAroundCaptain, CallFunc_K2_SetActorLocation_ReturnValue) == 0x00015C, "Member 'BP_Girl004_Prop02_2_New_C_RotateAroundCaptain::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

// Function BP_girl004_Prop02_2_New.BP_Girl004_Prop02_2_New_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Girl004_Prop02_2_New_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl004_Prop02_2_New_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Girl004_Prop02_2_New_C_ReceiveTick");
static_assert(sizeof(BP_Girl004_Prop02_2_New_C_ReceiveTick) == 0x000004, "Wrong size on BP_Girl004_Prop02_2_New_C_ReceiveTick");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Girl004_Prop02_2_New_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_girl004_Prop02_2_New.BP_Girl004_Prop02_2_New_C.CustomEvent
// 0x0020 (0x0020 - 0x0000)
struct BP_Girl004_Prop02_2_New_C_CustomEvent final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OriginSkills;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UGameAbilityComponent*                  AbilityRef;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl004_Prop02_2_New_C_CustomEvent) == 0x000008, "Wrong alignment on BP_Girl004_Prop02_2_New_C_CustomEvent");
static_assert(sizeof(BP_Girl004_Prop02_2_New_C_CustomEvent) == 0x000020, "Wrong size on BP_Girl004_Prop02_2_New_C_CustomEvent");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_CustomEvent, SkillID) == 0x000000, "Member 'BP_Girl004_Prop02_2_New_C_CustomEvent::SkillID' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_CustomEvent, OriginSkills) == 0x000008, "Member 'BP_Girl004_Prop02_2_New_C_CustomEvent::OriginSkills' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_CustomEvent, AbilityRef) == 0x000018, "Member 'BP_Girl004_Prop02_2_New_C_CustomEvent::AbilityRef' has a wrong offset!");

// Function BP_girl004_Prop02_2_New.BP_Girl004_Prop02_2_New_C.Cast Skill
// 0x0020 (0x0020 - 0x0000)
struct BP_Girl004_Prop02_2_New_C_Cast_Skill final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OriginSkills;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UGameAbilityComponent*                  AbilityRef;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl004_Prop02_2_New_C_Cast_Skill) == 0x000008, "Wrong alignment on BP_Girl004_Prop02_2_New_C_Cast_Skill");
static_assert(sizeof(BP_Girl004_Prop02_2_New_C_Cast_Skill) == 0x000020, "Wrong size on BP_Girl004_Prop02_2_New_C_Cast_Skill");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_Cast_Skill, SkillID) == 0x000000, "Member 'BP_Girl004_Prop02_2_New_C_Cast_Skill::SkillID' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_Cast_Skill, OriginSkills) == 0x000008, "Member 'BP_Girl004_Prop02_2_New_C_Cast_Skill::OriginSkills' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_Cast_Skill, AbilityRef) == 0x000018, "Member 'BP_Girl004_Prop02_2_New_C_Cast_Skill::AbilityRef' has a wrong offset!");

// Function BP_girl004_Prop02_2_New.BP_Girl004_Prop02_2_New_C.Skill 1 Flash
// 0x0020 (0x0020 - 0x0000)
struct BP_Girl004_Prop02_2_New_C_Skill_1_Flash final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OriginSkills;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UGameAbilityComponent*                  AbilityRef;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl004_Prop02_2_New_C_Skill_1_Flash) == 0x000008, "Wrong alignment on BP_Girl004_Prop02_2_New_C_Skill_1_Flash");
static_assert(sizeof(BP_Girl004_Prop02_2_New_C_Skill_1_Flash) == 0x000020, "Wrong size on BP_Girl004_Prop02_2_New_C_Skill_1_Flash");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_Skill_1_Flash, SkillID) == 0x000000, "Member 'BP_Girl004_Prop02_2_New_C_Skill_1_Flash::SkillID' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_Skill_1_Flash, OriginSkills) == 0x000008, "Member 'BP_Girl004_Prop02_2_New_C_Skill_1_Flash::OriginSkills' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_Skill_1_Flash, AbilityRef) == 0x000018, "Member 'BP_Girl004_Prop02_2_New_C_Skill_1_Flash::AbilityRef' has a wrong offset!");

// Function BP_girl004_Prop02_2_New.BP_Girl004_Prop02_2_New_C.OnCharacterEnterBlindage
// 0x0001 (0x0001 - 0x0000)
struct BP_Girl004_Prop02_2_New_C_OnCharacterEnterBlindage final
{
public:
	bool                                          bEnter;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Girl004_Prop02_2_New_C_OnCharacterEnterBlindage) == 0x000001, "Wrong alignment on BP_Girl004_Prop02_2_New_C_OnCharacterEnterBlindage");
static_assert(sizeof(BP_Girl004_Prop02_2_New_C_OnCharacterEnterBlindage) == 0x000001, "Wrong size on BP_Girl004_Prop02_2_New_C_OnCharacterEnterBlindage");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_OnCharacterEnterBlindage, bEnter) == 0x000000, "Member 'BP_Girl004_Prop02_2_New_C_OnCharacterEnterBlindage::bEnter' has a wrong offset!");

// Function BP_girl004_Prop02_2_New.BP_Girl004_Prop02_2_New_C.ExecuteUbergraph_BP_Girl004_Prop02_2_New
// 0x01D0 (0x01D0 - 0x0000)
struct BP_Girl004_Prop02_2_New_C_ExecuteUbergraph_BP_Girl004_Prop02_2_New final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bEnter)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASimpleDroneAIController*               K2Node_DynamicCast_AsSimple_Drone_AIController;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_SkillID_2;                      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_CustomEvent_OriginSkills_2;                 // 0x0030(0x0010)(ConstParm, ReferenceParm)
	class UGameAbilityComponent*                  K2Node_CustomEvent_AbilityRef_2;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_CustomEvent_SkillID_1;                      // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_CustomEvent_OriginSkills_1;                 // 0x0060(0x0010)(ConstParm, ReferenceParm)
	class UGameAbilityComponent*                  K2Node_CustomEvent_AbilityRef_1;                   // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0088(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAIController*                      K2Node_DynamicCast_AsGame_AIController;            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetCaptain_ReturnValue;                   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue_2;              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetCaptain_ReturnValue_1;                 // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SkillID, TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class UAvailableSkill*>                CallFunc_AddSkill_ReturnValue;                     // 0x0168(0x0010)(ReferenceParm)
	int32                                         K2Node_CustomEvent_SkillID;                        // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_CustomEvent_OriginSkills;                   // 0x0180(0x0010)(ConstParm, ReferenceParm)
	class UGameAbilityComponent*                  K2Node_CustomEvent_AbilityRef;                     // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 SkillID, TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x019C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetSummonedOwner_ReturnValue;             // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnAttached_ReturnValue;                // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player;                  // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bEnter;                         // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Girl004_Prop02_2_New_C_ExecuteUbergraph_BP_Girl004_Prop02_2_New) == 0x000008, "Wrong alignment on BP_Girl004_Prop02_2_New_C_ExecuteUbergraph_BP_Girl004_Prop02_2_New");
static_assert(sizeof(BP_Girl004_Prop02_2_New_C_ExecuteUbergraph_BP_Girl004_Prop02_2_New) == 0x0001D0, "Wrong size on BP_Girl004_Prop02_2_New_C_ExecuteUbergraph_BP_Girl004_Prop02_2_New");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_ExecuteUbergraph_BP_Girl004_Prop02_2_New, EntryPoint) == 0x000000, "Member 'BP_Girl004_Prop02_2_New_C_ExecuteUbergraph_BP_Girl004_Prop02_2_New::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Girl004_Prop02_2_New_C_ExecuteUbergraph_BP_Girl004_Prop02_2_New, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_Girl004_Prop02_2_New_C_ExecuteUbergraph_BP_Girl004_Prop02_2_New::K2Node_Event_DeltaSeconds' has a wrong offset!");
