#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_girl006a_prop01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_girl006a_prop01.BP_girl006a_prop01_C
// 0x0108 (0x05B8 - 0x04B0)
class ABP_girl006a_prop01_C final : public ACharacterAccessory
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGameNiagaraComponent*                  e_girl006a_skill03_self13_p;                       // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Big_Knife;                                         // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         break_hide______0_5CC4392D401D7CD8EB5B1B9743EBF426; // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            break_hide__Direction_5CC4392D401D7CD8EB5B1B9743EBF426; // 0x04CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CD[0x3];                                      // 0x04CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     break_hide;                                        // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         normal_hide______0_0A98492A44F61657F2C36DBCDA4B1DF1; // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            normal_hide__Direction_0A98492A44F61657F2C36DBCDA4B1DF1; // 0x04DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DD[0x3];                                      // 0x04DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     normal_hide;                                       // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 Normal_Skill;                                      // 0x04E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 Burst_Skill;                                       // 0x04F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Dissolve_Edge_Color;                               // 0x0508(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   EffectTexture;                                     // 0x0520(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DissolveWidth;                                     // 0x0538(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DirectionDissolve;                                 // 0x0550(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DissolveVector;                                    // 0x0568(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCharacterRenderComponent*              Target_0;                                          // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         MC;                                                // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0590(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ID;                                                // 0x0594(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   DissolveLevel;                                     // 0x0598(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         AM_skill01c_Playtime;                              // 0x05B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Knife_Show(class UCharacterRenderComponent** Target, int32* ID_0, class UMeshComponent** MC_0);
	void normal_hide__FinishedFunc();
	void normal_hide__UpdateFunc();
	void break_hide__FinishedFunc();
	void break_hide__UpdateFunc();
	void OnNotifyEnd_195A2DA846EBF6515E121CB66A61A260(class FName NotifyName);
	void OnNotifyBegin_195A2DA846EBF6515E121CB66A61A260(class FName NotifyName);
	void OnInterrupted_195A2DA846EBF6515E121CB66A61A260(class FName NotifyName);
	void OnBlendOut_195A2DA846EBF6515E121CB66A61A260(class FName NotifyName);
	void OnCompleted_195A2DA846EBF6515E121CB66A61A260(class FName NotifyName);
	void SkillEnd_useless(int32 SkillID);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void SkillStart(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void SkillEnd(int32 SkillID);
	void ExecuteUbergraph_BP_girl006a_prop01(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_girl006a_prop01_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_girl006a_prop01_C")
	}
	static class ABP_girl006a_prop01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_girl006a_prop01_C>();
	}
};
DUMPER7_ASSERTS_ABP_girl006a_prop01_C;

}

