#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl002_Movement

#include "Basic.hpp"

#include "DefaultPlayerMoveComponent_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Girl002_Movement.BP_Girl002_Movement_C
// 0x0010 (0x1420 - 0x1410)
class UBP_Girl002_Movement_C final : public UDefaultPlayerMoveComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Girl002_Movement_C;              // 0x1408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          NewVar_0_0;                                        // 0x1410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          New_Var_0;                                         // 0x1411(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	bool ReceiveCustomSpeedCurve(struct FCustomSpeedCurve* CustomSpeedCurve);
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_BP_Girl002_Movement(int32 EntryPoint);

	struct FRotator ReceiveCustomRotation(const struct FRotator& CurrentRotation, const struct FRotator& TargetRotation, float DeltaTime) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Girl002_Movement_C">();
	}
	static class UBP_Girl002_Movement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Girl002_Movement_C>();
	}
};
static_assert(alignof(UBP_Girl002_Movement_C) == 0x000010, "Wrong alignment on UBP_Girl002_Movement_C");
static_assert(sizeof(UBP_Girl002_Movement_C) == 0x001420, "Wrong size on UBP_Girl002_Movement_C");
static_assert(offsetof(UBP_Girl002_Movement_C, UberGraphFrame_BP_Girl002_Movement_C) == 0x001408, "Member 'UBP_Girl002_Movement_C::UberGraphFrame_BP_Girl002_Movement_C' has a wrong offset!");
static_assert(offsetof(UBP_Girl002_Movement_C, NewVar_0_0) == 0x001410, "Member 'UBP_Girl002_Movement_C::NewVar_0_0' has a wrong offset!");
static_assert(offsetof(UBP_Girl002_Movement_C, New_Var_0) == 0x001411, "Member 'UBP_Girl002_Movement_C::New_Var_0' has a wrong offset!");

}

