#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl_Preview_Base

#include "Basic.hpp"

#include "BP_PreviewModel_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Girl_Preview_Base.BP_Girl_Preview_Base_C
// 0x0020 (0x0798 - 0x0778)
class ABP_Girl_Preview_Base_C final : public ABP_PreviewModel_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Girl_Preview_Base_C;             // 0x0778(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPreviewPhysicsControlComponent*        PreviewPhysicsControl;                             // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Ring;                                              // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Body;                                              // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BuildLight();
	void ReceiveBeginPlay();
	void ShowOrHideRing(bool InShow);
	void WeaponHiddenEvent(bool bWeaponHidden);
	void ExecuteUbergraph_BP_Girl_Preview_Base(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Girl_Preview_Base_C">();
	}
	static class ABP_Girl_Preview_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Girl_Preview_Base_C>();
	}
};
static_assert(alignof(ABP_Girl_Preview_Base_C) == 0x000008, "Wrong alignment on ABP_Girl_Preview_Base_C");
static_assert(sizeof(ABP_Girl_Preview_Base_C) == 0x000798, "Wrong size on ABP_Girl_Preview_Base_C");
static_assert(offsetof(ABP_Girl_Preview_Base_C, UberGraphFrame_BP_Girl_Preview_Base_C) == 0x000778, "Member 'ABP_Girl_Preview_Base_C::UberGraphFrame_BP_Girl_Preview_Base_C' has a wrong offset!");
static_assert(offsetof(ABP_Girl_Preview_Base_C, PreviewPhysicsControl) == 0x000780, "Member 'ABP_Girl_Preview_Base_C::PreviewPhysicsControl' has a wrong offset!");
static_assert(offsetof(ABP_Girl_Preview_Base_C, Ring) == 0x000788, "Member 'ABP_Girl_Preview_Base_C::Ring' has a wrong offset!");
static_assert(offsetof(ABP_Girl_Preview_Base_C, Body) == 0x000790, "Member 'ABP_Girl_Preview_Base_C::Body' has a wrong offset!");

}

