#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl002a

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Girl002a.BP_Girl002a_C.OnSwitchLeave
// 0x0030 (0x0030 - 0x0000)
struct BP_Girl002a_C_OnSwitchLeave final
{
public:
	struct FTransform                             Trans;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_Girl002a_C_OnSwitchLeave;

// Function BP_Girl002a.BP_Girl002a_C.OnSwitchEnter
// 0x0030 (0x0030 - 0x0000)
struct BP_Girl002a_C_OnSwitchEnter final
{
public:
	struct FTransform                             Trans;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_Girl002a_C_OnSwitchEnter;

// Function BP_Girl002a.BP_Girl002a_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Girl002a_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Girl002a_C_ReceiveTick;

// Function BP_Girl002a.BP_Girl002a_C.ExecuteUbergraph_BP_Girl002a
// 0x0080 (0x0080 - 0x0000)
struct BP_Girl002a_C_ExecuteUbergraph_BP_Girl002a final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Event_Trans_1;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             K2Node_Event_Trans;                                // 0x0040(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Girl002a_C_ExecuteUbergraph_BP_Girl002a;

}

