#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_girl002a_prop06_L

#include "Basic.hpp"

#include "Game_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_girl002a_prop06_L.BP_girl002a_prop06_L_C
// 0x0048 (0x0550 - 0x0508)
class ABP_girl002a_prop06_L_C final : public ACharacterAccessory_Girl002a
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 girl002a_prop06_skm;                               // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ____0______0_518896F7477C2438B368C193DE52724E;     // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____0__Direction_518896F7477C2438B368C193DE52724E; // 0x051C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51D[0x3];                                      // 0x051D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_0;                                          // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Num_1;                                             // 0x0528(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52C[0x4];                                      // 0x052C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         skin_GDPL;                                         // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Num_Skin;                                          // 0x0538(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RGB;                                               // 0x053C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLeave;                                            // 0x054C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsReachRightPeak;                                  // 0x054D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsReachLeftPeak;                                   // 0x054E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void 时间轴_0__FinishedFunc();
	void 时间轴_0__UpdateFunc();
	void OnNotifyEnd_F9DEFACB4FFDC8427D9ED3BE512D4F03(class FName NotifyName);
	void OnNotifyBegin_F9DEFACB4FFDC8427D9ED3BE512D4F03(class FName NotifyName);
	void OnInterrupted_F9DEFACB4FFDC8427D9ED3BE512D4F03(class FName NotifyName);
	void OnBlendOut_F9DEFACB4FFDC8427D9ED3BE512D4F03(class FName NotifyName);
	void OnCompleted_F9DEFACB4FFDC8427D9ED3BE512D4F03(class FName NotifyName);
	void OnNotifyEnd_8876475F4AA86ABB786E45B4B851171B(class FName NotifyName);
	void OnNotifyBegin_8876475F4AA86ABB786E45B4B851171B(class FName NotifyName);
	void OnInterrupted_8876475F4AA86ABB786E45B4B851171B(class FName NotifyName);
	void OnBlendOut_8876475F4AA86ABB786E45B4B851171B(class FName NotifyName);
	void OnCompleted_8876475F4AA86ABB786E45B4B851171B(class FName NotifyName);
	void OnNotifyEnd_499D4BE64983FBD2573A09BFAA0E4E80(class FName NotifyName);
	void OnNotifyBegin_499D4BE64983FBD2573A09BFAA0E4E80(class FName NotifyName);
	void OnInterrupted_499D4BE64983FBD2573A09BFAA0E4E80(class FName NotifyName);
	void OnBlendOut_499D4BE64983FBD2573A09BFAA0E4E80(class FName NotifyName);
	void OnCompleted_499D4BE64983FBD2573A09BFAA0E4E80(class FName NotifyName);
	void OnNotifyEnd_F044D6474798343ED7239CB38DE2FAD0(class FName NotifyName);
	void OnNotifyBegin_F044D6474798343ED7239CB38DE2FAD0(class FName NotifyName);
	void OnInterrupted_F044D6474798343ED7239CB38DE2FAD0(class FName NotifyName);
	void OnBlendOut_F044D6474798343ED7239CB38DE2FAD0(class FName NotifyName);
	void OnCompleted_F044D6474798343ED7239CB38DE2FAD0(class FName NotifyName);
	void OnNotifyEnd_47E0E1EE46D54AABFB249D89E09ACDF3(class FName NotifyName);
	void OnNotifyBegin_47E0E1EE46D54AABFB249D89E09ACDF3(class FName NotifyName);
	void OnInterrupted_47E0E1EE46D54AABFB249D89E09ACDF3(class FName NotifyName);
	void OnBlendOut_47E0E1EE46D54AABFB249D89E09ACDF3(class FName NotifyName);
	void OnCompleted_47E0E1EE46D54AABFB249D89E09ACDF3(class FName NotifyName);
	void OnNotifyEnd_8574364140996A7109A6F192835E00C5(class FName NotifyName);
	void OnNotifyBegin_8574364140996A7109A6F192835E00C5(class FName NotifyName);
	void OnInterrupted_8574364140996A7109A6F192835E00C5(class FName NotifyName);
	void OnBlendOut_8574364140996A7109A6F192835E00C5(class FName NotifyName);
	void OnCompleted_8574364140996A7109A6F192835E00C5(class FName NotifyName);
	void OnAbilityCastSkill_事件_0(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void PlayMontage();
	void AccessoryLeave();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_BP_girl002a_prop06_L(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_girl002a_prop06_L_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_girl002a_prop06_L_C")
	}
	static class ABP_girl002a_prop06_L_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_girl002a_prop06_L_C>();
	}
};
DUMPER7_ASSERTS_ABP_girl002a_prop06_L_C;

}

