#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl023

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BaseCharacter_classes.hpp"
#include "Game_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Girl023.BP_Girl023_C
// 0x0070 (0x2410 - 0x23A0)
class ABP_Girl023_C final : public ABaseCharacter_C
{
public:
	uint8                                         Pad_2395[0x3];                                     // 0x2395(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Girl023_C;                       // 0x2398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	ETimelineDirection                            UpdateEdgeLightScale__Direction_D7A1A30E481B256C11E27DBC7CC5D8F9; // 0x23A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23A1[0x7];                                     // 0x23A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     UpdateEdgeLightScale;                              // 0x23A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AAngle;                                            // 0x23B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BAngle;                                            // 0x23B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AccumulatePercentage;                              // 0x23B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalRuntime;                                      // 0x23BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RenderID;                                          // 0x23C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkillChargePos;                                    // 0x23C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        大招遮屏特效;                                      // 0x23C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<int32>                                 MiyaIgnoreInterruptDodgeSkills;                    // 0x23E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         CachedVirtualBulletNum;                            // 0x23F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CacheVirtualBulletMaxNum;                          // 0x23F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CrossHairUIPath;                                   // 0x23F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayTag                           MainSupSkillOnlyBackUseTag;                        // 0x2408(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	bool CanPlayerWeaponFire();
	bool IsFireSkillEnterFireState(int32 InSkillId);
	float GetPlayerWeaponAutoFireRangeRatio(const class APlayerWeapon* InWeapon);
	bool GetEnterClearTriggerSkillCache();
	void GetInterruptSkillCancelSelector(int32 SkillID, bool* Result);
	bool CanForceReload(bool bIsAutoReload);
	void UpdateEdgeLightScale__FinishedFunc();
	void UpdateEdgeLightScale__UpdateFunc();
	void AccumlateSkill(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void ShootSkillCast(int32 EmitterID, class UAbilityComponentBase* OwnerAbility);
	void Effect_102330105();
	void ClearSkill01OrSkill03();
	void Applied_Modifier_Change_to_UI(int32 ModifierID, bool IsApply, int64 LauncherCharacterHashIndex, EModifierRemoveSourceType RemoveSourceType);
	void OnModifierRemoved(class UModifier* InModifier);
	void OnInteractTurretChange(class AGameCharacter* InTurret_0);
	void OnAbilitySkillCancle_Event_0(int32 SkillID, const TArray<int32>& OriginSkills, ESkillInterruptedType InType, class UGameAbilityComponent* AbilityRef, int32 InInterruptSkillID);
	void ReceiveBeginPlay__Overridden();
	void ReceiveTick__Overridden(float DeltaSeconds);
	void InitMiYaCrossHair();
	void OnEquipWeapon(class APlayerWeapon* CurWeapon);
	void NotifyRefreshPlayerSkinMesh(int32 SkinTemplateID, int32 SkinLevel);
	void ExecuteUbergraph_BP_Girl023(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Girl023_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Girl023_C")
	}
	static class ABP_Girl023_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Girl023_C>();
	}
};
DUMPER7_ASSERTS_ABP_Girl023_C;

}

