#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_girl004a_Prop02_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_girl004_Prop02_2_New_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_girl004a_Prop02_1.BP_girl004a_Prop02_1_C
// 0x0020 (0x1670 - 0x1650)
class ABP_girl004a_Prop02_1_C final : public ABP_Girl004_Prop02_2_New_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_girl004a_Prop02_1_C;             // 0x1650(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         SideDeceleration;                                  // 0x1658(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FirstSpeedSet;                                     // 0x165C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_165D[0x3];                                     // 0x165D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CharacterStateSimpleId_0;                          // 0x1660(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void OnAbilityCastSkill____0(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void OnSkillEnd____0(int32 SkillID);
	void ____(class AGameCharacter* Character, class AGameCharacter* Killer, const struct FHealthChangeValue& HealthChangeValue);
	void Client_OnSkillEnd();
	void OnCharacterEnterBlindage(bool bEnter);
	void ExecuteUbergraph_BP_girl004a_Prop02_1(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_girl004a_Prop02_1_C">();
	}
	static class ABP_girl004a_Prop02_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_girl004a_Prop02_1_C>();
	}
};
static_assert(alignof(ABP_girl004a_Prop02_1_C) == 0x000010, "Wrong alignment on ABP_girl004a_Prop02_1_C");
static_assert(sizeof(ABP_girl004a_Prop02_1_C) == 0x001670, "Wrong size on ABP_girl004a_Prop02_1_C");
static_assert(offsetof(ABP_girl004a_Prop02_1_C, UberGraphFrame_BP_girl004a_Prop02_1_C) == 0x001650, "Member 'ABP_girl004a_Prop02_1_C::UberGraphFrame_BP_girl004a_Prop02_1_C' has a wrong offset!");
static_assert(offsetof(ABP_girl004a_Prop02_1_C, SideDeceleration) == 0x001658, "Member 'ABP_girl004a_Prop02_1_C::SideDeceleration' has a wrong offset!");
static_assert(offsetof(ABP_girl004a_Prop02_1_C, FirstSpeedSet) == 0x00165C, "Member 'ABP_girl004a_Prop02_1_C::FirstSpeedSet' has a wrong offset!");
static_assert(offsetof(ABP_girl004a_Prop02_1_C, CharacterStateSimpleId_0) == 0x001660, "Member 'ABP_girl004a_Prop02_1_C::CharacterStateSimpleId_0' has a wrong offset!");

}

