#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl015

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Engine_structs.hpp"
#include "BaseCharacter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Girl015.BP_Girl015_C
// 0x0790 (0x2BE0 - 0x2450)
class ABP_Girl015_C final : public ABaseCharacter_C
{
public:
	uint8                                         Pad_2445[0x3];                                     // 0x2445(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Girl015_C;                       // 0x2448(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FCameraInfo                            SpecialShootAimCameraInfo;                         // 0x2450(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FCameraInfo                            SpecialShootNormalCameraInfo;                      // 0x2540(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FCameraInfo                            SpecialShootFireCameraInfo;                        // 0x2630(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FCameraInfo                            SpecialShootNormalCameraInfo_start_F;              // 0x2720(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FCameraInfo                            SpecialShootNormalCameraInfo_start_B;              // 0x2810(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FCameraInfo                            SpecialShootNormalCameraInfo_start_L;              // 0x2900(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FCameraInfo                            SpecialShootNormalCameraInfo_start_R;              // 0x29F0(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         FrontSkillID;                                      // 0x2AE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          End;                                               // 0x2AE4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AE5[0x3];                                     // 0x2AE5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraInfo                            SpecialShootNormalCameraInfo_start_Motionless;     // 0x2AE8(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	TArray<struct FSoftObjectPath> OnGetAssetPath(TArray<int32>& CharacterIDs, TArray<int32>& SkillIDs, TArray<int32>& ModifierIDs, TArray<int32>& EmitterIDs);
	void SkillEnd(int32 SkillID);
	void EnableSpecialShoot(bool bEnable);
	void Multicast_EnableSpecialShoot(bool bEnable);
	void SkillStart(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void OnCharacterFire(const struct FFireInfo& FireInfo, bool bStartFire);
	void ExecuteUbergraph_BP_Girl015(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Girl015_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Girl015_C")
	}
	static class ABP_Girl015_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Girl015_C>();
	}
};
DUMPER7_ASSERTS_ABP_Girl015_C;

}

