#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl015_prop02

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Girl015_prop02.BP_Girl015_prop02_C
// 0x0060 (0x0518 - 0x04B8)
class ABP_Girl015_prop02_C final : public ACharacterAccessory
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        MeshPath;                                          // 0x04C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         CastSkillID;                                       // 0x04E0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	int32                                         CurCastSkilID;                                     // 0x04E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBegunPlay;                                        // 0x04E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Montage02;                                         // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage04;                                         // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage07;                                         // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WineID;                                            // 0x0508(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHiden;                                            // 0x050C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bAin;                                              // 0x050D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50E[0x2];                                      // 0x050E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Montage08;                                         // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ShowWine();
	void SkinReplace();
	TArray<struct FSoftObjectPath> OnGetAssetPath(TArray<int32>& CharacterIDs, TArray<int32>& SkillIDs);
	void OnNotifyBegin_BE4F4DDB4D2AB15C559C298FEAD543C2(class FName NotifyName);
	void OnBlendOut_BE4F4DDB4D2AB15C559C298FEAD543C2(class FName NotifyName);
	void OnNotifyEnd_DC6BDBB24C69D3BCC69F89A691593D90(class FName NotifyName);
	void OnInterrupted_DC6BDBB24C69D3BCC69F89A691593D90(class FName NotifyName);
	void OnCompleted_DC6BDBB24C69D3BCC69F89A691593D90(class FName NotifyName);
	void OnNotifyEnd_15E405234E55C2A1E52DE99BCED7CB26(class FName NotifyName);
	void OnInterrupted_15E405234E55C2A1E52DE99BCED7CB26(class FName NotifyName);
	void OnBlendOut_15E405234E55C2A1E52DE99BCED7CB26(class FName NotifyName);
	void OnCompleted_15E405234E55C2A1E52DE99BCED7CB26(class FName NotifyName);
	void OnNotifyEnd_A8FCA3FA46BD1EE9882796BC23CC3686(class FName NotifyName);
	void OnNotifyBegin_A8FCA3FA46BD1EE9882796BC23CC3686(class FName NotifyName);
	void OnInterrupted_A8FCA3FA46BD1EE9882796BC23CC3686(class FName NotifyName);
	void OnBlendOut_A8FCA3FA46BD1EE9882796BC23CC3686(class FName NotifyName);
	void OnCompleted_A8FCA3FA46BD1EE9882796BC23CC3686(class FName NotifyName);
	void ReceiveBeginPlay();
	void SkillEnd(int32 SkillID);
	void OnAbilityCastSkill_事件_0(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void PlaySkillMontage();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ExecuteUbergraph_BP_Girl015_prop02(int32 EntryPoint);
	void HideWine();
	void OnRep_CastSkillID();
	void OnNotifyEnd_BE4F4DDB4D2AB15C559C298FEAD543C2(class FName NotifyName);
	void OnInterrupted_BE4F4DDB4D2AB15C559C298FEAD543C2(class FName NotifyName);
	void OnCompleted_BE4F4DDB4D2AB15C559C298FEAD543C2(class FName NotifyName);
	void OnNotifyBegin_DC6BDBB24C69D3BCC69F89A691593D90(class FName NotifyName);
	void OnBlendOut_DC6BDBB24C69D3BCC69F89A691593D90(class FName NotifyName);
	void OnNotifyBegin_15E405234E55C2A1E52DE99BCED7CB26(class FName NotifyName);
	void Aim(bool bInAiming);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Girl015_prop02_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Girl015_prop02_C")
	}
	static class ABP_Girl015_prop02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Girl015_prop02_C>();
	}
};
DUMPER7_ASSERTS_ABP_Girl015_prop02_C;

}

