#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_girl004a_Prop02_1

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_girl004a_Prop02_1.BP_girl004a_Prop02_1_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_girl004a_Prop02_1_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_girl004a_Prop02_1_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_girl004a_Prop02_1_C_ReceiveTick");
static_assert(sizeof(BP_girl004a_Prop02_1_C_ReceiveTick) == 0x000004, "Wrong size on BP_girl004a_Prop02_1_C_ReceiveTick");
static_assert(offsetof(BP_girl004a_Prop02_1_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_girl004a_Prop02_1_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_girl004a_Prop02_1.BP_girl004a_Prop02_1_C.OnAbilityCastSkill_‹ö_0
// 0x0020 (0x0020 - 0x0000)
struct BP_girl004a_Prop02_1_C_OnAbilityCastSkill____0 final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OriginSkills;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UGameAbilityComponent*                  AbilityRef;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_girl004a_Prop02_1_C_OnAbilityCastSkill____0) == 0x000008, "Wrong alignment on BP_girl004a_Prop02_1_C_OnAbilityCastSkill____0");
static_assert(sizeof(BP_girl004a_Prop02_1_C_OnAbilityCastSkill____0) == 0x000020, "Wrong size on BP_girl004a_Prop02_1_C_OnAbilityCastSkill____0");
static_assert(offsetof(BP_girl004a_Prop02_1_C_OnAbilityCastSkill____0, SkillID) == 0x000000, "Member 'BP_girl004a_Prop02_1_C_OnAbilityCastSkill____0::SkillID' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_OnAbilityCastSkill____0, OriginSkills) == 0x000008, "Member 'BP_girl004a_Prop02_1_C_OnAbilityCastSkill____0::OriginSkills' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_OnAbilityCastSkill____0, AbilityRef) == 0x000018, "Member 'BP_girl004a_Prop02_1_C_OnAbilityCastSkill____0::AbilityRef' has a wrong offset!");

// Function BP_girl004a_Prop02_1.BP_girl004a_Prop02_1_C.OnSkillEnd_‹ö_0
// 0x0004 (0x0004 - 0x0000)
struct BP_girl004a_Prop02_1_C_OnSkillEnd____0 final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_girl004a_Prop02_1_C_OnSkillEnd____0) == 0x000004, "Wrong alignment on BP_girl004a_Prop02_1_C_OnSkillEnd____0");
static_assert(sizeof(BP_girl004a_Prop02_1_C_OnSkillEnd____0) == 0x000004, "Wrong size on BP_girl004a_Prop02_1_C_OnSkillEnd____0");
static_assert(offsetof(BP_girl004a_Prop02_1_C_OnSkillEnd____0, SkillID) == 0x000000, "Member 'BP_girl004a_Prop02_1_C_OnSkillEnd____0::SkillID' has a wrong offset!");

// Function BP_girl004a_Prop02_1.BP_girl004a_Prop02_1_C.;º{¡
// 0x01C0 (0x01C0 - 0x0000)
struct BP_girl004a_Prop02_1_C_____ final
{
public:
	class AGameCharacter*                         Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         Killer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     HealthChangeValue;                                 // 0x0010(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_girl004a_Prop02_1_C_____) == 0x000008, "Wrong alignment on BP_girl004a_Prop02_1_C_____");
static_assert(sizeof(BP_girl004a_Prop02_1_C_____) == 0x0001C0, "Wrong size on BP_girl004a_Prop02_1_C_____");
static_assert(offsetof(BP_girl004a_Prop02_1_C_____, Character) == 0x000000, "Member 'BP_girl004a_Prop02_1_C_____::Character' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_____, Killer) == 0x000008, "Member 'BP_girl004a_Prop02_1_C_____::Killer' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_____, HealthChangeValue) == 0x000010, "Member 'BP_girl004a_Prop02_1_C_____::HealthChangeValue' has a wrong offset!");

// Function BP_girl004a_Prop02_1.BP_girl004a_Prop02_1_C.OnCharacterEnterBlindage
// 0x0001 (0x0001 - 0x0000)
struct BP_girl004a_Prop02_1_C_OnCharacterEnterBlindage final
{
public:
	bool                                          bEnter;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_girl004a_Prop02_1_C_OnCharacterEnterBlindage) == 0x000001, "Wrong alignment on BP_girl004a_Prop02_1_C_OnCharacterEnterBlindage");
static_assert(sizeof(BP_girl004a_Prop02_1_C_OnCharacterEnterBlindage) == 0x000001, "Wrong size on BP_girl004a_Prop02_1_C_OnCharacterEnterBlindage");
static_assert(offsetof(BP_girl004a_Prop02_1_C_OnCharacterEnterBlindage, bEnter) == 0x000000, "Member 'BP_girl004a_Prop02_1_C_OnCharacterEnterBlindage::bEnter' has a wrong offset!");

// Function BP_girl004a_Prop02_1.BP_girl004a_Prop02_1_C.ExecuteUbergraph_BP_girl004a_Prop02_1
// 0x0278 (0x0278 - 0x0000)
struct BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SkillID, TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 SkillID)>                K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AGameCharacter* Character, class AGameCharacter* Killer, struct FHealthChangeValue& HealthChangeValue)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bEnter)>                  K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SkillID_1;                      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_CustomEvent_OriginSkills;                   // 0x0050(0x0010)(ConstParm, ReferenceParm)
	class UGameAbilityComponent*                  K2Node_CustomEvent_AbilityRef;                     // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_SkillID;                        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnGameNiagaraAttached_ReturnValue;     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_CustomEvent_Character;                      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_CustomEvent_Killer;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_CustomEvent_HealthChangeValue;              // 0x0098(0x01B0)(ConstParm, ContainsInstancedReference)
	class AGameCharacter*                         CallFunc_GetSummonedOwner_ReturnValue;             // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEnter;                         // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player;                  // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Girl004a_C*                         K2Node_DynamicCast_AsBP_Girl_004a;                 // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1) == 0x000008, "Wrong alignment on BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1");
static_assert(sizeof(BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1) == 0x000278, "Wrong size on BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1");
static_assert(offsetof(BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1, EntryPoint) == 0x000000, "Member 'BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1, K2Node_Event_DeltaSeconds) == 0x000044, "Member 'BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1, K2Node_CustomEvent_SkillID_1) == 0x000048, "Member 'BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1::K2Node_CustomEvent_SkillID_1' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1, K2Node_CustomEvent_OriginSkills) == 0x000050, "Member 'BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1::K2Node_CustomEvent_OriginSkills' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1, K2Node_CustomEvent_AbilityRef) == 0x000060, "Member 'BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1::K2Node_CustomEvent_AbilityRef' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000068, "Member 'BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1, K2Node_CustomEvent_SkillID) == 0x00006C, "Member 'BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1::K2Node_CustomEvent_SkillID' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000070, "Member 'BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1, CallFunc_GetOwner_ReturnValue) == 0x000078, "Member 'BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1, CallFunc_SpawnGameNiagaraAttached_ReturnValue) == 0x000080, "Member 'BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1::CallFunc_SpawnGameNiagaraAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1, K2Node_CustomEvent_Character) == 0x000088, "Member 'BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1, K2Node_CustomEvent_Killer) == 0x000090, "Member 'BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1::K2Node_CustomEvent_Killer' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1, K2Node_CustomEvent_HealthChangeValue) == 0x000098, "Member 'BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1::K2Node_CustomEvent_HealthChangeValue' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1, CallFunc_GetSummonedOwner_ReturnValue) == 0x000248, "Member 'BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1::CallFunc_GetSummonedOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1, K2Node_CustomEvent_bEnter) == 0x000250, "Member 'BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1::K2Node_CustomEvent_bEnter' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1, K2Node_DynamicCast_AsGame_Player) == 0x000258, "Member 'BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1::K2Node_DynamicCast_AsGame_Player' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1, K2Node_DynamicCast_bSuccess) == 0x000260, "Member 'BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1, K2Node_DynamicCast_AsBP_Girl_004a) == 0x000268, "Member 'BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1::K2Node_DynamicCast_AsBP_Girl_004a' has a wrong offset!");
static_assert(offsetof(BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1, K2Node_DynamicCast_bSuccess_1) == 0x000270, "Member 'BP_girl004a_Prop02_1_C_ExecuteUbergraph_BP_girl004a_Prop02_1::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

