#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl015

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BaseCharacter_classes.hpp"
#include "Game_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Girl015.BP_Girl015_C
// 0x0790 (0x2A40 - 0x22B0)
class ABP_Girl015_C final : public ABaseCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Girl015_C;                       // 0x22A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FCameraInfo                            SpecialShootAimCameraInfo;                         // 0x22B0(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FCameraInfo                            SpecialShootNormalCameraInfo;                      // 0x23A0(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FCameraInfo                            SpecialShootFireCameraInfo;                        // 0x2490(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FCameraInfo                            SpecialShootNormalCameraInfo_start_F;              // 0x2580(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FCameraInfo                            SpecialShootNormalCameraInfo_start_B;              // 0x2670(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FCameraInfo                            SpecialShootNormalCameraInfo_start_L;              // 0x2760(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FCameraInfo                            SpecialShootNormalCameraInfo_start_R;              // 0x2850(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         FrontSkillID;                                      // 0x2940(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          End;                                               // 0x2944(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2945[0x3];                                     // 0x2945(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraInfo                            SpecialShootNormalCameraInfo_start_Motionless;     // 0x2948(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	TArray<struct FSoftObjectPath> OnGetAssetPath(TArray<int32>& CharacterIDs, TArray<int32>& SkillIDs, TArray<int32>& ModifierIDs, TArray<int32>& EmitterIDs);
	void SkillEnd(int32 SkillID);
	void EnableSpecialShoot(bool bEnable);
	void Multicast_EnableSpecialShoot(bool bEnable);
	void SkillStart(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void OnCharacterFire(const struct FFireInfo& FireInfo, bool bStartFire);
	void ExecuteUbergraph_BP_Girl015(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Girl015_C">();
	}
	static class ABP_Girl015_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Girl015_C>();
	}
};
static_assert(alignof(ABP_Girl015_C) == 0x000010, "Wrong alignment on ABP_Girl015_C");
static_assert(sizeof(ABP_Girl015_C) == 0x002A40, "Wrong size on ABP_Girl015_C");
static_assert(offsetof(ABP_Girl015_C, UberGraphFrame_BP_Girl015_C) == 0x0022A8, "Member 'ABP_Girl015_C::UberGraphFrame_BP_Girl015_C' has a wrong offset!");
static_assert(offsetof(ABP_Girl015_C, SpecialShootAimCameraInfo) == 0x0022B0, "Member 'ABP_Girl015_C::SpecialShootAimCameraInfo' has a wrong offset!");
static_assert(offsetof(ABP_Girl015_C, SpecialShootNormalCameraInfo) == 0x0023A0, "Member 'ABP_Girl015_C::SpecialShootNormalCameraInfo' has a wrong offset!");
static_assert(offsetof(ABP_Girl015_C, SpecialShootFireCameraInfo) == 0x002490, "Member 'ABP_Girl015_C::SpecialShootFireCameraInfo' has a wrong offset!");
static_assert(offsetof(ABP_Girl015_C, SpecialShootNormalCameraInfo_start_F) == 0x002580, "Member 'ABP_Girl015_C::SpecialShootNormalCameraInfo_start_F' has a wrong offset!");
static_assert(offsetof(ABP_Girl015_C, SpecialShootNormalCameraInfo_start_B) == 0x002670, "Member 'ABP_Girl015_C::SpecialShootNormalCameraInfo_start_B' has a wrong offset!");
static_assert(offsetof(ABP_Girl015_C, SpecialShootNormalCameraInfo_start_L) == 0x002760, "Member 'ABP_Girl015_C::SpecialShootNormalCameraInfo_start_L' has a wrong offset!");
static_assert(offsetof(ABP_Girl015_C, SpecialShootNormalCameraInfo_start_R) == 0x002850, "Member 'ABP_Girl015_C::SpecialShootNormalCameraInfo_start_R' has a wrong offset!");
static_assert(offsetof(ABP_Girl015_C, FrontSkillID) == 0x002940, "Member 'ABP_Girl015_C::FrontSkillID' has a wrong offset!");
static_assert(offsetof(ABP_Girl015_C, End) == 0x002944, "Member 'ABP_Girl015_C::End' has a wrong offset!");
static_assert(offsetof(ABP_Girl015_C, SpecialShootNormalCameraInfo_start_Motionless) == 0x002948, "Member 'ABP_Girl015_C::SpecialShootNormalCameraInfo_start_Motionless' has a wrong offset!");

}

