#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_girl004_Prop02_2_New

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_girl004_Prop02_2_New.BP_Girl004_Prop02_2_New_C
// 0x0050 (0x1650 - 0x1600)
class ABP_Girl004_Prop02_2_New_C : public AGamePetCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1600(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AGameCharacter*                         Captain;                                           // 0x1608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartDirection2D;                                  // 0x1610(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartZ;                                            // 0x161C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Distance;                                          // 0x1620(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurveTime;                                         // 0x1624(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            Curve_RotateAngle;                                 // 0x1628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            Curve_RotateDistance;                              // 0x1630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameAIController*                      AIController;                                      // 0x1638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxAngle;                                          // 0x1640(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsClockWise;                                       // 0x1644(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsRotatingAround;                                  // 0x1645(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsFirst;                                           // 0x1646(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1647[0x1];                                     // 0x1647(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CharacterStateSimpleId;                            // 0x1648(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Dither(bool Condition);
	float GenerateAngle();
	void RotateAroundCaptain();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void CustomEvent(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void Cast_Skill(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void Spwaned();
	void Skill_1_Flash(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void OnCharacterEnterBlindage(bool bEnter);
	void ExecuteUbergraph_BP_Girl004_Prop02_2_New(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Girl004_Prop02_2_New_C">();
	}
	static class ABP_Girl004_Prop02_2_New_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Girl004_Prop02_2_New_C>();
	}
};
static_assert(alignof(ABP_Girl004_Prop02_2_New_C) == 0x000010, "Wrong alignment on ABP_Girl004_Prop02_2_New_C");
static_assert(sizeof(ABP_Girl004_Prop02_2_New_C) == 0x001650, "Wrong size on ABP_Girl004_Prop02_2_New_C");
static_assert(offsetof(ABP_Girl004_Prop02_2_New_C, UberGraphFrame) == 0x001600, "Member 'ABP_Girl004_Prop02_2_New_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_Prop02_2_New_C, Captain) == 0x001608, "Member 'ABP_Girl004_Prop02_2_New_C::Captain' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_Prop02_2_New_C, StartDirection2D) == 0x001610, "Member 'ABP_Girl004_Prop02_2_New_C::StartDirection2D' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_Prop02_2_New_C, StartZ) == 0x00161C, "Member 'ABP_Girl004_Prop02_2_New_C::StartZ' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_Prop02_2_New_C, Distance) == 0x001620, "Member 'ABP_Girl004_Prop02_2_New_C::Distance' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_Prop02_2_New_C, CurveTime) == 0x001624, "Member 'ABP_Girl004_Prop02_2_New_C::CurveTime' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_Prop02_2_New_C, Curve_RotateAngle) == 0x001628, "Member 'ABP_Girl004_Prop02_2_New_C::Curve_RotateAngle' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_Prop02_2_New_C, Curve_RotateDistance) == 0x001630, "Member 'ABP_Girl004_Prop02_2_New_C::Curve_RotateDistance' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_Prop02_2_New_C, AIController) == 0x001638, "Member 'ABP_Girl004_Prop02_2_New_C::AIController' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_Prop02_2_New_C, MaxAngle) == 0x001640, "Member 'ABP_Girl004_Prop02_2_New_C::MaxAngle' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_Prop02_2_New_C, IsClockWise) == 0x001644, "Member 'ABP_Girl004_Prop02_2_New_C::IsClockWise' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_Prop02_2_New_C, IsRotatingAround) == 0x001645, "Member 'ABP_Girl004_Prop02_2_New_C::IsRotatingAround' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_Prop02_2_New_C, IsFirst) == 0x001646, "Member 'ABP_Girl004_Prop02_2_New_C::IsFirst' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_Prop02_2_New_C, CharacterStateSimpleId) == 0x001648, "Member 'ABP_Girl004_Prop02_2_New_C::CharacterStateSimpleId' has a wrong offset!");

}

