#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl015_prop02

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.ShowWine
// 0x0008 (0x0008 - 0x0000)
struct BP_Girl015_prop02_C_ShowWine final
{
public:
	class AGameCharacter*                         CallFunc_GetGameCharacter_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_ShowWine) == 0x000008, "Wrong alignment on BP_Girl015_prop02_C_ShowWine");
static_assert(sizeof(BP_Girl015_prop02_C_ShowWine) == 0x000008, "Wrong size on BP_Girl015_prop02_C_ShowWine");
static_assert(offsetof(BP_Girl015_prop02_C_ShowWine, CallFunc_GetGameCharacter_ReturnValue) == 0x000000, "Member 'BP_Girl015_prop02_C_ShowWine::CallFunc_GetGameCharacter_ReturnValue' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.HideWine
// 0x00C8 (0x00C8 - 0x0000)
struct BP_Girl015_prop02_C_HideWine final
{
public:
	int32                                         CallFunc_MakeRenderStatePriority_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetGameCharacter_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	struct FCharacterStateStartParam              K2Node_MakeStruct_CharacterStateStartParam;        // 0x0020(0x00A0)(ContainsInstancedReference)
	int32                                         CallFunc_StartCharacterStateParam_ReturnValue;     // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_HideWine) == 0x000008, "Wrong alignment on BP_Girl015_prop02_C_HideWine");
static_assert(sizeof(BP_Girl015_prop02_C_HideWine) == 0x0000C8, "Wrong size on BP_Girl015_prop02_C_HideWine");
static_assert(offsetof(BP_Girl015_prop02_C_HideWine, CallFunc_MakeRenderStatePriority_ReturnValue) == 0x000000, "Member 'BP_Girl015_prop02_C_HideWine::CallFunc_MakeRenderStatePriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl015_prop02_C_HideWine, CallFunc_GetGameCharacter_ReturnValue) == 0x000008, "Member 'BP_Girl015_prop02_C_HideWine::CallFunc_GetGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl015_prop02_C_HideWine, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_Girl015_prop02_C_HideWine::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Girl015_prop02_C_HideWine, K2Node_MakeStruct_CharacterStateStartParam) == 0x000020, "Member 'BP_Girl015_prop02_C_HideWine::K2Node_MakeStruct_CharacterStateStartParam' has a wrong offset!");
static_assert(offsetof(BP_Girl015_prop02_C_HideWine, CallFunc_StartCharacterStateParam_ReturnValue) == 0x0000C0, "Member 'BP_Girl015_prop02_C_HideWine::CallFunc_StartCharacterStateParam_ReturnValue' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.SkinReplace
// 0x0018 (0x0018 - 0x0000)
struct BP_Girl015_prop02_C_SkinReplace final
{
public:
	class UObject*                                CallFunc_GetReplaceEffectBySoftPath_ReturnValue;   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_As_____;                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Girl015_prop02_C_SkinReplace) == 0x000008, "Wrong alignment on BP_Girl015_prop02_C_SkinReplace");
static_assert(sizeof(BP_Girl015_prop02_C_SkinReplace) == 0x000018, "Wrong size on BP_Girl015_prop02_C_SkinReplace");
static_assert(offsetof(BP_Girl015_prop02_C_SkinReplace, CallFunc_GetReplaceEffectBySoftPath_ReturnValue) == 0x000000, "Member 'BP_Girl015_prop02_C_SkinReplace::CallFunc_GetReplaceEffectBySoftPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl015_prop02_C_SkinReplace, K2Node_DynamicCast_As_____) == 0x000008, "Member 'BP_Girl015_prop02_C_SkinReplace::K2Node_DynamicCast_As_____' has a wrong offset!");
static_assert(offsetof(BP_Girl015_prop02_C_SkinReplace, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_Girl015_prop02_C_SkinReplace::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.OnGetAssetPath
// 0x0048 (0x0048 - 0x0000)
struct BP_Girl015_prop02_C_OnGetAssetPath final
{
public:
	TArray<int32>                                 CharacterIDs;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 SkillIDs;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FSoftObjectPath>                ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm)
	TArray<struct FSoftObjectPath>                OutPaths;                                          // 0x0030(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_OnGetAssetPath) == 0x000008, "Wrong alignment on BP_Girl015_prop02_C_OnGetAssetPath");
static_assert(sizeof(BP_Girl015_prop02_C_OnGetAssetPath) == 0x000048, "Wrong size on BP_Girl015_prop02_C_OnGetAssetPath");
static_assert(offsetof(BP_Girl015_prop02_C_OnGetAssetPath, CharacterIDs) == 0x000000, "Member 'BP_Girl015_prop02_C_OnGetAssetPath::CharacterIDs' has a wrong offset!");
static_assert(offsetof(BP_Girl015_prop02_C_OnGetAssetPath, SkillIDs) == 0x000010, "Member 'BP_Girl015_prop02_C_OnGetAssetPath::SkillIDs' has a wrong offset!");
static_assert(offsetof(BP_Girl015_prop02_C_OnGetAssetPath, ReturnValue) == 0x000020, "Member 'BP_Girl015_prop02_C_OnGetAssetPath::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl015_prop02_C_OnGetAssetPath, OutPaths) == 0x000030, "Member 'BP_Girl015_prop02_C_OnGetAssetPath::OutPaths' has a wrong offset!");
static_assert(offsetof(BP_Girl015_prop02_C_OnGetAssetPath, CallFunc_Array_Add_ReturnValue) == 0x000040, "Member 'BP_Girl015_prop02_C_OnGetAssetPath::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.OnNotifyEnd_BE4F4DDB4D2AB15C559C298FEAD543C2
// 0x0008 (0x0008 - 0x0000)
struct BP_Girl015_prop02_C_OnNotifyEnd_BE4F4DDB4D2AB15C559C298FEAD543C2 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_OnNotifyEnd_BE4F4DDB4D2AB15C559C298FEAD543C2) == 0x000004, "Wrong alignment on BP_Girl015_prop02_C_OnNotifyEnd_BE4F4DDB4D2AB15C559C298FEAD543C2");
static_assert(sizeof(BP_Girl015_prop02_C_OnNotifyEnd_BE4F4DDB4D2AB15C559C298FEAD543C2) == 0x000008, "Wrong size on BP_Girl015_prop02_C_OnNotifyEnd_BE4F4DDB4D2AB15C559C298FEAD543C2");
static_assert(offsetof(BP_Girl015_prop02_C_OnNotifyEnd_BE4F4DDB4D2AB15C559C298FEAD543C2, NotifyName) == 0x000000, "Member 'BP_Girl015_prop02_C_OnNotifyEnd_BE4F4DDB4D2AB15C559C298FEAD543C2::NotifyName' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.OnNotifyBegin_BE4F4DDB4D2AB15C559C298FEAD543C2
// 0x0008 (0x0008 - 0x0000)
struct BP_Girl015_prop02_C_OnNotifyBegin_BE4F4DDB4D2AB15C559C298FEAD543C2 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_OnNotifyBegin_BE4F4DDB4D2AB15C559C298FEAD543C2) == 0x000004, "Wrong alignment on BP_Girl015_prop02_C_OnNotifyBegin_BE4F4DDB4D2AB15C559C298FEAD543C2");
static_assert(sizeof(BP_Girl015_prop02_C_OnNotifyBegin_BE4F4DDB4D2AB15C559C298FEAD543C2) == 0x000008, "Wrong size on BP_Girl015_prop02_C_OnNotifyBegin_BE4F4DDB4D2AB15C559C298FEAD543C2");
static_assert(offsetof(BP_Girl015_prop02_C_OnNotifyBegin_BE4F4DDB4D2AB15C559C298FEAD543C2, NotifyName) == 0x000000, "Member 'BP_Girl015_prop02_C_OnNotifyBegin_BE4F4DDB4D2AB15C559C298FEAD543C2::NotifyName' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.OnInterrupted_BE4F4DDB4D2AB15C559C298FEAD543C2
// 0x0008 (0x0008 - 0x0000)
struct BP_Girl015_prop02_C_OnInterrupted_BE4F4DDB4D2AB15C559C298FEAD543C2 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_OnInterrupted_BE4F4DDB4D2AB15C559C298FEAD543C2) == 0x000004, "Wrong alignment on BP_Girl015_prop02_C_OnInterrupted_BE4F4DDB4D2AB15C559C298FEAD543C2");
static_assert(sizeof(BP_Girl015_prop02_C_OnInterrupted_BE4F4DDB4D2AB15C559C298FEAD543C2) == 0x000008, "Wrong size on BP_Girl015_prop02_C_OnInterrupted_BE4F4DDB4D2AB15C559C298FEAD543C2");
static_assert(offsetof(BP_Girl015_prop02_C_OnInterrupted_BE4F4DDB4D2AB15C559C298FEAD543C2, NotifyName) == 0x000000, "Member 'BP_Girl015_prop02_C_OnInterrupted_BE4F4DDB4D2AB15C559C298FEAD543C2::NotifyName' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.OnBlendOut_BE4F4DDB4D2AB15C559C298FEAD543C2
// 0x0008 (0x0008 - 0x0000)
struct BP_Girl015_prop02_C_OnBlendOut_BE4F4DDB4D2AB15C559C298FEAD543C2 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_OnBlendOut_BE4F4DDB4D2AB15C559C298FEAD543C2) == 0x000004, "Wrong alignment on BP_Girl015_prop02_C_OnBlendOut_BE4F4DDB4D2AB15C559C298FEAD543C2");
static_assert(sizeof(BP_Girl015_prop02_C_OnBlendOut_BE4F4DDB4D2AB15C559C298FEAD543C2) == 0x000008, "Wrong size on BP_Girl015_prop02_C_OnBlendOut_BE4F4DDB4D2AB15C559C298FEAD543C2");
static_assert(offsetof(BP_Girl015_prop02_C_OnBlendOut_BE4F4DDB4D2AB15C559C298FEAD543C2, NotifyName) == 0x000000, "Member 'BP_Girl015_prop02_C_OnBlendOut_BE4F4DDB4D2AB15C559C298FEAD543C2::NotifyName' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.OnCompleted_BE4F4DDB4D2AB15C559C298FEAD543C2
// 0x0008 (0x0008 - 0x0000)
struct BP_Girl015_prop02_C_OnCompleted_BE4F4DDB4D2AB15C559C298FEAD543C2 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_OnCompleted_BE4F4DDB4D2AB15C559C298FEAD543C2) == 0x000004, "Wrong alignment on BP_Girl015_prop02_C_OnCompleted_BE4F4DDB4D2AB15C559C298FEAD543C2");
static_assert(sizeof(BP_Girl015_prop02_C_OnCompleted_BE4F4DDB4D2AB15C559C298FEAD543C2) == 0x000008, "Wrong size on BP_Girl015_prop02_C_OnCompleted_BE4F4DDB4D2AB15C559C298FEAD543C2");
static_assert(offsetof(BP_Girl015_prop02_C_OnCompleted_BE4F4DDB4D2AB15C559C298FEAD543C2, NotifyName) == 0x000000, "Member 'BP_Girl015_prop02_C_OnCompleted_BE4F4DDB4D2AB15C559C298FEAD543C2::NotifyName' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.OnNotifyEnd_DC6BDBB24C69D3BCC69F89A691593D90
// 0x0008 (0x0008 - 0x0000)
struct BP_Girl015_prop02_C_OnNotifyEnd_DC6BDBB24C69D3BCC69F89A691593D90 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_OnNotifyEnd_DC6BDBB24C69D3BCC69F89A691593D90) == 0x000004, "Wrong alignment on BP_Girl015_prop02_C_OnNotifyEnd_DC6BDBB24C69D3BCC69F89A691593D90");
static_assert(sizeof(BP_Girl015_prop02_C_OnNotifyEnd_DC6BDBB24C69D3BCC69F89A691593D90) == 0x000008, "Wrong size on BP_Girl015_prop02_C_OnNotifyEnd_DC6BDBB24C69D3BCC69F89A691593D90");
static_assert(offsetof(BP_Girl015_prop02_C_OnNotifyEnd_DC6BDBB24C69D3BCC69F89A691593D90, NotifyName) == 0x000000, "Member 'BP_Girl015_prop02_C_OnNotifyEnd_DC6BDBB24C69D3BCC69F89A691593D90::NotifyName' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.OnNotifyBegin_DC6BDBB24C69D3BCC69F89A691593D90
// 0x0008 (0x0008 - 0x0000)
struct BP_Girl015_prop02_C_OnNotifyBegin_DC6BDBB24C69D3BCC69F89A691593D90 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_OnNotifyBegin_DC6BDBB24C69D3BCC69F89A691593D90) == 0x000004, "Wrong alignment on BP_Girl015_prop02_C_OnNotifyBegin_DC6BDBB24C69D3BCC69F89A691593D90");
static_assert(sizeof(BP_Girl015_prop02_C_OnNotifyBegin_DC6BDBB24C69D3BCC69F89A691593D90) == 0x000008, "Wrong size on BP_Girl015_prop02_C_OnNotifyBegin_DC6BDBB24C69D3BCC69F89A691593D90");
static_assert(offsetof(BP_Girl015_prop02_C_OnNotifyBegin_DC6BDBB24C69D3BCC69F89A691593D90, NotifyName) == 0x000000, "Member 'BP_Girl015_prop02_C_OnNotifyBegin_DC6BDBB24C69D3BCC69F89A691593D90::NotifyName' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.OnInterrupted_DC6BDBB24C69D3BCC69F89A691593D90
// 0x0008 (0x0008 - 0x0000)
struct BP_Girl015_prop02_C_OnInterrupted_DC6BDBB24C69D3BCC69F89A691593D90 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_OnInterrupted_DC6BDBB24C69D3BCC69F89A691593D90) == 0x000004, "Wrong alignment on BP_Girl015_prop02_C_OnInterrupted_DC6BDBB24C69D3BCC69F89A691593D90");
static_assert(sizeof(BP_Girl015_prop02_C_OnInterrupted_DC6BDBB24C69D3BCC69F89A691593D90) == 0x000008, "Wrong size on BP_Girl015_prop02_C_OnInterrupted_DC6BDBB24C69D3BCC69F89A691593D90");
static_assert(offsetof(BP_Girl015_prop02_C_OnInterrupted_DC6BDBB24C69D3BCC69F89A691593D90, NotifyName) == 0x000000, "Member 'BP_Girl015_prop02_C_OnInterrupted_DC6BDBB24C69D3BCC69F89A691593D90::NotifyName' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.OnBlendOut_DC6BDBB24C69D3BCC69F89A691593D90
// 0x0008 (0x0008 - 0x0000)
struct BP_Girl015_prop02_C_OnBlendOut_DC6BDBB24C69D3BCC69F89A691593D90 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_OnBlendOut_DC6BDBB24C69D3BCC69F89A691593D90) == 0x000004, "Wrong alignment on BP_Girl015_prop02_C_OnBlendOut_DC6BDBB24C69D3BCC69F89A691593D90");
static_assert(sizeof(BP_Girl015_prop02_C_OnBlendOut_DC6BDBB24C69D3BCC69F89A691593D90) == 0x000008, "Wrong size on BP_Girl015_prop02_C_OnBlendOut_DC6BDBB24C69D3BCC69F89A691593D90");
static_assert(offsetof(BP_Girl015_prop02_C_OnBlendOut_DC6BDBB24C69D3BCC69F89A691593D90, NotifyName) == 0x000000, "Member 'BP_Girl015_prop02_C_OnBlendOut_DC6BDBB24C69D3BCC69F89A691593D90::NotifyName' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.OnCompleted_DC6BDBB24C69D3BCC69F89A691593D90
// 0x0008 (0x0008 - 0x0000)
struct BP_Girl015_prop02_C_OnCompleted_DC6BDBB24C69D3BCC69F89A691593D90 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_OnCompleted_DC6BDBB24C69D3BCC69F89A691593D90) == 0x000004, "Wrong alignment on BP_Girl015_prop02_C_OnCompleted_DC6BDBB24C69D3BCC69F89A691593D90");
static_assert(sizeof(BP_Girl015_prop02_C_OnCompleted_DC6BDBB24C69D3BCC69F89A691593D90) == 0x000008, "Wrong size on BP_Girl015_prop02_C_OnCompleted_DC6BDBB24C69D3BCC69F89A691593D90");
static_assert(offsetof(BP_Girl015_prop02_C_OnCompleted_DC6BDBB24C69D3BCC69F89A691593D90, NotifyName) == 0x000000, "Member 'BP_Girl015_prop02_C_OnCompleted_DC6BDBB24C69D3BCC69F89A691593D90::NotifyName' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.OnNotifyEnd_15E405234E55C2A1E52DE99BCED7CB26
// 0x0008 (0x0008 - 0x0000)
struct BP_Girl015_prop02_C_OnNotifyEnd_15E405234E55C2A1E52DE99BCED7CB26 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_OnNotifyEnd_15E405234E55C2A1E52DE99BCED7CB26) == 0x000004, "Wrong alignment on BP_Girl015_prop02_C_OnNotifyEnd_15E405234E55C2A1E52DE99BCED7CB26");
static_assert(sizeof(BP_Girl015_prop02_C_OnNotifyEnd_15E405234E55C2A1E52DE99BCED7CB26) == 0x000008, "Wrong size on BP_Girl015_prop02_C_OnNotifyEnd_15E405234E55C2A1E52DE99BCED7CB26");
static_assert(offsetof(BP_Girl015_prop02_C_OnNotifyEnd_15E405234E55C2A1E52DE99BCED7CB26, NotifyName) == 0x000000, "Member 'BP_Girl015_prop02_C_OnNotifyEnd_15E405234E55C2A1E52DE99BCED7CB26::NotifyName' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.OnNotifyBegin_15E405234E55C2A1E52DE99BCED7CB26
// 0x0008 (0x0008 - 0x0000)
struct BP_Girl015_prop02_C_OnNotifyBegin_15E405234E55C2A1E52DE99BCED7CB26 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_OnNotifyBegin_15E405234E55C2A1E52DE99BCED7CB26) == 0x000004, "Wrong alignment on BP_Girl015_prop02_C_OnNotifyBegin_15E405234E55C2A1E52DE99BCED7CB26");
static_assert(sizeof(BP_Girl015_prop02_C_OnNotifyBegin_15E405234E55C2A1E52DE99BCED7CB26) == 0x000008, "Wrong size on BP_Girl015_prop02_C_OnNotifyBegin_15E405234E55C2A1E52DE99BCED7CB26");
static_assert(offsetof(BP_Girl015_prop02_C_OnNotifyBegin_15E405234E55C2A1E52DE99BCED7CB26, NotifyName) == 0x000000, "Member 'BP_Girl015_prop02_C_OnNotifyBegin_15E405234E55C2A1E52DE99BCED7CB26::NotifyName' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.OnInterrupted_15E405234E55C2A1E52DE99BCED7CB26
// 0x0008 (0x0008 - 0x0000)
struct BP_Girl015_prop02_C_OnInterrupted_15E405234E55C2A1E52DE99BCED7CB26 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_OnInterrupted_15E405234E55C2A1E52DE99BCED7CB26) == 0x000004, "Wrong alignment on BP_Girl015_prop02_C_OnInterrupted_15E405234E55C2A1E52DE99BCED7CB26");
static_assert(sizeof(BP_Girl015_prop02_C_OnInterrupted_15E405234E55C2A1E52DE99BCED7CB26) == 0x000008, "Wrong size on BP_Girl015_prop02_C_OnInterrupted_15E405234E55C2A1E52DE99BCED7CB26");
static_assert(offsetof(BP_Girl015_prop02_C_OnInterrupted_15E405234E55C2A1E52DE99BCED7CB26, NotifyName) == 0x000000, "Member 'BP_Girl015_prop02_C_OnInterrupted_15E405234E55C2A1E52DE99BCED7CB26::NotifyName' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.OnBlendOut_15E405234E55C2A1E52DE99BCED7CB26
// 0x0008 (0x0008 - 0x0000)
struct BP_Girl015_prop02_C_OnBlendOut_15E405234E55C2A1E52DE99BCED7CB26 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_OnBlendOut_15E405234E55C2A1E52DE99BCED7CB26) == 0x000004, "Wrong alignment on BP_Girl015_prop02_C_OnBlendOut_15E405234E55C2A1E52DE99BCED7CB26");
static_assert(sizeof(BP_Girl015_prop02_C_OnBlendOut_15E405234E55C2A1E52DE99BCED7CB26) == 0x000008, "Wrong size on BP_Girl015_prop02_C_OnBlendOut_15E405234E55C2A1E52DE99BCED7CB26");
static_assert(offsetof(BP_Girl015_prop02_C_OnBlendOut_15E405234E55C2A1E52DE99BCED7CB26, NotifyName) == 0x000000, "Member 'BP_Girl015_prop02_C_OnBlendOut_15E405234E55C2A1E52DE99BCED7CB26::NotifyName' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.OnCompleted_15E405234E55C2A1E52DE99BCED7CB26
// 0x0008 (0x0008 - 0x0000)
struct BP_Girl015_prop02_C_OnCompleted_15E405234E55C2A1E52DE99BCED7CB26 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_OnCompleted_15E405234E55C2A1E52DE99BCED7CB26) == 0x000004, "Wrong alignment on BP_Girl015_prop02_C_OnCompleted_15E405234E55C2A1E52DE99BCED7CB26");
static_assert(sizeof(BP_Girl015_prop02_C_OnCompleted_15E405234E55C2A1E52DE99BCED7CB26) == 0x000008, "Wrong size on BP_Girl015_prop02_C_OnCompleted_15E405234E55C2A1E52DE99BCED7CB26");
static_assert(offsetof(BP_Girl015_prop02_C_OnCompleted_15E405234E55C2A1E52DE99BCED7CB26, NotifyName) == 0x000000, "Member 'BP_Girl015_prop02_C_OnCompleted_15E405234E55C2A1E52DE99BCED7CB26::NotifyName' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.OnNotifyEnd_A8FCA3FA46BD1EE9882796BC23CC3686
// 0x0008 (0x0008 - 0x0000)
struct BP_Girl015_prop02_C_OnNotifyEnd_A8FCA3FA46BD1EE9882796BC23CC3686 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_OnNotifyEnd_A8FCA3FA46BD1EE9882796BC23CC3686) == 0x000004, "Wrong alignment on BP_Girl015_prop02_C_OnNotifyEnd_A8FCA3FA46BD1EE9882796BC23CC3686");
static_assert(sizeof(BP_Girl015_prop02_C_OnNotifyEnd_A8FCA3FA46BD1EE9882796BC23CC3686) == 0x000008, "Wrong size on BP_Girl015_prop02_C_OnNotifyEnd_A8FCA3FA46BD1EE9882796BC23CC3686");
static_assert(offsetof(BP_Girl015_prop02_C_OnNotifyEnd_A8FCA3FA46BD1EE9882796BC23CC3686, NotifyName) == 0x000000, "Member 'BP_Girl015_prop02_C_OnNotifyEnd_A8FCA3FA46BD1EE9882796BC23CC3686::NotifyName' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.OnNotifyBegin_A8FCA3FA46BD1EE9882796BC23CC3686
// 0x0008 (0x0008 - 0x0000)
struct BP_Girl015_prop02_C_OnNotifyBegin_A8FCA3FA46BD1EE9882796BC23CC3686 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_OnNotifyBegin_A8FCA3FA46BD1EE9882796BC23CC3686) == 0x000004, "Wrong alignment on BP_Girl015_prop02_C_OnNotifyBegin_A8FCA3FA46BD1EE9882796BC23CC3686");
static_assert(sizeof(BP_Girl015_prop02_C_OnNotifyBegin_A8FCA3FA46BD1EE9882796BC23CC3686) == 0x000008, "Wrong size on BP_Girl015_prop02_C_OnNotifyBegin_A8FCA3FA46BD1EE9882796BC23CC3686");
static_assert(offsetof(BP_Girl015_prop02_C_OnNotifyBegin_A8FCA3FA46BD1EE9882796BC23CC3686, NotifyName) == 0x000000, "Member 'BP_Girl015_prop02_C_OnNotifyBegin_A8FCA3FA46BD1EE9882796BC23CC3686::NotifyName' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.OnInterrupted_A8FCA3FA46BD1EE9882796BC23CC3686
// 0x0008 (0x0008 - 0x0000)
struct BP_Girl015_prop02_C_OnInterrupted_A8FCA3FA46BD1EE9882796BC23CC3686 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_OnInterrupted_A8FCA3FA46BD1EE9882796BC23CC3686) == 0x000004, "Wrong alignment on BP_Girl015_prop02_C_OnInterrupted_A8FCA3FA46BD1EE9882796BC23CC3686");
static_assert(sizeof(BP_Girl015_prop02_C_OnInterrupted_A8FCA3FA46BD1EE9882796BC23CC3686) == 0x000008, "Wrong size on BP_Girl015_prop02_C_OnInterrupted_A8FCA3FA46BD1EE9882796BC23CC3686");
static_assert(offsetof(BP_Girl015_prop02_C_OnInterrupted_A8FCA3FA46BD1EE9882796BC23CC3686, NotifyName) == 0x000000, "Member 'BP_Girl015_prop02_C_OnInterrupted_A8FCA3FA46BD1EE9882796BC23CC3686::NotifyName' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.OnBlendOut_A8FCA3FA46BD1EE9882796BC23CC3686
// 0x0008 (0x0008 - 0x0000)
struct BP_Girl015_prop02_C_OnBlendOut_A8FCA3FA46BD1EE9882796BC23CC3686 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_OnBlendOut_A8FCA3FA46BD1EE9882796BC23CC3686) == 0x000004, "Wrong alignment on BP_Girl015_prop02_C_OnBlendOut_A8FCA3FA46BD1EE9882796BC23CC3686");
static_assert(sizeof(BP_Girl015_prop02_C_OnBlendOut_A8FCA3FA46BD1EE9882796BC23CC3686) == 0x000008, "Wrong size on BP_Girl015_prop02_C_OnBlendOut_A8FCA3FA46BD1EE9882796BC23CC3686");
static_assert(offsetof(BP_Girl015_prop02_C_OnBlendOut_A8FCA3FA46BD1EE9882796BC23CC3686, NotifyName) == 0x000000, "Member 'BP_Girl015_prop02_C_OnBlendOut_A8FCA3FA46BD1EE9882796BC23CC3686::NotifyName' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.OnCompleted_A8FCA3FA46BD1EE9882796BC23CC3686
// 0x0008 (0x0008 - 0x0000)
struct BP_Girl015_prop02_C_OnCompleted_A8FCA3FA46BD1EE9882796BC23CC3686 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_OnCompleted_A8FCA3FA46BD1EE9882796BC23CC3686) == 0x000004, "Wrong alignment on BP_Girl015_prop02_C_OnCompleted_A8FCA3FA46BD1EE9882796BC23CC3686");
static_assert(sizeof(BP_Girl015_prop02_C_OnCompleted_A8FCA3FA46BD1EE9882796BC23CC3686) == 0x000008, "Wrong size on BP_Girl015_prop02_C_OnCompleted_A8FCA3FA46BD1EE9882796BC23CC3686");
static_assert(offsetof(BP_Girl015_prop02_C_OnCompleted_A8FCA3FA46BD1EE9882796BC23CC3686, NotifyName) == 0x000000, "Member 'BP_Girl015_prop02_C_OnCompleted_A8FCA3FA46BD1EE9882796BC23CC3686::NotifyName' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.SkillEnd
// 0x0004 (0x0004 - 0x0000)
struct BP_Girl015_prop02_C_SkillEnd final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_SkillEnd) == 0x000004, "Wrong alignment on BP_Girl015_prop02_C_SkillEnd");
static_assert(sizeof(BP_Girl015_prop02_C_SkillEnd) == 0x000004, "Wrong size on BP_Girl015_prop02_C_SkillEnd");
static_assert(offsetof(BP_Girl015_prop02_C_SkillEnd, SkillID) == 0x000000, "Member 'BP_Girl015_prop02_C_SkillEnd::SkillID' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.OnAbilityCastSkill_ܚ_0
// 0x0020 (0x0020 - 0x0000)
struct BP_Girl015_prop02_C_OnAbilityCastSkill____0 final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OriginSkills;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UGameAbilityComponent*                  AbilityRef;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_OnAbilityCastSkill____0) == 0x000008, "Wrong alignment on BP_Girl015_prop02_C_OnAbilityCastSkill____0");
static_assert(sizeof(BP_Girl015_prop02_C_OnAbilityCastSkill____0) == 0x000020, "Wrong size on BP_Girl015_prop02_C_OnAbilityCastSkill____0");
static_assert(offsetof(BP_Girl015_prop02_C_OnAbilityCastSkill____0, SkillID) == 0x000000, "Member 'BP_Girl015_prop02_C_OnAbilityCastSkill____0::SkillID' has a wrong offset!");
static_assert(offsetof(BP_Girl015_prop02_C_OnAbilityCastSkill____0, OriginSkills) == 0x000008, "Member 'BP_Girl015_prop02_C_OnAbilityCastSkill____0::OriginSkills' has a wrong offset!");
static_assert(offsetof(BP_Girl015_prop02_C_OnAbilityCastSkill____0, AbilityRef) == 0x000018, "Member 'BP_Girl015_prop02_C_OnAbilityCastSkill____0::AbilityRef' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.Aim
// 0x0001 (0x0001 - 0x0000)
struct BP_Girl015_prop02_C_Aim final
{
public:
	bool                                          bInAiming;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Girl015_prop02_C_Aim) == 0x000001, "Wrong alignment on BP_Girl015_prop02_C_Aim");
static_assert(sizeof(BP_Girl015_prop02_C_Aim) == 0x000001, "Wrong size on BP_Girl015_prop02_C_Aim");
static_assert(offsetof(BP_Girl015_prop02_C_Aim, bInAiming) == 0x000000, "Member 'BP_Girl015_prop02_C_Aim::bInAiming' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Girl015_prop02_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_prop02_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Girl015_prop02_C_ReceiveEndPlay");
static_assert(sizeof(BP_Girl015_prop02_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Girl015_prop02_C_ReceiveEndPlay");
static_assert(offsetof(BP_Girl015_prop02_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Girl015_prop02_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_Girl015_prop02.BP_Girl015_prop02_C.ExecuteUbergraph_BP_Girl015_prop02
// 0x02C8 (0x02C8 - 0x0000)
struct BP_Girl015_prop02_C_ExecuteUbergraph_BP_Girl015_prop02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_18;                  // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_17;                  // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_16;                  // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_15;                  // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   ___name_Variable;                                  // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_14;                  // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_13;                  // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_12;                  // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_11;                  // 0x00A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_10;                  // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   ___name_Variable_1;                                // 0x00D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x00DC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x00EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x00F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x00FC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x010C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x0114(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0124(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_11;           // 0x012C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x013C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_12;           // 0x0144(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   ___name_Variable_2;                                // 0x0154(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bInAiming)>               K2Node_CreateDelegate_OutputDelegate_13;           // 0x0160(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_14;           // 0x0170(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_15;           // 0x0190(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_16;           // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_17;           // 0x01C0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_18;           // 0x01D8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   ___name_Variable_3;                                // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_19;           // 0x01F0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_SkillID_1;                      // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SkillID;                        // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_CustomEvent_OriginSkills;                   // 0x0208(0x0010)(ConstParm, ReferenceParm)
	class UGameAbilityComponent*                  K2Node_CustomEvent_AbilityRef;                     // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         CallFunc_GetGameCharacter_ReturnValue;             // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_19;                  // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_20;           // 0x0230(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetMontage_NewSkeleton_ReturnValue;       // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetMontage_NewSkeleton_ReturnValue_1;     // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26A[0x6];                                      // 0x026A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetMontage_NewSkeleton_ReturnValue_2;     // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         CallFunc_GetGameCharacter_ReturnValue_1;           // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2; // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x028A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28B[0x5];                                      // 0x028B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayerController*                  CallFunc_GetCharacterController_ReturnValue;       // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInAiming;                      // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SkillID, TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef)> K2Node_CreateDelegate_OutputDelegate_21;           // 0x029C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetMontage_NewSkeleton_ReturnValue_3;     // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_3; // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Girl015_prop02_C_ExecuteUbergraph_BP_Girl015_prop02) == 0x000008, "Wrong alignment on BP_Girl015_prop02_C_ExecuteUbergraph_BP_Girl015_prop02");
static_assert(sizeof(BP_Girl015_prop02_C_ExecuteUbergraph_BP_Girl015_prop02) == 0x0002C8, "Wrong size on BP_Girl015_prop02_C_ExecuteUbergraph_BP_Girl015_prop02");
static_assert(offsetof(BP_Girl015_prop02_C_ExecuteUbergraph_BP_Girl015_prop02, EntryPoint) == 0x000000, "Member 'BP_Girl015_prop02_C_ExecuteUbergraph_BP_Girl015_prop02::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Girl015_prop02_C_ExecuteUbergraph_BP_Girl015_prop02, K2Node_CustomEvent_NotifyName_18) == 0x000004, "Member 'BP_Girl015_prop02_C_ExecuteUbergraph_BP_Girl015_prop02::K2Node_CustomEvent_NotifyName_18' has a wrong offset!");
