#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl006a

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BaseCharacter_classes.hpp"
#include "Game_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Girl006a.BP_Girl006a_C
// 0x0140 (0x24E0 - 0x23A0)
class ABP_Girl006a_C final : public ABaseCharacter_C
{
public:
	uint8                                         Pad_2395[0x3];                                     // 0x2395(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Girl006a_C;                      // 0x2398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      e_girl006a_skill03_self13_p;                       // 0x23A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ____1______0_2B250E6744A7527B01C5639EEFAFB493;     // 0x23A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____1__Direction_2B250E6744A7527B01C5639EEFAFB493; // 0x23AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23AD[0x3];                                     // 0x23AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_1;                                          // 0x23B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____Big_Show_2______0_1477CC354E1DC94A849299B71B0E4188; // 0x23B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____Big_Show_2__Direction_1477CC354E1DC94A849299B71B0E4188; // 0x23BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23BD[0x3];                                     // 0x23BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_Big_Show_2;                                 // 0x23C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____Big_Show______0_F0BE4FFA4449AE5B6DD2BA9E1302E867; // 0x23C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____Big_Show__Direction_F0BE4FFA4449AE5B6DD2BA9E1302E867; // 0x23CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23CD[0x3];                                     // 0x23CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_Big_Show;                                   // 0x23D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____show_2______0_ADE050194641E63721D896B314D26E8A; // 0x23D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____show_2__Direction_ADE050194641E63721D896B314D26E8A; // 0x23DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23DD[0x3];                                     // 0x23DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_show_2;                                     // 0x23E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____show______0_8C1A36A943A3C7DB706C39B322F8095A;  // 0x23E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____show__Direction_8C1A36A943A3C7DB706C39B322F8095A; // 0x23EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23ED[0x3];                                     // 0x23ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_show;                                       // 0x23F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 Normal_Skill;                                      // 0x23F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 Burst_Skill;                                       // 0x2408(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCharacterRenderComponent*              Target_0;                                          // 0x2418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         MC;                                                // 0x2420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Dissolve_Edge_Color;                               // 0x2428(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   EffectTexture;                                     // 0x2440(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DissolveWidth;                                     // 0x2458(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DissolveLevel;                                     // 0x2470(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Time;                                              // 0x2488(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ID;                                                // 0x248C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   DirectionDissolve;                                 // 0x2490(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DissolveVector;                                    // 0x24A8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNiagaraComponent*                      Niagara;                                           // 0x24C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NormalSkillTag;                                    // 0x24C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24C9[0x7];                                     // 0x24C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 SwordEnergy_Skill;                                 // 0x24D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BigKnife_Show(class UCharacterRenderComponent** Target, int32* ID_0, class UMeshComponent** MC_0);
	void Knife_Show(class UCharacterRenderComponent** Target, int32* ID_0, class UMeshComponent** MC_0);
	void 时间轴_Big_Show__FinishedFunc();
	void 时间轴_Big_Show__UpdateFunc();
	void 时间轴_Big_Show_2__FinishedFunc();
	void 时间轴_Big_Show_2__UpdateFunc();
	void 时间轴_show_2__FinishedFunc();
	void 时间轴_show_2__UpdateFunc();
	void 时间轴_show__FinishedFunc();
	void 时间轴_show__UpdateFunc();
	void 时间轴_1__FinishedFunc();
	void 时间轴_1__UpdateFunc();
	void OnNotifyEnd_F1E8CD3C4C0D45C2375B77AFF059DA42(class FName NotifyName);
	void OnNotifyBegin_F1E8CD3C4C0D45C2375B77AFF059DA42(class FName NotifyName);
	void OnInterrupted_F1E8CD3C4C0D45C2375B77AFF059DA42(class FName NotifyName);
	void OnBlendOut_F1E8CD3C4C0D45C2375B77AFF059DA42(class FName NotifyName);
	void OnCompleted_F1E8CD3C4C0D45C2375B77AFF059DA42(class FName NotifyName);
	void OnNotifyEnd_3AAA7E6B47BF82EAB2CBB18D91114970(class FName NotifyName);
	void OnNotifyBegin_3AAA7E6B47BF82EAB2CBB18D91114970(class FName NotifyName);
	void OnInterrupted_3AAA7E6B47BF82EAB2CBB18D91114970(class FName NotifyName);
	void OnBlendOut_3AAA7E6B47BF82EAB2CBB18D91114970(class FName NotifyName);
	void OnCompleted_3AAA7E6B47BF82EAB2CBB18D91114970(class FName NotifyName);
	void SkillEnd(int32 SkillID);
	void SkillStart(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void 开爆发技时隐藏小刀(int32 ModifierID, bool IsApply, int64 LauncherCharacterHashIndex, EModifierRemoveSourceType RemoveSourceType);
	void Client_1106104(bool bExist);
	void Client_1106103(bool bExist);
	void ExecuteUbergraph_BP_Girl006a(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Girl006a_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Girl006a_C")
	}
	static class ABP_Girl006a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Girl006a_C>();
	}
};
DUMPER7_ASSERTS_ABP_Girl006a_C;

}

