#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_girl002a_prop06_L

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"
#include "SeasunAccount_structs.hpp"


namespace SDK::Params
{

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnNotifyEnd_F9DEFACB4FFDC8427D9ED3BE512D4F03
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnNotifyEnd_F9DEFACB4FFDC8427D9ED3BE512D4F03 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnNotifyEnd_F9DEFACB4FFDC8427D9ED3BE512D4F03;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnNotifyBegin_F9DEFACB4FFDC8427D9ED3BE512D4F03
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnNotifyBegin_F9DEFACB4FFDC8427D9ED3BE512D4F03 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnNotifyBegin_F9DEFACB4FFDC8427D9ED3BE512D4F03;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnInterrupted_F9DEFACB4FFDC8427D9ED3BE512D4F03
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnInterrupted_F9DEFACB4FFDC8427D9ED3BE512D4F03 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnInterrupted_F9DEFACB4FFDC8427D9ED3BE512D4F03;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnBlendOut_F9DEFACB4FFDC8427D9ED3BE512D4F03
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnBlendOut_F9DEFACB4FFDC8427D9ED3BE512D4F03 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnBlendOut_F9DEFACB4FFDC8427D9ED3BE512D4F03;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnCompleted_F9DEFACB4FFDC8427D9ED3BE512D4F03
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnCompleted_F9DEFACB4FFDC8427D9ED3BE512D4F03 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnCompleted_F9DEFACB4FFDC8427D9ED3BE512D4F03;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnNotifyEnd_8876475F4AA86ABB786E45B4B851171B
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnNotifyEnd_8876475F4AA86ABB786E45B4B851171B final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnNotifyEnd_8876475F4AA86ABB786E45B4B851171B;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnNotifyBegin_8876475F4AA86ABB786E45B4B851171B
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnNotifyBegin_8876475F4AA86ABB786E45B4B851171B final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnNotifyBegin_8876475F4AA86ABB786E45B4B851171B;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnInterrupted_8876475F4AA86ABB786E45B4B851171B
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnInterrupted_8876475F4AA86ABB786E45B4B851171B final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnInterrupted_8876475F4AA86ABB786E45B4B851171B;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnBlendOut_8876475F4AA86ABB786E45B4B851171B
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnBlendOut_8876475F4AA86ABB786E45B4B851171B final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnBlendOut_8876475F4AA86ABB786E45B4B851171B;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnCompleted_8876475F4AA86ABB786E45B4B851171B
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnCompleted_8876475F4AA86ABB786E45B4B851171B final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnCompleted_8876475F4AA86ABB786E45B4B851171B;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnNotifyEnd_499D4BE64983FBD2573A09BFAA0E4E80
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnNotifyEnd_499D4BE64983FBD2573A09BFAA0E4E80 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnNotifyEnd_499D4BE64983FBD2573A09BFAA0E4E80;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnNotifyBegin_499D4BE64983FBD2573A09BFAA0E4E80
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnNotifyBegin_499D4BE64983FBD2573A09BFAA0E4E80 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnNotifyBegin_499D4BE64983FBD2573A09BFAA0E4E80;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnInterrupted_499D4BE64983FBD2573A09BFAA0E4E80
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnInterrupted_499D4BE64983FBD2573A09BFAA0E4E80 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnInterrupted_499D4BE64983FBD2573A09BFAA0E4E80;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnBlendOut_499D4BE64983FBD2573A09BFAA0E4E80
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnBlendOut_499D4BE64983FBD2573A09BFAA0E4E80 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnBlendOut_499D4BE64983FBD2573A09BFAA0E4E80;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnCompleted_499D4BE64983FBD2573A09BFAA0E4E80
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnCompleted_499D4BE64983FBD2573A09BFAA0E4E80 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnCompleted_499D4BE64983FBD2573A09BFAA0E4E80;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnNotifyEnd_F044D6474798343ED7239CB38DE2FAD0
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnNotifyEnd_F044D6474798343ED7239CB38DE2FAD0 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnNotifyEnd_F044D6474798343ED7239CB38DE2FAD0;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnNotifyBegin_F044D6474798343ED7239CB38DE2FAD0
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnNotifyBegin_F044D6474798343ED7239CB38DE2FAD0 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnNotifyBegin_F044D6474798343ED7239CB38DE2FAD0;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnInterrupted_F044D6474798343ED7239CB38DE2FAD0
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnInterrupted_F044D6474798343ED7239CB38DE2FAD0 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnInterrupted_F044D6474798343ED7239CB38DE2FAD0;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnBlendOut_F044D6474798343ED7239CB38DE2FAD0
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnBlendOut_F044D6474798343ED7239CB38DE2FAD0 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnBlendOut_F044D6474798343ED7239CB38DE2FAD0;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnCompleted_F044D6474798343ED7239CB38DE2FAD0
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnCompleted_F044D6474798343ED7239CB38DE2FAD0 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnCompleted_F044D6474798343ED7239CB38DE2FAD0;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnNotifyEnd_47E0E1EE46D54AABFB249D89E09ACDF3
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnNotifyEnd_47E0E1EE46D54AABFB249D89E09ACDF3 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnNotifyEnd_47E0E1EE46D54AABFB249D89E09ACDF3;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnNotifyBegin_47E0E1EE46D54AABFB249D89E09ACDF3
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnNotifyBegin_47E0E1EE46D54AABFB249D89E09ACDF3 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnNotifyBegin_47E0E1EE46D54AABFB249D89E09ACDF3;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnInterrupted_47E0E1EE46D54AABFB249D89E09ACDF3
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnInterrupted_47E0E1EE46D54AABFB249D89E09ACDF3 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnInterrupted_47E0E1EE46D54AABFB249D89E09ACDF3;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnBlendOut_47E0E1EE46D54AABFB249D89E09ACDF3
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnBlendOut_47E0E1EE46D54AABFB249D89E09ACDF3 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnBlendOut_47E0E1EE46D54AABFB249D89E09ACDF3;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnCompleted_47E0E1EE46D54AABFB249D89E09ACDF3
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnCompleted_47E0E1EE46D54AABFB249D89E09ACDF3 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnCompleted_47E0E1EE46D54AABFB249D89E09ACDF3;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnNotifyEnd_8574364140996A7109A6F192835E00C5
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnNotifyEnd_8574364140996A7109A6F192835E00C5 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnNotifyEnd_8574364140996A7109A6F192835E00C5;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnNotifyBegin_8574364140996A7109A6F192835E00C5
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnNotifyBegin_8574364140996A7109A6F192835E00C5 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnNotifyBegin_8574364140996A7109A6F192835E00C5;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnInterrupted_8574364140996A7109A6F192835E00C5
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnInterrupted_8574364140996A7109A6F192835E00C5 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnInterrupted_8574364140996A7109A6F192835E00C5;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnBlendOut_8574364140996A7109A6F192835E00C5
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnBlendOut_8574364140996A7109A6F192835E00C5 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnBlendOut_8574364140996A7109A6F192835E00C5;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnCompleted_8574364140996A7109A6F192835E00C5
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop06_L_C_OnCompleted_8574364140996A7109A6F192835E00C5 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnCompleted_8574364140996A7109A6F192835E00C5;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.OnAbilityCastSkill_事件_0
// 0x0020 (0x0020 - 0x0000)
struct BP_girl002a_prop06_L_C_OnAbilityCastSkill_事件_0 final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OriginSkills;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UGameAbilityComponent*                  AbilityRef;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_OnAbilityCastSkill_事件_0;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_girl002a_prop06_L_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_ReceiveTick;

// Function BP_girl002a_prop06_L.BP_girl002a_prop06_L_C.ExecuteUbergraph_BP_girl002a_prop06_L
// 0x0648 (0x0648 - 0x0000)
struct BP_girl002a_prop06_L_C_ExecuteUbergraph_BP_girl002a_prop06_L final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_29;                  // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_28;                  // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_27;                  // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_26;                  // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_25;                  // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   ___name_Variable;                                  // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_24;                  // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_23;                  // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_22;                  // 0x00A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_21;                  // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_20;                  // 0x00D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x00DC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   ___name_Variable_1;                                // 0x00EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemManager*                 CallFunc_GetEngineSubsystem_ReturnValue;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_19;                  // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_18;                  // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_17;                  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_11;           // 0x0138(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_16;                  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_12;           // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_15;                  // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_13;           // 0x0168(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   ___name_Variable_2;                                // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_14;           // 0x0180(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_14;                  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_13;                  // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_15;           // 0x01A0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_12;                  // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_16;           // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_11;                  // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_17;           // 0x01D0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_10;                  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_18;           // 0x01E8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   ___name_Variable_3;                                // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_19;           // 0x0200(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_20;           // 0x0220(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_21;           // 0x0238(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_22;           // 0x0250(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_23;           // 0x0268(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   ___name_Variable_4;                                // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_24;           // 0x0280(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_25;           // 0x02A0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_26;           // 0x02B8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_27;           // 0x02D0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_28;           // 0x02E8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   ___name_Variable_5;                                // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_SkillID;                        // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_CustomEvent_OriginSkills;                   // 0x0308(0x0010)(ConstParm, ReferenceParm)
	class UGameAbilityComponent*                  K2Node_CustomEvent_AbilityRef;                     // 0x0318(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef)> K2Node_CreateDelegate_OutputDelegate_29; // 0x0330(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetGameCharacter_ReturnValue;             // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         CallFunc_GetGameCharacter_ReturnValue_1;           // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0358(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0368(0x0010)(ReferenceParm)
	struct FCharacterStateStartParam              K2Node_MakeStruct_CharacterStateStartParam;        // 0x0378(0x0100)(ContainsInstancedReference)
	int32                                         CallFunc_StartCharacterStateParam_ReturnValue;     // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_GetPiFuGDPL_ReturnValue;                  // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2; // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemTemplate                          CallFunc_FindTemplateForID_ReturnValue;            // 0x04A0(0x0140)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E1[0x3];                                      // 0x05E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_30;           // 0x05E4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x05F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x05F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F6[0x2];                                      // 0x05F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_3; // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_2;                 // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0601(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_602[0x6];                                      // 0x0602(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_4; // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_3;                 // 0x0611(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_612[0x6];                                      // 0x0612(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_5; // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_girl002a_prop06_L_C*               K2Node_DynamicCast_AsABP_Girl_002a_Prop_06_L;      // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0631(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_632[0x2];                                      // 0x0632(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_1;                  // 0x0634(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0644(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop06_L_C_ExecuteUbergraph_BP_girl002a_prop06_L;

}

