#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GameController.BP_GameController_C
// 0x00A0 (0x1590 - 0x14F0)
class ABP_GameController_C final : public AGamePlayerController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x14F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_14F8[0x8];                                     // 0x14F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Last_Transform;                                    // 0x1500(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             Last_Transform_Temp;                               // 0x1530(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         CurrentTime;                                       // 0x1560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SaveIntervalTime;                                  // 0x1564(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAutoFireInBunker;                                 // 0x1568(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bForceNotAutoFire;                                 // 0x1569(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bRushNotAutoFire;                                  // 0x156A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_156B[0x1];                                     // 0x156B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SensitivityCamera_ShotGun;                         // 0x156C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SensitivityCamera_Normal;                          // 0x1570(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1574[0x4];                                     // 0x1574(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CurPawn;                                           // 0x1578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SensitivityGyrosope_Normal;                        // 0x1580(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SensitivityGyrosope_ShotGun;                       // 0x1584(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAutoFire;                                         // 0x1588(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1589[0x3];                                     // 0x1589(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RushButtonType;                                    // 0x158C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void LuaImpl_CallDSExec(int32 InCmd, const class FString& InContent);
	void LuaImpl_CallClientExec(int32 InCmd, const class FString& InContent);
	void CalcSideLength(float InVal, float LineVal, float* ReturnVal);
	void SetRushButtonType(int32 InType);
	void AutoFireToRush();
	void RushNotAutoFire(bool bNotAutoFire);
	void CheckInAutoFire(bool* bInAutoFire);
	void SetSensitivityCamera(int32 InCameraNormal, int32 InCameraShotGun, int32 InGyrosopeNormal, int32 InGyrosopeShotGun);
	void ResetSensitivityCamera();
	void ForceStopAutoFireInBunker(bool bStop);
	void ResetAutoFireInBunker();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void NotifyAutoFire(bool bFire);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ServerCancelAllInAnimSkill();
	void Client_ResumePlayerOperation(EPlayerAction Action);
	void Client_ClearPlayerActionFlag(EPlayerAction Action, class AGamePlayer* TargetPlayer);
	void NotifyInteractFailed();
	void ExecuteUbergraph_BP_GameController(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GameController_C">();
	}
	static class ABP_GameController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GameController_C>();
	}
};
static_assert(alignof(ABP_GameController_C) == 0x000010, "Wrong alignment on ABP_GameController_C");
static_assert(sizeof(ABP_GameController_C) == 0x001590, "Wrong size on ABP_GameController_C");
static_assert(offsetof(ABP_GameController_C, UberGraphFrame) == 0x0014F0, "Member 'ABP_GameController_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GameController_C, Last_Transform) == 0x001500, "Member 'ABP_GameController_C::Last_Transform' has a wrong offset!");
static_assert(offsetof(ABP_GameController_C, Last_Transform_Temp) == 0x001530, "Member 'ABP_GameController_C::Last_Transform_Temp' has a wrong offset!");
static_assert(offsetof(ABP_GameController_C, CurrentTime) == 0x001560, "Member 'ABP_GameController_C::CurrentTime' has a wrong offset!");
static_assert(offsetof(ABP_GameController_C, SaveIntervalTime) == 0x001564, "Member 'ABP_GameController_C::SaveIntervalTime' has a wrong offset!");
static_assert(offsetof(ABP_GameController_C, bAutoFireInBunker) == 0x001568, "Member 'ABP_GameController_C::bAutoFireInBunker' has a wrong offset!");
static_assert(offsetof(ABP_GameController_C, bForceNotAutoFire) == 0x001569, "Member 'ABP_GameController_C::bForceNotAutoFire' has a wrong offset!");
static_assert(offsetof(ABP_GameController_C, bRushNotAutoFire) == 0x00156A, "Member 'ABP_GameController_C::bRushNotAutoFire' has a wrong offset!");
static_assert(offsetof(ABP_GameController_C, SensitivityCamera_ShotGun) == 0x00156C, "Member 'ABP_GameController_C::SensitivityCamera_ShotGun' has a wrong offset!");
static_assert(offsetof(ABP_GameController_C, SensitivityCamera_Normal) == 0x001570, "Member 'ABP_GameController_C::SensitivityCamera_Normal' has a wrong offset!");
static_assert(offsetof(ABP_GameController_C, CurPawn) == 0x001578, "Member 'ABP_GameController_C::CurPawn' has a wrong offset!");
static_assert(offsetof(ABP_GameController_C, SensitivityGyrosope_Normal) == 0x001580, "Member 'ABP_GameController_C::SensitivityGyrosope_Normal' has a wrong offset!");
static_assert(offsetof(ABP_GameController_C, SensitivityGyrosope_ShotGun) == 0x001584, "Member 'ABP_GameController_C::SensitivityGyrosope_ShotGun' has a wrong offset!");
static_assert(offsetof(ABP_GameController_C, bAutoFire) == 0x001588, "Member 'ABP_GameController_C::bAutoFire' has a wrong offset!");
static_assert(offsetof(ABP_GameController_C, RushButtonType) == 0x00158C, "Member 'ABP_GameController_C::RushButtonType' has a wrong offset!");

}

