#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl008

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BaseCharacter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Girl008.BP_Girl008_C
// 0x0010 (0x2340 - 0x2330)
class ABP_Girl008_C final : public ABaseCharacter_C
{
public:
	uint8                                         Pad_2325[0x3];                                     // 0x2325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Girl008_C;                       // 0x2328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCameraComponent*                       AimCamera;                                         // 0x2330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWednesdayDroneManagerComponent*        WednesdayDroneManager;                             // 0x2338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void OnSwitchEnter(const struct FTransform& Trans);
	void OnSwitchLeave(const struct FTransform& Trans);
	void ExecuteUbergraph_BP_Girl008(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Girl008_C">();
	}
	static class ABP_Girl008_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Girl008_C>();
	}
};
static_assert(alignof(ABP_Girl008_C) == 0x000010, "Wrong alignment on ABP_Girl008_C");
static_assert(sizeof(ABP_Girl008_C) == 0x002340, "Wrong size on ABP_Girl008_C");
static_assert(offsetof(ABP_Girl008_C, UberGraphFrame_BP_Girl008_C) == 0x002328, "Member 'ABP_Girl008_C::UberGraphFrame_BP_Girl008_C' has a wrong offset!");
static_assert(offsetof(ABP_Girl008_C, AimCamera) == 0x002330, "Member 'ABP_Girl008_C::AimCamera' has a wrong offset!");
static_assert(offsetof(ABP_Girl008_C, WednesdayDroneManager) == 0x002338, "Member 'ABP_Girl008_C::WednesdayDroneManager' has a wrong offset!");

}

