#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_girl004

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BaseCharacter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_girl004.BP_Girl004_C
// 0x0030 (0x2390 - 0x2360)
class ABP_Girl004_C final : public ABaseCharacter_C
{
public:
	uint8                                         Pad_2355[0x3];                                     // 0x2355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Girl004_C;                       // 0x2358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPhysicalAnimationComponent*            PhysicalAnimation;                                 // 0x2360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UImmortalDroneFollowSocketComponentAlone* ImmortalDroneFollowSocketComponentAlone;           // 0x2368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UImmortalDroneFollowSocketComponent*    ImmortalDroneFollowSocket;                         // 0x2370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWednesdayDroneManagerComponent*        WednesdayDroneManager;                             // 0x2378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Kawwi;                                             // 0x2380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnSwitchEnter(const struct FTransform& Trans);
	void OnSwitchLeave(const struct FTransform& Trans);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_Girl004(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Girl004_C">();
	}
	static class ABP_Girl004_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Girl004_C>();
	}
};
static_assert(alignof(ABP_Girl004_C) == 0x000010, "Wrong alignment on ABP_Girl004_C");
static_assert(sizeof(ABP_Girl004_C) == 0x002390, "Wrong size on ABP_Girl004_C");
static_assert(offsetof(ABP_Girl004_C, UberGraphFrame_BP_Girl004_C) == 0x002358, "Member 'ABP_Girl004_C::UberGraphFrame_BP_Girl004_C' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_C, PhysicalAnimation) == 0x002360, "Member 'ABP_Girl004_C::PhysicalAnimation' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_C, ImmortalDroneFollowSocketComponentAlone) == 0x002368, "Member 'ABP_Girl004_C::ImmortalDroneFollowSocketComponentAlone' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_C, ImmortalDroneFollowSocket) == 0x002370, "Member 'ABP_Girl004_C::ImmortalDroneFollowSocket' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_C, WednesdayDroneManager) == 0x002378, "Member 'ABP_Girl004_C::WednesdayDroneManager' has a wrong offset!");
static_assert(offsetof(ABP_Girl004_C, Kawwi) == 0x002380, "Member 'ABP_Girl004_C::Kawwi' has a wrong offset!");

}

