#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_girl002a_prop07_R

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"
#include "SeasunAccount_structs.hpp"


namespace SDK::Params
{

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnNotifyEnd_56AB6F724029C72D37D0FCBD2C3C9D74
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnNotifyEnd_56AB6F724029C72D37D0FCBD2C3C9D74 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnNotifyEnd_56AB6F724029C72D37D0FCBD2C3C9D74;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnNotifyBegin_56AB6F724029C72D37D0FCBD2C3C9D74
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnNotifyBegin_56AB6F724029C72D37D0FCBD2C3C9D74 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnNotifyBegin_56AB6F724029C72D37D0FCBD2C3C9D74;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnInterrupted_56AB6F724029C72D37D0FCBD2C3C9D74
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnInterrupted_56AB6F724029C72D37D0FCBD2C3C9D74 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnInterrupted_56AB6F724029C72D37D0FCBD2C3C9D74;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnBlendOut_56AB6F724029C72D37D0FCBD2C3C9D74
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnBlendOut_56AB6F724029C72D37D0FCBD2C3C9D74 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnBlendOut_56AB6F724029C72D37D0FCBD2C3C9D74;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnCompleted_56AB6F724029C72D37D0FCBD2C3C9D74
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnCompleted_56AB6F724029C72D37D0FCBD2C3C9D74 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnCompleted_56AB6F724029C72D37D0FCBD2C3C9D74;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnNotifyEnd_721F9AA4472937428D5C42A92827138D
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnNotifyEnd_721F9AA4472937428D5C42A92827138D final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnNotifyEnd_721F9AA4472937428D5C42A92827138D;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnNotifyBegin_721F9AA4472937428D5C42A92827138D
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnNotifyBegin_721F9AA4472937428D5C42A92827138D final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnNotifyBegin_721F9AA4472937428D5C42A92827138D;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnInterrupted_721F9AA4472937428D5C42A92827138D
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnInterrupted_721F9AA4472937428D5C42A92827138D final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnInterrupted_721F9AA4472937428D5C42A92827138D;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnBlendOut_721F9AA4472937428D5C42A92827138D
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnBlendOut_721F9AA4472937428D5C42A92827138D final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnBlendOut_721F9AA4472937428D5C42A92827138D;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnCompleted_721F9AA4472937428D5C42A92827138D
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnCompleted_721F9AA4472937428D5C42A92827138D final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnCompleted_721F9AA4472937428D5C42A92827138D;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnNotifyEnd_105F2A31449A2955C8E09081172F6378
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnNotifyEnd_105F2A31449A2955C8E09081172F6378 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnNotifyEnd_105F2A31449A2955C8E09081172F6378;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnNotifyBegin_105F2A31449A2955C8E09081172F6378
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnNotifyBegin_105F2A31449A2955C8E09081172F6378 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnNotifyBegin_105F2A31449A2955C8E09081172F6378;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnInterrupted_105F2A31449A2955C8E09081172F6378
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnInterrupted_105F2A31449A2955C8E09081172F6378 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnInterrupted_105F2A31449A2955C8E09081172F6378;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnBlendOut_105F2A31449A2955C8E09081172F6378
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnBlendOut_105F2A31449A2955C8E09081172F6378 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnBlendOut_105F2A31449A2955C8E09081172F6378;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnCompleted_105F2A31449A2955C8E09081172F6378
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnCompleted_105F2A31449A2955C8E09081172F6378 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnCompleted_105F2A31449A2955C8E09081172F6378;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnNotifyEnd_58F6D6A2477FB1AA6BFCE99AA072BE3A
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnNotifyEnd_58F6D6A2477FB1AA6BFCE99AA072BE3A final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnNotifyEnd_58F6D6A2477FB1AA6BFCE99AA072BE3A;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnNotifyBegin_58F6D6A2477FB1AA6BFCE99AA072BE3A
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnNotifyBegin_58F6D6A2477FB1AA6BFCE99AA072BE3A final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnNotifyBegin_58F6D6A2477FB1AA6BFCE99AA072BE3A;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnInterrupted_58F6D6A2477FB1AA6BFCE99AA072BE3A
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnInterrupted_58F6D6A2477FB1AA6BFCE99AA072BE3A final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnInterrupted_58F6D6A2477FB1AA6BFCE99AA072BE3A;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnBlendOut_58F6D6A2477FB1AA6BFCE99AA072BE3A
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnBlendOut_58F6D6A2477FB1AA6BFCE99AA072BE3A final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnBlendOut_58F6D6A2477FB1AA6BFCE99AA072BE3A;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnCompleted_58F6D6A2477FB1AA6BFCE99AA072BE3A
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnCompleted_58F6D6A2477FB1AA6BFCE99AA072BE3A final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnCompleted_58F6D6A2477FB1AA6BFCE99AA072BE3A;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnNotifyEnd_F8AE6AD74AE4D8A81374AFB062B38711
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnNotifyEnd_F8AE6AD74AE4D8A81374AFB062B38711 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnNotifyEnd_F8AE6AD74AE4D8A81374AFB062B38711;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnNotifyBegin_F8AE6AD74AE4D8A81374AFB062B38711
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnNotifyBegin_F8AE6AD74AE4D8A81374AFB062B38711 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnNotifyBegin_F8AE6AD74AE4D8A81374AFB062B38711;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnInterrupted_F8AE6AD74AE4D8A81374AFB062B38711
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnInterrupted_F8AE6AD74AE4D8A81374AFB062B38711 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnInterrupted_F8AE6AD74AE4D8A81374AFB062B38711;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnBlendOut_F8AE6AD74AE4D8A81374AFB062B38711
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnBlendOut_F8AE6AD74AE4D8A81374AFB062B38711 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnBlendOut_F8AE6AD74AE4D8A81374AFB062B38711;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnCompleted_F8AE6AD74AE4D8A81374AFB062B38711
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnCompleted_F8AE6AD74AE4D8A81374AFB062B38711 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnCompleted_F8AE6AD74AE4D8A81374AFB062B38711;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnNotifyEnd_B58669B944316AA214640F82A41C3832
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnNotifyEnd_B58669B944316AA214640F82A41C3832 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnNotifyEnd_B58669B944316AA214640F82A41C3832;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnNotifyBegin_B58669B944316AA214640F82A41C3832
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnNotifyBegin_B58669B944316AA214640F82A41C3832 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnNotifyBegin_B58669B944316AA214640F82A41C3832;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnInterrupted_B58669B944316AA214640F82A41C3832
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnInterrupted_B58669B944316AA214640F82A41C3832 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnInterrupted_B58669B944316AA214640F82A41C3832;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnBlendOut_B58669B944316AA214640F82A41C3832
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnBlendOut_B58669B944316AA214640F82A41C3832 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnBlendOut_B58669B944316AA214640F82A41C3832;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnCompleted_B58669B944316AA214640F82A41C3832
// 0x0008 (0x0008 - 0x0000)
struct BP_girl002a_prop07_R_C_OnCompleted_B58669B944316AA214640F82A41C3832 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnCompleted_B58669B944316AA214640F82A41C3832;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.OnAbilityCastSkill_事件_0
// 0x0020 (0x0020 - 0x0000)
struct BP_girl002a_prop07_R_C_OnAbilityCastSkill_事件_0 final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OriginSkills;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UGameAbilityComponent*                  AbilityRef;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_OnAbilityCastSkill_事件_0;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_girl002a_prop07_R_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_ReceiveTick;

// Function BP_girl002a_prop07_R.BP_girl002a_prop07_R_C.ExecuteUbergraph_BP_girl002a_prop07_R
// 0x0650 (0x0650 - 0x0000)
struct BP_girl002a_prop07_R_C_ExecuteUbergraph_BP_girl002a_prop07_R final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_29;                  // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_28;                  // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_27;                  // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_26;                  // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_25;                  // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   ___name_Variable;                                  // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemManager*                 CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_24;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_23;                  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_22;                  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_21;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_20;                  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   ___name_Variable_1;                                // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_19;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_18;                  // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_17;                  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_11;           // 0x0138(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_16;                  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_12;           // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_15;                  // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_13;           // 0x0168(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   ___name_Variable_2;                                // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_14;           // 0x0180(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_14;                  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_13;                  // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_15;           // 0x01A0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_12;                  // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_16;           // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_11;                  // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_17;           // 0x01D0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_10;                  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_18;           // 0x01E8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   ___name_Variable_3;                                // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_19;           // 0x0200(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_20;           // 0x0220(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_21;           // 0x0238(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_22;           // 0x0250(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_23;           // 0x0268(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   ___name_Variable_4;                                // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_24;           // 0x0280(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_25;           // 0x02A0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_26;           // 0x02B8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_27;           // 0x02D0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_28;           // 0x02E8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   ___name_Variable_5;                                // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SkillID;                        // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_CustomEvent_OriginSkills;                   // 0x0308(0x0010)(ConstParm, ReferenceParm)
	class UGameAbilityComponent*                  K2Node_CustomEvent_AbilityRef;                     // 0x0318(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef)> K2Node_CreateDelegate_OutputDelegate_29; // 0x0324(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A[0x6];                                      // 0x034A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2; // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         CallFunc_GetGameCharacter_ReturnValue;             // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0364(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0378(0x0010)(ReferenceParm)
	struct FCharacterStateStartParam              K2Node_MakeStruct_CharacterStateStartParam;        // 0x0388(0x0100)(ContainsInstancedReference)
	int32                                         CallFunc_StartCharacterStateParam_ReturnValue;     // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetGameCharacter_ReturnValue_1;           // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_GetPiFuGDPL_ReturnValue;                  // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemTemplate                          CallFunc_FindTemplateForID_ReturnValue;            // 0x04A8(0x0140)(ConstParm)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_30;           // 0x05E8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x05F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FA[0x6];                                      // 0x05FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_3; // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_2;                 // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0609(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_60A[0x6];                                      // 0x060A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_4; // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_3;                 // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0619(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61A[0x6];                                      // 0x061A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_5; // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_girl002a_prop07_R_C*               K2Node_DynamicCast_AsABP_Girl_002a_Prop_07_R;      // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0639(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63A[0x2];                                      // 0x063A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_1;                  // 0x063C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x064C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_girl002a_prop07_R_C_ExecuteUbergraph_BP_girl002a_prop07_R;

}

