#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_girl002a_prop06_L

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_girl002a_prop06_L.BP_girl002a_prop06_L_C
// 0x0048 (0x0548 - 0x0500)
class ABP_girl002a_prop06_L_C final : public ACharacterAccessory_Girl002a
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Girl002a_prop06_skm;                               // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ____0______0_518896F7477C2438B368C193DE52724E;     // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____0__Direction_518896F7477C2438B368C193DE52724E; // 0x0514(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_515[0x3];                                      // 0x0515(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     __t_0;                                             // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Num_1;                                             // 0x0520(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524[0x4];                                      // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Skin_GDPL;                                         // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Num_Skin;                                          // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RGB;                                               // 0x0534(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLeave;                                            // 0x0544(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsReachRightPeak;                                  // 0x0545(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsReachLeftPeak;                                   // 0x0546(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnInterrupted_F9DEFACB4FFDC8427D9ED3BE512D4F03(class FName NotifyName);
	void OnBlendOut_F9DEFACB4FFDC8427D9ED3BE512D4F03(class FName NotifyName);
	void OnCompleted_F9DEFACB4FFDC8427D9ED3BE512D4F03(class FName NotifyName);
	void OnNotifyEnd_8876475F4AA86ABB786E45B4B851171B(class FName NotifyName);
	void OnNotifyBegin_8876475F4AA86ABB786E45B4B851171B(class FName NotifyName);
	void OnInterrupted_8876475F4AA86ABB786E45B4B851171B(class FName NotifyName);
	void OnBlendOut_8876475F4AA86ABB786E45B4B851171B(class FName NotifyName);
	void OnCompleted_8876475F4AA86ABB786E45B4B851171B(class FName NotifyName);
	void OnNotifyEnd_499D4BE64983FBD2573A09BFAA0E4E80(class FName NotifyName);
	void OnNotifyBegin_499D4BE64983FBD2573A09BFAA0E4E80(class FName NotifyName);
	void OnInterrupted_499D4BE64983FBD2573A09BFAA0E4E80(class FName NotifyName);
	void OnBlendOut_499D4BE64983FBD2573A09BFAA0E4E80(class FName NotifyName);
	void OnCompleted_499D4BE64983FBD2573A09BFAA0E4E80(class FName NotifyName);
	void OnNotifyEnd_F044D6474798343ED7239CB38DE2FAD0(class FName NotifyName);
	void OnNotifyBegin_F044D6474798343ED7239CB38DE2FAD0(class FName NotifyName);
	void OnInterrupted_F044D6474798343ED7239CB38DE2FAD0(class FName NotifyName);
	void OnBlendOut_F044D6474798343ED7239CB38DE2FAD0(class FName NotifyName);
	void OnCompleted_F044D6474798343ED7239CB38DE2FAD0(class FName NotifyName);
	void OnNotifyEnd_47E0E1EE46D54AABFB249D89E09ACDF3(class FName NotifyName);
	void OnNotifyBegin_47E0E1EE46D54AABFB249D89E09ACDF3(class FName NotifyName);
	void OnInterrupted_47E0E1EE46D54AABFB249D89E09ACDF3(class FName NotifyName);
	void OnBlendOut_47E0E1EE46D54AABFB249D89E09ACDF3(class FName NotifyName);
	void OnCompleted_47E0E1EE46D54AABFB249D89E09ACDF3(class FName NotifyName);
	void OnNotifyEnd_8574364140996A7109A6F192835E00C5(class FName NotifyName);
	void OnNotifyBegin_8574364140996A7109A6F192835E00C5(class FName NotifyName);
	void OnInterrupted_8574364140996A7109A6F192835E00C5(class FName NotifyName);
	void OnBlendOut_8574364140996A7109A6F192835E00C5(class FName NotifyName);
	void OnCompleted_8574364140996A7109A6F192835E00C5(class FName NotifyName);
	void OnAbilityCastSkill____0(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void PlayMontage();
	void AccessoryLeave();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_BP_girl002a_prop06_L(int32 EntryPoint);
	void __t_0__FinishedFunc();
	void __t_0__UpdateFunc();
	void OnNotifyEnd_F9DEFACB4FFDC8427D9ED3BE512D4F03(class FName NotifyName);
	void OnNotifyBegin_F9DEFACB4FFDC8427D9ED3BE512D4F03(class FName NotifyName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_girl002a_prop06_L_C">();
	}
	static class ABP_girl002a_prop06_L_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_girl002a_prop06_L_C>();
	}
};
static_assert(alignof(ABP_girl002a_prop06_L_C) == 0x000008, "Wrong alignment on ABP_girl002a_prop06_L_C");
static_assert(sizeof(ABP_girl002a_prop06_L_C) == 0x000548, "Wrong size on ABP_girl002a_prop06_L_C");
static_assert(offsetof(ABP_girl002a_prop06_L_C, UberGraphFrame) == 0x000500, "Member 'ABP_girl002a_prop06_L_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_girl002a_prop06_L_C, Girl002a_prop06_skm) == 0x000508, "Member 'ABP_girl002a_prop06_L_C::Girl002a_prop06_skm' has a wrong offset!");
static_assert(offsetof(ABP_girl002a_prop06_L_C, ____0______0_518896F7477C2438B368C193DE52724E) == 0x000510, "Member 'ABP_girl002a_prop06_L_C::____0______0_518896F7477C2438B368C193DE52724E' has a wrong offset!");
static_assert(offsetof(ABP_girl002a_prop06_L_C, ____0__Direction_518896F7477C2438B368C193DE52724E) == 0x000514, "Member 'ABP_girl002a_prop06_L_C::____0__Direction_518896F7477C2438B368C193DE52724E' has a wrong offset!");
static_assert(offsetof(ABP_girl002a_prop06_L_C, __t_0) == 0x000518, "Member 'ABP_girl002a_prop06_L_C::__t_0' has a wrong offset!");
static_assert(offsetof(ABP_girl002a_prop06_L_C, Num_1) == 0x000520, "Member 'ABP_girl002a_prop06_L_C::Num_1' has a wrong offset!");
static_assert(offsetof(ABP_girl002a_prop06_L_C, Skin_GDPL) == 0x000528, "Member 'ABP_girl002a_prop06_L_C::Skin_GDPL' has a wrong offset!");
static_assert(offsetof(ABP_girl002a_prop06_L_C, Num_Skin) == 0x000530, "Member 'ABP_girl002a_prop06_L_C::Num_Skin' has a wrong offset!");
static_assert(offsetof(ABP_girl002a_prop06_L_C, RGB) == 0x000534, "Member 'ABP_girl002a_prop06_L_C::RGB' has a wrong offset!");
static_assert(offsetof(ABP_girl002a_prop06_L_C, bLeave) == 0x000544, "Member 'ABP_girl002a_prop06_L_C::bLeave' has a wrong offset!");
static_assert(offsetof(ABP_girl002a_prop06_L_C, IsReachRightPeak) == 0x000545, "Member 'ABP_girl002a_prop06_L_C::IsReachRightPeak' has a wrong offset!");
static_assert(offsetof(ABP_girl002a_prop06_L_C, IsReachLeftPeak) == 0x000546, "Member 'ABP_girl002a_prop06_L_C::IsReachLeftPeak' has a wrong offset!");

}

