#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl014b

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BaseCharacter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Girl014b.BP_Girl014b_C
// 0x0030 (0x2390 - 0x2360)
class ABP_Girl014b_C final : public ABaseCharacter_C
{
public:
	uint8                                         Pad_2355[0x3];                                     // 0x2355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Girl014b_C;                      // 0x2358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSoftObjectPath                        ModifierPrefire;                                   // 0x2360(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UABP_GirlBaseGirl014b_C*                As_ABP_Girl_Base_Girl_014b;                        // 0x2378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverFire;                                          // 0x2380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ShowMax(int32 Phase);
	void ExecuteUbergraph_BP_Girl014b(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Girl014b_C">();
	}
	static class ABP_Girl014b_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Girl014b_C>();
	}
};
static_assert(alignof(ABP_Girl014b_C) == 0x000010, "Wrong alignment on ABP_Girl014b_C");
static_assert(sizeof(ABP_Girl014b_C) == 0x002390, "Wrong size on ABP_Girl014b_C");
static_assert(offsetof(ABP_Girl014b_C, UberGraphFrame_BP_Girl014b_C) == 0x002358, "Member 'ABP_Girl014b_C::UberGraphFrame_BP_Girl014b_C' has a wrong offset!");
static_assert(offsetof(ABP_Girl014b_C, ModifierPrefire) == 0x002360, "Member 'ABP_Girl014b_C::ModifierPrefire' has a wrong offset!");
static_assert(offsetof(ABP_Girl014b_C, As_ABP_Girl_Base_Girl_014b) == 0x002378, "Member 'ABP_Girl014b_C::As_ABP_Girl_Base_Girl_014b' has a wrong offset!");
static_assert(offsetof(ABP_Girl014b_C, OverFire) == 0x002380, "Member 'ABP_Girl014b_C::OverFire' has a wrong offset!");

}

