#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl002

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Girl002.BP_Girl002_C.OnSwitchEnter
// 0x0030 (0x0030 - 0x0000)
struct BP_Girl002_C_OnSwitchEnter final
{
public:
	struct FTransform                             Trans;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Girl002_C_OnSwitchEnter) == 0x000010, "Wrong alignment on BP_Girl002_C_OnSwitchEnter");
static_assert(sizeof(BP_Girl002_C_OnSwitchEnter) == 0x000030, "Wrong size on BP_Girl002_C_OnSwitchEnter");
static_assert(offsetof(BP_Girl002_C_OnSwitchEnter, Trans) == 0x000000, "Member 'BP_Girl002_C_OnSwitchEnter::Trans' has a wrong offset!");

// Function BP_Girl002.BP_Girl002_C.CalcAirplaneCount
// 0x0050 (0x0050 - 0x0000)
struct BP_Girl002_C_CalcAirplaneCount final
{
public:
	int32                                         TmpCount;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGameCharacter*>                 CallFunc_GetAllMembersPtr_ReturnValue;             // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_GetTemplateID_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue;        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Girl002_C_CalcAirplaneCount) == 0x000008, "Wrong alignment on BP_Girl002_C_CalcAirplaneCount");
static_assert(sizeof(BP_Girl002_C_CalcAirplaneCount) == 0x000050, "Wrong size on BP_Girl002_C_CalcAirplaneCount");
static_assert(offsetof(BP_Girl002_C_CalcAirplaneCount, TmpCount) == 0x000000, "Member 'BP_Girl002_C_CalcAirplaneCount::TmpCount' has a wrong offset!");
static_assert(offsetof(BP_Girl002_C_CalcAirplaneCount, ___int_Loop_Counter_Variable) == 0x000004, "Member 'BP_Girl002_C_CalcAirplaneCount::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Girl002_C_CalcAirplaneCount, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_Girl002_C_CalcAirplaneCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_C_CalcAirplaneCount, ___int_Array_Index_Variable) == 0x00000C, "Member 'BP_Girl002_C_CalcAirplaneCount::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Girl002_C_CalcAirplaneCount, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'BP_Girl002_C_CalcAirplaneCount::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_C_CalcAirplaneCount, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_Girl002_C_CalcAirplaneCount::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_C_CalcAirplaneCount, CallFunc_HasAuthority_ReturnValue) == 0x000015, "Member 'BP_Girl002_C_CalcAirplaneCount::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_C_CalcAirplaneCount, CallFunc_IsValid_ReturnValue_1) == 0x000016, "Member 'BP_Girl002_C_CalcAirplaneCount::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_C_CalcAirplaneCount, CallFunc_GetAllMembersPtr_ReturnValue) == 0x000018, "Member 'BP_Girl002_C_CalcAirplaneCount::CallFunc_GetAllMembersPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_C_CalcAirplaneCount, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_Girl002_C_CalcAirplaneCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_C_CalcAirplaneCount, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_Girl002_C_CalcAirplaneCount::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Girl002_C_CalcAirplaneCount, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_Girl002_C_CalcAirplaneCount::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_C_CalcAirplaneCount, CallFunc_IsValid_ReturnValue_2) == 0x000039, "Member 'BP_Girl002_C_CalcAirplaneCount::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Girl002_C_CalcAirplaneCount, CallFunc_GetTemplateID_ReturnValue) == 0x000040, "Member 'BP_Girl002_C_CalcAirplaneCount::CallFunc_GetTemplateID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_C_CalcAirplaneCount, CallFunc_EqualEqual_Int64Int64_ReturnValue) == 0x000048, "Member 'BP_Girl002_C_CalcAirplaneCount::CallFunc_EqualEqual_Int64Int64_ReturnValue' has a wrong offset!");

// Function BP_Girl002.BP_Girl002_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Girl002_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl002_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Girl002_C_ReceiveTick");
static_assert(sizeof(BP_Girl002_C_ReceiveTick) == 0x000004, "Wrong size on BP_Girl002_C_ReceiveTick");
static_assert(offsetof(BP_Girl002_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Girl002_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Girl002.BP_Girl002_C.OnSwitchLeave
// 0x0030 (0x0030 - 0x0000)
struct BP_Girl002_C_OnSwitchLeave final
{
public:
	struct FTransform                             Trans;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Girl002_C_OnSwitchLeave) == 0x000010, "Wrong alignment on BP_Girl002_C_OnSwitchLeave");
static_assert(sizeof(BP_Girl002_C_OnSwitchLeave) == 0x000030, "Wrong size on BP_Girl002_C_OnSwitchLeave");
static_assert(offsetof(BP_Girl002_C_OnSwitchLeave, Trans) == 0x000000, "Member 'BP_Girl002_C_OnSwitchLeave::Trans' has a wrong offset!");

// Function BP_Girl002.BP_Girl002_C.ExecuteUbergraph_BP_Girl002
// 0x0070 (0x0070 - 0x0000)
struct BP_Girl002_C_ExecuteUbergraph_BP_Girl002 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Event_Trans_1;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             K2Node_Event_Trans;                                // 0x0040(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Girl002_C_ExecuteUbergraph_BP_Girl002) == 0x000010, "Wrong alignment on BP_Girl002_C_ExecuteUbergraph_BP_Girl002");
static_assert(sizeof(BP_Girl002_C_ExecuteUbergraph_BP_Girl002) == 0x000070, "Wrong size on BP_Girl002_C_ExecuteUbergraph_BP_Girl002");
static_assert(offsetof(BP_Girl002_C_ExecuteUbergraph_BP_Girl002, EntryPoint) == 0x000000, "Member 'BP_Girl002_C_ExecuteUbergraph_BP_Girl002::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Girl002_C_ExecuteUbergraph_BP_Girl002, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_Girl002_C_ExecuteUbergraph_BP_Girl002::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Girl002_C_ExecuteUbergraph_BP_Girl002, K2Node_Event_Trans_1) == 0x000010, "Member 'BP_Girl002_C_ExecuteUbergraph_BP_Girl002::K2Node_Event_Trans_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_C_ExecuteUbergraph_BP_Girl002, K2Node_Event_Trans) == 0x000040, "Member 'BP_Girl002_C_ExecuteUbergraph_BP_Girl002::K2Node_Event_Trans' has a wrong offset!");

}

