#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_girl002a_prop07_R

#include "Basic.hpp"

#include "Game_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_girl002a_prop07_R.BP_girl002a_prop07_R_C
// 0x0048 (0x0550 - 0x0508)
class ABP_girl002a_prop07_R_C final : public ACharacterAccessory_Girl002a
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 girl002a_prop07_skm;                               // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ____0______0_FCE021A14FD5DCC9EA4061A9C55FDF00;     // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____0__Direction_FCE021A14FD5DCC9EA4061A9C55FDF00; // 0x051C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51D[0x3];                                      // 0x051D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_0;                                          // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Num_1;                                             // 0x0528(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52C[0x4];                                      // 0x052C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         skin_GDPL;                                         // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Num_Skin;                                          // 0x0538(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RGB;                                               // 0x053C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLeave;                                            // 0x054C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsReachRightPeak;                                  // 0x054D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsReachLeftPeak;                                   // 0x054E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void 时间轴_0__FinishedFunc();
	void 时间轴_0__UpdateFunc();
	void OnNotifyEnd_56AB6F724029C72D37D0FCBD2C3C9D74(class FName NotifyName);
	void OnNotifyBegin_56AB6F724029C72D37D0FCBD2C3C9D74(class FName NotifyName);
	void OnInterrupted_56AB6F724029C72D37D0FCBD2C3C9D74(class FName NotifyName);
	void OnBlendOut_56AB6F724029C72D37D0FCBD2C3C9D74(class FName NotifyName);
	void OnCompleted_56AB6F724029C72D37D0FCBD2C3C9D74(class FName NotifyName);
	void OnNotifyEnd_721F9AA4472937428D5C42A92827138D(class FName NotifyName);
	void OnNotifyBegin_721F9AA4472937428D5C42A92827138D(class FName NotifyName);
	void OnInterrupted_721F9AA4472937428D5C42A92827138D(class FName NotifyName);
	void OnBlendOut_721F9AA4472937428D5C42A92827138D(class FName NotifyName);
	void OnCompleted_721F9AA4472937428D5C42A92827138D(class FName NotifyName);
	void OnNotifyEnd_105F2A31449A2955C8E09081172F6378(class FName NotifyName);
	void OnNotifyBegin_105F2A31449A2955C8E09081172F6378(class FName NotifyName);
	void OnInterrupted_105F2A31449A2955C8E09081172F6378(class FName NotifyName);
	void OnBlendOut_105F2A31449A2955C8E09081172F6378(class FName NotifyName);
	void OnCompleted_105F2A31449A2955C8E09081172F6378(class FName NotifyName);
	void OnNotifyEnd_58F6D6A2477FB1AA6BFCE99AA072BE3A(class FName NotifyName);
	void OnNotifyBegin_58F6D6A2477FB1AA6BFCE99AA072BE3A(class FName NotifyName);
	void OnInterrupted_58F6D6A2477FB1AA6BFCE99AA072BE3A(class FName NotifyName);
	void OnBlendOut_58F6D6A2477FB1AA6BFCE99AA072BE3A(class FName NotifyName);
	void OnCompleted_58F6D6A2477FB1AA6BFCE99AA072BE3A(class FName NotifyName);
	void OnNotifyEnd_F8AE6AD74AE4D8A81374AFB062B38711(class FName NotifyName);
	void OnNotifyBegin_F8AE6AD74AE4D8A81374AFB062B38711(class FName NotifyName);
	void OnInterrupted_F8AE6AD74AE4D8A81374AFB062B38711(class FName NotifyName);
	void OnBlendOut_F8AE6AD74AE4D8A81374AFB062B38711(class FName NotifyName);
	void OnCompleted_F8AE6AD74AE4D8A81374AFB062B38711(class FName NotifyName);
	void OnNotifyEnd_B58669B944316AA214640F82A41C3832(class FName NotifyName);
	void OnNotifyBegin_B58669B944316AA214640F82A41C3832(class FName NotifyName);
	void OnInterrupted_B58669B944316AA214640F82A41C3832(class FName NotifyName);
	void OnBlendOut_B58669B944316AA214640F82A41C3832(class FName NotifyName);
	void OnCompleted_B58669B944316AA214640F82A41C3832(class FName NotifyName);
	void OnAbilityCastSkill_事件_0(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void PlayMontage();
	void AccessoryLeave();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_BP_girl002a_prop07_R(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_girl002a_prop07_R_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_girl002a_prop07_R_C")
	}
	static class ABP_girl002a_prop07_R_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_girl002a_prop07_R_C>();
	}
};
DUMPER7_ASSERTS_ABP_girl002a_prop07_R_C;

}

