#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl014b

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Girl014b.BP_Girl014b_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Girl014b_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl014b_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Girl014b_C_ReceiveTick");
static_assert(sizeof(BP_Girl014b_C_ReceiveTick) == 0x000004, "Wrong size on BP_Girl014b_C_ReceiveTick");
static_assert(offsetof(BP_Girl014b_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Girl014b_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Girl014b.BP_Girl014b_C.ShowMax
// 0x0004 (0x0004 - 0x0000)
struct BP_Girl014b_C_ShowMax final
{
public:
	int32                                         Phase;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl014b_C_ShowMax) == 0x000004, "Wrong alignment on BP_Girl014b_C_ShowMax");
static_assert(sizeof(BP_Girl014b_C_ShowMax) == 0x000004, "Wrong size on BP_Girl014b_C_ShowMax");
static_assert(offsetof(BP_Girl014b_C_ShowMax, Phase) == 0x000000, "Member 'BP_Girl014b_C_ShowMax::Phase' has a wrong offset!");

// Function BP_Girl014b.BP_Girl014b_C.ExecuteUbergraph_BP_Girl014b
// 0x0060 (0x0060 - 0x0000)
struct BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Phase)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Phase;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsModifierExist_ReturnValue;              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerWeapon*                          CallFunc_GetWeapon_ReturnValue;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetGameAnimInstance_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMesh_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_GirlBaseGirl014b_C*                K2Node_DynamicCast_AsABP_Girl_Base_Girl_014b;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnNiagaraAttachedPath_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerWeapon_Bow*                      K2Node_DynamicCast_AsPlayer_Weapon_Bow;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b) == 0x000008, "Wrong alignment on BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b");
static_assert(sizeof(BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b) == 0x000060, "Wrong size on BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b");
static_assert(offsetof(BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b, EntryPoint) == 0x000000, "Member 'BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b, K2Node_CustomEvent_Phase) == 0x000018, "Member 'BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b::K2Node_CustomEvent_Phase' has a wrong offset!");
static_assert(offsetof(BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b, CallFunc_IsModifierExist_ReturnValue) == 0x00001C, "Member 'BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b::CallFunc_IsModifierExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00001D, "Member 'BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00001E, "Member 'BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00001F, "Member 'BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b, CallFunc_GetWeapon_ReturnValue) == 0x000020, "Member 'BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b, CallFunc_GetGameAnimInstance_ReturnValue) == 0x000028, "Member 'BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b::CallFunc_GetGameAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b, CallFunc_GetSkeletalMesh_ReturnValue) == 0x000030, "Member 'BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b::CallFunc_GetSkeletalMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b, K2Node_DynamicCast_AsABP_Girl_Base_Girl_014b) == 0x000038, "Member 'BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b::K2Node_DynamicCast_AsABP_Girl_Base_Girl_014b' has a wrong offset!");
static_assert(offsetof(BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b, CallFunc_SpawnNiagaraAttachedPath_ReturnValue) == 0x000048, "Member 'BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b::CallFunc_SpawnNiagaraAttachedPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b, K2Node_DynamicCast_AsPlayer_Weapon_Bow) == 0x000050, "Member 'BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b::K2Node_DynamicCast_AsPlayer_Weapon_Bow' has a wrong offset!");
static_assert(offsetof(BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BP_Girl014b_C_ExecuteUbergraph_BP_Girl014b::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

