#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl004b

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Engine_structs.hpp"
#include "BaseCharacter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Girl004b.BP_Girl004b_C
// 0x06D0 (0x2B20 - 0x2450)
class ABP_Girl004b_C final : public ABaseCharacter_C
{
public:
	uint8                                         Pad_2445[0x3];                                     // 0x2445(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Girl004b_C;                      // 0x2448(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FString                                 NewVar_0;                                          // 0x2450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          End;                                               // 0x2460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSpecialReload;                                   // 0x2461(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bSkill01_0;                                        // 0x2462(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2463[0x5];                                     // 0x2463(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraInfo                            Special_Shoot_Fire_Camera_Info;                    // 0x2468(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FCameraInfo                            Special_Shoot_Normal_Camera_Info;                  // 0x2558(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FCameraInfo                            Special_Shoot_Normal_Camera_Info_Start_Motionless; // 0x2648(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FCameraInfo                            SpecialShootNormalCameraInfo_start01;              // 0x2738(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FCameraInfo                            SpecialShootNormalCameraInfo_start02;              // 0x2828(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FCameraInfo                            SpecialShootNormalCameraInfo_start03;              // 0x2918(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FCameraInfo                            Special_Shoot_Aim_Camera_Info;                     // 0x2A08(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CurrentSkillId;                                    // 0x2AF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NeedRecoverModifierOverlaid;                       // 0x2AFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 AttributeName;                                     // 0x2B00(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         AttributeValue;                                    // 0x2B10(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Initialize;                                        // 0x2B14(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	TArray<struct FSoftObjectPath> OnGetAssetPath_01(TArray<int32>& CharacterIDs, TArray<int32>& SkillIDs, TArray<int32>& ModifierIDs, TArray<int32>& EmitterIDs);
	void EnableSpecialShoot(bool bEnable, int32 OverrideRecoilID);
	void Multicast_EnableSpecialShoot(bool bEnable, int32 OverrideRecoilID);
	void ReceiveBeginPlay();
	void NotifyRefreshPlayerSkinMesh(int32 SkinTemplateID, int32 SkinLevel);
	void OnAbilityCast(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void ReInitRecoverAttribute();
	void ReInitSaveAttribute();
	void RunServerAttributeChange(const class FString& AttributeName_0, float AttributeValue_0);
	void OnAppliedModifierChange_Event_0(int32 ModifierID, bool IsApply);
	void CustomEvent_0(const class APlayerWeapon* InCurWeapon);
	void ReceiveTick(float DeltaSeconds);
	void OnClearModifierKeepEffect();
	void ExecuteUbergraph_BP_Girl004b(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Girl004b_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Girl004b_C")
	}
	static class ABP_Girl004b_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Girl004b_C>();
	}
};
DUMPER7_ASSERTS_ABP_Girl004b_C;

}

