#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl002_Prop02_New

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// LuaFunction BP_Girl002_Prop02_New.BP_Girl002_Prop02_New_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Girl002_Prop02_New_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl002_Prop02_New_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Girl002_Prop02_New_C_ReceiveTick");
static_assert(sizeof(BP_Girl002_Prop02_New_C_ReceiveTick) == 0x000004, "Wrong size on BP_Girl002_Prop02_New_C_ReceiveTick");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Girl002_Prop02_New_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Girl002_Prop02_New.BP_Girl002_Prop02_New_C.Cast Skill
// 0x0020 (0x0020 - 0x0000)
struct BP_Girl002_Prop02_New_C_Cast_Skill final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OriginSkills;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UGameAbilityComponent*                  AbilityRef;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl002_Prop02_New_C_Cast_Skill) == 0x000008, "Wrong alignment on BP_Girl002_Prop02_New_C_Cast_Skill");
static_assert(sizeof(BP_Girl002_Prop02_New_C_Cast_Skill) == 0x000020, "Wrong size on BP_Girl002_Prop02_New_C_Cast_Skill");
static_assert(offsetof(BP_Girl002_Prop02_New_C_Cast_Skill, SkillID) == 0x000000, "Member 'BP_Girl002_Prop02_New_C_Cast_Skill::SkillID' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_Cast_Skill, OriginSkills) == 0x000008, "Member 'BP_Girl002_Prop02_New_C_Cast_Skill::OriginSkills' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_Cast_Skill, AbilityRef) == 0x000018, "Member 'BP_Girl002_Prop02_New_C_Cast_Skill::AbilityRef' has a wrong offset!");

// Function BP_Girl002_Prop02_New.BP_Girl002_Prop02_New_C.ExecuteUbergraph_BP_Girl002_Prop02_New
// 0x0520 (0x0520 - 0x0000)
struct BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAvailableSkill*>                CallFunc_AddSkill_ReturnValue;                     // 0x0008(0x0010)(ReferenceParm)
	float                                         ___float_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_1;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_2;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_3;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_4;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SkillID, TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef)> K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   ___name_Variable;                                  // 0x003C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ___name_Variable_1;                                // 0x004C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class UMovementComponent_WednesdayDrone*      K2Node_DynamicCast_AsMovement_Component_Wednesday_Drone; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AngleBetweenVectors_ReturnValue;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_DegCos_ReturnValue;                       // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_5;                               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameAIController*                      K2Node_DynamicCast_AsGame_AIController;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMin_ReturnValue;                         // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsState_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SkillID_1;                      // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_CustomEvent_OriginSkills_1;                 // 0x00E0(0x0010)(ConstParm, ReferenceParm)
	class UGameAbilityComponent*                  K2Node_CustomEvent_AbilityRef_1;                   // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0190(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddActorLocalTransform_SweepHitResult; // 0x01C4(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAIController*                      K2Node_DynamicCast_AsGame_AIController_1;          // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetSceneTarget_ReturnValue;               // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SkillID;                        // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_CustomEvent_OriginSkills;                   // 0x0290(0x0010)(ConstParm, ReferenceParm)
	class UGameAbilityComponent*                  K2Node_CustomEvent_AbilityRef;                     // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAITeamSlot*                            K2Node_DynamicCast_AsAITeam_Slot;                  // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x02C0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x02F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x02FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0xC];                                      // 0x0314(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0320(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0350(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x03DC(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0469(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x046A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46B[0x5];                                      // 0x046B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetCaptain_ReturnValue;                   // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Girl002_C*                          K2Node_DynamicCast_AsBP_Girl_002;                  // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsImmortal_ReturnValue;                   // 0x0481(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_482[0x2];                                      // 0x0482(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_489[0x3];                                      // 0x0489(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_AnimIndex;                            // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0492(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_493[0x1];                                      // 0x0493(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Variable;                                   // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomFloatValue                      K2Node_MakeStruct_RandomFloatValue;                // 0x049C(0x000C)(NoDestructor)
	class UWwiseComponent*                        CallFunc_PostEventAttachedActor_ReturnValue;       // 0x04A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAvailableSkill*>                CallFunc_AddSkill_ReturnValue_1;                   // 0x04B8(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x04C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetCaptain_ReturnValue_1;                 // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsModifierExist_ReturnValue;              // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetSummonedOwner_ReturnValue;             // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F1[0x7];                                      // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Girl002_C*                          K2Node_DynamicCast_AsBP_Girl_002_1;                // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_501[0x3];                                      // 0x0501(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0504(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsModifierExist_ReturnValue_1;            // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_511[0x3];                                      // 0x0511(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeModifier_ReturnValue;                 // 0x0514(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsModifierExist_ReturnValue_2;            // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New) == 0x000010, "Wrong alignment on BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New");
static_assert(sizeof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New) == 0x000520, "Wrong size on BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, EntryPoint) == 0x000000, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_AddSkill_ReturnValue) == 0x000008, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_AddSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, ___float_Variable) == 0x000018, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::___float_Variable' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, ___float_Variable_1) == 0x00001C, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::___float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, ___float_Variable_2) == 0x000020, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::___float_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, ___float_Variable_3) == 0x000024, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::___float_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, ___float_Variable_4) == 0x000028, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::___float_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, ___name_Variable) == 0x00003C, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::___name_Variable' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000044, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_Abs_ReturnValue) == 0x000048, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, ___name_Variable_1) == 0x00004C, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::___name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000054, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_DynamicCast_AsMovement_Component_Wednesday_Drone) == 0x000068, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_DynamicCast_AsMovement_Component_Wednesday_Drone' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_RandomFloatInRange_ReturnValue) == 0x000074, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_VSize_ReturnValue) == 0x000078, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_Less_FloatFloat_ReturnValue) == 0x00007C, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000080, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000084, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_GetActorRightVector_ReturnValue) == 0x000088, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_VSize_ReturnValue_1) == 0x000094, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_AngleBetweenVectors_ReturnValue) == 0x000098, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_AngleBetweenVectors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x00009C, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_DegCos_ReturnValue) == 0x0000A0, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_DegCos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000A4, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, ___float_Variable_5) == 0x0000A8, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::___float_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_Abs_ReturnValue_1) == 0x0000AC, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000B0, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0000B4, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_GetController_ReturnValue) == 0x0000B8, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_DynamicCast_AsGame_AIController) == 0x0000C0, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_DynamicCast_AsGame_AIController' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_FMin_ReturnValue) == 0x0000CC, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_IsState_ReturnValue) == 0x0000D0, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_IsState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000D4, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0000D8, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_CustomEvent_SkillID_1) == 0x0000DC, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_CustomEvent_SkillID_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_CustomEvent_OriginSkills_1) == 0x0000E0, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_CustomEvent_OriginSkills_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_CustomEvent_AbilityRef_1) == 0x0000F0, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_CustomEvent_AbilityRef_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000F8, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000104, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000108, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000114, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000118, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_GetRightVector_ReturnValue) == 0x00011C, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_Normal_ReturnValue) == 0x000128, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_GetUpVector_ReturnValue) == 0x000134, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_Normal_ReturnValue_1) == 0x000140, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x00014C, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x000158, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_Add_VectorVector_ReturnValue) == 0x000164, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_Add_FloatFloat_ReturnValue) == 0x000170, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_Multiply_VectorFloat_ReturnValue_3) == 0x000174, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_Multiply_VectorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000180, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000190, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001C0, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_K2_AddActorLocalTransform_SweepHitResult) == 0x0001C4, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_K2_AddActorLocalTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_GetControlRotation_ReturnValue) == 0x000250, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_GetController_ReturnValue_1) == 0x000260, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_GetController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_Array_RemoveItem_ReturnValue) == 0x000268, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_DynamicCast_AsGame_AIController_1) == 0x000270, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_DynamicCast_AsGame_AIController_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_DynamicCast_bSuccess_2) == 0x000278, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_Array_AddUnique_ReturnValue) == 0x00027C, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_GetSceneTarget_ReturnValue) == 0x000280, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_GetSceneTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_CustomEvent_SkillID) == 0x000288, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_CustomEvent_SkillID' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_CustomEvent_OriginSkills) == 0x000290, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_CustomEvent_OriginSkills' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_CustomEvent_AbilityRef) == 0x0002A0, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_CustomEvent_AbilityRef' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_IsValid_ReturnValue) == 0x0002A8, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0002A9, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_DynamicCast_AsAITeam_Slot) == 0x0002B0, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_DynamicCast_AsAITeam_Slot' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_DynamicCast_bSuccess_3) == 0x0002B8, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_GetTransform_ReturnValue) == 0x0002C0, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_BreakTransform_Location) == 0x0002F0, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_BreakTransform_Rotation) == 0x0002FC, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_BreakTransform_Scale) == 0x000308, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_MakeTransform_ReturnValue) == 0x000320, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000350, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x0003DC, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000468, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, ___bool_Has_Been_Initd_Variable) == 0x000469, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_IsValid_ReturnValue_1) == 0x00046A, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_GetCaptain_ReturnValue) == 0x000470, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_GetCaptain_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_DynamicCast_AsBP_Girl_002) == 0x000478, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_DynamicCast_AsBP_Girl_002' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_DynamicCast_bSuccess_4) == 0x000480, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_IsImmortal_ReturnValue) == 0x000481, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_IsImmortal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_Event_DeltaSeconds) == 0x000484, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_BooleanAND_ReturnValue) == 0x000488, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_Event_AnimIndex) == 0x00048C, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_Event_AnimIndex' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_SwitchInteger_CmpSuccess) == 0x000490, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, ___bool_IsClosed_Variable) == 0x000491, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_HasAuthority_ReturnValue) == 0x000492, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, ___int_Variable) == 0x000494, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::___int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_Select_Default) == 0x000498, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_MakeStruct_RandomFloatValue) == 0x00049C, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_MakeStruct_RandomFloatValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_PostEventAttachedActor_ReturnValue) == 0x0004A8, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_PostEventAttachedActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_Event_EndPlayReason) == 0x0004B0, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_AddSkill_ReturnValue_1) == 0x0004B8, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_AddSkill_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0004C8, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_GetCaptain_ReturnValue_1) == 0x0004D8, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_GetCaptain_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_IsModifierExist_ReturnValue) == 0x0004E0, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_IsModifierExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_GetSummonedOwner_ReturnValue) == 0x0004E8, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_GetSummonedOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_IsValid_ReturnValue_2) == 0x0004F0, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_DynamicCast_AsBP_Girl_002_1) == 0x0004F8, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_DynamicCast_AsBP_Girl_002_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, K2Node_DynamicCast_bSuccess_5) == 0x000500, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000504, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_IsModifierExist_ReturnValue_1) == 0x000510, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_IsModifierExist_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_MakeModifier_ReturnValue) == 0x000514, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_MakeModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New, CallFunc_IsModifierExist_ReturnValue_2) == 0x000518, "Member 'BP_Girl002_Prop02_New_C_ExecuteUbergraph_BP_Girl002_Prop02_New::CallFunc_IsModifierExist_ReturnValue_2' has a wrong offset!");

// Function BP_Girl002_Prop02_New.BP_Girl002_Prop02_New_C.Skill 2
// 0x0020 (0x0020 - 0x0000)
struct BP_Girl002_Prop02_New_C_Skill_2 final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OriginSkills;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UGameAbilityComponent*                  AbilityRef;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl002_Prop02_New_C_Skill_2) == 0x000008, "Wrong alignment on BP_Girl002_Prop02_New_C_Skill_2");
static_assert(sizeof(BP_Girl002_Prop02_New_C_Skill_2) == 0x000020, "Wrong size on BP_Girl002_Prop02_New_C_Skill_2");
static_assert(offsetof(BP_Girl002_Prop02_New_C_Skill_2, SkillID) == 0x000000, "Member 'BP_Girl002_Prop02_New_C_Skill_2::SkillID' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_Skill_2, OriginSkills) == 0x000008, "Member 'BP_Girl002_Prop02_New_C_Skill_2::OriginSkills' has a wrong offset!");
static_assert(offsetof(BP_Girl002_Prop02_New_C_Skill_2, AbilityRef) == 0x000018, "Member 'BP_Girl002_Prop02_New_C_Skill_2::AbilityRef' has a wrong offset!");

// Function BP_Girl002_Prop02_New.BP_Girl002_Prop02_New_C.ReceiveTick__Overridden
// 0x0004 (0x0004 - 0x0000)
struct BP_Girl002_Prop02_New_C_ReceiveTick__Overridden final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl002_Prop02_New_C_ReceiveTick__Overridden) == 0x000004, "Wrong alignment on BP_Girl002_Prop02_New_C_ReceiveTick__Overridden");
static_assert(sizeof(BP_Girl002_Prop02_New_C_ReceiveTick__Overridden) == 0x000004, "Wrong size on BP_Girl002_Prop02_New_C_ReceiveTick__Overridden");
static_assert(offsetof(BP_Girl002_Prop02_New_C_ReceiveTick__Overridden, DeltaSeconds) == 0x000000, "Member 'BP_Girl002_Prop02_New_C_ReceiveTick__Overridden::DeltaSeconds' has a wrong offset!");

// Function BP_Girl002_Prop02_New.BP_Girl002_Prop02_New_C.HandleEnterAnimIndex
// 0x0004 (0x0004 - 0x0000)
struct BP_Girl002_Prop02_New_C_HandleEnterAnimIndex final
{
public:
	int32                                         AnimIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl002_Prop02_New_C_HandleEnterAnimIndex) == 0x000004, "Wrong alignment on BP_Girl002_Prop02_New_C_HandleEnterAnimIndex");
static_assert(sizeof(BP_Girl002_Prop02_New_C_HandleEnterAnimIndex) == 0x000004, "Wrong size on BP_Girl002_Prop02_New_C_HandleEnterAnimIndex");
