#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl015

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_Girl015.BP_Girl015_C.OnGetAssetPath
// 0x00E0 (0x00E0 - 0x0000)
struct BP_Girl015_C_OnGetAssetPath final
{
public:
	TArray<int32>                                 CharacterIDs;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 SkillIDs;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 ModifierIDs;                                       // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 EmitterIDs;                                        // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FSoftObjectPath>                ReturnValue;                                       // 0x0040(0x0010)(Parm, OutParm, ReturnParm)
	TArray<struct FSoftObjectPath>                OutPaths;                                          // 0x0050(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_2;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_3;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_4;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_5;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_6;            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_7;            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_8;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_9;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_10;           // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_11;           // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_12;           // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_13;           // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_14;           // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_15;           // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_16;           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_17;           // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_18;           // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_19;           // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_20;           // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_21;           // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_22;           // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_23;           // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_24;           // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_25;           // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_26;           // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_27;           // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_28;           // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_29;           // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_30;           // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_31;           // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_C_OnGetAssetPath) == 0x000008, "Wrong alignment on BP_Girl015_C_OnGetAssetPath");
static_assert(sizeof(BP_Girl015_C_OnGetAssetPath) == 0x0000E0, "Wrong size on BP_Girl015_C_OnGetAssetPath");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CharacterIDs) == 0x000000, "Member 'BP_Girl015_C_OnGetAssetPath::CharacterIDs' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, SkillIDs) == 0x000010, "Member 'BP_Girl015_C_OnGetAssetPath::SkillIDs' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, ModifierIDs) == 0x000020, "Member 'BP_Girl015_C_OnGetAssetPath::ModifierIDs' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, EmitterIDs) == 0x000030, "Member 'BP_Girl015_C_OnGetAssetPath::EmitterIDs' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, ReturnValue) == 0x000040, "Member 'BP_Girl015_C_OnGetAssetPath::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, OutPaths) == 0x000050, "Member 'BP_Girl015_C_OnGetAssetPath::OutPaths' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue) == 0x000060, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000064, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_2) == 0x000068, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_3) == 0x00006C, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_4) == 0x000070, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_5) == 0x000074, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_6) == 0x000078, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_7) == 0x00007C, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_8) == 0x000080, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_9) == 0x000084, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_10) == 0x000088, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_11) == 0x00008C, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_12) == 0x000090, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_13) == 0x000094, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_14) == 0x000098, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_15) == 0x00009C, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_16) == 0x0000A0, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_17) == 0x0000A4, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_18) == 0x0000A8, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_19) == 0x0000AC, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_20) == 0x0000B0, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_21) == 0x0000B4, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_22) == 0x0000B8, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_23) == 0x0000BC, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_24) == 0x0000C0, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_25) == 0x0000C4, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_26) == 0x0000C8, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_27) == 0x0000CC, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_27' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_28) == 0x0000D0, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_28' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_29) == 0x0000D4, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_29' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_30) == 0x0000D8, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_30' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue_31) == 0x0000DC, "Member 'BP_Girl015_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue_31' has a wrong offset!");

// Function BP_Girl015.BP_Girl015_C.SkillEnd
// 0x0004 (0x0004 - 0x0000)
struct BP_Girl015_C_SkillEnd final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_C_SkillEnd) == 0x000004, "Wrong alignment on BP_Girl015_C_SkillEnd");
static_assert(sizeof(BP_Girl015_C_SkillEnd) == 0x000004, "Wrong size on BP_Girl015_C_SkillEnd");
static_assert(offsetof(BP_Girl015_C_SkillEnd, SkillID) == 0x000000, "Member 'BP_Girl015_C_SkillEnd::SkillID' has a wrong offset!");

// Function BP_Girl015.BP_Girl015_C.EnableSpecialShoot
// 0x0001 (0x0001 - 0x0000)
struct BP_Girl015_C_EnableSpecialShoot final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Girl015_C_EnableSpecialShoot) == 0x000001, "Wrong alignment on BP_Girl015_C_EnableSpecialShoot");
static_assert(sizeof(BP_Girl015_C_EnableSpecialShoot) == 0x000001, "Wrong size on BP_Girl015_C_EnableSpecialShoot");
static_assert(offsetof(BP_Girl015_C_EnableSpecialShoot, bEnable) == 0x000000, "Member 'BP_Girl015_C_EnableSpecialShoot::bEnable' has a wrong offset!");

// Function BP_Girl015.BP_Girl015_C.Multicast_EnableSpecialShoot
// 0x0001 (0x0001 - 0x0000)
struct BP_Girl015_C_Multicast_EnableSpecialShoot final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Girl015_C_Multicast_EnableSpecialShoot) == 0x000001, "Wrong alignment on BP_Girl015_C_Multicast_EnableSpecialShoot");
static_assert(sizeof(BP_Girl015_C_Multicast_EnableSpecialShoot) == 0x000001, "Wrong size on BP_Girl015_C_Multicast_EnableSpecialShoot");
static_assert(offsetof(BP_Girl015_C_Multicast_EnableSpecialShoot, bEnable) == 0x000000, "Member 'BP_Girl015_C_Multicast_EnableSpecialShoot::bEnable' has a wrong offset!");

// Function BP_Girl015.BP_Girl015_C.SkillStart
// 0x0020 (0x0020 - 0x0000)
struct BP_Girl015_C_SkillStart final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OriginSkills;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UGameAbilityComponent*                  AbilityRef;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_C_SkillStart) == 0x000008, "Wrong alignment on BP_Girl015_C_SkillStart");
static_assert(sizeof(BP_Girl015_C_SkillStart) == 0x000020, "Wrong size on BP_Girl015_C_SkillStart");
static_assert(offsetof(BP_Girl015_C_SkillStart, SkillID) == 0x000000, "Member 'BP_Girl015_C_SkillStart::SkillID' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_SkillStart, OriginSkills) == 0x000008, "Member 'BP_Girl015_C_SkillStart::OriginSkills' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_SkillStart, AbilityRef) == 0x000018, "Member 'BP_Girl015_C_SkillStart::AbilityRef' has a wrong offset!");

// Function BP_Girl015.BP_Girl015_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Girl015_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Girl015_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Girl015_C_ReceiveEndPlay");
static_assert(sizeof(BP_Girl015_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Girl015_C_ReceiveEndPlay");
static_assert(offsetof(BP_Girl015_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Girl015_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_Girl015.BP_Girl015_C.OnCharacterFire
// 0x0048 (0x0048 - 0x0000)
struct BP_Girl015_C_OnCharacterFire final
{
public:
	struct FFireInfo                              FireInfo;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          bStartFire;                                        // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Girl015_C_OnCharacterFire) == 0x000008, "Wrong alignment on BP_Girl015_C_OnCharacterFire");
static_assert(sizeof(BP_Girl015_C_OnCharacterFire) == 0x000048, "Wrong size on BP_Girl015_C_OnCharacterFire");
static_assert(offsetof(BP_Girl015_C_OnCharacterFire, FireInfo) == 0x000000, "Member 'BP_Girl015_C_OnCharacterFire::FireInfo' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_OnCharacterFire, bStartFire) == 0x000040, "Member 'BP_Girl015_C_OnCharacterFire::bStartFire' has a wrong offset!");

// Function BP_Girl015.BP_Girl015_C.ExecuteUbergraph_BP_Girl015
// 0x00E0 (0x00E0 - 0x0000)
struct BP_Girl015_C_ExecuteUbergraph_BP_Girl015 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterAccessory*                    CallFunc_GetAccessoryByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterAccessory*                    CallFunc_GetAccessoryByClass_ReturnValue_1;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_SkillID_1;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterAccessory*                    CallFunc_GetAccessoryByClass_ReturnValue_2;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bEnable_1;                      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bEnable;                        // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance_Girl015*                  K2Node_DynamicCast_AsAnim_Instance_Girl_015;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCastingSkillIDInAnim_ReturnValue;      // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_SkillID;                        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_CustomEvent_OriginSkills;                   // 0x0050(0x0010)(ConstParm, ReferenceParm)
	class UGameAbilityComponent*                  K2Node_CustomEvent_AbilityRef;                     // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FFireInfo& FireInfo, bool bStartFire)> K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFireInfo                              K2Node_CustomEvent_FireInfo;                       // 0x0088(0x0040)(NoDestructor)
	bool                                          K2Node_CustomEvent_bStartFire;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerWeapon*                          CallFunc_GetWeapon_ReturnValue;                    // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Girl015_C_ExecuteUbergraph_BP_Girl015) == 0x000008, "Wrong alignment on BP_Girl015_C_ExecuteUbergraph_BP_Girl015");
static_assert(sizeof(BP_Girl015_C_ExecuteUbergraph_BP_Girl015) == 0x0000E0, "Wrong size on BP_Girl015_C_ExecuteUbergraph_BP_Girl015");
static_assert(offsetof(BP_Girl015_C_ExecuteUbergraph_BP_Girl015, EntryPoint) == 0x000000, "Member 'BP_Girl015_C_ExecuteUbergraph_BP_Girl015::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_ExecuteUbergraph_BP_Girl015, CallFunc_GetAccessoryByClass_ReturnValue) == 0x000008, "Member 'BP_Girl015_C_ExecuteUbergraph_BP_Girl015::CallFunc_GetAccessoryByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Girl015_C_ExecuteUbergraph_BP_Girl015, CallFunc_GetAccessoryByClass_ReturnValue_1) == 0x000010, "Member 'BP_Girl015_C_ExecuteUbergraph_BP_Girl015::CallFunc_GetAccessoryByClass_ReturnValue_1' has a wrong offset!");
