#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl006a

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "BaseCharacter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Girl006a.BP_Girl006a_C
// 0x0140 (0x23F0 - 0x22B0)
class ABP_Girl006a_C final : public ABaseCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Girl006a_C;                      // 0x22A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      E_girl006a_skill03_self13_p;                       // 0x22B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ____1______0_2B250E6744A7527B01C5639EEFAFB493;     // 0x22B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____1__Direction_2B250E6744A7527B01C5639EEFAFB493; // 0x22BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22BD[0x3];                                     // 0x22BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     __t_1;                                             // 0x22C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____Big_Show_2______0_1477CC354E1DC94A849299B71B0E4188; // 0x22C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____Big_Show_2__Direction_1477CC354E1DC94A849299B71B0E4188; // 0x22CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22CD[0x3];                                     // 0x22CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     __t_Big_Show_2;                                    // 0x22D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____Big_Show______0_F0BE4FFA4449AE5B6DD2BA9E1302E867; // 0x22D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____Big_Show__Direction_F0BE4FFA4449AE5B6DD2BA9E1302E867; // 0x22DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22DD[0x3];                                     // 0x22DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     __t_Big_Show;                                      // 0x22E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____show_2______0_ADE050194641E63721D896B314D26E8A; // 0x22E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____show_2__Direction_ADE050194641E63721D896B314D26E8A; // 0x22EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22ED[0x3];                                     // 0x22ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     __t_show_2;                                        // 0x22F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____show______0_8C1A36A943A3C7DB706C39B322F8095A;  // 0x22F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____show__Direction_8C1A36A943A3C7DB706C39B322F8095A; // 0x22FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22FD[0x3];                                     // 0x22FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     __t_show;                                          // 0x2300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 Normal_Skill;                                      // 0x2308(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 Burst_Skill;                                       // 0x2318(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCharacterRenderComponent*              Target_0;                                          // 0x2328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         MC;                                                // 0x2330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Dissolve_Edge_Color;                               // 0x2338(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   EffectTexture;                                     // 0x2350(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DissolveWidth;                                     // 0x2368(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DissolveLevel;                                     // 0x2380(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Time;                                              // 0x2398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ID;                                                // 0x239C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   DirectionDissolve;                                 // 0x23A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DissolveVector;                                    // 0x23B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNiagaraComponent*                      Niagara;                                           // 0x23D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NormalSkillTag;                                    // 0x23D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23D9[0x7];                                     // 0x23D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 SwordEnergy_Skill;                                 // 0x23E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BigKnife_Show(class UCharacterRenderComponent** Target, int32* ID_0, class UMeshComponent** MC_0);
	void Knife_Show(class UCharacterRenderComponent** Target, int32* ID_0, class UMeshComponent** MC_0);
	void __t_Big_Show__FinishedFunc();
	void __t_Big_Show__UpdateFunc();
	void __t_Big_Show_2__FinishedFunc();
	void __t_Big_Show_2__UpdateFunc();
	void __t_show_2__FinishedFunc();
	void __t_show_2__UpdateFunc();
	void __t_show__FinishedFunc();
	void __t_show__UpdateFunc();
	void __t_1__FinishedFunc();
	void __t_1__UpdateFunc();
	void OnNotifyEnd_F1E8CD3C4C0D45C2375B77AFF059DA42(class FName NotifyName);
	void OnNotifyBegin_F1E8CD3C4C0D45C2375B77AFF059DA42(class FName NotifyName);
	void OnInterrupted_F1E8CD3C4C0D45C2375B77AFF059DA42(class FName NotifyName);
	void OnBlendOut_F1E8CD3C4C0D45C2375B77AFF059DA42(class FName NotifyName);
	void OnCompleted_F1E8CD3C4C0D45C2375B77AFF059DA42(class FName NotifyName);
	void OnNotifyEnd_3AAA7E6B47BF82EAB2CBB18D91114970(class FName NotifyName);
	void OnNotifyBegin_3AAA7E6B47BF82EAB2CBB18D91114970(class FName NotifyName);
	void OnInterrupted_3AAA7E6B47BF82EAB2CBB18D91114970(class FName NotifyName);
	void OnBlendOut_3AAA7E6B47BF82EAB2CBB18D91114970(class FName NotifyName);
	void OnCompleted_3AAA7E6B47BF82EAB2CBB18D91114970(class FName NotifyName);
	void SkillEnd(int32 SkillID);
	void SkillStart(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void _________(int32 ModifierID, bool IsApply, int64 LauncherCharacterHashIndex, EModifierRemoveSourceType RemoveSourceType);
	void Client_1106104(bool bExist);
	void Client_1106103(bool bExist);
	void ExecuteUbergraph_BP_Girl006a(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Girl006a_C">();
	}
	static class ABP_Girl006a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Girl006a_C>();
	}
};
static_assert(alignof(ABP_Girl006a_C) == 0x000010, "Wrong alignment on ABP_Girl006a_C");
static_assert(sizeof(ABP_Girl006a_C) == 0x0023F0, "Wrong size on ABP_Girl006a_C");
static_assert(offsetof(ABP_Girl006a_C, UberGraphFrame_BP_Girl006a_C) == 0x0022A8, "Member 'ABP_Girl006a_C::UberGraphFrame_BP_Girl006a_C' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, E_girl006a_skill03_self13_p) == 0x0022B0, "Member 'ABP_Girl006a_C::E_girl006a_skill03_self13_p' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, ____1______0_2B250E6744A7527B01C5639EEFAFB493) == 0x0022B8, "Member 'ABP_Girl006a_C::____1______0_2B250E6744A7527B01C5639EEFAFB493' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, ____1__Direction_2B250E6744A7527B01C5639EEFAFB493) == 0x0022BC, "Member 'ABP_Girl006a_C::____1__Direction_2B250E6744A7527B01C5639EEFAFB493' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, __t_1) == 0x0022C0, "Member 'ABP_Girl006a_C::__t_1' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, ____Big_Show_2______0_1477CC354E1DC94A849299B71B0E4188) == 0x0022C8, "Member 'ABP_Girl006a_C::____Big_Show_2______0_1477CC354E1DC94A849299B71B0E4188' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, ____Big_Show_2__Direction_1477CC354E1DC94A849299B71B0E4188) == 0x0022CC, "Member 'ABP_Girl006a_C::____Big_Show_2__Direction_1477CC354E1DC94A849299B71B0E4188' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, __t_Big_Show_2) == 0x0022D0, "Member 'ABP_Girl006a_C::__t_Big_Show_2' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, ____Big_Show______0_F0BE4FFA4449AE5B6DD2BA9E1302E867) == 0x0022D8, "Member 'ABP_Girl006a_C::____Big_Show______0_F0BE4FFA4449AE5B6DD2BA9E1302E867' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, ____Big_Show__Direction_F0BE4FFA4449AE5B6DD2BA9E1302E867) == 0x0022DC, "Member 'ABP_Girl006a_C::____Big_Show__Direction_F0BE4FFA4449AE5B6DD2BA9E1302E867' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, __t_Big_Show) == 0x0022E0, "Member 'ABP_Girl006a_C::__t_Big_Show' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, ____show_2______0_ADE050194641E63721D896B314D26E8A) == 0x0022E8, "Member 'ABP_Girl006a_C::____show_2______0_ADE050194641E63721D896B314D26E8A' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, ____show_2__Direction_ADE050194641E63721D896B314D26E8A) == 0x0022EC, "Member 'ABP_Girl006a_C::____show_2__Direction_ADE050194641E63721D896B314D26E8A' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, __t_show_2) == 0x0022F0, "Member 'ABP_Girl006a_C::__t_show_2' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, ____show______0_8C1A36A943A3C7DB706C39B322F8095A) == 0x0022F8, "Member 'ABP_Girl006a_C::____show______0_8C1A36A943A3C7DB706C39B322F8095A' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, ____show__Direction_8C1A36A943A3C7DB706C39B322F8095A) == 0x0022FC, "Member 'ABP_Girl006a_C::____show__Direction_8C1A36A943A3C7DB706C39B322F8095A' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, __t_show) == 0x002300, "Member 'ABP_Girl006a_C::__t_show' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, Normal_Skill) == 0x002308, "Member 'ABP_Girl006a_C::Normal_Skill' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, Burst_Skill) == 0x002318, "Member 'ABP_Girl006a_C::Burst_Skill' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, Target_0) == 0x002328, "Member 'ABP_Girl006a_C::Target_0' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, MC) == 0x002330, "Member 'ABP_Girl006a_C::MC' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, Dissolve_Edge_Color) == 0x002338, "Member 'ABP_Girl006a_C::Dissolve_Edge_Color' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, EffectTexture) == 0x002350, "Member 'ABP_Girl006a_C::EffectTexture' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, DissolveWidth) == 0x002368, "Member 'ABP_Girl006a_C::DissolveWidth' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, DissolveLevel) == 0x002380, "Member 'ABP_Girl006a_C::DissolveLevel' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, Time) == 0x002398, "Member 'ABP_Girl006a_C::Time' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, ID) == 0x00239C, "Member 'ABP_Girl006a_C::ID' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, DirectionDissolve) == 0x0023A0, "Member 'ABP_Girl006a_C::DirectionDissolve' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, DissolveVector) == 0x0023B8, "Member 'ABP_Girl006a_C::DissolveVector' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, Niagara) == 0x0023D0, "Member 'ABP_Girl006a_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, NormalSkillTag) == 0x0023D8, "Member 'ABP_Girl006a_C::NormalSkillTag' has a wrong offset!");
static_assert(offsetof(ABP_Girl006a_C, SwordEnergy_Skill) == 0x0023E0, "Member 'ABP_Girl006a_C::SwordEnergy_Skill' has a wrong offset!");

}

