#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Girl002_Prop02_New

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BaseSummon_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Girl002_Prop02_New.BP_Girl002_Prop02_New_C
// 0x0080 (0x1470 - 0x13F0)
class ABP_Girl002_Prop02_New_C final : public ABaseSummon_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x13E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x13F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow2;                                            // 0x13F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow1;                                            // 0x1400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Skill_2_Move_Move_BF3B271642CFD21D3B51BD9B16DFD6CA; // 0x1408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Skill_2_Move__Direction_BF3B271642CFD21D3B51BD9B16DFD6CA; // 0x140C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_140D[0x3];                                     // 0x140D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Skill_2_Move;                                      // 0x1410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Target_Location;                                   // 0x1418(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNew;                                             // 0x1424(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1425[0x3];                                     // 0x1425(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Captain_Forward;                                   // 0x1428(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartLocation;                                     // 0x1434(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         YRandomOffset;                                     // 0x1440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ZRandomOffset;                                     // 0x1444(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x1448(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SideDeceleration;                                  // 0x144C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SelfLocation;                                      // 0x1450(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Random_Offset;                                     // 0x145C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         Captain;                                           // 0x1460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FirstSpeedSet;                                     // 0x1468(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ReceiveTick(float DeltaSeconds);
	void Skill_2_Move__FinishedFunc();
	void Skill_2_Move__UpdateFunc();
	void Cast_Skill(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void Spwaned();
	void ReceiveBeginPlay();
	void OnAILeave____0();
	void ExecuteUbergraph_BP_Girl002_Prop02_New(int32 EntryPoint);
	void Skill_2(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void ReceiveTick__Overridden(float DeltaSeconds);
	void HandleEnterAnimIndex(int32 AnimIndex);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Girl002_Prop02_New_C">();
	}
	static class ABP_Girl002_Prop02_New_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Girl002_Prop02_New_C>();
	}
};
static_assert(alignof(ABP_Girl002_Prop02_New_C) == 0x000010, "Wrong alignment on ABP_Girl002_Prop02_New_C");
static_assert(sizeof(ABP_Girl002_Prop02_New_C) == 0x001470, "Wrong size on ABP_Girl002_Prop02_New_C");
static_assert(offsetof(ABP_Girl002_Prop02_New_C, UberGraphFrame) == 0x0013E8, "Member 'ABP_Girl002_Prop02_New_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Girl002_Prop02_New_C, ParticleSystem) == 0x0013F0, "Member 'ABP_Girl002_Prop02_New_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABP_Girl002_Prop02_New_C, Arrow2) == 0x0013F8, "Member 'ABP_Girl002_Prop02_New_C::Arrow2' has a wrong offset!");
static_assert(offsetof(ABP_Girl002_Prop02_New_C, Arrow1) == 0x001400, "Member 'ABP_Girl002_Prop02_New_C::Arrow1' has a wrong offset!");
static_assert(offsetof(ABP_Girl002_Prop02_New_C, Skill_2_Move_Move_BF3B271642CFD21D3B51BD9B16DFD6CA) == 0x001408, "Member 'ABP_Girl002_Prop02_New_C::Skill_2_Move_Move_BF3B271642CFD21D3B51BD9B16DFD6CA' has a wrong offset!");
static_assert(offsetof(ABP_Girl002_Prop02_New_C, Skill_2_Move__Direction_BF3B271642CFD21D3B51BD9B16DFD6CA) == 0x00140C, "Member 'ABP_Girl002_Prop02_New_C::Skill_2_Move__Direction_BF3B271642CFD21D3B51BD9B16DFD6CA' has a wrong offset!");
static_assert(offsetof(ABP_Girl002_Prop02_New_C, Skill_2_Move) == 0x001410, "Member 'ABP_Girl002_Prop02_New_C::Skill_2_Move' has a wrong offset!");
static_assert(offsetof(ABP_Girl002_Prop02_New_C, Target_Location) == 0x001418, "Member 'ABP_Girl002_Prop02_New_C::Target_Location' has a wrong offset!");
static_assert(offsetof(ABP_Girl002_Prop02_New_C, IsNew) == 0x001424, "Member 'ABP_Girl002_Prop02_New_C::IsNew' has a wrong offset!");
static_assert(offsetof(ABP_Girl002_Prop02_New_C, Captain_Forward) == 0x001428, "Member 'ABP_Girl002_Prop02_New_C::Captain_Forward' has a wrong offset!");
static_assert(offsetof(ABP_Girl002_Prop02_New_C, StartLocation) == 0x001434, "Member 'ABP_Girl002_Prop02_New_C::StartLocation' has a wrong offset!");
static_assert(offsetof(ABP_Girl002_Prop02_New_C, YRandomOffset) == 0x001440, "Member 'ABP_Girl002_Prop02_New_C::YRandomOffset' has a wrong offset!");
static_assert(offsetof(ABP_Girl002_Prop02_New_C, ZRandomOffset) == 0x001444, "Member 'ABP_Girl002_Prop02_New_C::ZRandomOffset' has a wrong offset!");
static_assert(offsetof(ABP_Girl002_Prop02_New_C, Time) == 0x001448, "Member 'ABP_Girl002_Prop02_New_C::Time' has a wrong offset!");
static_assert(offsetof(ABP_Girl002_Prop02_New_C, SideDeceleration) == 0x00144C, "Member 'ABP_Girl002_Prop02_New_C::SideDeceleration' has a wrong offset!");
static_assert(offsetof(ABP_Girl002_Prop02_New_C, SelfLocation) == 0x001450, "Member 'ABP_Girl002_Prop02_New_C::SelfLocation' has a wrong offset!");
static_assert(offsetof(ABP_Girl002_Prop02_New_C, Random_Offset) == 0x00145C, "Member 'ABP_Girl002_Prop02_New_C::Random_Offset' has a wrong offset!");
static_assert(offsetof(ABP_Girl002_Prop02_New_C, Captain) == 0x001460, "Member 'ABP_Girl002_Prop02_New_C::Captain' has a wrong offset!");
static_assert(offsetof(ABP_Girl002_Prop02_New_C, FirstSpeedSet) == 0x001468, "Member 'ABP_Girl002_Prop02_New_C::FirstSpeedSet' has a wrong offset!");

}

