#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HighLevelNpc_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HighLevelNpc_Base.BP_HighLevelNpc_Base_C
// 0x0050 (0x1480 - 0x1430)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_HighLevelNpc_Base_C : public AHighLevelNpcCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNpcAIDebugComponent*                   NpcAIDebug;                                        // 0x1438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNpcAIDataComponent*                    NpcAIData;                                         // 0x1440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bLevelNeedFollow;                                  // 0x1448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLevelNeedApproachPlayer;                          // 0x1449(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bLevelNeedApproach_Road;                           // 0x144A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_144B[0x1];                                     // 0x144B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         X;                                                 // 0x144C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Y;                                                 // 0x1450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Z;                                                 // 0x1454(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GoalLocation;                                      // 0x1458(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1464[0x4];                                     // 0x1464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  GoalActor;                                         // 0x1468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GoalDistance;                                      // 0x1470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void LevelSetFollowFunction();
	void LevelSetApproachPlayerFunction();
	void LevelSetapproachRoad(float X_0, float Y_0, float Z_0);
	void SetMeshTransSortPriority(int32 NewSort);
	float Abnormal_RepelAnimTime(int32 AnimType, bool bIsBack);
	float Abnormal_LieDownAnimTime(int32 AnimType);
	float Abnormal_GetUpAnimTime(int32 AnimType);
	void StartFire(class APlayerWeapon* CurWeapon);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_HighLevelNpc_Base(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_HighLevelNpc_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_HighLevelNpc_Base_C")
	}
	static class ABP_HighLevelNpc_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HighLevelNpc_Base_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ABP_HighLevelNpc_Base_C;

}

