#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_113_Prop01

#include "Basic.hpp"

#include "BaseMonster_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mon_113_Prop01.BP_Mon_113_Prop01_C
// 0x00D0 (0x1460 - 0x1390)
class ABP_Mon_113_Prop01_C final : public ABaseMonster_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Mon_113_Prop01_C;                // 0x1390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Weak;                                              // 0x1398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Friction;                                          // 0x13A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_B86A02754C3FBBCDFEB17AA9A3DDE31A; // 0x13A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_B86A02754C3FBBCDFEB17AA9A3DDE31A; // 0x13AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13AD[0x3];                                     // 0x13AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x13B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Skill_ID;                                          // 0x13B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ID;                                                // 0x13BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Sweep_Hit_Result;                                  // 0x13C0(0x008C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                Target;                                            // 0x144C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Mon_113_Prop01(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void Spwaned();
	void OnDie(class AGameCharacter* Who, class AGameCharacter* Killer, const struct FHealthChangeValue& HealthChangeValue);
	void ReceiveBeginPlay();
	void OnSuccess_FB02A04D4E459A96919DBD962F00CE0A(EPathFollowingResult MovementResult);
	void OnFail_FB02A04D4E459A96919DBD962F00CE0A(EPathFollowingResult MovementResult);
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mon_113_Prop01_C">();
	}
	static class ABP_Mon_113_Prop01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mon_113_Prop01_C>();
	}
};
static_assert(alignof(ABP_Mon_113_Prop01_C) == 0x000010, "Wrong alignment on ABP_Mon_113_Prop01_C");
static_assert(sizeof(ABP_Mon_113_Prop01_C) == 0x001460, "Wrong size on ABP_Mon_113_Prop01_C");
static_assert(offsetof(ABP_Mon_113_Prop01_C, UberGraphFrame_BP_Mon_113_Prop01_C) == 0x001390, "Member 'ABP_Mon_113_Prop01_C::UberGraphFrame_BP_Mon_113_Prop01_C' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_Prop01_C, Weak) == 0x001398, "Member 'ABP_Mon_113_Prop01_C::Weak' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_Prop01_C, Friction) == 0x0013A0, "Member 'ABP_Mon_113_Prop01_C::Friction' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_Prop01_C, Timeline_0_NewTrack_0_B86A02754C3FBBCDFEB17AA9A3DDE31A) == 0x0013A8, "Member 'ABP_Mon_113_Prop01_C::Timeline_0_NewTrack_0_B86A02754C3FBBCDFEB17AA9A3DDE31A' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_Prop01_C, Timeline_0__Direction_B86A02754C3FBBCDFEB17AA9A3DDE31A) == 0x0013AC, "Member 'ABP_Mon_113_Prop01_C::Timeline_0__Direction_B86A02754C3FBBCDFEB17AA9A3DDE31A' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_Prop01_C, Timeline_0) == 0x0013B0, "Member 'ABP_Mon_113_Prop01_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_Prop01_C, Skill_ID) == 0x0013B8, "Member 'ABP_Mon_113_Prop01_C::Skill_ID' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_Prop01_C, ID) == 0x0013BC, "Member 'ABP_Mon_113_Prop01_C::ID' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_Prop01_C, Sweep_Hit_Result) == 0x0013C0, "Member 'ABP_Mon_113_Prop01_C::Sweep_Hit_Result' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_Prop01_C, Target) == 0x00144C, "Member 'ABP_Mon_113_Prop01_C::Target' has a wrong offset!");

}

