#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_002_Part01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mon_002_Part01.BP_Mon_002_Part01_C
// 0x0018 (0x05A0 - 0x0588)
class ABP_Mon_002_Part01_C final : public AAccessory_Destructible
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0588(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Mon_002_Part01(int32 EntryPoint);
	void OnOwnerDiePerform(class AGameCharacter* OwnerCharacter);
	void OnDestructed(class AGameCharacter* InBreaker, const struct FHealthChangeValue& InHealthChangeValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mon_002_Part01_C">();
	}
	static class ABP_Mon_002_Part01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mon_002_Part01_C>();
	}
};
static_assert(alignof(ABP_Mon_002_Part01_C) == 0x000008, "Wrong alignment on ABP_Mon_002_Part01_C");
static_assert(sizeof(ABP_Mon_002_Part01_C) == 0x0005A0, "Wrong size on ABP_Mon_002_Part01_C");
static_assert(offsetof(ABP_Mon_002_Part01_C, UberGraphFrame) == 0x000588, "Member 'ABP_Mon_002_Part01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Mon_002_Part01_C, Box) == 0x000590, "Member 'ABP_Mon_002_Part01_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_Mon_002_Part01_C, SkeletalMesh) == 0x000598, "Member 'ABP_Mon_002_Part01_C::SkeletalMesh' has a wrong offset!");

}

