#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_109a

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Mon_109a.BP_Mon_109a_C.CheckSpecificModifierType
// 0x0008 (0x0008 - 0x0000)
struct BP_Mon_109a_C_CheckSpecificModifierType final
{
public:
	class UModifier*                              InModifier;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_109a_C_CheckSpecificModifierType) == 0x000008, "Wrong alignment on BP_Mon_109a_C_CheckSpecificModifierType");
static_assert(sizeof(BP_Mon_109a_C_CheckSpecificModifierType) == 0x000008, "Wrong size on BP_Mon_109a_C_CheckSpecificModifierType");
static_assert(offsetof(BP_Mon_109a_C_CheckSpecificModifierType, InModifier) == 0x000000, "Member 'BP_Mon_109a_C_CheckSpecificModifierType::InModifier' has a wrong offset!");

// Function BP_Mon_109a.BP_Mon_109a_C.ExecuteUbergraph_BP_Mon_109a
// 0x0090 (0x0090 - 0x0000)
struct BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UModifier* InModifier)>  K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UModifier*                              K2Node_CustomEvent_InModifier;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACharacterAccessory*>            CallFunc_GetCharacterAccessories_OutCharacterAccessories; // 0x0048(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterAccessory*                    CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAccessory_Destructible*                K2Node_DynamicCast_AsAccessory_Destructible;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeModifier_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a) == 0x000008, "Wrong alignment on BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a");
static_assert(sizeof(BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a) == 0x000090, "Wrong size on BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a");
static_assert(offsetof(BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a, EntryPoint) == 0x000000, "Member 'BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a, CallFunc_MakeVector_ReturnValue) == 0x000004, "Member 'BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a, CallFunc_MakeVector_ReturnValue_1) == 0x000020, "Member 'BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a, ___int_Loop_Counter_Variable) == 0x00002C, "Member 'BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a, CallFunc_Subtract_IntInt_ReturnValue) == 0x000030, "Member 'BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000034, "Member 'BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a, ___int_Array_Index_Variable) == 0x000038, "Member 'BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a, K2Node_CustomEvent_InModifier) == 0x000040, "Member 'BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a::K2Node_CustomEvent_InModifier' has a wrong offset!");
static_assert(offsetof(BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a, CallFunc_GetCharacterAccessories_OutCharacterAccessories) == 0x000048, "Member 'BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a::CallFunc_GetCharacterAccessories_OutCharacterAccessories' has a wrong offset!");
static_assert(offsetof(BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000058, "Member 'BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a, K2Node_DynamicCast_AsAccessory_Destructible) == 0x000068, "Member 'BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a::K2Node_DynamicCast_AsAccessory_Destructible' has a wrong offset!");
static_assert(offsetof(BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000078, "Member 'BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a, CallFunc_MakeModifier_ReturnValue) == 0x00007C, "Member 'BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a::CallFunc_MakeModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a, CallFunc_Max_ReturnValue) == 0x000080, "Member 'BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a, CallFunc_Array_Length_ReturnValue_1) == 0x000084, "Member 'BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a, CallFunc_Greater_IntInt_ReturnValue) == 0x000088, "Member 'BP_Mon_109a_C_ExecuteUbergraph_BP_Mon_109a::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Mon_109a.BP_Mon_109a_C.ReceiveIsAllowAimed
// 0x0010 (0x0010 - 0x0000)
struct BP_Mon_109a_C_ReceiveIsAllowAimed final
{
public:
	const class AGameCharacter*                   CurrentInstigator;                                 // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsModifierExist_ReturnValue;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Mon_109a_C_ReceiveIsAllowAimed) == 0x000008, "Wrong alignment on BP_Mon_109a_C_ReceiveIsAllowAimed");
static_assert(sizeof(BP_Mon_109a_C_ReceiveIsAllowAimed) == 0x000010, "Wrong size on BP_Mon_109a_C_ReceiveIsAllowAimed");
static_assert(offsetof(BP_Mon_109a_C_ReceiveIsAllowAimed, CurrentInstigator) == 0x000000, "Member 'BP_Mon_109a_C_ReceiveIsAllowAimed::CurrentInstigator' has a wrong offset!");
static_assert(offsetof(BP_Mon_109a_C_ReceiveIsAllowAimed, ReturnValue) == 0x000008, "Member 'BP_Mon_109a_C_ReceiveIsAllowAimed::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_109a_C_ReceiveIsAllowAimed, CallFunc_IsModifierExist_ReturnValue) == 0x000009, "Member 'BP_Mon_109a_C_ReceiveIsAllowAimed::CallFunc_IsModifierExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_109a_C_ReceiveIsAllowAimed, CallFunc_Not_PreBool_ReturnValue) == 0x00000A, "Member 'BP_Mon_109a_C_ReceiveIsAllowAimed::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

