#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_007_WP02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mon_007_WP02.BP_Mon_007_WP02_C
// 0x0018 (0x04B8 - 0x04A0)
class ABP_Mon_007_WP02_C final : public ACharacterAccessory
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Mon007_wp02a;                                      // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Mon_007_WP02(int32 EntryPoint);
	void OnOwnerDiePerform(class AGameCharacter* OwnerCharacter);
	void BndEvt__mon003_wp01_skm_K2Node_ComponentBoundEvent_0_ConstraintBrokenSignature__DelegateSignature(int32 ConstraintIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mon_007_WP02_C">();
	}
	static class ABP_Mon_007_WP02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mon_007_WP02_C>();
	}
};
static_assert(alignof(ABP_Mon_007_WP02_C) == 0x000008, "Wrong alignment on ABP_Mon_007_WP02_C");
static_assert(sizeof(ABP_Mon_007_WP02_C) == 0x0004B8, "Wrong size on ABP_Mon_007_WP02_C");
static_assert(offsetof(ABP_Mon_007_WP02_C, UberGraphFrame) == 0x0004A0, "Member 'ABP_Mon_007_WP02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Mon_007_WP02_C, Mon007_wp02a) == 0x0004A8, "Member 'ABP_Mon_007_WP02_C::Mon007_wp02a' has a wrong offset!");
static_assert(offsetof(ABP_Mon_007_WP02_C, Scene) == 0x0004B0, "Member 'ABP_Mon_007_WP02_C::Scene' has a wrong offset!");

}

