#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_013_Part01

#include "Basic.hpp"

#include "BaseMonster_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mon_013_Part01.BP_Mon_013_Part01_C
// 0x0060 (0x13F0 - 0x1390)
class ABP_Mon_013_Part01_C final : public ABaseMonster_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Mon_013_Part01_C;                // 0x1390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMatchingGroundNormalComponent*         MatchingGroundNormal;                              // 0x1398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Friction;                                          // 0x13A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_NewTrack_0_D1F3975C4EAC881A82898C8863DB74F2; // 0x13A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_2__Direction_D1F3975C4EAC881A82898C8863DB74F2; // 0x13AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13AD[0x3];                                     // 0x13AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_2;                                        // 0x13B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_NewTrack_0_61D1395249D3635A81EA2C825D9324F7; // 0x13B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_61D1395249D3635A81EA2C825D9324F7; // 0x13BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13BD[0x3];                                     // 0x13BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x13C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_C6F119C447C6CAE4B9BC50BA1A938A82; // 0x13C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_C6F119C447C6CAE4B9BC50BA1A938A82; // 0x13CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13CD[0x3];                                     // 0x13CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x13D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TestStageMessage;                                  // 0x13D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EffectID_0;                                        // 0x13DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuicide;                                          // 0x13E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13E1[0x3];                                     // 0x13E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SpawnPerformanceID;                                // 0x13E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Mon_013_Part01(int32 EntryPoint);
	void Spwaned();
	void OnDie(class AGameCharacter* Who, class AGameCharacter* Killer, const struct FHealthChangeValue& HealthChangeValue);
	void SpecialJoinFightPerform02();
	void SpecialJoinFightPerform01();
	void ReceiveTick(float DeltaSeconds);
	void OnCompleted_3F3EA78B42319E3F4BFA37A93CFBE2D1(class FName NotifyName);
	void OnBlendOut_3F3EA78B42319E3F4BFA37A93CFBE2D1(class FName NotifyName);
	void OnInterrupted_3F3EA78B42319E3F4BFA37A93CFBE2D1(class FName NotifyName);
	void OnNotifyBegin_3F3EA78B42319E3F4BFA37A93CFBE2D1(class FName NotifyName);
	void OnNotifyEnd_3F3EA78B42319E3F4BFA37A93CFBE2D1(class FName NotifyName);
	void OnCompleted_B9E8656A495FCB983DD813BF776F55B1(class FName NotifyName);
	void OnBlendOut_B9E8656A495FCB983DD813BF776F55B1(class FName NotifyName);
	void OnInterrupted_B9E8656A495FCB983DD813BF776F55B1(class FName NotifyName);
	void OnNotifyBegin_B9E8656A495FCB983DD813BF776F55B1(class FName NotifyName);
	void OnNotifyEnd_B9E8656A495FCB983DD813BF776F55B1(class FName NotifyName);
	void OnCompleted_04DB611041C30E04E93E73AC5185A3B6(class FName NotifyName);
	void OnBlendOut_04DB611041C30E04E93E73AC5185A3B6(class FName NotifyName);
	void OnInterrupted_04DB611041C30E04E93E73AC5185A3B6(class FName NotifyName);
	void OnNotifyBegin_04DB611041C30E04E93E73AC5185A3B6(class FName NotifyName);
	void OnNotifyEnd_04DB611041C30E04E93E73AC5185A3B6(class FName NotifyName);
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void Timeline_2__UpdateFunc();
	void Timeline_2__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mon_013_Part01_C">();
	}
	static class ABP_Mon_013_Part01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mon_013_Part01_C>();
	}
};
static_assert(alignof(ABP_Mon_013_Part01_C) == 0x000010, "Wrong alignment on ABP_Mon_013_Part01_C");
static_assert(sizeof(ABP_Mon_013_Part01_C) == 0x0013F0, "Wrong size on ABP_Mon_013_Part01_C");
static_assert(offsetof(ABP_Mon_013_Part01_C, UberGraphFrame_BP_Mon_013_Part01_C) == 0x001390, "Member 'ABP_Mon_013_Part01_C::UberGraphFrame_BP_Mon_013_Part01_C' has a wrong offset!");
static_assert(offsetof(ABP_Mon_013_Part01_C, MatchingGroundNormal) == 0x001398, "Member 'ABP_Mon_013_Part01_C::MatchingGroundNormal' has a wrong offset!");
static_assert(offsetof(ABP_Mon_013_Part01_C, Friction) == 0x0013A0, "Member 'ABP_Mon_013_Part01_C::Friction' has a wrong offset!");
static_assert(offsetof(ABP_Mon_013_Part01_C, Timeline_2_NewTrack_0_D1F3975C4EAC881A82898C8863DB74F2) == 0x0013A8, "Member 'ABP_Mon_013_Part01_C::Timeline_2_NewTrack_0_D1F3975C4EAC881A82898C8863DB74F2' has a wrong offset!");
static_assert(offsetof(ABP_Mon_013_Part01_C, Timeline_2__Direction_D1F3975C4EAC881A82898C8863DB74F2) == 0x0013AC, "Member 'ABP_Mon_013_Part01_C::Timeline_2__Direction_D1F3975C4EAC881A82898C8863DB74F2' has a wrong offset!");
static_assert(offsetof(ABP_Mon_013_Part01_C, Timeline_2) == 0x0013B0, "Member 'ABP_Mon_013_Part01_C::Timeline_2' has a wrong offset!");
static_assert(offsetof(ABP_Mon_013_Part01_C, Timeline_1_NewTrack_0_61D1395249D3635A81EA2C825D9324F7) == 0x0013B8, "Member 'ABP_Mon_013_Part01_C::Timeline_1_NewTrack_0_61D1395249D3635A81EA2C825D9324F7' has a wrong offset!");
static_assert(offsetof(ABP_Mon_013_Part01_C, Timeline_1__Direction_61D1395249D3635A81EA2C825D9324F7) == 0x0013BC, "Member 'ABP_Mon_013_Part01_C::Timeline_1__Direction_61D1395249D3635A81EA2C825D9324F7' has a wrong offset!");
static_assert(offsetof(ABP_Mon_013_Part01_C, Timeline_1) == 0x0013C0, "Member 'ABP_Mon_013_Part01_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_013_Part01_C, Timeline_0_NewTrack_0_C6F119C447C6CAE4B9BC50BA1A938A82) == 0x0013C8, "Member 'ABP_Mon_013_Part01_C::Timeline_0_NewTrack_0_C6F119C447C6CAE4B9BC50BA1A938A82' has a wrong offset!");
static_assert(offsetof(ABP_Mon_013_Part01_C, Timeline_0__Direction_C6F119C447C6CAE4B9BC50BA1A938A82) == 0x0013CC, "Member 'ABP_Mon_013_Part01_C::Timeline_0__Direction_C6F119C447C6CAE4B9BC50BA1A938A82' has a wrong offset!");
static_assert(offsetof(ABP_Mon_013_Part01_C, Timeline_0) == 0x0013D0, "Member 'ABP_Mon_013_Part01_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_Mon_013_Part01_C, TestStageMessage) == 0x0013D8, "Member 'ABP_Mon_013_Part01_C::TestStageMessage' has a wrong offset!");
static_assert(offsetof(ABP_Mon_013_Part01_C, EffectID_0) == 0x0013DC, "Member 'ABP_Mon_013_Part01_C::EffectID_0' has a wrong offset!");
static_assert(offsetof(ABP_Mon_013_Part01_C, bSuicide) == 0x0013E0, "Member 'ABP_Mon_013_Part01_C::bSuicide' has a wrong offset!");
static_assert(offsetof(ABP_Mon_013_Part01_C, SpawnPerformanceID) == 0x0013E4, "Member 'ABP_Mon_013_Part01_C::SpawnPerformanceID' has a wrong offset!");

}

