#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_601

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Mon_601.BP_Mon_601_C.ExecuteUbergraph_BP_Mon_601
// 0x0208 (0x0208 - 0x0000)
struct BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeModifier_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseComponent*                        CallFunc_PostEventAttachedActor_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_Mon_601_Main_C*                    K2Node_DynamicCast_AsABP_Mon_601_Main;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_Who;                                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_Killer;                               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_Event_HealthChangeValue;                    // 0x0058(0x01B0)(ConstParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601) == 0x000008, "Wrong alignment on BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601");
static_assert(sizeof(BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601) == 0x000208, "Wrong size on BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601");
static_assert(offsetof(BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601, EntryPoint) == 0x000000, "Member 'BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601, CallFunc_MakeModifier_ReturnValue) == 0x000014, "Member 'BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601::CallFunc_MakeModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601, CallFunc_PostEventAttachedActor_ReturnValue) == 0x000018, "Member 'BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601::CallFunc_PostEventAttachedActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601, CallFunc_GetAnimInstance_ReturnValue) == 0x000020, "Member 'BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000028, "Member 'BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601, K2Node_DynamicCast_AsABP_Mon_601_Main) == 0x000030, "Member 'BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601::K2Node_DynamicCast_AsABP_Mon_601_Main' has a wrong offset!");
static_assert(offsetof(BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601, CallFunc_SpawnSystemAttached_ReturnValue_1) == 0x000040, "Member 'BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601::CallFunc_SpawnSystemAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601, K2Node_Event_Who) == 0x000048, "Member 'BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601::K2Node_Event_Who' has a wrong offset!");
static_assert(offsetof(BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601, K2Node_Event_Killer) == 0x000050, "Member 'BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601::K2Node_Event_Killer' has a wrong offset!");
static_assert(offsetof(BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601, K2Node_Event_HealthChangeValue) == 0x000058, "Member 'BP_Mon_601_C_ExecuteUbergraph_BP_Mon_601::K2Node_Event_HealthChangeValue' has a wrong offset!");

// Function BP_Mon_601.BP_Mon_601_C.OnDie
// 0x01C0 (0x01C0 - 0x0000)
struct BP_Mon_601_C_OnDie final
{
public:
	class AGameCharacter*                         Who;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         Killer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     HealthChangeValue;                                 // 0x0010(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Mon_601_C_OnDie) == 0x000008, "Wrong alignment on BP_Mon_601_C_OnDie");
static_assert(sizeof(BP_Mon_601_C_OnDie) == 0x0001C0, "Wrong size on BP_Mon_601_C_OnDie");
static_assert(offsetof(BP_Mon_601_C_OnDie, Who) == 0x000000, "Member 'BP_Mon_601_C_OnDie::Who' has a wrong offset!");
static_assert(offsetof(BP_Mon_601_C_OnDie, Killer) == 0x000008, "Member 'BP_Mon_601_C_OnDie::Killer' has a wrong offset!");
static_assert(offsetof(BP_Mon_601_C_OnDie, HealthChangeValue) == 0x000010, "Member 'BP_Mon_601_C_OnDie::HealthChangeValue' has a wrong offset!");

// Function BP_Mon_601.BP_Mon_601_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Mon_601_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_601_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Mon_601_C_ReceiveTick");
static_assert(sizeof(BP_Mon_601_C_ReceiveTick) == 0x000004, "Wrong size on BP_Mon_601_C_ReceiveTick");
static_assert(offsetof(BP_Mon_601_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Mon_601_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

