#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_108a

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Mon_108a.BP_Mon_108a_C.CastSpecialSkill
// 0x0028 (0x0028 - 0x0000)
struct BP_Mon_108a_C_CastSpecialSkill final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OriginSkills;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UGameAbilityComponent*                  AbilityRef;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Mon_108a_C_CastSpecialSkill) == 0x000008, "Wrong alignment on BP_Mon_108a_C_CastSpecialSkill");
static_assert(sizeof(BP_Mon_108a_C_CastSpecialSkill) == 0x000028, "Wrong size on BP_Mon_108a_C_CastSpecialSkill");
static_assert(offsetof(BP_Mon_108a_C_CastSpecialSkill, SkillID) == 0x000000, "Member 'BP_Mon_108a_C_CastSpecialSkill::SkillID' has a wrong offset!");
static_assert(offsetof(BP_Mon_108a_C_CastSpecialSkill, OriginSkills) == 0x000008, "Member 'BP_Mon_108a_C_CastSpecialSkill::OriginSkills' has a wrong offset!");
static_assert(offsetof(BP_Mon_108a_C_CastSpecialSkill, AbilityRef) == 0x000018, "Member 'BP_Mon_108a_C_CastSpecialSkill::AbilityRef' has a wrong offset!");
static_assert(offsetof(BP_Mon_108a_C_CastSpecialSkill, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000020, "Member 'BP_Mon_108a_C_CastSpecialSkill::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_108a_C_CastSpecialSkill, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000024, "Member 'BP_Mon_108a_C_CastSpecialSkill::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_108a_C_CastSpecialSkill, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000025, "Member 'BP_Mon_108a_C_CastSpecialSkill::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_108a_C_CastSpecialSkill, CallFunc_BooleanOR_ReturnValue) == 0x000026, "Member 'BP_Mon_108a_C_CastSpecialSkill::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_Mon_108a.BP_Mon_108a_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_Mon_108a_C_UserConstructionScript final
{
public:
	TDelegate<void(int32 SkillID, TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityComponentBase*                  CallFunc_GetAbilityComponent_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_108a_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Mon_108a_C_UserConstructionScript");
static_assert(sizeof(BP_Mon_108a_C_UserConstructionScript) == 0x000018, "Wrong size on BP_Mon_108a_C_UserConstructionScript");
static_assert(offsetof(BP_Mon_108a_C_UserConstructionScript, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_Mon_108a_C_UserConstructionScript::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Mon_108a_C_UserConstructionScript, CallFunc_GetAbilityComponent_ReturnValue) == 0x000010, "Member 'BP_Mon_108a_C_UserConstructionScript::CallFunc_GetAbilityComponent_ReturnValue' has a wrong offset!");

}

