#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_102_NPC

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Mon_102_NPC.BP_Mon_102_NPC_C.LevelSetapproachRoad
// 0x0010 (0x0010 - 0x0000)
struct BP_Mon_102_NPC_C_LevelSetapproachRoad final
{
public:
	float                                         X_0;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Y_0;                                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Z_0;                                               // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Mon_102_NPC_C_LevelSetapproachRoad) == 0x000004, "Wrong alignment on BP_Mon_102_NPC_C_LevelSetapproachRoad");
static_assert(sizeof(BP_Mon_102_NPC_C_LevelSetapproachRoad) == 0x000010, "Wrong size on BP_Mon_102_NPC_C_LevelSetapproachRoad");
static_assert(offsetof(BP_Mon_102_NPC_C_LevelSetapproachRoad, X_0) == 0x000000, "Member 'BP_Mon_102_NPC_C_LevelSetapproachRoad::X_0' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_LevelSetapproachRoad, Y_0) == 0x000004, "Member 'BP_Mon_102_NPC_C_LevelSetapproachRoad::Y_0' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_LevelSetapproachRoad, Z_0) == 0x000008, "Member 'BP_Mon_102_NPC_C_LevelSetapproachRoad::Z_0' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_LevelSetapproachRoad, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'BP_Mon_102_NPC_C_LevelSetapproachRoad::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_Mon_102_NPC.BP_Mon_102_NPC_C.LevelSetApproachPlayerFunction
// 0x0001 (0x0001 - 0x0000)
struct BP_Mon_102_NPC_C_LevelSetApproachPlayerFunction final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Mon_102_NPC_C_LevelSetApproachPlayerFunction) == 0x000001, "Wrong alignment on BP_Mon_102_NPC_C_LevelSetApproachPlayerFunction");
static_assert(sizeof(BP_Mon_102_NPC_C_LevelSetApproachPlayerFunction) == 0x000001, "Wrong size on BP_Mon_102_NPC_C_LevelSetApproachPlayerFunction");
static_assert(offsetof(BP_Mon_102_NPC_C_LevelSetApproachPlayerFunction, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'BP_Mon_102_NPC_C_LevelSetApproachPlayerFunction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_Mon_102_NPC.BP_Mon_102_NPC_C.LevelSetFollowFunction
// 0x0001 (0x0001 - 0x0000)
struct BP_Mon_102_NPC_C_LevelSetFollowFunction final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Mon_102_NPC_C_LevelSetFollowFunction) == 0x000001, "Wrong alignment on BP_Mon_102_NPC_C_LevelSetFollowFunction");
static_assert(sizeof(BP_Mon_102_NPC_C_LevelSetFollowFunction) == 0x000001, "Wrong size on BP_Mon_102_NPC_C_LevelSetFollowFunction");
static_assert(offsetof(BP_Mon_102_NPC_C_LevelSetFollowFunction, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'BP_Mon_102_NPC_C_LevelSetFollowFunction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_Mon_102_NPC.BP_Mon_102_NPC_C.OnMoveFinished_7864EDE5435D1C1C6E7A5EAEBCBC0A89
// 0x0010 (0x0010 - 0x0000)
struct BP_Mon_102_NPC_C_OnMoveFinished_7864EDE5435D1C1C6E7A5EAEBCBC0A89 final
{
public:
	EPathFollowingResult                          Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          AIController;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_102_NPC_C_OnMoveFinished_7864EDE5435D1C1C6E7A5EAEBCBC0A89) == 0x000008, "Wrong alignment on BP_Mon_102_NPC_C_OnMoveFinished_7864EDE5435D1C1C6E7A5EAEBCBC0A89");
static_assert(sizeof(BP_Mon_102_NPC_C_OnMoveFinished_7864EDE5435D1C1C6E7A5EAEBCBC0A89) == 0x000010, "Wrong size on BP_Mon_102_NPC_C_OnMoveFinished_7864EDE5435D1C1C6E7A5EAEBCBC0A89");
static_assert(offsetof(BP_Mon_102_NPC_C_OnMoveFinished_7864EDE5435D1C1C6E7A5EAEBCBC0A89, Result) == 0x000000, "Member 'BP_Mon_102_NPC_C_OnMoveFinished_7864EDE5435D1C1C6E7A5EAEBCBC0A89::Result' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_OnMoveFinished_7864EDE5435D1C1C6E7A5EAEBCBC0A89, AIController) == 0x000008, "Member 'BP_Mon_102_NPC_C_OnMoveFinished_7864EDE5435D1C1C6E7A5EAEBCBC0A89::AIController' has a wrong offset!");

// Function BP_Mon_102_NPC.BP_Mon_102_NPC_C.OnMoveFinished_F4481B504C38CF5076560CADDABA6AFE
// 0x0010 (0x0010 - 0x0000)
struct BP_Mon_102_NPC_C_OnMoveFinished_F4481B504C38CF5076560CADDABA6AFE final
{
public:
	EPathFollowingResult                          Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          AIController;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_102_NPC_C_OnMoveFinished_F4481B504C38CF5076560CADDABA6AFE) == 0x000008, "Wrong alignment on BP_Mon_102_NPC_C_OnMoveFinished_F4481B504C38CF5076560CADDABA6AFE");
static_assert(sizeof(BP_Mon_102_NPC_C_OnMoveFinished_F4481B504C38CF5076560CADDABA6AFE) == 0x000010, "Wrong size on BP_Mon_102_NPC_C_OnMoveFinished_F4481B504C38CF5076560CADDABA6AFE");
static_assert(offsetof(BP_Mon_102_NPC_C_OnMoveFinished_F4481B504C38CF5076560CADDABA6AFE, Result) == 0x000000, "Member 'BP_Mon_102_NPC_C_OnMoveFinished_F4481B504C38CF5076560CADDABA6AFE::Result' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_OnMoveFinished_F4481B504C38CF5076560CADDABA6AFE, AIController) == 0x000008, "Member 'BP_Mon_102_NPC_C_OnMoveFinished_F4481B504C38CF5076560CADDABA6AFE::AIController' has a wrong offset!");

// Function BP_Mon_102_NPC.BP_Mon_102_NPC_C.ReceiveTick__Overridden
// 0x0004 (0x0004 - 0x0000)
struct BP_Mon_102_NPC_C_ReceiveTick__Overridden final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_102_NPC_C_ReceiveTick__Overridden) == 0x000004, "Wrong alignment on BP_Mon_102_NPC_C_ReceiveTick__Overridden");
static_assert(sizeof(BP_Mon_102_NPC_C_ReceiveTick__Overridden) == 0x000004, "Wrong size on BP_Mon_102_NPC_C_ReceiveTick__Overridden");
static_assert(offsetof(BP_Mon_102_NPC_C_ReceiveTick__Overridden, DeltaSeconds) == 0x000000, "Member 'BP_Mon_102_NPC_C_ReceiveTick__Overridden::DeltaSeconds' has a wrong offset!");

// Function BP_Mon_102_NPC.BP_Mon_102_NPC_C.ResetLogicAndSpeed
// 0x0004 (0x0004 - 0x0000)
struct BP_Mon_102_NPC_C_ResetLogicAndSpeed final
{
public:
	float                                         WalkSpeed;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_102_NPC_C_ResetLogicAndSpeed) == 0x000004, "Wrong alignment on BP_Mon_102_NPC_C_ResetLogicAndSpeed");
static_assert(sizeof(BP_Mon_102_NPC_C_ResetLogicAndSpeed) == 0x000004, "Wrong size on BP_Mon_102_NPC_C_ResetLogicAndSpeed");
static_assert(offsetof(BP_Mon_102_NPC_C_ResetLogicAndSpeed, WalkSpeed) == 0x000000, "Member 'BP_Mon_102_NPC_C_ResetLogicAndSpeed::WalkSpeed' has a wrong offset!");

// Function BP_Mon_102_NPC.BP_Mon_102_NPC_C.ExecuteUbergraph_BP_Mon_102_NPC
// 0x01C8 (0x01C8 - 0x0000)
struct BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_Result;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_CustomEvent_AIController;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult Result, class AAIController* AIController)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable_1;                       // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          ___bool_Has_Been_Initd_Variable_1;                 // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable_2;                       // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Has_Been_Initd_Variable_2;                 // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameAIController*                      K2Node_DynamicCast_AsGame_AIController;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Has_Been_Initd_Variable_3;                 // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_Result_1;                       // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_CustomEvent_AIController_1;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsClient_ReturnValue;                     // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Vector_Distance2D_ReturnValue;            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAITask_MoveTo*                         CallFunc_AIMoveTo_ReturnValue;                     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable_3;                       // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameAIController*                      K2Node_DynamicCast_AsGame_AIController_1;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult Result, class AAIController* AIController)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00DC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAITask_MoveTo*                         CallFunc_AIMoveTo_ReturnValue_1;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance2D_ReturnValue_1;          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance2D_ReturnValue_2;          // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_2;                 // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance2D_ReturnValue_3;          // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Vector_Distance2D_ReturnValue_4;          // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_3;                 // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_7;        // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance2D_ReturnValue_5;          // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnteringBunker_ReturnValue;             // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x01BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInBunker_ReturnValue;                   // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLeavingingBunker_ReturnValue;           // 0x01BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x01BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x01BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CancleAllSkill_ReturnValue;               // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_WalkSpeed;                      // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC) == 0x000008, "Wrong alignment on BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC");
static_assert(sizeof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC) == 0x0001C8, "Wrong size on BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, EntryPoint) == 0x000000, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, K2Node_CustomEvent_Result) == 0x000004, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, K2Node_CustomEvent_AIController) == 0x000008, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::K2Node_CustomEvent_AIController' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, ___bool_IsClosed_Variable) == 0x000030, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, ___bool_Has_Been_Initd_Variable) == 0x000031, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, ___bool_IsClosed_Variable_1) == 0x000032, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::___bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, K2Node_CreateDelegate_OutputDelegate_2) == 0x000034, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, ___bool_Has_Been_Initd_Variable_1) == 0x000044, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::___bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, ___bool_IsClosed_Variable_2) == 0x000045, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::___bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, ___bool_Has_Been_Initd_Variable_2) == 0x000046, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::___bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, K2Node_Event_DeltaSeconds) == 0x000048, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_GetController_ReturnValue) == 0x000050, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, K2Node_DynamicCast_AsGame_AIController) == 0x000058, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::K2Node_DynamicCast_AsGame_AIController' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, ___bool_Has_Been_Initd_Variable_3) == 0x000061, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::___bool_Has_Been_Initd_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_Not_PreBool_ReturnValue) == 0x000062, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, K2Node_CustomEvent_Result_1) == 0x000063, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::K2Node_CustomEvent_Result_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, K2Node_CustomEvent_AIController_1) == 0x000068, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::K2Node_CustomEvent_AIController_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000070, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_BooleanAND_ReturnValue) == 0x00007C, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_GetPlayerController_ReturnValue) == 0x000080, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_IsValid_ReturnValue_1) == 0x000089, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_IsClient_ReturnValue) == 0x00008A, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_IsClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_K2_GetPawn_ReturnValue) == 0x000090, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_IsValid_ReturnValue_2) == 0x000098, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00009C, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000A8, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_Vector_Distance2D_ReturnValue) == 0x0000AC, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_Vector_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000B0, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_AIMoveTo_ReturnValue) == 0x0000B8, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_AIMoveTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_BooleanAND_ReturnValue_1) == 0x0000C0, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_IsValid_ReturnValue_3) == 0x0000C1, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000C2, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, ___bool_IsClosed_Variable_3) == 0x0000C3, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::___bool_IsClosed_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_GetController_ReturnValue_1) == 0x0000C8, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_GetController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, K2Node_DynamicCast_AsGame_AIController_1) == 0x0000D0, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::K2Node_DynamicCast_AsGame_AIController_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000DC, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_AIMoveTo_ReturnValue_1) == 0x0000F0, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_AIMoveTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_IsValid_ReturnValue_4) == 0x0000F8, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0000FC, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_GetPlayerController_ReturnValue_1) == 0x000108, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_IsValid_ReturnValue_5) == 0x000110, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000118, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_IsValid_ReturnValue_6) == 0x000120, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000124, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_Vector_Distance2D_ReturnValue_1) == 0x000130, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_Vector_Distance2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_MakeVector_ReturnValue) == 0x000134, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_Less_FloatFloat_ReturnValue) == 0x000140, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_Not_PreBool_ReturnValue_2) == 0x000141, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000142, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_BooleanAND_ReturnValue_2) == 0x000143, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x000144, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_GetPlayerController_ReturnValue_2) == 0x000150, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_Vector_Distance2D_ReturnValue_2) == 0x000158, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_Vector_Distance2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_K2_GetPawn_ReturnValue_2) == 0x000160, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_K2_GetPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x000168, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_Vector_Distance2D_ReturnValue_3) == 0x000174, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_Vector_Distance2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_K2_GetActorLocation_ReturnValue_6) == 0x000178, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_K2_GetActorLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000184, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_Vector_Distance2D_ReturnValue_4) == 0x000188, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_Vector_Distance2D_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_BooleanOR_ReturnValue) == 0x00018C, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_GetPlayerController_ReturnValue_3) == 0x000190, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_K2_GetPawn_ReturnValue_3) == 0x000198, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_K2_GetPawn_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_K2_GetActorLocation_ReturnValue_7) == 0x0001A0, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_K2_GetActorLocation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_Vector_Distance2D_ReturnValue_5) == 0x0001AC, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_Vector_Distance2D_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_Not_PreBool_ReturnValue_3) == 0x0001B0, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001B4, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x0001B8, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_BooleanOR_ReturnValue_1) == 0x0001B9, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_IsEnteringBunker_ReturnValue) == 0x0001BA, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_IsEnteringBunker_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_BooleanOR_ReturnValue_2) == 0x0001BB, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_IsInBunker_ReturnValue) == 0x0001BC, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_IsInBunker_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_IsLeavingingBunker_ReturnValue) == 0x0001BD, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_IsLeavingingBunker_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_BooleanOR_ReturnValue_3) == 0x0001BE, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_BooleanOR_ReturnValue_4) == 0x0001BF, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, CallFunc_CancleAllSkill_ReturnValue) == 0x0001C0, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::CallFunc_CancleAllSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC, K2Node_CustomEvent_WalkSpeed) == 0x0001C4, "Member 'BP_Mon_102_NPC_C_ExecuteUbergraph_BP_Mon_102_NPC::K2Node_CustomEvent_WalkSpeed' has a wrong offset!");

// LuaFunction BP_Mon_102_NPC.BP_Mon_102_NPC_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Mon_102_NPC_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_102_NPC_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Mon_102_NPC_C_ReceiveTick");
static_assert(sizeof(BP_Mon_102_NPC_C_ReceiveTick) == 0x000004, "Wrong size on BP_Mon_102_NPC_C_ReceiveTick");
static_assert(offsetof(BP_Mon_102_NPC_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Mon_102_NPC_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Mon_102_NPC.BP_Mon_102_NPC_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_Mon_102_NPC_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_102_NPC_C_GetModuleName) == 0x000008, "Wrong alignment on BP_Mon_102_NPC_C_GetModuleName");
static_assert(sizeof(BP_Mon_102_NPC_C_GetModuleName) == 0x000010, "Wrong size on BP_Mon_102_NPC_C_GetModuleName");
static_assert(offsetof(BP_Mon_102_NPC_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_Mon_102_NPC_C_GetModuleName::ReturnValue' has a wrong offset!");

}

