#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon107_Body_Part01

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mon107_Body_Part01.BP_Mon107_Body_Part01_C
// 0x0018 (0x04B8 - 0x04A0)
class ABP_Mon107_Body_Part01_C final : public ACharacterAccessory
{
public:
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         ID;                                                // 0x04A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AC[0x4];                                      // 0x04AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      Particle;                                          // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Destruction();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mon107_Body_Part01_C">();
	}
	static class ABP_Mon107_Body_Part01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mon107_Body_Part01_C>();
	}
};
static_assert(alignof(ABP_Mon107_Body_Part01_C) == 0x000008, "Wrong alignment on ABP_Mon107_Body_Part01_C");
static_assert(sizeof(ABP_Mon107_Body_Part01_C) == 0x0004B8, "Wrong size on ABP_Mon107_Body_Part01_C");
static_assert(offsetof(ABP_Mon107_Body_Part01_C, SkeletalMesh) == 0x0004A0, "Member 'ABP_Mon107_Body_Part01_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_Mon107_Body_Part01_C, ID) == 0x0004A8, "Member 'ABP_Mon107_Body_Part01_C::ID' has a wrong offset!");
static_assert(offsetof(ABP_Mon107_Body_Part01_C, Particle) == 0x0004B0, "Member 'ABP_Mon107_Body_Part01_C::Particle' has a wrong offset!");

}

