#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_002b

#include "Basic.hpp"

#include "BaseMonster_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mon_002b.BP_Mon_002b_C
// 0x0020 (0x13B0 - 0x1390)
class ABP_Mon_002b_C final : public ABaseMonster_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Mon_002b_C;                      // 0x1390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Weak;                                              // 0x1398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Friction;                                          // 0x13A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_BP_Mon_002b(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mon_002b_C">();
	}
	static class ABP_Mon_002b_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mon_002b_C>();
	}
};
static_assert(alignof(ABP_Mon_002b_C) == 0x000010, "Wrong alignment on ABP_Mon_002b_C");
static_assert(sizeof(ABP_Mon_002b_C) == 0x0013B0, "Wrong size on ABP_Mon_002b_C");
static_assert(offsetof(ABP_Mon_002b_C, UberGraphFrame_BP_Mon_002b_C) == 0x001390, "Member 'ABP_Mon_002b_C::UberGraphFrame_BP_Mon_002b_C' has a wrong offset!");
static_assert(offsetof(ABP_Mon_002b_C, Weak) == 0x001398, "Member 'ABP_Mon_002b_C::Weak' has a wrong offset!");
static_assert(offsetof(ABP_Mon_002b_C, Friction) == 0x0013A0, "Member 'ABP_Mon_002b_C::Friction' has a wrong offset!");

}

