#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_103a_WP01

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Mon_103a_WP01.BP_Mon_103a_WP01_C.OnOwnerDiePerform
// 0x0008 (0x0008 - 0x0000)
struct BP_Mon_103a_WP01_C_OnOwnerDiePerform final
{
public:
	class AGameCharacter*                         OwnerCharacter;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_103a_WP01_C_OnOwnerDiePerform) == 0x000008, "Wrong alignment on BP_Mon_103a_WP01_C_OnOwnerDiePerform");
static_assert(sizeof(BP_Mon_103a_WP01_C_OnOwnerDiePerform) == 0x000008, "Wrong size on BP_Mon_103a_WP01_C_OnOwnerDiePerform");
static_assert(offsetof(BP_Mon_103a_WP01_C_OnOwnerDiePerform, OwnerCharacter) == 0x000000, "Member 'BP_Mon_103a_WP01_C_OnOwnerDiePerform::OwnerCharacter' has a wrong offset!");

// Function BP_Mon_103a_WP01.BP_Mon_103a_WP01_C.OwnerCastSpecificSkill
// 0x0020 (0x0020 - 0x0000)
struct BP_Mon_103a_WP01_C_OwnerCastSpecificSkill final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OriginSkills;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UGameAbilityComponent*                  AbilityRef;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_103a_WP01_C_OwnerCastSpecificSkill) == 0x000008, "Wrong alignment on BP_Mon_103a_WP01_C_OwnerCastSpecificSkill");
static_assert(sizeof(BP_Mon_103a_WP01_C_OwnerCastSpecificSkill) == 0x000020, "Wrong size on BP_Mon_103a_WP01_C_OwnerCastSpecificSkill");
static_assert(offsetof(BP_Mon_103a_WP01_C_OwnerCastSpecificSkill, SkillID) == 0x000000, "Member 'BP_Mon_103a_WP01_C_OwnerCastSpecificSkill::SkillID' has a wrong offset!");
static_assert(offsetof(BP_Mon_103a_WP01_C_OwnerCastSpecificSkill, OriginSkills) == 0x000008, "Member 'BP_Mon_103a_WP01_C_OwnerCastSpecificSkill::OriginSkills' has a wrong offset!");
static_assert(offsetof(BP_Mon_103a_WP01_C_OwnerCastSpecificSkill, AbilityRef) == 0x000018, "Member 'BP_Mon_103a_WP01_C_OwnerCastSpecificSkill::AbilityRef' has a wrong offset!");

// Function BP_Mon_103a_WP01.BP_Mon_103a_WP01_C.ExecuteUbergraph_BP_Mon_103a_WP01
// 0x00A0 (0x00A0 - 0x0000)
struct BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SkillID, TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_Event_OwnerCharacter;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetGameCharacter_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAICharacter*                       K2Node_DynamicCast_AsGame_AICharacter;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_StartCharacterState_ReturnValue;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SkillID;                        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_CustomEvent_OriginSkills;                   // 0x0068(0x0010)(ConstParm, ReferenceParm)
	class UGameAbilityComponent*                  K2Node_CustomEvent_AbilityRef;                     // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x0088(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_StartCharacterState_ReturnValue_1;        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01) == 0x000008, "Wrong alignment on BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01");
static_assert(sizeof(BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01) == 0x0000A0, "Wrong size on BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01");
static_assert(offsetof(BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01, EntryPoint) == 0x000000, "Member 'BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01, CallFunc_Lerp_ReturnValue_1) == 0x000018, "Member 'BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01, K2Node_Event_OwnerCharacter) == 0x000020, "Member 'BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01::K2Node_Event_OwnerCharacter' has a wrong offset!");
static_assert(offsetof(BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01, CallFunc_GetGameCharacter_ReturnValue) == 0x000030, "Member 'BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01::CallFunc_GetGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01, K2Node_DynamicCast_AsGame_AICharacter) == 0x000040, "Member 'BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01::K2Node_DynamicCast_AsGame_AICharacter' has a wrong offset!");
static_assert(offsetof(BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01, K2Node_MakeArray_Array) == 0x000050, "Member 'BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01, CallFunc_StartCharacterState_ReturnValue) == 0x000060, "Member 'BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01::CallFunc_StartCharacterState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01, K2Node_CustomEvent_SkillID) == 0x000064, "Member 'BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01::K2Node_CustomEvent_SkillID' has a wrong offset!");
static_assert(offsetof(BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01, K2Node_CustomEvent_OriginSkills) == 0x000068, "Member 'BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01::K2Node_CustomEvent_OriginSkills' has a wrong offset!");
static_assert(offsetof(BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01, K2Node_CustomEvent_AbilityRef) == 0x000078, "Member 'BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01::K2Node_CustomEvent_AbilityRef' has a wrong offset!");
static_assert(offsetof(BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000080, "Member 'BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000081, "Member 'BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01, K2Node_MakeArray_Array_1) == 0x000088, "Member 'BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01, CallFunc_StartCharacterState_ReturnValue_1) == 0x000098, "Member 'BP_Mon_103a_WP01_C_ExecuteUbergraph_BP_Mon_103a_WP01::CallFunc_StartCharacterState_ReturnValue_1' has a wrong offset!");

}

