#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_003c

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BaseMonster_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mon_003c.BP_Mon_003c_C
// 0x0040 (0x1420 - 0x13E0)
class ABP_Mon_003c_C final : public ABaseMonster_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Mon_003c_C;                      // 0x13E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Weak;                                              // 0x13E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Friction;                                          // 0x13F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMesh*>                  AvailableSkeletalMesh;                             // 0x13F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInterface*>             AvailableMaterial;                                 // 0x1408(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         RandomNum;                                         // 0x1418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Spwaned();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveHitAction(const struct FHitResult& Hit_0);
	void ExecuteUbergraph_BP_Mon_003c(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mon_003c_C">();
	}
	static class ABP_Mon_003c_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mon_003c_C>();
	}
};
static_assert(alignof(ABP_Mon_003c_C) == 0x000010, "Wrong alignment on ABP_Mon_003c_C");
static_assert(sizeof(ABP_Mon_003c_C) == 0x001420, "Wrong size on ABP_Mon_003c_C");
static_assert(offsetof(ABP_Mon_003c_C, UberGraphFrame_BP_Mon_003c_C) == 0x0013E0, "Member 'ABP_Mon_003c_C::UberGraphFrame_BP_Mon_003c_C' has a wrong offset!");
static_assert(offsetof(ABP_Mon_003c_C, Weak) == 0x0013E8, "Member 'ABP_Mon_003c_C::Weak' has a wrong offset!");
static_assert(offsetof(ABP_Mon_003c_C, Friction) == 0x0013F0, "Member 'ABP_Mon_003c_C::Friction' has a wrong offset!");
static_assert(offsetof(ABP_Mon_003c_C, AvailableSkeletalMesh) == 0x0013F8, "Member 'ABP_Mon_003c_C::AvailableSkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_Mon_003c_C, AvailableMaterial) == 0x001408, "Member 'ABP_Mon_003c_C::AvailableMaterial' has a wrong offset!");
static_assert(offsetof(ABP_Mon_003c_C, RandomNum) == 0x001418, "Member 'ABP_Mon_003c_C::RandomNum' has a wrong offset!");

}

