#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_109_WP02

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Mon_109_WP02.BP_Mon_109_WP02_C.ExecuteUbergraph_BP_Mon_109_WP02
// 0x0018 (0x0018 - 0x0000)
struct BP_Mon_109_WP02_C_ExecuteUbergraph_BP_Mon_109_WP02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_Event_OwnerCharacter;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Mon_109_WP02_C_ExecuteUbergraph_BP_Mon_109_WP02) == 0x000008, "Wrong alignment on BP_Mon_109_WP02_C_ExecuteUbergraph_BP_Mon_109_WP02");
static_assert(sizeof(BP_Mon_109_WP02_C_ExecuteUbergraph_BP_Mon_109_WP02) == 0x000018, "Wrong size on BP_Mon_109_WP02_C_ExecuteUbergraph_BP_Mon_109_WP02");
static_assert(offsetof(BP_Mon_109_WP02_C_ExecuteUbergraph_BP_Mon_109_WP02, EntryPoint) == 0x000000, "Member 'BP_Mon_109_WP02_C_ExecuteUbergraph_BP_Mon_109_WP02::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Mon_109_WP02_C_ExecuteUbergraph_BP_Mon_109_WP02, K2Node_Event_OwnerCharacter) == 0x000008, "Member 'BP_Mon_109_WP02_C_ExecuteUbergraph_BP_Mon_109_WP02::K2Node_Event_OwnerCharacter' has a wrong offset!");
static_assert(offsetof(BP_Mon_109_WP02_C_ExecuteUbergraph_BP_Mon_109_WP02, ___bool_IsClosed_Variable) == 0x000010, "Member 'BP_Mon_109_WP02_C_ExecuteUbergraph_BP_Mon_109_WP02::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mon_109_WP02_C_ExecuteUbergraph_BP_Mon_109_WP02, ___bool_Has_Been_Initd_Variable) == 0x000011, "Member 'BP_Mon_109_WP02_C_ExecuteUbergraph_BP_Mon_109_WP02::___bool_Has_Been_Initd_Variable' has a wrong offset!");

// Function BP_Mon_109_WP02.BP_Mon_109_WP02_C.OnOwnerDiePerform
// 0x0008 (0x0008 - 0x0000)
struct BP_Mon_109_WP02_C_OnOwnerDiePerform final
{
public:
	class AGameCharacter*                         OwnerCharacter;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_109_WP02_C_OnOwnerDiePerform) == 0x000008, "Wrong alignment on BP_Mon_109_WP02_C_OnOwnerDiePerform");
static_assert(sizeof(BP_Mon_109_WP02_C_OnOwnerDiePerform) == 0x000008, "Wrong size on BP_Mon_109_WP02_C_OnOwnerDiePerform");
static_assert(offsetof(BP_Mon_109_WP02_C_OnOwnerDiePerform, OwnerCharacter) == 0x000000, "Member 'BP_Mon_109_WP02_C_OnOwnerDiePerform::OwnerCharacter' has a wrong offset!");

}

