#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_601

#include "Basic.hpp"

#include "BaseMonster_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mon_601.BP_Mon_601_C
// 0x0030 (0x13C0 - 0x1390)
class ABP_Mon_601_C final : public ABaseMonster_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Mon_601_C;                       // 0x1390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Weak;                                              // 0x1398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Friction;                                          // 0x13A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDamagePoint_C*                         DamagePoint;                                       // 0x13A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         CAngle;                                            // 0x13B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BulletCount;                                       // 0x13B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Mon_601(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnDie(class AGameCharacter* Who, class AGameCharacter* Killer, const struct FHealthChangeValue& HealthChangeValue);
	void Spwaned();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mon_601_C">();
	}
	static class ABP_Mon_601_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mon_601_C>();
	}
};
static_assert(alignof(ABP_Mon_601_C) == 0x000010, "Wrong alignment on ABP_Mon_601_C");
static_assert(sizeof(ABP_Mon_601_C) == 0x0013C0, "Wrong size on ABP_Mon_601_C");
static_assert(offsetof(ABP_Mon_601_C, UberGraphFrame_BP_Mon_601_C) == 0x001390, "Member 'ABP_Mon_601_C::UberGraphFrame_BP_Mon_601_C' has a wrong offset!");
static_assert(offsetof(ABP_Mon_601_C, Weak) == 0x001398, "Member 'ABP_Mon_601_C::Weak' has a wrong offset!");
static_assert(offsetof(ABP_Mon_601_C, Friction) == 0x0013A0, "Member 'ABP_Mon_601_C::Friction' has a wrong offset!");
static_assert(offsetof(ABP_Mon_601_C, DamagePoint) == 0x0013A8, "Member 'ABP_Mon_601_C::DamagePoint' has a wrong offset!");
static_assert(offsetof(ABP_Mon_601_C, CAngle) == 0x0013B0, "Member 'ABP_Mon_601_C::CAngle' has a wrong offset!");
static_assert(offsetof(ABP_Mon_601_C, BulletCount) == 0x0013B4, "Member 'ABP_Mon_601_C::BulletCount' has a wrong offset!");

}

