#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_102_NPC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BaseSummon_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mon_102_NPC.BP_Mon_102_NPC_C
// 0x0050 (0x13D0 - 0x1380)
class ABP_Mon_102_NPC_C final : public ABaseSummon_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNpcAIDebugComponent*                   NpcAIDebug;                                        // 0x1380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Weak;                                              // 0x1388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Friction;                                          // 0x1390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bMoveFinished;                                     // 0x1398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1399[0x3];                                     // 0x1399(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                GoalLocation;                                      // 0x139C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GoalDistance;                                      // 0x13A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13AC[0x4];                                     // 0x13AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  GoalActor;                                         // 0x13B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLevelNeedFollow;                                  // 0x13B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bLevelNeedApproachPlayer;                          // 0x13B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bLevelNeedApproach_Road;                           // 0x13BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13BB[0x1];                                     // 0x13BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         X;                                                 // 0x13BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Y;                                                 // 0x13C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Z;                                                 // 0x13C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void LevelSetapproachRoad(float X_0, float Y_0, float Z_0);
	void LevelSetApproachPlayerFunction();
	void LevelSetFollowFunction();
	void OnMoveFinished_7864EDE5435D1C1C6E7A5EAEBCBC0A89(EPathFollowingResult Result, class AAIController* AIController);
	void OnRequestFailed_7864EDE5435D1C1C6E7A5EAEBCBC0A89();
	void OnMoveFinished_F4481B504C38CF5076560CADDABA6AFE(EPathFollowingResult Result, class AAIController* AIController);
	void OnRequestFailed_F4481B504C38CF5076560CADDABA6AFE();
	void ReceiveTick__Overridden(float DeltaSeconds);
	void ResetLogicAndSpeed(float WalkSpeed);
	void ExecuteUbergraph_BP_Mon_102_NPC(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mon_102_NPC_C">();
	}
	static class ABP_Mon_102_NPC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mon_102_NPC_C>();
	}
};
static_assert(alignof(ABP_Mon_102_NPC_C) == 0x000010, "Wrong alignment on ABP_Mon_102_NPC_C");
static_assert(sizeof(ABP_Mon_102_NPC_C) == 0x0013D0, "Wrong size on ABP_Mon_102_NPC_C");
static_assert(offsetof(ABP_Mon_102_NPC_C, UberGraphFrame) == 0x001378, "Member 'ABP_Mon_102_NPC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Mon_102_NPC_C, NpcAIDebug) == 0x001380, "Member 'ABP_Mon_102_NPC_C::NpcAIDebug' has a wrong offset!");
static_assert(offsetof(ABP_Mon_102_NPC_C, Weak) == 0x001388, "Member 'ABP_Mon_102_NPC_C::Weak' has a wrong offset!");
static_assert(offsetof(ABP_Mon_102_NPC_C, Friction) == 0x001390, "Member 'ABP_Mon_102_NPC_C::Friction' has a wrong offset!");
static_assert(offsetof(ABP_Mon_102_NPC_C, bMoveFinished) == 0x001398, "Member 'ABP_Mon_102_NPC_C::bMoveFinished' has a wrong offset!");
static_assert(offsetof(ABP_Mon_102_NPC_C, GoalLocation) == 0x00139C, "Member 'ABP_Mon_102_NPC_C::GoalLocation' has a wrong offset!");
static_assert(offsetof(ABP_Mon_102_NPC_C, GoalDistance) == 0x0013A8, "Member 'ABP_Mon_102_NPC_C::GoalDistance' has a wrong offset!");
static_assert(offsetof(ABP_Mon_102_NPC_C, GoalActor) == 0x0013B0, "Member 'ABP_Mon_102_NPC_C::GoalActor' has a wrong offset!");
static_assert(offsetof(ABP_Mon_102_NPC_C, bLevelNeedFollow) == 0x0013B8, "Member 'ABP_Mon_102_NPC_C::bLevelNeedFollow' has a wrong offset!");
static_assert(offsetof(ABP_Mon_102_NPC_C, bLevelNeedApproachPlayer) == 0x0013B9, "Member 'ABP_Mon_102_NPC_C::bLevelNeedApproachPlayer' has a wrong offset!");
static_assert(offsetof(ABP_Mon_102_NPC_C, bLevelNeedApproach_Road) == 0x0013BA, "Member 'ABP_Mon_102_NPC_C::bLevelNeedApproach_Road' has a wrong offset!");
static_assert(offsetof(ABP_Mon_102_NPC_C, X) == 0x0013BC, "Member 'ABP_Mon_102_NPC_C::X' has a wrong offset!");
static_assert(offsetof(ABP_Mon_102_NPC_C, Y) == 0x0013C0, "Member 'ABP_Mon_102_NPC_C::Y' has a wrong offset!");
static_assert(offsetof(ABP_Mon_102_NPC_C, Z) == 0x0013C4, "Member 'ABP_Mon_102_NPC_C::Z' has a wrong offset!");

}

