#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_111_Part01a

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mon_111_Part01a.BP_Mon_111_Part01a_C
// 0x0018 (0x05A0 - 0x0588)
class ABP_Mon_111_Part01a_C final : public AAccessory_Destructible
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0588(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         EnergyEffectId;                                    // 0x0598(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Mon_111_Part01a(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void OnOwnerDiePerform(class AGameCharacter* OwnerCharacter);
	void OnDestructed(class AGameCharacter* InBreaker, const struct FHealthChangeValue& InHealthChangeValue);
	void CheckOwnerIsInvincible();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mon_111_Part01a_C">();
	}
	static class ABP_Mon_111_Part01a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mon_111_Part01a_C>();
	}
};
static_assert(alignof(ABP_Mon_111_Part01a_C) == 0x000008, "Wrong alignment on ABP_Mon_111_Part01a_C");
static_assert(sizeof(ABP_Mon_111_Part01a_C) == 0x0005A0, "Wrong size on ABP_Mon_111_Part01a_C");
static_assert(offsetof(ABP_Mon_111_Part01a_C, UberGraphFrame) == 0x000588, "Member 'ABP_Mon_111_Part01a_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Mon_111_Part01a_C, SkeletalMesh) == 0x000590, "Member 'ABP_Mon_111_Part01a_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_Mon_111_Part01a_C, EnergyEffectId) == 0x000598, "Member 'ABP_Mon_111_Part01a_C::EnergyEffectId' has a wrong offset!");

}

