#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_101

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Mon_101.BP_Mon_101_C.ExecuteUbergraph_BP_Mon_101
// 0x0230 (0x0230 - 0x0000)
struct BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SkillID;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_CustomEvent_OriginSkills;                   // 0x0008(0x0010)(ConstParm, ReferenceParm)
	class UGameAbilityComponent*                  K2Node_CustomEvent_AbilityRef;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SkillID, TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Has_Been_Initd_Variable_1;                 // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable_1;                       // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Has_Been_Initd_Variable_2;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsModifierExist_ReturnValue;              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable_2;                       // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeModifier_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsInStun_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0088(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_GetIsInBreathless_ReturnValue;            // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsInAbnormal_ReturnValue;              // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0117(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0118(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x01A4(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101) == 0x000008, "Wrong alignment on BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101");
static_assert(sizeof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101) == 0x000230, "Wrong size on BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, EntryPoint) == 0x000000, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, K2Node_CustomEvent_SkillID) == 0x000004, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::K2Node_CustomEvent_SkillID' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, K2Node_CustomEvent_OriginSkills) == 0x000008, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::K2Node_CustomEvent_OriginSkills' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, K2Node_CustomEvent_AbilityRef) == 0x000018, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::K2Node_CustomEvent_AbilityRef' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, CallFunc_Lerp_ReturnValue) == 0x000024, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, CallFunc_MakeVector_ReturnValue) == 0x000028, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, CallFunc_Lerp_ReturnValue_1) == 0x000034, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, CallFunc_MakeVector_ReturnValue_1) == 0x000048, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, ___bool_IsClosed_Variable) == 0x000054, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, ___bool_Has_Been_Initd_Variable) == 0x000055, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, ___bool_Has_Been_Initd_Variable_1) == 0x000056, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::___bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, ___bool_IsClosed_Variable_1) == 0x000057, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::___bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, ___bool_Has_Been_Initd_Variable_2) == 0x000058, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::___bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, K2Node_Event_DeltaSeconds) == 0x00005C, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, CallFunc_IsModifierExist_ReturnValue) == 0x000060, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::CallFunc_IsModifierExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000068, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, ___bool_IsClosed_Variable_2) == 0x000071, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::___bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000074, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, CallFunc_MakeModifier_ReturnValue) == 0x000080, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::CallFunc_MakeModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, CallFunc_GetIsInStun_ReturnValue) == 0x000084, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::CallFunc_GetIsInStun_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000088, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, CallFunc_GetIsInBreathless_ReturnValue) == 0x000114, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::CallFunc_GetIsInBreathless_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, CallFunc_GetIsInAbnormal_ReturnValue) == 0x000115, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::CallFunc_GetIsInAbnormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, CallFunc_BooleanOR_ReturnValue) == 0x000116, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, CallFunc_BooleanAND_ReturnValue) == 0x000117, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x000118, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101, CallFunc_K2_SetRelativeLocation_SweepHitResult_2) == 0x0001A4, "Member 'BP_Mon_101_C_ExecuteUbergraph_BP_Mon_101::CallFunc_K2_SetRelativeLocation_SweepHitResult_2' has a wrong offset!");

// Function BP_Mon_101.BP_Mon_101_C.CastSpecificSkill
// 0x0020 (0x0020 - 0x0000)
struct BP_Mon_101_C_CastSpecificSkill final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OriginSkills;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UGameAbilityComponent*                  AbilityRef;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_101_C_CastSpecificSkill) == 0x000008, "Wrong alignment on BP_Mon_101_C_CastSpecificSkill");
static_assert(sizeof(BP_Mon_101_C_CastSpecificSkill) == 0x000020, "Wrong size on BP_Mon_101_C_CastSpecificSkill");
static_assert(offsetof(BP_Mon_101_C_CastSpecificSkill, SkillID) == 0x000000, "Member 'BP_Mon_101_C_CastSpecificSkill::SkillID' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_CastSpecificSkill, OriginSkills) == 0x000008, "Member 'BP_Mon_101_C_CastSpecificSkill::OriginSkills' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_CastSpecificSkill, AbilityRef) == 0x000018, "Member 'BP_Mon_101_C_CastSpecificSkill::AbilityRef' has a wrong offset!");

// Function BP_Mon_101.BP_Mon_101_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Mon_101_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_101_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Mon_101_C_ReceiveTick");
static_assert(sizeof(BP_Mon_101_C_ReceiveTick) == 0x000004, "Wrong size on BP_Mon_101_C_ReceiveTick");
static_assert(offsetof(BP_Mon_101_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Mon_101_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Mon_101.BP_Mon_101_C.Get Current Health Rate
// 0x0010 (0x0010 - 0x0000)
struct BP_Mon_101_C_Get_Current_Health_Rate final
{
public:
	float                                         HealthRate;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRolePropertieMaxValue_ReturnValue;     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRolePropertieValue_ReturnValue;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_101_C_Get_Current_Health_Rate) == 0x000004, "Wrong alignment on BP_Mon_101_C_Get_Current_Health_Rate");
static_assert(sizeof(BP_Mon_101_C_Get_Current_Health_Rate) == 0x000010, "Wrong size on BP_Mon_101_C_Get_Current_Health_Rate");
static_assert(offsetof(BP_Mon_101_C_Get_Current_Health_Rate, HealthRate) == 0x000000, "Member 'BP_Mon_101_C_Get_Current_Health_Rate::HealthRate' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_Get_Current_Health_Rate, CallFunc_GetRolePropertieMaxValue_ReturnValue) == 0x000004, "Member 'BP_Mon_101_C_Get_Current_Health_Rate::CallFunc_GetRolePropertieMaxValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_Get_Current_Health_Rate, CallFunc_GetRolePropertieValue_ReturnValue) == 0x000008, "Member 'BP_Mon_101_C_Get_Current_Health_Rate::CallFunc_GetRolePropertieValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_Get_Current_Health_Rate, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_Mon_101_C_Get_Current_Health_Rate::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_Mon_101.BP_Mon_101_C.CheckStageWake
// 0x0008 (0x0008 - 0x0000)
struct BP_Mon_101_C_CheckStageWake final
{
public:
	int32                                         _stage;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsInBreathless_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Mon_101_C_CheckStageWake) == 0x000004, "Wrong alignment on BP_Mon_101_C_CheckStageWake");
static_assert(sizeof(BP_Mon_101_C_CheckStageWake) == 0x000008, "Wrong size on BP_Mon_101_C_CheckStageWake");
static_assert(offsetof(BP_Mon_101_C_CheckStageWake, _stage) == 0x000000, "Member 'BP_Mon_101_C_CheckStageWake::_stage' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_CheckStageWake, CallFunc_GetIsInBreathless_ReturnValue) == 0x000004, "Member 'BP_Mon_101_C_CheckStageWake::CallFunc_GetIsInBreathless_ReturnValue' has a wrong offset!");

// Function BP_Mon_101.BP_Mon_101_C.ReceiveIsAllowAimed
// 0x0010 (0x0010 - 0x0000)
struct BP_Mon_101_C_ReceiveIsAllowAimed final
{
public:
	const class AGameCharacter*                   CurrentInstigator;                                 // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Mon_101_C_ReceiveIsAllowAimed) == 0x000008, "Wrong alignment on BP_Mon_101_C_ReceiveIsAllowAimed");
static_assert(sizeof(BP_Mon_101_C_ReceiveIsAllowAimed) == 0x000010, "Wrong size on BP_Mon_101_C_ReceiveIsAllowAimed");
static_assert(offsetof(BP_Mon_101_C_ReceiveIsAllowAimed, CurrentInstigator) == 0x000000, "Member 'BP_Mon_101_C_ReceiveIsAllowAimed::CurrentInstigator' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ReceiveIsAllowAimed, ReturnValue) == 0x000008, "Member 'BP_Mon_101_C_ReceiveIsAllowAimed::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_101_C_ReceiveIsAllowAimed, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'BP_Mon_101_C_ReceiveIsAllowAimed::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

