#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_109

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Mon_109.BP_Mon_109_C.CheckStageWake
// 0x0008 (0x0008 - 0x0000)
struct BP_Mon_109_C_CheckStageWake final
{
public:
	int32                                         _stage;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsInBreathless_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Mon_109_C_CheckStageWake) == 0x000004, "Wrong alignment on BP_Mon_109_C_CheckStageWake");
static_assert(sizeof(BP_Mon_109_C_CheckStageWake) == 0x000008, "Wrong size on BP_Mon_109_C_CheckStageWake");
static_assert(offsetof(BP_Mon_109_C_CheckStageWake, _stage) == 0x000000, "Member 'BP_Mon_109_C_CheckStageWake::_stage' has a wrong offset!");
static_assert(offsetof(BP_Mon_109_C_CheckStageWake, CallFunc_GetIsInBreathless_ReturnValue) == 0x000004, "Member 'BP_Mon_109_C_CheckStageWake::CallFunc_GetIsInBreathless_ReturnValue' has a wrong offset!");

// Function BP_Mon_109.BP_Mon_109_C.Get Current Health Rate
// 0x0010 (0x0010 - 0x0000)
struct BP_Mon_109_C_Get_Current_Health_Rate final
{
public:
	float                                         HealthRate;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRolePropertieMaxValue_ReturnValue;     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRolePropertieValue_ReturnValue;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_109_C_Get_Current_Health_Rate) == 0x000004, "Wrong alignment on BP_Mon_109_C_Get_Current_Health_Rate");
static_assert(sizeof(BP_Mon_109_C_Get_Current_Health_Rate) == 0x000010, "Wrong size on BP_Mon_109_C_Get_Current_Health_Rate");
static_assert(offsetof(BP_Mon_109_C_Get_Current_Health_Rate, HealthRate) == 0x000000, "Member 'BP_Mon_109_C_Get_Current_Health_Rate::HealthRate' has a wrong offset!");
static_assert(offsetof(BP_Mon_109_C_Get_Current_Health_Rate, CallFunc_GetRolePropertieMaxValue_ReturnValue) == 0x000004, "Member 'BP_Mon_109_C_Get_Current_Health_Rate::CallFunc_GetRolePropertieMaxValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_109_C_Get_Current_Health_Rate, CallFunc_GetRolePropertieValue_ReturnValue) == 0x000008, "Member 'BP_Mon_109_C_Get_Current_Health_Rate::CallFunc_GetRolePropertieValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_109_C_Get_Current_Health_Rate, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_Mon_109_C_Get_Current_Health_Rate::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_Mon_109.BP_Mon_109_C.ReceiveIsAllowAimed
// 0x0010 (0x0010 - 0x0000)
struct BP_Mon_109_C_ReceiveIsAllowAimed final
{
public:
	const class AGameCharacter*                   CurrentInstigator;                                 // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsModifierExist_ReturnValue;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Mon_109_C_ReceiveIsAllowAimed) == 0x000008, "Wrong alignment on BP_Mon_109_C_ReceiveIsAllowAimed");
static_assert(sizeof(BP_Mon_109_C_ReceiveIsAllowAimed) == 0x000010, "Wrong size on BP_Mon_109_C_ReceiveIsAllowAimed");
static_assert(offsetof(BP_Mon_109_C_ReceiveIsAllowAimed, CurrentInstigator) == 0x000000, "Member 'BP_Mon_109_C_ReceiveIsAllowAimed::CurrentInstigator' has a wrong offset!");
static_assert(offsetof(BP_Mon_109_C_ReceiveIsAllowAimed, ReturnValue) == 0x000008, "Member 'BP_Mon_109_C_ReceiveIsAllowAimed::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_109_C_ReceiveIsAllowAimed, CallFunc_IsModifierExist_ReturnValue) == 0x000009, "Member 'BP_Mon_109_C_ReceiveIsAllowAimed::CallFunc_IsModifierExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_109_C_ReceiveIsAllowAimed, CallFunc_Not_PreBool_ReturnValue) == 0x00000A, "Member 'BP_Mon_109_C_ReceiveIsAllowAimed::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

