#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_110a

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_Mon_110a.BP_Mon_110a_C.Breathless
// 0x0060 (0x0060 - 0x0000)
struct BP_Mon_110a_C_Breathless final
{
public:
	struct FAbnormalInfo                          AbnormalInfo;                                      // 0x0000(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bAdd;                                              // 0x0058(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bNewApply;                                         // 0x0059(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bForceRemove;                                      // 0x005A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Mon_110a_C_Breathless) == 0x000008, "Wrong alignment on BP_Mon_110a_C_Breathless");
static_assert(sizeof(BP_Mon_110a_C_Breathless) == 0x000060, "Wrong size on BP_Mon_110a_C_Breathless");
static_assert(offsetof(BP_Mon_110a_C_Breathless, AbnormalInfo) == 0x000000, "Member 'BP_Mon_110a_C_Breathless::AbnormalInfo' has a wrong offset!");
static_assert(offsetof(BP_Mon_110a_C_Breathless, bAdd) == 0x000058, "Member 'BP_Mon_110a_C_Breathless::bAdd' has a wrong offset!");
static_assert(offsetof(BP_Mon_110a_C_Breathless, bNewApply) == 0x000059, "Member 'BP_Mon_110a_C_Breathless::bNewApply' has a wrong offset!");
static_assert(offsetof(BP_Mon_110a_C_Breathless, bForceRemove) == 0x00005A, "Member 'BP_Mon_110a_C_Breathless::bForceRemove' has a wrong offset!");

// Function BP_Mon_110a.BP_Mon_110a_C.ExecuteUbergraph_BP_Mon_110a
// 0x00B8 (0x00B8 - 0x0000)
struct BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FAbnormalInfo& AbnormalInfo, bool bAdd, bool bNewApply, bool bForceRemove)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbnormalInfo                          K2Node_CustomEvent_AbnormalInfo;                   // 0x0018(0x0058)(ConstParm)
	bool                                          K2Node_CustomEvent_bAdd;                           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bNewApply;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bForceRemove;                   // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_1;        // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_2;        // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_3;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_4;        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_5;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_6;        // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_7;        // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a) == 0x000008, "Wrong alignment on BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a");
static_assert(sizeof(BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a) == 0x0000B8, "Wrong size on BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a");
static_assert(offsetof(BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a, EntryPoint) == 0x000000, "Member 'BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a, K2Node_CustomEvent_AbnormalInfo) == 0x000018, "Member 'BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a::K2Node_CustomEvent_AbnormalInfo' has a wrong offset!");
static_assert(offsetof(BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a, K2Node_CustomEvent_bAdd) == 0x000070, "Member 'BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a::K2Node_CustomEvent_bAdd' has a wrong offset!");
static_assert(offsetof(BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a, K2Node_CustomEvent_bNewApply) == 0x000071, "Member 'BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a::K2Node_CustomEvent_bNewApply' has a wrong offset!");
static_assert(offsetof(BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a, K2Node_CustomEvent_bForceRemove) == 0x000072, "Member 'BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a::K2Node_CustomEvent_bForceRemove' has a wrong offset!");
static_assert(offsetof(BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000073, "Member 'BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a, CallFunc_BooleanAND_ReturnValue) == 0x000074, "Member 'BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000078, "Member 'BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a, CallFunc_SpawnSystemAttached_ReturnValue_1) == 0x000080, "Member 'BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a::CallFunc_SpawnSystemAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a, CallFunc_SpawnSystemAttached_ReturnValue_2) == 0x000088, "Member 'BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a::CallFunc_SpawnSystemAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a, CallFunc_SpawnSystemAttached_ReturnValue_3) == 0x000090, "Member 'BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a::CallFunc_SpawnSystemAttached_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a, CallFunc_SpawnSystemAttached_ReturnValue_4) == 0x000098, "Member 'BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a::CallFunc_SpawnSystemAttached_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a, CallFunc_SpawnSystemAttached_ReturnValue_5) == 0x0000A0, "Member 'BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a::CallFunc_SpawnSystemAttached_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a, CallFunc_SpawnSystemAttached_ReturnValue_6) == 0x0000A8, "Member 'BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a::CallFunc_SpawnSystemAttached_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a, CallFunc_SpawnSystemAttached_ReturnValue_7) == 0x0000B0, "Member 'BP_Mon_110a_C_ExecuteUbergraph_BP_Mon_110a::CallFunc_SpawnSystemAttached_ReturnValue_7' has a wrong offset!");

}

