#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_002_Part01

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Mon_002_Part01.BP_Mon_002_Part01_C.ExecuteUbergraph_BP_Mon_002_Part01
// 0x0270 (0x0270 - 0x0000)
struct BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_Event_OwnerCharacter;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  ___object_Variable;                                // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_InBreaker;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_Event_InHealthChangeValue;                  // 0x0028(0x01B0)(ConstParm, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_IsClosed_Variable;                         // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAbilityCharacterInterface> K2Node_DynamicCast_AsAbility_Character_Interface;  // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  CallFunc_GetAbilityComponent_ReturnValue;          // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue;                // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01) == 0x000008, "Wrong alignment on BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01");
static_assert(sizeof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01) == 0x000270, "Wrong size on BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, EntryPoint) == 0x000000, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, K2Node_Event_OwnerCharacter) == 0x000008, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::K2Node_Event_OwnerCharacter' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, ___bool_Has_Been_Initd_Variable) == 0x000010, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, ___object_Variable) == 0x000018, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::___object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, K2Node_Event_InBreaker) == 0x000020, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::K2Node_Event_InBreaker' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, K2Node_Event_InHealthChangeValue) == 0x000028, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::K2Node_Event_InHealthChangeValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, CallFunc_GetAttachParentActor_ReturnValue) == 0x0001D8, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, ___bool_IsClosed_Variable) == 0x0001E0, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, K2Node_DynamicCast_AsAbility_Character_Interface) == 0x0001E8, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::K2Node_DynamicCast_AsAbility_Character_Interface' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, K2Node_DynamicCast_bSuccess) == 0x0001F8, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, CallFunc_GetAbilityComponent_ReturnValue) == 0x000200, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::CallFunc_GetAbilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, CallFunc_IsValid_ReturnValue) == 0x000208, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, CallFunc_RandomFloatInRange_ReturnValue) == 0x00020C, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000210, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000214, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000218, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x00021C, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, CallFunc_Multiply_IntFloat_ReturnValue_2) == 0x000220, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::CallFunc_Multiply_IntFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, CallFunc_MakeVector_ReturnValue) == 0x000224, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, CallFunc_IsValid_ReturnValue_1) == 0x000230, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, CallFunc_GetOwnerActor_ReturnValue) == 0x000238, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::CallFunc_GetOwnerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000240, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, CallFunc_BreakVector_X) == 0x00024C, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, CallFunc_BreakVector_Y) == 0x000250, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, CallFunc_BreakVector_Z) == 0x000254, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000258, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, CallFunc_MakeVector_ReturnValue_1) == 0x00025C, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000268, "Member 'BP_Mon_002_Part01_C_ExecuteUbergraph_BP_Mon_002_Part01::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

// Function BP_Mon_002_Part01.BP_Mon_002_Part01_C.OnOwnerDiePerform
// 0x0008 (0x0008 - 0x0000)
struct BP_Mon_002_Part01_C_OnOwnerDiePerform final
{
public:
	class AGameCharacter*                         OwnerCharacter;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_002_Part01_C_OnOwnerDiePerform) == 0x000008, "Wrong alignment on BP_Mon_002_Part01_C_OnOwnerDiePerform");
static_assert(sizeof(BP_Mon_002_Part01_C_OnOwnerDiePerform) == 0x000008, "Wrong size on BP_Mon_002_Part01_C_OnOwnerDiePerform");
static_assert(offsetof(BP_Mon_002_Part01_C_OnOwnerDiePerform, OwnerCharacter) == 0x000000, "Member 'BP_Mon_002_Part01_C_OnOwnerDiePerform::OwnerCharacter' has a wrong offset!");

// Function BP_Mon_002_Part01.BP_Mon_002_Part01_C.OnDestructed
// 0x01B8 (0x01B8 - 0x0000)
struct BP_Mon_002_Part01_C_OnDestructed final
{
public:
	class AGameCharacter*                         InBreaker;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     InHealthChangeValue;                               // 0x0008(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Mon_002_Part01_C_OnDestructed) == 0x000008, "Wrong alignment on BP_Mon_002_Part01_C_OnDestructed");
static_assert(sizeof(BP_Mon_002_Part01_C_OnDestructed) == 0x0001B8, "Wrong size on BP_Mon_002_Part01_C_OnDestructed");
static_assert(offsetof(BP_Mon_002_Part01_C_OnDestructed, InBreaker) == 0x000000, "Member 'BP_Mon_002_Part01_C_OnDestructed::InBreaker' has a wrong offset!");
static_assert(offsetof(BP_Mon_002_Part01_C_OnDestructed, InHealthChangeValue) == 0x000008, "Member 'BP_Mon_002_Part01_C_OnDestructed::InHealthChangeValue' has a wrong offset!");

}

