#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_107_Special

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Mon_107_Special.BP_Mon_107_Special_C.ExecuteUbergraph_BP_Mon_107_Special
// 0x03B8 (0x03B8 - 0x0000)
struct BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable_2;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_Event_Who;                                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_Killer;                               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_Event_HealthChangeValue;                    // 0x0040(0x01B0)(ConstParm, ContainsInstancedReference)
	class UActorComponent*                        CallFunc_FindOrAddComponent_ReturnValue;           // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeModifier_ReturnValue;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_2;                    // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGameCharacter*>                 CallFunc_GetAllMembersPtr_ReturnValue;             // 0x0238(0x0010)(ReferenceParm)
	class AGameCharacter*                         CallFunc_Array_Get_Item;                           // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAICharacter*                       K2Node_DynamicCast_AsGame_AICharacter;             // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_262[0x6];                                      // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Mon_103c_C*                         K2Node_DynamicCast_AsBP_Mon_103c;                  // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Mon_103b_C*                         K2Node_DynamicCast_AsBP_Mon_103b;                  // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Mon_103a_C*                         K2Node_DynamicCast_AsBP_Mon_103a;                  // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Mon_104d_C*                         K2Node_DynamicCast_AsBP_Mon_104d;                  // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Mon_104c_C*                         K2Node_DynamicCast_AsBP_Mon_104c;                  // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Mon_112_C*                          K2Node_DynamicCast_AsBP_Mon_112;                   // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Mon_108a_C*                         K2Node_DynamicCast_AsBP_Mon_108a;                  // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAICharacter*                       CallFunc_Array_Get_Item_1;                         // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Map_Find_Value;                           // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x030A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x030B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0312(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_313[0x5];                                      // 0x0313(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAICharacter*                       CallFunc_Array_Get_Item_2;                         // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_1;                        // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_Map_Find_Value_1;                         // 0x0330(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x3];                                      // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Remove_ReturnValue_1;                 // 0x0343(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseMonster_C*                         K2Node_CustomEvent_EffectActor;                    // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0350(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x035C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x036C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance_Humanoid*                 K2Node_DynamicCast_AsAnim_Instance_Humanoid;       // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_GetIdleAnim_ReturnValue;                  // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x03B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x03B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsAlive_ReturnValue;                   // 0x03B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special) == 0x000008, "Wrong alignment on BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special");
static_assert(sizeof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special) == 0x0003B8, "Wrong size on BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, EntryPoint) == 0x000000, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, ___int_Loop_Counter_Variable) == 0x000008, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000010, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, ___int_Array_Index_Variable) == 0x000014, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, ___int_Array_Index_Variable_1) == 0x000018, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, ___int_Loop_Counter_Variable_1) == 0x00001C, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000020, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000024, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, ___int_Array_Index_Variable_2) == 0x000028, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::___int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, K2Node_Event_Who) == 0x000030, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::K2Node_Event_Who' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, K2Node_Event_Killer) == 0x000038, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::K2Node_Event_Killer' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, K2Node_Event_HealthChangeValue) == 0x000040, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::K2Node_Event_HealthChangeValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_FindOrAddComponent_ReturnValue) == 0x0001F0, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_FindOrAddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001F8, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, K2Node_Event_DeltaSeconds) == 0x000204, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_MakeModifier_ReturnValue) == 0x000208, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_MakeModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, ___int_Loop_Counter_Variable_2) == 0x00020C, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::___int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_IsValid_ReturnValue) == 0x000210, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Add_IntInt_ReturnValue) == 0x000214, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000218, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_IsValid_ReturnValue_1) == 0x000224, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Add_VectorVector_ReturnValue) == 0x000228, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_GetAllMembersPtr_ReturnValue) == 0x000238, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_GetAllMembersPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Array_Get_Item) == 0x000248, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Array_Length_ReturnValue) == 0x000250, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, K2Node_DynamicCast_AsGame_AICharacter) == 0x000258, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::K2Node_DynamicCast_AsGame_AICharacter' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, K2Node_DynamicCast_bSuccess) == 0x000260, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Less_IntInt_ReturnValue) == 0x000261, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, K2Node_DynamicCast_AsBP_Mon_103c) == 0x000268, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::K2Node_DynamicCast_AsBP_Mon_103c' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, K2Node_DynamicCast_bSuccess_1) == 0x000270, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, K2Node_DynamicCast_AsBP_Mon_103b) == 0x000278, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::K2Node_DynamicCast_AsBP_Mon_103b' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, K2Node_DynamicCast_bSuccess_2) == 0x000280, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, K2Node_DynamicCast_AsBP_Mon_103a) == 0x000288, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::K2Node_DynamicCast_AsBP_Mon_103a' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, K2Node_DynamicCast_bSuccess_3) == 0x000290, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, K2Node_DynamicCast_AsBP_Mon_104d) == 0x000298, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::K2Node_DynamicCast_AsBP_Mon_104d' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, K2Node_DynamicCast_bSuccess_4) == 0x0002A0, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, K2Node_DynamicCast_AsBP_Mon_104c) == 0x0002A8, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::K2Node_DynamicCast_AsBP_Mon_104c' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, K2Node_DynamicCast_bSuccess_5) == 0x0002B0, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, K2Node_DynamicCast_AsBP_Mon_112) == 0x0002B8, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::K2Node_DynamicCast_AsBP_Mon_112' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, K2Node_DynamicCast_bSuccess_6) == 0x0002C0, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, K2Node_DynamicCast_AsBP_Mon_108a) == 0x0002C8, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::K2Node_DynamicCast_AsBP_Mon_108a' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, K2Node_DynamicCast_bSuccess_7) == 0x0002D0, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Array_Length_ReturnValue_1) == 0x0002D4, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Greater_IntInt_ReturnValue) == 0x0002D8, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Array_Get_Item_1) == 0x0002E0, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Array_Length_ReturnValue_2) == 0x0002E8, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_IsValid_ReturnValue_2) == 0x0002EC, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x0002F0, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Max_ReturnValue) == 0x0002F4, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_IsDead_ReturnValue) == 0x0002F8, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Map_Find_Value) == 0x000300, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Map_Find_ReturnValue) == 0x000308, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_BooleanOR_ReturnValue) == 0x000309, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_IsValid_ReturnValue_3) == 0x00030A, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_BooleanAND_ReturnValue) == 0x00030B, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Array_Length_ReturnValue_3) == 0x00030C, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000310, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Array_RemoveItem_ReturnValue) == 0x000311, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Map_Remove_ReturnValue) == 0x000312, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Array_Get_Item_2) == 0x000318, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Array_Length_ReturnValue_4) == 0x000320, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_IsValid_ReturnValue_4) == 0x000324, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x000328, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Max_ReturnValue_1) == 0x00032C, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Max_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Map_Find_Value_1) == 0x000330, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Map_Find_ReturnValue_1) == 0x000338, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Array_Length_ReturnValue_5) == 0x00033C, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000340, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_IsValid_ReturnValue_5) == 0x000341, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Array_RemoveItem_ReturnValue_1) == 0x000342, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Array_RemoveItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Map_Remove_ReturnValue_1) == 0x000343, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Map_Remove_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, K2Node_CustomEvent_EffectActor) == 0x000348, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::K2Node_CustomEvent_EffectActor' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000350, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00035C, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Array_AddUnique_ReturnValue) == 0x000368, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x00036C, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000378, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_IsValid_ReturnValue_6) == 0x000380, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_GetAnimInstance_ReturnValue) == 0x000388, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_IsValid_ReturnValue_7) == 0x000390, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, K2Node_DynamicCast_AsAnim_Instance_Humanoid) == 0x000398, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::K2Node_DynamicCast_AsAnim_Instance_Humanoid' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, K2Node_DynamicCast_bSuccess_8) == 0x0003A0, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_GetIdleAnim_ReturnValue) == 0x0003A8, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_GetIdleAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Array_Find_ReturnValue) == 0x0003B0, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_Not_PreBool_ReturnValue) == 0x0003B4, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0003B5, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_BooleanAND_ReturnValue_1) == 0x0003B6, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special, CallFunc_K2_IsAlive_ReturnValue) == 0x0003B7, "Member 'BP_Mon_107_Special_C_ExecuteUbergraph_BP_Mon_107_Special::CallFunc_K2_IsAlive_ReturnValue' has a wrong offset!");

// Function BP_Mon_107_Special.BP_Mon_107_Special_C.EffectEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_Mon_107_Special_C_EffectEvent final
{
public:
	class ABaseMonster_C*                         EffectActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_107_Special_C_EffectEvent) == 0x000008, "Wrong alignment on BP_Mon_107_Special_C_EffectEvent");
static_assert(sizeof(BP_Mon_107_Special_C_EffectEvent) == 0x000008, "Wrong size on BP_Mon_107_Special_C_EffectEvent");
static_assert(offsetof(BP_Mon_107_Special_C_EffectEvent, EffectActor) == 0x000000, "Member 'BP_Mon_107_Special_C_EffectEvent::EffectActor' has a wrong offset!");

// Function BP_Mon_107_Special.BP_Mon_107_Special_C.ReceiveTick__Overridden
// 0x0004 (0x0004 - 0x0000)
struct BP_Mon_107_Special_C_ReceiveTick__Overridden final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_107_Special_C_ReceiveTick__Overridden) == 0x000004, "Wrong alignment on BP_Mon_107_Special_C_ReceiveTick__Overridden");
static_assert(sizeof(BP_Mon_107_Special_C_ReceiveTick__Overridden) == 0x000004, "Wrong size on BP_Mon_107_Special_C_ReceiveTick__Overridden");
static_assert(offsetof(BP_Mon_107_Special_C_ReceiveTick__Overridden, DeltaSeconds) == 0x000000, "Member 'BP_Mon_107_Special_C_ReceiveTick__Overridden::DeltaSeconds' has a wrong offset!");

// Function BP_Mon_107_Special.BP_Mon_107_Special_C.OnDie
// 0x01C0 (0x01C0 - 0x0000)
struct BP_Mon_107_Special_C_OnDie final
{
public:
	class AGameCharacter*                         Who;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         Killer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     HealthChangeValue;                                 // 0x0010(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Mon_107_Special_C_OnDie) == 0x000008, "Wrong alignment on BP_Mon_107_Special_C_OnDie");
static_assert(sizeof(BP_Mon_107_Special_C_OnDie) == 0x0001C0, "Wrong size on BP_Mon_107_Special_C_OnDie");
static_assert(offsetof(BP_Mon_107_Special_C_OnDie, Who) == 0x000000, "Member 'BP_Mon_107_Special_C_OnDie::Who' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_OnDie, Killer) == 0x000008, "Member 'BP_Mon_107_Special_C_OnDie::Killer' has a wrong offset!");
static_assert(offsetof(BP_Mon_107_Special_C_OnDie, HealthChangeValue) == 0x000010, "Member 'BP_Mon_107_Special_C_OnDie::HealthChangeValue' has a wrong offset!");

// LuaFunction BP_Mon_107_Special.BP_Mon_107_Special_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Mon_107_Special_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_107_Special_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Mon_107_Special_C_ReceiveTick");
static_assert(sizeof(BP_Mon_107_Special_C_ReceiveTick) == 0x000004, "Wrong size on BP_Mon_107_Special_C_ReceiveTick");
static_assert(offsetof(BP_Mon_107_Special_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Mon_107_Special_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Mon_107_Special.BP_Mon_107_Special_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_Mon_107_Special_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_107_Special_C_GetModuleName) == 0x000008, "Wrong alignment on BP_Mon_107_Special_C_GetModuleName");
static_assert(sizeof(BP_Mon_107_Special_C_GetModuleName) == 0x000010, "Wrong size on BP_Mon_107_Special_C_GetModuleName");
static_assert(offsetof(BP_Mon_107_Special_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_Mon_107_Special_C_GetModuleName::ReturnValue' has a wrong offset!");

}

