#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_006

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Mon_006.BP_Mon_006_C.CheckForCastCallForAllySkill
// 0x0040 (0x0040 - 0x0000)
struct BP_Mon_006_C_CheckForCastCallForAllySkill final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OriginSkills;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UGameAbilityComponent*                  AbilityRef;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FApplyDamageResultData& DamageResultData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  CallFunc_GetAbilityComponent_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_006_C_CheckForCastCallForAllySkill) == 0x000008, "Wrong alignment on BP_Mon_006_C_CheckForCastCallForAllySkill");
static_assert(sizeof(BP_Mon_006_C_CheckForCastCallForAllySkill) == 0x000040, "Wrong size on BP_Mon_006_C_CheckForCastCallForAllySkill");
static_assert(offsetof(BP_Mon_006_C_CheckForCastCallForAllySkill, SkillID) == 0x000000, "Member 'BP_Mon_006_C_CheckForCastCallForAllySkill::SkillID' has a wrong offset!");
static_assert(offsetof(BP_Mon_006_C_CheckForCastCallForAllySkill, OriginSkills) == 0x000008, "Member 'BP_Mon_006_C_CheckForCastCallForAllySkill::OriginSkills' has a wrong offset!");
static_assert(offsetof(BP_Mon_006_C_CheckForCastCallForAllySkill, AbilityRef) == 0x000018, "Member 'BP_Mon_006_C_CheckForCastCallForAllySkill::AbilityRef' has a wrong offset!");
static_assert(offsetof(BP_Mon_006_C_CheckForCastCallForAllySkill, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'BP_Mon_006_C_CheckForCastCallForAllySkill::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_006_C_CheckForCastCallForAllySkill, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'BP_Mon_006_C_CheckForCastCallForAllySkill::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Mon_006_C_CheckForCastCallForAllySkill, CallFunc_GetAbilityComponent_ReturnValue) == 0x000038, "Member 'BP_Mon_006_C_CheckForCastCallForAllySkill::CallFunc_GetAbilityComponent_ReturnValue' has a wrong offset!");

// Function BP_Mon_006.BP_Mon_006_C.LowHealthSkill_CallForAlly
// 0x00F0 (0x00F0 - 0x0000)
struct BP_Mon_006_C_LowHealthSkill_CallForAlly final
{
public:
	struct FApplyDamageResultData                 DamageResultData;                                  // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  CallFunc_GetAbilityComponent_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CancleAllInAnimSkill_ReturnValue;         // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRolePropertieMaxValue_ReturnValue;     // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRolePropertieValue_ReturnValue;        // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeModifier_ReturnValue;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Mon_006_C_LowHealthSkill_CallForAlly) == 0x000008, "Wrong alignment on BP_Mon_006_C_LowHealthSkill_CallForAlly");
static_assert(sizeof(BP_Mon_006_C_LowHealthSkill_CallForAlly) == 0x0000F0, "Wrong size on BP_Mon_006_C_LowHealthSkill_CallForAlly");
static_assert(offsetof(BP_Mon_006_C_LowHealthSkill_CallForAlly, DamageResultData) == 0x000000, "Member 'BP_Mon_006_C_LowHealthSkill_CallForAlly::DamageResultData' has a wrong offset!");
static_assert(offsetof(BP_Mon_006_C_LowHealthSkill_CallForAlly, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000B8, "Member 'BP_Mon_006_C_LowHealthSkill_CallForAlly::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_006_C_LowHealthSkill_CallForAlly, CallFunc_GetAbilityComponent_ReturnValue) == 0x0000C8, "Member 'BP_Mon_006_C_LowHealthSkill_CallForAlly::CallFunc_GetAbilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_006_C_LowHealthSkill_CallForAlly, CallFunc_CancleAllInAnimSkill_ReturnValue) == 0x0000D0, "Member 'BP_Mon_006_C_LowHealthSkill_CallForAlly::CallFunc_CancleAllInAnimSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_006_C_LowHealthSkill_CallForAlly, CallFunc_GetRolePropertieMaxValue_ReturnValue) == 0x0000D4, "Member 'BP_Mon_006_C_LowHealthSkill_CallForAlly::CallFunc_GetRolePropertieMaxValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_006_C_LowHealthSkill_CallForAlly, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000D8, "Member 'BP_Mon_006_C_LowHealthSkill_CallForAlly::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_006_C_LowHealthSkill_CallForAlly, CallFunc_GetRolePropertieValue_ReturnValue) == 0x0000DC, "Member 'BP_Mon_006_C_LowHealthSkill_CallForAlly::CallFunc_GetRolePropertieValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_006_C_LowHealthSkill_CallForAlly, CallFunc_MakeModifier_ReturnValue) == 0x0000E0, "Member 'BP_Mon_006_C_LowHealthSkill_CallForAlly::CallFunc_MakeModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_006_C_LowHealthSkill_CallForAlly, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000E4, "Member 'BP_Mon_006_C_LowHealthSkill_CallForAlly::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_006_C_LowHealthSkill_CallForAlly, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000E8, "Member 'BP_Mon_006_C_LowHealthSkill_CallForAlly::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_Mon_006.BP_Mon_006_C.UserConstructionScript
// 0x0028 (0x0028 - 0x0000)
struct BP_Mon_006_C_UserConstructionScript final
{
public:
	TDelegate<void(int32 SkillID, TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(struct FApplyDamageResultData& DamageResultData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityComponentBase*                  CallFunc_GetAbilityComponent_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_006_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Mon_006_C_UserConstructionScript");
static_assert(sizeof(BP_Mon_006_C_UserConstructionScript) == 0x000028, "Wrong size on BP_Mon_006_C_UserConstructionScript");
static_assert(offsetof(BP_Mon_006_C_UserConstructionScript, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_Mon_006_C_UserConstructionScript::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Mon_006_C_UserConstructionScript, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'BP_Mon_006_C_UserConstructionScript::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_006_C_UserConstructionScript, CallFunc_GetAbilityComponent_ReturnValue) == 0x000020, "Member 'BP_Mon_006_C_UserConstructionScript::CallFunc_GetAbilityComponent_ReturnValue' has a wrong offset!");

}

