#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_110_Part01a

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_Mon_110_Part01a.BP_Mon_110_Part01a_C.CheckOwnerIsInvincible
// 0x0060 (0x0060 - 0x0000)
struct BP_Mon_110_Part01a_C_CheckOwnerIsInvincible final
{
public:
	class UAbilityComponentBase*                  ___object_Variable;                                // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsModifierExist_ReturnValue;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAbilityCharacterInterface> K2Node_DynamicCast_AsAbility_Character_Interface;  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  CallFunc_GetAbilityComponent_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameAICharacter*                       K2Node_DynamicCast_AsGame_AICharacter;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeModifier_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_110_Part01a_C_CheckOwnerIsInvincible) == 0x000008, "Wrong alignment on BP_Mon_110_Part01a_C_CheckOwnerIsInvincible");
static_assert(sizeof(BP_Mon_110_Part01a_C_CheckOwnerIsInvincible) == 0x000060, "Wrong size on BP_Mon_110_Part01a_C_CheckOwnerIsInvincible");
static_assert(offsetof(BP_Mon_110_Part01a_C_CheckOwnerIsInvincible, ___object_Variable) == 0x000000, "Member 'BP_Mon_110_Part01a_C_CheckOwnerIsInvincible::___object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_CheckOwnerIsInvincible, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_Mon_110_Part01a_C_CheckOwnerIsInvincible::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_CheckOwnerIsInvincible, CallFunc_IsModifierExist_ReturnValue) == 0x000009, "Member 'BP_Mon_110_Part01a_C_CheckOwnerIsInvincible::CallFunc_IsModifierExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_CheckOwnerIsInvincible, CallFunc_IsValid_ReturnValue_1) == 0x00000A, "Member 'BP_Mon_110_Part01a_C_CheckOwnerIsInvincible::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_CheckOwnerIsInvincible, CallFunc_GetAttachParentActor_ReturnValue) == 0x000010, "Member 'BP_Mon_110_Part01a_C_CheckOwnerIsInvincible::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_CheckOwnerIsInvincible, K2Node_DynamicCast_AsAbility_Character_Interface) == 0x000018, "Member 'BP_Mon_110_Part01a_C_CheckOwnerIsInvincible::K2Node_DynamicCast_AsAbility_Character_Interface' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_CheckOwnerIsInvincible, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Mon_110_Part01a_C_CheckOwnerIsInvincible::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_CheckOwnerIsInvincible, CallFunc_IsValid_ReturnValue_2) == 0x000029, "Member 'BP_Mon_110_Part01a_C_CheckOwnerIsInvincible::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_CheckOwnerIsInvincible, CallFunc_GetAbilityComponent_ReturnValue) == 0x000030, "Member 'BP_Mon_110_Part01a_C_CheckOwnerIsInvincible::CallFunc_GetAbilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_CheckOwnerIsInvincible, K2Node_DynamicCast_AsGame_AICharacter) == 0x000038, "Member 'BP_Mon_110_Part01a_C_CheckOwnerIsInvincible::K2Node_DynamicCast_AsGame_AICharacter' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_CheckOwnerIsInvincible, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_Mon_110_Part01a_C_CheckOwnerIsInvincible::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_CheckOwnerIsInvincible, CallFunc_MakeVector_ReturnValue) == 0x000044, "Member 'BP_Mon_110_Part01a_C_CheckOwnerIsInvincible::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_CheckOwnerIsInvincible, CallFunc_MakeVector_ReturnValue_1) == 0x000050, "Member 'BP_Mon_110_Part01a_C_CheckOwnerIsInvincible::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_CheckOwnerIsInvincible, CallFunc_MakeModifier_ReturnValue) == 0x00005C, "Member 'BP_Mon_110_Part01a_C_CheckOwnerIsInvincible::CallFunc_MakeModifier_ReturnValue' has a wrong offset!");

// Function BP_Mon_110_Part01a.BP_Mon_110_Part01a_C.OnOwnerDiePerform
// 0x0008 (0x0008 - 0x0000)
struct BP_Mon_110_Part01a_C_OnOwnerDiePerform final
{
public:
	class AGameCharacter*                         OwnerCharacter;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_110_Part01a_C_OnOwnerDiePerform) == 0x000008, "Wrong alignment on BP_Mon_110_Part01a_C_OnOwnerDiePerform");
static_assert(sizeof(BP_Mon_110_Part01a_C_OnOwnerDiePerform) == 0x000008, "Wrong size on BP_Mon_110_Part01a_C_OnOwnerDiePerform");
static_assert(offsetof(BP_Mon_110_Part01a_C_OnOwnerDiePerform, OwnerCharacter) == 0x000000, "Member 'BP_Mon_110_Part01a_C_OnOwnerDiePerform::OwnerCharacter' has a wrong offset!");

// Function BP_Mon_110_Part01a.BP_Mon_110_Part01a_C.ExecuteUbergraph_BP_Mon_110_Part01a
// 0x0250 (0x0250 - 0x0000)
struct BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  ___object_Variable;                                // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_Event_InBreaker;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_Event_InHealthChangeValue;                  // 0x0020(0x01B0)(ConstParm, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAbilityCharacterInterface> K2Node_DynamicCast_AsAbility_Character_Interface;  // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  CallFunc_GetAbilityComponent_ReturnValue;          // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameAICharacter*                       K2Node_DynamicCast_AsGame_AICharacter;             // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseComponent*                        CallFunc_PostEventAttachedActor_ReturnValue;       // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_OwnerCharacter;                       // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_222[0x6];                                      // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetGameCharacter_ReturnValue;             // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0230(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_StartCharacterState_ReturnValue;          // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRolePropertieValue_ReturnValue;        // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x024D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a) == 0x000008, "Wrong alignment on BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a");
static_assert(sizeof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a) == 0x000250, "Wrong size on BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a");
static_assert(offsetof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a, EntryPoint) == 0x000000, "Member 'BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a, ___object_Variable) == 0x000008, "Member 'BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a::___object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a, CallFunc_Lerp_ReturnValue) == 0x000010, "Member 'BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a, ___bool_Has_Been_Initd_Variable) == 0x000014, "Member 'BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a, K2Node_Event_InBreaker) == 0x000018, "Member 'BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a::K2Node_Event_InBreaker' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a, K2Node_Event_InHealthChangeValue) == 0x000020, "Member 'BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a::K2Node_Event_InHealthChangeValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a, CallFunc_GetAttachParentActor_ReturnValue) == 0x0001D0, "Member 'BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a, K2Node_DynamicCast_AsAbility_Character_Interface) == 0x0001D8, "Member 'BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a::K2Node_DynamicCast_AsAbility_Character_Interface' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a, K2Node_DynamicCast_bSuccess) == 0x0001E8, "Member 'BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a, CallFunc_IsValid_ReturnValue) == 0x0001E9, "Member 'BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a, CallFunc_GetAbilityComponent_ReturnValue) == 0x0001F0, "Member 'BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a::CallFunc_GetAbilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a, K2Node_DynamicCast_AsGame_AICharacter) == 0x0001F8, "Member 'BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a::K2Node_DynamicCast_AsGame_AICharacter' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a, K2Node_DynamicCast_bSuccess_1) == 0x000200, "Member 'BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a, CallFunc_PostEventAttachedActor_ReturnValue) == 0x000208, "Member 'BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a::CallFunc_PostEventAttachedActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000210, "Member 'BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a, K2Node_Event_OwnerCharacter) == 0x000218, "Member 'BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a::K2Node_Event_OwnerCharacter' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a, CallFunc_IsValid_ReturnValue_1) == 0x000220, "Member 'BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a, ___bool_IsClosed_Variable) == 0x000221, "Member 'BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a, CallFunc_GetGameCharacter_ReturnValue) == 0x000228, "Member 'BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a::CallFunc_GetGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a, K2Node_MakeArray_Array) == 0x000230, "Member 'BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a, CallFunc_StartCharacterState_ReturnValue) == 0x000240, "Member 'BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a::CallFunc_StartCharacterState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a, K2Node_Event_DeltaSeconds) == 0x000244, "Member 'BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a, CallFunc_GetRolePropertieValue_ReturnValue) == 0x000248, "Member 'BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a::CallFunc_GetRolePropertieValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a, CallFunc_IsValid_ReturnValue_2) == 0x00024C, "Member 'BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00024D, "Member 'BP_Mon_110_Part01a_C_ExecuteUbergraph_BP_Mon_110_Part01a::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_Mon_110_Part01a.BP_Mon_110_Part01a_C.OnDestructed
// 0x01B8 (0x01B8 - 0x0000)
struct BP_Mon_110_Part01a_C_OnDestructed final
{
public:
	class AGameCharacter*                         InBreaker;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     InHealthChangeValue;                               // 0x0008(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Mon_110_Part01a_C_OnDestructed) == 0x000008, "Wrong alignment on BP_Mon_110_Part01a_C_OnDestructed");
static_assert(sizeof(BP_Mon_110_Part01a_C_OnDestructed) == 0x0001B8, "Wrong size on BP_Mon_110_Part01a_C_OnDestructed");
static_assert(offsetof(BP_Mon_110_Part01a_C_OnDestructed, InBreaker) == 0x000000, "Member 'BP_Mon_110_Part01a_C_OnDestructed::InBreaker' has a wrong offset!");
static_assert(offsetof(BP_Mon_110_Part01a_C_OnDestructed, InHealthChangeValue) == 0x000008, "Member 'BP_Mon_110_Part01a_C_OnDestructed::InHealthChangeValue' has a wrong offset!");

// Function BP_Mon_110_Part01a.BP_Mon_110_Part01a_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Mon_110_Part01a_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_110_Part01a_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Mon_110_Part01a_C_ReceiveTick");
static_assert(sizeof(BP_Mon_110_Part01a_C_ReceiveTick) == 0x000004, "Wrong size on BP_Mon_110_Part01a_C_ReceiveTick");
static_assert(offsetof(BP_Mon_110_Part01a_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Mon_110_Part01a_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

