#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_107_Special

#include "Basic.hpp"

#include "BaseMonster_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mon_107_Special.BP_Mon_107_Special_C
// 0x00B0 (0x1440 - 0x1390)
class ABP_Mon_107_Special_C final : public ABaseMonster_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Mon_107_Special_C;               // 0x1390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCapsuleComponent*                      Friction;                                          // 0x1398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDamagePoint_C*                         DamagePoint1;                                      // 0x13A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDamagePoint_C*                         DamagePoint5;                                      // 0x13A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDamagePoint_C*                         DamagePoint4;                                      // 0x13B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDamagePoint_C*                         DamagePoint3;                                      // 0x13B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDamagePoint_C*                         DamagePoint2;                                      // 0x13C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDamagePoint_C*                         DamagePoint;                                       // 0x13C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         TestStageMessage;                                  // 0x13D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13D4[0x4];                                     // 0x13D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGameAICharacter*>               SpecialGameCharacter;                              // 0x13D8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class AGameAICharacter*, class UNiagaraComponent*> ParticleMap;                                       // 0x13E8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_BP_Mon_107_Special(int32 EntryPoint);
	void EffectEvent(class ABaseMonster_C* EffectActor);
	void ReceiveTick__Overridden(float DeltaSeconds);
	void Spwaned();
	void OnDie(class AGameCharacter* Who, class AGameCharacter* Killer, const struct FHealthChangeValue& HealthChangeValue);
	void ReceiveTick(float DeltaSeconds);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mon_107_Special_C">();
	}
	static class ABP_Mon_107_Special_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mon_107_Special_C>();
	}
};
static_assert(alignof(ABP_Mon_107_Special_C) == 0x000010, "Wrong alignment on ABP_Mon_107_Special_C");
static_assert(sizeof(ABP_Mon_107_Special_C) == 0x001440, "Wrong size on ABP_Mon_107_Special_C");
static_assert(offsetof(ABP_Mon_107_Special_C, UberGraphFrame_BP_Mon_107_Special_C) == 0x001390, "Member 'ABP_Mon_107_Special_C::UberGraphFrame_BP_Mon_107_Special_C' has a wrong offset!");
static_assert(offsetof(ABP_Mon_107_Special_C, Friction) == 0x001398, "Member 'ABP_Mon_107_Special_C::Friction' has a wrong offset!");
static_assert(offsetof(ABP_Mon_107_Special_C, DamagePoint1) == 0x0013A0, "Member 'ABP_Mon_107_Special_C::DamagePoint1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_107_Special_C, DamagePoint5) == 0x0013A8, "Member 'ABP_Mon_107_Special_C::DamagePoint5' has a wrong offset!");
static_assert(offsetof(ABP_Mon_107_Special_C, DamagePoint4) == 0x0013B0, "Member 'ABP_Mon_107_Special_C::DamagePoint4' has a wrong offset!");
static_assert(offsetof(ABP_Mon_107_Special_C, DamagePoint3) == 0x0013B8, "Member 'ABP_Mon_107_Special_C::DamagePoint3' has a wrong offset!");
static_assert(offsetof(ABP_Mon_107_Special_C, DamagePoint2) == 0x0013C0, "Member 'ABP_Mon_107_Special_C::DamagePoint2' has a wrong offset!");
static_assert(offsetof(ABP_Mon_107_Special_C, DamagePoint) == 0x0013C8, "Member 'ABP_Mon_107_Special_C::DamagePoint' has a wrong offset!");
static_assert(offsetof(ABP_Mon_107_Special_C, TestStageMessage) == 0x0013D0, "Member 'ABP_Mon_107_Special_C::TestStageMessage' has a wrong offset!");
static_assert(offsetof(ABP_Mon_107_Special_C, SpecialGameCharacter) == 0x0013D8, "Member 'ABP_Mon_107_Special_C::SpecialGameCharacter' has a wrong offset!");
static_assert(offsetof(ABP_Mon_107_Special_C, ParticleMap) == 0x0013E8, "Member 'ABP_Mon_107_Special_C::ParticleMap' has a wrong offset!");

}

