#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_101

#include "Basic.hpp"

#include "BaseMonster_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mon_101.BP_Mon_101_C
// 0x0080 (0x1410 - 0x1390)
class ABP_Mon_101_C final : public ABaseMonster_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Mon_101_C;                       // 0x1390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Weak;                                              // 0x1398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Friction;                                          // 0x13A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Collision;                                         // 0x13A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDamagePoint_C*                         DamagePoint5;                                      // 0x13B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDamagePoint_C*                         DamagePoint4;                                      // 0x13B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDamagePoint_C*                         DamagePoint3;                                      // 0x13C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDamagePoint_C*                         DamagePoint2;                                      // 0x13C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDamagePoint_C*                         DamagePoint1;                                      // 0x13D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDamagePoint_C*                         DamagePoint;                                       // 0x13D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Skill02Floating_NewTrack_0_60EE1CDA4922D7A152BB498BC7FDEB19; // 0x13E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Skill02Floating__Direction_60EE1CDA4922D7A152BB498BC7FDEB19; // 0x13E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13E5[0x3];                                     // 0x13E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Skill02Floating;                                   // 0x13E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_E4BF69EA48840FF71ACB00A157C88A40; // 0x13F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_E4BF69EA48840FF71ACB00A157C88A40; // 0x13F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13F5[0x3];                                     // 0x13F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x13F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BuffParticle;                                      // 0x1400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTrap;                                             // 0x1408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Mon_101(int32 EntryPoint);
	void CastSpecificSkill(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void Spwaned();
	void StopSkill02Floating();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Skill02Floating__UpdateFunc();
	void Skill02Floating__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void Get_Current_Health_Rate(float* HealthRate);
	void CheckStageWake();

	bool ReceiveIsAllowAimed(const class AGameCharacter* CurrentInstigator) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mon_101_C">();
	}
	static class ABP_Mon_101_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mon_101_C>();
	}
};
static_assert(alignof(ABP_Mon_101_C) == 0x000010, "Wrong alignment on ABP_Mon_101_C");
static_assert(sizeof(ABP_Mon_101_C) == 0x001410, "Wrong size on ABP_Mon_101_C");
static_assert(offsetof(ABP_Mon_101_C, UberGraphFrame_BP_Mon_101_C) == 0x001390, "Member 'ABP_Mon_101_C::UberGraphFrame_BP_Mon_101_C' has a wrong offset!");
static_assert(offsetof(ABP_Mon_101_C, Weak) == 0x001398, "Member 'ABP_Mon_101_C::Weak' has a wrong offset!");
static_assert(offsetof(ABP_Mon_101_C, Friction) == 0x0013A0, "Member 'ABP_Mon_101_C::Friction' has a wrong offset!");
static_assert(offsetof(ABP_Mon_101_C, Collision) == 0x0013A8, "Member 'ABP_Mon_101_C::Collision' has a wrong offset!");
static_assert(offsetof(ABP_Mon_101_C, DamagePoint5) == 0x0013B0, "Member 'ABP_Mon_101_C::DamagePoint5' has a wrong offset!");
static_assert(offsetof(ABP_Mon_101_C, DamagePoint4) == 0x0013B8, "Member 'ABP_Mon_101_C::DamagePoint4' has a wrong offset!");
static_assert(offsetof(ABP_Mon_101_C, DamagePoint3) == 0x0013C0, "Member 'ABP_Mon_101_C::DamagePoint3' has a wrong offset!");
static_assert(offsetof(ABP_Mon_101_C, DamagePoint2) == 0x0013C8, "Member 'ABP_Mon_101_C::DamagePoint2' has a wrong offset!");
static_assert(offsetof(ABP_Mon_101_C, DamagePoint1) == 0x0013D0, "Member 'ABP_Mon_101_C::DamagePoint1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_101_C, DamagePoint) == 0x0013D8, "Member 'ABP_Mon_101_C::DamagePoint' has a wrong offset!");
static_assert(offsetof(ABP_Mon_101_C, Skill02Floating_NewTrack_0_60EE1CDA4922D7A152BB498BC7FDEB19) == 0x0013E0, "Member 'ABP_Mon_101_C::Skill02Floating_NewTrack_0_60EE1CDA4922D7A152BB498BC7FDEB19' has a wrong offset!");
static_assert(offsetof(ABP_Mon_101_C, Skill02Floating__Direction_60EE1CDA4922D7A152BB498BC7FDEB19) == 0x0013E4, "Member 'ABP_Mon_101_C::Skill02Floating__Direction_60EE1CDA4922D7A152BB498BC7FDEB19' has a wrong offset!");
static_assert(offsetof(ABP_Mon_101_C, Skill02Floating) == 0x0013E8, "Member 'ABP_Mon_101_C::Skill02Floating' has a wrong offset!");
static_assert(offsetof(ABP_Mon_101_C, Timeline_0_NewTrack_0_E4BF69EA48840FF71ACB00A157C88A40) == 0x0013F0, "Member 'ABP_Mon_101_C::Timeline_0_NewTrack_0_E4BF69EA48840FF71ACB00A157C88A40' has a wrong offset!");
static_assert(offsetof(ABP_Mon_101_C, Timeline_0__Direction_E4BF69EA48840FF71ACB00A157C88A40) == 0x0013F4, "Member 'ABP_Mon_101_C::Timeline_0__Direction_E4BF69EA48840FF71ACB00A157C88A40' has a wrong offset!");
static_assert(offsetof(ABP_Mon_101_C, Timeline_0) == 0x0013F8, "Member 'ABP_Mon_101_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_Mon_101_C, BuffParticle) == 0x001400, "Member 'ABP_Mon_101_C::BuffParticle' has a wrong offset!");
static_assert(offsetof(ABP_Mon_101_C, bTrap) == 0x001408, "Member 'ABP_Mon_101_C::bTrap' has a wrong offset!");

}

