#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_003c

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Mon_003c.BP_Mon_003c_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Mon_003c_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_003c_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Mon_003c_C_ReceiveTick");
static_assert(sizeof(BP_Mon_003c_C_ReceiveTick) == 0x000004, "Wrong size on BP_Mon_003c_C_ReceiveTick");
static_assert(offsetof(BP_Mon_003c_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Mon_003c_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Mon_003c.BP_Mon_003c_C.ReceiveHitAction
// 0x008C (0x008C - 0x0000)
struct BP_Mon_003c_C_ReceiveHitAction final
{
public:
	struct FHitResult                             Hit_0;                                             // 0x0000(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Mon_003c_C_ReceiveHitAction) == 0x000004, "Wrong alignment on BP_Mon_003c_C_ReceiveHitAction");
static_assert(sizeof(BP_Mon_003c_C_ReceiveHitAction) == 0x00008C, "Wrong size on BP_Mon_003c_C_ReceiveHitAction");
static_assert(offsetof(BP_Mon_003c_C_ReceiveHitAction, Hit_0) == 0x000000, "Member 'BP_Mon_003c_C_ReceiveHitAction::Hit_0' has a wrong offset!");

// Function BP_Mon_003c.BP_Mon_003c_C.ExecuteUbergraph_BP_Mon_003c
// 0x0094 (0x0094 - 0x0000)
struct BP_Mon_003c_C_ExecuteUbergraph_BP_Mon_003c final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0004(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_003c_C_ExecuteUbergraph_BP_Mon_003c) == 0x000004, "Wrong alignment on BP_Mon_003c_C_ExecuteUbergraph_BP_Mon_003c");
static_assert(sizeof(BP_Mon_003c_C_ExecuteUbergraph_BP_Mon_003c) == 0x000094, "Wrong size on BP_Mon_003c_C_ExecuteUbergraph_BP_Mon_003c");
static_assert(offsetof(BP_Mon_003c_C_ExecuteUbergraph_BP_Mon_003c, EntryPoint) == 0x000000, "Member 'BP_Mon_003c_C_ExecuteUbergraph_BP_Mon_003c::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Mon_003c_C_ExecuteUbergraph_BP_Mon_003c, K2Node_Event_Hit) == 0x000004, "Member 'BP_Mon_003c_C_ExecuteUbergraph_BP_Mon_003c::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(BP_Mon_003c_C_ExecuteUbergraph_BP_Mon_003c, K2Node_Event_DeltaSeconds) == 0x000090, "Member 'BP_Mon_003c_C_ExecuteUbergraph_BP_Mon_003c::K2Node_Event_DeltaSeconds' has a wrong offset!");

}

