#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_114_SkillCollision

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mon_114_SkillCollision.BP_Mon_114_SkillCollision_C
// 0x0020 (0x0240 - 0x0220)
class ABP_Mon_114_SkillCollision_C final : public AAbilityCollisionEditor
{
public:
	class USkeletalMeshComponent*                 SkeletalMesh1;                                     // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Capsual*              Skill01_Collision;                                 // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mon_114_SkillCollision_C">();
	}
	static class ABP_Mon_114_SkillCollision_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mon_114_SkillCollision_C>();
	}
};
static_assert(alignof(ABP_Mon_114_SkillCollision_C) == 0x000008, "Wrong alignment on ABP_Mon_114_SkillCollision_C");
static_assert(sizeof(ABP_Mon_114_SkillCollision_C) == 0x000240, "Wrong size on ABP_Mon_114_SkillCollision_C");
static_assert(offsetof(ABP_Mon_114_SkillCollision_C, SkeletalMesh1) == 0x000220, "Member 'ABP_Mon_114_SkillCollision_C::SkeletalMesh1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_114_SkillCollision_C, Skill01_Collision) == 0x000228, "Member 'ABP_Mon_114_SkillCollision_C::Skill01_Collision' has a wrong offset!");
static_assert(offsetof(ABP_Mon_114_SkillCollision_C, SkeletalMesh) == 0x000230, "Member 'ABP_Mon_114_SkillCollision_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_Mon_114_SkillCollision_C, DefaultSceneRoot) == 0x000238, "Member 'ABP_Mon_114_SkillCollision_C::DefaultSceneRoot' has a wrong offset!");

}

