#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_113

#include "Basic.hpp"

#include "BaseMonster_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mon_113.BP_Mon_113_C
// 0x0030 (0x13C0 - 0x1390)
class ABP_Mon_113_C final : public ABaseMonster_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Mon_113_C;                       // 0x1390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Weak;                                              // 0x1398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Friction;                                          // 0x13A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDamagePoint_C*                         DamagePoint;                                       // 0x13A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ____1_NewTrack_0_E1BE399F4952A9CDC56C159A22FBB8B3; // 0x13B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____1__Direction_E1BE399F4952A9CDC56C159A22FBB8B3; // 0x13B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13B5[0x3];                                     // 0x13B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     __t_1;                                             // 0x13B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnDie(class AGameCharacter* Who, class AGameCharacter* Killer, const struct FHealthChangeValue& HealthChangeValue);
	void ExecuteUbergraph_BP_Mon_113(int32 EntryPoint);
	void __t_1__FinishedFunc();
	void __t_1__UpdateFunc();
	void Spwaned();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mon_113_C">();
	}
	static class ABP_Mon_113_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mon_113_C>();
	}
};
static_assert(alignof(ABP_Mon_113_C) == 0x000010, "Wrong alignment on ABP_Mon_113_C");
static_assert(sizeof(ABP_Mon_113_C) == 0x0013C0, "Wrong size on ABP_Mon_113_C");
static_assert(offsetof(ABP_Mon_113_C, UberGraphFrame_BP_Mon_113_C) == 0x001390, "Member 'ABP_Mon_113_C::UberGraphFrame_BP_Mon_113_C' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_C, Weak) == 0x001398, "Member 'ABP_Mon_113_C::Weak' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_C, Friction) == 0x0013A0, "Member 'ABP_Mon_113_C::Friction' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_C, DamagePoint) == 0x0013A8, "Member 'ABP_Mon_113_C::DamagePoint' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_C, ____1_NewTrack_0_E1BE399F4952A9CDC56C159A22FBB8B3) == 0x0013B0, "Member 'ABP_Mon_113_C::____1_NewTrack_0_E1BE399F4952A9CDC56C159A22FBB8B3' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_C, ____1__Direction_E1BE399F4952A9CDC56C159A22FBB8B3) == 0x0013B4, "Member 'ABP_Mon_113_C::____1__Direction_E1BE399F4952A9CDC56C159A22FBB8B3' has a wrong offset!");
static_assert(offsetof(ABP_Mon_113_C, __t_1) == 0x0013B8, "Member 'ABP_Mon_113_C::__t_1' has a wrong offset!");

}

