#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_003a

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Mon_003a.BP_Mon_003a_C.ExecuteUbergraph_BP_Mon_003a
// 0x0208 (0x0208 - 0x0000)
struct BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0018(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x00CC(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15A[0x2];                                      // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a) == 0x000008, "Wrong alignment on BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a");
static_assert(sizeof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a) == 0x000208, "Wrong size on BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, EntryPoint) == 0x000000, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, CallFunc_Conv_NameToString_ReturnValue) == 0x000008, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, K2Node_Event_Hit) == 0x000018, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, K2Node_Event_DeltaSeconds) == 0x0000A4, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, K2Node_ComponentBoundEvent_HitComponent) == 0x0000A8, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, K2Node_ComponentBoundEvent_OtherActor) == 0x0000B0, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, K2Node_ComponentBoundEvent_OtherComp) == 0x0000B8, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, K2Node_ComponentBoundEvent_NormalImpulse) == 0x0000C0, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, K2Node_ComponentBoundEvent_Hit) == 0x0000CC, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, CallFunc_BreakHitResult_bBlockingHit) == 0x000158, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, CallFunc_BreakHitResult_bInitialOverlap) == 0x000159, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, CallFunc_BreakHitResult_Time) == 0x00015C, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, CallFunc_BreakHitResult_Distance) == 0x000160, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, CallFunc_BreakHitResult_Location) == 0x000164, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, CallFunc_BreakHitResult_ImpactPoint) == 0x000170, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, CallFunc_BreakHitResult_Normal) == 0x00017C, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, CallFunc_BreakHitResult_ImpactNormal) == 0x000188, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, CallFunc_BreakHitResult_PhysMat) == 0x000198, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, CallFunc_BreakHitResult_HitActor) == 0x0001A0, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, CallFunc_BreakHitResult_HitComponent) == 0x0001A8, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, CallFunc_BreakHitResult_HitBoneName) == 0x0001B0, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, CallFunc_BreakHitResult_HitItem) == 0x0001B8, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, CallFunc_BreakHitResult_FaceIndex) == 0x0001BC, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, CallFunc_BreakHitResult_TraceStart) == 0x0001C0, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, CallFunc_BreakHitResult_TraceEnd) == 0x0001CC, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, CallFunc_RandomFloatInRange_ReturnValue) == 0x0001D8, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001DC, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, CallFunc_Normal_ReturnValue) == 0x0001E8, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001F4, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000200, "Member 'BP_Mon_003a_C_ExecuteUbergraph_BP_Mon_003a::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_Mon_003a.BP_Mon_003a_C.BndEvt__BP_Mon_003a_Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct BP_Mon_003a_C_BndEvt__BP_Mon_003a_Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit_0;                                             // 0x0024(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Mon_003a_C_BndEvt__BP_Mon_003a_Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Mon_003a_C_BndEvt__BP_Mon_003a_Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(BP_Mon_003a_C_BndEvt__BP_Mon_003a_Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x0000B0, "Wrong size on BP_Mon_003a_C_BndEvt__BP_Mon_003a_Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(BP_Mon_003a_C_BndEvt__BP_Mon_003a_Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'BP_Mon_003a_C_BndEvt__BP_Mon_003a_Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_BndEvt__BP_Mon_003a_Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Mon_003a_C_BndEvt__BP_Mon_003a_Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_BndEvt__BP_Mon_003a_Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Mon_003a_C_BndEvt__BP_Mon_003a_Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_BndEvt__BP_Mon_003a_Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'BP_Mon_003a_C_BndEvt__BP_Mon_003a_Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_Mon_003a_C_BndEvt__BP_Mon_003a_Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Hit_0) == 0x000024, "Member 'BP_Mon_003a_C_BndEvt__BP_Mon_003a_Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Hit_0' has a wrong offset!");

// Function BP_Mon_003a.BP_Mon_003a_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Mon_003a_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_003a_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Mon_003a_C_ReceiveTick");
static_assert(sizeof(BP_Mon_003a_C_ReceiveTick) == 0x000004, "Wrong size on BP_Mon_003a_C_ReceiveTick");
static_assert(offsetof(BP_Mon_003a_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Mon_003a_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Mon_003a.BP_Mon_003a_C.ReceiveHitAction
// 0x008C (0x008C - 0x0000)
struct BP_Mon_003a_C_ReceiveHitAction final
{
public:
	struct FHitResult                             Hit_0;                                             // 0x0000(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Mon_003a_C_ReceiveHitAction) == 0x000004, "Wrong alignment on BP_Mon_003a_C_ReceiveHitAction");
static_assert(sizeof(BP_Mon_003a_C_ReceiveHitAction) == 0x00008C, "Wrong size on BP_Mon_003a_C_ReceiveHitAction");
static_assert(offsetof(BP_Mon_003a_C_ReceiveHitAction, Hit_0) == 0x000000, "Member 'BP_Mon_003a_C_ReceiveHitAction::Hit_0' has a wrong offset!");

}

