#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_113

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_Mon_113.BP_Mon_113_C.OnDie
// 0x01C0 (0x01C0 - 0x0000)
struct BP_Mon_113_C_OnDie final
{
public:
	class AGameCharacter*                         Who;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         Killer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     HealthChangeValue;                                 // 0x0010(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Mon_113_C_OnDie) == 0x000008, "Wrong alignment on BP_Mon_113_C_OnDie");
static_assert(sizeof(BP_Mon_113_C_OnDie) == 0x0001C0, "Wrong size on BP_Mon_113_C_OnDie");
static_assert(offsetof(BP_Mon_113_C_OnDie, Who) == 0x000000, "Member 'BP_Mon_113_C_OnDie::Who' has a wrong offset!");
static_assert(offsetof(BP_Mon_113_C_OnDie, Killer) == 0x000008, "Member 'BP_Mon_113_C_OnDie::Killer' has a wrong offset!");
static_assert(offsetof(BP_Mon_113_C_OnDie, HealthChangeValue) == 0x000010, "Member 'BP_Mon_113_C_OnDie::HealthChangeValue' has a wrong offset!");

// Function BP_Mon_113.BP_Mon_113_C.ExecuteUbergraph_BP_Mon_113
// 0x01F0 (0x01F0 - 0x0000)
struct BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_Who;                                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_Killer;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_Event_HealthChangeValue;                    // 0x0018(0x01B0)(ConstParm, ContainsInstancedReference)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseComponent*                        CallFunc_PostEventAttachedActor_ReturnValue;       // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_StartCharacterStateSimple_ReturnValue;    // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113) == 0x000008, "Wrong alignment on BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113");
static_assert(sizeof(BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113) == 0x0001F0, "Wrong size on BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113");
static_assert(offsetof(BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113, EntryPoint) == 0x000000, "Member 'BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113, K2Node_Event_Who) == 0x000008, "Member 'BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113::K2Node_Event_Who' has a wrong offset!");
static_assert(offsetof(BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113, K2Node_Event_Killer) == 0x000010, "Member 'BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113::K2Node_Event_Killer' has a wrong offset!");
static_assert(offsetof(BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113, K2Node_Event_HealthChangeValue) == 0x000018, "Member 'BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113::K2Node_Event_HealthChangeValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113, ___bool_Has_Been_Initd_Variable) == 0x0001C8, "Member 'BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113, ___bool_IsClosed_Variable) == 0x0001C9, "Member 'BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0001D0, "Member 'BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113, K2Node_Event_DeltaSeconds) == 0x0001D8, "Member 'BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113, CallFunc_PostEventAttachedActor_ReturnValue) == 0x0001E0, "Member 'BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113::CallFunc_PostEventAttachedActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113, CallFunc_StartCharacterStateSimple_ReturnValue) == 0x0001E8, "Member 'BP_Mon_113_C_ExecuteUbergraph_BP_Mon_113::CallFunc_StartCharacterStateSimple_ReturnValue' has a wrong offset!");

// Function BP_Mon_113.BP_Mon_113_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Mon_113_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_113_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Mon_113_C_ReceiveTick");
static_assert(sizeof(BP_Mon_113_C_ReceiveTick) == 0x000004, "Wrong size on BP_Mon_113_C_ReceiveTick");
static_assert(offsetof(BP_Mon_113_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Mon_113_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

