#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_117

#include "Basic.hpp"

#include "BaseMonster_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mon_117.BP_Mon_117_C
// 0x0060 (0x13F0 - 0x1390)
class ABP_Mon_117_C final : public ABaseMonster_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Mon_117_C;                       // 0x1390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCapsuleComponent*                      Friction;                                          // 0x1398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_FloatingTimeLine_0123D441486631F6EB3EA68B5A55C8C5; // 0x13A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_0123D441486631F6EB3EA68B5A55C8C5; // 0x13A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A5[0x3];                                     // 0x13A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x13A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_FloatingTimeLine_FBB5ADCA4D503845E2B68EB213A1BACB; // 0x13B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_FBB5ADCA4D503845E2B68EB213A1BACB; // 0x13B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13B5[0x3];                                     // 0x13B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x13B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____1_FloatingTimeLine_7472C34F40E4FB25803F61BA3755675C; // 0x13C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____1__Direction_7472C34F40E4FB25803F61BA3755675C; // 0x13C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C5[0x3];                                     // 0x13C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     __t_1;                                             // 0x13C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      LoopFlyingEffect;                                  // 0x13D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bMobile;                                           // 0x13D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D9[0x3];                                     // 0x13D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RandomFloating;                                    // 0x13DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             Skill01End;                                        // 0x13E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, BlueprintAssignable, BlueprintCallable)

public:
	void Skill01End__DelegateSignature();
	void ExecuteUbergraph_BP_Mon_117(int32 EntryPoint);
	void RestartFloating();
	void ReceiveTick(float DeltaSeconds);
	void RisingRestartFloating();
	void StopFloating__GetDown();
	void SpecificSkillEnd(int32 SkillID);
	void _______();
	void ReceiveBeginPlay();
	void NormalFloating();
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void __t_1__UpdateFunc();
	void __t_1__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mon_117_C">();
	}
	static class ABP_Mon_117_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mon_117_C>();
	}
};
static_assert(alignof(ABP_Mon_117_C) == 0x000010, "Wrong alignment on ABP_Mon_117_C");
static_assert(sizeof(ABP_Mon_117_C) == 0x0013F0, "Wrong size on ABP_Mon_117_C");
static_assert(offsetof(ABP_Mon_117_C, UberGraphFrame_BP_Mon_117_C) == 0x001390, "Member 'ABP_Mon_117_C::UberGraphFrame_BP_Mon_117_C' has a wrong offset!");
static_assert(offsetof(ABP_Mon_117_C, Friction) == 0x001398, "Member 'ABP_Mon_117_C::Friction' has a wrong offset!");
static_assert(offsetof(ABP_Mon_117_C, Timeline_1_FloatingTimeLine_0123D441486631F6EB3EA68B5A55C8C5) == 0x0013A0, "Member 'ABP_Mon_117_C::Timeline_1_FloatingTimeLine_0123D441486631F6EB3EA68B5A55C8C5' has a wrong offset!");
static_assert(offsetof(ABP_Mon_117_C, Timeline_1__Direction_0123D441486631F6EB3EA68B5A55C8C5) == 0x0013A4, "Member 'ABP_Mon_117_C::Timeline_1__Direction_0123D441486631F6EB3EA68B5A55C8C5' has a wrong offset!");
static_assert(offsetof(ABP_Mon_117_C, Timeline_1) == 0x0013A8, "Member 'ABP_Mon_117_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_117_C, Timeline_0_FloatingTimeLine_FBB5ADCA4D503845E2B68EB213A1BACB) == 0x0013B0, "Member 'ABP_Mon_117_C::Timeline_0_FloatingTimeLine_FBB5ADCA4D503845E2B68EB213A1BACB' has a wrong offset!");
static_assert(offsetof(ABP_Mon_117_C, Timeline_0__Direction_FBB5ADCA4D503845E2B68EB213A1BACB) == 0x0013B4, "Member 'ABP_Mon_117_C::Timeline_0__Direction_FBB5ADCA4D503845E2B68EB213A1BACB' has a wrong offset!");
static_assert(offsetof(ABP_Mon_117_C, Timeline_0) == 0x0013B8, "Member 'ABP_Mon_117_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_Mon_117_C, ____1_FloatingTimeLine_7472C34F40E4FB25803F61BA3755675C) == 0x0013C0, "Member 'ABP_Mon_117_C::____1_FloatingTimeLine_7472C34F40E4FB25803F61BA3755675C' has a wrong offset!");
static_assert(offsetof(ABP_Mon_117_C, ____1__Direction_7472C34F40E4FB25803F61BA3755675C) == 0x0013C4, "Member 'ABP_Mon_117_C::____1__Direction_7472C34F40E4FB25803F61BA3755675C' has a wrong offset!");
static_assert(offsetof(ABP_Mon_117_C, __t_1) == 0x0013C8, "Member 'ABP_Mon_117_C::__t_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_117_C, LoopFlyingEffect) == 0x0013D0, "Member 'ABP_Mon_117_C::LoopFlyingEffect' has a wrong offset!");
static_assert(offsetof(ABP_Mon_117_C, bMobile) == 0x0013D8, "Member 'ABP_Mon_117_C::bMobile' has a wrong offset!");
static_assert(offsetof(ABP_Mon_117_C, RandomFloating) == 0x0013DC, "Member 'ABP_Mon_117_C::RandomFloating' has a wrong offset!");
static_assert(offsetof(ABP_Mon_117_C, Skill01End) == 0x0013E0, "Member 'ABP_Mon_117_C::Skill01End' has a wrong offset!");

}

