#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_216_SkillCollision

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mon_216_SkillCollision.BP_Mon_216_SkillCollision_C
// 0x0028 (0x0248 - 0x0220)
class ABP_Mon_216_SkillCollision_C final : public AAbilityCollisionEditor
{
public:
	class UAbilityCollision_Capsual*              AbilityCollision_Skill01_3;                        // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Capsual*              AbilityCollision_Skill01_2;                        // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Capsual*              AbilityCollision_Skill01_1;                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mon_216_SkillCollision_C">();
	}
	static class ABP_Mon_216_SkillCollision_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mon_216_SkillCollision_C>();
	}
};
static_assert(alignof(ABP_Mon_216_SkillCollision_C) == 0x000008, "Wrong alignment on ABP_Mon_216_SkillCollision_C");
static_assert(sizeof(ABP_Mon_216_SkillCollision_C) == 0x000248, "Wrong size on ABP_Mon_216_SkillCollision_C");
static_assert(offsetof(ABP_Mon_216_SkillCollision_C, AbilityCollision_Skill01_3) == 0x000220, "Member 'ABP_Mon_216_SkillCollision_C::AbilityCollision_Skill01_3' has a wrong offset!");
static_assert(offsetof(ABP_Mon_216_SkillCollision_C, AbilityCollision_Skill01_2) == 0x000228, "Member 'ABP_Mon_216_SkillCollision_C::AbilityCollision_Skill01_2' has a wrong offset!");
static_assert(offsetof(ABP_Mon_216_SkillCollision_C, AbilityCollision_Skill01_1) == 0x000230, "Member 'ABP_Mon_216_SkillCollision_C::AbilityCollision_Skill01_1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_216_SkillCollision_C, SkeletalMesh) == 0x000238, "Member 'ABP_Mon_216_SkillCollision_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_Mon_216_SkillCollision_C, DefaultSceneRoot) == 0x000240, "Member 'ABP_Mon_216_SkillCollision_C::DefaultSceneRoot' has a wrong offset!");

}

