#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_102a

#include "Basic.hpp"

#include "BaseMonster_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mon_102a.BP_Mon_102a_C
// 0x0020 (0x13B0 - 0x1390)
class ABP_Mon_102a_C final : public ABaseMonster_C
{
public:
	class USphereComponent*                       Weak;                                              // 0x1390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Friction;                                          // 0x1398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNpcAIDebugComponent*                   NpcAIDebug;                                        // 0x13A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mon_102a_C">();
	}
	static class ABP_Mon_102a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mon_102a_C>();
	}
};
static_assert(alignof(ABP_Mon_102a_C) == 0x000010, "Wrong alignment on ABP_Mon_102a_C");
static_assert(sizeof(ABP_Mon_102a_C) == 0x0013B0, "Wrong size on ABP_Mon_102a_C");
static_assert(offsetof(ABP_Mon_102a_C, Weak) == 0x001390, "Member 'ABP_Mon_102a_C::Weak' has a wrong offset!");
static_assert(offsetof(ABP_Mon_102a_C, Friction) == 0x001398, "Member 'ABP_Mon_102a_C::Friction' has a wrong offset!");
static_assert(offsetof(ABP_Mon_102a_C, NpcAIDebug) == 0x0013A0, "Member 'ABP_Mon_102a_C::NpcAIDebug' has a wrong offset!");

}

