#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon101_Body_Part01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Mon101_Body_Part01.BP_Mon101_Body_Part01_C.ExecuteUbergraph_BP_Mon101_Body_Part01
// 0x0468 (0x0468 - 0x0000)
struct BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSkeletalCenterOfMass_ReturnValue;      // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseComponent*                        CallFunc_PostEventAtLocation_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSkeletalCenterOfMass_ReturnValue_1;    // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0048(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSkeletalCenterOfMass_ReturnValue_2;    // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x00E4(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetSkeletalCenterOfMass_ReturnValue_3;    // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSkeletalCenterOfMass_ReturnValue_4;    // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_2;      // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSkeletalCenterOfMass_ReturnValue_5;    // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSkeletalCenterOfMass_ReturnValue_6;    // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  ___object_Variable;                                // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        CallFunc_FindOrAddComponent_ReturnValue;           // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterRenderComponent*              K2Node_DynamicCast_AsCharacter_Render_Component;   // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242[0x2];                                      // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartCharacterStateSimple_ReturnValue;    // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_Event_InBreaker;                            // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_Event_InHealthChangeValue;                  // 0x0258(0x01B0)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAbilityCharacterInterface> K2Node_DynamicCast_AsAbility_Character_Interface;  // 0x0418(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0429(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42A[0x6];                                      // 0x042A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  CallFunc_GetAbilityComponent_ReturnValue;          // 0x0430(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameAICharacter*                       K2Node_DynamicCast_AsGame_AICharacter;             // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_442[0x2];                                      // 0x0442(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRolePropertieValue_ReturnValue;        // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue_1;       // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0461(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01) == 0x000008, "Wrong alignment on BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01");
static_assert(sizeof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01) == 0x000468, "Wrong size on BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, EntryPoint) == 0x000000, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000008, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000010, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_GetSkeletalCenterOfMass_ReturnValue) == 0x000020, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_GetSkeletalCenterOfMass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_PostEventAtLocation_ReturnValue) == 0x000030, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_GetSkeletalCenterOfMass_ReturnValue_1) == 0x00003C, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_GetSkeletalCenterOfMass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000048, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, K2Node_Event_DeltaSeconds) == 0x0000D4, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_GetSkeletalCenterOfMass_ReturnValue_2) == 0x0000D8, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_GetSkeletalCenterOfMass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x0000E4, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_GetSkeletalCenterOfMass_ReturnValue_3) == 0x000170, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_GetSkeletalCenterOfMass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x000180, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_GetSkeletalCenterOfMass_ReturnValue_4) == 0x000188, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_GetSkeletalCenterOfMass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_SpawnSystemAtLocation_ReturnValue_2) == 0x000198, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_SpawnSystemAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_GetSkeletalCenterOfMass_ReturnValue_5) == 0x0001A0, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_GetSkeletalCenterOfMass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_GetSkeletalCenterOfMass_ReturnValue_6) == 0x0001AC, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_GetSkeletalCenterOfMass_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_Add_VectorVector_ReturnValue) == 0x0001B8, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0001C4, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_GetSocketLocation_ReturnValue) == 0x0001D0, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001DC, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_Normal_ReturnValue) == 0x0001E8, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001F4, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000200, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_Normal_ReturnValue_1) == 0x00020C, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000218, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, ___object_Variable) == 0x000228, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::___object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_FindOrAddComponent_ReturnValue) == 0x000230, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_FindOrAddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, K2Node_DynamicCast_AsCharacter_Render_Component) == 0x000238, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::K2Node_DynamicCast_AsCharacter_Render_Component' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, K2Node_DynamicCast_bSuccess) == 0x000240, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_IsValid_ReturnValue_2) == 0x000241, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_StartCharacterStateSimple_ReturnValue) == 0x000244, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_StartCharacterStateSimple_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_IsValid_ReturnValue_3) == 0x000248, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, K2Node_Event_InBreaker) == 0x000250, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::K2Node_Event_InBreaker' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, K2Node_Event_InHealthChangeValue) == 0x000258, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::K2Node_Event_InHealthChangeValue' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_IsValid_ReturnValue_4) == 0x000408, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_GetAttachParentActor_ReturnValue) == 0x000410, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, K2Node_DynamicCast_AsAbility_Character_Interface) == 0x000418, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::K2Node_DynamicCast_AsAbility_Character_Interface' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, K2Node_DynamicCast_bSuccess_1) == 0x000428, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_IsValid_ReturnValue_5) == 0x000429, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_GetAbilityComponent_ReturnValue) == 0x000430, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_GetAbilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, K2Node_DynamicCast_AsGame_AICharacter) == 0x000438, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::K2Node_DynamicCast_AsGame_AICharacter' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, K2Node_DynamicCast_bSuccess_2) == 0x000440, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_IsValid_ReturnValue_6) == 0x000441, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_GetRolePropertieValue_ReturnValue) == 0x000444, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_GetRolePropertieValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000448, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_GetAttachParentActor_ReturnValue_1) == 0x000450, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_GetAttachParentActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, K2Node_DynamicCast_AsGame_Character) == 0x000458, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, K2Node_DynamicCast_bSuccess_3) == 0x000460, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01, CallFunc_IsValid_ReturnValue_7) == 0x000461, "Member 'BP_Mon101_Body_Part01_C_ExecuteUbergraph_BP_Mon101_Body_Part01::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");

// Function BP_Mon101_Body_Part01.BP_Mon101_Body_Part01_C.OnDestructed
// 0x01B8 (0x01B8 - 0x0000)
struct BP_Mon101_Body_Part01_C_OnDestructed final
{
public:
	class AGameCharacter*                         InBreaker;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     InHealthChangeValue;                               // 0x0008(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Mon101_Body_Part01_C_OnDestructed) == 0x000008, "Wrong alignment on BP_Mon101_Body_Part01_C_OnDestructed");
static_assert(sizeof(BP_Mon101_Body_Part01_C_OnDestructed) == 0x0001B8, "Wrong size on BP_Mon101_Body_Part01_C_OnDestructed");
static_assert(offsetof(BP_Mon101_Body_Part01_C_OnDestructed, InBreaker) == 0x000000, "Member 'BP_Mon101_Body_Part01_C_OnDestructed::InBreaker' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_OnDestructed, InHealthChangeValue) == 0x000008, "Member 'BP_Mon101_Body_Part01_C_OnDestructed::InHealthChangeValue' has a wrong offset!");

// Function BP_Mon101_Body_Part01.BP_Mon101_Body_Part01_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Mon101_Body_Part01_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon101_Body_Part01_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Mon101_Body_Part01_C_ReceiveTick");
static_assert(sizeof(BP_Mon101_Body_Part01_C_ReceiveTick) == 0x000004, "Wrong size on BP_Mon101_Body_Part01_C_ReceiveTick");
static_assert(offsetof(BP_Mon101_Body_Part01_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Mon101_Body_Part01_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Mon101_Body_Part01.BP_Mon101_Body_Part01_C.CheckOwnerIsInvincible
// 0x0060 (0x0060 - 0x0000)
struct BP_Mon101_Body_Part01_C_CheckOwnerIsInvincible final
{
public:
	class UAbilityComponentBase*                  ___object_Variable;                                // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsModifierExist_ReturnValue;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAbilityCharacterInterface> K2Node_DynamicCast_AsAbility_Character_Interface;  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  CallFunc_GetAbilityComponent_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameAICharacter*                       K2Node_DynamicCast_AsGame_AICharacter;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeModifier_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon101_Body_Part01_C_CheckOwnerIsInvincible) == 0x000008, "Wrong alignment on BP_Mon101_Body_Part01_C_CheckOwnerIsInvincible");
static_assert(sizeof(BP_Mon101_Body_Part01_C_CheckOwnerIsInvincible) == 0x000060, "Wrong size on BP_Mon101_Body_Part01_C_CheckOwnerIsInvincible");
static_assert(offsetof(BP_Mon101_Body_Part01_C_CheckOwnerIsInvincible, ___object_Variable) == 0x000000, "Member 'BP_Mon101_Body_Part01_C_CheckOwnerIsInvincible::___object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mon101_Body_Part01_C_CheckOwnerIsInvincible, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_Mon101_Body_Part01_C_CheckOwnerIsInvincible::CallFunc_IsValid_ReturnValue' has a wrong offset!");
