#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_007_WP02

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Mon_007_WP02.BP_Mon_007_WP02_C.ExecuteUbergraph_BP_Mon_007_WP02
// 0x0048 (0x0048 - 0x0000)
struct BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ConstraintIndex;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_Event_OwnerCharacter;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02) == 0x000008, "Wrong alignment on BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02");
static_assert(sizeof(BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02) == 0x000048, "Wrong size on BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02");
static_assert(offsetof(BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02, EntryPoint) == 0x000000, "Member 'BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02, ___bool_Has_Been_Initd_Variable) == 0x000008, "Member 'BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02, ___bool_IsClosed_Variable) == 0x000009, "Member 'BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00000C, "Member 'BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000010, "Member 'BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000014, "Member 'BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02, K2Node_ComponentBoundEvent_ConstraintIndex) == 0x000018, "Member 'BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02::K2Node_ComponentBoundEvent_ConstraintIndex' has a wrong offset!");
static_assert(offsetof(BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02, K2Node_Event_OwnerCharacter) == 0x000020, "Member 'BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02::K2Node_Event_OwnerCharacter' has a wrong offset!");
static_assert(offsetof(BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02, CallFunc_RandomBool_ReturnValue) == 0x000028, "Member 'BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02, CallFunc_SelectFloat_ReturnValue) == 0x00002C, "Member 'BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000030, "Member 'BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02, CallFunc_Multiply_IntFloat_ReturnValue_2) == 0x000034, "Member 'BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02::CallFunc_Multiply_IntFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02, CallFunc_MakeVector_ReturnValue) == 0x000038, "Member 'BP_Mon_007_WP02_C_ExecuteUbergraph_BP_Mon_007_WP02::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function BP_Mon_007_WP02.BP_Mon_007_WP02_C.OnOwnerDiePerform
// 0x0008 (0x0008 - 0x0000)
struct BP_Mon_007_WP02_C_OnOwnerDiePerform final
{
public:
	class AGameCharacter*                         OwnerCharacter;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_007_WP02_C_OnOwnerDiePerform) == 0x000008, "Wrong alignment on BP_Mon_007_WP02_C_OnOwnerDiePerform");
static_assert(sizeof(BP_Mon_007_WP02_C_OnOwnerDiePerform) == 0x000008, "Wrong size on BP_Mon_007_WP02_C_OnOwnerDiePerform");
static_assert(offsetof(BP_Mon_007_WP02_C_OnOwnerDiePerform, OwnerCharacter) == 0x000000, "Member 'BP_Mon_007_WP02_C_OnOwnerDiePerform::OwnerCharacter' has a wrong offset!");

// Function BP_Mon_007_WP02.BP_Mon_007_WP02_C.BndEvt__mon003_wp01_skm_K2Node_ComponentBoundEvent_0_ConstraintBrokenSignature__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_Mon_007_WP02_C_BndEvt__mon003_wp01_skm_K2Node_ComponentBoundEvent_0_ConstraintBrokenSignature__DelegateSignature final
{
public:
	int32                                         ConstraintIndex;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mon_007_WP02_C_BndEvt__mon003_wp01_skm_K2Node_ComponentBoundEvent_0_ConstraintBrokenSignature__DelegateSignature) == 0x000004, "Wrong alignment on BP_Mon_007_WP02_C_BndEvt__mon003_wp01_skm_K2Node_ComponentBoundEvent_0_ConstraintBrokenSignature__DelegateSignature");
static_assert(sizeof(BP_Mon_007_WP02_C_BndEvt__mon003_wp01_skm_K2Node_ComponentBoundEvent_0_ConstraintBrokenSignature__DelegateSignature) == 0x000004, "Wrong size on BP_Mon_007_WP02_C_BndEvt__mon003_wp01_skm_K2Node_ComponentBoundEvent_0_ConstraintBrokenSignature__DelegateSignature");
static_assert(offsetof(BP_Mon_007_WP02_C_BndEvt__mon003_wp01_skm_K2Node_ComponentBoundEvent_0_ConstraintBrokenSignature__DelegateSignature, ConstraintIndex) == 0x000000, "Member 'BP_Mon_007_WP02_C_BndEvt__mon003_wp01_skm_K2Node_ComponentBoundEvent_0_ConstraintBrokenSignature__DelegateSignature::ConstraintIndex' has a wrong offset!");

}

