#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_109_Part01b

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mon_109_Part01b.BP_Mon_109_Part01b_C
// 0x0040 (0x05C8 - 0x0588)
class ABP_Mon_109_Part01b_C final : public AAccessory_Destructible
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0588(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Mon109_part01_skm;                                 // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDamagePoint_C*                         DamagePoint;                                       // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box2;                                              // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BOX1;                                              // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDamagePoint_C*                         DamagePoint1;                                      // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void OnOwnerDiePerform(class AGameCharacter* OwnerCharacter);
	void CheckOwnerIsInvincible();
	void OnDestructed(class AGameCharacter* InBreaker, const struct FHealthChangeValue& InHealthChangeValue);
	void ReceiveTick(float DeltaSeconds);
	void Detach();
	void ExecuteUbergraph_BP_Mon_109_Part01b(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mon_109_Part01b_C">();
	}
	static class ABP_Mon_109_Part01b_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mon_109_Part01b_C>();
	}
};
static_assert(alignof(ABP_Mon_109_Part01b_C) == 0x000008, "Wrong alignment on ABP_Mon_109_Part01b_C");
static_assert(sizeof(ABP_Mon_109_Part01b_C) == 0x0005C8, "Wrong size on ABP_Mon_109_Part01b_C");
static_assert(offsetof(ABP_Mon_109_Part01b_C, UberGraphFrame) == 0x000588, "Member 'ABP_Mon_109_Part01b_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Mon_109_Part01b_C, Mon109_part01_skm) == 0x000590, "Member 'ABP_Mon_109_Part01b_C::Mon109_part01_skm' has a wrong offset!");
static_assert(offsetof(ABP_Mon_109_Part01b_C, DamagePoint) == 0x000598, "Member 'ABP_Mon_109_Part01b_C::DamagePoint' has a wrong offset!");
static_assert(offsetof(ABP_Mon_109_Part01b_C, Box2) == 0x0005A0, "Member 'ABP_Mon_109_Part01b_C::Box2' has a wrong offset!");
static_assert(offsetof(ABP_Mon_109_Part01b_C, BOX1) == 0x0005A8, "Member 'ABP_Mon_109_Part01b_C::BOX1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_109_Part01b_C, Box) == 0x0005B0, "Member 'ABP_Mon_109_Part01b_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_Mon_109_Part01b_C, DamagePoint1) == 0x0005B8, "Member 'ABP_Mon_109_Part01b_C::DamagePoint1' has a wrong offset!");
static_assert(offsetof(ABP_Mon_109_Part01b_C, DefaultSceneRoot) == 0x0005C0, "Member 'ABP_Mon_109_Part01b_C::DefaultSceneRoot' has a wrong offset!");

}

