#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon101_Body_Part01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mon101_Body_Part01.BP_Mon101_Body_Part01_C
// 0x0070 (0x05F8 - 0x0588)
class ABP_Mon101_Body_Part01_C final : public AAccessory_Destructible
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0588(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAbilityCollision_Box*                  AbilityCollision_Box;                              // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh1;                                     // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_0EBC297C4F5AB26457C230A564260896; // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_0EBC297C4F5AB26457C230A564260896; // 0x05B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B5[0x3];                                      // 0x05B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Particle01;                                        // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ID;                                                // 0x05C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ParentLocation;                                    // 0x05CC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 ParentMesh;                                        // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Particle02;                                        // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Particle03;                                        // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Particle04;                                        // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Mon101_Body_Part01(int32 EntryPoint);
	void OnDestructed(class AGameCharacter* InBreaker, const struct FHealthChangeValue& InHealthChangeValue);
	void ReceiveTick(float DeltaSeconds);
	void DestructionEvent();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void CheckOwnerIsInvincible();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mon101_Body_Part01_C">();
	}
	static class ABP_Mon101_Body_Part01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mon101_Body_Part01_C>();
	}
};
static_assert(alignof(ABP_Mon101_Body_Part01_C) == 0x000008, "Wrong alignment on ABP_Mon101_Body_Part01_C");
static_assert(sizeof(ABP_Mon101_Body_Part01_C) == 0x0005F8, "Wrong size on ABP_Mon101_Body_Part01_C");
static_assert(offsetof(ABP_Mon101_Body_Part01_C, UberGraphFrame) == 0x000588, "Member 'ABP_Mon101_Body_Part01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Mon101_Body_Part01_C, AbilityCollision_Box) == 0x000590, "Member 'ABP_Mon101_Body_Part01_C::AbilityCollision_Box' has a wrong offset!");
static_assert(offsetof(ABP_Mon101_Body_Part01_C, SkeletalMesh1) == 0x000598, "Member 'ABP_Mon101_Body_Part01_C::SkeletalMesh1' has a wrong offset!");
static_assert(offsetof(ABP_Mon101_Body_Part01_C, SkeletalMesh) == 0x0005A0, "Member 'ABP_Mon101_Body_Part01_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_Mon101_Body_Part01_C, Scene) == 0x0005A8, "Member 'ABP_Mon101_Body_Part01_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_Mon101_Body_Part01_C, Timeline_0_NewTrack_0_0EBC297C4F5AB26457C230A564260896) == 0x0005B0, "Member 'ABP_Mon101_Body_Part01_C::Timeline_0_NewTrack_0_0EBC297C4F5AB26457C230A564260896' has a wrong offset!");
static_assert(offsetof(ABP_Mon101_Body_Part01_C, Timeline_0__Direction_0EBC297C4F5AB26457C230A564260896) == 0x0005B4, "Member 'ABP_Mon101_Body_Part01_C::Timeline_0__Direction_0EBC297C4F5AB26457C230A564260896' has a wrong offset!");
static_assert(offsetof(ABP_Mon101_Body_Part01_C, Timeline_0) == 0x0005B8, "Member 'ABP_Mon101_Body_Part01_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_Mon101_Body_Part01_C, Particle01) == 0x0005C0, "Member 'ABP_Mon101_Body_Part01_C::Particle01' has a wrong offset!");
static_assert(offsetof(ABP_Mon101_Body_Part01_C, ID) == 0x0005C8, "Member 'ABP_Mon101_Body_Part01_C::ID' has a wrong offset!");
static_assert(offsetof(ABP_Mon101_Body_Part01_C, ParentLocation) == 0x0005CC, "Member 'ABP_Mon101_Body_Part01_C::ParentLocation' has a wrong offset!");
static_assert(offsetof(ABP_Mon101_Body_Part01_C, ParentMesh) == 0x0005D8, "Member 'ABP_Mon101_Body_Part01_C::ParentMesh' has a wrong offset!");
static_assert(offsetof(ABP_Mon101_Body_Part01_C, Particle02) == 0x0005E0, "Member 'ABP_Mon101_Body_Part01_C::Particle02' has a wrong offset!");
static_assert(offsetof(ABP_Mon101_Body_Part01_C, Particle03) == 0x0005E8, "Member 'ABP_Mon101_Body_Part01_C::Particle03' has a wrong offset!");
static_assert(offsetof(ABP_Mon101_Body_Part01_C, Particle04) == 0x0005F0, "Member 'ABP_Mon101_Body_Part01_C::Particle04' has a wrong offset!");

}

