#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mon_110_Part01a

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mon_110_Part01a.BP_Mon_110_Part01a_C
// 0x0028 (0x05B0 - 0x0588)
class ABP_Mon_110_Part01a_C final : public AAccessory_Destructible
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0588(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_2DE321944E2608F54E1C1A821DE0C8A4; // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_2DE321944E2608F54E1C1A821DE0C8A4; // 0x059C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59D[0x3];                                      // 0x059D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EnergyEffectId;                                    // 0x05A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CheckOwnerIsInvincible();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void ReceiveBeginPlay();
	void OnOwnerDiePerform(class AGameCharacter* OwnerCharacter);
	void ExecuteUbergraph_BP_Mon_110_Part01a(int32 EntryPoint);
	void OnDestructed(class AGameCharacter* InBreaker, const struct FHealthChangeValue& InHealthChangeValue);
	void EndEffect();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mon_110_Part01a_C">();
	}
	static class ABP_Mon_110_Part01a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mon_110_Part01a_C>();
	}
};
static_assert(alignof(ABP_Mon_110_Part01a_C) == 0x000008, "Wrong alignment on ABP_Mon_110_Part01a_C");
static_assert(sizeof(ABP_Mon_110_Part01a_C) == 0x0005B0, "Wrong size on ABP_Mon_110_Part01a_C");
static_assert(offsetof(ABP_Mon_110_Part01a_C, UberGraphFrame) == 0x000588, "Member 'ABP_Mon_110_Part01a_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Mon_110_Part01a_C, SkeletalMesh) == 0x000590, "Member 'ABP_Mon_110_Part01a_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_Mon_110_Part01a_C, Timeline_0_NewTrack_0_2DE321944E2608F54E1C1A821DE0C8A4) == 0x000598, "Member 'ABP_Mon_110_Part01a_C::Timeline_0_NewTrack_0_2DE321944E2608F54E1C1A821DE0C8A4' has a wrong offset!");
static_assert(offsetof(ABP_Mon_110_Part01a_C, Timeline_0__Direction_2DE321944E2608F54E1C1A821DE0C8A4) == 0x00059C, "Member 'ABP_Mon_110_Part01a_C::Timeline_0__Direction_2DE321944E2608F54E1C1A821DE0C8A4' has a wrong offset!");
static_assert(offsetof(ABP_Mon_110_Part01a_C, Timeline_0) == 0x0005A0, "Member 'ABP_Mon_110_Part01a_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_Mon_110_Part01a_C, EnergyEffectId) == 0x0005A8, "Member 'ABP_Mon_110_Part01a_C::EnergyEffectId' has a wrong offset!");

}

