#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_023

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_HighLevelNpc_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPC_023.BP_NPC_023_C
// 0x0030 (0x14B0 - 0x1480)
class ABP_NPC_023_C final : public ABP_HighLevelNpc_Base_C
{
public:
	uint8                                         Pad_1474[0x4];                                     // 0x1474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_NPC_023_C;                       // 0x1478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_Girl023_PhysicsControl_C*           BP_Girl023_PhysicsControl;                         // 0x1480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 MiyaIgnoreInterruptDodgeSkills;                    // 0x1488(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         AAngle;                                            // 0x1498(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BAngle;                                            // 0x149C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AccumulatePercentage;                              // 0x14A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalRuntime;                                      // 0x14A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GetInterruptSkillCancelSelector(int32 SkillID, bool* Result);
	void ReceiveBeginPlay();
	void ResetLogicAndSpeed(float WalkSpeed);
	void CustomEvent_0();
	void ExecuteUbergraph_BP_NPC_023(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_NPC_023_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_NPC_023_C")
	}
	static class ABP_NPC_023_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NPC_023_C>();
	}
};
DUMPER7_ASSERTS_ABP_NPC_023_C;

}

