#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OS_BaseShip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "NetworkSplineMovement_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OS_BaseShip.BP_OS_BaseShip_C
// 0x0070 (0x1280 - 0x1210)
class ABP_OS_BaseShip_C final : public AOS_BaseShip
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1210(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        HPBarComponent;                                    // 0x1218(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x1220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_NewTrack_0_B6EE44024DE6FD705315328725D3A4AD; // 0x1228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_B6EE44024DE6FD705315328725D3A4AD; // 0x122C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122D[0x3];                                     // 0x122D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x1230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_873EBFEB46682AB8617B968C5F97F3D5; // 0x1238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_873EBFEB46682AB8617B968C5F97F3D5; // 0x123C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_123D[0x3];                                     // 0x123D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x1240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Spline_C*                           SplineActor;                                       // 0x1248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         DeadEffect;                                        // 0x1250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                Fans;                                              // 0x1258(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FTimerHandle                           FansRotateTimer;                                   // 0x1268(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWwiseComponent*                        AudioRef;                                          // 0x1270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddDieExp();
	void Stop();
	void Move(bool bInitial, bool bMoveForward, bool bLoop, bool bLoopReverse, bool bUseDistance, float Speed_0);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void OnDie(class AGameCharacter* Who, class AGameCharacter* Killer, const struct FHealthChangeValue& HealthChangeValue);
	void PlayHitAnimation(const struct FApplyDamageResultData& DamageResultData);
	void FansOff();
	void FansOn();
	void KeepRotate();
	void FansController(ENetworkSplineState State);
	void ExecuteUbergraph_BP_OS_BaseShip(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_OS_BaseShip_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_OS_BaseShip_C")
	}
	static class ABP_OS_BaseShip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OS_BaseShip_C>();
	}
};
DUMPER7_ASSERTS_ABP_OS_BaseShip_C;

}

