#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OS_BaseShip

#include "Basic.hpp"

#include "NetworkSplineMovement_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OS_BaseShip.BP_OS_BaseShip_C
// 0x0070 (0x1250 - 0x11E0)
class ABP_OS_BaseShip_C final : public AOS_BaseShip
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x11E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        HPBarComponent;                                    // 0x11E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x11F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_NewTrack_0_B6EE44024DE6FD705315328725D3A4AD; // 0x11F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_B6EE44024DE6FD705315328725D3A4AD; // 0x11FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11FD[0x3];                                     // 0x11FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x1200(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_873EBFEB46682AB8617B968C5F97F3D5; // 0x1208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_873EBFEB46682AB8617B968C5F97F3D5; // 0x120C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_120D[0x3];                                     // 0x120D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x1210(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Spline_C*                           SplineActor;                                       // 0x1218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         DeadEffect;                                        // 0x1220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                Fans;                                              // 0x1228(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FTimerHandle                           FansRotateTimer;                                   // 0x1238(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWwiseComponent*                        AudioRef;                                          // 0x1240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddDieExp();
	void Stop();
	void Move(bool bInitial, bool bMoveForward, bool bLoop, bool bLoopReverse, bool bUseDistance, float Speed_0);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void OnDie(class AGameCharacter* Who, class AGameCharacter* Killer, const struct FHealthChangeValue& HealthChangeValue);
	void PlayHitAnimation(const struct FApplyDamageResultData& DamageResultData);
	void FansOff();
	void FansOn();
	void KeepRotate();
	void FansController(ENetworkSplineState State);
	void ExecuteUbergraph_BP_OS_BaseShip(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_OS_BaseShip_C">();
	}
	static class ABP_OS_BaseShip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OS_BaseShip_C>();
	}
};
static_assert(alignof(ABP_OS_BaseShip_C) == 0x000010, "Wrong alignment on ABP_OS_BaseShip_C");
static_assert(sizeof(ABP_OS_BaseShip_C) == 0x001250, "Wrong size on ABP_OS_BaseShip_C");
static_assert(offsetof(ABP_OS_BaseShip_C, UberGraphFrame) == 0x0011E0, "Member 'ABP_OS_BaseShip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_OS_BaseShip_C, HPBarComponent) == 0x0011E8, "Member 'ABP_OS_BaseShip_C::HPBarComponent' has a wrong offset!");
static_assert(offsetof(ABP_OS_BaseShip_C, Box) == 0x0011F0, "Member 'ABP_OS_BaseShip_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_OS_BaseShip_C, Timeline_1_NewTrack_0_B6EE44024DE6FD705315328725D3A4AD) == 0x0011F8, "Member 'ABP_OS_BaseShip_C::Timeline_1_NewTrack_0_B6EE44024DE6FD705315328725D3A4AD' has a wrong offset!");
static_assert(offsetof(ABP_OS_BaseShip_C, Timeline_1__Direction_B6EE44024DE6FD705315328725D3A4AD) == 0x0011FC, "Member 'ABP_OS_BaseShip_C::Timeline_1__Direction_B6EE44024DE6FD705315328725D3A4AD' has a wrong offset!");
static_assert(offsetof(ABP_OS_BaseShip_C, Timeline_1) == 0x001200, "Member 'ABP_OS_BaseShip_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ABP_OS_BaseShip_C, Timeline_0_NewTrack_0_873EBFEB46682AB8617B968C5F97F3D5) == 0x001208, "Member 'ABP_OS_BaseShip_C::Timeline_0_NewTrack_0_873EBFEB46682AB8617B968C5F97F3D5' has a wrong offset!");
static_assert(offsetof(ABP_OS_BaseShip_C, Timeline_0__Direction_873EBFEB46682AB8617B968C5F97F3D5) == 0x00120C, "Member 'ABP_OS_BaseShip_C::Timeline_0__Direction_873EBFEB46682AB8617B968C5F97F3D5' has a wrong offset!");
static_assert(offsetof(ABP_OS_BaseShip_C, Timeline_0) == 0x001210, "Member 'ABP_OS_BaseShip_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_OS_BaseShip_C, SplineActor) == 0x001218, "Member 'ABP_OS_BaseShip_C::SplineActor' has a wrong offset!");
static_assert(offsetof(ABP_OS_BaseShip_C, DeadEffect) == 0x001220, "Member 'ABP_OS_BaseShip_C::DeadEffect' has a wrong offset!");
static_assert(offsetof(ABP_OS_BaseShip_C, Fans) == 0x001228, "Member 'ABP_OS_BaseShip_C::Fans' has a wrong offset!");
static_assert(offsetof(ABP_OS_BaseShip_C, FansRotateTimer) == 0x001238, "Member 'ABP_OS_BaseShip_C::FansRotateTimer' has a wrong offset!");
static_assert(offsetof(ABP_OS_BaseShip_C, AudioRef) == 0x001240, "Member 'ABP_OS_BaseShip_C::AudioRef' has a wrong offset!");

}

