#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PreviewModel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "St_previewLgiht_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PreviewModel.BP_PreviewModel_C
// 0x0058 (0x0778 - 0x0720)
class ABP_PreviewModel_C : public APreviewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0720(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0728(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        LightPos;                                          // 0x0730(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSt_previewLgiht>               LightData;                                         // 0x0740(0x0010)(Edit, BlueprintVisible)
	TArray<struct FVector>                        CatchLights;                                       // 0x0750(0x0010)(Edit, BlueprintVisible)
	TArray<class UMaterialInstanceDynamic*>       Mat;                                               // 0x0760(0x0010)(Edit, BlueprintVisible)
	bool                                          Editor;                                            // 0x0770(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void UpdateVectorParameter(const struct FMaterialParameterInfo& Info, const struct FLinearColor& Value);
	void Update_Rendering_depth();
	void CreateDynamicMat();
	void BuildLight();
	void UserConstructionScript();
	void OnPreviewModelMeshChange();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_PreviewModel(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PreviewModel_C">();
	}
	static class ABP_PreviewModel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PreviewModel_C>();
	}
};
static_assert(alignof(ABP_PreviewModel_C) == 0x000008, "Wrong alignment on ABP_PreviewModel_C");
static_assert(sizeof(ABP_PreviewModel_C) == 0x000778, "Wrong size on ABP_PreviewModel_C");
static_assert(offsetof(ABP_PreviewModel_C, UberGraphFrame) == 0x000720, "Member 'ABP_PreviewModel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PreviewModel_C, DefaultSceneRoot) == 0x000728, "Member 'ABP_PreviewModel_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_PreviewModel_C, LightPos) == 0x000730, "Member 'ABP_PreviewModel_C::LightPos' has a wrong offset!");
static_assert(offsetof(ABP_PreviewModel_C, LightData) == 0x000740, "Member 'ABP_PreviewModel_C::LightData' has a wrong offset!");
static_assert(offsetof(ABP_PreviewModel_C, CatchLights) == 0x000750, "Member 'ABP_PreviewModel_C::CatchLights' has a wrong offset!");
static_assert(offsetof(ABP_PreviewModel_C, Mat) == 0x000760, "Member 'ABP_PreviewModel_C::Mat' has a wrong offset!");
static_assert(offsetof(ABP_PreviewModel_C, Editor) == 0x000770, "Member 'ABP_PreviewModel_C::Editor' has a wrong offset!");

}

