#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_prop_interact072

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_prop_interact072.BP_prop_interact072_C.OnNotifyEnd_D07CC3F840DFDE64C3585E92554E6E0A
// 0x0008 (0x0008 - 0x0000)
struct BP_prop_interact072_C_OnNotifyEnd_D07CC3F840DFDE64C3585E92554E6E0A final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_prop_interact072_C_OnNotifyEnd_D07CC3F840DFDE64C3585E92554E6E0A;

// Function BP_prop_interact072.BP_prop_interact072_C.OnNotifyBegin_D07CC3F840DFDE64C3585E92554E6E0A
// 0x0008 (0x0008 - 0x0000)
struct BP_prop_interact072_C_OnNotifyBegin_D07CC3F840DFDE64C3585E92554E6E0A final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_prop_interact072_C_OnNotifyBegin_D07CC3F840DFDE64C3585E92554E6E0A;

// Function BP_prop_interact072.BP_prop_interact072_C.OnInterrupted_D07CC3F840DFDE64C3585E92554E6E0A
// 0x0008 (0x0008 - 0x0000)
struct BP_prop_interact072_C_OnInterrupted_D07CC3F840DFDE64C3585E92554E6E0A final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_prop_interact072_C_OnInterrupted_D07CC3F840DFDE64C3585E92554E6E0A;

// Function BP_prop_interact072.BP_prop_interact072_C.OnBlendOut_D07CC3F840DFDE64C3585E92554E6E0A
// 0x0008 (0x0008 - 0x0000)
struct BP_prop_interact072_C_OnBlendOut_D07CC3F840DFDE64C3585E92554E6E0A final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_prop_interact072_C_OnBlendOut_D07CC3F840DFDE64C3585E92554E6E0A;

// Function BP_prop_interact072.BP_prop_interact072_C.OnCompleted_D07CC3F840DFDE64C3585E92554E6E0A
// 0x0008 (0x0008 - 0x0000)
struct BP_prop_interact072_C_OnCompleted_D07CC3F840DFDE64C3585E92554E6E0A final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_prop_interact072_C_OnCompleted_D07CC3F840DFDE64C3585E92554E6E0A;

// Function BP_prop_interact072.BP_prop_interact072_C.ExecuteUbergraph_BP_prop_interact072
// 0x0098 (0x0098 - 0x0000)
struct BP_prop_interact072_C_ExecuteUbergraph_BP_prop_interact072 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   ___name_Variable;                                  // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_prop_interact072_C_ExecuteUbergraph_BP_prop_interact072;

}

