#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PreviewModel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PreviewModel.BP_PreviewModel_C.UpdateVectorParameter
// 0x0090 (0x0090 - 0x0000)
struct BP_PreviewModel_C_UpdateVectorParameter final
{
public:
	struct FMaterialParameterInfo                 Info;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Value;                                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0058(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_As______;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PreviewModel_C_UpdateVectorParameter) == 0x000008, "Wrong alignment on BP_PreviewModel_C_UpdateVectorParameter");
static_assert(sizeof(BP_PreviewModel_C_UpdateVectorParameter) == 0x000090, "Wrong size on BP_PreviewModel_C_UpdateVectorParameter");
static_assert(offsetof(BP_PreviewModel_C_UpdateVectorParameter, Info) == 0x000000, "Member 'BP_PreviewModel_C_UpdateVectorParameter::Info' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_UpdateVectorParameter, Value) == 0x000010, "Member 'BP_PreviewModel_C_UpdateVectorParameter::Value' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_UpdateVectorParameter, ___int_Loop_Counter_Variable) == 0x000020, "Member 'BP_PreviewModel_C_UpdateVectorParameter::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_UpdateVectorParameter, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_PreviewModel_C_UpdateVectorParameter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_UpdateVectorParameter, ___int_Array_Index_Variable) == 0x000028, "Member 'BP_PreviewModel_C_UpdateVectorParameter::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_UpdateVectorParameter, ___int_Array_Index_Variable_1) == 0x00002C, "Member 'BP_PreviewModel_C_UpdateVectorParameter::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_UpdateVectorParameter, ___int_Loop_Counter_Variable_1) == 0x000030, "Member 'BP_PreviewModel_C_UpdateVectorParameter::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_UpdateVectorParameter, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000038, "Member 'BP_PreviewModel_C_UpdateVectorParameter::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_UpdateVectorParameter, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_PreviewModel_C_UpdateVectorParameter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_UpdateVectorParameter, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_PreviewModel_C_UpdateVectorParameter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_UpdateVectorParameter, CallFunc_GetMaterials_ReturnValue) == 0x000058, "Member 'BP_PreviewModel_C_UpdateVectorParameter::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_UpdateVectorParameter, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'BP_PreviewModel_C_UpdateVectorParameter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_UpdateVectorParameter, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'BP_PreviewModel_C_UpdateVectorParameter::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_UpdateVectorParameter, K2Node_DynamicCast_As______) == 0x000078, "Member 'BP_PreviewModel_C_UpdateVectorParameter::K2Node_DynamicCast_As______' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_UpdateVectorParameter, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'BP_PreviewModel_C_UpdateVectorParameter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_UpdateVectorParameter, CallFunc_Array_Length_ReturnValue_1) == 0x000084, "Member 'BP_PreviewModel_C_UpdateVectorParameter::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_UpdateVectorParameter, CallFunc_Less_IntInt_ReturnValue_1) == 0x000088, "Member 'BP_PreviewModel_C_UpdateVectorParameter::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_UpdateVectorParameter, CallFunc_Add_IntInt_ReturnValue_1) == 0x00008C, "Member 'BP_PreviewModel_C_UpdateVectorParameter::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_PreviewModel.BP_PreviewModel_C.Update Rendering depth
// 0x0068 (0x0068 - 0x0000)
struct BP_PreviewModel_C_Update_Rendering_depth final
{
public:
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetConsoleVariableFloatValue_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue_1;    // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PreviewModel_C_Update_Rendering_depth) == 0x000008, "Wrong alignment on BP_PreviewModel_C_Update_Rendering_depth");
static_assert(sizeof(BP_PreviewModel_C_Update_Rendering_depth) == 0x000068, "Wrong size on BP_PreviewModel_C_Update_Rendering_depth");
static_assert(offsetof(BP_PreviewModel_C_Update_Rendering_depth, ___int_Loop_Counter_Variable) == 0x000000, "Member 'BP_PreviewModel_C_Update_Rendering_depth::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_Update_Rendering_depth, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_PreviewModel_C_Update_Rendering_depth::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_Update_Rendering_depth, ___int_Array_Index_Variable) == 0x000008, "Member 'BP_PreviewModel_C_Update_Rendering_depth::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_Update_Rendering_depth, ___int_Array_Index_Variable_1) == 0x00000C, "Member 'BP_PreviewModel_C_Update_Rendering_depth::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_Update_Rendering_depth, CallFunc_GetConsoleVariableFloatValue_ReturnValue) == 0x000010, "Member 'BP_PreviewModel_C_Update_Rendering_depth::CallFunc_GetConsoleVariableFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_Update_Rendering_depth, ___int_Loop_Counter_Variable_1) == 0x000014, "Member 'BP_PreviewModel_C_Update_Rendering_depth::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_Update_Rendering_depth, CallFunc_Add_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_PreviewModel_C_Update_Rendering_depth::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_Update_Rendering_depth, CallFunc_FTrunc_ReturnValue) == 0x00001C, "Member 'BP_PreviewModel_C_Update_Rendering_depth::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_Update_Rendering_depth, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'BP_PreviewModel_C_Update_Rendering_depth::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_Update_Rendering_depth, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000028, "Member 'BP_PreviewModel_C_Update_Rendering_depth::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_Update_Rendering_depth, CallFunc_K2_GetComponentsByClass_ReturnValue_1) == 0x000038, "Member 'BP_PreviewModel_C_Update_Rendering_depth::CallFunc_K2_GetComponentsByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_Update_Rendering_depth, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_PreviewModel_C_Update_Rendering_depth::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_Update_Rendering_depth, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'BP_PreviewModel_C_Update_Rendering_depth::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_Update_Rendering_depth, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_PreviewModel_C_Update_Rendering_depth::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_Update_Rendering_depth, CallFunc_Array_Length_ReturnValue_1) == 0x00005C, "Member 'BP_PreviewModel_C_Update_Rendering_depth::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_Update_Rendering_depth, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'BP_PreviewModel_C_Update_Rendering_depth::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_Update_Rendering_depth, CallFunc_Less_IntInt_ReturnValue_1) == 0x000061, "Member 'BP_PreviewModel_C_Update_Rendering_depth::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_PreviewModel.BP_PreviewModel_C.CreateDynamicMat
// 0x00E8 (0x00E8 - 0x0000)
struct BP_PreviewModel_C_CreateDynamicMat final
{
public:
	int32                                         ___int_Array_Index_Variable;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_2;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_2;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_3;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_3;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue_1;    // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStaticMaterial                        CallFunc_Array_Get_Item_2;                         // 0x0060(0x0030)(NoDestructor)
	struct FSkeletalMaterial                      CallFunc_Array_Get_Item_3;                         // 0x0090(0x0028)(NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PreviewModel_C_CreateDynamicMat) == 0x000008, "Wrong alignment on BP_PreviewModel_C_CreateDynamicMat");
static_assert(sizeof(BP_PreviewModel_C_CreateDynamicMat) == 0x0000E8, "Wrong size on BP_PreviewModel_C_CreateDynamicMat");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, ___int_Array_Index_Variable) == 0x000000, "Member 'BP_PreviewModel_C_CreateDynamicMat::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, ___int_Loop_Counter_Variable) == 0x000004, "Member 'BP_PreviewModel_C_CreateDynamicMat::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_PreviewModel_C_CreateDynamicMat::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, ___int_Loop_Counter_Variable_1) == 0x00000C, "Member 'BP_PreviewModel_C_CreateDynamicMat::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, ___int_Loop_Counter_Variable_2) == 0x000010, "Member 'BP_PreviewModel_C_CreateDynamicMat::___int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'BP_PreviewModel_C_CreateDynamicMat::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, CallFunc_Add_IntInt_ReturnValue_2) == 0x000018, "Member 'BP_PreviewModel_C_CreateDynamicMat::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, ___int_Array_Index_Variable_1) == 0x00001C, "Member 'BP_PreviewModel_C_CreateDynamicMat::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, ___int_Array_Index_Variable_2) == 0x000020, "Member 'BP_PreviewModel_C_CreateDynamicMat::___int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, ___int_Loop_Counter_Variable_3) == 0x000024, "Member 'BP_PreviewModel_C_CreateDynamicMat::___int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, CallFunc_Add_IntInt_ReturnValue_3) == 0x000028, "Member 'BP_PreviewModel_C_CreateDynamicMat::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, ___int_Array_Index_Variable_3) == 0x00002C, "Member 'BP_PreviewModel_C_CreateDynamicMat::___int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000030, "Member 'BP_PreviewModel_C_CreateDynamicMat::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, CallFunc_K2_GetComponentsByClass_ReturnValue_1) == 0x000040, "Member 'BP_PreviewModel_C_CreateDynamicMat::CallFunc_K2_GetComponentsByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_PreviewModel_C_CreateDynamicMat::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'BP_PreviewModel_C_CreateDynamicMat::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, CallFunc_Array_Get_Item_2) == 0x000060, "Member 'BP_PreviewModel_C_CreateDynamicMat::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, CallFunc_Array_Get_Item_3) == 0x000090, "Member 'BP_PreviewModel_C_CreateDynamicMat::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000B8, "Member 'BP_PreviewModel_C_CreateDynamicMat::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x0000C0, "Member 'BP_PreviewModel_C_CreateDynamicMat::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, CallFunc_Array_Add_ReturnValue) == 0x0000C8, "Member 'BP_PreviewModel_C_CreateDynamicMat::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, CallFunc_Array_Add_ReturnValue_1) == 0x0000CC, "Member 'BP_PreviewModel_C_CreateDynamicMat::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, CallFunc_Array_Length_ReturnValue) == 0x0000D0, "Member 'BP_PreviewModel_C_CreateDynamicMat::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, CallFunc_Array_Length_ReturnValue_1) == 0x0000D4, "Member 'BP_PreviewModel_C_CreateDynamicMat::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, CallFunc_Less_IntInt_ReturnValue) == 0x0000D8, "Member 'BP_PreviewModel_C_CreateDynamicMat::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000D9, "Member 'BP_PreviewModel_C_CreateDynamicMat::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, CallFunc_Array_Length_ReturnValue_2) == 0x0000DC, "Member 'BP_PreviewModel_C_CreateDynamicMat::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, CallFunc_Array_Length_ReturnValue_3) == 0x0000E0, "Member 'BP_PreviewModel_C_CreateDynamicMat::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000E4, "Member 'BP_PreviewModel_C_CreateDynamicMat::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_CreateDynamicMat, CallFunc_Less_IntInt_ReturnValue_3) == 0x0000E5, "Member 'BP_PreviewModel_C_CreateDynamicMat::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");

// Function BP_PreviewModel.BP_PreviewModel_C.BuildLight
// 0x0170 (0x0170 - 0x0000)
struct BP_PreviewModel_C_BuildLight final
{
public:
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0124(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_1;                         // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PreviewModel_C_BuildLight) == 0x000010, "Wrong alignment on BP_PreviewModel_C_BuildLight");
static_assert(sizeof(BP_PreviewModel_C_BuildLight) == 0x000170, "Wrong size on BP_PreviewModel_C_BuildLight");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, ___int_Loop_Counter_Variable) == 0x000000, "Member 'BP_PreviewModel_C_BuildLight::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, ___int_Array_Index_Variable) == 0x000008, "Member 'BP_PreviewModel_C_BuildLight::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, ___int_Array_Index_Variable_1) == 0x000040, "Member 'BP_PreviewModel_C_BuildLight::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_Conv_IntToString_ReturnValue) == 0x000050, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000060, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_Concat_StrStr_ReturnValue) == 0x000070, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000080, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000090, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000A0, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_Conv_StringToName_ReturnValue) == 0x0000B0, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_Conv_StringToName_ReturnValue_1) == 0x0000B8, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_MakeLiteralName_ReturnValue) == 0x0000C0, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_MakeLiteralName_ReturnValue_1) == 0x0000C8, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_Conv_NameToString_ReturnValue) == 0x0000D0, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0000E0, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000F0, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_Array_Length_ReturnValue) == 0x000100, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000108, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_Less_IntInt_ReturnValue) == 0x000118, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, ___int_Loop_Counter_Variable_1) == 0x00011C, "Member 'BP_PreviewModel_C_BuildLight::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_Add_IntInt_ReturnValue_1) == 0x000120, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, K2Node_MakeStruct_LinearColor) == 0x000124, "Member 'BP_PreviewModel_C_BuildLight::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_Array_Length_ReturnValue_1) == 0x000134, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_Array_Get_Item_1) == 0x000138, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_Less_IntInt_ReturnValue_1) == 0x000144, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_TransformLocation_ReturnValue) == 0x000148, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_BreakVector_X) == 0x000154, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_BreakVector_Y) == 0x000158, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, CallFunc_BreakVector_Z) == 0x00015C, "Member 'BP_PreviewModel_C_BuildLight::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_PreviewModel_C_BuildLight, K2Node_MakeStruct_LinearColor_1) == 0x000160, "Member 'BP_PreviewModel_C_BuildLight::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");

// Function BP_PreviewModel.BP_PreviewModel_C.ExecuteUbergraph_BP_PreviewModel
// 0x0004 (0x0004 - 0x0000)
struct BP_PreviewModel_C_ExecuteUbergraph_BP_PreviewModel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PreviewModel_C_ExecuteUbergraph_BP_PreviewModel) == 0x000004, "Wrong alignment on BP_PreviewModel_C_ExecuteUbergraph_BP_PreviewModel");
static_assert(sizeof(BP_PreviewModel_C_ExecuteUbergraph_BP_PreviewModel) == 0x000004, "Wrong size on BP_PreviewModel_C_ExecuteUbergraph_BP_PreviewModel");
static_assert(offsetof(BP_PreviewModel_C_ExecuteUbergraph_BP_PreviewModel, EntryPoint) == 0x000000, "Member 'BP_PreviewModel_C_ExecuteUbergraph_BP_PreviewModel::EntryPoint' has a wrong offset!");

}

