#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkillCollision_Mon_002

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SkillCollision_Mon_002.BP_SkillCollision_Mon_002_C
// 0x0018 (0x0238 - 0x0220)
class ABP_SkillCollision_Mon_002_C final : public AAbilityCollisionEditor
{
public:
	class UAbilityCollision_Capsual*              Skill01Collision;                                  // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SkillCollision_Mon_002_C">();
	}
	static class ABP_SkillCollision_Mon_002_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SkillCollision_Mon_002_C>();
	}
};
static_assert(alignof(ABP_SkillCollision_Mon_002_C) == 0x000008, "Wrong alignment on ABP_SkillCollision_Mon_002_C");
static_assert(sizeof(ABP_SkillCollision_Mon_002_C) == 0x000238, "Wrong size on ABP_SkillCollision_Mon_002_C");
static_assert(offsetof(ABP_SkillCollision_Mon_002_C, Skill01Collision) == 0x000220, "Member 'ABP_SkillCollision_Mon_002_C::Skill01Collision' has a wrong offset!");
static_assert(offsetof(ABP_SkillCollision_Mon_002_C, SkeletalMesh) == 0x000228, "Member 'ABP_SkillCollision_Mon_002_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_SkillCollision_Mon_002_C, Scene) == 0x000230, "Member 'ABP_SkillCollision_Mon_002_C::Scene' has a wrong offset!");

}

