#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkillCollision_Mon_207

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SkillCollision_Mon_207.BP_SkillCollision_Mon_207_C
// 0x0040 (0x0260 - 0x0220)
class ABP_SkillCollision_Mon_207_C final : public AAbilityCollisionEditor
{
public:
	class UAbilityCollision_Capsual*              AbilityCollision_Skill04_Pal;                      // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Capsual*              AbilityCollision_Skill02_Pal;                      // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Capsual*              AbilityCollision_skill04;                          // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Capsual*              AbilityCollision_Skill03;                          // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Capsual*              AbilityCollision_Skill02;                          // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Capsual*              AbilityCollision_Skill01;                          // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SkillCollision_Mon_207_C">();
	}
	static class ABP_SkillCollision_Mon_207_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SkillCollision_Mon_207_C>();
	}
};
static_assert(alignof(ABP_SkillCollision_Mon_207_C) == 0x000008, "Wrong alignment on ABP_SkillCollision_Mon_207_C");
static_assert(sizeof(ABP_SkillCollision_Mon_207_C) == 0x000260, "Wrong size on ABP_SkillCollision_Mon_207_C");
static_assert(offsetof(ABP_SkillCollision_Mon_207_C, AbilityCollision_Skill04_Pal) == 0x000220, "Member 'ABP_SkillCollision_Mon_207_C::AbilityCollision_Skill04_Pal' has a wrong offset!");
static_assert(offsetof(ABP_SkillCollision_Mon_207_C, AbilityCollision_Skill02_Pal) == 0x000228, "Member 'ABP_SkillCollision_Mon_207_C::AbilityCollision_Skill02_Pal' has a wrong offset!");
static_assert(offsetof(ABP_SkillCollision_Mon_207_C, AbilityCollision_skill04) == 0x000230, "Member 'ABP_SkillCollision_Mon_207_C::AbilityCollision_skill04' has a wrong offset!");
static_assert(offsetof(ABP_SkillCollision_Mon_207_C, AbilityCollision_Skill03) == 0x000238, "Member 'ABP_SkillCollision_Mon_207_C::AbilityCollision_Skill03' has a wrong offset!");
static_assert(offsetof(ABP_SkillCollision_Mon_207_C, AbilityCollision_Skill02) == 0x000240, "Member 'ABP_SkillCollision_Mon_207_C::AbilityCollision_Skill02' has a wrong offset!");
static_assert(offsetof(ABP_SkillCollision_Mon_207_C, AbilityCollision_Skill01) == 0x000248, "Member 'ABP_SkillCollision_Mon_207_C::AbilityCollision_Skill01' has a wrong offset!");
static_assert(offsetof(ABP_SkillCollision_Mon_207_C, SkeletalMesh) == 0x000250, "Member 'ABP_SkillCollision_Mon_207_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_SkillCollision_Mon_207_C, Scene) == 0x000258, "Member 'ABP_SkillCollision_Mon_207_C::Scene' has a wrong offset!");

}

