#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TaskActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "UMG_structs.hpp"
#include "GameTask_structs.hpp"
#include "GameTask_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TaskActor.BP_TaskActor_C
// 0x0130 (0x0840 - 0x0710)
class ABP_TaskActor_C final : public AGameTaskActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0710(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    BillBoard;                                         // 0x0718(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         TowerLevelAreaID;                                  // 0x0720(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TaskFinishRogue_CheckNum;                          // 0x0724(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayFinishAnim;                                   // 0x0728(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_729[0x3];                                      // 0x0729(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayerPerformDelay;                                // 0x072C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             VictorySequenceFinish;                             // 0x0730(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<class UUserWidget*, ESlateVisibility>    UIWidgets;                                         // 0x0740(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	TMap<int32, ESlateVisibility>                 FightUIState;                                      // 0x0790(0x0050)(Edit, BlueprintVisible)
	bool                                          PlaySuccess;                                       // 0x07E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          PlayFailed;                                        // 0x07E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bShouldMonsterDieWhenFinish;                       // 0x07E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E3[0x5];                                      // 0x07E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelSequenceActor*                    SequenceActor;                                     // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLose;                                             // 0x07F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F1[0x7];                                      // 0x07F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                EffectWidget;                                      // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                EffectWidget2;                                     // 0x0800(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayWinVoice;                                      // 0x0808(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_809[0x7];                                      // 0x0809(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                TeleportEffectWidget;                              // 0x0810(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UnloadFreeTypeDatatOnFlush;                        // 0x0818(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81C[0x4];                                      // 0x081C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            SceneSwitchWidget;                                 // 0x0820(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDontAllocateDrop;                                 // 0x0828(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHideFight;                                        // 0x0829(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDestroyTrapWhenEnd;                               // 0x082A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIgnoreDestroyAIByTag;                             // 0x082B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class FName                                   IgnoreDestroyAITag;                                // 0x082C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayLoseVoice;                                    // 0x0834(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHideOnlineMoney;                                  // 0x0835(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_836[0x2];                                      // 0x0836(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         B_Show_Subtitles_Type;                             // 0x0838(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GetCharacterTemplateId(class AGamePlayer* Player, int32* TemplateId);
	void MultiDoSpawn(int32 InMonsterId, class FName InTag, class FName PointName);
	void OnMultiKill(class AActor* Killer, class AActor* Deceased);
	void UnBindGameTaskUIEvent();
	void RequestTaskDataValueSync();
	void TryStartTask(bool bOpenUI);
	bool IsMultiLevel();
	void GetVictorySequence(class ULevelSequence** AsLevel_Sequence, class FString* Return_Value_D___p);
	int32 GetLevelConfigTime(const class UGameTask* Cur);
	void NotifyStartMultiSubTask(const struct FMultiSubTask& InSubTask);
	void OnPlayerMove();
	void OnMultiKillInfoUpdate();
	bool ShouldCalcOnlineBehaviorPoint();
	void DoSceneOnOff();
	void NotifyMoveCameraComplete();
	void OnLevelPreFinish(bool bSuccess);
	void FightTip(const class FString& InKey, int32 InType, bool IsNodeId, const struct FRepExecuteDes& ExecuteData);
	void PlayTeleportAnim(class AActor* TeleportActor);
	void OpenActCondition(int32 ConditionID, const class FString& LogicName);
	void ReceiveBeginPlay();
	void CloseActCondition(int32 ConditionID, const class FString& LogicName);
	void FixSkill(class AGameSkill* InSkill);
	void OnDebugInit();
	void OnLevelSequcenceFinish();
	void LeaveAllAI();
	void ForceInterruptSkill(class AGameSkill* GameSkill, ESkillInterruptedType InterruptedType);
	bool ShouldCalcOnlineDesignation();
	void CheckActCondition(int32 ConditionID, const class FString& LogicName, bool* Ret);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void SetGameTask();
	void GetCharacterTemplateId__Overridden(class AGamePlayer* Player, int32* TemplateId);
	void CloseActCondition__Overridden(int32 ConditionID, const class FString& LogicName);
	void CheckActCondition__Overridden(int32 ConditionID, const class FString& LogicName, bool* Ret);
	void OpenActCondition__Overridden(int32 ConditionID, const class FString& LogicName);
	void FixSkill__Overridden(class AGameSkill* InSkill);
	void CheckSetBarrierDuty();
	void RemoveSceneSwitchWidget();
	void PlayTeleportAnim__Overridden(class AActor* TeleportActor);
	void OnLevelSequcenceFinish__Overridden();
	void PlayLevelSequence(class ULevelSequence* Sequence);
	void DestroySequenceActor();
	void InitLevelPainter();
	void GetVictorySequence__Overridden(class ULevelSequence** AsLevel_Sequence, class FString* Return_Value_D___p);
	int32 GetBossChallengeCountDownTime();
	void LockInput(ELevelFailedReason FailReason);
	void DestroyAI(bool bLeave, class FName IgnoreAITag, bool bIgnoreAIByTag);
	void EndBattleFinish();
	void SequenceFinishCallBack();
	class UAnimMontage* GetVictoryMontage();
	void SummonPerfom();
	void PlayerPerform();
	void LevelFinishPerform();
	bool CheckPreCondition(int32 ConditionID, const class FString& ActivityName);
	void UnLockDoors();
	void LockDoors();
	bool IsPlotLevel();
	class FString GetTaskDesByID(int32 ID);
	void SpawnTaskSubActor();
	void OnStartTask();
	void OpenPreCondition(int32 ConditionID, const class FString& ActivityName);
	void ClosePreCondition(int32 ConditionID, const class FString& ActivityName);
	void OnLevelFailed(ELevelFailedReason FailedReason);
	void OnLevelSuccess();
	void Broadcast_NotifyClientLockInput(ELevelFailedReason FailReason);
	void PlayCharacterVoice(const class FString& VoiceID, bool bPlayWithoutWorld, int32 TemplateId);
	void TaskActor_PostEvent(const class FString& InEventName, bool bIs2DEvent, class AActor* InActor, const struct FVector& InLocation, const struct FRotator& InRotator);
	void DestroyTaskSpawnActor(class AActor* InActor);
	void PlayVoice(ELevelFinishResult FinishResult, float UseTime, ELevelFailedReason FailedReason);
	void BindPlayVoice();
	void OnStartPlayVoice();
	void DarkZoneDestroyTaskSpawnActor(class AActor* InActor);
	void SetCustomCameraAnim(bool InValue);
	void ReceiveBeginPlay__Overridden();
	void ReceiveEndPlay__Overridden(EEndPlayReason EndPlayReason);
	void TaskFinishExecute(const bool bDestroyAI, const bool bPlayFinishAnim_0, const float PlayerPerformDelay_0, const class FName IgnoreDestroyAITag_0);
	void OnLevelPreFinish__Overridden(bool bSuccess);
	void ForceInterruptSkill__Overridden(class AGameSkill* GameSkill, ESkillInterruptedType InterruptedType);
	void ExecuteUbergraph_BP_TaskActor(int32 EntryPoint);
	void VictorySequenceFinish__DelegateSignature();

	bool IsMultiDynamicLevel() const;
	bool IsMultiConstLevel() const;
	bool IsWaveControlLevel() const;
	bool IsMultiSpecificLevel() const;
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TaskActor_C">();
	}
	static class ABP_TaskActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TaskActor_C>();
	}
};
static_assert(alignof(ABP_TaskActor_C) == 0x000008, "Wrong alignment on ABP_TaskActor_C");
static_assert(sizeof(ABP_TaskActor_C) == 0x000840, "Wrong size on ABP_TaskActor_C");
static_assert(offsetof(ABP_TaskActor_C, UberGraphFrame) == 0x000710, "Member 'ABP_TaskActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, BillBoard) == 0x000718, "Member 'ABP_TaskActor_C::BillBoard' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, TowerLevelAreaID) == 0x000720, "Member 'ABP_TaskActor_C::TowerLevelAreaID' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, TaskFinishRogue_CheckNum) == 0x000724, "Member 'ABP_TaskActor_C::TaskFinishRogue_CheckNum' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, bPlayFinishAnim) == 0x000728, "Member 'ABP_TaskActor_C::bPlayFinishAnim' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, PlayerPerformDelay) == 0x00072C, "Member 'ABP_TaskActor_C::PlayerPerformDelay' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, VictorySequenceFinish) == 0x000730, "Member 'ABP_TaskActor_C::VictorySequenceFinish' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, UIWidgets) == 0x000740, "Member 'ABP_TaskActor_C::UIWidgets' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, FightUIState) == 0x000790, "Member 'ABP_TaskActor_C::FightUIState' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, PlaySuccess) == 0x0007E0, "Member 'ABP_TaskActor_C::PlaySuccess' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, PlayFailed) == 0x0007E1, "Member 'ABP_TaskActor_C::PlayFailed' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, bShouldMonsterDieWhenFinish) == 0x0007E2, "Member 'ABP_TaskActor_C::bShouldMonsterDieWhenFinish' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, SequenceActor) == 0x0007E8, "Member 'ABP_TaskActor_C::SequenceActor' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, bLose) == 0x0007F0, "Member 'ABP_TaskActor_C::bLose' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, EffectWidget) == 0x0007F8, "Member 'ABP_TaskActor_C::EffectWidget' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, EffectWidget2) == 0x000800, "Member 'ABP_TaskActor_C::EffectWidget2' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, PlayWinVoice) == 0x000808, "Member 'ABP_TaskActor_C::PlayWinVoice' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, TeleportEffectWidget) == 0x000810, "Member 'ABP_TaskActor_C::TeleportEffectWidget' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, UnloadFreeTypeDatatOnFlush) == 0x000818, "Member 'ABP_TaskActor_C::UnloadFreeTypeDatatOnFlush' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, SceneSwitchWidget) == 0x000820, "Member 'ABP_TaskActor_C::SceneSwitchWidget' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, bDontAllocateDrop) == 0x000828, "Member 'ABP_TaskActor_C::bDontAllocateDrop' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, bHideFight) == 0x000829, "Member 'ABP_TaskActor_C::bHideFight' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, bDestroyTrapWhenEnd) == 0x00082A, "Member 'ABP_TaskActor_C::bDestroyTrapWhenEnd' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, bIgnoreDestroyAIByTag) == 0x00082B, "Member 'ABP_TaskActor_C::bIgnoreDestroyAIByTag' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, IgnoreDestroyAITag) == 0x00082C, "Member 'ABP_TaskActor_C::IgnoreDestroyAITag' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, bPlayLoseVoice) == 0x000834, "Member 'ABP_TaskActor_C::bPlayLoseVoice' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, bHideOnlineMoney) == 0x000835, "Member 'ABP_TaskActor_C::bHideOnlineMoney' has a wrong offset!");
static_assert(offsetof(ABP_TaskActor_C, B_Show_Subtitles_Type) == 0x000838, "Member 'ABP_TaskActor_C::B_Show_Subtitles_Type' has a wrong offset!");

}

