#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TaskActor

#include "Basic.hpp"

#include "GameTask_structs.hpp"
#include "Game_structs.hpp"
#include "MovieScene_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// LuaFunction BP_TaskActor.BP_TaskActor_C.GetCharacterTemplateId
// 0x0010 (0x0010 - 0x0000)
struct BP_TaskActor_C_GetCharacterTemplateId final
{
public:
	class AGamePlayer*                            Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TemplateId;                                        // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TaskActor_C_GetCharacterTemplateId) == 0x000008, "Wrong alignment on BP_TaskActor_C_GetCharacterTemplateId");
static_assert(sizeof(BP_TaskActor_C_GetCharacterTemplateId) == 0x000010, "Wrong size on BP_TaskActor_C_GetCharacterTemplateId");
static_assert(offsetof(BP_TaskActor_C_GetCharacterTemplateId, Player) == 0x000000, "Member 'BP_TaskActor_C_GetCharacterTemplateId::Player' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_GetCharacterTemplateId, TemplateId) == 0x000008, "Member 'BP_TaskActor_C_GetCharacterTemplateId::TemplateId' has a wrong offset!");

// LuaFunction BP_TaskActor.BP_TaskActor_C.MultiDoSpawn
// 0x0014 (0x0014 - 0x0000)
struct BP_TaskActor_C_MultiDoSpawn final
{
public:
	int32                                         InMonsterId;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InTag;                                             // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PointName;                                         // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TaskActor_C_MultiDoSpawn) == 0x000004, "Wrong alignment on BP_TaskActor_C_MultiDoSpawn");
static_assert(sizeof(BP_TaskActor_C_MultiDoSpawn) == 0x000014, "Wrong size on BP_TaskActor_C_MultiDoSpawn");
static_assert(offsetof(BP_TaskActor_C_MultiDoSpawn, InMonsterId) == 0x000000, "Member 'BP_TaskActor_C_MultiDoSpawn::InMonsterId' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_MultiDoSpawn, InTag) == 0x000004, "Member 'BP_TaskActor_C_MultiDoSpawn::InTag' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_MultiDoSpawn, PointName) == 0x00000C, "Member 'BP_TaskActor_C_MultiDoSpawn::PointName' has a wrong offset!");

// LuaFunction BP_TaskActor.BP_TaskActor_C.OnMultiKill
// 0x0010 (0x0010 - 0x0000)
struct BP_TaskActor_C_OnMultiKill final
{
public:
	class AActor*                                 Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Deceased;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TaskActor_C_OnMultiKill) == 0x000008, "Wrong alignment on BP_TaskActor_C_OnMultiKill");
static_assert(sizeof(BP_TaskActor_C_OnMultiKill) == 0x000010, "Wrong size on BP_TaskActor_C_OnMultiKill");
static_assert(offsetof(BP_TaskActor_C_OnMultiKill, Killer) == 0x000000, "Member 'BP_TaskActor_C_OnMultiKill::Killer' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_OnMultiKill, Deceased) == 0x000008, "Member 'BP_TaskActor_C_OnMultiKill::Deceased' has a wrong offset!");

// LuaFunction BP_TaskActor.BP_TaskActor_C.TryStartTask
// 0x0001 (0x0001 - 0x0000)
struct BP_TaskActor_C_TryStartTask final
{
public:
	bool                                          bOpenUI;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TaskActor_C_TryStartTask) == 0x000001, "Wrong alignment on BP_TaskActor_C_TryStartTask");
static_assert(sizeof(BP_TaskActor_C_TryStartTask) == 0x000001, "Wrong size on BP_TaskActor_C_TryStartTask");
static_assert(offsetof(BP_TaskActor_C_TryStartTask, bOpenUI) == 0x000000, "Member 'BP_TaskActor_C_TryStartTask::bOpenUI' has a wrong offset!");

// LuaFunction BP_TaskActor.BP_TaskActor_C.IsMultiLevel
// 0x0001 (0x0001 - 0x0000)
struct BP_TaskActor_C_IsMultiLevel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TaskActor_C_IsMultiLevel) == 0x000001, "Wrong alignment on BP_TaskActor_C_IsMultiLevel");
static_assert(sizeof(BP_TaskActor_C_IsMultiLevel) == 0x000001, "Wrong size on BP_TaskActor_C_IsMultiLevel");
static_assert(offsetof(BP_TaskActor_C_IsMultiLevel, ReturnValue) == 0x000000, "Member 'BP_TaskActor_C_IsMultiLevel::ReturnValue' has a wrong offset!");

// LuaFunction BP_TaskActor.BP_TaskActor_C.GetVictorySequence
// 0x0020 (0x0020 - 0x0000)
struct BP_TaskActor_C_GetVictorySequence final
{
public:
	class ULevelSequence*                         AsLevel_Sequence;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Return_Value_D___p;                                // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class ULevelSequence*                         Sequence;                                          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TaskActor_C_GetVictorySequence) == 0x000008, "Wrong alignment on BP_TaskActor_C_GetVictorySequence");
static_assert(sizeof(BP_TaskActor_C_GetVictorySequence) == 0x000020, "Wrong size on BP_TaskActor_C_GetVictorySequence");
static_assert(offsetof(BP_TaskActor_C_GetVictorySequence, AsLevel_Sequence) == 0x000000, "Member 'BP_TaskActor_C_GetVictorySequence::AsLevel_Sequence' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_GetVictorySequence, Return_Value_D___p) == 0x000008, "Member 'BP_TaskActor_C_GetVictorySequence::Return_Value_D___p' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_GetVictorySequence, Sequence) == 0x000018, "Member 'BP_TaskActor_C_GetVictorySequence::Sequence' has a wrong offset!");

// LuaFunction BP_TaskActor.BP_TaskActor_C.GetLevelConfigTime
// 0x0010 (0x0010 - 0x0000)
struct BP_TaskActor_C_GetLevelConfigTime final
{
public:
	const class UGameTask*                        Cur;                                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TaskActor_C_GetLevelConfigTime) == 0x000008, "Wrong alignment on BP_TaskActor_C_GetLevelConfigTime");
static_assert(sizeof(BP_TaskActor_C_GetLevelConfigTime) == 0x000010, "Wrong size on BP_TaskActor_C_GetLevelConfigTime");
static_assert(offsetof(BP_TaskActor_C_GetLevelConfigTime, Cur) == 0x000000, "Member 'BP_TaskActor_C_GetLevelConfigTime::Cur' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_GetLevelConfigTime, ReturnValue) == 0x000008, "Member 'BP_TaskActor_C_GetLevelConfigTime::ReturnValue' has a wrong offset!");

// LuaFunction BP_TaskActor.BP_TaskActor_C.NotifyStartMultiSubTask
// 0x0040 (0x0040 - 0x0000)
struct BP_TaskActor_C_NotifyStartMultiSubTask final
{
public:
	struct FMultiSubTask                          InSubTask;                                         // 0x0000(0x0040)(ConstParm, Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TaskActor_C_NotifyStartMultiSubTask) == 0x000008, "Wrong alignment on BP_TaskActor_C_NotifyStartMultiSubTask");
static_assert(sizeof(BP_TaskActor_C_NotifyStartMultiSubTask) == 0x000040, "Wrong size on BP_TaskActor_C_NotifyStartMultiSubTask");
static_assert(offsetof(BP_TaskActor_C_NotifyStartMultiSubTask, InSubTask) == 0x000000, "Member 'BP_TaskActor_C_NotifyStartMultiSubTask::InSubTask' has a wrong offset!");

// LuaFunction BP_TaskActor.BP_TaskActor_C.ShouldCalcOnlineBehaviorPoint
// 0x0001 (0x0001 - 0x0000)
struct BP_TaskActor_C_ShouldCalcOnlineBehaviorPoint final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TaskActor_C_ShouldCalcOnlineBehaviorPoint) == 0x000001, "Wrong alignment on BP_TaskActor_C_ShouldCalcOnlineBehaviorPoint");
static_assert(sizeof(BP_TaskActor_C_ShouldCalcOnlineBehaviorPoint) == 0x000001, "Wrong size on BP_TaskActor_C_ShouldCalcOnlineBehaviorPoint");
static_assert(offsetof(BP_TaskActor_C_ShouldCalcOnlineBehaviorPoint, ReturnValue) == 0x000000, "Member 'BP_TaskActor_C_ShouldCalcOnlineBehaviorPoint::ReturnValue' has a wrong offset!");

// LuaFunction BP_TaskActor.BP_TaskActor_C.OnLevelPreFinish
// 0x0001 (0x0001 - 0x0000)
struct BP_TaskActor_C_OnLevelPreFinish final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TaskActor_C_OnLevelPreFinish) == 0x000001, "Wrong alignment on BP_TaskActor_C_OnLevelPreFinish");
static_assert(sizeof(BP_TaskActor_C_OnLevelPreFinish) == 0x000001, "Wrong size on BP_TaskActor_C_OnLevelPreFinish");
static_assert(offsetof(BP_TaskActor_C_OnLevelPreFinish, bSuccess) == 0x000000, "Member 'BP_TaskActor_C_OnLevelPreFinish::bSuccess' has a wrong offset!");

// LuaFunction BP_TaskActor.BP_TaskActor_C.FightTip
// 0x0030 (0x0030 - 0x0000)
struct BP_TaskActor_C_FightTip final
{
public:
	class FString                                 InKey;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InType;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsNodeId;                                          // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRepExecuteDes                         ExecuteData;                                       // 0x0018(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TaskActor_C_FightTip) == 0x000008, "Wrong alignment on BP_TaskActor_C_FightTip");
static_assert(sizeof(BP_TaskActor_C_FightTip) == 0x000030, "Wrong size on BP_TaskActor_C_FightTip");
static_assert(offsetof(BP_TaskActor_C_FightTip, InKey) == 0x000000, "Member 'BP_TaskActor_C_FightTip::InKey' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_FightTip, InType) == 0x000010, "Member 'BP_TaskActor_C_FightTip::InType' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_FightTip, IsNodeId) == 0x000014, "Member 'BP_TaskActor_C_FightTip::IsNodeId' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_FightTip, ExecuteData) == 0x000018, "Member 'BP_TaskActor_C_FightTip::ExecuteData' has a wrong offset!");

// LuaFunction BP_TaskActor.BP_TaskActor_C.PlayTeleportAnim
// 0x0008 (0x0008 - 0x0000)
struct BP_TaskActor_C_PlayTeleportAnim final
{
public:
	class AActor*                                 TeleportActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TaskActor_C_PlayTeleportAnim) == 0x000008, "Wrong alignment on BP_TaskActor_C_PlayTeleportAnim");
static_assert(sizeof(BP_TaskActor_C_PlayTeleportAnim) == 0x000008, "Wrong size on BP_TaskActor_C_PlayTeleportAnim");
static_assert(offsetof(BP_TaskActor_C_PlayTeleportAnim, TeleportActor) == 0x000000, "Member 'BP_TaskActor_C_PlayTeleportAnim::TeleportActor' has a wrong offset!");

// LuaFunction BP_TaskActor.BP_TaskActor_C.OpenActCondition
// 0x0018 (0x0018 - 0x0000)
struct BP_TaskActor_C_OpenActCondition final
{
public:
	int32                                         ConditionID;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LogicName;                                         // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TaskActor_C_OpenActCondition) == 0x000008, "Wrong alignment on BP_TaskActor_C_OpenActCondition");
static_assert(sizeof(BP_TaskActor_C_OpenActCondition) == 0x000018, "Wrong size on BP_TaskActor_C_OpenActCondition");
static_assert(offsetof(BP_TaskActor_C_OpenActCondition, ConditionID) == 0x000000, "Member 'BP_TaskActor_C_OpenActCondition::ConditionID' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_OpenActCondition, LogicName) == 0x000008, "Member 'BP_TaskActor_C_OpenActCondition::LogicName' has a wrong offset!");

// LuaFunction BP_TaskActor.BP_TaskActor_C.CloseActCondition
// 0x0018 (0x0018 - 0x0000)
struct BP_TaskActor_C_CloseActCondition final
{
public:
	int32                                         ConditionID;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LogicName;                                         // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TaskActor_C_CloseActCondition) == 0x000008, "Wrong alignment on BP_TaskActor_C_CloseActCondition");
static_assert(sizeof(BP_TaskActor_C_CloseActCondition) == 0x000018, "Wrong size on BP_TaskActor_C_CloseActCondition");
static_assert(offsetof(BP_TaskActor_C_CloseActCondition, ConditionID) == 0x000000, "Member 'BP_TaskActor_C_CloseActCondition::ConditionID' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_CloseActCondition, LogicName) == 0x000008, "Member 'BP_TaskActor_C_CloseActCondition::LogicName' has a wrong offset!");

// LuaFunction BP_TaskActor.BP_TaskActor_C.FixSkill
// 0x0008 (0x0008 - 0x0000)
struct BP_TaskActor_C_FixSkill final
{
public:
	class AGameSkill*                             InSkill;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TaskActor_C_FixSkill) == 0x000008, "Wrong alignment on BP_TaskActor_C_FixSkill");
static_assert(sizeof(BP_TaskActor_C_FixSkill) == 0x000008, "Wrong size on BP_TaskActor_C_FixSkill");
static_assert(offsetof(BP_TaskActor_C_FixSkill, InSkill) == 0x000000, "Member 'BP_TaskActor_C_FixSkill::InSkill' has a wrong offset!");

// LuaFunction BP_TaskActor.BP_TaskActor_C.ForceInterruptSkill
// 0x0010 (0x0010 - 0x0000)
struct BP_TaskActor_C_ForceInterruptSkill final
{
public:
	class AGameSkill*                             GameSkill;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillInterruptedType                         InterruptedType;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TaskActor_C_ForceInterruptSkill) == 0x000008, "Wrong alignment on BP_TaskActor_C_ForceInterruptSkill");
static_assert(sizeof(BP_TaskActor_C_ForceInterruptSkill) == 0x000010, "Wrong size on BP_TaskActor_C_ForceInterruptSkill");
static_assert(offsetof(BP_TaskActor_C_ForceInterruptSkill, GameSkill) == 0x000000, "Member 'BP_TaskActor_C_ForceInterruptSkill::GameSkill' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_ForceInterruptSkill, InterruptedType) == 0x000008, "Member 'BP_TaskActor_C_ForceInterruptSkill::InterruptedType' has a wrong offset!");

// LuaFunction BP_TaskActor.BP_TaskActor_C.ShouldCalcOnlineDesignation
// 0x0001 (0x0001 - 0x0000)
struct BP_TaskActor_C_ShouldCalcOnlineDesignation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TaskActor_C_ShouldCalcOnlineDesignation) == 0x000001, "Wrong alignment on BP_TaskActor_C_ShouldCalcOnlineDesignation");
static_assert(sizeof(BP_TaskActor_C_ShouldCalcOnlineDesignation) == 0x000001, "Wrong size on BP_TaskActor_C_ShouldCalcOnlineDesignation");
static_assert(offsetof(BP_TaskActor_C_ShouldCalcOnlineDesignation, ReturnValue) == 0x000000, "Member 'BP_TaskActor_C_ShouldCalcOnlineDesignation::ReturnValue' has a wrong offset!");

// LuaFunction BP_TaskActor.BP_TaskActor_C.CheckActCondition
// 0x0020 (0x0020 - 0x0000)
struct BP_TaskActor_C_CheckActCondition final
{
public:
	int32                                         ConditionID;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LogicName;                                         // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Ret;                                               // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TaskActor_C_CheckActCondition) == 0x000008, "Wrong alignment on BP_TaskActor_C_CheckActCondition");
static_assert(sizeof(BP_TaskActor_C_CheckActCondition) == 0x000020, "Wrong size on BP_TaskActor_C_CheckActCondition");
static_assert(offsetof(BP_TaskActor_C_CheckActCondition, ConditionID) == 0x000000, "Member 'BP_TaskActor_C_CheckActCondition::ConditionID' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_CheckActCondition, LogicName) == 0x000008, "Member 'BP_TaskActor_C_CheckActCondition::LogicName' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_CheckActCondition, Ret) == 0x000018, "Member 'BP_TaskActor_C_CheckActCondition::Ret' has a wrong offset!");

// LuaFunction BP_TaskActor.BP_TaskActor_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_TaskActor_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TaskActor_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_TaskActor_C_ReceiveEndPlay");
static_assert(sizeof(BP_TaskActor_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_TaskActor_C_ReceiveEndPlay");
static_assert(offsetof(BP_TaskActor_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_TaskActor_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_TaskActor.BP_TaskActor_C.GetCharacterTemplateId__Overridden
// 0x0010 (0x0010 - 0x0000)
struct BP_TaskActor_C_GetCharacterTemplateId__Overridden final
{
public:
	class AGamePlayer*                            Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TemplateId;                                        // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TaskActor_C_GetCharacterTemplateId__Overridden) == 0x000008, "Wrong alignment on BP_TaskActor_C_GetCharacterTemplateId__Overridden");
static_assert(sizeof(BP_TaskActor_C_GetCharacterTemplateId__Overridden) == 0x000010, "Wrong size on BP_TaskActor_C_GetCharacterTemplateId__Overridden");
static_assert(offsetof(BP_TaskActor_C_GetCharacterTemplateId__Overridden, Player) == 0x000000, "Member 'BP_TaskActor_C_GetCharacterTemplateId__Overridden::Player' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_GetCharacterTemplateId__Overridden, TemplateId) == 0x000008, "Member 'BP_TaskActor_C_GetCharacterTemplateId__Overridden::TemplateId' has a wrong offset!");

// Function BP_TaskActor.BP_TaskActor_C.CloseActCondition__Overridden
// 0x0018 (0x0018 - 0x0000)
struct BP_TaskActor_C_CloseActCondition__Overridden final
{
public:
	int32                                         ConditionID;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LogicName;                                         // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TaskActor_C_CloseActCondition__Overridden) == 0x000008, "Wrong alignment on BP_TaskActor_C_CloseActCondition__Overridden");
static_assert(sizeof(BP_TaskActor_C_CloseActCondition__Overridden) == 0x000018, "Wrong size on BP_TaskActor_C_CloseActCondition__Overridden");
static_assert(offsetof(BP_TaskActor_C_CloseActCondition__Overridden, ConditionID) == 0x000000, "Member 'BP_TaskActor_C_CloseActCondition__Overridden::ConditionID' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_CloseActCondition__Overridden, LogicName) == 0x000008, "Member 'BP_TaskActor_C_CloseActCondition__Overridden::LogicName' has a wrong offset!");

// Function BP_TaskActor.BP_TaskActor_C.CheckActCondition__Overridden
// 0x0020 (0x0020 - 0x0000)
struct BP_TaskActor_C_CheckActCondition__Overridden final
{
public:
	int32                                         ConditionID;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LogicName;                                         // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Ret;                                               // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TaskActor_C_CheckActCondition__Overridden) == 0x000008, "Wrong alignment on BP_TaskActor_C_CheckActCondition__Overridden");
static_assert(sizeof(BP_TaskActor_C_CheckActCondition__Overridden) == 0x000020, "Wrong size on BP_TaskActor_C_CheckActCondition__Overridden");
static_assert(offsetof(BP_TaskActor_C_CheckActCondition__Overridden, ConditionID) == 0x000000, "Member 'BP_TaskActor_C_CheckActCondition__Overridden::ConditionID' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_CheckActCondition__Overridden, LogicName) == 0x000008, "Member 'BP_TaskActor_C_CheckActCondition__Overridden::LogicName' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_CheckActCondition__Overridden, Ret) == 0x000018, "Member 'BP_TaskActor_C_CheckActCondition__Overridden::Ret' has a wrong offset!");

// Function BP_TaskActor.BP_TaskActor_C.OpenActCondition__Overridden
// 0x0018 (0x0018 - 0x0000)
struct BP_TaskActor_C_OpenActCondition__Overridden final
{
public:
	int32                                         ConditionID;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LogicName;                                         // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TaskActor_C_OpenActCondition__Overridden) == 0x000008, "Wrong alignment on BP_TaskActor_C_OpenActCondition__Overridden");
static_assert(sizeof(BP_TaskActor_C_OpenActCondition__Overridden) == 0x000018, "Wrong size on BP_TaskActor_C_OpenActCondition__Overridden");
static_assert(offsetof(BP_TaskActor_C_OpenActCondition__Overridden, ConditionID) == 0x000000, "Member 'BP_TaskActor_C_OpenActCondition__Overridden::ConditionID' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_OpenActCondition__Overridden, LogicName) == 0x000008, "Member 'BP_TaskActor_C_OpenActCondition__Overridden::LogicName' has a wrong offset!");

// Function BP_TaskActor.BP_TaskActor_C.FixSkill__Overridden
// 0x0008 (0x0008 - 0x0000)
struct BP_TaskActor_C_FixSkill__Overridden final
{
public:
	class AGameSkill*                             InSkill;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TaskActor_C_FixSkill__Overridden) == 0x000008, "Wrong alignment on BP_TaskActor_C_FixSkill__Overridden");
static_assert(sizeof(BP_TaskActor_C_FixSkill__Overridden) == 0x000008, "Wrong size on BP_TaskActor_C_FixSkill__Overridden");
static_assert(offsetof(BP_TaskActor_C_FixSkill__Overridden, InSkill) == 0x000000, "Member 'BP_TaskActor_C_FixSkill__Overridden::InSkill' has a wrong offset!");

// Function BP_TaskActor.BP_TaskActor_C.CheckSetBarrierDuty
// 0x0038 (0x0038 - 0x0000)
struct BP_TaskActor_C_CheckSetBarrierDuty final
{
public:
	int32                                         ___int_Array_Index_Variable;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AAirBarrier_C*>                  CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAirBarrier_C*                          CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoOnlineTDDutyCheck_bPassCheck;           // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TaskActor_C_CheckSetBarrierDuty) == 0x000008, "Wrong alignment on BP_TaskActor_C_CheckSetBarrierDuty");
static_assert(sizeof(BP_TaskActor_C_CheckSetBarrierDuty) == 0x000038, "Wrong size on BP_TaskActor_C_CheckSetBarrierDuty");
static_assert(offsetof(BP_TaskActor_C_CheckSetBarrierDuty, ___int_Array_Index_Variable) == 0x000000, "Member 'BP_TaskActor_C_CheckSetBarrierDuty::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_CheckSetBarrierDuty, ___int_Loop_Counter_Variable) == 0x000004, "Member 'BP_TaskActor_C_CheckSetBarrierDuty::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_CheckSetBarrierDuty, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_TaskActor_C_CheckSetBarrierDuty::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_CheckSetBarrierDuty, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x000010, "Member 'BP_TaskActor_C_CheckSetBarrierDuty::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_CheckSetBarrierDuty, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_TaskActor_C_CheckSetBarrierDuty::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_CheckSetBarrierDuty, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_TaskActor_C_CheckSetBarrierDuty::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_CheckSetBarrierDuty, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_TaskActor_C_CheckSetBarrierDuty::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_CheckSetBarrierDuty, CallFunc_DoOnlineTDDutyCheck_bPassCheck) == 0x000031, "Member 'BP_TaskActor_C_CheckSetBarrierDuty::CallFunc_DoOnlineTDDutyCheck_bPassCheck' has a wrong offset!");

// Function BP_TaskActor.BP_TaskActor_C.RemoveSceneSwitchWidget
// 0x0002 (0x0002 - 0x0000)
struct BP_TaskActor_C_RemoveSceneSwitchWidget final
{
public:
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TaskActor_C_RemoveSceneSwitchWidget) == 0x000001, "Wrong alignment on BP_TaskActor_C_RemoveSceneSwitchWidget");
static_assert(sizeof(BP_TaskActor_C_RemoveSceneSwitchWidget) == 0x000002, "Wrong size on BP_TaskActor_C_RemoveSceneSwitchWidget");
static_assert(offsetof(BP_TaskActor_C_RemoveSceneSwitchWidget, CallFunc_IsInViewport_ReturnValue) == 0x000000, "Member 'BP_TaskActor_C_RemoveSceneSwitchWidget::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_RemoveSceneSwitchWidget, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_TaskActor_C_RemoveSceneSwitchWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_TaskActor.BP_TaskActor_C.PlayTeleportAnim__Overridden
// 0x0008 (0x0008 - 0x0000)
struct BP_TaskActor_C_PlayTeleportAnim__Overridden final
{
public:
	class AActor*                                 TeleportActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TaskActor_C_PlayTeleportAnim__Overridden) == 0x000008, "Wrong alignment on BP_TaskActor_C_PlayTeleportAnim__Overridden");
static_assert(sizeof(BP_TaskActor_C_PlayTeleportAnim__Overridden) == 0x000008, "Wrong size on BP_TaskActor_C_PlayTeleportAnim__Overridden");
static_assert(offsetof(BP_TaskActor_C_PlayTeleportAnim__Overridden, TeleportActor) == 0x000000, "Member 'BP_TaskActor_C_PlayTeleportAnim__Overridden::TeleportActor' has a wrong offset!");

// Function BP_TaskActor.BP_TaskActor_C.PlayLevelSequence
// 0x0040 (0x0040 - 0x0000)
struct BP_TaskActor_C_PlayLevelSequence final
{
public:
	class ULevelSequence*                         Sequence;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMovieSceneSequencePlaybackSettings    K2Node_MakeStruct_MovieSceneSequencePlaybackSettings; // 0x0008(0x0014)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelSequenceActor*                    CallFunc_CreateLevelSequencePlayer_OutActor;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_CreateLevelSequencePlayer_ReturnValue;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TaskActor_C_PlayLevelSequence) == 0x000008, "Wrong alignment on BP_TaskActor_C_PlayLevelSequence");
static_assert(sizeof(BP_TaskActor_C_PlayLevelSequence) == 0x000040, "Wrong size on BP_TaskActor_C_PlayLevelSequence");
static_assert(offsetof(BP_TaskActor_C_PlayLevelSequence, Sequence) == 0x000000, "Member 'BP_TaskActor_C_PlayLevelSequence::Sequence' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_PlayLevelSequence, K2Node_MakeStruct_MovieSceneSequencePlaybackSettings) == 0x000008, "Member 'BP_TaskActor_C_PlayLevelSequence::K2Node_MakeStruct_MovieSceneSequencePlaybackSettings' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_PlayLevelSequence, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_TaskActor_C_PlayLevelSequence::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_PlayLevelSequence, CallFunc_CreateLevelSequencePlayer_OutActor) == 0x000030, "Member 'BP_TaskActor_C_PlayLevelSequence::CallFunc_CreateLevelSequencePlayer_OutActor' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_PlayLevelSequence, CallFunc_CreateLevelSequencePlayer_ReturnValue) == 0x000038, "Member 'BP_TaskActor_C_PlayLevelSequence::CallFunc_CreateLevelSequencePlayer_ReturnValue' has a wrong offset!");

// Function BP_TaskActor.BP_TaskActor_C.DestroySequenceActor
// 0x0001 (0x0001 - 0x0000)
struct BP_TaskActor_C_DestroySequenceActor final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TaskActor_C_DestroySequenceActor) == 0x000001, "Wrong alignment on BP_TaskActor_C_DestroySequenceActor");
static_assert(sizeof(BP_TaskActor_C_DestroySequenceActor) == 0x000001, "Wrong size on BP_TaskActor_C_DestroySequenceActor");
static_assert(offsetof(BP_TaskActor_C_DestroySequenceActor, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_TaskActor_C_DestroySequenceActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_TaskActor.BP_TaskActor_C.GetVictorySequence__Overridden
// 0x0020 (0x0020 - 0x0000)
struct BP_TaskActor_C_GetVictorySequence__Overridden final
{
public:
	class ULevelSequence*                         AsLevel_Sequence;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Return_Value_D___p;                                // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class ULevelSequence*                         Sequence;                                          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TaskActor_C_GetVictorySequence__Overridden) == 0x000008, "Wrong alignment on BP_TaskActor_C_GetVictorySequence__Overridden");
static_assert(sizeof(BP_TaskActor_C_GetVictorySequence__Overridden) == 0x000020, "Wrong size on BP_TaskActor_C_GetVictorySequence__Overridden");
static_assert(offsetof(BP_TaskActor_C_GetVictorySequence__Overridden, AsLevel_Sequence) == 0x000000, "Member 'BP_TaskActor_C_GetVictorySequence__Overridden::AsLevel_Sequence' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_GetVictorySequence__Overridden, Return_Value_D___p) == 0x000008, "Member 'BP_TaskActor_C_GetVictorySequence__Overridden::Return_Value_D___p' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_GetVictorySequence__Overridden, Sequence) == 0x000018, "Member 'BP_TaskActor_C_GetVictorySequence__Overridden::Sequence' has a wrong offset!");

// Function BP_TaskActor.BP_TaskActor_C.GetBossChallengeCountDownTime
// 0x0008 (0x0008 - 0x0000)
struct BP_TaskActor_C_GetBossChallengeCountDownTime final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CallLuaFunction_Int_RetValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TaskActor_C_GetBossChallengeCountDownTime) == 0x000004, "Wrong alignment on BP_TaskActor_C_GetBossChallengeCountDownTime");
static_assert(sizeof(BP_TaskActor_C_GetBossChallengeCountDownTime) == 0x000008, "Wrong size on BP_TaskActor_C_GetBossChallengeCountDownTime");
static_assert(offsetof(BP_TaskActor_C_GetBossChallengeCountDownTime, ReturnValue) == 0x000000, "Member 'BP_TaskActor_C_GetBossChallengeCountDownTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_GetBossChallengeCountDownTime, CallFunc_CallLuaFunction_Int_RetValue) == 0x000004, "Member 'BP_TaskActor_C_GetBossChallengeCountDownTime::CallFunc_CallLuaFunction_Int_RetValue' has a wrong offset!");

// Function BP_TaskActor.BP_TaskActor_C.LockInput
// 0x0048 (0x0048 - 0x0000)
struct BP_TaskActor_C_LockInput final
{
public:
	ELevelFailedReason                            FailReason;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayerController*                  K2Node_DynamicCast_AsGame_Player_Controller;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStateEventId_ReturnValue;              // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TaskActor_C_LockInput) == 0x000008, "Wrong alignment on BP_TaskActor_C_LockInput");
static_assert(sizeof(BP_TaskActor_C_LockInput) == 0x000048, "Wrong size on BP_TaskActor_C_LockInput");
static_assert(offsetof(BP_TaskActor_C_LockInput, FailReason) == 0x000000, "Member 'BP_TaskActor_C_LockInput::FailReason' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_LockInput, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BP_TaskActor_C_LockInput::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_LockInput, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_TaskActor_C_LockInput::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_LockInput, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_TaskActor_C_LockInput::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_LockInput, K2Node_DynamicCast_AsGame_Player_Controller) == 0x000018, "Member 'BP_TaskActor_C_LockInput::K2Node_DynamicCast_AsGame_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_LockInput, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_TaskActor_C_LockInput::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_LockInput, CallFunc_K2_GetPawn_ReturnValue) == 0x000028, "Member 'BP_TaskActor_C_LockInput::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_LockInput, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000030, "Member 'BP_TaskActor_C_LockInput::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_LockInput, K2Node_DynamicCast_AsGame_Player) == 0x000038, "Member 'BP_TaskActor_C_LockInput::K2Node_DynamicCast_AsGame_Player' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_LockInput, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_TaskActor_C_LockInput::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_LockInput, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'BP_TaskActor_C_LockInput::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_LockInput, CallFunc_IsValid_ReturnValue_2) == 0x000042, "Member 'BP_TaskActor_C_LockInput::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_LockInput, CallFunc_SetStateEventId_ReturnValue) == 0x000043, "Member 'BP_TaskActor_C_LockInput::CallFunc_SetStateEventId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_LockInput, CallFunc_IsValid_ReturnValue_3) == 0x000044, "Member 'BP_TaskActor_C_LockInput::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function BP_TaskActor.BP_TaskActor_C.DestroyAI
// 0x0238 (0x0238 - 0x0000)
struct BP_TaskActor_C_DestroyAI final
{
public:
	bool                                          bLeave;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   IgnoreAITag;                                       // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIgnoreAIByTag;                                    // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bShouldLeave;                                      // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGameSkill*>                     CallFunc_GetAllActorsOfClass_OutActors;            // 0x0030(0x0010)(ReferenceParm)
	class AGameSkill*                             CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGameAICharacter*>               CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0050(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAICharacter*                       CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxAttributeValue_ReturnValue;         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     CallFunc_AppendHealthValue_HealthChange;           // 0x0080(0x01B0)(ContainsInstancedReference)
	bool                                          CallFunc_IsAlive_ReturnValue;                      // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TaskActor_C_DestroyAI) == 0x000008, "Wrong alignment on BP_TaskActor_C_DestroyAI");
static_assert(sizeof(BP_TaskActor_C_DestroyAI) == 0x000238, "Wrong size on BP_TaskActor_C_DestroyAI");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, bLeave) == 0x000000, "Member 'BP_TaskActor_C_DestroyAI::bLeave' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, IgnoreAITag) == 0x000004, "Member 'BP_TaskActor_C_DestroyAI::IgnoreAITag' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, bIgnoreAIByTag) == 0x00000C, "Member 'BP_TaskActor_C_DestroyAI::bIgnoreAIByTag' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, bShouldLeave) == 0x00000D, "Member 'BP_TaskActor_C_DestroyAI::bShouldLeave' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, ___int_Array_Index_Variable) == 0x000010, "Member 'BP_TaskActor_C_DestroyAI::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, CallFunc_Not_PreBool_ReturnValue) == 0x000014, "Member 'BP_TaskActor_C_DestroyAI::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, ___int_Loop_Counter_Variable) == 0x000018, "Member 'BP_TaskActor_C_DestroyAI::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_TaskActor_C_DestroyAI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, ___int_Array_Index_Variable_1) == 0x000020, "Member 'BP_TaskActor_C_DestroyAI::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, ___int_Loop_Counter_Variable_1) == 0x000024, "Member 'BP_TaskActor_C_DestroyAI::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'BP_TaskActor_C_DestroyAI::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, CallFunc_GetAllActorsOfClass_OutActors) == 0x000030, "Member 'BP_TaskActor_C_DestroyAI::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_TaskActor_C_DestroyAI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_TaskActor_C_DestroyAI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, CallFunc_IsValid_ReturnValue) == 0x00004C, "Member 'BP_TaskActor_C_DestroyAI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, CallFunc_Less_IntInt_ReturnValue) == 0x00004D, "Member 'BP_TaskActor_C_DestroyAI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000050, "Member 'BP_TaskActor_C_DestroyAI::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'BP_TaskActor_C_DestroyAI::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'BP_TaskActor_C_DestroyAI::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, CallFunc_Less_IntInt_ReturnValue_1) == 0x000070, "Member 'BP_TaskActor_C_DestroyAI::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, CallFunc_IsValid_ReturnValue_1) == 0x000071, "Member 'BP_TaskActor_C_DestroyAI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, CallFunc_ActorHasTag_ReturnValue) == 0x000072, "Member 'BP_TaskActor_C_DestroyAI::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, CallFunc_Not_PreBool_ReturnValue_1) == 0x000073, "Member 'BP_TaskActor_C_DestroyAI::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, CallFunc_BooleanOR_ReturnValue) == 0x000074, "Member 'BP_TaskActor_C_DestroyAI::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, CallFunc_GetMaxAttributeValue_ReturnValue) == 0x000078, "Member 'BP_TaskActor_C_DestroyAI::CallFunc_GetMaxAttributeValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00007C, "Member 'BP_TaskActor_C_DestroyAI::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, CallFunc_AppendHealthValue_HealthChange) == 0x000080, "Member 'BP_TaskActor_C_DestroyAI::CallFunc_AppendHealthValue_HealthChange' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_DestroyAI, CallFunc_IsAlive_ReturnValue) == 0x000230, "Member 'BP_TaskActor_C_DestroyAI::CallFunc_IsAlive_ReturnValue' has a wrong offset!");

// Function BP_TaskActor.BP_TaskActor_C.SequenceFinishCallBack
// 0x0018 (0x0018 - 0x0000)
struct BP_TaskActor_C_SequenceFinishCallBack final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TaskActor_C_SequenceFinishCallBack) == 0x000008, "Wrong alignment on BP_TaskActor_C_SequenceFinishCallBack");
static_assert(sizeof(BP_TaskActor_C_SequenceFinishCallBack) == 0x000018, "Wrong size on BP_TaskActor_C_SequenceFinishCallBack");
static_assert(offsetof(BP_TaskActor_C_SequenceFinishCallBack, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_TaskActor_C_SequenceFinishCallBack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TaskActor_C_SequenceFinishCallBack, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'BP_TaskActor_C_SequenceFinishCallBack::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function BP_TaskActor.BP_TaskActor_C.GetVictoryMontage
// 0x0058 (0x0058 - 0x0000)
struct BP_TaskActor_C_GetVictoryMontage final
{
public:
	class UAnimMontage*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetGameAnimInstance_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
