#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UMGMaterialLibrary

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_UMGMaterialLibrary.BP_UMGMaterialLibrary_C.UpdateMateiralScaleParameter
// 0x0098 (0x0098 - 0x0000)
struct BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter final
{
public:
	TMap<class FName, float>                      Values;                                            // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UMaterialInstanceDynamic*               DynamicMat;                                        // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0060(0x0010)(ReferenceParm)
	int32                                         ___int_Array_Index_Variable;                       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Map_Find_Value;                           // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter) == 0x000008, "Wrong alignment on BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter");
static_assert(sizeof(BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter) == 0x000098, "Wrong size on BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter");
static_assert(offsetof(BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter, Values) == 0x000000, "Member 'BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter::Values' has a wrong offset!");
static_assert(offsetof(BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter, DynamicMat) == 0x000050, "Member 'BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter::DynamicMat' has a wrong offset!");
static_assert(offsetof(BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter, __WorldContext) == 0x000058, "Member 'BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter, CallFunc_Map_Keys_Keys) == 0x000060, "Member 'BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter, ___int_Array_Index_Variable) == 0x000070, "Member 'BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter, CallFunc_Array_Get_Item) == 0x000078, "Member 'BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter, CallFunc_Map_Find_Value) == 0x000080, "Member 'BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter, CallFunc_Map_Find_ReturnValue) == 0x000084, "Member 'BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter, ___int_Loop_Counter_Variable) == 0x000088, "Member 'BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter, CallFunc_Less_IntInt_ReturnValue) == 0x00008C, "Member 'BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'BP_UMGMaterialLibrary_C_UpdateMateiralScaleParameter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_UMGMaterialLibrary.BP_UMGMaterialLibrary_C.CreateDynamicMaterial
// 0x0040 (0x0040 - 0x0000)
struct BP_UMGMaterialLibrary_C_CreateDynamicMaterial final
{
public:
	class UMaterialInterface*                     Mat;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               AsMaterial_Instance_Dynamic;                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_As______;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UMGMaterialLibrary_C_CreateDynamicMaterial) == 0x000008, "Wrong alignment on BP_UMGMaterialLibrary_C_CreateDynamicMaterial");
static_assert(sizeof(BP_UMGMaterialLibrary_C_CreateDynamicMaterial) == 0x000040, "Wrong size on BP_UMGMaterialLibrary_C_CreateDynamicMaterial");
static_assert(offsetof(BP_UMGMaterialLibrary_C_CreateDynamicMaterial, Mat) == 0x000000, "Member 'BP_UMGMaterialLibrary_C_CreateDynamicMaterial::Mat' has a wrong offset!");
static_assert(offsetof(BP_UMGMaterialLibrary_C_CreateDynamicMaterial, __WorldContext) == 0x000008, "Member 'BP_UMGMaterialLibrary_C_CreateDynamicMaterial::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UMGMaterialLibrary_C_CreateDynamicMaterial, AsMaterial_Instance_Dynamic) == 0x000010, "Member 'BP_UMGMaterialLibrary_C_CreateDynamicMaterial::AsMaterial_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(BP_UMGMaterialLibrary_C_CreateDynamicMaterial, CallFunc_GetObjectClass_ReturnValue) == 0x000018, "Member 'BP_UMGMaterialLibrary_C_CreateDynamicMaterial::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMGMaterialLibrary_C_CreateDynamicMaterial, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'BP_UMGMaterialLibrary_C_CreateDynamicMaterial::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMGMaterialLibrary_C_CreateDynamicMaterial, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000028, "Member 'BP_UMGMaterialLibrary_C_CreateDynamicMaterial::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMGMaterialLibrary_C_CreateDynamicMaterial, K2Node_DynamicCast_As______) == 0x000030, "Member 'BP_UMGMaterialLibrary_C_CreateDynamicMaterial::K2Node_DynamicCast_As______' has a wrong offset!");
static_assert(offsetof(BP_UMGMaterialLibrary_C_CreateDynamicMaterial, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_UMGMaterialLibrary_C_CreateDynamicMaterial::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

