#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_wpbase_wp06

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WeaponBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bp_wpbase_wp06.Bp_wpbase_wp06_C
// 0x0020 (0x19C0 - 0x19A0)
class ABp_wpbase_wp06_C : public AWeaponBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x19A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x19A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Wp001;                                             // 0x19B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void OnFireHit(const struct FHitResult& HitResult, const struct FBulletInfo& BulletInfo_0, const class ABullet* InBullet);
	void ExecuteUbergraph_Bp_wpbase_wp06(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bp_wpbase_wp06_C">();
	}
	static class ABp_wpbase_wp06_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABp_wpbase_wp06_C>();
	}
};
static_assert(alignof(ABp_wpbase_wp06_C) == 0x000010, "Wrong alignment on ABp_wpbase_wp06_C");
static_assert(sizeof(ABp_wpbase_wp06_C) == 0x0019C0, "Wrong size on ABp_wpbase_wp06_C");
static_assert(offsetof(ABp_wpbase_wp06_C, UberGraphFrame) == 0x0019A0, "Member 'ABp_wpbase_wp06_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABp_wpbase_wp06_C, Niagara) == 0x0019A8, "Member 'ABp_wpbase_wp06_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABp_wpbase_wp06_C, Wp001) == 0x0019B0, "Member 'ABp_wpbase_wp06_C::Wp001' has a wrong offset!");

}

