#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_wpbase_preview

#include "Basic.hpp"


namespace SDK::Params
{

// Function Bp_wpbase_preview.Bp_wpbase_preview_C.ExecuteUbergraph_Bp_wpbase_preview
// 0x0004 (0x0004 - 0x0000)
struct Bp_wpbase_preview_C_ExecuteUbergraph_Bp_wpbase_preview final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_wpbase_preview_C_ExecuteUbergraph_Bp_wpbase_preview) == 0x000004, "Wrong alignment on Bp_wpbase_preview_C_ExecuteUbergraph_Bp_wpbase_preview");
static_assert(sizeof(Bp_wpbase_preview_C_ExecuteUbergraph_Bp_wpbase_preview) == 0x000004, "Wrong size on Bp_wpbase_preview_C_ExecuteUbergraph_Bp_wpbase_preview");
static_assert(offsetof(Bp_wpbase_preview_C_ExecuteUbergraph_Bp_wpbase_preview, EntryPoint) == 0x000000, "Member 'Bp_wpbase_preview_C_ExecuteUbergraph_Bp_wpbase_preview::EntryPoint' has a wrong offset!");

// Function Bp_wpbase_preview.Bp_wpbase_preview_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Bp_wpbase_preview_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Bp_wpbase_preview_C_GetModuleName) == 0x000008, "Wrong alignment on Bp_wpbase_preview_C_GetModuleName");
static_assert(sizeof(Bp_wpbase_preview_C_GetModuleName) == 0x000010, "Wrong size on Bp_wpbase_preview_C_GetModuleName");
static_assert(offsetof(Bp_wpbase_preview_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Bp_wpbase_preview_C_GetModuleName::ReturnValue' has a wrong offset!");

}

