#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_wpbase_preview

#include "Basic.hpp"

#include "BP_PreviewModel_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bp_wpbase_preview.Bp_wpbase_preview_C
// 0x0018 (0x0790 - 0x0778)
class ABp_wpbase_preview_C final : public ABP_PreviewModel_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Bp_wpbase_preview_C;                // 0x0778(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_Bp_wpbase_preview(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bp_wpbase_preview_C">();
	}
	static class ABp_wpbase_preview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABp_wpbase_preview_C>();
	}
};
static_assert(alignof(ABp_wpbase_preview_C) == 0x000008, "Wrong alignment on ABp_wpbase_preview_C");
static_assert(sizeof(ABp_wpbase_preview_C) == 0x000790, "Wrong size on ABp_wpbase_preview_C");
static_assert(offsetof(ABp_wpbase_preview_C, UberGraphFrame_Bp_wpbase_preview_C) == 0x000778, "Member 'ABp_wpbase_preview_C::UberGraphFrame_Bp_wpbase_preview_C' has a wrong offset!");
static_assert(offsetof(ABp_wpbase_preview_C, Niagara) == 0x000780, "Member 'ABp_wpbase_preview_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABp_wpbase_preview_C, StaticMesh) == 0x000788, "Member 'ABp_wpbase_preview_C::StaticMesh' has a wrong offset!");

}

