#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_wpbase_magazine

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass bp_wpbase_magazine.bp_wpbase_magazine_C
// 0x0018 (0x04F0 - 0x04D8)
class Abp_wpbase_magazine_C : public AWeaponPart
{
public:
	class UNiagaraComponent*                      Niagara;                                           // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wp_magazine;                                       // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"bp_wpbase_magazine_C">();
	}
	static class Abp_wpbase_magazine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Abp_wpbase_magazine_C>();
	}
};
static_assert(alignof(Abp_wpbase_magazine_C) == 0x000008, "Wrong alignment on Abp_wpbase_magazine_C");
static_assert(sizeof(Abp_wpbase_magazine_C) == 0x0004F0, "Wrong size on Abp_wpbase_magazine_C");
static_assert(offsetof(Abp_wpbase_magazine_C, Niagara) == 0x0004D8, "Member 'Abp_wpbase_magazine_C::Niagara' has a wrong offset!");
static_assert(offsetof(Abp_wpbase_magazine_C, Wp_magazine) == 0x0004E0, "Member 'Abp_wpbase_magazine_C::Wp_magazine' has a wrong offset!");
static_assert(offsetof(Abp_wpbase_magazine_C, DefaultSceneRoot) == 0x0004E8, "Member 'Abp_wpbase_magazine_C::DefaultSceneRoot' has a wrong offset!");

}

