#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_wpbase_wp08_stabilizer

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bp_wpbase_wp08_stabilizer.Bp_wpbase_wp08_stabilizer_C
// 0x0018 (0x04F0 - 0x04D8)
class ABp_wpbase_wp08_stabilizer_C : public AWeaponPart
{
public:
	class UNiagaraComponent*                      Niagara;                                           // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wp_attach;                                         // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bp_wpbase_wp08_stabilizer_C">();
	}
	static class ABp_wpbase_wp08_stabilizer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABp_wpbase_wp08_stabilizer_C>();
	}
};
static_assert(alignof(ABp_wpbase_wp08_stabilizer_C) == 0x000008, "Wrong alignment on ABp_wpbase_wp08_stabilizer_C");
static_assert(sizeof(ABp_wpbase_wp08_stabilizer_C) == 0x0004F0, "Wrong size on ABp_wpbase_wp08_stabilizer_C");
static_assert(offsetof(ABp_wpbase_wp08_stabilizer_C, Niagara) == 0x0004D8, "Member 'ABp_wpbase_wp08_stabilizer_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABp_wpbase_wp08_stabilizer_C, Wp_attach) == 0x0004E0, "Member 'ABp_wpbase_wp08_stabilizer_C::Wp_attach' has a wrong offset!");
static_assert(offsetof(ABp_wpbase_wp08_stabilizer_C, DefaultSceneRoot) == 0x0004E8, "Member 'ABp_wpbase_wp08_stabilizer_C::DefaultSceneRoot' has a wrong offset!");

}

