#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BQTest_IsFirePoint

#include "Basic.hpp"


namespace SDK::Params
{

// Function BQTest_IsFirePoint.BQTest_IsFirePoint_C.CheckFilterCondition
// 0x0018 (0x0018 - 0x0000)
struct BQTest_IsFirePoint_C_CheckFilterCondition final
{
public:
	class UBunkerPointComponent*                  BunkerPoint;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameAICharacter*                       AIChar;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BQTest_IsFirePoint_C_CheckFilterCondition) == 0x000008, "Wrong alignment on BQTest_IsFirePoint_C_CheckFilterCondition");
static_assert(sizeof(BQTest_IsFirePoint_C_CheckFilterCondition) == 0x000018, "Wrong size on BQTest_IsFirePoint_C_CheckFilterCondition");
static_assert(offsetof(BQTest_IsFirePoint_C_CheckFilterCondition, BunkerPoint) == 0x000000, "Member 'BQTest_IsFirePoint_C_CheckFilterCondition::BunkerPoint' has a wrong offset!");
static_assert(offsetof(BQTest_IsFirePoint_C_CheckFilterCondition, AIChar) == 0x000008, "Member 'BQTest_IsFirePoint_C_CheckFilterCondition::AIChar' has a wrong offset!");
static_assert(offsetof(BQTest_IsFirePoint_C_CheckFilterCondition, ReturnValue) == 0x000010, "Member 'BQTest_IsFirePoint_C_CheckFilterCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(BQTest_IsFirePoint_C_CheckFilterCondition, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BQTest_IsFirePoint_C_CheckFilterCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

