#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BQTest_GetIsTargetControllerForwardVectorAngleXYBetween

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BQTest_GetIsTargetControllerForwardVectorAngleXYBetween.BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C.CheckFilterCondition
// 0x0110 (0x0110 - 0x0000)
struct BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition final
{
public:
	class UBunkerPointComponent*                  BunkerPoint;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameAICharacter*                       AIChar;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetTargetActor_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayerController*                  CallFunc_GetCharacterController_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAICharacter*                       K2Node_DynamicCast_AsGame_AICharacter;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_2;                     // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VectorAngleXY3_ReturnValue;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_3;                     // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VectorAngleXY3_ReturnValue_1;             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition) == 0x000008, "Wrong alignment on BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition");
static_assert(sizeof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition) == 0x000110, "Wrong size on BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, BunkerPoint) == 0x000000, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::BunkerPoint' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, AIChar) == 0x000008, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::AIChar' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, ReturnValue) == 0x000010, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_GetTargetActor_ReturnValue) == 0x000018, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_GetTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, K2Node_DynamicCast_AsGame_Player) == 0x000028, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::K2Node_DynamicCast_AsGame_Player' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_GetCharacterController_ReturnValue) == 0x000038, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_GetCharacterController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000040, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_IsValid_ReturnValue_2) == 0x00004C, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_GetCameraRotation_ReturnValue) == 0x000050, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, K2Node_DynamicCast_AsGame_AICharacter) == 0x000060, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::K2Node_DynamicCast_AsGame_AICharacter' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_GetForwardVector_ReturnValue) == 0x00006C, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_Normal_ReturnValue) == 0x000078, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000084, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_GetAIController_ReturnValue) == 0x000090, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000098, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_IsValid_ReturnValue_3) == 0x0000A4, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000A8, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_Normal_ReturnValue_1) == 0x0000B4, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_GetActorForwardVector_ReturnValue) == 0x0000C0, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x0000CC, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_Normal_ReturnValue_2) == 0x0000D8, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_Normal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0000E4, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_VectorAngleXY3_ReturnValue) == 0x0000F0, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_VectorAngleXY3_ReturnValue' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_Normal_ReturnValue_3) == 0x0000F4, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_Normal_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000100, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_VectorAngleXY3_ReturnValue_1) == 0x000104, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_VectorAngleXY3_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000108, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x000109, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_BooleanAND_ReturnValue) == 0x00010A, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x00010B, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition, CallFunc_BooleanAND_ReturnValue_1) == 0x00010C, "Member 'BQTest_GetIsTargetControllerForwardVectorAngleXYBetween_C_CheckFilterCondition::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

}

