#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTDecorator_IsAtLocation2D

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTDecorator_IsAtLocation2D.BTDecorator_IsAtLocation2D_C.PerformConditionCheckAI
// 0x0038 (0x0038 - 0x0000)
struct BTDecorator_IsAtLocation2D_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue;   // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance2D_ReturnValue;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTDecorator_IsAtLocation2D_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BTDecorator_IsAtLocation2D_C_PerformConditionCheckAI");
static_assert(sizeof(BTDecorator_IsAtLocation2D_C_PerformConditionCheckAI) == 0x000038, "Wrong size on BTDecorator_IsAtLocation2D_C_PerformConditionCheckAI");
static_assert(offsetof(BTDecorator_IsAtLocation2D_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BTDecorator_IsAtLocation2D_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsAtLocation2D_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BTDecorator_IsAtLocation2D_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsAtLocation2D_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BTDecorator_IsAtLocation2D_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsAtLocation2D_C_PerformConditionCheckAI, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000014, "Member 'BTDecorator_IsAtLocation2D_C_PerformConditionCheckAI::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsAtLocation2D_C_PerformConditionCheckAI, CallFunc_GetBlackboardValueAsVector_ReturnValue) == 0x000020, "Member 'BTDecorator_IsAtLocation2D_C_PerformConditionCheckAI::CallFunc_GetBlackboardValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsAtLocation2D_C_PerformConditionCheckAI, CallFunc_Vector_Distance2D_ReturnValue) == 0x00002C, "Member 'BTDecorator_IsAtLocation2D_C_PerformConditionCheckAI::CallFunc_Vector_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsAtLocation2D_C_PerformConditionCheckAI, CallFunc_Less_FloatFloat_ReturnValue) == 0x000030, "Member 'BTDecorator_IsAtLocation2D_C_PerformConditionCheckAI::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

}

