#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BuffMaker

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// LuaFunction BuffMaker.BuffMaker_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BuffMaker_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BuffMaker_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BuffMaker_C_ReceiveEndPlay");
static_assert(sizeof(BuffMaker_C_ReceiveEndPlay) == 0x000001, "Wrong size on BuffMaker_C_ReceiveEndPlay");
static_assert(offsetof(BuffMaker_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BuffMaker_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BuffMaker.BuffMaker_C.GetAbility
// 0x0010 (0x0010 - 0x0000)
struct BuffMaker_C_GetAbility final
{
public:
	class UAbilityComponentBase*                  Ability_Comp;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BuffMaker_C_GetAbility) == 0x000008, "Wrong alignment on BuffMaker_C_GetAbility");
static_assert(sizeof(BuffMaker_C_GetAbility) == 0x000010, "Wrong size on BuffMaker_C_GetAbility");
static_assert(offsetof(BuffMaker_C_GetAbility, Ability_Comp) == 0x000000, "Member 'BuffMaker_C_GetAbility::Ability_Comp' has a wrong offset!");
static_assert(offsetof(BuffMaker_C_GetAbility, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BuffMaker_C_GetAbility::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BuffMaker.BuffMaker_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BuffMaker_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BuffMaker_C_ReceiveTick) == 0x000004, "Wrong alignment on BuffMaker_C_ReceiveTick");
static_assert(sizeof(BuffMaker_C_ReceiveTick) == 0x000004, "Wrong size on BuffMaker_C_ReceiveTick");
static_assert(offsetof(BuffMaker_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BuffMaker_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BuffMaker.BuffMaker_C.ExecuteUbergraph_BuffMaker
// 0x0008 (0x0008 - 0x0000)
struct BuffMaker_C_ExecuteUbergraph_BuffMaker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BuffMaker_C_ExecuteUbergraph_BuffMaker) == 0x000004, "Wrong alignment on BuffMaker_C_ExecuteUbergraph_BuffMaker");
static_assert(sizeof(BuffMaker_C_ExecuteUbergraph_BuffMaker) == 0x000008, "Wrong size on BuffMaker_C_ExecuteUbergraph_BuffMaker");
static_assert(offsetof(BuffMaker_C_ExecuteUbergraph_BuffMaker, EntryPoint) == 0x000000, "Member 'BuffMaker_C_ExecuteUbergraph_BuffMaker::EntryPoint' has a wrong offset!");
static_assert(offsetof(BuffMaker_C_ExecuteUbergraph_BuffMaker, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BuffMaker_C_ExecuteUbergraph_BuffMaker::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BuffMaker.BuffMaker_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BuffMaker_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BuffMaker_C_GetModuleName) == 0x000008, "Wrong alignment on BuffMaker_C_GetModuleName");
static_assert(sizeof(BuffMaker_C_GetModuleName) == 0x000010, "Wrong size on BuffMaker_C_GetModuleName");
static_assert(offsetof(BuffMaker_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BuffMaker_C_GetModuleName::ReturnValue' has a wrong offset!");

}

