#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BuffMaker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BuffMaker.BuffMaker_C
// 0x0020 (0x0260 - 0x0240)
class ABuffMaker_C final : public ASkillActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    BillBoard;                                         // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 PlayerSkillFixs;                                   // 0x0250(0x0010)(Edit, BlueprintVisible)

public:
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void GetAbility(class UAbilityComponentBase** Ability_Comp);
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_BuffMaker(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BuffMaker_C">();
	}
	static class ABuffMaker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABuffMaker_C>();
	}
};
static_assert(alignof(ABuffMaker_C) == 0x000008, "Wrong alignment on ABuffMaker_C");
static_assert(sizeof(ABuffMaker_C) == 0x000260, "Wrong size on ABuffMaker_C");
static_assert(offsetof(ABuffMaker_C, UberGraphFrame) == 0x000240, "Member 'ABuffMaker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABuffMaker_C, BillBoard) == 0x000248, "Member 'ABuffMaker_C::BillBoard' has a wrong offset!");
static_assert(offsetof(ABuffMaker_C, PlayerSkillFixs) == 0x000250, "Member 'ABuffMaker_C::PlayerSkillFixs' has a wrong offset!");

}

