#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletScreen_511701

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BulletScreen_511701.BulletScreen_511701_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BulletScreen_511701_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletScreen_511701_C_ReceiveTick) == 0x000004, "Wrong alignment on BulletScreen_511701_C_ReceiveTick");
static_assert(sizeof(BulletScreen_511701_C_ReceiveTick) == 0x000004, "Wrong size on BulletScreen_511701_C_ReceiveTick");
static_assert(offsetof(BulletScreen_511701_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BulletScreen_511701_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BulletScreen_511701.BulletScreen_511701_C.ExecuteUbergraph_BulletScreen_511701
// 0x0160 (0x0160 - 0x0000)
struct BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Has_Been_Initd_Variable_1;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABullet*                                CallFunc_SpawnBullet_ReturnValue;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFive11701_C*                           K2Node_DynamicCast_As511701;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable_1;                       // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         ___int_Variable;                                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAICharacter*                       K2Node_DynamicCast_AsGame_AICharacter;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DB[0x5];                                       // 0x00DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetTargetActor_ReturnValue;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable_1;                                 // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqualExactly_VectorVector_ReturnValue; // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701) == 0x000010, "Wrong alignment on BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701");
static_assert(sizeof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701) == 0x000160, "Wrong size on BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, EntryPoint) == 0x000000, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::EntryPoint' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_HasAuthority_ReturnValue_1) == 0x000005, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, ___bool_IsClosed_Variable) == 0x000006, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, ___bool_Has_Been_Initd_Variable) == 0x00000C, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, ___bool_Has_Been_Initd_Variable_1) == 0x00000D, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::___bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000E, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000040, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_SpawnBullet_ReturnValue) == 0x000050, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_SpawnBullet_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_BreakVector_X) == 0x000058, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_BreakVector_Y) == 0x00005C, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_BreakVector_Z) == 0x000060, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, K2Node_DynamicCast_As511701) == 0x000068, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::K2Node_DynamicCast_As511701' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_MakeVector_ReturnValue) == 0x000074, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000080, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, ___bool_IsClosed_Variable_1) == 0x00008C, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::___bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_BreakRotator_Roll) == 0x000090, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_BreakRotator_Pitch) == 0x000094, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_BreakRotator_Yaw) == 0x000098, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00009C, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_MakeRotator_ReturnValue) == 0x0000A0, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, ___int_Variable) == 0x0000AC, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::___int_Variable' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_Add_IntInt_ReturnValue) == 0x0000B0, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_Less_IntInt_ReturnValue) == 0x0000B4, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000B8, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_IsValid_ReturnValue) == 0x0000BC, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_GetOwner_ReturnValue) == 0x0000C0, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_IsValid_ReturnValue_1) == 0x0000C8, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, K2Node_DynamicCast_AsGame_AICharacter) == 0x0000D0, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::K2Node_DynamicCast_AsGame_AICharacter' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_IsValid_ReturnValue_2) == 0x0000D9, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_IsValid_ReturnValue_3) == 0x0000DA, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_GetTargetActor_ReturnValue) == 0x0000E0, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_GetTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_BreakVector_X_1) == 0x0000E8, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_BreakVector_Y_1) == 0x0000EC, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_BreakVector_Z_1) == 0x0000F0, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_IsValid_ReturnValue_4) == 0x0000F4, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_GetOwner_ReturnValue_1) == 0x0000F8, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_GetVelocity_ReturnValue) == 0x000100, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_Multiply_IntFloat_ReturnValue) == 0x00010C, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000110, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000114, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000118, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x00011C, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, ___int_Variable_1) == 0x000128, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::___int_Variable_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_BreakVector_X_2) == 0x00012C, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_BreakVector_Y_2) == 0x000130, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_BreakVector_Z_2) == 0x000134, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_Add_FloatFloat_ReturnValue) == 0x000138, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00013C, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_MakeVector_ReturnValue_1) == 0x000140, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_NotEqualExactly_VectorVector_ReturnValue) == 0x00014C, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_NotEqualExactly_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_Multiply_IntInt_ReturnValue) == 0x000150, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701, CallFunc_Add_IntInt_ReturnValue_2) == 0x000154, "Member 'BulletScreen_511701_C_ExecuteUbergraph_BulletScreen_511701::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

}

