#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bullet_Girl002a01_Skill01_L4

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Bullet_Girl002a01_Skill01_all_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bullet_Girl002a01_Skill01_L4.Bullet_Girl002a01_Skill01_L4_C
// 0x0020 (0x0A70 - 0x0A50)
class ABullet_Girl002a01_Skill01_L4_C final : public ABullet_Girl002a01_Skill01_all_C
{
public:
	uint8                                         Pad_A45[0x3];                                      // 0x0A45(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_Bullet_Girl002a01_Skill01_L4_C;     // 0x0A48(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          HasFire_0;                                         // 0x0A50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A51[0x7];                                      // 0x0A51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Targets_0;                                         // 0x0A58(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         RandomMin;                                         // 0x0A68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomMax;                                         // 0x0A6C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBulletFire();
	void ExecuteUbergraph_Bullet_Girl002a01_Skill01_L4(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Bullet_Girl002a01_Skill01_L4_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Bullet_Girl002a01_Skill01_L4_C")
	}
	static class ABullet_Girl002a01_Skill01_L4_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABullet_Girl002a01_Skill01_L4_C>();
	}
};
DUMPER7_ASSERTS_ABullet_Girl002a01_Skill01_L4_C;

}

