#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bullet_Girl002a01_Skill01_all

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bullet_Girl002a01_Skill01_all.Bullet_Girl002a01_Skill01_all_C
// 0x0050 (0x0A60 - 0x0A10)
#pragma pack(push, 0x1)
class alignas(0x10) ABullet_Girl002a01_Skill01_all_C : public ABullet
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          HasFire;                                           // 0x0A18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A19[0x7];                                      // 0x0A19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Targets;                                           // 0x0A20(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<EBulletCollision>                      bLock_1;                                           // 0x0A30(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<EBulletCollision>                      bLock_2;                                           // 0x0A40(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Change_Fly_Distance;                               // 0x0A50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasTarget;                                         // 0x0A54(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void Girl002a_bullet_lastmove();
	void ReceiveBulletFire();
	void ReceiveRecycle();
	void ExecuteUbergraph_Bullet_Girl002a01_Skill01_all(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bullet_Girl002a01_Skill01_all_C">();
	}
	static class ABullet_Girl002a01_Skill01_all_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABullet_Girl002a01_Skill01_all_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(ABullet_Girl002a01_Skill01_all_C) == 0x000010, "Wrong alignment on ABullet_Girl002a01_Skill01_all_C");
static_assert(sizeof(ABullet_Girl002a01_Skill01_all_C) == 0x000A60, "Wrong size on ABullet_Girl002a01_Skill01_all_C");
static_assert(offsetof(ABullet_Girl002a01_Skill01_all_C, UberGraphFrame) == 0x000A10, "Member 'ABullet_Girl002a01_Skill01_all_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABullet_Girl002a01_Skill01_all_C, HasFire) == 0x000A18, "Member 'ABullet_Girl002a01_Skill01_all_C::HasFire' has a wrong offset!");
static_assert(offsetof(ABullet_Girl002a01_Skill01_all_C, Targets) == 0x000A20, "Member 'ABullet_Girl002a01_Skill01_all_C::Targets' has a wrong offset!");
static_assert(offsetof(ABullet_Girl002a01_Skill01_all_C, bLock_1) == 0x000A30, "Member 'ABullet_Girl002a01_Skill01_all_C::bLock_1' has a wrong offset!");
static_assert(offsetof(ABullet_Girl002a01_Skill01_all_C, bLock_2) == 0x000A40, "Member 'ABullet_Girl002a01_Skill01_all_C::bLock_2' has a wrong offset!");
static_assert(offsetof(ABullet_Girl002a01_Skill01_all_C, Change_Fly_Distance) == 0x000A50, "Member 'ABullet_Girl002a01_Skill01_all_C::Change_Fly_Distance' has a wrong offset!");
static_assert(offsetof(ABullet_Girl002a01_Skill01_all_C, HasTarget) == 0x000A54, "Member 'ABullet_Girl002a01_Skill01_all_C::HasTarget' has a wrong offset!");

}

