#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletExtraDamageScaler

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BulletExtraDamageScaler.BulletExtraDamageScaler_C.K2_ReceiveInitialize
// 0x0010 (0x0010 - 0x0000)
struct BulletExtraDamageScaler_C_K2_ReceiveInitialize final
{
public:
	TArray<struct FParamInfo>                     Info;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BulletExtraDamageScaler_C_K2_ReceiveInitialize) == 0x000008, "Wrong alignment on BulletExtraDamageScaler_C_K2_ReceiveInitialize");
static_assert(sizeof(BulletExtraDamageScaler_C_K2_ReceiveInitialize) == 0x000010, "Wrong size on BulletExtraDamageScaler_C_K2_ReceiveInitialize");
static_assert(offsetof(BulletExtraDamageScaler_C_K2_ReceiveInitialize, Info) == 0x000000, "Member 'BulletExtraDamageScaler_C_K2_ReceiveInitialize::Info' has a wrong offset!");

// Function BulletExtraDamageScaler.BulletExtraDamageScaler_C.ExecuteUbergraph_BulletExtraDamageScaler
// 0x0028 (0x0028 - 0x0000)
struct BulletExtraDamageScaler_C_ExecuteUbergraph_BulletExtraDamageScaler final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParamInfo>                     K2Node_Event_Info;                                 // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValueStringForLevel_ReturnValue;  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletExtraDamageScaler_C_ExecuteUbergraph_BulletExtraDamageScaler) == 0x000008, "Wrong alignment on BulletExtraDamageScaler_C_ExecuteUbergraph_BulletExtraDamageScaler");
static_assert(sizeof(BulletExtraDamageScaler_C_ExecuteUbergraph_BulletExtraDamageScaler) == 0x000028, "Wrong size on BulletExtraDamageScaler_C_ExecuteUbergraph_BulletExtraDamageScaler");
static_assert(offsetof(BulletExtraDamageScaler_C_ExecuteUbergraph_BulletExtraDamageScaler, EntryPoint) == 0x000000, "Member 'BulletExtraDamageScaler_C_ExecuteUbergraph_BulletExtraDamageScaler::EntryPoint' has a wrong offset!");
static_assert(offsetof(BulletExtraDamageScaler_C_ExecuteUbergraph_BulletExtraDamageScaler, K2Node_Event_Info) == 0x000008, "Member 'BulletExtraDamageScaler_C_ExecuteUbergraph_BulletExtraDamageScaler::K2Node_Event_Info' has a wrong offset!");
static_assert(offsetof(BulletExtraDamageScaler_C_ExecuteUbergraph_BulletExtraDamageScaler, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BulletExtraDamageScaler_C_ExecuteUbergraph_BulletExtraDamageScaler::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletExtraDamageScaler_C_ExecuteUbergraph_BulletExtraDamageScaler, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'BulletExtraDamageScaler_C_ExecuteUbergraph_BulletExtraDamageScaler::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletExtraDamageScaler_C_ExecuteUbergraph_BulletExtraDamageScaler, CallFunc_GetFloatValueStringForLevel_ReturnValue) == 0x000020, "Member 'BulletExtraDamageScaler_C_ExecuteUbergraph_BulletExtraDamageScaler::CallFunc_GetFloatValueStringForLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletExtraDamageScaler_C_ExecuteUbergraph_BulletExtraDamageScaler, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000024, "Member 'BulletExtraDamageScaler_C_ExecuteUbergraph_BulletExtraDamageScaler::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function BulletExtraDamageScaler.BulletExtraDamageScaler_C.K2_GetBulletExtraDamageScaler
// 0x0004 (0x0004 - 0x0000)
struct BulletExtraDamageScaler_C_K2_GetBulletExtraDamageScaler final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletExtraDamageScaler_C_K2_GetBulletExtraDamageScaler) == 0x000004, "Wrong alignment on BulletExtraDamageScaler_C_K2_GetBulletExtraDamageScaler");
static_assert(sizeof(BulletExtraDamageScaler_C_K2_GetBulletExtraDamageScaler) == 0x000004, "Wrong size on BulletExtraDamageScaler_C_K2_GetBulletExtraDamageScaler");
static_assert(offsetof(BulletExtraDamageScaler_C_K2_GetBulletExtraDamageScaler, ReturnValue) == 0x000000, "Member 'BulletExtraDamageScaler_C_K2_GetBulletExtraDamageScaler::ReturnValue' has a wrong offset!");

}

