#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bullet_Girl014b_skill01_M

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Bullet_Girl014b_skill01_M.Bullet_Girl014b_skill01_M_C.ExecuteUbergraph_Bullet_Girl014b_skill01_M
// 0x00A0 (0x00A0 - 0x0000)
struct Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCacheTarget_OutTargetLoc;              // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCacheTarget_OutHomingSocket;           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetCacheTarget_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        CallFunc_ReplaceEffectPath_ReturnValue;            // 0x0080(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompositeAtLocationUsePath_OutId;         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompositeAtLocationUsePath_OutIndex;      // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M) == 0x000008, "Wrong alignment on Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M");
static_assert(sizeof(Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M) == 0x0000A0, "Wrong size on Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M");
static_assert(offsetof(Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M, EntryPoint) == 0x000000, "Member 'Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M::EntryPoint' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M, CallFunc_GetCacheTarget_OutTargetLoc) == 0x000008, "Member 'Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M::CallFunc_GetCacheTarget_OutTargetLoc' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M, CallFunc_GetCacheTarget_OutHomingSocket) == 0x000018, "Member 'Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M::CallFunc_GetCacheTarget_OutHomingSocket' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M, CallFunc_GetCacheTarget_ReturnValue) == 0x000028, "Member 'Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M::CallFunc_GetCacheTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000034, "Member 'Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000040, "Member 'Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M, CallFunc_Vector_Distance_ReturnValue) == 0x00004C, "Member 'Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000050, "Member 'Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000054, "Member 'Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000058, "Member 'Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000059, "Member 'Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x00005C, "Member 'Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x000060, "Member 'Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M, CallFunc_MakeRotator_ReturnValue) == 0x000064, "Member 'Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000070, "Member 'Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M, CallFunc_ReplaceEffectPath_ReturnValue) == 0x000080, "Member 'Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M::CallFunc_ReplaceEffectPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M, CallFunc_CompositeAtLocationUsePath_OutId) == 0x000098, "Member 'Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M::CallFunc_CompositeAtLocationUsePath_OutId' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M, CallFunc_CompositeAtLocationUsePath_OutIndex) == 0x00009C, "Member 'Bullet_Girl014b_skill01_M_C_ExecuteUbergraph_Bullet_Girl014b_skill01_M::CallFunc_CompositeAtLocationUsePath_OutIndex' has a wrong offset!");

}

