#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bullet_Girl014b_skill01_ShootL

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Bullet_Girl014b_skill01_ShootL.Bullet_Girl014b_skill01_ShootL_C.ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL
// 0x00F8 (0x00F8 - 0x0000)
struct Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCacheTarget_OutTargetLoc;              // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCacheTarget_OutHomingSocket;           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetCacheTarget_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetOriginCharacter_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayerController*                  CallFunc_GetCharacterController_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        CallFunc_ReplaceEffectPath_ReturnValue;            // 0x0088(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompositeAtLocationUsePath_OutId;         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompositeAtLocationUsePath_OutIndex;      // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetShootTargetPosition_ReturnValue;    // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL) == 0x000008, "Wrong alignment on Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL");
static_assert(sizeof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL) == 0x0000F8, "Wrong size on Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, EntryPoint) == 0x000000, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::EntryPoint' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_GetCacheTarget_OutTargetLoc) == 0x000004, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_GetCacheTarget_OutTargetLoc' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_GetCacheTarget_OutHomingSocket) == 0x000010, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_GetCacheTarget_OutHomingSocket' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_GetCacheTarget_ReturnValue) == 0x000020, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_GetCacheTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_GetDisplayName_ReturnValue) == 0x000030, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_Contains_ReturnValue) == 0x000040, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_RandomFloatInRange_ReturnValue) == 0x000044, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_MakeRotator_ReturnValue) == 0x000048, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000054, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000060, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_GetOriginCharacter_ReturnValue) == 0x000070, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_GetOriginCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_GetCharacterController_ReturnValue) == 0x000078, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_GetCharacterController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_ReplaceEffectPath_ReturnValue) == 0x000088, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_ReplaceEffectPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_CompositeAtLocationUsePath_OutId) == 0x0000A0, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_CompositeAtLocationUsePath_OutId' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_CompositeAtLocationUsePath_OutIndex) == 0x0000A4, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_CompositeAtLocationUsePath_OutIndex' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_K2_GetShootTargetPosition_ReturnValue) == 0x0000A8, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_K2_GetShootTargetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000B4, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_BreakRotator_Roll) == 0x0000C0, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_BreakRotator_Pitch) == 0x0000C4, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_BreakRotator_Yaw) == 0x0000C8, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000CC, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0000D0, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_MakeRotator_ReturnValue_1) == 0x0000D4, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0000E0, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0000EC, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_Vector_Distance_ReturnValue) == 0x0000F0, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000F4, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x0000F5, "Member 'Bullet_Girl014b_skill01_ShootL_C_ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");

}

