#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bullet_Girl004a01_Skill01_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bullet_Girl004a01_Skill01_01.Bullet_Girl004a01_Skill01_01_C
// 0x0040 (0x0A50 - 0x0A10)
class ABullet_Girl004a01_Skill01_01_C final : public ABullet
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                Partnerbulletlocation;                             // 0x0A18(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllOutCircle_1;                                    // 0x0A24(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          AllOutCircle_2;                                    // 0x0A25(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          AllOutCircle_3;                                    // 0x0A26(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          AllOutCircle_4;                                    // 0x0A27(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<struct FQueryResult>                   OutTargets;                                        // 0x0A28(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class ABaseMonster_C*                         Target;                                            // 0x0A38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         __;                                                // 0x0A40(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void IgnoreActor(class ABullet* Target_0, class AActor* IgnoreActor_0);
	void TargetChoose(class AActor* Target_0);
	void ReceiveBulletFire();
	void ReceiveBulletHit(bool InHitPawn, const class AActor* Other, const struct FHitResult& Hit);
	void ExecuteUbergraph_Bullet_Girl004a01_Skill01_01(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bullet_Girl004a01_Skill01_01_C">();
	}
	static class ABullet_Girl004a01_Skill01_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABullet_Girl004a01_Skill01_01_C>();
	}
};
static_assert(alignof(ABullet_Girl004a01_Skill01_01_C) == 0x000010, "Wrong alignment on ABullet_Girl004a01_Skill01_01_C");
static_assert(sizeof(ABullet_Girl004a01_Skill01_01_C) == 0x000A50, "Wrong size on ABullet_Girl004a01_Skill01_01_C");
static_assert(offsetof(ABullet_Girl004a01_Skill01_01_C, UberGraphFrame) == 0x000A10, "Member 'ABullet_Girl004a01_Skill01_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABullet_Girl004a01_Skill01_01_C, Partnerbulletlocation) == 0x000A18, "Member 'ABullet_Girl004a01_Skill01_01_C::Partnerbulletlocation' has a wrong offset!");
static_assert(offsetof(ABullet_Girl004a01_Skill01_01_C, AllOutCircle_1) == 0x000A24, "Member 'ABullet_Girl004a01_Skill01_01_C::AllOutCircle_1' has a wrong offset!");
static_assert(offsetof(ABullet_Girl004a01_Skill01_01_C, AllOutCircle_2) == 0x000A25, "Member 'ABullet_Girl004a01_Skill01_01_C::AllOutCircle_2' has a wrong offset!");
static_assert(offsetof(ABullet_Girl004a01_Skill01_01_C, AllOutCircle_3) == 0x000A26, "Member 'ABullet_Girl004a01_Skill01_01_C::AllOutCircle_3' has a wrong offset!");
static_assert(offsetof(ABullet_Girl004a01_Skill01_01_C, AllOutCircle_4) == 0x000A27, "Member 'ABullet_Girl004a01_Skill01_01_C::AllOutCircle_4' has a wrong offset!");
static_assert(offsetof(ABullet_Girl004a01_Skill01_01_C, OutTargets) == 0x000A28, "Member 'ABullet_Girl004a01_Skill01_01_C::OutTargets' has a wrong offset!");
static_assert(offsetof(ABullet_Girl004a01_Skill01_01_C, Target) == 0x000A38, "Member 'ABullet_Girl004a01_Skill01_01_C::Target' has a wrong offset!");
static_assert(offsetof(ABullet_Girl004a01_Skill01_01_C, __) == 0x000A40, "Member 'ABullet_Girl004a01_Skill01_01_C::__' has a wrong offset!");

}

