#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bullet_Girl004b_Skill03

#include "Basic.hpp"

#include "Game_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bullet_Girl004b_Skill03.Bullet_Girl004b_Skill03_C
// 0x0030 (0x0A30 - 0x0A00)
class ABullet_Girl004b_Skill03_C final : public ABullet
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBulletSubTraceComponent*               BulletSubTrace;                                    // 0x0A08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         目标与子弹之间距离;                                // 0x0A10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               In_Rotator;                                        // 0x0A14(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                NewVar_0;                                          // 0x0A20(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBulletFire();
	void ExecuteUbergraph_Bullet_Girl004b_Skill03(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Bullet_Girl004b_Skill03_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Bullet_Girl004b_Skill03_C")
	}
	static class ABullet_Girl004b_Skill03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABullet_Girl004b_Skill03_C>();
	}
};
DUMPER7_ASSERTS_ABullet_Girl004b_Skill03_C;

}

