#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bullet_Girl002a01_Skill01_all

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Game_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bullet_Girl002a01_Skill01_all.Bullet_Girl002a01_Skill01_all_C
// 0x0050 (0x0A50 - 0x0A00)
#pragma pack(push, 0x1)
class alignas(0x10) ABullet_Girl002a01_Skill01_all_C : public ABullet
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          HasFire;                                           // 0x0A08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A09[0x7];                                      // 0x0A09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Targets;                                           // 0x0A10(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<EBulletCollision>                      bLock_1;                                           // 0x0A20(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<EBulletCollision>                      bLock_2;                                           // 0x0A30(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Change_Fly_Distance;                               // 0x0A40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasTarget;                                         // 0x0A44(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void girl002a_bullet_lastmove();
	void ReceiveBulletFire();
	void ReceiveRecycle();
	void ExecuteUbergraph_Bullet_Girl002a01_Skill01_all(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Bullet_Girl002a01_Skill01_all_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Bullet_Girl002a01_Skill01_all_C")
	}
	static class ABullet_Girl002a01_Skill01_all_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABullet_Girl002a01_Skill01_all_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ABullet_Girl002a01_Skill01_all_C;

}

