#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bullet_Girl006_Skill01_011

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Bullet_Girl006_Skill01_011.Bullet_Girl006_Skill01_011_C.ExecuteUbergraph_Bullet_Girl006_Skill01_011
// 0x0090 (0x0090 - 0x0000)
struct Bullet_Girl006_Skill01_011_C_ExecuteUbergraph_Bullet_Girl006_Skill01_011 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class ABullet*                                CallFunc_SpawnBullet_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABullet_Girl006_Skill01_012_C*          K2Node_DynamicCast_AsBullet_Girl_006_Skill_01_012; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCacheTarget_OutTargetLoc;              // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCacheTarget_OutHomingSocket;           // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetCacheTarget_ReturnValue;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(Bullet_Girl006_Skill01_011_C_ExecuteUbergraph_Bullet_Girl006_Skill01_011) == 0x000010, "Wrong alignment on Bullet_Girl006_Skill01_011_C_ExecuteUbergraph_Bullet_Girl006_Skill01_011");
static_assert(sizeof(Bullet_Girl006_Skill01_011_C_ExecuteUbergraph_Bullet_Girl006_Skill01_011) == 0x000090, "Wrong size on Bullet_Girl006_Skill01_011_C_ExecuteUbergraph_Bullet_Girl006_Skill01_011");
static_assert(offsetof(Bullet_Girl006_Skill01_011_C_ExecuteUbergraph_Bullet_Girl006_Skill01_011, EntryPoint) == 0x000000, "Member 'Bullet_Girl006_Skill01_011_C_ExecuteUbergraph_Bullet_Girl006_Skill01_011::EntryPoint' has a wrong offset!");
static_assert(offsetof(Bullet_Girl006_Skill01_011_C_ExecuteUbergraph_Bullet_Girl006_Skill01_011, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'Bullet_Girl006_Skill01_011_C_ExecuteUbergraph_Bullet_Girl006_Skill01_011::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl006_Skill01_011_C_ExecuteUbergraph_Bullet_Girl006_Skill01_011, CallFunc_SpawnBullet_ReturnValue) == 0x000040, "Member 'Bullet_Girl006_Skill01_011_C_ExecuteUbergraph_Bullet_Girl006_Skill01_011::CallFunc_SpawnBullet_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl006_Skill01_011_C_ExecuteUbergraph_Bullet_Girl006_Skill01_011, K2Node_DynamicCast_AsBullet_Girl_006_Skill_01_012) == 0x000048, "Member 'Bullet_Girl006_Skill01_011_C_ExecuteUbergraph_Bullet_Girl006_Skill01_011::K2Node_DynamicCast_AsBullet_Girl_006_Skill_01_012' has a wrong offset!");
static_assert(offsetof(Bullet_Girl006_Skill01_011_C_ExecuteUbergraph_Bullet_Girl006_Skill01_011, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'Bullet_Girl006_Skill01_011_C_ExecuteUbergraph_Bullet_Girl006_Skill01_011::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Bullet_Girl006_Skill01_011_C_ExecuteUbergraph_Bullet_Girl006_Skill01_011, CallFunc_GetCacheTarget_OutTargetLoc) == 0x000054, "Member 'Bullet_Girl006_Skill01_011_C_ExecuteUbergraph_Bullet_Girl006_Skill01_011::CallFunc_GetCacheTarget_OutTargetLoc' has a wrong offset!");
static_assert(offsetof(Bullet_Girl006_Skill01_011_C_ExecuteUbergraph_Bullet_Girl006_Skill01_011, CallFunc_GetCacheTarget_OutHomingSocket) == 0x000060, "Member 'Bullet_Girl006_Skill01_011_C_ExecuteUbergraph_Bullet_Girl006_Skill01_011::CallFunc_GetCacheTarget_OutHomingSocket' has a wrong offset!");
static_assert(offsetof(Bullet_Girl006_Skill01_011_C_ExecuteUbergraph_Bullet_Girl006_Skill01_011, CallFunc_GetCacheTarget_ReturnValue) == 0x000070, "Member 'Bullet_Girl006_Skill01_011_C_ExecuteUbergraph_Bullet_Girl006_Skill01_011::CallFunc_GetCacheTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl006_Skill01_011_C_ExecuteUbergraph_Bullet_Girl006_Skill01_011, K2Node_MakeArray_Array) == 0x000078, "Member 'Bullet_Girl006_Skill01_011_C_ExecuteUbergraph_Bullet_Girl006_Skill01_011::K2Node_MakeArray_Array' has a wrong offset!");

}

