#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletScreen_410602

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BulletScreen_410602.BulletScreen_410602_C.ExecuteUbergraph_BulletScreen_410602
// 0x0190 (0x0190 - 0x0000)
struct BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponent*                      K2Node_DynamicCast_AsAbility_Component;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameAICharacter*                       K2Node_DynamicCast_AsGame_AICharacter;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Vector_Up_ReturnValue;                    // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetTargetActor_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemManager*                 CallFunc_GetPtr_ReturnValue;                       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0090(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SpawnCompositeAtLocation_ReturnValue;     // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Variable;                                   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_124[0xC];                                      // 0x0124(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_SpawnClusterBullet_ReturnValue;           // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClient_ReturnValue;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602) == 0x000010, "Wrong alignment on BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602");
static_assert(sizeof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602) == 0x000190, "Wrong size on BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, EntryPoint) == 0x000000, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::EntryPoint' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, K2Node_DynamicCast_AsAbility_Component) == 0x000008, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::K2Node_DynamicCast_AsAbility_Component' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, K2Node_DynamicCast_AsGame_AICharacter) == 0x000020, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::K2Node_DynamicCast_AsGame_AICharacter' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_Vector_Up_ReturnValue) == 0x00002C, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_Vector_Up_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000038, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_GetTargetActor_ReturnValue) == 0x000048, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_GetTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_Add_VectorVector_ReturnValue) == 0x00005C, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000068, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000078, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_GetPtr_ReturnValue) == 0x000080, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_GetPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000088, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, ___bool_IsClosed_Variable) == 0x000089, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_GetTransform_ReturnValue) == 0x000090, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_BreakTransform_Location) == 0x0000C0, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_BreakTransform_Rotation) == 0x0000CC, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_BreakTransform_Scale) == 0x0000D8, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_SpawnCompositeAtLocation_ReturnValue) == 0x0000E4, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_SpawnCompositeAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_BreakRotator_Roll) == 0x0000E8, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_BreakRotator_Pitch) == 0x0000EC, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_BreakRotator_Yaw) == 0x0000F0, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000F4, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, ___bool_Has_Been_Initd_Variable) == 0x0000F8, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, ___int_Variable) == 0x0000FC, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::___int_Variable' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_Add_IntInt_ReturnValue) == 0x000100, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_Less_IntInt_ReturnValue) == 0x000104, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000108, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00010C, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_Lerp_ReturnValue) == 0x000110, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_Add_FloatFloat_ReturnValue) == 0x000114, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_MakeRotator_ReturnValue) == 0x000118, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_MakeTransform_ReturnValue) == 0x000130, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_SpawnClusterBullet_ReturnValue) == 0x000160, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_SpawnClusterBullet_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_GetForwardVector_ReturnValue) == 0x000164, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_IsClient_ReturnValue) == 0x000170, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_IsClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000174, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000180, "Member 'BulletScreen_410602_C_ExecuteUbergraph_BulletScreen_410602::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");

// Function BulletScreen_410602.BulletScreen_410602_C.DoClearNiagara
// 0x0008 (0x0008 - 0x0000)
struct BulletScreen_410602_C_DoClearNiagara final
{
public:
	class UParticleSystemManager*                 CallFunc_GetPtr_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletScreen_410602_C_DoClearNiagara) == 0x000008, "Wrong alignment on BulletScreen_410602_C_DoClearNiagara");
static_assert(sizeof(BulletScreen_410602_C_DoClearNiagara) == 0x000008, "Wrong size on BulletScreen_410602_C_DoClearNiagara");
static_assert(offsetof(BulletScreen_410602_C_DoClearNiagara, CallFunc_GetPtr_ReturnValue) == 0x000000, "Member 'BulletScreen_410602_C_DoClearNiagara::CallFunc_GetPtr_ReturnValue' has a wrong offset!");

// Function BulletScreen_410602.BulletScreen_410602_C.UpdateBuletInfoToNiagara
// 0x0008 (0x0008 - 0x0000)
struct BulletScreen_410602_C_UpdateBuletInfoToNiagara final
{
public:
	class UParticleSystemManager*                 CallFunc_GetPtr_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletScreen_410602_C_UpdateBuletInfoToNiagara) == 0x000008, "Wrong alignment on BulletScreen_410602_C_UpdateBuletInfoToNiagara");
static_assert(sizeof(BulletScreen_410602_C_UpdateBuletInfoToNiagara) == 0x000008, "Wrong size on BulletScreen_410602_C_UpdateBuletInfoToNiagara");
static_assert(offsetof(BulletScreen_410602_C_UpdateBuletInfoToNiagara, CallFunc_GetPtr_ReturnValue) == 0x000000, "Member 'BulletScreen_410602_C_UpdateBuletInfoToNiagara::CallFunc_GetPtr_ReturnValue' has a wrong offset!");

// Function BulletScreen_410602.BulletScreen_410602_C.BulletSpawnEffect
// 0x0028 (0x0028 - 0x0000)
struct BulletScreen_410602_C_BulletSpawnEffect final
{
public:
	struct FVector                                Pos;                                               // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Rot;                                               // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemManager*                 CallFunc_GetPtr_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompositeAtLocation_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletScreen_410602_C_BulletSpawnEffect) == 0x000008, "Wrong alignment on BulletScreen_410602_C_BulletSpawnEffect");
static_assert(sizeof(BulletScreen_410602_C_BulletSpawnEffect) == 0x000028, "Wrong size on BulletScreen_410602_C_BulletSpawnEffect");
static_assert(offsetof(BulletScreen_410602_C_BulletSpawnEffect, Pos) == 0x000000, "Member 'BulletScreen_410602_C_BulletSpawnEffect::Pos' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_BulletSpawnEffect, Rot) == 0x00000C, "Member 'BulletScreen_410602_C_BulletSpawnEffect::Rot' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_BulletSpawnEffect, CallFunc_GetPtr_ReturnValue) == 0x000018, "Member 'BulletScreen_410602_C_BulletSpawnEffect::CallFunc_GetPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410602_C_BulletSpawnEffect, CallFunc_CompositeAtLocation_ReturnValue) == 0x000020, "Member 'BulletScreen_410602_C_BulletSpawnEffect::CallFunc_CompositeAtLocation_ReturnValue' has a wrong offset!");

// Function BulletScreen_410602.BulletScreen_410602_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BulletScreen_410602_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BulletScreen_410602_C_GetModuleName) == 0x000008, "Wrong alignment on BulletScreen_410602_C_GetModuleName");
static_assert(sizeof(BulletScreen_410602_C_GetModuleName) == 0x000010, "Wrong size on BulletScreen_410602_C_GetModuleName");
static_assert(offsetof(BulletScreen_410602_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BulletScreen_410602_C_GetModuleName::ReturnValue' has a wrong offset!");

}

