#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletScreen_410103

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BulletScreen_410103.BulletScreen_410103_C
// 0x00B0 (0x0450 - 0x03A0)
class ABulletScreen_410103_C final : public ABulletScreenEditor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Scene;                                             // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DefaultLocation;                                   // 0x03C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GenerateLocation01;                                // 0x03CC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DefaultForwardVelocity;                            // 0x03D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DefaultScale;                                      // 0x03E4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DefaultRotation;                                   // 0x03F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               GenerateRotation01;                                // 0x03FC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         GenerateCount;                                     // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BulletNumPerSector;                                // 0x040C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CircleCount;                                       // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CircleNum;                                         // 0x0414(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SingleSectorAngle;                                 // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GenerateLocation02;                                // 0x041C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               GenerateRotation02;                                // 0x0428(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABullet*>                        BulletArray;                                       // 0x0438(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BulletScreen_410103(int32 EntryPoint);
	void GenerateBullet();
	void CalBulletLocation__Rotation();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void OnCalcBulletLocAndRot();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BulletScreen_410103_C">();
	}
	static class ABulletScreen_410103_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABulletScreen_410103_C>();
	}
};
static_assert(alignof(ABulletScreen_410103_C) == 0x000010, "Wrong alignment on ABulletScreen_410103_C");
static_assert(sizeof(ABulletScreen_410103_C) == 0x000450, "Wrong size on ABulletScreen_410103_C");
static_assert(offsetof(ABulletScreen_410103_C, UberGraphFrame) == 0x0003A0, "Member 'ABulletScreen_410103_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410103_C, Scene) == 0x0003A8, "Member 'ABulletScreen_410103_C::Scene' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410103_C, DefaultSceneRoot) == 0x0003B0, "Member 'ABulletScreen_410103_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410103_C, TargetActor) == 0x0003B8, "Member 'ABulletScreen_410103_C::TargetActor' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410103_C, DefaultLocation) == 0x0003C0, "Member 'ABulletScreen_410103_C::DefaultLocation' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410103_C, GenerateLocation01) == 0x0003CC, "Member 'ABulletScreen_410103_C::GenerateLocation01' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410103_C, DefaultForwardVelocity) == 0x0003D8, "Member 'ABulletScreen_410103_C::DefaultForwardVelocity' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410103_C, DefaultScale) == 0x0003E4, "Member 'ABulletScreen_410103_C::DefaultScale' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410103_C, DefaultRotation) == 0x0003F0, "Member 'ABulletScreen_410103_C::DefaultRotation' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410103_C, GenerateRotation01) == 0x0003FC, "Member 'ABulletScreen_410103_C::GenerateRotation01' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410103_C, GenerateCount) == 0x000408, "Member 'ABulletScreen_410103_C::GenerateCount' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410103_C, BulletNumPerSector) == 0x00040C, "Member 'ABulletScreen_410103_C::BulletNumPerSector' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410103_C, CircleCount) == 0x000410, "Member 'ABulletScreen_410103_C::CircleCount' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410103_C, CircleNum) == 0x000414, "Member 'ABulletScreen_410103_C::CircleNum' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410103_C, SingleSectorAngle) == 0x000418, "Member 'ABulletScreen_410103_C::SingleSectorAngle' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410103_C, GenerateLocation02) == 0x00041C, "Member 'ABulletScreen_410103_C::GenerateLocation02' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410103_C, GenerateRotation02) == 0x000428, "Member 'ABulletScreen_410103_C::GenerateRotation02' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410103_C, BulletArray) == 0x000438, "Member 'ABulletScreen_410103_C::BulletArray' has a wrong offset!");

}

