#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bullet_Girl014b_skill01_ShootL

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bullet_Girl014b_skill01_ShootL.Bullet_Girl014b_skill01_ShootL_C
// 0x0050 (0x0A60 - 0x0A10)
class ABullet_Girl014b_skill01_ShootL_C final : public ABullet
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         PitchMin;                                          // 0x0A18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PitchMax;                                          // 0x0A1C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         YawMin;                                            // 0x0A20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         YawMax;                                            // 0x0A24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinTargetDistance;                                 // 0x0A28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxTargetDistance;                                 // 0x0A2C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FireLoc;                                           // 0x0A30(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3C[0x4];                                      // 0x0A3C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        E_girl014b_skill01_02;                             // 0x0A40(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Is_Girl012_Prop02;                                 // 0x0A58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ReceiveBulletFire();
	void ExecuteUbergraph_Bullet_Girl014b_skill01_ShootL(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bullet_Girl014b_skill01_ShootL_C">();
	}
	static class ABullet_Girl014b_skill01_ShootL_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABullet_Girl014b_skill01_ShootL_C>();
	}
};
static_assert(alignof(ABullet_Girl014b_skill01_ShootL_C) == 0x000010, "Wrong alignment on ABullet_Girl014b_skill01_ShootL_C");
static_assert(sizeof(ABullet_Girl014b_skill01_ShootL_C) == 0x000A60, "Wrong size on ABullet_Girl014b_skill01_ShootL_C");
static_assert(offsetof(ABullet_Girl014b_skill01_ShootL_C, UberGraphFrame) == 0x000A10, "Member 'ABullet_Girl014b_skill01_ShootL_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABullet_Girl014b_skill01_ShootL_C, PitchMin) == 0x000A18, "Member 'ABullet_Girl014b_skill01_ShootL_C::PitchMin' has a wrong offset!");
static_assert(offsetof(ABullet_Girl014b_skill01_ShootL_C, PitchMax) == 0x000A1C, "Member 'ABullet_Girl014b_skill01_ShootL_C::PitchMax' has a wrong offset!");
static_assert(offsetof(ABullet_Girl014b_skill01_ShootL_C, YawMin) == 0x000A20, "Member 'ABullet_Girl014b_skill01_ShootL_C::YawMin' has a wrong offset!");
static_assert(offsetof(ABullet_Girl014b_skill01_ShootL_C, YawMax) == 0x000A24, "Member 'ABullet_Girl014b_skill01_ShootL_C::YawMax' has a wrong offset!");
static_assert(offsetof(ABullet_Girl014b_skill01_ShootL_C, MinTargetDistance) == 0x000A28, "Member 'ABullet_Girl014b_skill01_ShootL_C::MinTargetDistance' has a wrong offset!");
static_assert(offsetof(ABullet_Girl014b_skill01_ShootL_C, MaxTargetDistance) == 0x000A2C, "Member 'ABullet_Girl014b_skill01_ShootL_C::MaxTargetDistance' has a wrong offset!");
static_assert(offsetof(ABullet_Girl014b_skill01_ShootL_C, FireLoc) == 0x000A30, "Member 'ABullet_Girl014b_skill01_ShootL_C::FireLoc' has a wrong offset!");
static_assert(offsetof(ABullet_Girl014b_skill01_ShootL_C, E_girl014b_skill01_02) == 0x000A40, "Member 'ABullet_Girl014b_skill01_ShootL_C::E_girl014b_skill01_02' has a wrong offset!");
static_assert(offsetof(ABullet_Girl014b_skill01_ShootL_C, Is_Girl012_Prop02) == 0x000A58, "Member 'ABullet_Girl014b_skill01_ShootL_C::Is_Girl012_Prop02' has a wrong offset!");

}

