#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletScreen_410103

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BulletScreen_410103.BulletScreen_410103_C.ExecuteUbergraph_BulletScreen_410103
// 0x0240 (0x0240 - 0x0000)
struct BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable;                                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_IsClosed_Variable_1;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable_1;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAICharacter*                       K2Node_DynamicCast_AsGame_AICharacter;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetTargetActor_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegSin_ReturnValue;                       // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegCos_ReturnValue;                       // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_2;           // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_4;       // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_5;       // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_5;           // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0180(0x0030)(IsPlainOldData, NoDestructor)
	class ABullet*                                CallFunc_SpawnBullet_ReturnValue;                  // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B8[0x8];                                      // 0x01B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x01C0(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABullet*                                CallFunc_SpawnBullet_ReturnValue_1;                // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable_1;                                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABullet*                                CallFunc_Array_Get_Item;                           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATest_910101_C*                         K2Node_DynamicCast_AsTest_910101;                  // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103) == 0x000010, "Wrong alignment on BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103");
static_assert(sizeof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103) == 0x000240, "Wrong size on BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, EntryPoint) == 0x000000, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::EntryPoint' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, ___bool_IsClosed_Variable) == 0x000004, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, ___int_Loop_Counter_Variable) == 0x000008, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, ___int_Array_Index_Variable) == 0x000010, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, ___int_Variable) == 0x000014, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::___int_Variable' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, ___bool_IsClosed_Variable_1) == 0x000018, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::___bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, ___bool_Has_Been_Initd_Variable) == 0x000019, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, ___bool_Has_Been_Initd_Variable_1) == 0x000020, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::___bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, K2Node_DynamicCast_AsGame_AICharacter) == 0x000038, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::K2Node_DynamicCast_AsGame_AICharacter' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_GetTargetActor_ReturnValue) == 0x000048, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_GetTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000050, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00005C, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_GetForwardVector_ReturnValue) == 0x000068, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_GetRightVector_ReturnValue) == 0x000074, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_GetUpVector_ReturnValue) == 0x000080, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00008C, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000098, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Add_IntInt_ReturnValue_1) == 0x00009C, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000A0, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_MakeVector_ReturnValue) == 0x0000A4, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Multiply_IntFloat_ReturnValue) == 0x0000B0, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_MakeVector_ReturnValue_1) == 0x0000B4, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_DegSin_ReturnValue) == 0x0000C0, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_DegSin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_DegCos_ReturnValue) == 0x0000C4, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_DegCos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000C8, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x0000D4, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Multiply_VectorFloat_ReturnValue_3) == 0x0000E0, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Multiply_VectorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Add_VectorVector_ReturnValue) == 0x0000EC, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000F8, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_FindLookAtRotation_ReturnValue) == 0x000104, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_FindLookAtRotation_ReturnValue_1) == 0x000110, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_FindLookAtRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_GetForwardVector_ReturnValue_1) == 0x00011C, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_GetForwardVector_ReturnValue_2) == 0x000128, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_GetForwardVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Multiply_VectorFloat_ReturnValue_4) == 0x000134, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Multiply_VectorFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Multiply_VectorFloat_ReturnValue_5) == 0x000140, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Multiply_VectorFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Add_VectorVector_ReturnValue_2) == 0x00014C, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000158, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Add_VectorVector_ReturnValue_4) == 0x000164, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Add_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Add_VectorVector_ReturnValue_5) == 0x000170, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Add_VectorVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Less_IntInt_ReturnValue) == 0x00017C, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_MakeTransform_ReturnValue) == 0x000180, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_SpawnBullet_ReturnValue) == 0x0001B0, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_SpawnBullet_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_MakeTransform_ReturnValue_1) == 0x0001C0, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Array_Add_ReturnValue) == 0x0001F0, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_SpawnBullet_ReturnValue_1) == 0x0001F8, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_SpawnBullet_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Array_Add_ReturnValue_1) == 0x000200, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Add_IntInt_ReturnValue_2) == 0x000204, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, ___int_Variable_1) == 0x000208, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::___int_Variable_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Array_Get_Item) == 0x000210, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, K2Node_DynamicCast_AsTest_910101) == 0x000218, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::K2Node_DynamicCast_AsTest_910101' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, K2Node_DynamicCast_bSuccess_1) == 0x000220, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Array_Length_ReturnValue) == 0x000224, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Less_IntInt_ReturnValue_1) == 0x000228, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Add_IntInt_ReturnValue_3) == 0x00022C, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103, CallFunc_Less_IntInt_ReturnValue_2) == 0x000230, "Member 'BulletScreen_410103_C_ExecuteUbergraph_BulletScreen_410103::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function BulletScreen_410103.BulletScreen_410103_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BulletScreen_410103_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletScreen_410103_C_ReceiveTick) == 0x000004, "Wrong alignment on BulletScreen_410103_C_ReceiveTick");
static_assert(sizeof(BulletScreen_410103_C_ReceiveTick) == 0x000004, "Wrong size on BulletScreen_410103_C_ReceiveTick");
static_assert(offsetof(BulletScreen_410103_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BulletScreen_410103_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BulletScreen_410103.BulletScreen_410103_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BulletScreen_410103_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BulletScreen_410103_C_GetModuleName) == 0x000008, "Wrong alignment on BulletScreen_410103_C_GetModuleName");
static_assert(sizeof(BulletScreen_410103_C_GetModuleName) == 0x000010, "Wrong size on BulletScreen_410103_C_GetModuleName");
static_assert(offsetof(BulletScreen_410103_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BulletScreen_410103_C_GetModuleName::ReturnValue' has a wrong offset!");

}

