#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletDamageEffect

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BulletDamageEffect.BulletDamageEffect_C.ExecuteUbergraph_BulletDamageEffect
// 0x0208 (0x0208 - 0x0000)
struct BulletDamageEffect_C_ExecuteUbergraph_BulletDamageEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bStart, struct FPreDamageResultData& PreResultData, bool bClearTempAttribute)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_bStart;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPreDamageResultData                   K2Node_CustomEvent_PreResultData;                  // 0x0020(0x01E0)(ConstParm, ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_bClearTempAttribute;            // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BulletDamageEffect_C_ExecuteUbergraph_BulletDamageEffect) == 0x000008, "Wrong alignment on BulletDamageEffect_C_ExecuteUbergraph_BulletDamageEffect");
static_assert(sizeof(BulletDamageEffect_C_ExecuteUbergraph_BulletDamageEffect) == 0x000208, "Wrong size on BulletDamageEffect_C_ExecuteUbergraph_BulletDamageEffect");
static_assert(offsetof(BulletDamageEffect_C_ExecuteUbergraph_BulletDamageEffect, EntryPoint) == 0x000000, "Member 'BulletDamageEffect_C_ExecuteUbergraph_BulletDamageEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(BulletDamageEffect_C_ExecuteUbergraph_BulletDamageEffect, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BulletDamageEffect_C_ExecuteUbergraph_BulletDamageEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletDamageEffect_C_ExecuteUbergraph_BulletDamageEffect, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BulletDamageEffect_C_ExecuteUbergraph_BulletDamageEffect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BulletDamageEffect_C_ExecuteUbergraph_BulletDamageEffect, K2Node_CustomEvent_bStart) == 0x000018, "Member 'BulletDamageEffect_C_ExecuteUbergraph_BulletDamageEffect::K2Node_CustomEvent_bStart' has a wrong offset!");
static_assert(offsetof(BulletDamageEffect_C_ExecuteUbergraph_BulletDamageEffect, K2Node_CustomEvent_PreResultData) == 0x000020, "Member 'BulletDamageEffect_C_ExecuteUbergraph_BulletDamageEffect::K2Node_CustomEvent_PreResultData' has a wrong offset!");
static_assert(offsetof(BulletDamageEffect_C_ExecuteUbergraph_BulletDamageEffect, K2Node_CustomEvent_bClearTempAttribute) == 0x000200, "Member 'BulletDamageEffect_C_ExecuteUbergraph_BulletDamageEffect::K2Node_CustomEvent_bClearTempAttribute' has a wrong offset!");
static_assert(offsetof(BulletDamageEffect_C_ExecuteUbergraph_BulletDamageEffect, CallFunc_IsValid_ReturnValue_1) == 0x000201, "Member 'BulletDamageEffect_C_ExecuteUbergraph_BulletDamageEffect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BulletDamageEffect.BulletDamageEffect_C.NotifyModifyHealth
// 0x01F0 (0x01F0 - 0x0000)
struct BulletDamageEffect_C_NotifyModifyHealth final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPreDamageResultData                   PreResultData;                                     // 0x0008(0x01E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          bClearTempAttribute;                               // 0x01E8(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BulletDamageEffect_C_NotifyModifyHealth) == 0x000008, "Wrong alignment on BulletDamageEffect_C_NotifyModifyHealth");
static_assert(sizeof(BulletDamageEffect_C_NotifyModifyHealth) == 0x0001F0, "Wrong size on BulletDamageEffect_C_NotifyModifyHealth");
static_assert(offsetof(BulletDamageEffect_C_NotifyModifyHealth, bStart) == 0x000000, "Member 'BulletDamageEffect_C_NotifyModifyHealth::bStart' has a wrong offset!");
static_assert(offsetof(BulletDamageEffect_C_NotifyModifyHealth, PreResultData) == 0x000008, "Member 'BulletDamageEffect_C_NotifyModifyHealth::PreResultData' has a wrong offset!");
static_assert(offsetof(BulletDamageEffect_C_NotifyModifyHealth, bClearTempAttribute) == 0x0001E8, "Member 'BulletDamageEffect_C_NotifyModifyHealth::bClearTempAttribute' has a wrong offset!");

}

