#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bullet_Girl014b_skill01_Shoot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bullet_Girl014b_skill01_Shoot.Bullet_Girl014b_skill01_Shoot_C
// 0x0090 (0x0B40 - 0x0AB0)
class ABullet_Girl014b_skill01_Shoot_C final : public APreheatBullet
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         PitchMin;                                          // 0x0AB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PitchMax;                                          // 0x0ABC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         YawMin;                                            // 0x0AC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         YawMax;                                            // 0x0AC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinTargetDistance;                                 // 0x0AC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxTargetDistance;                                 // 0x0ACC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         In_ID;                                             // 0x0AD0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FireLoc;                                           // 0x0AD4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EBulletCollision>                      In_Flags;                                          // 0x0AE0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSoftObjectPath                        E_girl014b_skill01_02;                             // 0x0AF0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bFireInited;                                       // 0x0B08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B09[0x7];                                      // 0x0B09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        E_girl014b_skill01_05;                             // 0x0B10(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Is_Girl012_Prop02;                                 // 0x0B28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B29[0x7];                                      // 0x0B29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TargetActor;                                       // 0x0B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBulletHit(bool InHitPawn, const class AActor* Other, const struct FHitResult& Hit);
	void OnNotifyCacheQueryTarget();
	void OnSpawn();
	void ReceiveBulletFire();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_Bullet_Girl014b_skill01_Shoot(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bullet_Girl014b_skill01_Shoot_C">();
	}
	static class ABullet_Girl014b_skill01_Shoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABullet_Girl014b_skill01_Shoot_C>();
	}
};
static_assert(alignof(ABullet_Girl014b_skill01_Shoot_C) == 0x000010, "Wrong alignment on ABullet_Girl014b_skill01_Shoot_C");
static_assert(sizeof(ABullet_Girl014b_skill01_Shoot_C) == 0x000B40, "Wrong size on ABullet_Girl014b_skill01_Shoot_C");
static_assert(offsetof(ABullet_Girl014b_skill01_Shoot_C, UberGraphFrame) == 0x000AB0, "Member 'ABullet_Girl014b_skill01_Shoot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABullet_Girl014b_skill01_Shoot_C, PitchMin) == 0x000AB8, "Member 'ABullet_Girl014b_skill01_Shoot_C::PitchMin' has a wrong offset!");
static_assert(offsetof(ABullet_Girl014b_skill01_Shoot_C, PitchMax) == 0x000ABC, "Member 'ABullet_Girl014b_skill01_Shoot_C::PitchMax' has a wrong offset!");
static_assert(offsetof(ABullet_Girl014b_skill01_Shoot_C, YawMin) == 0x000AC0, "Member 'ABullet_Girl014b_skill01_Shoot_C::YawMin' has a wrong offset!");
static_assert(offsetof(ABullet_Girl014b_skill01_Shoot_C, YawMax) == 0x000AC4, "Member 'ABullet_Girl014b_skill01_Shoot_C::YawMax' has a wrong offset!");
static_assert(offsetof(ABullet_Girl014b_skill01_Shoot_C, MinTargetDistance) == 0x000AC8, "Member 'ABullet_Girl014b_skill01_Shoot_C::MinTargetDistance' has a wrong offset!");
static_assert(offsetof(ABullet_Girl014b_skill01_Shoot_C, MaxTargetDistance) == 0x000ACC, "Member 'ABullet_Girl014b_skill01_Shoot_C::MaxTargetDistance' has a wrong offset!");
static_assert(offsetof(ABullet_Girl014b_skill01_Shoot_C, In_ID) == 0x000AD0, "Member 'ABullet_Girl014b_skill01_Shoot_C::In_ID' has a wrong offset!");
static_assert(offsetof(ABullet_Girl014b_skill01_Shoot_C, FireLoc) == 0x000AD4, "Member 'ABullet_Girl014b_skill01_Shoot_C::FireLoc' has a wrong offset!");
static_assert(offsetof(ABullet_Girl014b_skill01_Shoot_C, In_Flags) == 0x000AE0, "Member 'ABullet_Girl014b_skill01_Shoot_C::In_Flags' has a wrong offset!");
static_assert(offsetof(ABullet_Girl014b_skill01_Shoot_C, E_girl014b_skill01_02) == 0x000AF0, "Member 'ABullet_Girl014b_skill01_Shoot_C::E_girl014b_skill01_02' has a wrong offset!");
static_assert(offsetof(ABullet_Girl014b_skill01_Shoot_C, bFireInited) == 0x000B08, "Member 'ABullet_Girl014b_skill01_Shoot_C::bFireInited' has a wrong offset!");
static_assert(offsetof(ABullet_Girl014b_skill01_Shoot_C, E_girl014b_skill01_05) == 0x000B10, "Member 'ABullet_Girl014b_skill01_Shoot_C::E_girl014b_skill01_05' has a wrong offset!");
static_assert(offsetof(ABullet_Girl014b_skill01_Shoot_C, Is_Girl012_Prop02) == 0x000B28, "Member 'ABullet_Girl014b_skill01_Shoot_C::Is_Girl012_Prop02' has a wrong offset!");
static_assert(offsetof(ABullet_Girl014b_skill01_Shoot_C, TargetActor) == 0x000B30, "Member 'ABullet_Girl014b_skill01_Shoot_C::TargetActor' has a wrong offset!");

}

