#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletScreen_410602

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ClusterBullet_WWISE_Temporary_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BulletScreen_410602.BulletScreen_410602_C
// 0x0080 (0x0690 - 0x0610)
class ABulletScreen_410602_C final : public AClusterBullet_WWISE_Temporary_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BulletScreen_410602_C;              // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Scene01;                                           // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DefaultLocation;                                   // 0x0618(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DefaultScale;                                      // 0x0624(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DefaultRotation;                                   // 0x0630(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         GenerateCount;                                     // 0x063C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BulletNum;                                         // 0x0640(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GenerateLocation;                                  // 0x0644(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               GenerateRotation;                                  // 0x0650(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65C[0x4];                                      // 0x065C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABullet*>                        BulletArray;                                       // 0x0660(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UAIControlDataComponent*                AIControl_Data;                                    // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxBulletCount;                                    // 0x0680(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BulletCompositeId;                                 // 0x0684(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BulletHitCompositeId;                              // 0x0688(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BulletSpawnEffectCompositeId;                      // 0x068C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BulletScreen_410602(int32 EntryPoint);
	void SpawnCompositeEffect();
	void ReceiveBeginPlay();
	void GenerateBullet();
	void CalBulletLocation__Rotation();
	void DoClearNiagara();
	void UpdateBuletInfoToNiagara();
	void BulletSpawnEffect(const struct FVector& Pos, const struct FVector& Rot);
	void OnCalcBulletLocAndRot();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BulletScreen_410602_C">();
	}
	static class ABulletScreen_410602_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABulletScreen_410602_C>();
	}
};
static_assert(alignof(ABulletScreen_410602_C) == 0x000010, "Wrong alignment on ABulletScreen_410602_C");
static_assert(sizeof(ABulletScreen_410602_C) == 0x000690, "Wrong size on ABulletScreen_410602_C");
static_assert(offsetof(ABulletScreen_410602_C, UberGraphFrame_BulletScreen_410602_C) == 0x000608, "Member 'ABulletScreen_410602_C::UberGraphFrame_BulletScreen_410602_C' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410602_C, Scene01) == 0x000610, "Member 'ABulletScreen_410602_C::Scene01' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410602_C, DefaultLocation) == 0x000618, "Member 'ABulletScreen_410602_C::DefaultLocation' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410602_C, DefaultScale) == 0x000624, "Member 'ABulletScreen_410602_C::DefaultScale' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410602_C, DefaultRotation) == 0x000630, "Member 'ABulletScreen_410602_C::DefaultRotation' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410602_C, GenerateCount) == 0x00063C, "Member 'ABulletScreen_410602_C::GenerateCount' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410602_C, BulletNum) == 0x000640, "Member 'ABulletScreen_410602_C::BulletNum' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410602_C, GenerateLocation) == 0x000644, "Member 'ABulletScreen_410602_C::GenerateLocation' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410602_C, GenerateRotation) == 0x000650, "Member 'ABulletScreen_410602_C::GenerateRotation' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410602_C, BulletArray) == 0x000660, "Member 'ABulletScreen_410602_C::BulletArray' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410602_C, AIControl_Data) == 0x000670, "Member 'ABulletScreen_410602_C::AIControl_Data' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410602_C, TargetActor) == 0x000678, "Member 'ABulletScreen_410602_C::TargetActor' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410602_C, MaxBulletCount) == 0x000680, "Member 'ABulletScreen_410602_C::MaxBulletCount' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410602_C, BulletCompositeId) == 0x000684, "Member 'ABulletScreen_410602_C::BulletCompositeId' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410602_C, BulletHitCompositeId) == 0x000688, "Member 'ABulletScreen_410602_C::BulletHitCompositeId' has a wrong offset!");
static_assert(offsetof(ABulletScreen_410602_C, BulletSpawnEffectCompositeId) == 0x00068C, "Member 'ABulletScreen_410602_C::BulletSpawnEffectCompositeId' has a wrong offset!");

}

