#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletScreen_511704

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BulletScreen_511704.BulletScreen_511704_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BulletScreen_511704_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletScreen_511704_C_ReceiveTick) == 0x000004, "Wrong alignment on BulletScreen_511704_C_ReceiveTick");
static_assert(sizeof(BulletScreen_511704_C_ReceiveTick) == 0x000004, "Wrong size on BulletScreen_511704_C_ReceiveTick");
static_assert(offsetof(BulletScreen_511704_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BulletScreen_511704_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BulletScreen_511704.BulletScreen_511704_C.ExecuteUbergraph_BulletScreen_511704
// 0x0180 (0x0180 - 0x0000)
struct BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable;                                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAICharacter*                       K2Node_DynamicCast_AsGame_AICharacter;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetTargetActor_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0xB];                                       // 0x0065(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	class ABullet*                                CallFunc_SpawnBullet_ReturnValue;                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABullet*                                CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFive11703_C*                           K2Node_DynamicCast_As511703;                       // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB[0x1];                                       // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable_1;                       // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable_1;                 // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable_1;                                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocationFromActor_ReturnValue;   // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704) == 0x000010, "Wrong alignment on BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704");
static_assert(sizeof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704) == 0x000180, "Wrong size on BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, EntryPoint) == 0x000000, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::EntryPoint' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, ___int_Array_Index_Variable) == 0x000004, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_HasAuthority_ReturnValue) == 0x000008, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, ___bool_Has_Been_Initd_Variable) == 0x000009, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_HasAuthority_ReturnValue_1) == 0x00000A, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, ___int_Variable) == 0x000010, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::___int_Variable' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, K2Node_DynamicCast_AsGame_AICharacter) == 0x000028, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::K2Node_DynamicCast_AsGame_AICharacter' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_IsValid_ReturnValue_2) == 0x000031, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_GetTargetActor_ReturnValue) == 0x000038, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_GetTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000040, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_Add_FloatFloat_ReturnValue) == 0x00004C, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000050, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000054, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, ___int_Loop_Counter_Variable) == 0x000058, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_Multiply_IntFloat_ReturnValue) == 0x00005C, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_SpawnBullet_ReturnValue) == 0x0000A0, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_SpawnBullet_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A8, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_Array_Add_ReturnValue) == 0x0000AC, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, K2Node_DynamicCast_As511703) == 0x0000C0, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::K2Node_DynamicCast_As511703' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C9, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, ___bool_IsClosed_Variable) == 0x0000CA, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000CC, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000D0, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, ___bool_IsClosed_Variable_1) == 0x0000D1, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::___bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_GetOwner_ReturnValue_1) == 0x0000D8, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0000E0, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_BreakRotator_Roll) == 0x0000EC, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_BreakRotator_Pitch) == 0x0000F0, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_BreakRotator_Yaw) == 0x0000F4, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, ___bool_Has_Been_Initd_Variable_1) == 0x0000F8, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::___bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0000FC, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000100, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, ___int_Variable_1) == 0x000104, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::___int_Variable_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_MakeRotator_ReturnValue) == 0x000108, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_BreakRotator_Roll_1) == 0x000114, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_BreakRotator_Pitch_1) == 0x000118, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_BreakRotator_Yaw_1) == 0x00011C, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x000120, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_Add_FloatFloat_ReturnValue_4) == 0x000124, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_Add_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_MakeRotator_ReturnValue_1) == 0x000128, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_GetOwner_ReturnValue_2) == 0x000138, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_GetForwardVector_ReturnValue) == 0x000140, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_GetSocketLocationFromActor_ReturnValue) == 0x00014C, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_GetSocketLocationFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000158, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_Add_VectorVector_ReturnValue) == 0x000164, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_Multiply_IntInt_ReturnValue) == 0x000170, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000174, "Member 'BulletScreen_511704_C_ExecuteUbergraph_BulletScreen_511704::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");

// Function BulletScreen_511704.BulletScreen_511704_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BulletScreen_511704_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BulletScreen_511704_C_GetModuleName) == 0x000008, "Wrong alignment on BulletScreen_511704_C_GetModuleName");
static_assert(sizeof(BulletScreen_511704_C_GetModuleName) == 0x000010, "Wrong size on BulletScreen_511704_C_GetModuleName");
static_assert(offsetof(BulletScreen_511704_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BulletScreen_511704_C_GetModuleName::ReturnValue' has a wrong offset!");

}

