#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletScreen_511702

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BulletScreen_511702.BulletScreen_511702_C
// 0x00B0 (0x0690 - 0x05E0)
class ABulletScreen_511702_C final : public ABulletScreenReplicateEditor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Scene01;                                           // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x05F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DefaultLocation;                                   // 0x05F8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DefaultRotation;                                   // 0x0604(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                DefaultScale;                                      // 0x0610(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CircleCount;                                       // 0x061C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CircleNum;                                         // 0x0620(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BulletNumPerSector;                                // 0x0624(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SectorCount;                                       // 0x0628(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SectorNumPerCircle2;                               // 0x062C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SectorCount2;                                      // 0x0630(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SingleSectorAngle;                                 // 0x0634(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EverySectorRotateAngle;                            // 0x0638(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EveryCircleRotateAngle;                            // 0x063C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GenerateLocation;                                  // 0x0640(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               GenerateRotation;                                  // 0x064C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<class ABullet*>                        BulletArray;                                       // 0x0658(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          GB2;                                               // 0x0668(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_669[0x3];                                      // 0x0669(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Speed;                                             // 0x066C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Acceleration;                                      // 0x0670(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_674[0x4];                                      // 0x0674(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TargetActor;                                       // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ASix20504_1_C*>                  Bullets;                                           // 0x0680(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BulletScreen_511702(int32 EntryPoint);
	void GenerateBullet();
	void CalBulletLocation__Rotation();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BulletScreen_511702_C">();
	}
	static class ABulletScreen_511702_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABulletScreen_511702_C>();
	}
};
static_assert(alignof(ABulletScreen_511702_C) == 0x000010, "Wrong alignment on ABulletScreen_511702_C");
static_assert(sizeof(ABulletScreen_511702_C) == 0x000690, "Wrong size on ABulletScreen_511702_C");
static_assert(offsetof(ABulletScreen_511702_C, UberGraphFrame) == 0x0005E0, "Member 'ABulletScreen_511702_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511702_C, Scene01) == 0x0005E8, "Member 'ABulletScreen_511702_C::Scene01' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511702_C, DefaultSceneRoot) == 0x0005F0, "Member 'ABulletScreen_511702_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511702_C, DefaultLocation) == 0x0005F8, "Member 'ABulletScreen_511702_C::DefaultLocation' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511702_C, DefaultRotation) == 0x000604, "Member 'ABulletScreen_511702_C::DefaultRotation' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511702_C, DefaultScale) == 0x000610, "Member 'ABulletScreen_511702_C::DefaultScale' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511702_C, CircleCount) == 0x00061C, "Member 'ABulletScreen_511702_C::CircleCount' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511702_C, CircleNum) == 0x000620, "Member 'ABulletScreen_511702_C::CircleNum' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511702_C, BulletNumPerSector) == 0x000624, "Member 'ABulletScreen_511702_C::BulletNumPerSector' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511702_C, SectorCount) == 0x000628, "Member 'ABulletScreen_511702_C::SectorCount' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511702_C, SectorNumPerCircle2) == 0x00062C, "Member 'ABulletScreen_511702_C::SectorNumPerCircle2' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511702_C, SectorCount2) == 0x000630, "Member 'ABulletScreen_511702_C::SectorCount2' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511702_C, SingleSectorAngle) == 0x000634, "Member 'ABulletScreen_511702_C::SingleSectorAngle' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511702_C, EverySectorRotateAngle) == 0x000638, "Member 'ABulletScreen_511702_C::EverySectorRotateAngle' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511702_C, EveryCircleRotateAngle) == 0x00063C, "Member 'ABulletScreen_511702_C::EveryCircleRotateAngle' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511702_C, GenerateLocation) == 0x000640, "Member 'ABulletScreen_511702_C::GenerateLocation' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511702_C, GenerateRotation) == 0x00064C, "Member 'ABulletScreen_511702_C::GenerateRotation' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511702_C, BulletArray) == 0x000658, "Member 'ABulletScreen_511702_C::BulletArray' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511702_C, GB2) == 0x000668, "Member 'ABulletScreen_511702_C::GB2' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511702_C, Speed) == 0x00066C, "Member 'ABulletScreen_511702_C::Speed' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511702_C, Acceleration) == 0x000670, "Member 'ABulletScreen_511702_C::Acceleration' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511702_C, TargetActor) == 0x000678, "Member 'ABulletScreen_511702_C::TargetActor' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511702_C, Bullets) == 0x000680, "Member 'ABulletScreen_511702_C::Bullets' has a wrong offset!");

}

