#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bullet_Girl015_Skill03

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bullet_Girl015_Skill03.Bullet_Girl015_Skill03_C
// 0x0050 (0x0A20 - 0x09D0)
class ABullet_Girl015_Skill03_C final : public ABullet
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAbilityCollision_Sphere*               SearchForTarget;                                   // 0x09D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          HomingTargetTurn;                                  // 0x09E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          FindTargetTurn;                                    // 0x09E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E2[0x2];                                      // 0x09E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TargetLocation;                                    // 0x09E4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x09F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Trap;                                              // 0x09F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNiagaraSpawn;                                    // 0x0A00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsTargetFound;                                     // 0x0A01(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A02[0x2];                                      // 0x0A02(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinValue;                                          // 0x0A04(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MinIndex;                                          // 0x0A08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FoundTargetFinshed;                                // 0x0A0C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A0D[0x3];                                      // 0x0A0D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ArrowNum;                                          // 0x0A10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LaunchPointRadius;                                 // 0x0A14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageCount;                                       // 0x0A18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBulletFire();
	void OnSpawn();
	void SpawnNiagata();
	void SearchForNearestTargetInArea(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void SetNiagaraLocation(const struct FVector& Location);
	void __p_____();
	void __J_____();
	void OnRecycle();
	void CastSkillLoop();
	void ExecuteUbergraph_Bullet_Girl015_Skill03(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bullet_Girl015_Skill03_C">();
	}
	static class ABullet_Girl015_Skill03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABullet_Girl015_Skill03_C>();
	}
};
static_assert(alignof(ABullet_Girl015_Skill03_C) == 0x000010, "Wrong alignment on ABullet_Girl015_Skill03_C");
static_assert(sizeof(ABullet_Girl015_Skill03_C) == 0x000A20, "Wrong size on ABullet_Girl015_Skill03_C");
static_assert(offsetof(ABullet_Girl015_Skill03_C, UberGraphFrame) == 0x0009D0, "Member 'ABullet_Girl015_Skill03_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABullet_Girl015_Skill03_C, SearchForTarget) == 0x0009D8, "Member 'ABullet_Girl015_Skill03_C::SearchForTarget' has a wrong offset!");
static_assert(offsetof(ABullet_Girl015_Skill03_C, HomingTargetTurn) == 0x0009E0, "Member 'ABullet_Girl015_Skill03_C::HomingTargetTurn' has a wrong offset!");
static_assert(offsetof(ABullet_Girl015_Skill03_C, FindTargetTurn) == 0x0009E1, "Member 'ABullet_Girl015_Skill03_C::FindTargetTurn' has a wrong offset!");
static_assert(offsetof(ABullet_Girl015_Skill03_C, TargetLocation) == 0x0009E4, "Member 'ABullet_Girl015_Skill03_C::TargetLocation' has a wrong offset!");
static_assert(offsetof(ABullet_Girl015_Skill03_C, TargetActor) == 0x0009F0, "Member 'ABullet_Girl015_Skill03_C::TargetActor' has a wrong offset!");
static_assert(offsetof(ABullet_Girl015_Skill03_C, Trap) == 0x0009F8, "Member 'ABullet_Girl015_Skill03_C::Trap' has a wrong offset!");
static_assert(offsetof(ABullet_Girl015_Skill03_C, IsNiagaraSpawn) == 0x000A00, "Member 'ABullet_Girl015_Skill03_C::IsNiagaraSpawn' has a wrong offset!");
static_assert(offsetof(ABullet_Girl015_Skill03_C, IsTargetFound) == 0x000A01, "Member 'ABullet_Girl015_Skill03_C::IsTargetFound' has a wrong offset!");
static_assert(offsetof(ABullet_Girl015_Skill03_C, MinValue) == 0x000A04, "Member 'ABullet_Girl015_Skill03_C::MinValue' has a wrong offset!");
static_assert(offsetof(ABullet_Girl015_Skill03_C, MinIndex) == 0x000A08, "Member 'ABullet_Girl015_Skill03_C::MinIndex' has a wrong offset!");
static_assert(offsetof(ABullet_Girl015_Skill03_C, FoundTargetFinshed) == 0x000A0C, "Member 'ABullet_Girl015_Skill03_C::FoundTargetFinshed' has a wrong offset!");
static_assert(offsetof(ABullet_Girl015_Skill03_C, ArrowNum) == 0x000A10, "Member 'ABullet_Girl015_Skill03_C::ArrowNum' has a wrong offset!");
static_assert(offsetof(ABullet_Girl015_Skill03_C, LaunchPointRadius) == 0x000A14, "Member 'ABullet_Girl015_Skill03_C::LaunchPointRadius' has a wrong offset!");
static_assert(offsetof(ABullet_Girl015_Skill03_C, DamageCount) == 0x000A18, "Member 'ABullet_Girl015_Skill03_C::DamageCount' has a wrong offset!");

}

