#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletScreen_511001

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BulletScreen_511001.BulletScreen_511001_C
// 0x00A0 (0x0440 - 0x03A0)
class ABulletScreen_511001_C final : public ABulletScreenEditor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Point03;                                           // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Point02;                                           // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Point01;                                           // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene01;                                           // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DefaultLocation;                                   // 0x03D0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DefaultScale;                                      // 0x03DC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DefaultRotation;                                   // 0x03E8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         GenerateCount;                                     // 0x03F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BulletNum;                                         // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GenerateLocation;                                  // 0x03FC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               GenerateRotation;                                  // 0x0408(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABullet*>                        BulletArray;                                       // 0x0418(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UAIControlDataComponent*                AIControl_Data;                                    // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BulletScreen_511001(int32 EntryPoint);
	void CalBulletLocation__Rotation();
	void GenerateBullet();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BulletScreen_511001_C">();
	}
	static class ABulletScreen_511001_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABulletScreen_511001_C>();
	}
};
static_assert(alignof(ABulletScreen_511001_C) == 0x000010, "Wrong alignment on ABulletScreen_511001_C");
static_assert(sizeof(ABulletScreen_511001_C) == 0x000440, "Wrong size on ABulletScreen_511001_C");
static_assert(offsetof(ABulletScreen_511001_C, UberGraphFrame) == 0x0003A0, "Member 'ABulletScreen_511001_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511001_C, Point03) == 0x0003A8, "Member 'ABulletScreen_511001_C::Point03' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511001_C, Point02) == 0x0003B0, "Member 'ABulletScreen_511001_C::Point02' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511001_C, Point01) == 0x0003B8, "Member 'ABulletScreen_511001_C::Point01' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511001_C, Scene01) == 0x0003C0, "Member 'ABulletScreen_511001_C::Scene01' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511001_C, DefaultSceneRoot) == 0x0003C8, "Member 'ABulletScreen_511001_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511001_C, DefaultLocation) == 0x0003D0, "Member 'ABulletScreen_511001_C::DefaultLocation' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511001_C, DefaultScale) == 0x0003DC, "Member 'ABulletScreen_511001_C::DefaultScale' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511001_C, DefaultRotation) == 0x0003E8, "Member 'ABulletScreen_511001_C::DefaultRotation' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511001_C, GenerateCount) == 0x0003F4, "Member 'ABulletScreen_511001_C::GenerateCount' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511001_C, BulletNum) == 0x0003F8, "Member 'ABulletScreen_511001_C::BulletNum' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511001_C, GenerateLocation) == 0x0003FC, "Member 'ABulletScreen_511001_C::GenerateLocation' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511001_C, GenerateRotation) == 0x000408, "Member 'ABulletScreen_511001_C::GenerateRotation' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511001_C, BulletArray) == 0x000418, "Member 'ABulletScreen_511001_C::BulletArray' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511001_C, AIControl_Data) == 0x000428, "Member 'ABulletScreen_511001_C::AIControl_Data' has a wrong offset!");
static_assert(offsetof(ABulletScreen_511001_C, TargetActor) == 0x000430, "Member 'ABulletScreen_511001_C::TargetActor' has a wrong offset!");

}

