#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bullet_Girl006_Skill01_012

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Bullet_Girl006_Skill01_012.Bullet_Girl006_Skill01_012_C.ExecuteUbergraph_Bullet_Girl006_Skill01_012
// 0x0058 (0x0058 - 0x0000)
struct Bullet_Girl006_Skill01_012_C_ExecuteUbergraph_Bullet_Girl006_Skill01_012 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCacheTarget_OutTargetLoc;              // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCacheTarget_OutHomingSocket;           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetCacheTarget_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABullet*                                CallFunc_GetParentBullet_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bullet_Girl006_Skill01_012_C_ExecuteUbergraph_Bullet_Girl006_Skill01_012) == 0x000008, "Wrong alignment on Bullet_Girl006_Skill01_012_C_ExecuteUbergraph_Bullet_Girl006_Skill01_012");
static_assert(sizeof(Bullet_Girl006_Skill01_012_C_ExecuteUbergraph_Bullet_Girl006_Skill01_012) == 0x000058, "Wrong size on Bullet_Girl006_Skill01_012_C_ExecuteUbergraph_Bullet_Girl006_Skill01_012");
static_assert(offsetof(Bullet_Girl006_Skill01_012_C_ExecuteUbergraph_Bullet_Girl006_Skill01_012, EntryPoint) == 0x000000, "Member 'Bullet_Girl006_Skill01_012_C_ExecuteUbergraph_Bullet_Girl006_Skill01_012::EntryPoint' has a wrong offset!");
static_assert(offsetof(Bullet_Girl006_Skill01_012_C_ExecuteUbergraph_Bullet_Girl006_Skill01_012, CallFunc_GetCacheTarget_OutTargetLoc) == 0x000004, "Member 'Bullet_Girl006_Skill01_012_C_ExecuteUbergraph_Bullet_Girl006_Skill01_012::CallFunc_GetCacheTarget_OutTargetLoc' has a wrong offset!");
static_assert(offsetof(Bullet_Girl006_Skill01_012_C_ExecuteUbergraph_Bullet_Girl006_Skill01_012, CallFunc_GetCacheTarget_OutHomingSocket) == 0x000010, "Member 'Bullet_Girl006_Skill01_012_C_ExecuteUbergraph_Bullet_Girl006_Skill01_012::CallFunc_GetCacheTarget_OutHomingSocket' has a wrong offset!");
static_assert(offsetof(Bullet_Girl006_Skill01_012_C_ExecuteUbergraph_Bullet_Girl006_Skill01_012, CallFunc_GetCacheTarget_ReturnValue) == 0x000020, "Member 'Bullet_Girl006_Skill01_012_C_ExecuteUbergraph_Bullet_Girl006_Skill01_012::CallFunc_GetCacheTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl006_Skill01_012_C_ExecuteUbergraph_Bullet_Girl006_Skill01_012, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'Bullet_Girl006_Skill01_012_C_ExecuteUbergraph_Bullet_Girl006_Skill01_012::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl006_Skill01_012_C_ExecuteUbergraph_Bullet_Girl006_Skill01_012, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'Bullet_Girl006_Skill01_012_C_ExecuteUbergraph_Bullet_Girl006_Skill01_012::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl006_Skill01_012_C_ExecuteUbergraph_Bullet_Girl006_Skill01_012, CallFunc_Add_VectorVector_ReturnValue) == 0x000038, "Member 'Bullet_Girl006_Skill01_012_C_ExecuteUbergraph_Bullet_Girl006_Skill01_012::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl006_Skill01_012_C_ExecuteUbergraph_Bullet_Girl006_Skill01_012, CallFunc_MakeRotator_ReturnValue) == 0x000044, "Member 'Bullet_Girl006_Skill01_012_C_ExecuteUbergraph_Bullet_Girl006_Skill01_012::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bullet_Girl006_Skill01_012_C_ExecuteUbergraph_Bullet_Girl006_Skill01_012, CallFunc_GetParentBullet_ReturnValue) == 0x000050, "Member 'Bullet_Girl006_Skill01_012_C_ExecuteUbergraph_Bullet_Girl006_Skill01_012::CallFunc_GetParentBullet_ReturnValue' has a wrong offset!");

}

