#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletScreen_410205

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BulletScreen_410205.BulletScreen_410205_C.ExecuteUbergraph_BulletScreen_410205
// 0x01B0 (0x01B0 - 0x0000)
struct BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         ___int_Variable;                                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemManager*                 CallFunc_GetPtr_ReturnValue;                       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable_1;                                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0090(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SpawnCompositeAtLocation_ReturnValue;     // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EB[0x1];                                       // 0x00EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable_1;                 // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponent*                      K2Node_DynamicCast_AsAbility_Component;            // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAICharacter*                       K2Node_DynamicCast_AsGame_AICharacter;             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable_1;                       // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetTargetActor_ReturnValue;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0170(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_SpawnClusterBullet_ReturnValue;           // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205) == 0x000010, "Wrong alignment on BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205");
static_assert(sizeof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205) == 0x0001B0, "Wrong size on BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, EntryPoint) == 0x000000, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::EntryPoint' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_K2_GetPawn_ReturnValue) == 0x000008, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000014, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_FindLookAtRotation_ReturnValue) == 0x000020, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_BreakRotator_Roll) == 0x00002C, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_BreakRotator_Pitch) == 0x000030, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_BreakRotator_Yaw) == 0x000034, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000038, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00003C, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_GetSocketRotation_ReturnValue) == 0x000040, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_GetSocketRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00004C, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_Lerp_ReturnValue) == 0x000050, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_GetSocketLocation_ReturnValue) == 0x000054, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_Add_FloatFloat_ReturnValue) == 0x000060, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_MakeRotator_ReturnValue) == 0x000064, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, ___int_Variable) == 0x000070, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::___int_Variable' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, K2Node_Event_DeltaSeconds) == 0x000074, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_Multiply_IntInt_ReturnValue) == 0x00007C, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_GetPtr_ReturnValue) == 0x000080, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_GetPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, ___int_Variable_1) == 0x000088, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::___int_Variable_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00008C, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_GetTransform_ReturnValue) == 0x000090, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_BreakTransform_Location) == 0x0000C0, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_BreakTransform_Rotation) == 0x0000CC, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_BreakTransform_Scale) == 0x0000D8, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_SpawnCompositeAtLocation_ReturnValue) == 0x0000E4, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_SpawnCompositeAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000E8, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, ___bool_Has_Been_Initd_Variable) == 0x0000E9, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, ___bool_IsClosed_Variable) == 0x0000EA, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_Add_IntInt_ReturnValue) == 0x0000EC, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, ___bool_Has_Been_Initd_Variable_1) == 0x0000F0, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::___bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000F4, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_IsValid_ReturnValue_1) == 0x0000F8, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, K2Node_DynamicCast_AsAbility_Component) == 0x000100, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::K2Node_DynamicCast_AsAbility_Component' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_GetOwner_ReturnValue) == 0x000110, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_IsValid_ReturnValue_2) == 0x000118, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, K2Node_DynamicCast_AsGame_AICharacter) == 0x000120, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::K2Node_DynamicCast_AsGame_AICharacter' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, K2Node_DynamicCast_bSuccess_1) == 0x000128, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, ___bool_IsClosed_Variable_1) == 0x000129, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::___bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_IsValid_ReturnValue_3) == 0x00012A, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_GetTargetActor_ReturnValue) == 0x000130, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_GetTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_IsValid_ReturnValue_4) == 0x000138, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_GetInstigatorController_ReturnValue) == 0x000140, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_IsValid_ReturnValue_5) == 0x000148, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_HasAuthority_ReturnValue) == 0x000149, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_GetForwardVector_ReturnValue) == 0x00014C, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000158, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_Add_VectorVector_ReturnValue) == 0x000164, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_MakeTransform_ReturnValue) == 0x000170, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205, CallFunc_SpawnClusterBullet_ReturnValue) == 0x0001A0, "Member 'BulletScreen_410205_C_ExecuteUbergraph_BulletScreen_410205::CallFunc_SpawnClusterBullet_ReturnValue' has a wrong offset!");

// Function BulletScreen_410205.BulletScreen_410205_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BulletScreen_410205_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletScreen_410205_C_ReceiveTick) == 0x000004, "Wrong alignment on BulletScreen_410205_C_ReceiveTick");
static_assert(sizeof(BulletScreen_410205_C_ReceiveTick) == 0x000004, "Wrong size on BulletScreen_410205_C_ReceiveTick");
static_assert(offsetof(BulletScreen_410205_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BulletScreen_410205_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BulletScreen_410205.BulletScreen_410205_C.GetTargetLocation
// 0x0070 (0x0070 - 0x0000)
struct BulletScreen_410205_C_GetTargetLocation final
{
public:
	struct FVector                                Loc;                                               // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletScreen_410205_C_GetTargetLocation) == 0x000008, "Wrong alignment on BulletScreen_410205_C_GetTargetLocation");
static_assert(sizeof(BulletScreen_410205_C_GetTargetLocation) == 0x000070, "Wrong size on BulletScreen_410205_C_GetTargetLocation");
static_assert(offsetof(BulletScreen_410205_C_GetTargetLocation, Loc) == 0x000000, "Member 'BulletScreen_410205_C_GetTargetLocation::Loc' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_GetTargetLocation, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'BulletScreen_410205_C_GetTargetLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_GetTargetLocation, CallFunc_GetActorForwardVector_ReturnValue) == 0x000010, "Member 'BulletScreen_410205_C_GetTargetLocation::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_GetTargetLocation, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00001C, "Member 'BulletScreen_410205_C_GetTargetLocation::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_GetTargetLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'BulletScreen_410205_C_GetTargetLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_GetTargetLocation, CallFunc_K2_GetPawn_ReturnValue) == 0x000038, "Member 'BulletScreen_410205_C_GetTargetLocation::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_GetTargetLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x000040, "Member 'BulletScreen_410205_C_GetTargetLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_GetTargetLocation, CallFunc_IsValid_ReturnValue_1) == 0x00004C, "Member 'BulletScreen_410205_C_GetTargetLocation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_GetTargetLocation, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000050, "Member 'BulletScreen_410205_C_GetTargetLocation::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_GetTargetLocation, CallFunc_IsValid_ReturnValue_2) == 0x00005C, "Member 'BulletScreen_410205_C_GetTargetLocation::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_GetTargetLocation, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000060, "Member 'BulletScreen_410205_C_GetTargetLocation::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");

// Function BulletScreen_410205.BulletScreen_410205_C.DoClearNiagara
// 0x0008 (0x0008 - 0x0000)
struct BulletScreen_410205_C_DoClearNiagara final
{
public:
	class UParticleSystemManager*                 CallFunc_GetPtr_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletScreen_410205_C_DoClearNiagara) == 0x000008, "Wrong alignment on BulletScreen_410205_C_DoClearNiagara");
static_assert(sizeof(BulletScreen_410205_C_DoClearNiagara) == 0x000008, "Wrong size on BulletScreen_410205_C_DoClearNiagara");
static_assert(offsetof(BulletScreen_410205_C_DoClearNiagara, CallFunc_GetPtr_ReturnValue) == 0x000000, "Member 'BulletScreen_410205_C_DoClearNiagara::CallFunc_GetPtr_ReturnValue' has a wrong offset!");

// Function BulletScreen_410205.BulletScreen_410205_C.UpdateBuletInfoToNiagara
// 0x0008 (0x0008 - 0x0000)
struct BulletScreen_410205_C_UpdateBuletInfoToNiagara final
{
public:
	class UParticleSystemManager*                 CallFunc_GetPtr_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletScreen_410205_C_UpdateBuletInfoToNiagara) == 0x000008, "Wrong alignment on BulletScreen_410205_C_UpdateBuletInfoToNiagara");
static_assert(sizeof(BulletScreen_410205_C_UpdateBuletInfoToNiagara) == 0x000008, "Wrong size on BulletScreen_410205_C_UpdateBuletInfoToNiagara");
static_assert(offsetof(BulletScreen_410205_C_UpdateBuletInfoToNiagara, CallFunc_GetPtr_ReturnValue) == 0x000000, "Member 'BulletScreen_410205_C_UpdateBuletInfoToNiagara::CallFunc_GetPtr_ReturnValue' has a wrong offset!");

// Function BulletScreen_410205.BulletScreen_410205_C.BulletSpawnEffect
// 0x0028 (0x0028 - 0x0000)
struct BulletScreen_410205_C_BulletSpawnEffect final
{
public:
	struct FVector                                Pos;                                               // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Rot;                                               // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemManager*                 CallFunc_GetPtr_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompositeAtLocation_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletScreen_410205_C_BulletSpawnEffect) == 0x000008, "Wrong alignment on BulletScreen_410205_C_BulletSpawnEffect");
static_assert(sizeof(BulletScreen_410205_C_BulletSpawnEffect) == 0x000028, "Wrong size on BulletScreen_410205_C_BulletSpawnEffect");
static_assert(offsetof(BulletScreen_410205_C_BulletSpawnEffect, Pos) == 0x000000, "Member 'BulletScreen_410205_C_BulletSpawnEffect::Pos' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_BulletSpawnEffect, Rot) == 0x00000C, "Member 'BulletScreen_410205_C_BulletSpawnEffect::Rot' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_BulletSpawnEffect, CallFunc_GetPtr_ReturnValue) == 0x000018, "Member 'BulletScreen_410205_C_BulletSpawnEffect::CallFunc_GetPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_410205_C_BulletSpawnEffect, CallFunc_CompositeAtLocation_ReturnValue) == 0x000020, "Member 'BulletScreen_410205_C_BulletSpawnEffect::CallFunc_CompositeAtLocation_ReturnValue' has a wrong offset!");

// Function BulletScreen_410205.BulletScreen_410205_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BulletScreen_410205_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BulletScreen_410205_C_GetModuleName) == 0x000008, "Wrong alignment on BulletScreen_410205_C_GetModuleName");
static_assert(sizeof(BulletScreen_410205_C_GetModuleName) == 0x000010, "Wrong size on BulletScreen_410205_C_GetModuleName");
static_assert(offsetof(BulletScreen_410205_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BulletScreen_410205_C_GetModuleName::ReturnValue' has a wrong offset!");

}

