#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletRecover

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// LuaFunction BulletRecover.BulletRecover_C.K2_ReceiveDeActive
// 0x0008 (0x0008 - 0x0000)
struct BulletRecover_C_K2_ReceiveDeActive final
{
public:
	const class UGameAbilityComponent*            Pawn;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletRecover_C_K2_ReceiveDeActive;

// LuaFunction BulletRecover.BulletRecover_C.K2_ReceiveActive
// 0x0008 (0x0008 - 0x0000)
struct BulletRecover_C_K2_ReceiveActive final
{
public:
	const class UObject*                          Instigator;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletRecover_C_K2_ReceiveActive;

// LuaFunction BulletRecover.BulletRecover_C.K2_RecoverAttribute
// 0x0010 (0x0010 - 0x0000)
struct BulletRecover_C_K2_RecoverAttribute final
{
public:
	class UAbilityComponentBase*                  InAbility;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InValue;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletRecover_C_K2_RecoverAttribute;

// Function BulletRecover.BulletRecover_C.ExecuteUbergraph_BulletRecover
// 0x0058 (0x0058 - 0x0000)
struct BulletRecover_C_ExecuteUbergraph_BulletRecover final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBulletRecoverTemplate                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0048)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BulletRecover_C_ExecuteUbergraph_BulletRecover;

// Function BulletRecover.BulletRecover_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BulletRecover_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BulletRecover_C_GetModuleName;

}

