#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletExtraCritical

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BulletExtraCritical.BulletExtraCritical_C.K2_ReceiveInitialize
// 0x0010 (0x0010 - 0x0000)
struct BulletExtraCritical_C_K2_ReceiveInitialize final
{
public:
	TArray<struct FParamInfo>                     Info;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BulletExtraCritical_C_K2_ReceiveInitialize) == 0x000008, "Wrong alignment on BulletExtraCritical_C_K2_ReceiveInitialize");
static_assert(sizeof(BulletExtraCritical_C_K2_ReceiveInitialize) == 0x000010, "Wrong size on BulletExtraCritical_C_K2_ReceiveInitialize");
static_assert(offsetof(BulletExtraCritical_C_K2_ReceiveInitialize, Info) == 0x000000, "Member 'BulletExtraCritical_C_K2_ReceiveInitialize::Info' has a wrong offset!");

// Function BulletExtraCritical.BulletExtraCritical_C.ExecuteUbergraph_BulletExtraCritical
// 0x0028 (0x0028 - 0x0000)
struct BulletExtraCritical_C_ExecuteUbergraph_BulletExtraCritical final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParamInfo>                     K2Node_Event_Info;                                 // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValueStringForLevel_ReturnValue;  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletExtraCritical_C_ExecuteUbergraph_BulletExtraCritical) == 0x000008, "Wrong alignment on BulletExtraCritical_C_ExecuteUbergraph_BulletExtraCritical");
static_assert(sizeof(BulletExtraCritical_C_ExecuteUbergraph_BulletExtraCritical) == 0x000028, "Wrong size on BulletExtraCritical_C_ExecuteUbergraph_BulletExtraCritical");
static_assert(offsetof(BulletExtraCritical_C_ExecuteUbergraph_BulletExtraCritical, EntryPoint) == 0x000000, "Member 'BulletExtraCritical_C_ExecuteUbergraph_BulletExtraCritical::EntryPoint' has a wrong offset!");
static_assert(offsetof(BulletExtraCritical_C_ExecuteUbergraph_BulletExtraCritical, K2Node_Event_Info) == 0x000008, "Member 'BulletExtraCritical_C_ExecuteUbergraph_BulletExtraCritical::K2Node_Event_Info' has a wrong offset!");
static_assert(offsetof(BulletExtraCritical_C_ExecuteUbergraph_BulletExtraCritical, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BulletExtraCritical_C_ExecuteUbergraph_BulletExtraCritical::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletExtraCritical_C_ExecuteUbergraph_BulletExtraCritical, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'BulletExtraCritical_C_ExecuteUbergraph_BulletExtraCritical::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletExtraCritical_C_ExecuteUbergraph_BulletExtraCritical, CallFunc_GetFloatValueStringForLevel_ReturnValue) == 0x000020, "Member 'BulletExtraCritical_C_ExecuteUbergraph_BulletExtraCritical::CallFunc_GetFloatValueStringForLevel_ReturnValue' has a wrong offset!");

// Function BulletExtraCritical.BulletExtraCritical_C.K2_GetBulletExtraCritical
// 0x0010 (0x0010 - 0x0000)
struct BulletExtraCritical_C_K2_GetBulletExtraCritical final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurOverlaid_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletExtraCritical_C_K2_GetBulletExtraCritical) == 0x000004, "Wrong alignment on BulletExtraCritical_C_K2_GetBulletExtraCritical");
static_assert(sizeof(BulletExtraCritical_C_K2_GetBulletExtraCritical) == 0x000010, "Wrong size on BulletExtraCritical_C_K2_GetBulletExtraCritical");
static_assert(offsetof(BulletExtraCritical_C_K2_GetBulletExtraCritical, ReturnValue) == 0x000000, "Member 'BulletExtraCritical_C_K2_GetBulletExtraCritical::ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletExtraCritical_C_K2_GetBulletExtraCritical, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BulletExtraCritical_C_K2_GetBulletExtraCritical::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletExtraCritical_C_K2_GetBulletExtraCritical, CallFunc_GetCurOverlaid_ReturnValue) == 0x000008, "Member 'BulletExtraCritical_C_K2_GetBulletExtraCritical::CallFunc_GetCurOverlaid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletExtraCritical_C_K2_GetBulletExtraCritical, CallFunc_Multiply_IntFloat_ReturnValue) == 0x00000C, "Member 'BulletExtraCritical_C_K2_GetBulletExtraCritical::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");

}

