#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletScreen_400601

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BulletScreen_400601.BulletScreen_400601_C
// 0x0090 (0x0670 - 0x05E0)
class ABulletScreen_400601_C final : public ABulletScreenReplicateEditor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         GenerateCount;                                     // 0x05F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BulletNum;                                         // 0x05F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DefaultLocation;                                   // 0x05F8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DefaultRotation;                                   // 0x0604(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                DefaultScale;                                      // 0x0610(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GenerateLocation;                                  // 0x061C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               GenerateRotation;                                  // 0x0628(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         DiffusionAngle;                                    // 0x0634(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            TargetController;                                  // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameAICharacter*                       OwnerCharacter;                                    // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABullet*>                        BulletArray;                                       // 0x0648(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class AActor*                                 TargetActor;                                       // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOwnerPal;                                        // 0x0660(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void GetTargetLocation(struct FVector* Loc);
	void CalGenrateLocation__Roation();
	void GenerateBullet();
	void ExecuteUbergraph_BulletScreen_400601(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnCalcBulletLocAndRot();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BulletScreen_400601_C">();
	}
	static class ABulletScreen_400601_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABulletScreen_400601_C>();
	}
};
static_assert(alignof(ABulletScreen_400601_C) == 0x000010, "Wrong alignment on ABulletScreen_400601_C");
static_assert(sizeof(ABulletScreen_400601_C) == 0x000670, "Wrong size on ABulletScreen_400601_C");
static_assert(offsetof(ABulletScreen_400601_C, UberGraphFrame) == 0x0005E0, "Member 'ABulletScreen_400601_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABulletScreen_400601_C, DefaultSceneRoot) == 0x0005E8, "Member 'ABulletScreen_400601_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABulletScreen_400601_C, GenerateCount) == 0x0005F0, "Member 'ABulletScreen_400601_C::GenerateCount' has a wrong offset!");
static_assert(offsetof(ABulletScreen_400601_C, BulletNum) == 0x0005F4, "Member 'ABulletScreen_400601_C::BulletNum' has a wrong offset!");
static_assert(offsetof(ABulletScreen_400601_C, DefaultLocation) == 0x0005F8, "Member 'ABulletScreen_400601_C::DefaultLocation' has a wrong offset!");
static_assert(offsetof(ABulletScreen_400601_C, DefaultRotation) == 0x000604, "Member 'ABulletScreen_400601_C::DefaultRotation' has a wrong offset!");
static_assert(offsetof(ABulletScreen_400601_C, DefaultScale) == 0x000610, "Member 'ABulletScreen_400601_C::DefaultScale' has a wrong offset!");
static_assert(offsetof(ABulletScreen_400601_C, GenerateLocation) == 0x00061C, "Member 'ABulletScreen_400601_C::GenerateLocation' has a wrong offset!");
static_assert(offsetof(ABulletScreen_400601_C, GenerateRotation) == 0x000628, "Member 'ABulletScreen_400601_C::GenerateRotation' has a wrong offset!");
static_assert(offsetof(ABulletScreen_400601_C, DiffusionAngle) == 0x000634, "Member 'ABulletScreen_400601_C::DiffusionAngle' has a wrong offset!");
static_assert(offsetof(ABulletScreen_400601_C, TargetController) == 0x000638, "Member 'ABulletScreen_400601_C::TargetController' has a wrong offset!");
static_assert(offsetof(ABulletScreen_400601_C, OwnerCharacter) == 0x000640, "Member 'ABulletScreen_400601_C::OwnerCharacter' has a wrong offset!");
static_assert(offsetof(ABulletScreen_400601_C, BulletArray) == 0x000648, "Member 'ABulletScreen_400601_C::BulletArray' has a wrong offset!");
static_assert(offsetof(ABulletScreen_400601_C, TargetActor) == 0x000658, "Member 'ABulletScreen_400601_C::TargetActor' has a wrong offset!");
static_assert(offsetof(ABulletScreen_400601_C, IsOwnerPal) == 0x000660, "Member 'ABulletScreen_400601_C::IsOwnerPal' has a wrong offset!");

}

