#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletScreen_Girl006a_skill01_34

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BulletScreen_Girl006a_skill01_34.BulletScreen_Girl006a_skill01_34_C
// 0x0030 (0x0610 - 0x05E0)
class ABulletScreen_Girl006a_skill01_34_C : public ABulletScreenReplicateEditor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Scene;                                             // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x05F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         FirstBullet_ID;                                    // 0x05F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NextBullet_ID;                                     // 0x05FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Rougekey;                                          // 0x0600(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_601[0x3];                                      // 0x0601(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Rougetimes;                                        // 0x0604(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Times;                                             // 0x0608(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void Start();
	void ExecuteUbergraph_BulletScreen_Girl006a_skill01_34(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BulletScreen_Girl006a_skill01_34_C">();
	}
	static class ABulletScreen_Girl006a_skill01_34_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABulletScreen_Girl006a_skill01_34_C>();
	}
};
static_assert(alignof(ABulletScreen_Girl006a_skill01_34_C) == 0x000010, "Wrong alignment on ABulletScreen_Girl006a_skill01_34_C");
static_assert(sizeof(ABulletScreen_Girl006a_skill01_34_C) == 0x000610, "Wrong size on ABulletScreen_Girl006a_skill01_34_C");
static_assert(offsetof(ABulletScreen_Girl006a_skill01_34_C, UberGraphFrame) == 0x0005E0, "Member 'ABulletScreen_Girl006a_skill01_34_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABulletScreen_Girl006a_skill01_34_C, Scene) == 0x0005E8, "Member 'ABulletScreen_Girl006a_skill01_34_C::Scene' has a wrong offset!");
static_assert(offsetof(ABulletScreen_Girl006a_skill01_34_C, DefaultSceneRoot) == 0x0005F0, "Member 'ABulletScreen_Girl006a_skill01_34_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABulletScreen_Girl006a_skill01_34_C, FirstBullet_ID) == 0x0005F8, "Member 'ABulletScreen_Girl006a_skill01_34_C::FirstBullet_ID' has a wrong offset!");
static_assert(offsetof(ABulletScreen_Girl006a_skill01_34_C, NextBullet_ID) == 0x0005FC, "Member 'ABulletScreen_Girl006a_skill01_34_C::NextBullet_ID' has a wrong offset!");
static_assert(offsetof(ABulletScreen_Girl006a_skill01_34_C, Rougekey) == 0x000600, "Member 'ABulletScreen_Girl006a_skill01_34_C::Rougekey' has a wrong offset!");
static_assert(offsetof(ABulletScreen_Girl006a_skill01_34_C, Rougetimes) == 0x000604, "Member 'ABulletScreen_Girl006a_skill01_34_C::Rougetimes' has a wrong offset!");
static_assert(offsetof(ABulletScreen_Girl006a_skill01_34_C, Times) == 0x000608, "Member 'ABulletScreen_Girl006a_skill01_34_C::Times' has a wrong offset!");

}

