#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bullet_Girl002a01_Skill01_0

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bullet_Girl002a01_Skill01_0.Bullet_Girl002a01_Skill01_0_C
// 0x0010 (0x0A20 - 0x0A10)
class ABullet_Girl002a01_Skill01_0_C final : public ABullet
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Max;                                               // 0x0A18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Min;                                               // 0x0A1C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBulletFire();
	void ExecuteUbergraph_Bullet_Girl002a01_Skill01_0(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bullet_Girl002a01_Skill01_0_C">();
	}
	static class ABullet_Girl002a01_Skill01_0_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABullet_Girl002a01_Skill01_0_C>();
	}
};
static_assert(alignof(ABullet_Girl002a01_Skill01_0_C) == 0x000010, "Wrong alignment on ABullet_Girl002a01_Skill01_0_C");
static_assert(sizeof(ABullet_Girl002a01_Skill01_0_C) == 0x000A20, "Wrong size on ABullet_Girl002a01_Skill01_0_C");
static_assert(offsetof(ABullet_Girl002a01_Skill01_0_C, UberGraphFrame) == 0x000A10, "Member 'ABullet_Girl002a01_Skill01_0_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABullet_Girl002a01_Skill01_0_C, Max) == 0x000A18, "Member 'ABullet_Girl002a01_Skill01_0_C::Max' has a wrong offset!");
static_assert(offsetof(ABullet_Girl002a01_Skill01_0_C, Min) == 0x000A1C, "Member 'ABullet_Girl002a01_Skill01_0_C::Min' has a wrong offset!");

}

