#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bullet_Girl006_Skill01_011

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bullet_Girl006_Skill01_011.Bullet_Girl006_Skill01_011_C
// 0x0020 (0x0A20 - 0x0A00)
class ABullet_Girl006_Skill01_011_C final : public ABullet
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          NewVar_0;                                          // 0x0A08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NewVar_1;                                          // 0x0A09(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A0A[0x2];                                      // 0x0A0A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitPoint;                                          // 0x0A0C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void __p_0();
	void ReceiveBulletFire();
	void ExecuteUbergraph_Bullet_Girl006_Skill01_011(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bullet_Girl006_Skill01_011_C">();
	}
	static class ABullet_Girl006_Skill01_011_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABullet_Girl006_Skill01_011_C>();
	}
};
static_assert(alignof(ABullet_Girl006_Skill01_011_C) == 0x000010, "Wrong alignment on ABullet_Girl006_Skill01_011_C");
static_assert(sizeof(ABullet_Girl006_Skill01_011_C) == 0x000A20, "Wrong size on ABullet_Girl006_Skill01_011_C");
static_assert(offsetof(ABullet_Girl006_Skill01_011_C, UberGraphFrame) == 0x000A00, "Member 'ABullet_Girl006_Skill01_011_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABullet_Girl006_Skill01_011_C, NewVar_0) == 0x000A08, "Member 'ABullet_Girl006_Skill01_011_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(ABullet_Girl006_Skill01_011_C, NewVar_1) == 0x000A09, "Member 'ABullet_Girl006_Skill01_011_C::NewVar_1' has a wrong offset!");
static_assert(offsetof(ABullet_Girl006_Skill01_011_C, HitPoint) == 0x000A0C, "Member 'ABullet_Girl006_Skill01_011_C::HitPoint' has a wrong offset!");

}

