#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletScreen_400601

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BulletScreen_400601.BulletScreen_400601_C.GetTargetLocation
// 0x0068 (0x0068 - 0x0000)
struct BulletScreen_400601_C_GetTargetLocation final
{
public:
	struct FVector                                Loc;                                               // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletScreen_400601_C_GetTargetLocation) == 0x000008, "Wrong alignment on BulletScreen_400601_C_GetTargetLocation");
static_assert(sizeof(BulletScreen_400601_C_GetTargetLocation) == 0x000068, "Wrong size on BulletScreen_400601_C_GetTargetLocation");
static_assert(offsetof(BulletScreen_400601_C_GetTargetLocation, Loc) == 0x000000, "Member 'BulletScreen_400601_C_GetTargetLocation::Loc' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_GetTargetLocation, CallFunc_GetActorForwardVector_ReturnValue) == 0x00000C, "Member 'BulletScreen_400601_C_GetTargetLocation::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_GetTargetLocation, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BulletScreen_400601_C_GetTargetLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_GetTargetLocation, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00001C, "Member 'BulletScreen_400601_C_GetTargetLocation::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_GetTargetLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'BulletScreen_400601_C_GetTargetLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_GetTargetLocation, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000034, "Member 'BulletScreen_400601_C_GetTargetLocation::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_GetTargetLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x000040, "Member 'BulletScreen_400601_C_GetTargetLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_GetTargetLocation, CallFunc_IsValid_ReturnValue_1) == 0x00004C, "Member 'BulletScreen_400601_C_GetTargetLocation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_GetTargetLocation, CallFunc_K2_GetPawn_ReturnValue) == 0x000050, "Member 'BulletScreen_400601_C_GetTargetLocation::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_GetTargetLocation, CallFunc_IsValid_ReturnValue_2) == 0x000058, "Member 'BulletScreen_400601_C_GetTargetLocation::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_GetTargetLocation, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x00005C, "Member 'BulletScreen_400601_C_GetTargetLocation::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");

// Function BulletScreen_400601.BulletScreen_400601_C.ExecuteUbergraph_BulletScreen_400601
// 0x01D0 (0x01D0 - 0x0000)
struct BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAICharacter*                       K2Node_DynamicCast_AsGame_AICharacter;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetTargetActor_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Variable;                                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSkeletalCenterOfMass_ReturnValue;      // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_SpawnClusterBullet_ReturnValue;           // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_2;                        // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue_3;                        // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_5;             // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_FollowNPC_Base_C*                   K2Node_DynamicCast_AsBP_Follow_NPC_Base;           // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601) == 0x000010, "Wrong alignment on BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601");
static_assert(sizeof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601) == 0x0001D0, "Wrong size on BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, EntryPoint) == 0x000000, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::EntryPoint' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_GetSocketRotation_ReturnValue) == 0x000004, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_GetSocketRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, K2Node_DynamicCast_AsGame_AICharacter) == 0x000020, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::K2Node_DynamicCast_AsGame_AICharacter' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_GetSocketLocation_ReturnValue) == 0x00002C, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_GetTargetActor_ReturnValue) == 0x000040, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_GetTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_IsValid_ReturnValue_2) == 0x000048, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_GetInstigatorController_ReturnValue) == 0x000050, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_IsValid_ReturnValue_3) == 0x000058, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_HasAuthority_ReturnValue) == 0x000059, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_Less_IntInt_ReturnValue) == 0x00005A, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, ___int_Variable) == 0x00005C, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::___int_Variable' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_IsValid_ReturnValue_4) == 0x000060, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_K2_GetPawn_ReturnValue) == 0x000068, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_IsValid_ReturnValue_5) == 0x000070, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_GetComponentByClass_ReturnValue) == 0x000078, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_GetSkeletalCenterOfMass_ReturnValue) == 0x000080, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_GetSkeletalCenterOfMass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00008C, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_SelectVector_ReturnValue) == 0x000098, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000A4, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_BreakRotator_Roll) == 0x0000B0, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_BreakRotator_Pitch) == 0x0000B4, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_BreakRotator_Yaw) == 0x0000B8, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_Abs_ReturnValue) == 0x0000BC, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000C0, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000C4, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_MakeTransform_ReturnValue) == 0x0000D0, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_SpawnClusterBullet_ReturnValue) == 0x000100, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_SpawnClusterBullet_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_Divide_IntInt_ReturnValue) == 0x000104, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000108, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_Greater_IntInt_ReturnValue) == 0x00010C, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_Abs_ReturnValue_1) == 0x000110, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000114, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_Abs_ReturnValue_2) == 0x000118, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_Abs_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00011C, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000120, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_SelectFloat_ReturnValue) == 0x000124, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000128, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_Add_FloatFloat_ReturnValue) == 0x00012C, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_Divide_IntInt_ReturnValue_1) == 0x000130, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_Divide_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000134, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000138, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_Abs_ReturnValue_3) == 0x00013C, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_Abs_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000140, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_HasAuthority_ReturnValue_1) == 0x000144, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000148, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_SelectFloat_ReturnValue_1) == 0x00014C, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000150, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_IsValid_ReturnValue_6) == 0x000154, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_MakeRotator_ReturnValue) == 0x000158, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000164, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_FindLookAtRotation_ReturnValue_1) == 0x000170, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_FindLookAtRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_BreakRotator_Roll_1) == 0x00017C, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_BreakRotator_Pitch_1) == 0x000180, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_BreakRotator_Yaw_1) == 0x000184, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_BreakRotator_Roll_2) == 0x000188, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_BreakRotator_Pitch_2) == 0x00018C, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_BreakRotator_Yaw_2) == 0x000190, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000194, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x000198, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_Add_FloatFloat_ReturnValue_4) == 0x00019C, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_Add_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_Add_FloatFloat_ReturnValue_5) == 0x0001A0, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_Add_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_MakeRotator_ReturnValue_1) == 0x0001A4, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_MakeRotator_ReturnValue_2) == 0x0001B0, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, CallFunc_Add_IntInt_ReturnValue) == 0x0001BC, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, K2Node_DynamicCast_AsBP_Follow_NPC_Base) == 0x0001C0, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::K2Node_DynamicCast_AsBP_Follow_NPC_Base' has a wrong offset!");
static_assert(offsetof(BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601, K2Node_DynamicCast_bSuccess_1) == 0x0001C8, "Member 'BulletScreen_400601_C_ExecuteUbergraph_BulletScreen_400601::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BulletScreen_400601.BulletScreen_400601_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BulletScreen_400601_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BulletScreen_400601_C_GetModuleName) == 0x000008, "Wrong alignment on BulletScreen_400601_C_GetModuleName");
static_assert(sizeof(BulletScreen_400601_C_GetModuleName) == 0x000010, "Wrong size on BulletScreen_400601_C_GetModuleName");
static_assert(offsetof(BulletScreen_400601_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BulletScreen_400601_C_GetModuleName::ReturnValue' has a wrong offset!");

}

