#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletScreen_Girl006a_skill01_12

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BulletScreen_Girl006a_skill01_12.BulletScreen_Girl006a_skill01_12_C.ExecuteUbergraph_BulletScreen_Girl006a_skill01_12
// 0x0100 (0x0100 - 0x0000)
struct BulletScreen_Girl006a_skill01_12_C_ExecuteUbergraph_BulletScreen_Girl006a_skill01_12 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	struct FQueryResult                           CallFunc_Array_Get_Item;                           // 0x0040(0x0090)(ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABullet*                                CallFunc_SpawnBulletAndSetTarget_ReturnValue;      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABullet*                                CallFunc_SpawnBulletAndSetTarget_ReturnValue_1;    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABullet*                                CallFunc_SpawnBulletAndSetTarget_ReturnValue_2;    // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BulletScreen_Girl006a_skill01_12_C_ExecuteUbergraph_BulletScreen_Girl006a_skill01_12) == 0x000010, "Wrong alignment on BulletScreen_Girl006a_skill01_12_C_ExecuteUbergraph_BulletScreen_Girl006a_skill01_12");
static_assert(sizeof(BulletScreen_Girl006a_skill01_12_C_ExecuteUbergraph_BulletScreen_Girl006a_skill01_12) == 0x000100, "Wrong size on BulletScreen_Girl006a_skill01_12_C_ExecuteUbergraph_BulletScreen_Girl006a_skill01_12");
static_assert(offsetof(BulletScreen_Girl006a_skill01_12_C_ExecuteUbergraph_BulletScreen_Girl006a_skill01_12, EntryPoint) == 0x000000, "Member 'BulletScreen_Girl006a_skill01_12_C_ExecuteUbergraph_BulletScreen_Girl006a_skill01_12::EntryPoint' has a wrong offset!");
static_assert(offsetof(BulletScreen_Girl006a_skill01_12_C_ExecuteUbergraph_BulletScreen_Girl006a_skill01_12, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'BulletScreen_Girl006a_skill01_12_C_ExecuteUbergraph_BulletScreen_Girl006a_skill01_12::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_Girl006a_skill01_12_C_ExecuteUbergraph_BulletScreen_Girl006a_skill01_12, CallFunc_Array_Get_Item) == 0x000040, "Member 'BulletScreen_Girl006a_skill01_12_C_ExecuteUbergraph_BulletScreen_Girl006a_skill01_12::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BulletScreen_Girl006a_skill01_12_C_ExecuteUbergraph_BulletScreen_Girl006a_skill01_12, CallFunc_Array_Length_ReturnValue) == 0x0000D0, "Member 'BulletScreen_Girl006a_skill01_12_C_ExecuteUbergraph_BulletScreen_Girl006a_skill01_12::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_Girl006a_skill01_12_C_ExecuteUbergraph_BulletScreen_Girl006a_skill01_12, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D4, "Member 'BulletScreen_Girl006a_skill01_12_C_ExecuteUbergraph_BulletScreen_Girl006a_skill01_12::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_Girl006a_skill01_12_C_ExecuteUbergraph_BulletScreen_Girl006a_skill01_12, CallFunc_SpawnBulletAndSetTarget_ReturnValue) == 0x0000D8, "Member 'BulletScreen_Girl006a_skill01_12_C_ExecuteUbergraph_BulletScreen_Girl006a_skill01_12::CallFunc_SpawnBulletAndSetTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_Girl006a_skill01_12_C_ExecuteUbergraph_BulletScreen_Girl006a_skill01_12, CallFunc_SpawnBulletAndSetTarget_ReturnValue_1) == 0x0000E0, "Member 'BulletScreen_Girl006a_skill01_12_C_ExecuteUbergraph_BulletScreen_Girl006a_skill01_12::CallFunc_SpawnBulletAndSetTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletScreen_Girl006a_skill01_12_C_ExecuteUbergraph_BulletScreen_Girl006a_skill01_12, CallFunc_SpawnBulletAndSetTarget_ReturnValue_2) == 0x0000E8, "Member 'BulletScreen_Girl006a_skill01_12_C_ExecuteUbergraph_BulletScreen_Girl006a_skill01_12::CallFunc_SpawnBulletAndSetTarget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BulletScreen_Girl006a_skill01_12_C_ExecuteUbergraph_BulletScreen_Girl006a_skill01_12, CallFunc_Add_IntInt_ReturnValue) == 0x0000F0, "Member 'BulletScreen_Girl006a_skill01_12_C_ExecuteUbergraph_BulletScreen_Girl006a_skill01_12::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletScreen_Girl006a_skill01_12_C_ExecuteUbergraph_BulletScreen_Girl006a_skill01_12, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000F4, "Member 'BulletScreen_Girl006a_skill01_12_C_ExecuteUbergraph_BulletScreen_Girl006a_skill01_12::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

}

