#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bullet_Girl002a01_Skill01_R4

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Bullet_Girl002a01_Skill01_all_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bullet_Girl002a01_Skill01_R4.Bullet_Girl002a01_Skill01_R4_C
// 0x0020 (0x0A80 - 0x0A60)
class ABullet_Girl002a01_Skill01_R4_C final : public ABullet_Girl002a01_Skill01_all_C
{
public:
	uint8                                         Pad_A55[0x3];                                      // 0x0A55(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_Bullet_Girl002a01_Skill01_R4_C;     // 0x0A58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          HasFire_0;                                         // 0x0A60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A61[0x7];                                      // 0x0A61(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Targets_0;                                         // 0x0A68(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         RandomMin;                                         // 0x0A78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomMax;                                         // 0x0A7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBulletFire();
	void ExecuteUbergraph_Bullet_Girl002a01_Skill01_R4(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bullet_Girl002a01_Skill01_R4_C">();
	}
	static class ABullet_Girl002a01_Skill01_R4_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABullet_Girl002a01_Skill01_R4_C>();
	}
};
static_assert(alignof(ABullet_Girl002a01_Skill01_R4_C) == 0x000010, "Wrong alignment on ABullet_Girl002a01_Skill01_R4_C");
static_assert(sizeof(ABullet_Girl002a01_Skill01_R4_C) == 0x000A80, "Wrong size on ABullet_Girl002a01_Skill01_R4_C");
static_assert(offsetof(ABullet_Girl002a01_Skill01_R4_C, UberGraphFrame_Bullet_Girl002a01_Skill01_R4_C) == 0x000A58, "Member 'ABullet_Girl002a01_Skill01_R4_C::UberGraphFrame_Bullet_Girl002a01_Skill01_R4_C' has a wrong offset!");
static_assert(offsetof(ABullet_Girl002a01_Skill01_R4_C, HasFire_0) == 0x000A60, "Member 'ABullet_Girl002a01_Skill01_R4_C::HasFire_0' has a wrong offset!");
static_assert(offsetof(ABullet_Girl002a01_Skill01_R4_C, Targets_0) == 0x000A68, "Member 'ABullet_Girl002a01_Skill01_R4_C::Targets_0' has a wrong offset!");
static_assert(offsetof(ABullet_Girl002a01_Skill01_R4_C, RandomMin) == 0x000A78, "Member 'ABullet_Girl002a01_Skill01_R4_C::RandomMin' has a wrong offset!");
static_assert(offsetof(ABullet_Girl002a01_Skill01_R4_C, RandomMax) == 0x000A7C, "Member 'ABullet_Girl002a01_Skill01_R4_C::RandomMax' has a wrong offset!");

}

