#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraBlueprint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AnimationCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum CameraBlueprint.ECameraAlphaInputType
// NumValues: 0x0003
enum class ECameraAlphaInputType : uint8
{
	Float                                    = 0,
	Bool                                     = 1,
	ECameraAlphaInputType_MAX                = 2,
};

// Enum CameraBlueprint.ECameraControlSpace
// NumValues: 0x0004
enum class ECameraControlSpace : uint8
{
	CameraSpace                              = 0,
	ViewTargetSpace                          = 1,
	WorldSpace                               = 2,
	ECameraControlSpace_MAX                  = 3,
};

// Enum CameraBlueprint.ECameraBoneFocusMode
// NumValues: 0x0003
enum class ECameraBoneFocusMode : uint8
{
	Default                                  = 0,
	ZComponent                               = 1,
	ECameraBoneFocusMode_MAX                 = 2,
};

// Enum CameraBlueprint.ECameraNodeValuePostCopyOperation
// NumValues: 0x0003
enum class ECameraNodeValuePostCopyOperation : uint8
{
	None                                     = 0,
	LogicalNegateBool                        = 1,
	ECameraNodeValuePostCopyOperation_MAX    = 2,
};

// Enum CameraBlueprint.ECameraModificationMode
// NumValues: 0x0004
enum class ECameraModificationMode : uint8
{
	Ignore                                   = 0,
	Override                                 = 1,
	Additive                                 = 2,
	ECameraModificationMode_MAX              = 3,
};

// Enum CameraBlueprint.ECameraTransitionBlendMode
// NumValues: 0x0003
enum class ECameraTransitionBlendMode : uint8
{
	TBM_Linear                               = 0,
	TBM_Cubic                                = 1,
	TBM_MAX                                  = 2,
};

// ScriptStruct CameraBlueprint.CameraBlueprintDebugData
// 0x0001 (0x0001 - 0x0000)
struct FCameraBlueprintDebugData final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCameraBlueprintDebugData) == 0x000001, "Wrong alignment on FCameraBlueprintDebugData");
static_assert(sizeof(FCameraBlueprintDebugData) == 0x000001, "Wrong size on FCameraBlueprintDebugData");

// ScriptStruct CameraBlueprint.CameraFrameSnapshot
// 0x0001 (0x0001 - 0x0000)
struct FCameraFrameSnapshot final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCameraFrameSnapshot) == 0x000001, "Wrong alignment on FCameraFrameSnapshot");
static_assert(sizeof(FCameraFrameSnapshot) == 0x000001, "Wrong size on FCameraFrameSnapshot");

// ScriptStruct CameraBlueprint.CameraStateMachineDebugData
// 0x00B0 (0x00B0 - 0x0000)
struct alignas(0x08) FCameraStateMachineDebugData final
{
public:
	uint8                                         Pad_0[0xB0];                                       // 0x0000(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCameraStateMachineDebugData) == 0x000008, "Wrong alignment on FCameraStateMachineDebugData");
static_assert(sizeof(FCameraStateMachineDebugData) == 0x0000B0, "Wrong size on FCameraStateMachineDebugData");

// ScriptStruct CameraBlueprint.CameraStateMachineStateDebugData
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x04) FCameraStateMachineStateDebugData final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCameraStateMachineStateDebugData) == 0x000004, "Wrong alignment on FCameraStateMachineStateDebugData");
static_assert(sizeof(FCameraStateMachineStateDebugData) == 0x000010, "Wrong size on FCameraStateMachineStateDebugData");

// ScriptStruct CameraBlueprint.CameraLagSettings
// 0x0050 (0x0050 - 0x0000)
struct FCameraLagSettings final
{
public:
	ECameraControlSpace                           LimitSpace;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFilterOptionPerAxis                   LimitRotationFilter;                               // 0x0001(0x0003)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                LagLimits;                                         // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RelativeRotationToApplyLimits;                     // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseCriticalDamper;                                // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraControlSpace                           InterpSpace;                                       // 0x001D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFilterOptionPerAxis                   InterpRotationFilter;                              // 0x001E(0x0003)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InterpSpeed;                                       // 0x0024(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RelativeRotationToInterp;                          // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                DampingFactor;                                     // 0x003C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAdditive;                                       // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCameraLagSubstepping;                          // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CameraLagMaxTimeStep;                              // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCameraLagSettings) == 0x000004, "Wrong alignment on FCameraLagSettings");
static_assert(sizeof(FCameraLagSettings) == 0x000050, "Wrong size on FCameraLagSettings");
static_assert(offsetof(FCameraLagSettings, LimitSpace) == 0x000000, "Member 'FCameraLagSettings::LimitSpace' has a wrong offset!");
static_assert(offsetof(FCameraLagSettings, LimitRotationFilter) == 0x000001, "Member 'FCameraLagSettings::LimitRotationFilter' has a wrong offset!");
static_assert(offsetof(FCameraLagSettings, LagLimits) == 0x000004, "Member 'FCameraLagSettings::LagLimits' has a wrong offset!");
static_assert(offsetof(FCameraLagSettings, RelativeRotationToApplyLimits) == 0x000010, "Member 'FCameraLagSettings::RelativeRotationToApplyLimits' has a wrong offset!");
static_assert(offsetof(FCameraLagSettings, bUseCriticalDamper) == 0x00001C, "Member 'FCameraLagSettings::bUseCriticalDamper' has a wrong offset!");
static_assert(offsetof(FCameraLagSettings, InterpSpace) == 0x00001D, "Member 'FCameraLagSettings::InterpSpace' has a wrong offset!");
static_assert(offsetof(FCameraLagSettings, InterpRotationFilter) == 0x00001E, "Member 'FCameraLagSettings::InterpRotationFilter' has a wrong offset!");
static_assert(offsetof(FCameraLagSettings, InterpSpeed) == 0x000024, "Member 'FCameraLagSettings::InterpSpeed' has a wrong offset!");
static_assert(offsetof(FCameraLagSettings, RelativeRotationToInterp) == 0x000030, "Member 'FCameraLagSettings::RelativeRotationToInterp' has a wrong offset!");
static_assert(offsetof(FCameraLagSettings, DampingFactor) == 0x00003C, "Member 'FCameraLagSettings::DampingFactor' has a wrong offset!");
static_assert(offsetof(FCameraLagSettings, bIsAdditive) == 0x000048, "Member 'FCameraLagSettings::bIsAdditive' has a wrong offset!");
static_assert(offsetof(FCameraLagSettings, bUseCameraLagSubstepping) == 0x000049, "Member 'FCameraLagSettings::bUseCameraLagSubstepping' has a wrong offset!");
static_assert(offsetof(FCameraLagSettings, CameraLagMaxTimeStep) == 0x00004C, "Member 'FCameraLagSettings::CameraLagMaxTimeStep' has a wrong offset!");

// ScriptStruct CameraBlueprint.CameraNotifyEventReference
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FCameraNotifyEventReference final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCameraNotifyEventReference) == 0x000008, "Wrong alignment on FCameraNotifyEventReference");
static_assert(sizeof(FCameraNotifyEventReference) == 0x000008, "Wrong size on FCameraNotifyEventReference");

// ScriptStruct CameraBlueprint.CameraNotifyEvent
// 0x0018 (0x0018 - 0x0000)
struct FCameraNotifyEvent final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCameraNotifyEvent) == 0x000004, "Wrong alignment on FCameraNotifyEvent");
static_assert(sizeof(FCameraNotifyEvent) == 0x000018, "Wrong size on FCameraNotifyEvent");
static_assert(offsetof(FCameraNotifyEvent, NotifyName) == 0x000000, "Member 'FCameraNotifyEvent::NotifyName' has a wrong offset!");

// ScriptStruct CameraBlueprint.CameraDynamicNodeInstance
// 0x0060 (0x0060 - 0x0000)
struct FCameraDynamicNodeInstance final
{
public:
	class UCameraDynamicNode*                     DynamicNode;                                       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SlotName;                                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x18];                                      // 0x0010(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAlphaBlend                            Blend;                                             // 0x0028(0x0030)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCameraDynamicNodeInstance) == 0x000008, "Wrong alignment on FCameraDynamicNodeInstance");
static_assert(sizeof(FCameraDynamicNodeInstance) == 0x000060, "Wrong size on FCameraDynamicNodeInstance");
static_assert(offsetof(FCameraDynamicNodeInstance, DynamicNode) == 0x000000, "Member 'FCameraDynamicNodeInstance::DynamicNode' has a wrong offset!");
static_assert(offsetof(FCameraDynamicNodeInstance, SlotName) == 0x000008, "Member 'FCameraDynamicNodeInstance::SlotName' has a wrong offset!");
static_assert(offsetof(FCameraDynamicNodeInstance, Blend) == 0x000028, "Member 'FCameraDynamicNodeInstance::Blend' has a wrong offset!");

// ScriptStruct CameraBlueprint.CameraParameter
// 0x0068 (0x0068 - 0x0000)
struct FCameraParameter final
{
public:
	struct FVector                                ViewTargetLocation;                                // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ViewTargetRotation;                                // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ViewPointLocationOffset;                           // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ViewPointLag;                                      // 0x0024(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               CameraRotation;                                    // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                CameraLocationOffset;                              // 0x003C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ArmLength;                                         // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FOV;                                               // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ViewPitchRange;                                    // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetCameraLocation;                                // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CameraLocation;                                    // 0x005C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCameraParameter) == 0x000004, "Wrong alignment on FCameraParameter");
static_assert(sizeof(FCameraParameter) == 0x000068, "Wrong size on FCameraParameter");
static_assert(offsetof(FCameraParameter, ViewTargetLocation) == 0x000000, "Member 'FCameraParameter::ViewTargetLocation' has a wrong offset!");
static_assert(offsetof(FCameraParameter, ViewTargetRotation) == 0x00000C, "Member 'FCameraParameter::ViewTargetRotation' has a wrong offset!");
static_assert(offsetof(FCameraParameter, ViewPointLocationOffset) == 0x000018, "Member 'FCameraParameter::ViewPointLocationOffset' has a wrong offset!");
static_assert(offsetof(FCameraParameter, ViewPointLag) == 0x000024, "Member 'FCameraParameter::ViewPointLag' has a wrong offset!");
static_assert(offsetof(FCameraParameter, CameraRotation) == 0x000030, "Member 'FCameraParameter::CameraRotation' has a wrong offset!");
static_assert(offsetof(FCameraParameter, CameraLocationOffset) == 0x00003C, "Member 'FCameraParameter::CameraLocationOffset' has a wrong offset!");
static_assert(offsetof(FCameraParameter, ArmLength) == 0x000048, "Member 'FCameraParameter::ArmLength' has a wrong offset!");
static_assert(offsetof(FCameraParameter, FOV) == 0x00004C, "Member 'FCameraParameter::FOV' has a wrong offset!");
static_assert(offsetof(FCameraParameter, ViewPitchRange) == 0x000050, "Member 'FCameraParameter::ViewPitchRange' has a wrong offset!");
static_assert(offsetof(FCameraParameter, bSetCameraLocation) == 0x000058, "Member 'FCameraParameter::bSetCameraLocation' has a wrong offset!");
static_assert(offsetof(FCameraParameter, CameraLocation) == 0x00005C, "Member 'FCameraParameter::CameraLocation' has a wrong offset!");

// ScriptStruct CameraBlueprint.CachedCameraParameterIndices
// 0x0010 (0x0010 - 0x0000)
struct FCachedCameraParameterIndices final
{
public:
	TArray<int32>                                 OrderedSavedCameraParameterNodeIndices;            // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCachedCameraParameterIndices) == 0x000008, "Wrong alignment on FCachedCameraParameterIndices");
static_assert(sizeof(FCachedCameraParameterIndices) == 0x000010, "Wrong size on FCachedCameraParameterIndices");
static_assert(offsetof(FCachedCameraParameterIndices, OrderedSavedCameraParameterNodeIndices) == 0x000000, "Member 'FCachedCameraParameterIndices::OrderedSavedCameraParameterNodeIndices' has a wrong offset!");

// ScriptStruct CameraBlueprint.CameraBlueprintFunction
// 0x0068 (0x0068 - 0x0000)
struct FCameraBlueprintFunction final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Group;                                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutputCameraParameterNodeIndex;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           InputCameraParameterNames;                         // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 InputCameraParameterNodeIndices;                   // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x28];                                      // 0x0038(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bImplemented;                                      // 0x0060(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCameraBlueprintFunction) == 0x000008, "Wrong alignment on FCameraBlueprintFunction");
static_assert(sizeof(FCameraBlueprintFunction) == 0x000068, "Wrong size on FCameraBlueprintFunction");
static_assert(offsetof(FCameraBlueprintFunction, Name) == 0x000000, "Member 'FCameraBlueprintFunction::Name' has a wrong offset!");
static_assert(offsetof(FCameraBlueprintFunction, Group) == 0x000008, "Member 'FCameraBlueprintFunction::Group' has a wrong offset!");
static_assert(offsetof(FCameraBlueprintFunction, OutputCameraParameterNodeIndex) == 0x000010, "Member 'FCameraBlueprintFunction::OutputCameraParameterNodeIndex' has a wrong offset!");
static_assert(offsetof(FCameraBlueprintFunction, InputCameraParameterNames) == 0x000018, "Member 'FCameraBlueprintFunction::InputCameraParameterNames' has a wrong offset!");
static_assert(offsetof(FCameraBlueprintFunction, InputCameraParameterNodeIndices) == 0x000028, "Member 'FCameraBlueprintFunction::InputCameraParameterNodeIndices' has a wrong offset!");
static_assert(offsetof(FCameraBlueprintFunction, bImplemented) == 0x000060, "Member 'FCameraBlueprintFunction::bImplemented' has a wrong offset!");

// ScriptStruct CameraBlueprint.CameraExposedValueCopyRecord
// 0x0008 (0x0008 - 0x0000)
struct FCameraExposedValueCopyRecord final
{
public:
	int32                                         CopyIndex;                                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraNodeValuePostCopyOperation             PostCopyOperation;                                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCameraExposedValueCopyRecord) == 0x000004, "Wrong alignment on FCameraExposedValueCopyRecord");
static_assert(sizeof(FCameraExposedValueCopyRecord) == 0x000008, "Wrong size on FCameraExposedValueCopyRecord");
static_assert(offsetof(FCameraExposedValueCopyRecord, CopyIndex) == 0x000000, "Member 'FCameraExposedValueCopyRecord::CopyIndex' has a wrong offset!");
static_assert(offsetof(FCameraExposedValueCopyRecord, PostCopyOperation) == 0x000004, "Member 'FCameraExposedValueCopyRecord::PostCopyOperation' has a wrong offset!");

// ScriptStruct CameraBlueprint.CameraExposedValueHandler
// 0x0050 (0x0050 - 0x0000)
struct FCameraExposedValueHandler final
{
public:
	class FName                                   BoundFunction;                                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCameraExposedValueCopyRecord>  CopyRecords;                                       // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UFunction*                              Function;                                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TFieldPath<struct FStructProperty>            ValueHandlerNodeProperty;                          // 0x0020(0x0020)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCameraExposedValueHandler) == 0x000008, "Wrong alignment on FCameraExposedValueHandler");
static_assert(sizeof(FCameraExposedValueHandler) == 0x000050, "Wrong size on FCameraExposedValueHandler");
static_assert(offsetof(FCameraExposedValueHandler, BoundFunction) == 0x000000, "Member 'FCameraExposedValueHandler::BoundFunction' has a wrong offset!");
static_assert(offsetof(FCameraExposedValueHandler, CopyRecords) == 0x000008, "Member 'FCameraExposedValueHandler::CopyRecords' has a wrong offset!");
static_assert(offsetof(FCameraExposedValueHandler, Function) == 0x000018, "Member 'FCameraExposedValueHandler::Function' has a wrong offset!");
static_assert(offsetof(FCameraExposedValueHandler, ValueHandlerNodeProperty) == 0x000020, "Member 'FCameraExposedValueHandler::ValueHandlerNodeProperty' has a wrong offset!");

// ScriptStruct CameraBlueprint.PenetrationAvoidanceFeeler
// 0x0020 (0x0020 - 0x0000)
struct FPenetrationAvoidanceFeeler final
{
public:
	struct FRotator                               AdjustmentRot;                                     // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         WorldWeight;                                       // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PawnWeight;                                        // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Extent;                                            // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TraceInterval;                                     // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FramesUntilNextTrace;                              // 0x001C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPenetrationAvoidanceFeeler) == 0x000004, "Wrong alignment on FPenetrationAvoidanceFeeler");
static_assert(sizeof(FPenetrationAvoidanceFeeler) == 0x000020, "Wrong size on FPenetrationAvoidanceFeeler");
static_assert(offsetof(FPenetrationAvoidanceFeeler, AdjustmentRot) == 0x000000, "Member 'FPenetrationAvoidanceFeeler::AdjustmentRot' has a wrong offset!");
static_assert(offsetof(FPenetrationAvoidanceFeeler, WorldWeight) == 0x00000C, "Member 'FPenetrationAvoidanceFeeler::WorldWeight' has a wrong offset!");
static_assert(offsetof(FPenetrationAvoidanceFeeler, PawnWeight) == 0x000010, "Member 'FPenetrationAvoidanceFeeler::PawnWeight' has a wrong offset!");
static_assert(offsetof(FPenetrationAvoidanceFeeler, Extent) == 0x000014, "Member 'FPenetrationAvoidanceFeeler::Extent' has a wrong offset!");
static_assert(offsetof(FPenetrationAvoidanceFeeler, TraceInterval) == 0x000018, "Member 'FPenetrationAvoidanceFeeler::TraceInterval' has a wrong offset!");
static_assert(offsetof(FPenetrationAvoidanceFeeler, FramesUntilNextTrace) == 0x00001C, "Member 'FPenetrationAvoidanceFeeler::FramesUntilNextTrace' has a wrong offset!");

// ScriptStruct CameraBlueprint.CameraNode_Base
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FCameraNode_Base
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCameraNode_Base) == 0x000008, "Wrong alignment on FCameraNode_Base");
static_assert(sizeof(FCameraNode_Base) == 0x000010, "Wrong size on FCameraNode_Base");

// ScriptStruct CameraBlueprint.CameraParameterLink
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FCameraParameterLink final
{
public:
	int32                                         LinkID;                                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCameraParameterLink) == 0x000008, "Wrong alignment on FCameraParameterLink");
static_assert(sizeof(FCameraParameterLink) == 0x000010, "Wrong size on FCameraParameterLink");
static_assert(offsetof(FCameraParameterLink, LinkID) == 0x000000, "Member 'FCameraParameterLink::LinkID' has a wrong offset!");

// ScriptStruct CameraBlueprint.CameraNode_BlendListBase
// 0x0070 (0x0080 - 0x0010)
struct FCameraNode_BlendListBase : public FCameraNode_Base
{
public:
	TArray<struct FCameraParameterLink>           BlendParameters;                                   // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 BlendTime;                                         // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	EAlphaBlendOption                             BlendType;                                         // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResetChildOnActivation;                           // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            CustomBlendCurve;                                  // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x40];                                      // 0x0040(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCameraNode_BlendListBase) == 0x000008, "Wrong alignment on FCameraNode_BlendListBase");
static_assert(sizeof(FCameraNode_BlendListBase) == 0x000080, "Wrong size on FCameraNode_BlendListBase");
static_assert(offsetof(FCameraNode_BlendListBase, BlendParameters) == 0x000010, "Member 'FCameraNode_BlendListBase::BlendParameters' has a wrong offset!");
static_assert(offsetof(FCameraNode_BlendListBase, BlendTime) == 0x000020, "Member 'FCameraNode_BlendListBase::BlendTime' has a wrong offset!");
static_assert(offsetof(FCameraNode_BlendListBase, BlendType) == 0x000030, "Member 'FCameraNode_BlendListBase::BlendType' has a wrong offset!");
static_assert(offsetof(FCameraNode_BlendListBase, bResetChildOnActivation) == 0x000031, "Member 'FCameraNode_BlendListBase::bResetChildOnActivation' has a wrong offset!");
static_assert(offsetof(FCameraNode_BlendListBase, CustomBlendCurve) == 0x000038, "Member 'FCameraNode_BlendListBase::CustomBlendCurve' has a wrong offset!");

// ScriptStruct CameraBlueprint.CameraNode_BlendListByBool
// 0x0008 (0x0088 - 0x0080)
struct FCameraNode_BlendListByBool final : public FCameraNode_BlendListBase
{
public:
	bool                                          bActiveValue;                                      // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCameraNode_BlendListByBool) == 0x000008, "Wrong alignment on FCameraNode_BlendListByBool");
static_assert(sizeof(FCameraNode_BlendListByBool) == 0x000088, "Wrong size on FCameraNode_BlendListByBool");
static_assert(offsetof(FCameraNode_BlendListByBool, bActiveValue) == 0x000080, "Member 'FCameraNode_BlendListByBool::bActiveValue' has a wrong offset!");

// ScriptStruct CameraBlueprint.CameraNode_BlendListByEnum
// 0x0018 (0x0098 - 0x0080)
struct FCameraNode_BlendListByEnum final : public FCameraNode_BlendListBase
{
public:
	TArray<int32>                                 EnumToPoseIndex;                                   // 0x0080(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         ActiveEnumValue;                                   // 0x0090(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCameraNode_BlendListByEnum) == 0x000008, "Wrong alignment on FCameraNode_BlendListByEnum");
static_assert(sizeof(FCameraNode_BlendListByEnum) == 0x000098, "Wrong size on FCameraNode_BlendListByEnum");
static_assert(offsetof(FCameraNode_BlendListByEnum, EnumToPoseIndex) == 0x000080, "Member 'FCameraNode_BlendListByEnum::EnumToPoseIndex' has a wrong offset!");
static_assert(offsetof(FCameraNode_BlendListByEnum, ActiveEnumValue) == 0x000090, "Member 'FCameraNode_BlendListByEnum::ActiveEnumValue' has a wrong offset!");

// ScriptStruct CameraBlueprint.CameraNode_BlendListByInt
// 0x0008 (0x0088 - 0x0080)
struct FCameraNode_BlendListByInt final : public FCameraNode_BlendListBase
{
public:
	int32                                         ActiveChildIndex;                                  // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCameraNode_BlendListByInt) == 0x000008, "Wrong alignment on FCameraNode_BlendListByInt");
static_assert(sizeof(FCameraNode_BlendListByInt) == 0x000088, "Wrong size on FCameraNode_BlendListByInt");
static_assert(offsetof(FCameraNode_BlendListByInt, ActiveChildIndex) == 0x000080, "Member 'FCameraNode_BlendListByInt::ActiveChildIndex' has a wrong offset!");

// ScriptStruct CameraBlueprint.CameraNode_CollisionPush
// 0x0068 (0x0078 - 0x0010)
struct FCameraNode_CollisionPush final : public FCameraNode_Base
{
public:
	struct FCameraParameterLink                   Source;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	ECameraControlSpace                           SafePositionOffsetSpace;                           // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SafePositionOffset;                                // 0x0024(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CollisionSphereRadius;                             // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             CollisionChannel;                                  // 0x0034(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PushDampFactor;                                    // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PullDampFactor;                                    // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAsyncCollision;                                // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x37];                                      // 0x0041(0x0037)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCameraNode_CollisionPush) == 0x000008, "Wrong alignment on FCameraNode_CollisionPush");
static_assert(sizeof(FCameraNode_CollisionPush) == 0x000078, "Wrong size on FCameraNode_CollisionPush");
static_assert(offsetof(FCameraNode_CollisionPush, Source) == 0x000010, "Member 'FCameraNode_CollisionPush::Source' has a wrong offset!");
static_assert(offsetof(FCameraNode_CollisionPush, SafePositionOffsetSpace) == 0x000020, "Member 'FCameraNode_CollisionPush::SafePositionOffsetSpace' has a wrong offset!");
static_assert(offsetof(FCameraNode_CollisionPush, SafePositionOffset) == 0x000024, "Member 'FCameraNode_CollisionPush::SafePositionOffset' has a wrong offset!");
static_assert(offsetof(FCameraNode_CollisionPush, CollisionSphereRadius) == 0x000030, "Member 'FCameraNode_CollisionPush::CollisionSphereRadius' has a wrong offset!");
static_assert(offsetof(FCameraNode_CollisionPush, CollisionChannel) == 0x000034, "Member 'FCameraNode_CollisionPush::CollisionChannel' has a wrong offset!");
static_assert(offsetof(FCameraNode_CollisionPush, PushDampFactor) == 0x000038, "Member 'FCameraNode_CollisionPush::PushDampFactor' has a wrong offset!");
static_assert(offsetof(FCameraNode_CollisionPush, PullDampFactor) == 0x00003C, "Member 'FCameraNode_CollisionPush::PullDampFactor' has a wrong offset!");
static_assert(offsetof(FCameraNode_CollisionPush, bUseAsyncCollision) == 0x000040, "Member 'FCameraNode_CollisionPush::bUseAsyncCollision' has a wrong offset!");

// ScriptStruct CameraBlueprint.CameraStyle
// 0x0044 (0x0044 - 0x0000)
struct FCameraStyle final
{
public:
	float                                         FOV;                                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CameraLocationOffset;                              // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ViewPointLocationOffset;                           // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetArmLength;                                   // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ViewPitchRange;                                    // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               CameraRotationOffset;                              // 0x0028(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseViewRotation;                                  // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               LocalRelativeRotation;                             // 0x0038(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCameraStyle) == 0x000004, "Wrong alignment on FCameraStyle");
static_assert(sizeof(FCameraStyle) == 0x000044, "Wrong size on FCameraStyle");
static_assert(offsetof(FCameraStyle, FOV) == 0x000000, "Member 'FCameraStyle::FOV' has a wrong offset!");
static_assert(offsetof(FCameraStyle, CameraLocationOffset) == 0x000004, "Member 'FCameraStyle::CameraLocationOffset' has a wrong offset!");
static_assert(offsetof(FCameraStyle, ViewPointLocationOffset) == 0x000010, "Member 'FCameraStyle::ViewPointLocationOffset' has a wrong offset!");
static_assert(offsetof(FCameraStyle, TargetArmLength) == 0x00001C, "Member 'FCameraStyle::TargetArmLength' has a wrong offset!");
static_assert(offsetof(FCameraStyle, ViewPitchRange) == 0x000020, "Member 'FCameraStyle::ViewPitchRange' has a wrong offset!");
static_assert(offsetof(FCameraStyle, CameraRotationOffset) == 0x000028, "Member 'FCameraStyle::CameraRotationOffset' has a wrong offset!");
static_assert(offsetof(FCameraStyle, bUseViewRotation) == 0x000034, "Member 'FCameraStyle::bUseViewRotation' has a wrong offset!");
static_assert(offsetof(FCameraStyle, LocalRelativeRotation) == 0x000038, "Member 'FCameraStyle::LocalRelativeRotation' has a wrong offset!");

// ScriptStruct CameraBlueprint.CameraNode_Default
// 0x0058 (0x0068 - 0x0010)
struct FCameraNode_Default final : public FCameraNode_Base
{
public:
	class FName                                   NodeName;                                          // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FocusBoneName;                                     // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraBoneFocusMode                          FocusBoneMode;                                     // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraStyle                           CameraStyle;                                       // 0x0024(0x0044)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCameraNode_Default) == 0x000008, "Wrong alignment on FCameraNode_Default");
static_assert(sizeof(FCameraNode_Default) == 0x000068, "Wrong size on FCameraNode_Default");
static_assert(offsetof(FCameraNode_Default, NodeName) == 0x000010, "Member 'FCameraNode_Default::NodeName' has a wrong offset!");
static_assert(offsetof(FCameraNode_Default, FocusBoneName) == 0x000018, "Member 'FCameraNode_Default::FocusBoneName' has a wrong offset!");
static_assert(offsetof(FCameraNode_Default, FocusBoneMode) == 0x000020, "Member 'FCameraNode_Default::FocusBoneMode' has a wrong offset!");
static_assert(offsetof(FCameraNode_Default, CameraStyle) == 0x000024, "Member 'FCameraNode_Default::CameraStyle' has a wrong offset!");

// ScriptStruct CameraBlueprint.CameraNode_Framer
// 0x0118 (0x0128 - 0x0010)
struct FCameraNode_Framer final : public FCameraNode_Base
{
public:
	struct FCameraParameterLink                   Source;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Screen_X;                                          // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Screen_Y;                                          // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeadZone_Width;                                    // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeadZone_Height;                                   // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUnlimitedSoftZone;                                // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SoftZone_Width;                                    // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SoftZone_Height;                                   // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Bias_X;                                            // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Bias_Y;                                            // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCriticalDamper;                                // 0x0044(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         X_Damping;                                         // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y_Damping;                                         // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              InterpSpeed;                                       // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SoftZoneBoundaryTolerance;                         // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUseMoveVectorSample : 1;                          // 0x005C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MoveVectorSampleCount;                             // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NextMoveVectorSampleIdx;                           // 0x0064(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        MoveVectorSamples;                                 // 0x0068(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	float                                         ActualAlpha;                                       // 0x0078(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAnimAlphaInputType                           AlphaInputType;                                    // 0x007C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Alpha;                                             // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputScaleBias                        AlphaScaleBias;                                    // 0x0084(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputAlphaBoolBlend                   AlphaBoolBlend;                                    // 0x0090(0x0048)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputScaleBiasClamp                   AlphaScaleBiasClamp;                               // 0x00DC(0x0030)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_10C[0x1C];                                     // 0x010C(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCameraNode_Framer) == 0x000008, "Wrong alignment on FCameraNode_Framer");
static_assert(sizeof(FCameraNode_Framer) == 0x000128, "Wrong size on FCameraNode_Framer");
static_assert(offsetof(FCameraNode_Framer, Source) == 0x000010, "Member 'FCameraNode_Framer::Source' has a wrong offset!");
static_assert(offsetof(FCameraNode_Framer, Screen_X) == 0x000020, "Member 'FCameraNode_Framer::Screen_X' has a wrong offset!");
static_assert(offsetof(FCameraNode_Framer, Screen_Y) == 0x000024, "Member 'FCameraNode_Framer::Screen_Y' has a wrong offset!");
static_assert(offsetof(FCameraNode_Framer, DeadZone_Width) == 0x000028, "Member 'FCameraNode_Framer::DeadZone_Width' has a wrong offset!");
static_assert(offsetof(FCameraNode_Framer, DeadZone_Height) == 0x00002C, "Member 'FCameraNode_Framer::DeadZone_Height' has a wrong offset!");
static_assert(offsetof(FCameraNode_Framer, bUnlimitedSoftZone) == 0x000030, "Member 'FCameraNode_Framer::bUnlimitedSoftZone' has a wrong offset!");
static_assert(offsetof(FCameraNode_Framer, SoftZone_Width) == 0x000034, "Member 'FCameraNode_Framer::SoftZone_Width' has a wrong offset!");
static_assert(offsetof(FCameraNode_Framer, SoftZone_Height) == 0x000038, "Member 'FCameraNode_Framer::SoftZone_Height' has a wrong offset!");
static_assert(offsetof(FCameraNode_Framer, Bias_X) == 0x00003C, "Member 'FCameraNode_Framer::Bias_X' has a wrong offset!");
static_assert(offsetof(FCameraNode_Framer, Bias_Y) == 0x000040, "Member 'FCameraNode_Framer::Bias_Y' has a wrong offset!");
static_assert(offsetof(FCameraNode_Framer, bUseCriticalDamper) == 0x000044, "Member 'FCameraNode_Framer::bUseCriticalDamper' has a wrong offset!");
static_assert(offsetof(FCameraNode_Framer, X_Damping) == 0x000048, "Member 'FCameraNode_Framer::X_Damping' has a wrong offset!");
static_assert(offsetof(FCameraNode_Framer, Y_Damping) == 0x00004C, "Member 'FCameraNode_Framer::Y_Damping' has a wrong offset!");
static_assert(offsetof(FCameraNode_Framer, InterpSpeed) == 0x000050, "Member 'FCameraNode_Framer::InterpSpeed' has a wrong offset!");
static_assert(offsetof(FCameraNode_Framer, SoftZoneBoundaryTolerance) == 0x000058, "Member 'FCameraNode_Framer::SoftZoneBoundaryTolerance' has a wrong offset!");
static_assert(offsetof(FCameraNode_Framer, MoveVectorSampleCount) == 0x000060, "Member 'FCameraNode_Framer::MoveVectorSampleCount' has a wrong offset!");
static_assert(offsetof(FCameraNode_Framer, NextMoveVectorSampleIdx) == 0x000064, "Member 'FCameraNode_Framer::NextMoveVectorSampleIdx' has a wrong offset!");
static_assert(offsetof(FCameraNode_Framer, MoveVectorSamples) == 0x000068, "Member 'FCameraNode_Framer::MoveVectorSamples' has a wrong offset!");
static_assert(offsetof(FCameraNode_Framer, ActualAlpha) == 0x000078, "Member 'FCameraNode_Framer::ActualAlpha' has a wrong offset!");
static_assert(offsetof(FCameraNode_Framer, AlphaInputType) == 0x00007C, "Member 'FCameraNode_Framer::AlphaInputType' has a wrong offset!");
static_assert(offsetof(FCameraNode_Framer, Alpha) == 0x000080, "Member 'FCameraNode_Framer::Alpha' has a wrong offset!");
static_assert(offsetof(FCameraNode_Framer, AlphaScaleBias) == 0x000084, "Member 'FCameraNode_Framer::AlphaScaleBias' has a wrong offset!");
static_assert(offsetof(FCameraNode_Framer, AlphaBoolBlend) == 0x000090, "Member 'FCameraNode_Framer::AlphaBoolBlend' has a wrong offset!");
static_assert(offsetof(FCameraNode_Framer, bEnabled) == 0x0000D8, "Member 'FCameraNode_Framer::bEnabled' has a wrong offset!");
static_assert(offsetof(FCameraNode_Framer, AlphaScaleBiasClamp) == 0x0000DC, "Member 'FCameraNode_Framer::AlphaScaleBiasClamp' has a wrong offset!");

// ScriptStruct CameraBlueprint.CameraNode_InputCamera
// 0x0000 (0x0010 - 0x0010)
struct FCameraNode_InputCamera final : public FCameraNode_Base
{
};
static_assert(alignof(FCameraNode_InputCamera) == 0x000008, "Wrong alignment on FCameraNode_InputCamera");
static_assert(sizeof(FCameraNode_InputCamera) == 0x000010, "Wrong size on FCameraNode_InputCamera");

// ScriptStruct CameraBlueprint.CameraNode_Modify
// 0x0108 (0x0118 - 0x0010)
struct FCameraNode_Modify final : public FCameraNode_Base
{
public:
	struct FCameraParameterLink                   Source;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ViewTargetLocation;                                // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ViewTargetRotation;                                // 0x002C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ViewPointLocationOffset;                           // 0x0038(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ViewPointLag;                                      // 0x0044(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               CameraRotation;                                    // 0x0050(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                CameraLocationOffset;                              // 0x005C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ArmLength;                                         // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FOV;                                               // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ViewPitchRange;                                    // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraModificationMode                       ViewTargetLocationMode;                            // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraModificationMode                       ViewTargetRotationMode;                            // 0x0079(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraModificationMode                       ViewPointLocationOffsetMode;                       // 0x007A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraModificationMode                       ViewPointLagMode;                                  // 0x007B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraModificationMode                       CameraRotationMode;                                // 0x007C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraModificationMode                       CameraLocationOffsetMode;                          // 0x007D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraModificationMode                       ArmLengthMode;                                     // 0x007E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraModificationMode                       FOVMode;                                           // 0x007F(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraModificationMode                       ViewPitchRangeMode;                                // 0x0080(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ActualAlpha;                                       // 0x0084(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAnimAlphaInputType                           AlphaInputType;                                    // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Alpha;                                             // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputScaleBias                        AlphaScaleBias;                                    // 0x0090(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FInputAlphaBoolBlend                   AlphaBoolBlend;                                    // 0x0098(0x0048)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
