#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraBlueprint

#include "Basic.hpp"

#include "PropertyAccess_structs.hpp"
#include "CameraBlueprint_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class CameraBlueprint.CameraInstance
// 0x0378 (0x03A0 - 0x0028)
class UCameraInstance : public UObject
{
public:
	float                                         PenetrationBlendInTime;                            // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PenetrationBlendOutTime;                           // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreventPenetration;                               // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoPredictiveAvoidance;                            // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CollisionPushOutDistance;                          // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReportPenetrationPercent;                          // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPenetrationAvoidanceFeeler>    PenetrationAvoidanceFeelers;                       // 0x0040(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         AimLineToDesiredPosBlockedPct;                     // 0x0050(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         DebugActorsHitDuringCameraPenetration;             // 0x0058(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	class ACBPlayerCameraManager*                 PlayerCameraManager;                               // 0x0068(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRotationOffsetEnabled;                            // 0x0070(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LastViewPitch;                                     // 0x0074(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeToRecoverFromColliding;                        // 0x0078(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OldLocation;                                       // 0x007C(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  OldRotation;                                       // 0x0090(0x0010)(Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TMap<class FName, struct FVector>             InterestPoints;                                    // 0x00A0(0x0050)(Transient, NativeAccessSpecifierPublic)
	float                                         FOVOverride;                                       // 0x00F0(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpolationMaxTimeStep;                          // 0x00F4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ViewPortLagInterpSpeed;                            // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FC[0x9C];                                      // 0x00FC(0x009C)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCameraNotifyEventReference>    NotifyQueue;                                       // 0x0198(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LastUpdatedViewTargetActorTransform;               // 0x01B0(0x0030)(Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FCameraParameter                       UpdateResult;                                      // 0x01E0(0x0068)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector                                LastFrameViewPointLocation;                        // 0x0248(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                LastFrameViewPointLag;                             // 0x0254(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_260[0x78];                                     // 0x0260(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UCameraShakeBase*>    CameraShakeInstances;                              // 0x02D8(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_328[0x78];                                     // 0x0328(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UCameraDynamicNode* ActivateDynamicCameraNode(TSubclassOf<class UCameraDynamicNode> NodeClass, class FName ActivateOnSlot, float AutoDeactivateTime);
	void BlueprintInitializeCamera();
	void BlueprintPostUpdateCamera(float DeltaSeconds);
	void BlueprintUpdateCamera(float DeltaSeconds);
	float GetInstanceCurrentStateElapsedTime(int32 MachineIndex);
	float GetInstanceMachineWeight(int32 MachineIndex);
	float GetInstanceStateWeight(int32 MachineIndex, int32 StateIndex);
	float GetInstanceTransitionCrossfadeDuration(int32 MachineIndex, int32 TransitionIndex);
	float GetInstanceTransitionTimeElapsed(int32 MachineIndex, int32 TransitionIndex);
	float GetInstanceTransitionTimeElapsedFraction(int32 MachineIndex, int32 TransitionIndex);
	void OnViewTargetChanged(class AActor* OldTarget, class AActor* NewTarget);
	void RemoveAllInterestPoints();
	void RemoveDynamicCameraNode(TSubclassOf<class UCameraDynamicNode> NodeClass, float InBlendOutTime);
	void RemoveDynamicCameraNodeOnSlot(const class FName& SlotName, float InBlendOutTime);
	void RemoveInterestPoint(const class FName& PointName);
	void SetFOVOverride(float InFOV);
	void SetInterestPoint(const class FName& PointName, const struct FVector& Location);
	class UCameraShakeBase* StartCameraShake(TSubclassOf<class UCameraShakeBase> ShakeClass, float Scale, class FName CameraShakeName, ECameraShakePlaySpace PlaySpace, const struct FRotator& UserPlaySpaceRot, bool bRestart);
	void StopCameraShake(class UCameraShakeBase* ShakeInstance, bool bImmediately);
	void StopCameraShakeByName(class FName ShakeName, bool bImmediately);

	bool GetInterestPoint(const class FName& PointName, struct FVector* OutPointLocation) const;
	class ACBPlayerCameraManager* GetPlayerCameraManager() const;
	const struct FCameraParameter GetUpdateResult() const;
	struct FRotator GetViewRotation() const;
	class AActor* GetViewTarget() const;
	struct FTransform GetViewTargetBaseTransform() const;
	bool IsSlotActive(class FName SlotNodeName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraInstance">();
	}
	static class UCameraInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraInstance>();
	}
};
static_assert(alignof(UCameraInstance) == 0x000010, "Wrong alignment on UCameraInstance");
static_assert(sizeof(UCameraInstance) == 0x0003A0, "Wrong size on UCameraInstance");
static_assert(offsetof(UCameraInstance, PenetrationBlendInTime) == 0x000028, "Member 'UCameraInstance::PenetrationBlendInTime' has a wrong offset!");
static_assert(offsetof(UCameraInstance, PenetrationBlendOutTime) == 0x00002C, "Member 'UCameraInstance::PenetrationBlendOutTime' has a wrong offset!");
static_assert(offsetof(UCameraInstance, bPreventPenetration) == 0x000030, "Member 'UCameraInstance::bPreventPenetration' has a wrong offset!");
static_assert(offsetof(UCameraInstance, bDoPredictiveAvoidance) == 0x000031, "Member 'UCameraInstance::bDoPredictiveAvoidance' has a wrong offset!");
static_assert(offsetof(UCameraInstance, CollisionPushOutDistance) == 0x000034, "Member 'UCameraInstance::CollisionPushOutDistance' has a wrong offset!");
static_assert(offsetof(UCameraInstance, ReportPenetrationPercent) == 0x000038, "Member 'UCameraInstance::ReportPenetrationPercent' has a wrong offset!");
static_assert(offsetof(UCameraInstance, PenetrationAvoidanceFeelers) == 0x000040, "Member 'UCameraInstance::PenetrationAvoidanceFeelers' has a wrong offset!");
static_assert(offsetof(UCameraInstance, AimLineToDesiredPosBlockedPct) == 0x000050, "Member 'UCameraInstance::AimLineToDesiredPosBlockedPct' has a wrong offset!");
static_assert(offsetof(UCameraInstance, DebugActorsHitDuringCameraPenetration) == 0x000058, "Member 'UCameraInstance::DebugActorsHitDuringCameraPenetration' has a wrong offset!");
static_assert(offsetof(UCameraInstance, PlayerCameraManager) == 0x000068, "Member 'UCameraInstance::PlayerCameraManager' has a wrong offset!");
static_assert(offsetof(UCameraInstance, bRotationOffsetEnabled) == 0x000070, "Member 'UCameraInstance::bRotationOffsetEnabled' has a wrong offset!");
static_assert(offsetof(UCameraInstance, LastViewPitch) == 0x000074, "Member 'UCameraInstance::LastViewPitch' has a wrong offset!");
static_assert(offsetof(UCameraInstance, TimeToRecoverFromColliding) == 0x000078, "Member 'UCameraInstance::TimeToRecoverFromColliding' has a wrong offset!");
static_assert(offsetof(UCameraInstance, OldLocation) == 0x00007C, "Member 'UCameraInstance::OldLocation' has a wrong offset!");
static_assert(offsetof(UCameraInstance, OldRotation) == 0x000090, "Member 'UCameraInstance::OldRotation' has a wrong offset!");
static_assert(offsetof(UCameraInstance, InterestPoints) == 0x0000A0, "Member 'UCameraInstance::InterestPoints' has a wrong offset!");
static_assert(offsetof(UCameraInstance, FOVOverride) == 0x0000F0, "Member 'UCameraInstance::FOVOverride' has a wrong offset!");
static_assert(offsetof(UCameraInstance, InterpolationMaxTimeStep) == 0x0000F4, "Member 'UCameraInstance::InterpolationMaxTimeStep' has a wrong offset!");
static_assert(offsetof(UCameraInstance, ViewPortLagInterpSpeed) == 0x0000F8, "Member 'UCameraInstance::ViewPortLagInterpSpeed' has a wrong offset!");
static_assert(offsetof(UCameraInstance, NotifyQueue) == 0x000198, "Member 'UCameraInstance::NotifyQueue' has a wrong offset!");
static_assert(offsetof(UCameraInstance, LastUpdatedViewTargetActorTransform) == 0x0001B0, "Member 'UCameraInstance::LastUpdatedViewTargetActorTransform' has a wrong offset!");
static_assert(offsetof(UCameraInstance, UpdateResult) == 0x0001E0, "Member 'UCameraInstance::UpdateResult' has a wrong offset!");
static_assert(offsetof(UCameraInstance, LastFrameViewPointLocation) == 0x000248, "Member 'UCameraInstance::LastFrameViewPointLocation' has a wrong offset!");
static_assert(offsetof(UCameraInstance, LastFrameViewPointLag) == 0x000254, "Member 'UCameraInstance::LastFrameViewPointLag' has a wrong offset!");
static_assert(offsetof(UCameraInstance, CameraShakeInstances) == 0x0002D8, "Member 'UCameraInstance::CameraShakeInstances' has a wrong offset!");

// Class CameraBlueprint.CameraBlueprint
// 0x0000 (0x00A0 - 0x00A0)
class UCameraBlueprint final : public UBlueprint
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraBlueprint">();
	}
	static class UCameraBlueprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraBlueprint>();
	}
};
static_assert(alignof(UCameraBlueprint) == 0x000008, "Wrong alignment on UCameraBlueprint");
static_assert(sizeof(UCameraBlueprint) == 0x0000A0, "Wrong size on UCameraBlueprint");

// Class CameraBlueprint.CameraBlueprintFunctions
// 0x0000 (0x0028 - 0x0028)
class UCameraBlueprintFunctions final : public UBlueprintFunctionLibrary
{
public:
	static class UCameraDynamicNode* ActivateDynamicCameraNode(const class ACBPlayerCameraManager* CameraManager, TSubclassOf<class UCameraDynamicNode> NodeClass, class FName ActivateOnSlot, float AutoDeactivateTime);
	static struct FVector GetCameraLocation(const struct FCameraParameter& InCameraParameter);
	static struct FVector GetViewportLocation(const struct FCameraParameter& InCameraParameter);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraBlueprintFunctions">();
	}
	static class UCameraBlueprintFunctions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraBlueprintFunctions>();
	}
};
static_assert(alignof(UCameraBlueprintFunctions) == 0x000008, "Wrong alignment on UCameraBlueprintFunctions");
static_assert(sizeof(UCameraBlueprintFunctions) == 0x000028, "Wrong size on UCameraBlueprintFunctions");

// Class CameraBlueprint.CameraBlueprintGeneratedClass
// 0x0190 (0x04B8 - 0x0328)
class UCameraBlueprintGeneratedClass final : public UBlueprintGeneratedClass
{
public:
	uint8                                         Pad_328[0x8];                                      // 0x0328(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBakedCameraStateMachine>       BakedStateMachines;                                // 0x0330(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCameraNotifyEvent>             CameraNotifies;                                    // 0x0340(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, struct FCachedCameraParameterIndices> OrderedSavedCameraParamIndicesMap;                 // 0x0350(0x0050)(NativeAccessSpecifierPublic)
	uint8                                         Pad_3A0[0x40];                                     // 0x03A0(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCameraExposedValueHandler>     EvaluateGraphExposedInputs;                        // 0x03E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FPropertyAccessLibrary                 PropertyAccessLibrary;                             // 0x03F0(0x00C8)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraBlueprintGeneratedClass">();
	}
	static class UCameraBlueprintGeneratedClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraBlueprintGeneratedClass>();
	}
};
static_assert(alignof(UCameraBlueprintGeneratedClass) == 0x000008, "Wrong alignment on UCameraBlueprintGeneratedClass");
static_assert(sizeof(UCameraBlueprintGeneratedClass) == 0x0004B8, "Wrong size on UCameraBlueprintGeneratedClass");
static_assert(offsetof(UCameraBlueprintGeneratedClass, BakedStateMachines) == 0x000330, "Member 'UCameraBlueprintGeneratedClass::BakedStateMachines' has a wrong offset!");
static_assert(offsetof(UCameraBlueprintGeneratedClass, CameraNotifies) == 0x000340, "Member 'UCameraBlueprintGeneratedClass::CameraNotifies' has a wrong offset!");
static_assert(offsetof(UCameraBlueprintGeneratedClass, OrderedSavedCameraParamIndicesMap) == 0x000350, "Member 'UCameraBlueprintGeneratedClass::OrderedSavedCameraParamIndicesMap' has a wrong offset!");
static_assert(offsetof(UCameraBlueprintGeneratedClass, EvaluateGraphExposedInputs) == 0x0003E0, "Member 'UCameraBlueprintGeneratedClass::EvaluateGraphExposedInputs' has a wrong offset!");
static_assert(offsetof(UCameraBlueprintGeneratedClass, PropertyAccessLibrary) == 0x0003F0, "Member 'UCameraBlueprintGeneratedClass::PropertyAccessLibrary' has a wrong offset!");

// Class CameraBlueprint.CameraBlueprintInterface
// 0x0000 (0x0028 - 0x0028)
class ICameraBlueprintInterface final : public IInterface
{
public:
	TSubclassOf<class UCameraInstance> GetCameraInstanceClass() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraBlueprintInterface">();
	}
	static class ICameraBlueprintInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICameraBlueprintInterface>();
	}
};
static_assert(alignof(ICameraBlueprintInterface) == 0x000008, "Wrong alignment on ICameraBlueprintInterface");
static_assert(sizeof(ICameraBlueprintInterface) == 0x000028, "Wrong size on ICameraBlueprintInterface");

// Class CameraBlueprint.CameraBlueprintManagerInterface
// 0x0000 (0x0028 - 0x0028)
class ICameraBlueprintManagerInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraBlueprintManagerInterface">();
	}
	static class ICameraBlueprintManagerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICameraBlueprintManagerInterface>();
	}
};
static_assert(alignof(ICameraBlueprintManagerInterface) == 0x000008, "Wrong alignment on ICameraBlueprintManagerInterface");
static_assert(sizeof(ICameraBlueprintManagerInterface) == 0x000028, "Wrong size on ICameraBlueprintManagerInterface");

// Class CameraBlueprint.CameraClassInterface
// 0x0000 (0x0028 - 0x0028)
class ICameraClassInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraClassInterface">();
	}
	static class ICameraClassInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICameraClassInterface>();
	}
};
static_assert(alignof(ICameraClassInterface) == 0x000008, "Wrong alignment on ICameraClassInterface");
static_assert(sizeof(ICameraClassInterface) == 0x000028, "Wrong size on ICameraClassInterface");

// Class CameraBlueprint.CameraDynamicNode
// 0x0100 (0x0128 - 0x0028)
class UCameraDynamicNode : public UObject
{
public:
	struct FAlphaBlend                            DefaultBlendIn;                                    // 0x0028(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FAlphaBlend                            DefaultBlendOut;                                   // 0x0058(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class FName                                   PlayingOnSlot;                                     // 0x0088(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   FocusBoneName;                                     // 0x0090(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECameraBoneFocusMode                          FocusBoneMode;                                     // 0x0098(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAffectsByFOVOverride;                             // 0x0099(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableViewPointLag;                               // 0x009A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraLagSettings                     LagSettings;                                       // 0x009C(0x0050)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ViewPointLocation;                                 // 0x00F0(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_FC[0x2C];                                      // 0x00FC(0x002C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Exit(float BlendOutTime);
	void K2_Evaluate(const struct FCameraParameter& Source, struct FCameraParameter* Output);
	void K2_Initialize();
	void K2_OnStop();
	void K2_Update(float DeltaTime, float PreviousWeight, float CurrentWeight);
	void SetCameraLagInterpSpeed(const struct FVector& InterpSpeed);

	float GetActiveTime() const;
	float GetBlendOutTime(class AActor* ViewTargetActor) const;
	class UCameraInstance* GetCameraInstance() const;
	class APlayerController* GetPlayerController() const;
	struct FRotator GetViewRotation() const;
	class AActor* GetViewTarget() const;
	struct FTransform GetViewTargetBaseTransform() const;
	bool IsBlendingOut() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraDynamicNode">();
	}
	static class UCameraDynamicNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraDynamicNode>();
	}
};
static_assert(alignof(UCameraDynamicNode) == 0x000008, "Wrong alignment on UCameraDynamicNode");
static_assert(sizeof(UCameraDynamicNode) == 0x000128, "Wrong size on UCameraDynamicNode");
static_assert(offsetof(UCameraDynamicNode, DefaultBlendIn) == 0x000028, "Member 'UCameraDynamicNode::DefaultBlendIn' has a wrong offset!");
static_assert(offsetof(UCameraDynamicNode, DefaultBlendOut) == 0x000058, "Member 'UCameraDynamicNode::DefaultBlendOut' has a wrong offset!");
static_assert(offsetof(UCameraDynamicNode, PlayingOnSlot) == 0x000088, "Member 'UCameraDynamicNode::PlayingOnSlot' has a wrong offset!");
static_assert(offsetof(UCameraDynamicNode, FocusBoneName) == 0x000090, "Member 'UCameraDynamicNode::FocusBoneName' has a wrong offset!");
static_assert(offsetof(UCameraDynamicNode, FocusBoneMode) == 0x000098, "Member 'UCameraDynamicNode::FocusBoneMode' has a wrong offset!");
static_assert(offsetof(UCameraDynamicNode, bAffectsByFOVOverride) == 0x000099, "Member 'UCameraDynamicNode::bAffectsByFOVOverride' has a wrong offset!");
static_assert(offsetof(UCameraDynamicNode, bEnableViewPointLag) == 0x00009A, "Member 'UCameraDynamicNode::bEnableViewPointLag' has a wrong offset!");
static_assert(offsetof(UCameraDynamicNode, LagSettings) == 0x00009C, "Member 'UCameraDynamicNode::LagSettings' has a wrong offset!");
static_assert(offsetof(UCameraDynamicNode, ViewPointLocation) == 0x0000F0, "Member 'UCameraDynamicNode::ViewPointLocation' has a wrong offset!");

// Class CameraBlueprint.CameraStateMachineTypes
// 0x0000 (0x0028 - 0x0028)
class UCameraStateMachineTypes final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraStateMachineTypes">();
	}
	static class UCameraStateMachineTypes* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraStateMachineTypes>();
	}
};
static_assert(alignof(UCameraStateMachineTypes) == 0x000008, "Wrong alignment on UCameraStateMachineTypes");
static_assert(sizeof(UCameraStateMachineTypes) == 0x000028, "Wrong size on UCameraStateMachineTypes");

// Class CameraBlueprint.CBPlayerCameraManager
// 0x0040 (0x2860 - 0x2820)
#pragma pack(push, 0x1)
class alignas(0x10) ACBPlayerCameraManager : public APlayerCameraManager
{
public:
	uint8                                         Pad_2820[0x8];                                     // 0x2820(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCameraInstance>            CameraClass;                                       // 0x2828(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2830[0x18];                                    // 0x2830(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraInstance*                        CameraInstance;                                    // 0x2848(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2850[0x4];                                     // 0x2850(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bLockCameraInstanceOutgoing;                       // 0x2854(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2855[0x3];                                     // 0x2855(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetCameraInstanceClass(class UClass* NewCameraClass, const struct FCameraInstanceTransitionParams& TransitionParams);

	class UCameraInstance* GetCameraInstance() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CBPlayerCameraManager">();
	}
	static class ACBPlayerCameraManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACBPlayerCameraManager>();
	}
};
#pragma pack(pop)
static_assert(alignof(ACBPlayerCameraManager) == 0x000010, "Wrong alignment on ACBPlayerCameraManager");
static_assert(sizeof(ACBPlayerCameraManager) == 0x002860, "Wrong size on ACBPlayerCameraManager");
static_assert(offsetof(ACBPlayerCameraManager, CameraClass) == 0x002828, "Member 'ACBPlayerCameraManager::CameraClass' has a wrong offset!");
static_assert(offsetof(ACBPlayerCameraManager, CameraInstance) == 0x002848, "Member 'ACBPlayerCameraManager::CameraInstance' has a wrong offset!");
static_assert(offsetof(ACBPlayerCameraManager, bLockCameraInstanceOutgoing) == 0x002854, "Member 'ACBPlayerCameraManager::bLockCameraInstanceOutgoing' has a wrong offset!");

}

