#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CameraBlueprint_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CameraBlueprint.CameraInstance.ActivateDynamicCameraNode
// 0x0020 (0x0020 - 0x0000)
struct CameraInstance_ActivateDynamicCameraNode final
{
public:
	TSubclassOf<class UCameraDynamicNode>         NodeClass;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ActivateOnSlot;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AutoDeactivateTime;                                // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraDynamicNode*                     ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraInstance_ActivateDynamicCameraNode) == 0x000008, "Wrong alignment on CameraInstance_ActivateDynamicCameraNode");
static_assert(sizeof(CameraInstance_ActivateDynamicCameraNode) == 0x000020, "Wrong size on CameraInstance_ActivateDynamicCameraNode");
static_assert(offsetof(CameraInstance_ActivateDynamicCameraNode, NodeClass) == 0x000000, "Member 'CameraInstance_ActivateDynamicCameraNode::NodeClass' has a wrong offset!");
static_assert(offsetof(CameraInstance_ActivateDynamicCameraNode, ActivateOnSlot) == 0x000008, "Member 'CameraInstance_ActivateDynamicCameraNode::ActivateOnSlot' has a wrong offset!");
static_assert(offsetof(CameraInstance_ActivateDynamicCameraNode, AutoDeactivateTime) == 0x000010, "Member 'CameraInstance_ActivateDynamicCameraNode::AutoDeactivateTime' has a wrong offset!");
static_assert(offsetof(CameraInstance_ActivateDynamicCameraNode, ReturnValue) == 0x000018, "Member 'CameraInstance_ActivateDynamicCameraNode::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraInstance.BlueprintPostUpdateCamera
// 0x0004 (0x0004 - 0x0000)
struct CameraInstance_BlueprintPostUpdateCamera final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraInstance_BlueprintPostUpdateCamera) == 0x000004, "Wrong alignment on CameraInstance_BlueprintPostUpdateCamera");
static_assert(sizeof(CameraInstance_BlueprintPostUpdateCamera) == 0x000004, "Wrong size on CameraInstance_BlueprintPostUpdateCamera");
static_assert(offsetof(CameraInstance_BlueprintPostUpdateCamera, DeltaSeconds) == 0x000000, "Member 'CameraInstance_BlueprintPostUpdateCamera::DeltaSeconds' has a wrong offset!");

// Function CameraBlueprint.CameraInstance.BlueprintUpdateCamera
// 0x0004 (0x0004 - 0x0000)
struct CameraInstance_BlueprintUpdateCamera final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraInstance_BlueprintUpdateCamera) == 0x000004, "Wrong alignment on CameraInstance_BlueprintUpdateCamera");
static_assert(sizeof(CameraInstance_BlueprintUpdateCamera) == 0x000004, "Wrong size on CameraInstance_BlueprintUpdateCamera");
static_assert(offsetof(CameraInstance_BlueprintUpdateCamera, DeltaSeconds) == 0x000000, "Member 'CameraInstance_BlueprintUpdateCamera::DeltaSeconds' has a wrong offset!");

// Function CameraBlueprint.CameraInstance.GetInstanceCurrentStateElapsedTime
// 0x0008 (0x0008 - 0x0000)
struct CameraInstance_GetInstanceCurrentStateElapsedTime final
{
public:
	int32                                         MachineIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraInstance_GetInstanceCurrentStateElapsedTime) == 0x000004, "Wrong alignment on CameraInstance_GetInstanceCurrentStateElapsedTime");
static_assert(sizeof(CameraInstance_GetInstanceCurrentStateElapsedTime) == 0x000008, "Wrong size on CameraInstance_GetInstanceCurrentStateElapsedTime");
static_assert(offsetof(CameraInstance_GetInstanceCurrentStateElapsedTime, MachineIndex) == 0x000000, "Member 'CameraInstance_GetInstanceCurrentStateElapsedTime::MachineIndex' has a wrong offset!");
static_assert(offsetof(CameraInstance_GetInstanceCurrentStateElapsedTime, ReturnValue) == 0x000004, "Member 'CameraInstance_GetInstanceCurrentStateElapsedTime::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraInstance.GetInstanceMachineWeight
// 0x0008 (0x0008 - 0x0000)
struct CameraInstance_GetInstanceMachineWeight final
{
public:
	int32                                         MachineIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraInstance_GetInstanceMachineWeight) == 0x000004, "Wrong alignment on CameraInstance_GetInstanceMachineWeight");
static_assert(sizeof(CameraInstance_GetInstanceMachineWeight) == 0x000008, "Wrong size on CameraInstance_GetInstanceMachineWeight");
static_assert(offsetof(CameraInstance_GetInstanceMachineWeight, MachineIndex) == 0x000000, "Member 'CameraInstance_GetInstanceMachineWeight::MachineIndex' has a wrong offset!");
static_assert(offsetof(CameraInstance_GetInstanceMachineWeight, ReturnValue) == 0x000004, "Member 'CameraInstance_GetInstanceMachineWeight::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraInstance.GetInstanceStateWeight
// 0x000C (0x000C - 0x0000)
struct CameraInstance_GetInstanceStateWeight final
{
public:
	int32                                         MachineIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StateIndex;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraInstance_GetInstanceStateWeight) == 0x000004, "Wrong alignment on CameraInstance_GetInstanceStateWeight");
static_assert(sizeof(CameraInstance_GetInstanceStateWeight) == 0x00000C, "Wrong size on CameraInstance_GetInstanceStateWeight");
static_assert(offsetof(CameraInstance_GetInstanceStateWeight, MachineIndex) == 0x000000, "Member 'CameraInstance_GetInstanceStateWeight::MachineIndex' has a wrong offset!");
static_assert(offsetof(CameraInstance_GetInstanceStateWeight, StateIndex) == 0x000004, "Member 'CameraInstance_GetInstanceStateWeight::StateIndex' has a wrong offset!");
static_assert(offsetof(CameraInstance_GetInstanceStateWeight, ReturnValue) == 0x000008, "Member 'CameraInstance_GetInstanceStateWeight::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraInstance.GetInstanceTransitionCrossfadeDuration
// 0x000C (0x000C - 0x0000)
struct CameraInstance_GetInstanceTransitionCrossfadeDuration final
{
public:
	int32                                         MachineIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TransitionIndex;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraInstance_GetInstanceTransitionCrossfadeDuration) == 0x000004, "Wrong alignment on CameraInstance_GetInstanceTransitionCrossfadeDuration");
static_assert(sizeof(CameraInstance_GetInstanceTransitionCrossfadeDuration) == 0x00000C, "Wrong size on CameraInstance_GetInstanceTransitionCrossfadeDuration");
static_assert(offsetof(CameraInstance_GetInstanceTransitionCrossfadeDuration, MachineIndex) == 0x000000, "Member 'CameraInstance_GetInstanceTransitionCrossfadeDuration::MachineIndex' has a wrong offset!");
static_assert(offsetof(CameraInstance_GetInstanceTransitionCrossfadeDuration, TransitionIndex) == 0x000004, "Member 'CameraInstance_GetInstanceTransitionCrossfadeDuration::TransitionIndex' has a wrong offset!");
static_assert(offsetof(CameraInstance_GetInstanceTransitionCrossfadeDuration, ReturnValue) == 0x000008, "Member 'CameraInstance_GetInstanceTransitionCrossfadeDuration::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraInstance.GetInstanceTransitionTimeElapsed
// 0x000C (0x000C - 0x0000)
struct CameraInstance_GetInstanceTransitionTimeElapsed final
{
public:
	int32                                         MachineIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TransitionIndex;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraInstance_GetInstanceTransitionTimeElapsed) == 0x000004, "Wrong alignment on CameraInstance_GetInstanceTransitionTimeElapsed");
static_assert(sizeof(CameraInstance_GetInstanceTransitionTimeElapsed) == 0x00000C, "Wrong size on CameraInstance_GetInstanceTransitionTimeElapsed");
static_assert(offsetof(CameraInstance_GetInstanceTransitionTimeElapsed, MachineIndex) == 0x000000, "Member 'CameraInstance_GetInstanceTransitionTimeElapsed::MachineIndex' has a wrong offset!");
static_assert(offsetof(CameraInstance_GetInstanceTransitionTimeElapsed, TransitionIndex) == 0x000004, "Member 'CameraInstance_GetInstanceTransitionTimeElapsed::TransitionIndex' has a wrong offset!");
static_assert(offsetof(CameraInstance_GetInstanceTransitionTimeElapsed, ReturnValue) == 0x000008, "Member 'CameraInstance_GetInstanceTransitionTimeElapsed::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraInstance.GetInstanceTransitionTimeElapsedFraction
// 0x000C (0x000C - 0x0000)
struct CameraInstance_GetInstanceTransitionTimeElapsedFraction final
{
public:
	int32                                         MachineIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TransitionIndex;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraInstance_GetInstanceTransitionTimeElapsedFraction) == 0x000004, "Wrong alignment on CameraInstance_GetInstanceTransitionTimeElapsedFraction");
static_assert(sizeof(CameraInstance_GetInstanceTransitionTimeElapsedFraction) == 0x00000C, "Wrong size on CameraInstance_GetInstanceTransitionTimeElapsedFraction");
static_assert(offsetof(CameraInstance_GetInstanceTransitionTimeElapsedFraction, MachineIndex) == 0x000000, "Member 'CameraInstance_GetInstanceTransitionTimeElapsedFraction::MachineIndex' has a wrong offset!");
static_assert(offsetof(CameraInstance_GetInstanceTransitionTimeElapsedFraction, TransitionIndex) == 0x000004, "Member 'CameraInstance_GetInstanceTransitionTimeElapsedFraction::TransitionIndex' has a wrong offset!");
static_assert(offsetof(CameraInstance_GetInstanceTransitionTimeElapsedFraction, ReturnValue) == 0x000008, "Member 'CameraInstance_GetInstanceTransitionTimeElapsedFraction::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraInstance.OnViewTargetChanged
// 0x0010 (0x0010 - 0x0000)
struct CameraInstance_OnViewTargetChanged final
{
public:
	class AActor*                                 OldTarget;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 NewTarget;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraInstance_OnViewTargetChanged) == 0x000008, "Wrong alignment on CameraInstance_OnViewTargetChanged");
static_assert(sizeof(CameraInstance_OnViewTargetChanged) == 0x000010, "Wrong size on CameraInstance_OnViewTargetChanged");
static_assert(offsetof(CameraInstance_OnViewTargetChanged, OldTarget) == 0x000000, "Member 'CameraInstance_OnViewTargetChanged::OldTarget' has a wrong offset!");
static_assert(offsetof(CameraInstance_OnViewTargetChanged, NewTarget) == 0x000008, "Member 'CameraInstance_OnViewTargetChanged::NewTarget' has a wrong offset!");

// Function CameraBlueprint.CameraInstance.RemoveDynamicCameraNode
// 0x0010 (0x0010 - 0x0000)
struct CameraInstance_RemoveDynamicCameraNode final
{
public:
	TSubclassOf<class UCameraDynamicNode>         NodeClass;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InBlendOutTime;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CameraInstance_RemoveDynamicCameraNode) == 0x000008, "Wrong alignment on CameraInstance_RemoveDynamicCameraNode");
static_assert(sizeof(CameraInstance_RemoveDynamicCameraNode) == 0x000010, "Wrong size on CameraInstance_RemoveDynamicCameraNode");
static_assert(offsetof(CameraInstance_RemoveDynamicCameraNode, NodeClass) == 0x000000, "Member 'CameraInstance_RemoveDynamicCameraNode::NodeClass' has a wrong offset!");
static_assert(offsetof(CameraInstance_RemoveDynamicCameraNode, InBlendOutTime) == 0x000008, "Member 'CameraInstance_RemoveDynamicCameraNode::InBlendOutTime' has a wrong offset!");

// Function CameraBlueprint.CameraInstance.RemoveDynamicCameraNodeOnSlot
// 0x000C (0x000C - 0x0000)
struct CameraInstance_RemoveDynamicCameraNodeOnSlot final
{
public:
	class FName                                   SlotName;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InBlendOutTime;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraInstance_RemoveDynamicCameraNodeOnSlot) == 0x000004, "Wrong alignment on CameraInstance_RemoveDynamicCameraNodeOnSlot");
static_assert(sizeof(CameraInstance_RemoveDynamicCameraNodeOnSlot) == 0x00000C, "Wrong size on CameraInstance_RemoveDynamicCameraNodeOnSlot");
static_assert(offsetof(CameraInstance_RemoveDynamicCameraNodeOnSlot, SlotName) == 0x000000, "Member 'CameraInstance_RemoveDynamicCameraNodeOnSlot::SlotName' has a wrong offset!");
static_assert(offsetof(CameraInstance_RemoveDynamicCameraNodeOnSlot, InBlendOutTime) == 0x000008, "Member 'CameraInstance_RemoveDynamicCameraNodeOnSlot::InBlendOutTime' has a wrong offset!");

// Function CameraBlueprint.CameraInstance.RemoveInterestPoint
// 0x0008 (0x0008 - 0x0000)
struct CameraInstance_RemoveInterestPoint final
{
public:
	class FName                                   PointName;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraInstance_RemoveInterestPoint) == 0x000004, "Wrong alignment on CameraInstance_RemoveInterestPoint");
static_assert(sizeof(CameraInstance_RemoveInterestPoint) == 0x000008, "Wrong size on CameraInstance_RemoveInterestPoint");
static_assert(offsetof(CameraInstance_RemoveInterestPoint, PointName) == 0x000000, "Member 'CameraInstance_RemoveInterestPoint::PointName' has a wrong offset!");

// Function CameraBlueprint.CameraInstance.SetFOVOverride
// 0x0004 (0x0004 - 0x0000)
struct CameraInstance_SetFOVOverride final
{
public:
	float                                         InFOV;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraInstance_SetFOVOverride) == 0x000004, "Wrong alignment on CameraInstance_SetFOVOverride");
static_assert(sizeof(CameraInstance_SetFOVOverride) == 0x000004, "Wrong size on CameraInstance_SetFOVOverride");
static_assert(offsetof(CameraInstance_SetFOVOverride, InFOV) == 0x000000, "Member 'CameraInstance_SetFOVOverride::InFOV' has a wrong offset!");

// Function CameraBlueprint.CameraInstance.SetInterestPoint
// 0x0014 (0x0014 - 0x0000)
struct CameraInstance_SetInterestPoint final
{
public:
	class FName                                   PointName;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraInstance_SetInterestPoint) == 0x000004, "Wrong alignment on CameraInstance_SetInterestPoint");
static_assert(sizeof(CameraInstance_SetInterestPoint) == 0x000014, "Wrong size on CameraInstance_SetInterestPoint");
static_assert(offsetof(CameraInstance_SetInterestPoint, PointName) == 0x000000, "Member 'CameraInstance_SetInterestPoint::PointName' has a wrong offset!");
static_assert(offsetof(CameraInstance_SetInterestPoint, Location) == 0x000008, "Member 'CameraInstance_SetInterestPoint::Location' has a wrong offset!");

// Function CameraBlueprint.CameraInstance.StartCameraShake
// 0x0030 (0x0030 - 0x0000)
struct CameraInstance_StartCameraShake final
{
public:
	TSubclassOf<class UCameraShakeBase>           ShakeClass;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CameraShakeName;                                   // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraShakePlaySpace                         PlaySpace;                                         // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               UserPlaySpaceRot;                                  // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bRestart;                                          // 0x0024(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraShakeBase*                       ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraInstance_StartCameraShake) == 0x000008, "Wrong alignment on CameraInstance_StartCameraShake");
static_assert(sizeof(CameraInstance_StartCameraShake) == 0x000030, "Wrong size on CameraInstance_StartCameraShake");
static_assert(offsetof(CameraInstance_StartCameraShake, ShakeClass) == 0x000000, "Member 'CameraInstance_StartCameraShake::ShakeClass' has a wrong offset!");
static_assert(offsetof(CameraInstance_StartCameraShake, Scale) == 0x000008, "Member 'CameraInstance_StartCameraShake::Scale' has a wrong offset!");
static_assert(offsetof(CameraInstance_StartCameraShake, CameraShakeName) == 0x00000C, "Member 'CameraInstance_StartCameraShake::CameraShakeName' has a wrong offset!");
static_assert(offsetof(CameraInstance_StartCameraShake, PlaySpace) == 0x000014, "Member 'CameraInstance_StartCameraShake::PlaySpace' has a wrong offset!");
static_assert(offsetof(CameraInstance_StartCameraShake, UserPlaySpaceRot) == 0x000018, "Member 'CameraInstance_StartCameraShake::UserPlaySpaceRot' has a wrong offset!");
static_assert(offsetof(CameraInstance_StartCameraShake, bRestart) == 0x000024, "Member 'CameraInstance_StartCameraShake::bRestart' has a wrong offset!");
static_assert(offsetof(CameraInstance_StartCameraShake, ReturnValue) == 0x000028, "Member 'CameraInstance_StartCameraShake::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraInstance.StopCameraShake
// 0x0010 (0x0010 - 0x0000)
struct CameraInstance_StopCameraShake final
{
public:
	class UCameraShakeBase*                       ShakeInstance;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImmediately;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CameraInstance_StopCameraShake) == 0x000008, "Wrong alignment on CameraInstance_StopCameraShake");
static_assert(sizeof(CameraInstance_StopCameraShake) == 0x000010, "Wrong size on CameraInstance_StopCameraShake");
static_assert(offsetof(CameraInstance_StopCameraShake, ShakeInstance) == 0x000000, "Member 'CameraInstance_StopCameraShake::ShakeInstance' has a wrong offset!");
static_assert(offsetof(CameraInstance_StopCameraShake, bImmediately) == 0x000008, "Member 'CameraInstance_StopCameraShake::bImmediately' has a wrong offset!");

// Function CameraBlueprint.CameraInstance.StopCameraShakeByName
// 0x000C (0x000C - 0x0000)
struct CameraInstance_StopCameraShakeByName final
{
public:
	class FName                                   ShakeName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImmediately;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CameraInstance_StopCameraShakeByName) == 0x000004, "Wrong alignment on CameraInstance_StopCameraShakeByName");
static_assert(sizeof(CameraInstance_StopCameraShakeByName) == 0x00000C, "Wrong size on CameraInstance_StopCameraShakeByName");
static_assert(offsetof(CameraInstance_StopCameraShakeByName, ShakeName) == 0x000000, "Member 'CameraInstance_StopCameraShakeByName::ShakeName' has a wrong offset!");
static_assert(offsetof(CameraInstance_StopCameraShakeByName, bImmediately) == 0x000008, "Member 'CameraInstance_StopCameraShakeByName::bImmediately' has a wrong offset!");

// Function CameraBlueprint.CameraInstance.GetInterestPoint
// 0x0018 (0x0018 - 0x0000)
struct CameraInstance_GetInterestPoint final
{
public:
	class FName                                   PointName;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutPointLocation;                                  // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CameraInstance_GetInterestPoint) == 0x000004, "Wrong alignment on CameraInstance_GetInterestPoint");
static_assert(sizeof(CameraInstance_GetInterestPoint) == 0x000018, "Wrong size on CameraInstance_GetInterestPoint");
static_assert(offsetof(CameraInstance_GetInterestPoint, PointName) == 0x000000, "Member 'CameraInstance_GetInterestPoint::PointName' has a wrong offset!");
static_assert(offsetof(CameraInstance_GetInterestPoint, OutPointLocation) == 0x000008, "Member 'CameraInstance_GetInterestPoint::OutPointLocation' has a wrong offset!");
static_assert(offsetof(CameraInstance_GetInterestPoint, ReturnValue) == 0x000014, "Member 'CameraInstance_GetInterestPoint::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraInstance.GetPlayerCameraManager
// 0x0008 (0x0008 - 0x0000)
struct CameraInstance_GetPlayerCameraManager final
{
public:
	class ACBPlayerCameraManager*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraInstance_GetPlayerCameraManager) == 0x000008, "Wrong alignment on CameraInstance_GetPlayerCameraManager");
static_assert(sizeof(CameraInstance_GetPlayerCameraManager) == 0x000008, "Wrong size on CameraInstance_GetPlayerCameraManager");
static_assert(offsetof(CameraInstance_GetPlayerCameraManager, ReturnValue) == 0x000000, "Member 'CameraInstance_GetPlayerCameraManager::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraInstance.GetUpdateResult
// 0x0068 (0x0068 - 0x0000)
struct CameraInstance_GetUpdateResult final
{
public:
	struct FCameraParameter                       ReturnValue;                                       // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraInstance_GetUpdateResult) == 0x000004, "Wrong alignment on CameraInstance_GetUpdateResult");
static_assert(sizeof(CameraInstance_GetUpdateResult) == 0x000068, "Wrong size on CameraInstance_GetUpdateResult");
static_assert(offsetof(CameraInstance_GetUpdateResult, ReturnValue) == 0x000000, "Member 'CameraInstance_GetUpdateResult::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraInstance.GetViewRotation
// 0x000C (0x000C - 0x0000)
struct CameraInstance_GetViewRotation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraInstance_GetViewRotation) == 0x000004, "Wrong alignment on CameraInstance_GetViewRotation");
static_assert(sizeof(CameraInstance_GetViewRotation) == 0x00000C, "Wrong size on CameraInstance_GetViewRotation");
static_assert(offsetof(CameraInstance_GetViewRotation, ReturnValue) == 0x000000, "Member 'CameraInstance_GetViewRotation::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraInstance.GetViewTarget
// 0x0008 (0x0008 - 0x0000)
struct CameraInstance_GetViewTarget final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraInstance_GetViewTarget) == 0x000008, "Wrong alignment on CameraInstance_GetViewTarget");
static_assert(sizeof(CameraInstance_GetViewTarget) == 0x000008, "Wrong size on CameraInstance_GetViewTarget");
static_assert(offsetof(CameraInstance_GetViewTarget, ReturnValue) == 0x000000, "Member 'CameraInstance_GetViewTarget::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraInstance.GetViewTargetBaseTransform
// 0x0030 (0x0030 - 0x0000)
struct CameraInstance_GetViewTargetBaseTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraInstance_GetViewTargetBaseTransform) == 0x000010, "Wrong alignment on CameraInstance_GetViewTargetBaseTransform");
static_assert(sizeof(CameraInstance_GetViewTargetBaseTransform) == 0x000030, "Wrong size on CameraInstance_GetViewTargetBaseTransform");
static_assert(offsetof(CameraInstance_GetViewTargetBaseTransform, ReturnValue) == 0x000000, "Member 'CameraInstance_GetViewTargetBaseTransform::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraInstance.IsSlotActive
// 0x000C (0x000C - 0x0000)
struct CameraInstance_IsSlotActive final
{
public:
	class FName                                   SlotNodeName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CameraInstance_IsSlotActive) == 0x000004, "Wrong alignment on CameraInstance_IsSlotActive");
static_assert(sizeof(CameraInstance_IsSlotActive) == 0x00000C, "Wrong size on CameraInstance_IsSlotActive");
static_assert(offsetof(CameraInstance_IsSlotActive, SlotNodeName) == 0x000000, "Member 'CameraInstance_IsSlotActive::SlotNodeName' has a wrong offset!");
static_assert(offsetof(CameraInstance_IsSlotActive, ReturnValue) == 0x000008, "Member 'CameraInstance_IsSlotActive::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraBlueprintFunctions.ActivateDynamicCameraNode
// 0x0028 (0x0028 - 0x0000)
struct CameraBlueprintFunctions_ActivateDynamicCameraNode final
{
public:
	const class ACBPlayerCameraManager*           CameraManager;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCameraDynamicNode>         NodeClass;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ActivateOnSlot;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AutoDeactivateTime;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraDynamicNode*                     ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraBlueprintFunctions_ActivateDynamicCameraNode) == 0x000008, "Wrong alignment on CameraBlueprintFunctions_ActivateDynamicCameraNode");
static_assert(sizeof(CameraBlueprintFunctions_ActivateDynamicCameraNode) == 0x000028, "Wrong size on CameraBlueprintFunctions_ActivateDynamicCameraNode");
static_assert(offsetof(CameraBlueprintFunctions_ActivateDynamicCameraNode, CameraManager) == 0x000000, "Member 'CameraBlueprintFunctions_ActivateDynamicCameraNode::CameraManager' has a wrong offset!");
static_assert(offsetof(CameraBlueprintFunctions_ActivateDynamicCameraNode, NodeClass) == 0x000008, "Member 'CameraBlueprintFunctions_ActivateDynamicCameraNode::NodeClass' has a wrong offset!");
static_assert(offsetof(CameraBlueprintFunctions_ActivateDynamicCameraNode, ActivateOnSlot) == 0x000010, "Member 'CameraBlueprintFunctions_ActivateDynamicCameraNode::ActivateOnSlot' has a wrong offset!");
static_assert(offsetof(CameraBlueprintFunctions_ActivateDynamicCameraNode, AutoDeactivateTime) == 0x000018, "Member 'CameraBlueprintFunctions_ActivateDynamicCameraNode::AutoDeactivateTime' has a wrong offset!");
static_assert(offsetof(CameraBlueprintFunctions_ActivateDynamicCameraNode, ReturnValue) == 0x000020, "Member 'CameraBlueprintFunctions_ActivateDynamicCameraNode::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraBlueprintFunctions.GetCameraLocation
// 0x0074 (0x0074 - 0x0000)
struct CameraBlueprintFunctions_GetCameraLocation final
{
public:
	struct FCameraParameter                       InCameraParameter;                                 // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0068(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraBlueprintFunctions_GetCameraLocation) == 0x000004, "Wrong alignment on CameraBlueprintFunctions_GetCameraLocation");
static_assert(sizeof(CameraBlueprintFunctions_GetCameraLocation) == 0x000074, "Wrong size on CameraBlueprintFunctions_GetCameraLocation");
static_assert(offsetof(CameraBlueprintFunctions_GetCameraLocation, InCameraParameter) == 0x000000, "Member 'CameraBlueprintFunctions_GetCameraLocation::InCameraParameter' has a wrong offset!");
static_assert(offsetof(CameraBlueprintFunctions_GetCameraLocation, ReturnValue) == 0x000068, "Member 'CameraBlueprintFunctions_GetCameraLocation::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraBlueprintFunctions.GetViewportLocation
// 0x0074 (0x0074 - 0x0000)
struct CameraBlueprintFunctions_GetViewportLocation final
{
public:
	struct FCameraParameter                       InCameraParameter;                                 // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0068(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraBlueprintFunctions_GetViewportLocation) == 0x000004, "Wrong alignment on CameraBlueprintFunctions_GetViewportLocation");
static_assert(sizeof(CameraBlueprintFunctions_GetViewportLocation) == 0x000074, "Wrong size on CameraBlueprintFunctions_GetViewportLocation");
static_assert(offsetof(CameraBlueprintFunctions_GetViewportLocation, InCameraParameter) == 0x000000, "Member 'CameraBlueprintFunctions_GetViewportLocation::InCameraParameter' has a wrong offset!");
static_assert(offsetof(CameraBlueprintFunctions_GetViewportLocation, ReturnValue) == 0x000068, "Member 'CameraBlueprintFunctions_GetViewportLocation::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraBlueprintInterface.GetCameraInstanceClass
// 0x0008 (0x0008 - 0x0000)
struct CameraBlueprintInterface_GetCameraInstanceClass final
{
public:
	TSubclassOf<class UCameraInstance>            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraBlueprintInterface_GetCameraInstanceClass) == 0x000008, "Wrong alignment on CameraBlueprintInterface_GetCameraInstanceClass");
static_assert(sizeof(CameraBlueprintInterface_GetCameraInstanceClass) == 0x000008, "Wrong size on CameraBlueprintInterface_GetCameraInstanceClass");
static_assert(offsetof(CameraBlueprintInterface_GetCameraInstanceClass, ReturnValue) == 0x000000, "Member 'CameraBlueprintInterface_GetCameraInstanceClass::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraDynamicNode.Exit
// 0x0004 (0x0004 - 0x0000)
struct CameraDynamicNode_Exit final
{
public:
	float                                         BlendOutTime;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraDynamicNode_Exit) == 0x000004, "Wrong alignment on CameraDynamicNode_Exit");
static_assert(sizeof(CameraDynamicNode_Exit) == 0x000004, "Wrong size on CameraDynamicNode_Exit");
static_assert(offsetof(CameraDynamicNode_Exit, BlendOutTime) == 0x000000, "Member 'CameraDynamicNode_Exit::BlendOutTime' has a wrong offset!");

// Function CameraBlueprint.CameraDynamicNode.K2_Evaluate
// 0x00D0 (0x00D0 - 0x0000)
struct CameraDynamicNode_K2_Evaluate final
{
public:
	struct FCameraParameter                       Source;                                            // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FCameraParameter                       Output;                                            // 0x0068(0x0068)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraDynamicNode_K2_Evaluate) == 0x000004, "Wrong alignment on CameraDynamicNode_K2_Evaluate");
static_assert(sizeof(CameraDynamicNode_K2_Evaluate) == 0x0000D0, "Wrong size on CameraDynamicNode_K2_Evaluate");
static_assert(offsetof(CameraDynamicNode_K2_Evaluate, Source) == 0x000000, "Member 'CameraDynamicNode_K2_Evaluate::Source' has a wrong offset!");
static_assert(offsetof(CameraDynamicNode_K2_Evaluate, Output) == 0x000068, "Member 'CameraDynamicNode_K2_Evaluate::Output' has a wrong offset!");

// Function CameraBlueprint.CameraDynamicNode.K2_Update
// 0x000C (0x000C - 0x0000)
struct CameraDynamicNode_K2_Update final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PreviousWeight;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentWeight;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraDynamicNode_K2_Update) == 0x000004, "Wrong alignment on CameraDynamicNode_K2_Update");
static_assert(sizeof(CameraDynamicNode_K2_Update) == 0x00000C, "Wrong size on CameraDynamicNode_K2_Update");
static_assert(offsetof(CameraDynamicNode_K2_Update, DeltaTime) == 0x000000, "Member 'CameraDynamicNode_K2_Update::DeltaTime' has a wrong offset!");
static_assert(offsetof(CameraDynamicNode_K2_Update, PreviousWeight) == 0x000004, "Member 'CameraDynamicNode_K2_Update::PreviousWeight' has a wrong offset!");
static_assert(offsetof(CameraDynamicNode_K2_Update, CurrentWeight) == 0x000008, "Member 'CameraDynamicNode_K2_Update::CurrentWeight' has a wrong offset!");

// Function CameraBlueprint.CameraDynamicNode.SetCameraLagInterpSpeed
// 0x000C (0x000C - 0x0000)
struct CameraDynamicNode_SetCameraLagInterpSpeed final
{
public:
	struct FVector                                InterpSpeed;                                       // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraDynamicNode_SetCameraLagInterpSpeed) == 0x000004, "Wrong alignment on CameraDynamicNode_SetCameraLagInterpSpeed");
static_assert(sizeof(CameraDynamicNode_SetCameraLagInterpSpeed) == 0x00000C, "Wrong size on CameraDynamicNode_SetCameraLagInterpSpeed");
static_assert(offsetof(CameraDynamicNode_SetCameraLagInterpSpeed, InterpSpeed) == 0x000000, "Member 'CameraDynamicNode_SetCameraLagInterpSpeed::InterpSpeed' has a wrong offset!");

// Function CameraBlueprint.CameraDynamicNode.GetActiveTime
// 0x0004 (0x0004 - 0x0000)
struct CameraDynamicNode_GetActiveTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraDynamicNode_GetActiveTime) == 0x000004, "Wrong alignment on CameraDynamicNode_GetActiveTime");
static_assert(sizeof(CameraDynamicNode_GetActiveTime) == 0x000004, "Wrong size on CameraDynamicNode_GetActiveTime");
static_assert(offsetof(CameraDynamicNode_GetActiveTime, ReturnValue) == 0x000000, "Member 'CameraDynamicNode_GetActiveTime::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraDynamicNode.GetBlendOutTime
// 0x0010 (0x0010 - 0x0000)
struct CameraDynamicNode_GetBlendOutTime final
{
public:
	class AActor*                                 ViewTargetActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CameraDynamicNode_GetBlendOutTime) == 0x000008, "Wrong alignment on CameraDynamicNode_GetBlendOutTime");
static_assert(sizeof(CameraDynamicNode_GetBlendOutTime) == 0x000010, "Wrong size on CameraDynamicNode_GetBlendOutTime");
static_assert(offsetof(CameraDynamicNode_GetBlendOutTime, ViewTargetActor) == 0x000000, "Member 'CameraDynamicNode_GetBlendOutTime::ViewTargetActor' has a wrong offset!");
static_assert(offsetof(CameraDynamicNode_GetBlendOutTime, ReturnValue) == 0x000008, "Member 'CameraDynamicNode_GetBlendOutTime::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraDynamicNode.GetCameraInstance
// 0x0008 (0x0008 - 0x0000)
struct CameraDynamicNode_GetCameraInstance final
{
public:
	class UCameraInstance*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraDynamicNode_GetCameraInstance) == 0x000008, "Wrong alignment on CameraDynamicNode_GetCameraInstance");
static_assert(sizeof(CameraDynamicNode_GetCameraInstance) == 0x000008, "Wrong size on CameraDynamicNode_GetCameraInstance");
static_assert(offsetof(CameraDynamicNode_GetCameraInstance, ReturnValue) == 0x000000, "Member 'CameraDynamicNode_GetCameraInstance::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraDynamicNode.GetPlayerController
// 0x0008 (0x0008 - 0x0000)
struct CameraDynamicNode_GetPlayerController final
{
public:
	class APlayerController*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraDynamicNode_GetPlayerController) == 0x000008, "Wrong alignment on CameraDynamicNode_GetPlayerController");
static_assert(sizeof(CameraDynamicNode_GetPlayerController) == 0x000008, "Wrong size on CameraDynamicNode_GetPlayerController");
static_assert(offsetof(CameraDynamicNode_GetPlayerController, ReturnValue) == 0x000000, "Member 'CameraDynamicNode_GetPlayerController::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraDynamicNode.GetViewRotation
// 0x000C (0x000C - 0x0000)
struct CameraDynamicNode_GetViewRotation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraDynamicNode_GetViewRotation) == 0x000004, "Wrong alignment on CameraDynamicNode_GetViewRotation");
static_assert(sizeof(CameraDynamicNode_GetViewRotation) == 0x00000C, "Wrong size on CameraDynamicNode_GetViewRotation");
static_assert(offsetof(CameraDynamicNode_GetViewRotation, ReturnValue) == 0x000000, "Member 'CameraDynamicNode_GetViewRotation::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraDynamicNode.GetViewTarget
// 0x0008 (0x0008 - 0x0000)
struct CameraDynamicNode_GetViewTarget final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraDynamicNode_GetViewTarget) == 0x000008, "Wrong alignment on CameraDynamicNode_GetViewTarget");
static_assert(sizeof(CameraDynamicNode_GetViewTarget) == 0x000008, "Wrong size on CameraDynamicNode_GetViewTarget");
static_assert(offsetof(CameraDynamicNode_GetViewTarget, ReturnValue) == 0x000000, "Member 'CameraDynamicNode_GetViewTarget::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraDynamicNode.GetViewTargetBaseTransform
// 0x0030 (0x0030 - 0x0000)
struct CameraDynamicNode_GetViewTargetBaseTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraDynamicNode_GetViewTargetBaseTransform) == 0x000010, "Wrong alignment on CameraDynamicNode_GetViewTargetBaseTransform");
static_assert(sizeof(CameraDynamicNode_GetViewTargetBaseTransform) == 0x000030, "Wrong size on CameraDynamicNode_GetViewTargetBaseTransform");
static_assert(offsetof(CameraDynamicNode_GetViewTargetBaseTransform, ReturnValue) == 0x000000, "Member 'CameraDynamicNode_GetViewTargetBaseTransform::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CameraDynamicNode.IsBlendingOut
// 0x0001 (0x0001 - 0x0000)
struct CameraDynamicNode_IsBlendingOut final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraDynamicNode_IsBlendingOut) == 0x000001, "Wrong alignment on CameraDynamicNode_IsBlendingOut");
static_assert(sizeof(CameraDynamicNode_IsBlendingOut) == 0x000001, "Wrong size on CameraDynamicNode_IsBlendingOut");
static_assert(offsetof(CameraDynamicNode_IsBlendingOut, ReturnValue) == 0x000000, "Member 'CameraDynamicNode_IsBlendingOut::ReturnValue' has a wrong offset!");

// Function CameraBlueprint.CBPlayerCameraManager.SetCameraInstanceClass
// 0x0018 (0x0018 - 0x0000)
struct CBPlayerCameraManager_SetCameraInstanceClass final
{
public:
	class UClass*                                 NewCameraClass;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCameraInstanceTransitionParams        TransitionParams;                                  // 0x0008(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CBPlayerCameraManager_SetCameraInstanceClass) == 0x000008, "Wrong alignment on CBPlayerCameraManager_SetCameraInstanceClass");
static_assert(sizeof(CBPlayerCameraManager_SetCameraInstanceClass) == 0x000018, "Wrong size on CBPlayerCameraManager_SetCameraInstanceClass");
static_assert(offsetof(CBPlayerCameraManager_SetCameraInstanceClass, NewCameraClass) == 0x000000, "Member 'CBPlayerCameraManager_SetCameraInstanceClass::NewCameraClass' has a wrong offset!");
static_assert(offsetof(CBPlayerCameraManager_SetCameraInstanceClass, TransitionParams) == 0x000008, "Member 'CBPlayerCameraManager_SetCameraInstanceClass::TransitionParams' has a wrong offset!");

// Function CameraBlueprint.CBPlayerCameraManager.GetCameraInstance
// 0x0008 (0x0008 - 0x0000)
struct CBPlayerCameraManager_GetCameraInstance final
{
public:
	class UCameraInstance*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CBPlayerCameraManager_GetCameraInstance) == 0x000008, "Wrong alignment on CBPlayerCameraManager_GetCameraInstance");
static_assert(sizeof(CBPlayerCameraManager_GetCameraInstance) == 0x000008, "Wrong size on CBPlayerCameraManager_GetCameraInstance");
static_assert(offsetof(CBPlayerCameraManager_GetCameraInstance, ReturnValue) == 0x000000, "Member 'CBPlayerCameraManager_GetCameraInstance::ReturnValue' has a wrong offset!");

}

