#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CangFeng_SwordEnergyComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CangFeng_SwordEnergyComponent.CangFeng_SwordEnergyComponent_C
// 0x0018 (0x0078 - 0x0060)
class UCangFeng_SwordEnergyComponent_C final : public UAbilitySpecialAttribute
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0060(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         DecreasePerSecond;                                 // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RefreshLimitSecond;                                // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurSecond;                                         // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetAttribute(class UAbilityComponentBase* InOwner, float ChangeValue);
	void K2_ReceiveTick(float DeltaSeconds, const class UAbilityComponentBase* InOwner);
	void K2_ReceiveActive(const class UObject* Instigator, bool bReActive);
	void ExecuteUbergraph_CangFeng_SwordEnergyComponent(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CangFeng_SwordEnergyComponent_C">();
	}
	static class UCangFeng_SwordEnergyComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCangFeng_SwordEnergyComponent_C>();
	}
};
static_assert(alignof(UCangFeng_SwordEnergyComponent_C) == 0x000008, "Wrong alignment on UCangFeng_SwordEnergyComponent_C");
static_assert(sizeof(UCangFeng_SwordEnergyComponent_C) == 0x000078, "Wrong size on UCangFeng_SwordEnergyComponent_C");
static_assert(offsetof(UCangFeng_SwordEnergyComponent_C, UberGraphFrame) == 0x000060, "Member 'UCangFeng_SwordEnergyComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCangFeng_SwordEnergyComponent_C, DecreasePerSecond) == 0x000068, "Member 'UCangFeng_SwordEnergyComponent_C::DecreasePerSecond' has a wrong offset!");
static_assert(offsetof(UCangFeng_SwordEnergyComponent_C, RefreshLimitSecond) == 0x00006C, "Member 'UCangFeng_SwordEnergyComponent_C::RefreshLimitSecond' has a wrong offset!");
static_assert(offsetof(UCangFeng_SwordEnergyComponent_C, CurSecond) == 0x000070, "Member 'UCangFeng_SwordEnergyComponent_C::CurSecond' has a wrong offset!");

}

