#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cartoon

#include "Basic.hpp"


namespace SDK
{

// Enum Cartoon.ECartoonCompleteType
// NumValues: 0x0004
enum class ECartoonCompleteType : uint8
{
	Normal                                   = 0,
	Skip                                     = 1,
	Close                                    = 2,
	ECartoonCompleteType_MAX                 = 3,
};

// ScriptStruct Cartoon.CartoonEndData
// 0x0018 (0x0018 - 0x0000)
struct FCartoonEndData final
{
public:
	bool                                          IsSuccess;                                         // 0x0000(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ChoiceKeys;                                        // 0x0008(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCartoonEndData) == 0x000008, "Wrong alignment on FCartoonEndData");
static_assert(sizeof(FCartoonEndData) == 0x000018, "Wrong size on FCartoonEndData");
static_assert(offsetof(FCartoonEndData, IsSuccess) == 0x000000, "Member 'FCartoonEndData::IsSuccess' has a wrong offset!");
static_assert(offsetof(FCartoonEndData, ChoiceKeys) == 0x000008, "Member 'FCartoonEndData::ChoiceKeys' has a wrong offset!");

// ScriptStruct Cartoon.CartoonObject
// 0x0018 (0x0018 - 0x0000)
struct FCartoonObject final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        List;                                              // 0x0008(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCartoonObject) == 0x000008, "Wrong alignment on FCartoonObject");
static_assert(sizeof(FCartoonObject) == 0x000018, "Wrong size on FCartoonObject");
static_assert(offsetof(FCartoonObject, List) == 0x000008, "Member 'FCartoonObject::List' has a wrong offset!");

// ScriptStruct Cartoon.ObjectManager
// 0x0170 (0x0170 - 0x0000)
struct FObjectManager final
{
public:
	class ACartoonRuntime*                        Runtime;                                           // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FCartoonObject>      Objects;                                           // 0x0008(0x0050)(Transient, NativeAccessSpecifierPublic)
	TArray<class ACharacter*>                     AllCharacters;                                     // 0x0058(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TMap<int32, class USceneComponent*>           Components;                                        // 0x0068(0x0050)(ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TMap<int32, class AActor*>                    AllActors;                                         // 0x00B8(0x0050)(Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0x68];                                     // 0x0108(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FObjectManager) == 0x000008, "Wrong alignment on FObjectManager");
static_assert(sizeof(FObjectManager) == 0x000170, "Wrong size on FObjectManager");
static_assert(offsetof(FObjectManager, Runtime) == 0x000000, "Member 'FObjectManager::Runtime' has a wrong offset!");
static_assert(offsetof(FObjectManager, Objects) == 0x000008, "Member 'FObjectManager::Objects' has a wrong offset!");
static_assert(offsetof(FObjectManager, AllCharacters) == 0x000058, "Member 'FObjectManager::AllCharacters' has a wrong offset!");
static_assert(offsetof(FObjectManager, Components) == 0x000068, "Member 'FObjectManager::Components' has a wrong offset!");
static_assert(offsetof(FObjectManager, AllActors) == 0x0000B8, "Member 'FObjectManager::AllActors' has a wrong offset!");

// ScriptStruct Cartoon.CartoonChoiceData
// 0x0018 (0x0018 - 0x0000)
struct FCartoonChoiceData final
{
public:
	class FString                                 Option;                                            // 0x0000(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Style;                                             // 0x0010(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsHidden;                                          // 0x0014(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCartoonChoiceData) == 0x000008, "Wrong alignment on FCartoonChoiceData");
static_assert(sizeof(FCartoonChoiceData) == 0x000018, "Wrong size on FCartoonChoiceData");
static_assert(offsetof(FCartoonChoiceData, Option) == 0x000000, "Member 'FCartoonChoiceData::Option' has a wrong offset!");
static_assert(offsetof(FCartoonChoiceData, Style) == 0x000010, "Member 'FCartoonChoiceData::Style' has a wrong offset!");
static_assert(offsetof(FCartoonChoiceData, IsHidden) == 0x000014, "Member 'FCartoonChoiceData::IsHidden' has a wrong offset!");

}

