#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cartoon

#include "Basic.hpp"

#include "Cartoon_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Cartoon.CartoonActionWidget.GetParam
// 0x0030 (0x0030 - 0x0000)
struct CartoonActionWidget_GetParam final
{
public:
	class FString                                 InKey;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InDefault;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonActionWidget_GetParam) == 0x000008, "Wrong alignment on CartoonActionWidget_GetParam");
static_assert(sizeof(CartoonActionWidget_GetParam) == 0x000030, "Wrong size on CartoonActionWidget_GetParam");
static_assert(offsetof(CartoonActionWidget_GetParam, InKey) == 0x000000, "Member 'CartoonActionWidget_GetParam::InKey' has a wrong offset!");
static_assert(offsetof(CartoonActionWidget_GetParam, InDefault) == 0x000010, "Member 'CartoonActionWidget_GetParam::InDefault' has a wrong offset!");
static_assert(offsetof(CartoonActionWidget_GetParam, ReturnValue) == 0x000020, "Member 'CartoonActionWidget_GetParam::ReturnValue' has a wrong offset!");

// Function Cartoon.CartoonActionWidget.LuaImpl_IsComplete
// 0x0001 (0x0001 - 0x0000)
struct CartoonActionWidget_LuaImpl_IsComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonActionWidget_LuaImpl_IsComplete) == 0x000001, "Wrong alignment on CartoonActionWidget_LuaImpl_IsComplete");
static_assert(sizeof(CartoonActionWidget_LuaImpl_IsComplete) == 0x000001, "Wrong size on CartoonActionWidget_LuaImpl_IsComplete");
static_assert(offsetof(CartoonActionWidget_LuaImpl_IsComplete, ReturnValue) == 0x000000, "Member 'CartoonActionWidget_LuaImpl_IsComplete::ReturnValue' has a wrong offset!");

// Function Cartoon.CartoonActionWidget.LuaImpl_OnBegin
// 0x0010 (0x0010 - 0x0000)
struct CartoonActionWidget_LuaImpl_OnBegin final
{
public:
	class FString                                 ActionName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonActionWidget_LuaImpl_OnBegin) == 0x000008, "Wrong alignment on CartoonActionWidget_LuaImpl_OnBegin");
static_assert(sizeof(CartoonActionWidget_LuaImpl_OnBegin) == 0x000010, "Wrong size on CartoonActionWidget_LuaImpl_OnBegin");
static_assert(offsetof(CartoonActionWidget_LuaImpl_OnBegin, ActionName) == 0x000000, "Member 'CartoonActionWidget_LuaImpl_OnBegin::ActionName' has a wrong offset!");

// Function Cartoon.CartoonActionWidget.LuaImpl_OnTick
// 0x0004 (0x0004 - 0x0000)
struct CartoonActionWidget_LuaImpl_OnTick final
{
public:
	float                                         InTime;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonActionWidget_LuaImpl_OnTick) == 0x000004, "Wrong alignment on CartoonActionWidget_LuaImpl_OnTick");
static_assert(sizeof(CartoonActionWidget_LuaImpl_OnTick) == 0x000004, "Wrong size on CartoonActionWidget_LuaImpl_OnTick");
static_assert(offsetof(CartoonActionWidget_LuaImpl_OnTick, InTime) == 0x000000, "Member 'CartoonActionWidget_LuaImpl_OnTick::InTime' has a wrong offset!");

// Function Cartoon.CameraShakeActionWidget.BeginShake
// 0x0010 (0x0010 - 0x0000)
struct CameraShakeActionWidget_BeginShake final
{
public:
	class UMaterialInstanceDynamic*               InMaterial;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InKey;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraShakeActionWidget_BeginShake) == 0x000008, "Wrong alignment on CameraShakeActionWidget_BeginShake");
static_assert(sizeof(CameraShakeActionWidget_BeginShake) == 0x000010, "Wrong size on CameraShakeActionWidget_BeginShake");
static_assert(offsetof(CameraShakeActionWidget_BeginShake, InMaterial) == 0x000000, "Member 'CameraShakeActionWidget_BeginShake::InMaterial' has a wrong offset!");
static_assert(offsetof(CameraShakeActionWidget_BeginShake, InKey) == 0x000008, "Member 'CameraShakeActionWidget_BeginShake::InKey' has a wrong offset!");

// Function Cartoon.CartoonBGImage.SetPath
// 0x0010 (0x0010 - 0x0000)
struct CartoonBGImage_SetPath final
{
public:
	class FString                                 InPath;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonBGImage_SetPath) == 0x000008, "Wrong alignment on CartoonBGImage_SetPath");
static_assert(sizeof(CartoonBGImage_SetPath) == 0x000010, "Wrong size on CartoonBGImage_SetPath");
static_assert(offsetof(CartoonBGImage_SetPath, InPath) == 0x000000, "Member 'CartoonBGImage_SetPath::InPath' has a wrong offset!");

// Function Cartoon.CartoonCameraAnimSystem.GoToAnimStartPos
// 0x0008 (0x0008 - 0x0000)
struct CartoonCameraAnimSystem_GoToAnimStartPos final
{
public:
	int32                                         InAnimId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InSmoothTime;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonCameraAnimSystem_GoToAnimStartPos) == 0x000004, "Wrong alignment on CartoonCameraAnimSystem_GoToAnimStartPos");
static_assert(sizeof(CartoonCameraAnimSystem_GoToAnimStartPos) == 0x000008, "Wrong size on CartoonCameraAnimSystem_GoToAnimStartPos");
static_assert(offsetof(CartoonCameraAnimSystem_GoToAnimStartPos, InAnimId) == 0x000000, "Member 'CartoonCameraAnimSystem_GoToAnimStartPos::InAnimId' has a wrong offset!");
static_assert(offsetof(CartoonCameraAnimSystem_GoToAnimStartPos, InSmoothTime) == 0x000004, "Member 'CartoonCameraAnimSystem_GoToAnimStartPos::InSmoothTime' has a wrong offset!");

// Function Cartoon.CartoonCameraAnimSystem.Play
// 0x000C (0x000C - 0x0000)
struct CartoonCameraAnimSystem_Play final
{
public:
	int32                                         InAnimId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InSmoothTime;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CartoonCameraAnimSystem_Play) == 0x000004, "Wrong alignment on CartoonCameraAnimSystem_Play");
static_assert(sizeof(CartoonCameraAnimSystem_Play) == 0x00000C, "Wrong size on CartoonCameraAnimSystem_Play");
static_assert(offsetof(CartoonCameraAnimSystem_Play, InAnimId) == 0x000000, "Member 'CartoonCameraAnimSystem_Play::InAnimId' has a wrong offset!");
static_assert(offsetof(CartoonCameraAnimSystem_Play, InSmoothTime) == 0x000004, "Member 'CartoonCameraAnimSystem_Play::InSmoothTime' has a wrong offset!");
static_assert(offsetof(CartoonCameraAnimSystem_Play, ReturnValue) == 0x000008, "Member 'CartoonCameraAnimSystem_Play::ReturnValue' has a wrong offset!");

// Function Cartoon.CartoonCameraAnimSystem.Reset
// 0x0004 (0x0004 - 0x0000)
struct CartoonCameraAnimSystem_Reset final
{
public:
	float                                         InSmoothTime;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonCameraAnimSystem_Reset) == 0x000004, "Wrong alignment on CartoonCameraAnimSystem_Reset");
static_assert(sizeof(CartoonCameraAnimSystem_Reset) == 0x000004, "Wrong size on CartoonCameraAnimSystem_Reset");
static_assert(offsetof(CartoonCameraAnimSystem_Reset, InSmoothTime) == 0x000000, "Member 'CartoonCameraAnimSystem_Reset::InSmoothTime' has a wrong offset!");

// Function Cartoon.CartoonCameraAnimSystem.IsPlaying
// 0x0001 (0x0001 - 0x0000)
struct CartoonCameraAnimSystem_IsPlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonCameraAnimSystem_IsPlaying) == 0x000001, "Wrong alignment on CartoonCameraAnimSystem_IsPlaying");
static_assert(sizeof(CartoonCameraAnimSystem_IsPlaying) == 0x000001, "Wrong size on CartoonCameraAnimSystem_IsPlaying");
static_assert(offsetof(CartoonCameraAnimSystem_IsPlaying, ReturnValue) == 0x000000, "Member 'CartoonCameraAnimSystem_IsPlaying::ReturnValue' has a wrong offset!");

// Function Cartoon.CartoonRuntime.HasTag
// 0x000C (0x000C - 0x0000)
struct CartoonRuntime_HasTag final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CartoonRuntime_HasTag) == 0x000004, "Wrong alignment on CartoonRuntime_HasTag");
static_assert(sizeof(CartoonRuntime_HasTag) == 0x00000C, "Wrong size on CartoonRuntime_HasTag");
static_assert(offsetof(CartoonRuntime_HasTag, InName) == 0x000000, "Member 'CartoonRuntime_HasTag::InName' has a wrong offset!");
static_assert(offsetof(CartoonRuntime_HasTag, ReturnValue) == 0x000008, "Member 'CartoonRuntime_HasTag::ReturnValue' has a wrong offset!");

// Function Cartoon.CartoonRuntime.IsFix
// 0x0001 (0x0001 - 0x0000)
struct CartoonRuntime_IsFix final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonRuntime_IsFix) == 0x000001, "Wrong alignment on CartoonRuntime_IsFix");
static_assert(sizeof(CartoonRuntime_IsFix) == 0x000001, "Wrong size on CartoonRuntime_IsFix");
static_assert(offsetof(CartoonRuntime_IsFix, ReturnValue) == 0x000000, "Member 'CartoonRuntime_IsFix::ReturnValue' has a wrong offset!");

// Function Cartoon.CartoonSettingSystem.GetImagePath
// 0x0028 (0x0028 - 0x0000)
struct CartoonSettingSystem_GetImagePath final
{
public:
	class FString                                 InName;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFix;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonSettingSystem_GetImagePath) == 0x000008, "Wrong alignment on CartoonSettingSystem_GetImagePath");
static_assert(sizeof(CartoonSettingSystem_GetImagePath) == 0x000028, "Wrong size on CartoonSettingSystem_GetImagePath");
static_assert(offsetof(CartoonSettingSystem_GetImagePath, InName) == 0x000000, "Member 'CartoonSettingSystem_GetImagePath::InName' has a wrong offset!");
static_assert(offsetof(CartoonSettingSystem_GetImagePath, IsFix) == 0x000010, "Member 'CartoonSettingSystem_GetImagePath::IsFix' has a wrong offset!");
static_assert(offsetof(CartoonSettingSystem_GetImagePath, ReturnValue) == 0x000018, "Member 'CartoonSettingSystem_GetImagePath::ReturnValue' has a wrong offset!");

// Function Cartoon.CartoonSpineWidget.LuaImpl_CheckResourceAmend
// 0x0020 (0x0020 - 0x0000)
struct CartoonSpineWidget_LuaImpl_CheckResourceAmend final
{
public:
	class FString                                 InPath;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonSpineWidget_LuaImpl_CheckResourceAmend) == 0x000008, "Wrong alignment on CartoonSpineWidget_LuaImpl_CheckResourceAmend");
static_assert(sizeof(CartoonSpineWidget_LuaImpl_CheckResourceAmend) == 0x000020, "Wrong size on CartoonSpineWidget_LuaImpl_CheckResourceAmend");
static_assert(offsetof(CartoonSpineWidget_LuaImpl_CheckResourceAmend, InPath) == 0x000000, "Member 'CartoonSpineWidget_LuaImpl_CheckResourceAmend::InPath' has a wrong offset!");
static_assert(offsetof(CartoonSpineWidget_LuaImpl_CheckResourceAmend, ReturnValue) == 0x000010, "Member 'CartoonSpineWidget_LuaImpl_CheckResourceAmend::ReturnValue' has a wrong offset!");

// Function Cartoon.CartoonSpineWidget.LuaImpl_GetEffecMaterialPathByType
// 0x0018 (0x0018 - 0x0000)
struct CartoonSpineWidget_LuaImpl_GetEffecMaterialPathByType final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonSpineWidget_LuaImpl_GetEffecMaterialPathByType) == 0x000008, "Wrong alignment on CartoonSpineWidget_LuaImpl_GetEffecMaterialPathByType");
static_assert(sizeof(CartoonSpineWidget_LuaImpl_GetEffecMaterialPathByType) == 0x000018, "Wrong size on CartoonSpineWidget_LuaImpl_GetEffecMaterialPathByType");
static_assert(offsetof(CartoonSpineWidget_LuaImpl_GetEffecMaterialPathByType, InType) == 0x000000, "Member 'CartoonSpineWidget_LuaImpl_GetEffecMaterialPathByType::InType' has a wrong offset!");
static_assert(offsetof(CartoonSpineWidget_LuaImpl_GetEffecMaterialPathByType, ReturnValue) == 0x000008, "Member 'CartoonSpineWidget_LuaImpl_GetEffecMaterialPathByType::ReturnValue' has a wrong offset!");

// Function Cartoon.CartoonSpineWidget.OnEffectAnimationCompleteHandler
// 0x0010 (0x0010 - 0x0000)
struct CartoonSpineWidget_OnEffectAnimationCompleteHandler final
{
public:
	class UObject*                                InDispatcher;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTrackEntry*                            InEntry;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonSpineWidget_OnEffectAnimationCompleteHandler) == 0x000008, "Wrong alignment on CartoonSpineWidget_OnEffectAnimationCompleteHandler");
static_assert(sizeof(CartoonSpineWidget_OnEffectAnimationCompleteHandler) == 0x000010, "Wrong size on CartoonSpineWidget_OnEffectAnimationCompleteHandler");
static_assert(offsetof(CartoonSpineWidget_OnEffectAnimationCompleteHandler, InDispatcher) == 0x000000, "Member 'CartoonSpineWidget_OnEffectAnimationCompleteHandler::InDispatcher' has a wrong offset!");
static_assert(offsetof(CartoonSpineWidget_OnEffectAnimationCompleteHandler, InEntry) == 0x000008, "Member 'CartoonSpineWidget_OnEffectAnimationCompleteHandler::InEntry' has a wrong offset!");

// Function Cartoon.CartoonSpineWidget.SetSpineImageAlpha
// 0x0004 (0x0004 - 0x0000)
struct CartoonSpineWidget_SetSpineImageAlpha final
{
public:
	float                                         Alpha;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonSpineWidget_SetSpineImageAlpha) == 0x000004, "Wrong alignment on CartoonSpineWidget_SetSpineImageAlpha");
static_assert(sizeof(CartoonSpineWidget_SetSpineImageAlpha) == 0x000004, "Wrong size on CartoonSpineWidget_SetSpineImageAlpha");
static_assert(offsetof(CartoonSpineWidget_SetSpineImageAlpha, Alpha) == 0x000000, "Member 'CartoonSpineWidget_SetSpineImageAlpha::Alpha' has a wrong offset!");

// Function Cartoon.CartoonWidget.AllocActionWidget
// 0x0018 (0x0018 - 0x0000)
struct CartoonWidget_AllocActionWidget final
{
public:
	class FString                                 InActionName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCartoonActionWidget*                   ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonWidget_AllocActionWidget) == 0x000008, "Wrong alignment on CartoonWidget_AllocActionWidget");
static_assert(sizeof(CartoonWidget_AllocActionWidget) == 0x000018, "Wrong size on CartoonWidget_AllocActionWidget");
static_assert(offsetof(CartoonWidget_AllocActionWidget, InActionName) == 0x000000, "Member 'CartoonWidget_AllocActionWidget::InActionName' has a wrong offset!");
static_assert(offsetof(CartoonWidget_AllocActionWidget, ReturnValue) == 0x000010, "Member 'CartoonWidget_AllocActionWidget::ReturnValue' has a wrong offset!");

// Function Cartoon.CartoonWidget.AllocRichmanSpine
// 0x0010 (0x0010 - 0x0000)
struct CartoonWidget_AllocRichmanSpine final
{
public:
	int32                                         InPosType;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCartoonSpineWidget*                    ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonWidget_AllocRichmanSpine) == 0x000008, "Wrong alignment on CartoonWidget_AllocRichmanSpine");
static_assert(sizeof(CartoonWidget_AllocRichmanSpine) == 0x000010, "Wrong size on CartoonWidget_AllocRichmanSpine");
static_assert(offsetof(CartoonWidget_AllocRichmanSpine, InPosType) == 0x000000, "Member 'CartoonWidget_AllocRichmanSpine::InPosType' has a wrong offset!");
static_assert(offsetof(CartoonWidget_AllocRichmanSpine, ReturnValue) == 0x000008, "Member 'CartoonWidget_AllocRichmanSpine::ReturnValue' has a wrong offset!");

// Function Cartoon.CartoonWidget.AllocSpineWidget
// 0x0008 (0x0008 - 0x0000)
struct CartoonWidget_AllocSpineWidget final
{
public:
	class UCartoonSpineWidget*                    ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonWidget_AllocSpineWidget) == 0x000008, "Wrong alignment on CartoonWidget_AllocSpineWidget");
static_assert(sizeof(CartoonWidget_AllocSpineWidget) == 0x000008, "Wrong size on CartoonWidget_AllocSpineWidget");
static_assert(offsetof(CartoonWidget_AllocSpineWidget, ReturnValue) == 0x000000, "Member 'CartoonWidget_AllocSpineWidget::ReturnValue' has a wrong offset!");

// Function Cartoon.CartoonWidget.CheckCondition
// 0x0018 (0x0018 - 0x0000)
struct CartoonWidget_CheckCondition final
{
public:
	class FString                                 InContent;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CartoonWidget_CheckCondition) == 0x000008, "Wrong alignment on CartoonWidget_CheckCondition");
static_assert(sizeof(CartoonWidget_CheckCondition) == 0x000018, "Wrong size on CartoonWidget_CheckCondition");
static_assert(offsetof(CartoonWidget_CheckCondition, InContent) == 0x000000, "Member 'CartoonWidget_CheckCondition::InContent' has a wrong offset!");
static_assert(offsetof(CartoonWidget_CheckCondition, ReturnValue) == 0x000010, "Member 'CartoonWidget_CheckCondition::ReturnValue' has a wrong offset!");

// Function Cartoon.CartoonWidget.CheckIsAutoPlay
// 0x0001 (0x0001 - 0x0000)
struct CartoonWidget_CheckIsAutoPlay final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonWidget_CheckIsAutoPlay) == 0x000001, "Wrong alignment on CartoonWidget_CheckIsAutoPlay");
static_assert(sizeof(CartoonWidget_CheckIsAutoPlay) == 0x000001, "Wrong size on CartoonWidget_CheckIsAutoPlay");
static_assert(offsetof(CartoonWidget_CheckIsAutoPlay, ReturnValue) == 0x000000, "Member 'CartoonWidget_CheckIsAutoPlay::ReturnValue' has a wrong offset!");

// Function Cartoon.CartoonWidget.FreeActionWidget
// 0x0008 (0x0008 - 0x0000)
struct CartoonWidget_FreeActionWidget final
{
public:
	class UCartoonActionWidget*                   InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonWidget_FreeActionWidget) == 0x000008, "Wrong alignment on CartoonWidget_FreeActionWidget");
static_assert(sizeof(CartoonWidget_FreeActionWidget) == 0x000008, "Wrong size on CartoonWidget_FreeActionWidget");
static_assert(offsetof(CartoonWidget_FreeActionWidget, InWidget) == 0x000000, "Member 'CartoonWidget_FreeActionWidget::InWidget' has a wrong offset!");

// Function Cartoon.CartoonWidget.FreeSpineWidget
// 0x0008 (0x0008 - 0x0000)
struct CartoonWidget_FreeSpineWidget final
{
public:
	class UCartoonSpineWidget*                    InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonWidget_FreeSpineWidget) == 0x000008, "Wrong alignment on CartoonWidget_FreeSpineWidget");
static_assert(sizeof(CartoonWidget_FreeSpineWidget) == 0x000008, "Wrong size on CartoonWidget_FreeSpineWidget");
static_assert(offsetof(CartoonWidget_FreeSpineWidget, InWidget) == 0x000000, "Member 'CartoonWidget_FreeSpineWidget::InWidget' has a wrong offset!");

// Function Cartoon.CartoonWidget.GetBackgroundImageSize
// 0x0008 (0x0008 - 0x0000)
struct CartoonWidget_GetBackgroundImageSize final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonWidget_GetBackgroundImageSize) == 0x000004, "Wrong alignment on CartoonWidget_GetBackgroundImageSize");
static_assert(sizeof(CartoonWidget_GetBackgroundImageSize) == 0x000008, "Wrong size on CartoonWidget_GetBackgroundImageSize");
static_assert(offsetof(CartoonWidget_GetBackgroundImageSize, ReturnValue) == 0x000000, "Member 'CartoonWidget_GetBackgroundImageSize::ReturnValue' has a wrong offset!");

// Function Cartoon.CartoonWidget.LuaCloseCameraEffect
// 0x0008 (0x0008 - 0x0000)
struct CartoonWidget_LuaCloseCameraEffect final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InTime;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonWidget_LuaCloseCameraEffect) == 0x000004, "Wrong alignment on CartoonWidget_LuaCloseCameraEffect");
static_assert(sizeof(CartoonWidget_LuaCloseCameraEffect) == 0x000008, "Wrong size on CartoonWidget_LuaCloseCameraEffect");
static_assert(offsetof(CartoonWidget_LuaCloseCameraEffect, InType) == 0x000000, "Member 'CartoonWidget_LuaCloseCameraEffect::InType' has a wrong offset!");
static_assert(offsetof(CartoonWidget_LuaCloseCameraEffect, InTime) == 0x000004, "Member 'CartoonWidget_LuaCloseCameraEffect::InTime' has a wrong offset!");

// Function Cartoon.CartoonWidget.LuaImpl_NotifyChoiceEnd
// 0x0004 (0x0004 - 0x0000)
struct CartoonWidget_LuaImpl_NotifyChoiceEnd final
{
public:
	int32                                         ChoiceIndex_0;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonWidget_LuaImpl_NotifyChoiceEnd) == 0x000004, "Wrong alignment on CartoonWidget_LuaImpl_NotifyChoiceEnd");
static_assert(sizeof(CartoonWidget_LuaImpl_NotifyChoiceEnd) == 0x000004, "Wrong size on CartoonWidget_LuaImpl_NotifyChoiceEnd");
static_assert(offsetof(CartoonWidget_LuaImpl_NotifyChoiceEnd, ChoiceIndex_0) == 0x000000, "Member 'CartoonWidget_LuaImpl_NotifyChoiceEnd::ChoiceIndex_0' has a wrong offset!");

// Function Cartoon.CartoonWidget.LuaImpl_NotifySkipEnabeld
// 0x0001 (0x0001 - 0x0000)
struct CartoonWidget_LuaImpl_NotifySkipEnabeld final
{
public:
	bool                                          InValue;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonWidget_LuaImpl_NotifySkipEnabeld) == 0x000001, "Wrong alignment on CartoonWidget_LuaImpl_NotifySkipEnabeld");
static_assert(sizeof(CartoonWidget_LuaImpl_NotifySkipEnabeld) == 0x000001, "Wrong size on CartoonWidget_LuaImpl_NotifySkipEnabeld");
static_assert(offsetof(CartoonWidget_LuaImpl_NotifySkipEnabeld, InValue) == 0x000000, "Member 'CartoonWidget_LuaImpl_NotifySkipEnabeld::InValue' has a wrong offset!");

// Function Cartoon.CartoonWidget.LuaImpl_UpdateBGSize
// 0x0018 (0x0018 - 0x0000)
struct CartoonWidget_LuaImpl_UpdateBGSize final
{
public:
	class UImage*                                 InImage;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             InTexture;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CartoonWidget_LuaImpl_UpdateBGSize) == 0x000008, "Wrong alignment on CartoonWidget_LuaImpl_UpdateBGSize");
static_assert(sizeof(CartoonWidget_LuaImpl_UpdateBGSize) == 0x000018, "Wrong size on CartoonWidget_LuaImpl_UpdateBGSize");
static_assert(offsetof(CartoonWidget_LuaImpl_UpdateBGSize, InImage) == 0x000000, "Member 'CartoonWidget_LuaImpl_UpdateBGSize::InImage' has a wrong offset!");
static_assert(offsetof(CartoonWidget_LuaImpl_UpdateBGSize, InTexture) == 0x000008, "Member 'CartoonWidget_LuaImpl_UpdateBGSize::InTexture' has a wrong offset!");
static_assert(offsetof(CartoonWidget_LuaImpl_UpdateBGSize, ReturnValue) == 0x000010, "Member 'CartoonWidget_LuaImpl_UpdateBGSize::ReturnValue' has a wrong offset!");

// Function Cartoon.CartoonWidget.LuaOpenCameraEffect
// 0x0010 (0x0010 - 0x0000)
struct CartoonWidget_LuaOpenCameraEffect final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InLayer;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InOffset;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InTime;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonWidget_LuaOpenCameraEffect) == 0x000004, "Wrong alignment on CartoonWidget_LuaOpenCameraEffect");
static_assert(sizeof(CartoonWidget_LuaOpenCameraEffect) == 0x000010, "Wrong size on CartoonWidget_LuaOpenCameraEffect");
static_assert(offsetof(CartoonWidget_LuaOpenCameraEffect, InType) == 0x000000, "Member 'CartoonWidget_LuaOpenCameraEffect::InType' has a wrong offset!");
static_assert(offsetof(CartoonWidget_LuaOpenCameraEffect, InLayer) == 0x000004, "Member 'CartoonWidget_LuaOpenCameraEffect::InLayer' has a wrong offset!");
static_assert(offsetof(CartoonWidget_LuaOpenCameraEffect, InOffset) == 0x000008, "Member 'CartoonWidget_LuaOpenCameraEffect::InOffset' has a wrong offset!");
static_assert(offsetof(CartoonWidget_LuaOpenCameraEffect, InTime) == 0x00000C, "Member 'CartoonWidget_LuaOpenCameraEffect::InTime' has a wrong offset!");

// Function Cartoon.CartoonWidget.NotifyTextAnimBegin
// 0x0008 (0x0008 - 0x0000)
struct CartoonWidget_NotifyTextAnimBegin final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonWidget_NotifyTextAnimBegin) == 0x000008, "Wrong alignment on CartoonWidget_NotifyTextAnimBegin");
static_assert(sizeof(CartoonWidget_NotifyTextAnimBegin) == 0x000008, "Wrong size on CartoonWidget_NotifyTextAnimBegin");
static_assert(offsetof(CartoonWidget_NotifyTextAnimBegin, InWidget) == 0x000000, "Member 'CartoonWidget_NotifyTextAnimBegin::InWidget' has a wrong offset!");

// Function Cartoon.CartoonWidget.NotifyTextAnimEnd
// 0x0010 (0x0010 - 0x0000)
struct CartoonWidget_NotifyTextAnimEnd final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InForce;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CartoonWidget_NotifyTextAnimEnd) == 0x000008, "Wrong alignment on CartoonWidget_NotifyTextAnimEnd");
static_assert(sizeof(CartoonWidget_NotifyTextAnimEnd) == 0x000010, "Wrong size on CartoonWidget_NotifyTextAnimEnd");
static_assert(offsetof(CartoonWidget_NotifyTextAnimEnd, InWidget) == 0x000000, "Member 'CartoonWidget_NotifyTextAnimEnd::InWidget' has a wrong offset!");
static_assert(offsetof(CartoonWidget_NotifyTextAnimEnd, InForce) == 0x000008, "Member 'CartoonWidget_NotifyTextAnimEnd::InForce' has a wrong offset!");

// Function Cartoon.CartoonWidget.OnChoices
// 0x0010 (0x0010 - 0x0000)
struct CartoonWidget_OnChoices final
{
public:
	TArray<struct FCartoonChoiceData>             InOptions;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonWidget_OnChoices) == 0x000008, "Wrong alignment on CartoonWidget_OnChoices");
static_assert(sizeof(CartoonWidget_OnChoices) == 0x000010, "Wrong size on CartoonWidget_OnChoices");
static_assert(offsetof(CartoonWidget_OnChoices, InOptions) == 0x000000, "Member 'CartoonWidget_OnChoices::InOptions' has a wrong offset!");

// Function Cartoon.CartoonWidget.OnTextInfoChange
// 0x0020 (0x0020 - 0x0000)
struct CartoonWidget_OnTextInfoChange final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   InText;                                            // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonWidget_OnTextInfoChange) == 0x000008, "Wrong alignment on CartoonWidget_OnTextInfoChange");
static_assert(sizeof(CartoonWidget_OnTextInfoChange) == 0x000020, "Wrong size on CartoonWidget_OnTextInfoChange");
static_assert(offsetof(CartoonWidget_OnTextInfoChange, InWidget) == 0x000000, "Member 'CartoonWidget_OnTextInfoChange::InWidget' has a wrong offset!");
static_assert(offsetof(CartoonWidget_OnTextInfoChange, InText) == 0x000008, "Member 'CartoonWidget_OnTextInfoChange::InText' has a wrong offset!");

// Function Cartoon.CartoonWidget.RegisterWrapWidget
// 0x0010 (0x0010 - 0x0000)
struct CartoonWidget_RegisterWrapWidget final
{
public:
	class UWidget*                                InSrc;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                InWrap;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonWidget_RegisterWrapWidget) == 0x000008, "Wrong alignment on CartoonWidget_RegisterWrapWidget");
static_assert(sizeof(CartoonWidget_RegisterWrapWidget) == 0x000010, "Wrong size on CartoonWidget_RegisterWrapWidget");
static_assert(offsetof(CartoonWidget_RegisterWrapWidget, InSrc) == 0x000000, "Member 'CartoonWidget_RegisterWrapWidget::InSrc' has a wrong offset!");
static_assert(offsetof(CartoonWidget_RegisterWrapWidget, InWrap) == 0x000008, "Member 'CartoonWidget_RegisterWrapWidget::InWrap' has a wrong offset!");

// Function Cartoon.CartoonWidget.SetParallaxBlur
// 0x0004 (0x0004 - 0x0000)
struct CartoonWidget_SetParallaxBlur final
{
public:
	float                                         InDistance;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonWidget_SetParallaxBlur) == 0x000004, "Wrong alignment on CartoonWidget_SetParallaxBlur");
static_assert(sizeof(CartoonWidget_SetParallaxBlur) == 0x000004, "Wrong size on CartoonWidget_SetParallaxBlur");
static_assert(offsetof(CartoonWidget_SetParallaxBlur, InDistance) == 0x000000, "Member 'CartoonWidget_SetParallaxBlur::InDistance' has a wrong offset!");

// Function Cartoon.CartoonWidget.GetBackgroundSize
// 0x0008 (0x0008 - 0x0000)
struct CartoonWidget_GetBackgroundSize final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CartoonWidget_GetBackgroundSize) == 0x000004, "Wrong alignment on CartoonWidget_GetBackgroundSize");
static_assert(sizeof(CartoonWidget_GetBackgroundSize) == 0x000008, "Wrong size on CartoonWidget_GetBackgroundSize");
static_assert(offsetof(CartoonWidget_GetBackgroundSize, ReturnValue) == 0x000000, "Member 'CartoonWidget_GetBackgroundSize::ReturnValue' has a wrong offset!");

}

