#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CastSkill_Accessory

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CastSkill_Accessory.CastSkill_Accessory_C
// 0x0050 (0x0A50 - 0x0A00)
class ACastSkill_Accessory_C final : public AGameSkill
{
public:
	uint8                                         Pad_9F8[0x8];                                      // 0x09F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USkillStorage_Accessory_C*              SkillStorage_Accessory;                            // 0x0A00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMontageStateComponent*                 MontageState;                                      // 0x0A08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillEmitterComponent*                 SkillEmitter;                                      // 0x0A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPlaySkillMontage_Accessory_C*          PlaySkillMontage_Accessory;                        // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillCostComponent*                    SkillCost;                                         // 0x0A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillCDComponent*                      SkillCD;                                           // 0x0A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillInBunkerComponent*                SkillInBunker;                                     // 0x0A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillSelectorComponent*                SkillSelector;                                     // 0x0A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CastSkill_Accessory_C">();
	}
	static class ACastSkill_Accessory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACastSkill_Accessory_C>();
	}
};
static_assert(alignof(ACastSkill_Accessory_C) == 0x000010, "Wrong alignment on ACastSkill_Accessory_C");
static_assert(sizeof(ACastSkill_Accessory_C) == 0x000A50, "Wrong size on ACastSkill_Accessory_C");
static_assert(offsetof(ACastSkill_Accessory_C, SkillStorage_Accessory) == 0x000A00, "Member 'ACastSkill_Accessory_C::SkillStorage_Accessory' has a wrong offset!");
static_assert(offsetof(ACastSkill_Accessory_C, MontageState) == 0x000A08, "Member 'ACastSkill_Accessory_C::MontageState' has a wrong offset!");
static_assert(offsetof(ACastSkill_Accessory_C, SkillEmitter) == 0x000A10, "Member 'ACastSkill_Accessory_C::SkillEmitter' has a wrong offset!");
static_assert(offsetof(ACastSkill_Accessory_C, PlaySkillMontage_Accessory) == 0x000A18, "Member 'ACastSkill_Accessory_C::PlaySkillMontage_Accessory' has a wrong offset!");
static_assert(offsetof(ACastSkill_Accessory_C, SkillCost) == 0x000A20, "Member 'ACastSkill_Accessory_C::SkillCost' has a wrong offset!");
static_assert(offsetof(ACastSkill_Accessory_C, SkillCD) == 0x000A28, "Member 'ACastSkill_Accessory_C::SkillCD' has a wrong offset!");
static_assert(offsetof(ACastSkill_Accessory_C, SkillInBunker) == 0x000A30, "Member 'ACastSkill_Accessory_C::SkillInBunker' has a wrong offset!");
static_assert(offsetof(ACastSkill_Accessory_C, SkillSelector) == 0x000A38, "Member 'ACastSkill_Accessory_C::SkillSelector' has a wrong offset!");
static_assert(offsetof(ACastSkill_Accessory_C, DefaultSceneRoot) == 0x000A40, "Member 'ACastSkill_Accessory_C::DefaultSceneRoot' has a wrong offset!");

}

