#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CastSkill

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CastSkill.CastSkill_C
// 0x0050 (0x0A50 - 0x0A00)
#pragma pack(push, 0x1)
class alignas(0x10) ACastSkill_C : public AGameSkill
{
public:
	uint8                                         Pad_9F8[0x8];                                      // 0x09F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USkillStorageComponent*                 SkillStorage;                                      // 0x0A00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMontageStateComponent*                 MontageState;                                      // 0x0A08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillEmitterComponent*                 SkillEmitter;                                      // 0x0A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPlaySkillMontageComponent*             PlaySkillMontage;                                  // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillCostComponent*                    SkillCost;                                         // 0x0A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillCDComponent*                      SkillCD;                                           // 0x0A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillInBunkerComponent*                SkillInBunker;                                     // 0x0A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillSelectorComponent*                SkillSelector;                                     // 0x0A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CastSkill_C">();
	}
	static class ACastSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACastSkill_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(ACastSkill_C) == 0x000010, "Wrong alignment on ACastSkill_C");
static_assert(sizeof(ACastSkill_C) == 0x000A50, "Wrong size on ACastSkill_C");
static_assert(offsetof(ACastSkill_C, SkillStorage) == 0x000A00, "Member 'ACastSkill_C::SkillStorage' has a wrong offset!");
static_assert(offsetof(ACastSkill_C, MontageState) == 0x000A08, "Member 'ACastSkill_C::MontageState' has a wrong offset!");
static_assert(offsetof(ACastSkill_C, SkillEmitter) == 0x000A10, "Member 'ACastSkill_C::SkillEmitter' has a wrong offset!");
static_assert(offsetof(ACastSkill_C, PlaySkillMontage) == 0x000A18, "Member 'ACastSkill_C::PlaySkillMontage' has a wrong offset!");
static_assert(offsetof(ACastSkill_C, SkillCost) == 0x000A20, "Member 'ACastSkill_C::SkillCost' has a wrong offset!");
static_assert(offsetof(ACastSkill_C, SkillCD) == 0x000A28, "Member 'ACastSkill_C::SkillCD' has a wrong offset!");
static_assert(offsetof(ACastSkill_C, SkillInBunker) == 0x000A30, "Member 'ACastSkill_C::SkillInBunker' has a wrong offset!");
static_assert(offsetof(ACastSkill_C, SkillSelector) == 0x000A38, "Member 'ACastSkill_C::SkillSelector' has a wrong offset!");
static_assert(offsetof(ACastSkill_C, DefaultSceneRoot) == 0x000A40, "Member 'ACastSkill_C::DefaultSceneRoot' has a wrong offset!");

}

