#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CGSpine

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MovieScene_structs.hpp"
#include "MovieSceneTracks_structs.hpp"


namespace SDK
{

// Enum CGSpine.ESpineWidgetTickMode
// NumValues: 0x0004
enum class ESpineWidgetTickMode : uint8
{
	Disabled                                 = 0,
	Enabled                                  = 1,
	Automatic                                = 2,
	ESpineWidgetTickMode_MAX                 = 3,
};

// Enum CGSpine.ESpineWidgetTimingPolicy
// NumValues: 0x0003
enum class ESpineWidgetTimingPolicy : uint8
{
	RealTime                                 = 0,
	GameTime                                 = 1,
	ESpineWidgetTimingPolicy_MAX             = 2,
};

// Enum CGSpine.ECGSpineObjectType
// NumValues: 0x0004
enum class ECGSpineObjectType : uint8
{
	Layer                                    = 0,
	Spine                                    = 1,
	Particle                                 = 2,
	ECGSpineObjectType_MAX                   = 3,
};

// ScriptStruct CGSpine.TimelineKeyframeInfo
// 0x0004 (0x0004 - 0x0000)
struct FTimelineKeyframeInfo
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTimelineKeyframeInfo) == 0x000004, "Wrong alignment on FTimelineKeyframeInfo");
static_assert(sizeof(FTimelineKeyframeInfo) == 0x000004, "Wrong size on FTimelineKeyframeInfo");
static_assert(offsetof(FTimelineKeyframeInfo, Time) == 0x000000, "Member 'FTimelineKeyframeInfo::Time' has a wrong offset!");

// ScriptStruct CGSpine.KeyframeInfo_PlayParticleEffect
// 0x0024 (0x0028 - 0x0004)
struct FKeyframeInfo_PlayParticleEffect final : public FTimelineKeyframeInfo
{
public:
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        FXSystemPath;                                      // 0x0008(0x0018)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParticleName;                                      // 0x0020(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FKeyframeInfo_PlayParticleEffect) == 0x000008, "Wrong alignment on FKeyframeInfo_PlayParticleEffect");
static_assert(sizeof(FKeyframeInfo_PlayParticleEffect) == 0x000028, "Wrong size on FKeyframeInfo_PlayParticleEffect");
static_assert(offsetof(FKeyframeInfo_PlayParticleEffect, FXSystemPath) == 0x000008, "Member 'FKeyframeInfo_PlayParticleEffect::FXSystemPath' has a wrong offset!");
static_assert(offsetof(FKeyframeInfo_PlayParticleEffect, ParticleName) == 0x000020, "Member 'FKeyframeInfo_PlayParticleEffect::ParticleName' has a wrong offset!");

// ScriptStruct CGSpine.KeyframeInfo_PlaySpineAnimation
// 0x001C (0x0020 - 0x0004)
struct FKeyframeInfo_PlaySpineAnimation final : public FTimelineKeyframeInfo
{
public:
	int32                                         Index;                                             // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AnimationName;                                     // 0x0008(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         LoopCount;                                         // 0x0018(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FKeyframeInfo_PlaySpineAnimation) == 0x000008, "Wrong alignment on FKeyframeInfo_PlaySpineAnimation");
static_assert(sizeof(FKeyframeInfo_PlaySpineAnimation) == 0x000020, "Wrong size on FKeyframeInfo_PlaySpineAnimation");
static_assert(offsetof(FKeyframeInfo_PlaySpineAnimation, Index) == 0x000004, "Member 'FKeyframeInfo_PlaySpineAnimation::Index' has a wrong offset!");
static_assert(offsetof(FKeyframeInfo_PlaySpineAnimation, AnimationName) == 0x000008, "Member 'FKeyframeInfo_PlaySpineAnimation::AnimationName' has a wrong offset!");
static_assert(offsetof(FKeyframeInfo_PlaySpineAnimation, LoopCount) == 0x000018, "Member 'FKeyframeInfo_PlaySpineAnimation::LoopCount' has a wrong offset!");

// ScriptStruct CGSpine.CGSpineBaseData
// 0x0030 (0x0030 - 0x0000)
struct FCGSpineBaseData
{
public:
	struct FTransform                             ViewTransform;                                     // 0x0000(0x0030)(Edit, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCGSpineBaseData) == 0x000010, "Wrong alignment on FCGSpineBaseData");
static_assert(sizeof(FCGSpineBaseData) == 0x000030, "Wrong size on FCGSpineBaseData");
static_assert(offsetof(FCGSpineBaseData, ViewTransform) == 0x000000, "Member 'FCGSpineBaseData::ViewTransform' has a wrong offset!");

// ScriptStruct CGSpine.CGSpineObjectData
// 0x0090 (0x00C0 - 0x0030)
struct FCGSpineObjectData final : public FCGSpineBaseData
{
public:
	int32                                         Index;                                             // 0x0030(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0034(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PlotName;                                          // 0x003C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        AtlasDataPath;                                     // 0x0048(0x0018)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        SkeletonDataPath;                                  // 0x0060(0x0018)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StartAnimationName;                                // 0x0078(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        NormalMaterialPath;                                // 0x0088(0x0018)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        MultiplyMaterialPath;                              // 0x00A0(0x0018)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCGSpineObjectData) == 0x000010, "Wrong alignment on FCGSpineObjectData");
static_assert(sizeof(FCGSpineObjectData) == 0x0000C0, "Wrong size on FCGSpineObjectData");
static_assert(offsetof(FCGSpineObjectData, Index) == 0x000030, "Member 'FCGSpineObjectData::Index' has a wrong offset!");
static_assert(offsetof(FCGSpineObjectData, Name) == 0x000034, "Member 'FCGSpineObjectData::Name' has a wrong offset!");
static_assert(offsetof(FCGSpineObjectData, PlotName) == 0x00003C, "Member 'FCGSpineObjectData::PlotName' has a wrong offset!");
static_assert(offsetof(FCGSpineObjectData, AtlasDataPath) == 0x000048, "Member 'FCGSpineObjectData::AtlasDataPath' has a wrong offset!");
static_assert(offsetof(FCGSpineObjectData, SkeletonDataPath) == 0x000060, "Member 'FCGSpineObjectData::SkeletonDataPath' has a wrong offset!");
static_assert(offsetof(FCGSpineObjectData, StartAnimationName) == 0x000078, "Member 'FCGSpineObjectData::StartAnimationName' has a wrong offset!");
static_assert(offsetof(FCGSpineObjectData, NormalMaterialPath) == 0x000088, "Member 'FCGSpineObjectData::NormalMaterialPath' has a wrong offset!");
static_assert(offsetof(FCGSpineObjectData, MultiplyMaterialPath) == 0x0000A0, "Member 'FCGSpineObjectData::MultiplyMaterialPath' has a wrong offset!");

// ScriptStruct CGSpine.CGSpineLayerPlaneData
// 0x0030 (0x0060 - 0x0030)
struct FCGSpineLayerPlaneData final : public FCGSpineBaseData
{
public:
	struct FSoftObjectPath                        TexturePath;                                       // 0x0030(0x0018)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsScaleToFit;                                     // 0x0048(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAsMask;                                        // 0x0049(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Name;                                              // 0x004C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0xC];                                       // 0x0054(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCGSpineLayerPlaneData) == 0x000010, "Wrong alignment on FCGSpineLayerPlaneData");
static_assert(sizeof(FCGSpineLayerPlaneData) == 0x000060, "Wrong size on FCGSpineLayerPlaneData");
static_assert(offsetof(FCGSpineLayerPlaneData, TexturePath) == 0x000030, "Member 'FCGSpineLayerPlaneData::TexturePath' has a wrong offset!");
static_assert(offsetof(FCGSpineLayerPlaneData, bIsScaleToFit) == 0x000048, "Member 'FCGSpineLayerPlaneData::bIsScaleToFit' has a wrong offset!");
static_assert(offsetof(FCGSpineLayerPlaneData, bUseAsMask) == 0x000049, "Member 'FCGSpineLayerPlaneData::bUseAsMask' has a wrong offset!");
static_assert(offsetof(FCGSpineLayerPlaneData, Name) == 0x00004C, "Member 'FCGSpineLayerPlaneData::Name' has a wrong offset!");

// ScriptStruct CGSpine.CGSpineParticleData
// 0x0040 (0x0070 - 0x0030)
struct FCGSpineParticleData final : public FCGSpineBaseData
{
public:
	struct FSoftObjectPath                        FXSystemPath;                                      // 0x0030(0x0018)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BindToSpine;                                       // 0x0048(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SpineBoneName;                                     // 0x0050(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DepthOffset;                                       // 0x0058(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x005C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoPlay;                                         // 0x0064(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0xB];                                       // 0x0065(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCGSpineParticleData) == 0x000010, "Wrong alignment on FCGSpineParticleData");
static_assert(sizeof(FCGSpineParticleData) == 0x000070, "Wrong size on FCGSpineParticleData");
static_assert(offsetof(FCGSpineParticleData, FXSystemPath) == 0x000030, "Member 'FCGSpineParticleData::FXSystemPath' has a wrong offset!");
static_assert(offsetof(FCGSpineParticleData, BindToSpine) == 0x000048, "Member 'FCGSpineParticleData::BindToSpine' has a wrong offset!");
static_assert(offsetof(FCGSpineParticleData, SpineBoneName) == 0x000050, "Member 'FCGSpineParticleData::SpineBoneName' has a wrong offset!");
static_assert(offsetof(FCGSpineParticleData, DepthOffset) == 0x000058, "Member 'FCGSpineParticleData::DepthOffset' has a wrong offset!");
static_assert(offsetof(FCGSpineParticleData, Name) == 0x00005C, "Member 'FCGSpineParticleData::Name' has a wrong offset!");
static_assert(offsetof(FCGSpineParticleData, bAutoPlay) == 0x000064, "Member 'FCGSpineParticleData::bAutoPlay' has a wrong offset!");

// ScriptStruct CGSpine.UMGSpineEvalTemplate
// 0x0008 (0x0028 - 0x0020)
struct FUMGSpineEvalTemplate final : public FMovieSceneEvalTemplate
{
public:
	class UUMGSpineSection*                       Section;                                           // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FUMGSpineEvalTemplate) == 0x000008, "Wrong alignment on FUMGSpineEvalTemplate");
static_assert(sizeof(FUMGSpineEvalTemplate) == 0x000028, "Wrong size on FUMGSpineEvalTemplate");
static_assert(offsetof(FUMGSpineEvalTemplate, Section) == 0x000020, "Member 'FUMGSpineEvalTemplate::Section' has a wrong offset!");

// ScriptStruct CGSpine.CGSpineStringParameterNameAndCurve
// 0x00A8 (0x00A8 - 0x0000)
struct FCGSpineStringParameterNameAndCurve final
{
public:
	class FName                                   ParameterName;                                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneStringChannel               StringParameter;                                   // 0x0008(0x00A0)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FCGSpineStringParameterNameAndCurve) == 0x000008, "Wrong alignment on FCGSpineStringParameterNameAndCurve");
static_assert(sizeof(FCGSpineStringParameterNameAndCurve) == 0x0000A8, "Wrong size on FCGSpineStringParameterNameAndCurve");
static_assert(offsetof(FCGSpineStringParameterNameAndCurve, ParameterName) == 0x000000, "Member 'FCGSpineStringParameterNameAndCurve::ParameterName' has a wrong offset!");
static_assert(offsetof(FCGSpineStringParameterNameAndCurve, StringParameter) == 0x000008, "Member 'FCGSpineStringParameterNameAndCurve::StringParameter' has a wrong offset!");

// ScriptStruct CGSpine.CGSpineTransformParameterNameAndCurves
// 0x05A8 (0x05A8 - 0x0000)
struct FCGSpineTransformParameterNameAndCurves final
{
public:
	class FName                                   ParameterName;                                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneFloatChannel                Translation[0x3];                                  // 0x0008(0x00A0)(NativeAccessSpecifierPublic)
	struct FMovieSceneFloatChannel                Rotation[0x3];                                     // 0x01E8(0x00A0)(NativeAccessSpecifierPublic)
	struct FMovieSceneFloatChannel                Scale[0x3];                                        // 0x03C8(0x00A0)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FCGSpineTransformParameterNameAndCurves) == 0x000008, "Wrong alignment on FCGSpineTransformParameterNameAndCurves");
static_assert(sizeof(FCGSpineTransformParameterNameAndCurves) == 0x0005A8, "Wrong size on FCGSpineTransformParameterNameAndCurves");
static_assert(offsetof(FCGSpineTransformParameterNameAndCurves, ParameterName) == 0x000000, "Member 'FCGSpineTransformParameterNameAndCurves::ParameterName' has a wrong offset!");
static_assert(offsetof(FCGSpineTransformParameterNameAndCurves, Translation) == 0x000008, "Member 'FCGSpineTransformParameterNameAndCurves::Translation' has a wrong offset!");
static_assert(offsetof(FCGSpineTransformParameterNameAndCurves, Rotation) == 0x0001E8, "Member 'FCGSpineTransformParameterNameAndCurves::Rotation' has a wrong offset!");
static_assert(offsetof(FCGSpineTransformParameterNameAndCurves, Scale) == 0x0003C8, "Member 'FCGSpineTransformParameterNameAndCurves::Scale' has a wrong offset!");

// ScriptStruct CGSpine.CGSpineScalarParameterNameAndCurve
// 0x00A8 (0x00A8 - 0x0000)
struct FCGSpineScalarParameterNameAndCurve final
{
public:
	class FName                                   ParameterName;                                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneFloatChannel                ParameterCurve;                                    // 0x0008(0x00A0)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FCGSpineScalarParameterNameAndCurve) == 0x000008, "Wrong alignment on FCGSpineScalarParameterNameAndCurve");
static_assert(sizeof(FCGSpineScalarParameterNameAndCurve) == 0x0000A8, "Wrong size on FCGSpineScalarParameterNameAndCurve");
static_assert(offsetof(FCGSpineScalarParameterNameAndCurve, ParameterName) == 0x000000, "Member 'FCGSpineScalarParameterNameAndCurve::ParameterName' has a wrong offset!");
static_assert(offsetof(FCGSpineScalarParameterNameAndCurve, ParameterCurve) == 0x000008, "Member 'FCGSpineScalarParameterNameAndCurve::ParameterCurve' has a wrong offset!");

}

