#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CGSpine

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CGSpine_structs.hpp"


namespace SDK::Params
{

// Function CGSpine.CGSpineLibrary.ClearCGSpine
// 0x0008 (0x0008 - 0x0000)
struct CGSpineLibrary_ClearCGSpine final
{
public:
	class ACameraActor*                           InCameraActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CGSpineLibrary_ClearCGSpine) == 0x000008, "Wrong alignment on CGSpineLibrary_ClearCGSpine");
static_assert(sizeof(CGSpineLibrary_ClearCGSpine) == 0x000008, "Wrong size on CGSpineLibrary_ClearCGSpine");
static_assert(offsetof(CGSpineLibrary_ClearCGSpine, InCameraActor) == 0x000000, "Member 'CGSpineLibrary_ClearCGSpine::InCameraActor' has a wrong offset!");

// Function CGSpine.CGSpineLibrary.CreateSpine
// 0x0110 (0x0110 - 0x0000)
struct CGSpineLibrary_CreateSpine final
{
public:
	class UWorld*                                 InWorld;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCGSpineObjectData                     InData;                                            // 0x0010(0x00C0)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FTransform                             InTransform;                                       // 0x00D0(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class ACGSpineObjectActor*                    ReturnValue;                                       // 0x0100(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CGSpineLibrary_CreateSpine) == 0x000010, "Wrong alignment on CGSpineLibrary_CreateSpine");
static_assert(sizeof(CGSpineLibrary_CreateSpine) == 0x000110, "Wrong size on CGSpineLibrary_CreateSpine");
static_assert(offsetof(CGSpineLibrary_CreateSpine, InWorld) == 0x000000, "Member 'CGSpineLibrary_CreateSpine::InWorld' has a wrong offset!");
static_assert(offsetof(CGSpineLibrary_CreateSpine, InData) == 0x000010, "Member 'CGSpineLibrary_CreateSpine::InData' has a wrong offset!");
static_assert(offsetof(CGSpineLibrary_CreateSpine, InTransform) == 0x0000D0, "Member 'CGSpineLibrary_CreateSpine::InTransform' has a wrong offset!");
static_assert(offsetof(CGSpineLibrary_CreateSpine, ReturnValue) == 0x000100, "Member 'CGSpineLibrary_CreateSpine::ReturnValue' has a wrong offset!");

// Function CGSpine.CGSpineLibrary.FindSpineActorFromPlotName
// 0x0010 (0x0010 - 0x0000)
struct CGSpineLibrary_FindSpineActorFromPlotName final
{
public:
	class FName                                   InPlotName;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACGSpineObjectActor*                    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CGSpineLibrary_FindSpineActorFromPlotName) == 0x000008, "Wrong alignment on CGSpineLibrary_FindSpineActorFromPlotName");
static_assert(sizeof(CGSpineLibrary_FindSpineActorFromPlotName) == 0x000010, "Wrong size on CGSpineLibrary_FindSpineActorFromPlotName");
static_assert(offsetof(CGSpineLibrary_FindSpineActorFromPlotName, InPlotName) == 0x000000, "Member 'CGSpineLibrary_FindSpineActorFromPlotName::InPlotName' has a wrong offset!");
static_assert(offsetof(CGSpineLibrary_FindSpineActorFromPlotName, ReturnValue) == 0x000008, "Member 'CGSpineLibrary_FindSpineActorFromPlotName::ReturnValue' has a wrong offset!");

// Function CGSpine.CGSpineLibrary.PlayCameraAnimation
// 0x001C (0x001C - 0x0000)
struct CGSpineLibrary_PlayCameraAnimation final
{
public:
	float                                         InTime;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              InStartLocation;                                   // 0x0004(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              InTargetLocation;                                  // 0x000C(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              InScale;                                           // 0x0014(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CGSpineLibrary_PlayCameraAnimation) == 0x000004, "Wrong alignment on CGSpineLibrary_PlayCameraAnimation");
static_assert(sizeof(CGSpineLibrary_PlayCameraAnimation) == 0x00001C, "Wrong size on CGSpineLibrary_PlayCameraAnimation");
static_assert(offsetof(CGSpineLibrary_PlayCameraAnimation, InTime) == 0x000000, "Member 'CGSpineLibrary_PlayCameraAnimation::InTime' has a wrong offset!");
static_assert(offsetof(CGSpineLibrary_PlayCameraAnimation, InStartLocation) == 0x000004, "Member 'CGSpineLibrary_PlayCameraAnimation::InStartLocation' has a wrong offset!");
static_assert(offsetof(CGSpineLibrary_PlayCameraAnimation, InTargetLocation) == 0x00000C, "Member 'CGSpineLibrary_PlayCameraAnimation::InTargetLocation' has a wrong offset!");
static_assert(offsetof(CGSpineLibrary_PlayCameraAnimation, InScale) == 0x000014, "Member 'CGSpineLibrary_PlayCameraAnimation::InScale' has a wrong offset!");

// Function CGSpine.CGSpineLibrary.PlayCGSpine
// 0x0020 (0x0020 - 0x0000)
struct CGSpineLibrary_PlayCGSpine final
{
public:
	class UCGSpineData*                           InData;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACameraActor*                           InCameraActor;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InOffsetLocation;                                  // 0x0010(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseRealColor;                                     // 0x001C(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCameraForceZero;                                  // 0x001D(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseResourceAmend;                                 // 0x001E(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CGSpineLibrary_PlayCGSpine) == 0x000008, "Wrong alignment on CGSpineLibrary_PlayCGSpine");
static_assert(sizeof(CGSpineLibrary_PlayCGSpine) == 0x000020, "Wrong size on CGSpineLibrary_PlayCGSpine");
static_assert(offsetof(CGSpineLibrary_PlayCGSpine, InData) == 0x000000, "Member 'CGSpineLibrary_PlayCGSpine::InData' has a wrong offset!");
static_assert(offsetof(CGSpineLibrary_PlayCGSpine, InCameraActor) == 0x000008, "Member 'CGSpineLibrary_PlayCGSpine::InCameraActor' has a wrong offset!");
static_assert(offsetof(CGSpineLibrary_PlayCGSpine, InOffsetLocation) == 0x000010, "Member 'CGSpineLibrary_PlayCGSpine::InOffsetLocation' has a wrong offset!");
static_assert(offsetof(CGSpineLibrary_PlayCGSpine, bUseRealColor) == 0x00001C, "Member 'CGSpineLibrary_PlayCGSpine::bUseRealColor' has a wrong offset!");
static_assert(offsetof(CGSpineLibrary_PlayCGSpine, bCameraForceZero) == 0x00001D, "Member 'CGSpineLibrary_PlayCGSpine::bCameraForceZero' has a wrong offset!");
static_assert(offsetof(CGSpineLibrary_PlayCGSpine, bUseResourceAmend) == 0x00001E, "Member 'CGSpineLibrary_PlayCGSpine::bUseResourceAmend' has a wrong offset!");

// Function CGSpine.CGSpineLibrary.SetAutoAdapteToScreen
// 0x0018 (0x0018 - 0x0000)
struct CGSpineLibrary_SetAutoAdapteToScreen final
{
public:
	class ACameraActor*                           InCameraActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InCameraAnimationEndLocation;                      // 0x0008(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InFOV;                                             // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CGSpineLibrary_SetAutoAdapteToScreen) == 0x000008, "Wrong alignment on CGSpineLibrary_SetAutoAdapteToScreen");
static_assert(sizeof(CGSpineLibrary_SetAutoAdapteToScreen) == 0x000018, "Wrong size on CGSpineLibrary_SetAutoAdapteToScreen");
static_assert(offsetof(CGSpineLibrary_SetAutoAdapteToScreen, InCameraActor) == 0x000000, "Member 'CGSpineLibrary_SetAutoAdapteToScreen::InCameraActor' has a wrong offset!");
static_assert(offsetof(CGSpineLibrary_SetAutoAdapteToScreen, InCameraAnimationEndLocation) == 0x000008, "Member 'CGSpineLibrary_SetAutoAdapteToScreen::InCameraAnimationEndLocation' has a wrong offset!");
static_assert(offsetof(CGSpineLibrary_SetAutoAdapteToScreen, InFOV) == 0x000014, "Member 'CGSpineLibrary_SetAutoAdapteToScreen::InFOV' has a wrong offset!");

// Function CGSpine.CGSpineObjectActor.ActivateBone
// 0x0018 (0x0018 - 0x0000)
struct CGSpineObjectActor_ActivateBone final
{
public:
	class FString                                 BoneName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActivate;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CGSpineObjectActor_ActivateBone) == 0x000008, "Wrong alignment on CGSpineObjectActor_ActivateBone");
static_assert(sizeof(CGSpineObjectActor_ActivateBone) == 0x000018, "Wrong size on CGSpineObjectActor_ActivateBone");
static_assert(offsetof(CGSpineObjectActor_ActivateBone, BoneName) == 0x000000, "Member 'CGSpineObjectActor_ActivateBone::BoneName' has a wrong offset!");
static_assert(offsetof(CGSpineObjectActor_ActivateBone, bActivate) == 0x000010, "Member 'CGSpineObjectActor_ActivateBone::bActivate' has a wrong offset!");

// Function CGSpine.CGSpineObjectActor.OnAnimationCompleteHandler
// 0x0010 (0x0010 - 0x0000)
struct CGSpineObjectActor_OnAnimationCompleteHandler final
{
public:
	class UObject*                                InDispatcher;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTrackEntry*                            InEntry;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CGSpineObjectActor_OnAnimationCompleteHandler) == 0x000008, "Wrong alignment on CGSpineObjectActor_OnAnimationCompleteHandler");
static_assert(sizeof(CGSpineObjectActor_OnAnimationCompleteHandler) == 0x000010, "Wrong size on CGSpineObjectActor_OnAnimationCompleteHandler");
static_assert(offsetof(CGSpineObjectActor_OnAnimationCompleteHandler, InDispatcher) == 0x000000, "Member 'CGSpineObjectActor_OnAnimationCompleteHandler::InDispatcher' has a wrong offset!");
static_assert(offsetof(CGSpineObjectActor_OnAnimationCompleteHandler, InEntry) == 0x000008, "Member 'CGSpineObjectActor_OnAnimationCompleteHandler::InEntry' has a wrong offset!");

// Function CGSpine.CGSpineObjectActor.PlayAnimationSequence
// 0x0018 (0x0018 - 0x0000)
struct CGSpineObjectActor_PlayAnimationSequence final
{
public:
	TArray<class FString>                         InAnimations;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CGSpineObjectActor_PlayAnimationSequence) == 0x000008, "Wrong alignment on CGSpineObjectActor_PlayAnimationSequence");
static_assert(sizeof(CGSpineObjectActor_PlayAnimationSequence) == 0x000018, "Wrong size on CGSpineObjectActor_PlayAnimationSequence");
static_assert(offsetof(CGSpineObjectActor_PlayAnimationSequence, InAnimations) == 0x000000, "Member 'CGSpineObjectActor_PlayAnimationSequence::InAnimations' has a wrong offset!");
static_assert(offsetof(CGSpineObjectActor_PlayAnimationSequence, bLoop) == 0x000010, "Member 'CGSpineObjectActor_PlayAnimationSequence::bLoop' has a wrong offset!");

// Function CGSpine.CGSpineObjectActor.PlayNewAnimation
// 0x0018 (0x0018 - 0x0000)
struct CGSpineObjectActor_PlayNewAnimation final
{
public:
	class FString                                 InAnimationName;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CGSpineObjectActor_PlayNewAnimation) == 0x000008, "Wrong alignment on CGSpineObjectActor_PlayNewAnimation");
static_assert(sizeof(CGSpineObjectActor_PlayNewAnimation) == 0x000018, "Wrong size on CGSpineObjectActor_PlayNewAnimation");
static_assert(offsetof(CGSpineObjectActor_PlayNewAnimation, InAnimationName) == 0x000000, "Member 'CGSpineObjectActor_PlayNewAnimation::InAnimationName' has a wrong offset!");
static_assert(offsetof(CGSpineObjectActor_PlayNewAnimation, bLoop) == 0x000010, "Member 'CGSpineObjectActor_PlayNewAnimation::bLoop' has a wrong offset!");

// Function CGSpine.SpineMeshComponent.SetRedrawTime
// 0x0004 (0x0004 - 0x0000)
struct SpineMeshComponent_SetRedrawTime final
{
public:
	float                                         InRedrawTime;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineMeshComponent_SetRedrawTime) == 0x000004, "Wrong alignment on SpineMeshComponent_SetRedrawTime");
static_assert(sizeof(SpineMeshComponent_SetRedrawTime) == 0x000004, "Wrong size on SpineMeshComponent_SetRedrawTime");
static_assert(offsetof(SpineMeshComponent_SetRedrawTime, InRedrawTime) == 0x000000, "Member 'SpineMeshComponent_SetRedrawTime::InRedrawTime' has a wrong offset!");

// Function CGSpine.SpineMeshComponent.SetTickMode
// 0x0001 (0x0001 - 0x0000)
struct SpineMeshComponent_SetTickMode final
{
public:
	ESpineWidgetTickMode                          InTickMode;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineMeshComponent_SetTickMode) == 0x000001, "Wrong alignment on SpineMeshComponent_SetTickMode");
static_assert(sizeof(SpineMeshComponent_SetTickMode) == 0x000001, "Wrong size on SpineMeshComponent_SetTickMode");
static_assert(offsetof(SpineMeshComponent_SetTickMode, InTickMode) == 0x000000, "Member 'SpineMeshComponent_SetTickMode::InTickMode' has a wrong offset!");

// Function CGSpine.SpineMeshComponent.SetWidget
// 0x0008 (0x0008 - 0x0000)
struct SpineMeshComponent_SetWidget final
{
public:
	class UUserWidget*                            Widget_0;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineMeshComponent_SetWidget) == 0x000008, "Wrong alignment on SpineMeshComponent_SetWidget");
static_assert(sizeof(SpineMeshComponent_SetWidget) == 0x000008, "Wrong size on SpineMeshComponent_SetWidget");
static_assert(offsetof(SpineMeshComponent_SetWidget, Widget_0) == 0x000000, "Member 'SpineMeshComponent_SetWidget::Widget_0' has a wrong offset!");

// Function CGSpine.SpineMeshComponent.GetRedrawTime
// 0x0004 (0x0004 - 0x0000)
struct SpineMeshComponent_GetRedrawTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineMeshComponent_GetRedrawTime) == 0x000004, "Wrong alignment on SpineMeshComponent_GetRedrawTime");
static_assert(sizeof(SpineMeshComponent_GetRedrawTime) == 0x000004, "Wrong size on SpineMeshComponent_GetRedrawTime");
static_assert(offsetof(SpineMeshComponent_GetRedrawTime, ReturnValue) == 0x000000, "Member 'SpineMeshComponent_GetRedrawTime::ReturnValue' has a wrong offset!");

// Function CGSpine.SpineMeshComponent.GetRenderTarget
// 0x0008 (0x0008 - 0x0000)
struct SpineMeshComponent_GetRenderTarget final
{
public:
	class UTextureRenderTarget2D*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineMeshComponent_GetRenderTarget) == 0x000008, "Wrong alignment on SpineMeshComponent_GetRenderTarget");
static_assert(sizeof(SpineMeshComponent_GetRenderTarget) == 0x000008, "Wrong size on SpineMeshComponent_GetRenderTarget");
static_assert(offsetof(SpineMeshComponent_GetRenderTarget, ReturnValue) == 0x000000, "Member 'SpineMeshComponent_GetRenderTarget::ReturnValue' has a wrong offset!");

// Function CGSpine.SpineMeshComponent.GetUserWidgetObject
// 0x0008 (0x0008 - 0x0000)
struct SpineMeshComponent_GetUserWidgetObject final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineMeshComponent_GetUserWidgetObject) == 0x000008, "Wrong alignment on SpineMeshComponent_GetUserWidgetObject");
static_assert(sizeof(SpineMeshComponent_GetUserWidgetObject) == 0x000008, "Wrong size on SpineMeshComponent_GetUserWidgetObject");
static_assert(offsetof(SpineMeshComponent_GetUserWidgetObject, ReturnValue) == 0x000000, "Member 'SpineMeshComponent_GetUserWidgetObject::ReturnValue' has a wrong offset!");

// Function CGSpine.SpineMeshComponent.GetWidget
// 0x0008 (0x0008 - 0x0000)
struct SpineMeshComponent_GetWidget final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineMeshComponent_GetWidget) == 0x000008, "Wrong alignment on SpineMeshComponent_GetWidget");
static_assert(sizeof(SpineMeshComponent_GetWidget) == 0x000008, "Wrong size on SpineMeshComponent_GetWidget");
static_assert(offsetof(SpineMeshComponent_GetWidget, ReturnValue) == 0x000000, "Member 'SpineMeshComponent_GetWidget::ReturnValue' has a wrong offset!");

// Function CGSpine.SpineMeshComponent.IsWidgetVisible
// 0x0001 (0x0001 - 0x0000)
struct SpineMeshComponent_IsWidgetVisible final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineMeshComponent_IsWidgetVisible) == 0x000001, "Wrong alignment on SpineMeshComponent_IsWidgetVisible");
static_assert(sizeof(SpineMeshComponent_IsWidgetVisible) == 0x000001, "Wrong size on SpineMeshComponent_IsWidgetVisible");
static_assert(offsetof(SpineMeshComponent_IsWidgetVisible, ReturnValue) == 0x000000, "Member 'SpineMeshComponent_IsWidgetVisible::ReturnValue' has a wrong offset!");

// Function CGSpine.UMGSpineController.ChangeCGSpine
// 0x0008 (0x0008 - 0x0000)
struct UMGSpineController_ChangeCGSpine final
{
public:
	class UCGSpineData*                           InCGSpineData;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UMGSpineController_ChangeCGSpine) == 0x000008, "Wrong alignment on UMGSpineController_ChangeCGSpine");
static_assert(sizeof(UMGSpineController_ChangeCGSpine) == 0x000008, "Wrong size on UMGSpineController_ChangeCGSpine");
static_assert(offsetof(UMGSpineController_ChangeCGSpine, InCGSpineData) == 0x000000, "Member 'UMGSpineController_ChangeCGSpine::InCGSpineData' has a wrong offset!");

// Function CGSpine.UMGSpineController.PlayCGSpine
// 0x0008 (0x0008 - 0x0000)
struct UMGSpineController_PlayCGSpine final
{
public:
	class ACameraActor*                           InCameraActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UMGSpineController_PlayCGSpine) == 0x000008, "Wrong alignment on UMGSpineController_PlayCGSpine");
static_assert(sizeof(UMGSpineController_PlayCGSpine) == 0x000008, "Wrong size on UMGSpineController_PlayCGSpine");
static_assert(offsetof(UMGSpineController_PlayCGSpine, InCameraActor) == 0x000000, "Member 'UMGSpineController_PlayCGSpine::InCameraActor' has a wrong offset!");

// Function CGSpine.UMGSpineController.SetCameraFov
// 0x0004 (0x0004 - 0x0000)
struct UMGSpineController_SetCameraFov final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UMGSpineController_SetCameraFov) == 0x000004, "Wrong alignment on UMGSpineController_SetCameraFov");
static_assert(sizeof(UMGSpineController_SetCameraFov) == 0x000004, "Wrong size on UMGSpineController_SetCameraFov");
static_assert(offsetof(UMGSpineController_SetCameraFov, InValue) == 0x000000, "Member 'UMGSpineController_SetCameraFov::InValue' has a wrong offset!");

// Function CGSpine.UMGSpineController.SetCameraLocation
// 0x000C (0x000C - 0x0000)
struct UMGSpineController_SetCameraLocation final
{
public:
	struct FVector                                InValue;                                           // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UMGSpineController_SetCameraLocation) == 0x000004, "Wrong alignment on UMGSpineController_SetCameraLocation");
static_assert(sizeof(UMGSpineController_SetCameraLocation) == 0x00000C, "Wrong size on UMGSpineController_SetCameraLocation");
static_assert(offsetof(UMGSpineController_SetCameraLocation, InValue) == 0x000000, "Member 'UMGSpineController_SetCameraLocation::InValue' has a wrong offset!");

// Function CGSpine.UMGSpineController.SetCameraRotation
// 0x000C (0x000C - 0x0000)
struct UMGSpineController_SetCameraRotation final
{
public:
	struct FVector                                InValue;                                           // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UMGSpineController_SetCameraRotation) == 0x000004, "Wrong alignment on UMGSpineController_SetCameraRotation");
static_assert(sizeof(UMGSpineController_SetCameraRotation) == 0x00000C, "Wrong size on UMGSpineController_SetCameraRotation");
static_assert(offsetof(UMGSpineController_SetCameraRotation, InValue) == 0x000000, "Member 'UMGSpineController_SetCameraRotation::InValue' has a wrong offset!");

// Function CGSpine.UMGSpineController.SetCameraZoomScale
// 0x0004 (0x0004 - 0x0000)
struct UMGSpineController_SetCameraZoomScale final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UMGSpineController_SetCameraZoomScale) == 0x000004, "Wrong alignment on UMGSpineController_SetCameraZoomScale");
static_assert(sizeof(UMGSpineController_SetCameraZoomScale) == 0x000004, "Wrong size on UMGSpineController_SetCameraZoomScale");
static_assert(offsetof(UMGSpineController_SetCameraZoomScale, InValue) == 0x000000, "Member 'UMGSpineController_SetCameraZoomScale::InValue' has a wrong offset!");

// Function CGSpine.UMGSpineSection.AddScalarParameterKey
// 0x0010 (0x0010 - 0x0000)
struct UMGSpineSection_AddScalarParameterKey final
{
public:
	class FName                                   InParameterName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameNumber                           InTime;                                            // 0x0008(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InValue;                                           // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UMGSpineSection_AddScalarParameterKey) == 0x000004, "Wrong alignment on UMGSpineSection_AddScalarParameterKey");
static_assert(sizeof(UMGSpineSection_AddScalarParameterKey) == 0x000010, "Wrong size on UMGSpineSection_AddScalarParameterKey");
static_assert(offsetof(UMGSpineSection_AddScalarParameterKey, InParameterName) == 0x000000, "Member 'UMGSpineSection_AddScalarParameterKey::InParameterName' has a wrong offset!");
static_assert(offsetof(UMGSpineSection_AddScalarParameterKey, InTime) == 0x000008, "Member 'UMGSpineSection_AddScalarParameterKey::InTime' has a wrong offset!");
static_assert(offsetof(UMGSpineSection_AddScalarParameterKey, InValue) == 0x00000C, "Member 'UMGSpineSection_AddScalarParameterKey::InValue' has a wrong offset!");

// Function CGSpine.UMGSpineSection.AddStringParameterKey
// 0x0020 (0x0020 - 0x0000)
struct UMGSpineSection_AddStringParameterKey final
{
public:
	class FName                                   InParameterName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameNumber                           InTime;                                            // 0x0008(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InValue;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UMGSpineSection_AddStringParameterKey) == 0x000008, "Wrong alignment on UMGSpineSection_AddStringParameterKey");
static_assert(sizeof(UMGSpineSection_AddStringParameterKey) == 0x000020, "Wrong size on UMGSpineSection_AddStringParameterKey");
static_assert(offsetof(UMGSpineSection_AddStringParameterKey, InParameterName) == 0x000000, "Member 'UMGSpineSection_AddStringParameterKey::InParameterName' has a wrong offset!");
static_assert(offsetof(UMGSpineSection_AddStringParameterKey, InTime) == 0x000008, "Member 'UMGSpineSection_AddStringParameterKey::InTime' has a wrong offset!");
static_assert(offsetof(UMGSpineSection_AddStringParameterKey, InValue) == 0x000010, "Member 'UMGSpineSection_AddStringParameterKey::InValue' has a wrong offset!");

// Function CGSpine.UMGSpineSection.AddTransformParameterKey
// 0x0040 (0x0040 - 0x0000)
struct UMGSpineSection_AddTransformParameterKey final
{
public:
	class FName                                   InParameterName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameNumber                           InTime;                                            // 0x0008(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             InValue;                                           // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(UMGSpineSection_AddTransformParameterKey) == 0x000010, "Wrong alignment on UMGSpineSection_AddTransformParameterKey");
static_assert(sizeof(UMGSpineSection_AddTransformParameterKey) == 0x000040, "Wrong size on UMGSpineSection_AddTransformParameterKey");
static_assert(offsetof(UMGSpineSection_AddTransformParameterKey, InParameterName) == 0x000000, "Member 'UMGSpineSection_AddTransformParameterKey::InParameterName' has a wrong offset!");
static_assert(offsetof(UMGSpineSection_AddTransformParameterKey, InTime) == 0x000008, "Member 'UMGSpineSection_AddTransformParameterKey::InTime' has a wrong offset!");
static_assert(offsetof(UMGSpineSection_AddTransformParameterKey, InValue) == 0x000010, "Member 'UMGSpineSection_AddTransformParameterKey::InValue' has a wrong offset!");

// Function CGSpine.UMGSpineSection.RemoveScalarParameter
// 0x000C (0x000C - 0x0000)
struct UMGSpineSection_RemoveScalarParameter final
{
public:
	class FName                                   InParameterName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UMGSpineSection_RemoveScalarParameter) == 0x000004, "Wrong alignment on UMGSpineSection_RemoveScalarParameter");
static_assert(sizeof(UMGSpineSection_RemoveScalarParameter) == 0x00000C, "Wrong size on UMGSpineSection_RemoveScalarParameter");
static_assert(offsetof(UMGSpineSection_RemoveScalarParameter, InParameterName) == 0x000000, "Member 'UMGSpineSection_RemoveScalarParameter::InParameterName' has a wrong offset!");
static_assert(offsetof(UMGSpineSection_RemoveScalarParameter, ReturnValue) == 0x000008, "Member 'UMGSpineSection_RemoveScalarParameter::ReturnValue' has a wrong offset!");

// Function CGSpine.UMGSpineSection.RemoveStringParameter
// 0x000C (0x000C - 0x0000)
struct UMGSpineSection_RemoveStringParameter final
{
public:
	class FName                                   InParameterName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UMGSpineSection_RemoveStringParameter) == 0x000004, "Wrong alignment on UMGSpineSection_RemoveStringParameter");
static_assert(sizeof(UMGSpineSection_RemoveStringParameter) == 0x00000C, "Wrong size on UMGSpineSection_RemoveStringParameter");
static_assert(offsetof(UMGSpineSection_RemoveStringParameter, InParameterName) == 0x000000, "Member 'UMGSpineSection_RemoveStringParameter::InParameterName' has a wrong offset!");
static_assert(offsetof(UMGSpineSection_RemoveStringParameter, ReturnValue) == 0x000008, "Member 'UMGSpineSection_RemoveStringParameter::ReturnValue' has a wrong offset!");

// Function CGSpine.UMGSpineSection.RemoveTransformParameter
// 0x000C (0x000C - 0x0000)
struct UMGSpineSection_RemoveTransformParameter final
{
public:
	class FName                                   InParameterName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UMGSpineSection_RemoveTransformParameter) == 0x000004, "Wrong alignment on UMGSpineSection_RemoveTransformParameter");
static_assert(sizeof(UMGSpineSection_RemoveTransformParameter) == 0x00000C, "Wrong size on UMGSpineSection_RemoveTransformParameter");
static_assert(offsetof(UMGSpineSection_RemoveTransformParameter, InParameterName) == 0x000000, "Member 'UMGSpineSection_RemoveTransformParameter::InParameterName' has a wrong offset!");
static_assert(offsetof(UMGSpineSection_RemoveTransformParameter, ReturnValue) == 0x000008, "Member 'UMGSpineSection_RemoveTransformParameter::ReturnValue' has a wrong offset!");

}

