#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CGSpine

#include "Basic.hpp"

#include "CGSpine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MovieScene_classes.hpp"
#include "Engine_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class CGSpine.CGSpineData
// 0x00D0 (0x0100 - 0x0030)
class UCGSpineData final : public UDataAsset
{
public:
	TArray<struct FCGSpineParticleData>           SceneParticles;                                    // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FCGSpineLayerPlaneData>         SceneLayerPlanes;                                  // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FCGSpineObjectData>             SpineObjects;                                      // 0x0050(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FCGSpineLayerPlaneData                 BackgroundLayer;                                   // 0x0060(0x0060)(Edit, EditConst, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        PostProcessMaterial;                               // 0x00C0(0x0018)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GlobalTime;                                        // 0x00D8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKeyframeInfo_PlayParticleEffect> ParticleTriggers;                                  // 0x00E0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FKeyframeInfo_PlaySpineAnimation> SpineAnimationTriggers;                            // 0x00F0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CGSpineData">();
	}
	static class UCGSpineData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCGSpineData>();
	}
};
static_assert(alignof(UCGSpineData) == 0x000010, "Wrong alignment on UCGSpineData");
static_assert(sizeof(UCGSpineData) == 0x000100, "Wrong size on UCGSpineData");
static_assert(offsetof(UCGSpineData, SceneParticles) == 0x000030, "Member 'UCGSpineData::SceneParticles' has a wrong offset!");
static_assert(offsetof(UCGSpineData, SceneLayerPlanes) == 0x000040, "Member 'UCGSpineData::SceneLayerPlanes' has a wrong offset!");
static_assert(offsetof(UCGSpineData, SpineObjects) == 0x000050, "Member 'UCGSpineData::SpineObjects' has a wrong offset!");
static_assert(offsetof(UCGSpineData, BackgroundLayer) == 0x000060, "Member 'UCGSpineData::BackgroundLayer' has a wrong offset!");
static_assert(offsetof(UCGSpineData, PostProcessMaterial) == 0x0000C0, "Member 'UCGSpineData::PostProcessMaterial' has a wrong offset!");
static_assert(offsetof(UCGSpineData, GlobalTime) == 0x0000D8, "Member 'UCGSpineData::GlobalTime' has a wrong offset!");
static_assert(offsetof(UCGSpineData, ParticleTriggers) == 0x0000E0, "Member 'UCGSpineData::ParticleTriggers' has a wrong offset!");
static_assert(offsetof(UCGSpineData, SpineAnimationTriggers) == 0x0000F0, "Member 'UCGSpineData::SpineAnimationTriggers' has a wrong offset!");

// Class CGSpine.CGSpineLibrary
// 0x0000 (0x0028 - 0x0028)
class UCGSpineLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ClearAllCameraAnimations();
	static void ClearCGSpine(class ACameraActor* InCameraActor);
	static class ACGSpineObjectActor* CreateSpine(class UWorld* InWorld, struct FCGSpineObjectData* InData, struct FTransform* InTransform);
	static class ACGSpineObjectActor* FindSpineActorFromPlotName(const class FName& InPlotName);
	static void PlayCameraAnimation(float InTime, const struct FVector2D& InStartLocation, const struct FVector2D& InTargetLocation, const struct FVector2D& InScale);
	static void PlayCGSpine(class UCGSpineData* InData, class ACameraActor* InCameraActor, const struct FVector& InOffsetLocation, const bool bUseRealColor, const bool bCameraForceZero, bool bUseResourceAmend);
	static void SetAutoAdapteToScreen(class ACameraActor* InCameraActor, const struct FVector& InCameraAnimationEndLocation, float InFOV);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CGSpineLibrary">();
	}
	static class UCGSpineLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCGSpineLibrary>();
	}
};
static_assert(alignof(UCGSpineLibrary) == 0x000008, "Wrong alignment on UCGSpineLibrary");
static_assert(sizeof(UCGSpineLibrary) == 0x000028, "Wrong size on UCGSpineLibrary");

// Class CGSpine.CGSpineObjectActor
// 0x0058 (0x0280 - 0x0228)
class ACGSpineObjectActor final : public AActor
{
public:
	class USpineSkeletonAnimationComponent*       SpineAnimationComponent;                           // 0x0228(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USpineSkeletonRendererComponent*        SpineRenderComponent;                              // 0x0230(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_238[0x48];                                     // 0x0238(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateBone(const class FString& BoneName, bool bActivate);
	void OnAnimationCompleteHandler(class UObject* InDispatcher, class UTrackEntry* InEntry);
	void PlayAnimationSequence(const TArray<class FString>& InAnimations, bool bLoop);
	void PlayNewAnimation(const class FString& InAnimationName, bool bLoop);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CGSpineObjectActor">();
	}
	static class ACGSpineObjectActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACGSpineObjectActor>();
	}
};
static_assert(alignof(ACGSpineObjectActor) == 0x000008, "Wrong alignment on ACGSpineObjectActor");
static_assert(sizeof(ACGSpineObjectActor) == 0x000280, "Wrong size on ACGSpineObjectActor");
static_assert(offsetof(ACGSpineObjectActor, SpineAnimationComponent) == 0x000228, "Member 'ACGSpineObjectActor::SpineAnimationComponent' has a wrong offset!");
static_assert(offsetof(ACGSpineObjectActor, SpineRenderComponent) == 0x000230, "Member 'ACGSpineObjectActor::SpineRenderComponent' has a wrong offset!");

// Class CGSpine.CGSpineSubsystem
// 0x0040 (0x0070 - 0x0030)
class UCGSpineSubsystem final : public UWorldSubsystem
{
public:
	class AActor*                                 MainActor;                                         // 0x0030(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACameraActor*                           NewCameraActor;                                    // 0x0038(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 LastViewTargetActor;                               // 0x0040(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UPrimitiveComponent*>            CGSceneComponents;                                 // 0x0048(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class ACGSpineObjectActor*>            CGSpineActors;                                     // 0x0058(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    BackgroundComponent;                               // 0x0068(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CGSpineSubsystem">();
	}
	static class UCGSpineSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCGSpineSubsystem>();
	}
};
static_assert(alignof(UCGSpineSubsystem) == 0x000008, "Wrong alignment on UCGSpineSubsystem");
static_assert(sizeof(UCGSpineSubsystem) == 0x000070, "Wrong size on UCGSpineSubsystem");
static_assert(offsetof(UCGSpineSubsystem, MainActor) == 0x000030, "Member 'UCGSpineSubsystem::MainActor' has a wrong offset!");
static_assert(offsetof(UCGSpineSubsystem, NewCameraActor) == 0x000038, "Member 'UCGSpineSubsystem::NewCameraActor' has a wrong offset!");
static_assert(offsetof(UCGSpineSubsystem, LastViewTargetActor) == 0x000040, "Member 'UCGSpineSubsystem::LastViewTargetActor' has a wrong offset!");
static_assert(offsetof(UCGSpineSubsystem, CGSceneComponents) == 0x000048, "Member 'UCGSpineSubsystem::CGSceneComponents' has a wrong offset!");
static_assert(offsetof(UCGSpineSubsystem, CGSpineActors) == 0x000058, "Member 'UCGSpineSubsystem::CGSpineActors' has a wrong offset!");
static_assert(offsetof(UCGSpineSubsystem, BackgroundComponent) == 0x000068, "Member 'UCGSpineSubsystem::BackgroundComponent' has a wrong offset!");

// Class CGSpine.SpineMeshComponent
// 0x0090 (0x05A0 - 0x0510)
class USpineMeshComponent final : public UStaticMeshComponent
{
public:
	ESpineWidgetTimingPolicy                      TimingPolicy;                                      // 0x0508(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UUserWidget>                WidgetClass;                                       // 0x0510(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         BaseDrawWidth;                                     // 0x0518(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RedrawTime;                                        // 0x051C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_520[0x8];                                      // 0x0520(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bDrawAtDesiredSize;                                // 0x0528(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0530(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               MaterialInstance;                                  // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESpineWidgetTickMode                          TickMode;                                          // 0x0540(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_541[0x1F];                                     // 0x0541(0x001F)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Widget;                                            // 0x0560(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_568[0x38];                                     // 0x0568(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetRedrawTime(float InRedrawTime);
	void SetTickMode(ESpineWidgetTickMode InTickMode);
	void SetWidget(class UUserWidget* Widget_0);

	float GetRedrawTime() const;
	class UTextureRenderTarget2D* GetRenderTarget() const;
	class UUserWidget* GetUserWidgetObject() const;
	class UUserWidget* GetWidget() const;
	bool IsWidgetVisible() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpineMeshComponent">();
	}
	static class USpineMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpineMeshComponent>();
	}
};
static_assert(alignof(USpineMeshComponent) == 0x000010, "Wrong alignment on USpineMeshComponent");
static_assert(sizeof(USpineMeshComponent) == 0x0005A0, "Wrong size on USpineMeshComponent");
static_assert(offsetof(USpineMeshComponent, TimingPolicy) == 0x000508, "Member 'USpineMeshComponent::TimingPolicy' has a wrong offset!");
static_assert(offsetof(USpineMeshComponent, WidgetClass) == 0x000510, "Member 'USpineMeshComponent::WidgetClass' has a wrong offset!");
static_assert(offsetof(USpineMeshComponent, BaseDrawWidth) == 0x000518, "Member 'USpineMeshComponent::BaseDrawWidth' has a wrong offset!");
static_assert(offsetof(USpineMeshComponent, RedrawTime) == 0x00051C, "Member 'USpineMeshComponent::RedrawTime' has a wrong offset!");
static_assert(offsetof(USpineMeshComponent, bDrawAtDesiredSize) == 0x000528, "Member 'USpineMeshComponent::bDrawAtDesiredSize' has a wrong offset!");
static_assert(offsetof(USpineMeshComponent, RenderTarget) == 0x000530, "Member 'USpineMeshComponent::RenderTarget' has a wrong offset!");
static_assert(offsetof(USpineMeshComponent, MaterialInstance) == 0x000538, "Member 'USpineMeshComponent::MaterialInstance' has a wrong offset!");
static_assert(offsetof(USpineMeshComponent, TickMode) == 0x000540, "Member 'USpineMeshComponent::TickMode' has a wrong offset!");
static_assert(offsetof(USpineMeshComponent, Widget) == 0x000560, "Member 'USpineMeshComponent::Widget' has a wrong offset!");

// Class CGSpine.UMGSpineController
// 0x0080 (0x01A8 - 0x0128)
class UUMGSpineController final : public UWidget
{
public:
	TSoftObjectPtr<class UCGSpineData>            CGSpineData;                                       // 0x0128(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bPerspective : 1;                                  // 0x0150(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CameraFOV;                                         // 0x0154(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraZoomScale;                                   // 0x0158(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CameraLocation;                                    // 0x015C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CameraRotation;                                    // 0x0168(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CameraOffsetLocation;                              // 0x0174(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCustomWorld;                                   // 0x0180(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_181[0x27];                                     // 0x0181(0x0027)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ChangeCGSpine(class UCGSpineData* InCGSpineData);
	void PlayCGSpine(class ACameraActor* InCameraActor);
	void SetCameraFov(float InValue);
	void SetCameraLocation(const struct FVector& InValue);
	void SetCameraRotation(const struct FVector& InValue);
	void SetCameraZoomScale(float InValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UMGSpineController">();
	}
	static class UUMGSpineController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMGSpineController>();
	}
};
static_assert(alignof(UUMGSpineController) == 0x000008, "Wrong alignment on UUMGSpineController");
static_assert(sizeof(UUMGSpineController) == 0x0001A8, "Wrong size on UUMGSpineController");
static_assert(offsetof(UUMGSpineController, CGSpineData) == 0x000128, "Member 'UUMGSpineController::CGSpineData' has a wrong offset!");
static_assert(offsetof(UUMGSpineController, CameraFOV) == 0x000154, "Member 'UUMGSpineController::CameraFOV' has a wrong offset!");
static_assert(offsetof(UUMGSpineController, CameraZoomScale) == 0x000158, "Member 'UUMGSpineController::CameraZoomScale' has a wrong offset!");
static_assert(offsetof(UUMGSpineController, CameraLocation) == 0x00015C, "Member 'UUMGSpineController::CameraLocation' has a wrong offset!");
static_assert(offsetof(UUMGSpineController, CameraRotation) == 0x000168, "Member 'UUMGSpineController::CameraRotation' has a wrong offset!");
static_assert(offsetof(UUMGSpineController, CameraOffsetLocation) == 0x000174, "Member 'UUMGSpineController::CameraOffsetLocation' has a wrong offset!");
static_assert(offsetof(UUMGSpineController, bUseCustomWorld) == 0x000180, "Member 'UUMGSpineController::bUseCustomWorld' has a wrong offset!");

// Class CGSpine.UMGSpineSection
// 0x0030 (0x0118 - 0x00E8)
class UUMGSpineSection final : public UMovieSceneSection
{
public:
	TArray<struct FCGSpineScalarParameterNameAndCurve> ScalarParameterNamesAndCurves;                     // 0x00E8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FCGSpineTransformParameterNameAndCurves> TransformParameterNamesAndCurves;                  // 0x00F8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FCGSpineStringParameterNameAndCurve> StringParameterNamesAndCurves;                     // 0x0108(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void AddScalarParameterKey(class FName InParameterName, const struct FFrameNumber& InTime, float InValue);
	void AddStringParameterKey(class FName InParameterName, const struct FFrameNumber& InTime, const class FString& InValue);
	void AddTransformParameterKey(class FName InParameterName, const struct FFrameNumber& InTime, const struct FTransform& InValue);
	bool RemoveScalarParameter(class FName InParameterName);
	bool RemoveStringParameter(class FName InParameterName);
	bool RemoveTransformParameter(class FName InParameterName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UMGSpineSection">();
	}
	static class UUMGSpineSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMGSpineSection>();
	}
};
static_assert(alignof(UUMGSpineSection) == 0x000008, "Wrong alignment on UUMGSpineSection");
static_assert(sizeof(UUMGSpineSection) == 0x000118, "Wrong size on UUMGSpineSection");
static_assert(offsetof(UUMGSpineSection, ScalarParameterNamesAndCurves) == 0x0000E8, "Member 'UUMGSpineSection::ScalarParameterNamesAndCurves' has a wrong offset!");
static_assert(offsetof(UUMGSpineSection, TransformParameterNamesAndCurves) == 0x0000F8, "Member 'UUMGSpineSection::TransformParameterNamesAndCurves' has a wrong offset!");
static_assert(offsetof(UUMGSpineSection, StringParameterNamesAndCurves) == 0x000108, "Member 'UUMGSpineSection::StringParameterNamesAndCurves' has a wrong offset!");

// Class CGSpine.UMGSpineTrack
// 0x0030 (0x00A8 - 0x0078)
class UUMGSpineTrack final : public UMovieSceneTrack
{
public:
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ObjectName;                                        // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECGSpineObjectType                            ObjectType;                                        // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0098(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UMGSpineTrack">();
	}
	static class UUMGSpineTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMGSpineTrack>();
	}
};
static_assert(alignof(UUMGSpineTrack) == 0x000008, "Wrong alignment on UUMGSpineTrack");
static_assert(sizeof(UUMGSpineTrack) == 0x0000A8, "Wrong size on UUMGSpineTrack");
static_assert(offsetof(UUMGSpineTrack, ObjectName) == 0x000080, "Member 'UUMGSpineTrack::ObjectName' has a wrong offset!");
static_assert(offsetof(UUMGSpineTrack, ObjectType) == 0x000090, "Member 'UUMGSpineTrack::ObjectType' has a wrong offset!");
static_assert(offsetof(UUMGSpineTrack, Sections) == 0x000098, "Member 'UUMGSpineTrack::Sections' has a wrong offset!");

// Class CGSpine.UMGSpineUserWidget
// 0x0000 (0x0280 - 0x0280)
class UUMGSpineUserWidget final : public UUserWidget
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UMGSpineUserWidget">();
	}
	static class UUMGSpineUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMGSpineUserWidget>();
	}
};
static_assert(alignof(UUMGSpineUserWidget) == 0x000008, "Wrong alignment on UUMGSpineUserWidget");
static_assert(sizeof(UUMGSpineUserWidget) == 0x000280, "Wrong size on UUMGSpineUserWidget");

}

