#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChangeSkillCDOnSkillContinuityCast

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ChangeSkillCDOnSkillContinuityCast.ChangeSkillCDOnSkillContinuityCast_C
// 0x0058 (0x0180 - 0x0128)
class UChangeSkillCDOnSkillContinuityCast_C final : public UCustomGameAbilityBuffer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0128(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class FString>                         CheckTypes;                                        // 0x0130(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         TriggerTimes;                                      // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Continuetly;                                       // 0x0144(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ChangeValue;                                       // 0x0148(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPercentChange;                                    // 0x014C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CheckSkillTypes;                                   // 0x0150(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ClearOnPass;                                       // 0x0160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PreSkillID;                                        // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentTriggerTimes;                               // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PreSkillTriggerTime;                               // 0x016C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggerMinDeltaTime;                               // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TeamCheck;                                         // 0x0174(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CacheID;                                           // 0x0178(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void IsSameSkill(int32 NewSkill, bool* Result);
	void GetBindAbility(TArray<class UAbilityComponentBase*>* Abilitys);
	bool IsControlByModifier();
	void CacheEffectSkill(int32 SkillID);
	void IsSkillIndexCorrect(class UAbilityComponentBase* Ability, int32 SkillID, bool* Valid);
	void Clear();
	void OnReceiveNotify(int32 SkillID, class UAbilityComponentBase* Ability, TArray<int32>& OriginSkillIDs);
	void K2_ReceiveInitialize(const TArray<struct FParamInfo>& Info, const class UGameAbilityComponent* LpInstigator);
	void BindEventToSkillStart(const TArray<class UAbilityComponentBase*>& Ability);
	void OnAbilityCastSkill(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void OnSkillCoolDown(int32 InSkillId, class UGameAbilityComponent* AbilityRef);
	void K2_ReceiveActive(const class UObject* Instigator);
	void UnbindEventToSkillStart(const TArray<class UAbilityComponentBase*>& Ability);
	void K2_ReceiveDeActive(const class UGameAbilityComponent* Pawn);
	void ExecuteUbergraph_ChangeSkillCDOnSkillContinuityCast(int32 EntryPoint);

	float K2_GetAliveTime() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChangeSkillCDOnSkillContinuityCast_C">();
	}
	static class UChangeSkillCDOnSkillContinuityCast_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChangeSkillCDOnSkillContinuityCast_C>();
	}
};
static_assert(alignof(UChangeSkillCDOnSkillContinuityCast_C) == 0x000008, "Wrong alignment on UChangeSkillCDOnSkillContinuityCast_C");
static_assert(sizeof(UChangeSkillCDOnSkillContinuityCast_C) == 0x000180, "Wrong size on UChangeSkillCDOnSkillContinuityCast_C");
static_assert(offsetof(UChangeSkillCDOnSkillContinuityCast_C, UberGraphFrame) == 0x000128, "Member 'UChangeSkillCDOnSkillContinuityCast_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChangeSkillCDOnSkillContinuityCast_C, CheckTypes) == 0x000130, "Member 'UChangeSkillCDOnSkillContinuityCast_C::CheckTypes' has a wrong offset!");
static_assert(offsetof(UChangeSkillCDOnSkillContinuityCast_C, TriggerTimes) == 0x000140, "Member 'UChangeSkillCDOnSkillContinuityCast_C::TriggerTimes' has a wrong offset!");
static_assert(offsetof(UChangeSkillCDOnSkillContinuityCast_C, Continuetly) == 0x000144, "Member 'UChangeSkillCDOnSkillContinuityCast_C::Continuetly' has a wrong offset!");
static_assert(offsetof(UChangeSkillCDOnSkillContinuityCast_C, ChangeValue) == 0x000148, "Member 'UChangeSkillCDOnSkillContinuityCast_C::ChangeValue' has a wrong offset!");
static_assert(offsetof(UChangeSkillCDOnSkillContinuityCast_C, bPercentChange) == 0x00014C, "Member 'UChangeSkillCDOnSkillContinuityCast_C::bPercentChange' has a wrong offset!");
static_assert(offsetof(UChangeSkillCDOnSkillContinuityCast_C, CheckSkillTypes) == 0x000150, "Member 'UChangeSkillCDOnSkillContinuityCast_C::CheckSkillTypes' has a wrong offset!");
static_assert(offsetof(UChangeSkillCDOnSkillContinuityCast_C, ClearOnPass) == 0x000160, "Member 'UChangeSkillCDOnSkillContinuityCast_C::ClearOnPass' has a wrong offset!");
static_assert(offsetof(UChangeSkillCDOnSkillContinuityCast_C, PreSkillID) == 0x000164, "Member 'UChangeSkillCDOnSkillContinuityCast_C::PreSkillID' has a wrong offset!");
static_assert(offsetof(UChangeSkillCDOnSkillContinuityCast_C, CurrentTriggerTimes) == 0x000168, "Member 'UChangeSkillCDOnSkillContinuityCast_C::CurrentTriggerTimes' has a wrong offset!");
static_assert(offsetof(UChangeSkillCDOnSkillContinuityCast_C, PreSkillTriggerTime) == 0x00016C, "Member 'UChangeSkillCDOnSkillContinuityCast_C::PreSkillTriggerTime' has a wrong offset!");
static_assert(offsetof(UChangeSkillCDOnSkillContinuityCast_C, TriggerMinDeltaTime) == 0x000170, "Member 'UChangeSkillCDOnSkillContinuityCast_C::TriggerMinDeltaTime' has a wrong offset!");
static_assert(offsetof(UChangeSkillCDOnSkillContinuityCast_C, TeamCheck) == 0x000174, "Member 'UChangeSkillCDOnSkillContinuityCast_C::TeamCheck' has a wrong offset!");
static_assert(offsetof(UChangeSkillCDOnSkillContinuityCast_C, CacheID) == 0x000178, "Member 'UChangeSkillCDOnSkillContinuityCast_C::CacheID' has a wrong offset!");

}

