#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChangeSkillCDOnSkillContinuityCast

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function ChangeSkillCDOnSkillContinuityCast.ChangeSkillCDOnSkillContinuityCast_C.IsSameSkill
// 0x0030 (0x0030 - 0x0000)
struct ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill final
{
public:
	int32                                         NewSkill;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SpecialSkill2_SameID;                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpecialSkill2;                                     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpecialSkill1_SameID;                              // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpecialSkill1;                                     // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentSkill;                                      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_6;          // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_7;          // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_8;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill) == 0x000004, "Wrong alignment on ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill");
static_assert(sizeof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill) == 0x000030, "Wrong size on ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill, NewSkill) == 0x000000, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill::NewSkill' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill, Result) == 0x000004, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill::Result' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill, SpecialSkill2_SameID) == 0x000008, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill::SpecialSkill2_SameID' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill, SpecialSkill2) == 0x00000C, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill::SpecialSkill2' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill, SpecialSkill1_SameID) == 0x000010, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill::SpecialSkill1_SameID' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill, SpecialSkill1) == 0x000014, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill::SpecialSkill1' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill, CurrentSkill) == 0x000018, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill::CurrentSkill' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00001C, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00001D, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00001E, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill, CallFunc_BooleanAND_ReturnValue) == 0x00001F, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x000020, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill, CallFunc_BooleanAND_ReturnValue_1) == 0x000021, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill, CallFunc_BooleanOR_ReturnValue) == 0x000022, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x000023, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill, CallFunc_EqualEqual_IntInt_ReturnValue_5) == 0x000024, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill::CallFunc_EqualEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill, CallFunc_BooleanAND_ReturnValue_2) == 0x000025, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill, CallFunc_EqualEqual_IntInt_ReturnValue_6) == 0x000026, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill::CallFunc_EqualEqual_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill, CallFunc_EqualEqual_IntInt_ReturnValue_7) == 0x000027, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill::CallFunc_EqualEqual_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill, CallFunc_BooleanAND_ReturnValue_3) == 0x000028, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill, CallFunc_EqualEqual_IntInt_ReturnValue_8) == 0x000029, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill::CallFunc_EqualEqual_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill, CallFunc_BooleanOR_ReturnValue_1) == 0x00002A, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill, CallFunc_BooleanOR_ReturnValue_2) == 0x00002B, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill, CallFunc_BooleanOR_ReturnValue_3) == 0x00002C, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSameSkill::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");

// Function ChangeSkillCDOnSkillContinuityCast.ChangeSkillCDOnSkillContinuityCast_C.GetBindAbility
// 0x00A8 (0x00A8 - 0x0000)
struct ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility final
{
public:
	TArray<class UAbilityComponentBase*>          Abilitys;                                          // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UAbilityComponentBase*>          Results;                                           // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         ___int_Array_Index_Variable;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAbilityComponentBase*>          K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayerController*                  CallFunc_GetCharacterController_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGameCharacter*>                 CallFunc_GetPlayerCharacters_ReturnValue;          // 0x0068(0x0010)(ReferenceParm)
	class AGameCharacter*                         CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAbilityCharacterInterface> CallFunc_GetAbilityComponent_self_CastInput;       // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilityComponentBase*                  CallFunc_GetAbilityComponent_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility) == 0x000008, "Wrong alignment on ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility");
static_assert(sizeof(ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility) == 0x0000A8, "Wrong size on ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility, Abilitys) == 0x000000, "Member 'ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility::Abilitys' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility, Results) == 0x000010, "Member 'ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility::Results' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility, ___int_Array_Index_Variable) == 0x000020, "Member 'ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility, ___int_Loop_Counter_Variable) == 0x000024, "Member 'ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility, K2Node_MakeArray_Array) == 0x000030, "Member 'ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility, K2Node_DynamicCast_AsGame_Character) == 0x000048, "Member 'ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility, CallFunc_GetCharacterController_ReturnValue) == 0x000058, "Member 'ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility::CallFunc_GetCharacterController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility, CallFunc_GetPlayerCharacters_ReturnValue) == 0x000068, "Member 'ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility::CallFunc_GetPlayerCharacters_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility, CallFunc_Array_Get_Item) == 0x000078, "Member 'ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility, CallFunc_GetAbilityComponent_self_CastInput) == 0x000088, "Member 'ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility::CallFunc_GetAbilityComponent_self_CastInput' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility, CallFunc_GetAbilityComponent_ReturnValue) == 0x000098, "Member 'ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility::CallFunc_GetAbilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility, CallFunc_Array_AddUnique_ReturnValue) == 0x0000A4, "Member 'ChangeSkillCDOnSkillContinuityCast_C_GetBindAbility::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function ChangeSkillCDOnSkillContinuityCast.ChangeSkillCDOnSkillContinuityCast_C.IsControlByModifier
// 0x0001 (0x0001 - 0x0000)
struct ChangeSkillCDOnSkillContinuityCast_C_IsControlByModifier final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChangeSkillCDOnSkillContinuityCast_C_IsControlByModifier) == 0x000001, "Wrong alignment on ChangeSkillCDOnSkillContinuityCast_C_IsControlByModifier");
static_assert(sizeof(ChangeSkillCDOnSkillContinuityCast_C_IsControlByModifier) == 0x000001, "Wrong size on ChangeSkillCDOnSkillContinuityCast_C_IsControlByModifier");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsControlByModifier, ReturnValue) == 0x000000, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsControlByModifier::ReturnValue' has a wrong offset!");

// Function ChangeSkillCDOnSkillContinuityCast.ChangeSkillCDOnSkillContinuityCast_C.CacheEffectSkill
// 0x0004 (0x0004 - 0x0000)
struct ChangeSkillCDOnSkillContinuityCast_C_CacheEffectSkill final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChangeSkillCDOnSkillContinuityCast_C_CacheEffectSkill) == 0x000004, "Wrong alignment on ChangeSkillCDOnSkillContinuityCast_C_CacheEffectSkill");
static_assert(sizeof(ChangeSkillCDOnSkillContinuityCast_C_CacheEffectSkill) == 0x000004, "Wrong size on ChangeSkillCDOnSkillContinuityCast_C_CacheEffectSkill");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_CacheEffectSkill, SkillID) == 0x000000, "Member 'ChangeSkillCDOnSkillContinuityCast_C_CacheEffectSkill::SkillID' has a wrong offset!");

// Function ChangeSkillCDOnSkillContinuityCast.ChangeSkillCDOnSkillContinuityCast_C.IsSkillIndexCorrect
// 0x03E0 (0x03E0 - 0x0000)
struct ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect final
{
public:
	class UAbilityComponentBase*                  Ability;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SkillID;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Valid;                                             // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponent*                      K2Node_DynamicCast_AsAbility_Component;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSkillInfo                             CallFunc_K2_GetSkillInfo_ReturnValue;              // 0x0028(0x0388)(ConstParm)
	int32                                         CallFunc_GetSkillIndex_ReturnValue;                // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x03B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x03B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x03BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x03BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BD[0x3];                                      // 0x03BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C5[0x3];                                      // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x3];                                      // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Variable;                                   // 0x03D4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect) == 0x000008, "Wrong alignment on ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect");
static_assert(sizeof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect) == 0x0003E0, "Wrong size on ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, Ability) == 0x000000, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::Ability' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, SkillID) == 0x000008, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::SkillID' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, Valid) == 0x00000C, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::Valid' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, Result) == 0x00000D, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::Result' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, ___int_Loop_Counter_Variable) == 0x000010, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, K2Node_DynamicCast_AsAbility_Component) == 0x000018, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::K2Node_DynamicCast_AsAbility_Component' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, CallFunc_K2_GetSkillInfo_ReturnValue) == 0x000028, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::CallFunc_K2_GetSkillInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, CallFunc_GetSkillIndex_ReturnValue) == 0x0003B0, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::CallFunc_GetSkillIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, CallFunc_Not_PreBool_ReturnValue) == 0x0003B4, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0003B5, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0003B6, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, CallFunc_BooleanAND_ReturnValue) == 0x0003B7, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0003B8, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, CallFunc_BooleanAND_ReturnValue_1) == 0x0003B9, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x0003BA, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x0003BB, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, CallFunc_BooleanOR_ReturnValue) == 0x0003BC, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, CallFunc_Array_Length_ReturnValue) == 0x0003C0, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, CallFunc_Less_IntInt_ReturnValue) == 0x0003C4, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, ___int_Array_Index_Variable) == 0x0003C8, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, CallFunc_Array_Get_Item) == 0x0003CC, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, K2Node_SwitchInteger_CmpSuccess) == 0x0003D0, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, ___int_Variable) == 0x0003D4, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::___int_Variable' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect, CallFunc_Array_Contains_ReturnValue) == 0x0003D8, "Member 'ChangeSkillCDOnSkillContinuityCast_C_IsSkillIndexCorrect::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function ChangeSkillCDOnSkillContinuityCast.ChangeSkillCDOnSkillContinuityCast_C.OnReceiveNotify
// 0x03F8 (0x03F8 - 0x0000)
struct ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  Ability;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 OriginSkillIDs;                                    // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CurrentSkillId;                                    // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentTime;                                       // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSkillInfo                             CallFunc_K2_GetSkillInfo_ReturnValue;              // 0x0028(0x0388)(ConstParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x3];                                      // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeSinceCreation_ReturnValue;     // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeSinceCreation_ReturnValue_1;   // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CD[0x3];                                      // 0x03CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Variable;                                   // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x03D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x03D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D6[0x2];                                      // 0x03D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSameSkill_Result;                       // 0x03DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x03DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSameSkill_Result_1;                     // 0x03DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x03EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x03EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x03EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x03ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x03EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x03EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSkillIndexCorrect_Valid;                // 0x03F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify) == 0x000008, "Wrong alignment on ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify");
static_assert(sizeof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify) == 0x0003F8, "Wrong size on ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, SkillID) == 0x000000, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::SkillID' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, Ability) == 0x000008, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::Ability' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, OriginSkillIDs) == 0x000010, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::OriginSkillIDs' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CurrentSkillId) == 0x000020, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CurrentSkillId' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CurrentTime) == 0x000024, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CurrentTime' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_K2_GetSkillInfo_ReturnValue) == 0x000028, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_K2_GetSkillInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_GetOwner_ReturnValue) == 0x0003B0, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0003B8, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_GetGameTimeSinceCreation_ReturnValue) == 0x0003BC, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_GetGameTimeSinceCreation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_GetOwner_ReturnValue_1) == 0x0003C0, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_GetGameTimeSinceCreation_ReturnValue_1) == 0x0003C8, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_GetGameTimeSinceCreation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_Not_PreBool_ReturnValue) == 0x0003CC, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, ___int_Variable) == 0x0003D0, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::___int_Variable' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_Less_FloatFloat_ReturnValue) == 0x0003D4, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0003D5, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_Add_IntInt_ReturnValue) == 0x0003D8, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_IsSameSkill_Result) == 0x0003DC, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_IsSameSkill_Result' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_Not_PreBool_ReturnValue_1) == 0x0003DD, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_BooleanAND_ReturnValue) == 0x0003DE, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_IsSameSkill_Result_1) == 0x0003DF, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_IsSameSkill_Result_1' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_BooleanAND_ReturnValue_1) == 0x0003E0, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0003E4, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0003E8, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0003E9, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_BooleanOR_ReturnValue) == 0x0003EA, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x0003EB, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_BooleanAND_ReturnValue_2) == 0x0003EC, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_BooleanAND_ReturnValue_3) == 0x0003ED, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_Array_Contains_ReturnValue) == 0x0003EE, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_BooleanAND_ReturnValue_4) == 0x0003EF, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0003F0, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_BooleanAND_ReturnValue_5) == 0x0003F1, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify, CallFunc_IsSkillIndexCorrect_Valid) == 0x0003F2, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnReceiveNotify::CallFunc_IsSkillIndexCorrect_Valid' has a wrong offset!");

// Function ChangeSkillCDOnSkillContinuityCast.ChangeSkillCDOnSkillContinuityCast_C.K2_ReceiveInitialize
// 0x0018 (0x0018 - 0x0000)
struct ChangeSkillCDOnSkillContinuityCast_C_K2_ReceiveInitialize final
{
public:
	TArray<struct FParamInfo>                     Info;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	const class UGameAbilityComponent*            LpInstigator;                                      // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChangeSkillCDOnSkillContinuityCast_C_K2_ReceiveInitialize) == 0x000008, "Wrong alignment on ChangeSkillCDOnSkillContinuityCast_C_K2_ReceiveInitialize");
static_assert(sizeof(ChangeSkillCDOnSkillContinuityCast_C_K2_ReceiveInitialize) == 0x000018, "Wrong size on ChangeSkillCDOnSkillContinuityCast_C_K2_ReceiveInitialize");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_K2_ReceiveInitialize, Info) == 0x000000, "Member 'ChangeSkillCDOnSkillContinuityCast_C_K2_ReceiveInitialize::Info' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_K2_ReceiveInitialize, LpInstigator) == 0x000010, "Member 'ChangeSkillCDOnSkillContinuityCast_C_K2_ReceiveInitialize::LpInstigator' has a wrong offset!");

// Function ChangeSkillCDOnSkillContinuityCast.ChangeSkillCDOnSkillContinuityCast_C.BindEventToSkillStart
// 0x0010 (0x0010 - 0x0000)
struct ChangeSkillCDOnSkillContinuityCast_C_BindEventToSkillStart final
{
public:
	TArray<class UAbilityComponentBase*>          Ability;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(ChangeSkillCDOnSkillContinuityCast_C_BindEventToSkillStart) == 0x000008, "Wrong alignment on ChangeSkillCDOnSkillContinuityCast_C_BindEventToSkillStart");
static_assert(sizeof(ChangeSkillCDOnSkillContinuityCast_C_BindEventToSkillStart) == 0x000010, "Wrong size on ChangeSkillCDOnSkillContinuityCast_C_BindEventToSkillStart");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_BindEventToSkillStart, Ability) == 0x000000, "Member 'ChangeSkillCDOnSkillContinuityCast_C_BindEventToSkillStart::Ability' has a wrong offset!");

// Function ChangeSkillCDOnSkillContinuityCast.ChangeSkillCDOnSkillContinuityCast_C.OnAbilityCastSkill
// 0x0020 (0x0020 - 0x0000)
struct ChangeSkillCDOnSkillContinuityCast_C_OnAbilityCastSkill final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OriginSkills;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UGameAbilityComponent*                  AbilityRef;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChangeSkillCDOnSkillContinuityCast_C_OnAbilityCastSkill) == 0x000008, "Wrong alignment on ChangeSkillCDOnSkillContinuityCast_C_OnAbilityCastSkill");
static_assert(sizeof(ChangeSkillCDOnSkillContinuityCast_C_OnAbilityCastSkill) == 0x000020, "Wrong size on ChangeSkillCDOnSkillContinuityCast_C_OnAbilityCastSkill");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnAbilityCastSkill, SkillID) == 0x000000, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnAbilityCastSkill::SkillID' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnAbilityCastSkill, OriginSkills) == 0x000008, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnAbilityCastSkill::OriginSkills' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnAbilityCastSkill, AbilityRef) == 0x000018, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnAbilityCastSkill::AbilityRef' has a wrong offset!");

// Function ChangeSkillCDOnSkillContinuityCast.ChangeSkillCDOnSkillContinuityCast_C.OnSkillCoolDown
// 0x0010 (0x0010 - 0x0000)
struct ChangeSkillCDOnSkillContinuityCast_C_OnSkillCoolDown final
{
public:
	int32                                         InSkillId;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameAbilityComponent*                  AbilityRef;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChangeSkillCDOnSkillContinuityCast_C_OnSkillCoolDown) == 0x000008, "Wrong alignment on ChangeSkillCDOnSkillContinuityCast_C_OnSkillCoolDown");
static_assert(sizeof(ChangeSkillCDOnSkillContinuityCast_C_OnSkillCoolDown) == 0x000010, "Wrong size on ChangeSkillCDOnSkillContinuityCast_C_OnSkillCoolDown");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnSkillCoolDown, InSkillId) == 0x000000, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnSkillCoolDown::InSkillId' has a wrong offset!");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_OnSkillCoolDown, AbilityRef) == 0x000008, "Member 'ChangeSkillCDOnSkillContinuityCast_C_OnSkillCoolDown::AbilityRef' has a wrong offset!");

// Function ChangeSkillCDOnSkillContinuityCast.ChangeSkillCDOnSkillContinuityCast_C.K2_ReceiveActive
// 0x0008 (0x0008 - 0x0000)
struct ChangeSkillCDOnSkillContinuityCast_C_K2_ReceiveActive final
{
public:
	const class UObject*                          Instigator;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChangeSkillCDOnSkillContinuityCast_C_K2_ReceiveActive) == 0x000008, "Wrong alignment on ChangeSkillCDOnSkillContinuityCast_C_K2_ReceiveActive");
static_assert(sizeof(ChangeSkillCDOnSkillContinuityCast_C_K2_ReceiveActive) == 0x000008, "Wrong size on ChangeSkillCDOnSkillContinuityCast_C_K2_ReceiveActive");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_K2_ReceiveActive, Instigator) == 0x000000, "Member 'ChangeSkillCDOnSkillContinuityCast_C_K2_ReceiveActive::Instigator' has a wrong offset!");

// Function ChangeSkillCDOnSkillContinuityCast.ChangeSkillCDOnSkillContinuityCast_C.UnbindEventToSkillStart
// 0x0010 (0x0010 - 0x0000)
struct ChangeSkillCDOnSkillContinuityCast_C_UnbindEventToSkillStart final
{
public:
	TArray<class UAbilityComponentBase*>          Ability;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(ChangeSkillCDOnSkillContinuityCast_C_UnbindEventToSkillStart) == 0x000008, "Wrong alignment on ChangeSkillCDOnSkillContinuityCast_C_UnbindEventToSkillStart");
static_assert(sizeof(ChangeSkillCDOnSkillContinuityCast_C_UnbindEventToSkillStart) == 0x000010, "Wrong size on ChangeSkillCDOnSkillContinuityCast_C_UnbindEventToSkillStart");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_UnbindEventToSkillStart, Ability) == 0x000000, "Member 'ChangeSkillCDOnSkillContinuityCast_C_UnbindEventToSkillStart::Ability' has a wrong offset!");

// Function ChangeSkillCDOnSkillContinuityCast.ChangeSkillCDOnSkillContinuityCast_C.K2_ReceiveDeActive
// 0x0008 (0x0008 - 0x0000)
struct ChangeSkillCDOnSkillContinuityCast_C_K2_ReceiveDeActive final
{
public:
	const class UGameAbilityComponent*            Pawn;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChangeSkillCDOnSkillContinuityCast_C_K2_ReceiveDeActive) == 0x000008, "Wrong alignment on ChangeSkillCDOnSkillContinuityCast_C_K2_ReceiveDeActive");
static_assert(sizeof(ChangeSkillCDOnSkillContinuityCast_C_K2_ReceiveDeActive) == 0x000008, "Wrong size on ChangeSkillCDOnSkillContinuityCast_C_K2_ReceiveDeActive");
static_assert(offsetof(ChangeSkillCDOnSkillContinuityCast_C_K2_ReceiveDeActive, Pawn) == 0x000000, "Member 'ChangeSkillCDOnSkillContinuityCast_C_K2_ReceiveDeActive::Pawn' has a wrong offset!");

// Function ChangeSkillCDOnSkillContinuityCast.ChangeSkillCDOnSkillContinuityCast_C.ExecuteUbergraph_ChangeSkillCDOnSkillContinuityCast
// 0x01E0 (0x01E0 - 0x0000)
struct ChangeSkillCDOnSkillContinuityCast_C_ExecuteUbergraph_ChangeSkillCDOnSkillContinuityCast final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable;                                   // 0x0004(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable_1;                                 // 0x000C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable_2;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable_3;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SkillID, TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef)> K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
