#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChapterMap

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ChapterMap.ChapterMap_UserWidget.ConvertToWidgetCenterPos
// 0x0010 (0x0010 - 0x0000)
struct ChapterMap_UserWidget_ConvertToWidgetCenterPos final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChapterMap_UserWidget_ConvertToWidgetCenterPos) == 0x000004, "Wrong alignment on ChapterMap_UserWidget_ConvertToWidgetCenterPos");
static_assert(sizeof(ChapterMap_UserWidget_ConvertToWidgetCenterPos) == 0x000010, "Wrong size on ChapterMap_UserWidget_ConvertToWidgetCenterPos");
static_assert(offsetof(ChapterMap_UserWidget_ConvertToWidgetCenterPos, X) == 0x000000, "Member 'ChapterMap_UserWidget_ConvertToWidgetCenterPos::X' has a wrong offset!");
static_assert(offsetof(ChapterMap_UserWidget_ConvertToWidgetCenterPos, Y) == 0x000004, "Member 'ChapterMap_UserWidget_ConvertToWidgetCenterPos::Y' has a wrong offset!");
static_assert(offsetof(ChapterMap_UserWidget_ConvertToWidgetCenterPos, ReturnValue) == 0x000008, "Member 'ChapterMap_UserWidget_ConvertToWidgetCenterPos::ReturnValue' has a wrong offset!");

// Function ChapterMap.ChapterMap_UserWidget.GetImgMapSize
// 0x0008 (0x0008 - 0x0000)
struct ChapterMap_UserWidget_GetImgMapSize final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChapterMap_UserWidget_GetImgMapSize) == 0x000004, "Wrong alignment on ChapterMap_UserWidget_GetImgMapSize");
static_assert(sizeof(ChapterMap_UserWidget_GetImgMapSize) == 0x000008, "Wrong size on ChapterMap_UserWidget_GetImgMapSize");
static_assert(offsetof(ChapterMap_UserWidget_GetImgMapSize, ReturnValue) == 0x000000, "Member 'ChapterMap_UserWidget_GetImgMapSize::ReturnValue' has a wrong offset!");

// Function ChapterMap.ChapterMap_UserWidget.LoadMapData
// 0x0020 (0x0020 - 0x0000)
struct ChapterMap_UserWidget_LoadMapData final
{
public:
	int32                                         MapId;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DataPath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChapterMap_UserWidget_LoadMapData) == 0x000008, "Wrong alignment on ChapterMap_UserWidget_LoadMapData");
static_assert(sizeof(ChapterMap_UserWidget_LoadMapData) == 0x000020, "Wrong size on ChapterMap_UserWidget_LoadMapData");
static_assert(offsetof(ChapterMap_UserWidget_LoadMapData, MapId) == 0x000000, "Member 'ChapterMap_UserWidget_LoadMapData::MapId' has a wrong offset!");
static_assert(offsetof(ChapterMap_UserWidget_LoadMapData, DataPath) == 0x000008, "Member 'ChapterMap_UserWidget_LoadMapData::DataPath' has a wrong offset!");
static_assert(offsetof(ChapterMap_UserWidget_LoadMapData, ReturnValue) == 0x000018, "Member 'ChapterMap_UserWidget_LoadMapData::ReturnValue' has a wrong offset!");

// Function ChapterMap.ChapterMap_UserWidget.LuaDrawBezierNodes
// 0x0008 (0x0008 - 0x0000)
struct ChapterMap_UserWidget_LuaDrawBezierNodes final
{
public:
	class UCanvasPanel*                           CanvasPanel;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChapterMap_UserWidget_LuaDrawBezierNodes) == 0x000008, "Wrong alignment on ChapterMap_UserWidget_LuaDrawBezierNodes");
static_assert(sizeof(ChapterMap_UserWidget_LuaDrawBezierNodes) == 0x000008, "Wrong size on ChapterMap_UserWidget_LuaDrawBezierNodes");
static_assert(offsetof(ChapterMap_UserWidget_LuaDrawBezierNodes, CanvasPanel) == 0x000000, "Member 'ChapterMap_UserWidget_LuaDrawBezierNodes::CanvasPanel' has a wrong offset!");

// Function ChapterMap.ChapterMap_UserWidget.UnlockRegion
// 0x0004 (0x0004 - 0x0000)
struct ChapterMap_UserWidget_UnlockRegion final
{
public:
	int32                                         NodeId;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChapterMap_UserWidget_UnlockRegion) == 0x000004, "Wrong alignment on ChapterMap_UserWidget_UnlockRegion");
static_assert(sizeof(ChapterMap_UserWidget_UnlockRegion) == 0x000004, "Wrong size on ChapterMap_UserWidget_UnlockRegion");
static_assert(offsetof(ChapterMap_UserWidget_UnlockRegion, NodeId) == 0x000000, "Member 'ChapterMap_UserWidget_UnlockRegion::NodeId' has a wrong offset!");

// Function ChapterMap.ImageFogMask.GenerateTexture
// 0x0018 (0x0018 - 0x0000)
struct ImageFogMask_GenerateTexture final
{
public:
	int32                                         Width;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsReset;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ImageFogMask_GenerateTexture) == 0x000008, "Wrong alignment on ImageFogMask_GenerateTexture");
static_assert(sizeof(ImageFogMask_GenerateTexture) == 0x000018, "Wrong size on ImageFogMask_GenerateTexture");
static_assert(offsetof(ImageFogMask_GenerateTexture, Width) == 0x000000, "Member 'ImageFogMask_GenerateTexture::Width' has a wrong offset!");
static_assert(offsetof(ImageFogMask_GenerateTexture, Height) == 0x000004, "Member 'ImageFogMask_GenerateTexture::Height' has a wrong offset!");
static_assert(offsetof(ImageFogMask_GenerateTexture, IsReset) == 0x000008, "Member 'ImageFogMask_GenerateTexture::IsReset' has a wrong offset!");
static_assert(offsetof(ImageFogMask_GenerateTexture, ReturnValue) == 0x000010, "Member 'ImageFogMask_GenerateTexture::ReturnValue' has a wrong offset!");

// Function ChapterMap.ImageFogMask.SetTexture
// 0x0010 (0x0010 - 0x0000)
struct ImageFogMask_SetTexture final
{
public:
	class UTexture2D*                             InTexture;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ImageFogMask_SetTexture) == 0x000008, "Wrong alignment on ImageFogMask_SetTexture");
static_assert(sizeof(ImageFogMask_SetTexture) == 0x000010, "Wrong size on ImageFogMask_SetTexture");
static_assert(offsetof(ImageFogMask_SetTexture, InTexture) == 0x000000, "Member 'ImageFogMask_SetTexture::InTexture' has a wrong offset!");
static_assert(offsetof(ImageFogMask_SetTexture, ReturnValue) == 0x000008, "Member 'ImageFogMask_SetTexture::ReturnValue' has a wrong offset!");

}

