#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChapterMap

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum ChapterMap.ENodeStyle
// NumValues: 0x0004
enum class ENodeStyle : uint8
{
	Fight                                    = 0,
	Plot                                     = 1,
	Nostyle                                  = 2,
	ENodeStyle_MAX                           = 3,
};

// Enum ChapterMap.ELineType
// NumValues: 0x0003
enum class ELineType : uint8
{
	Straight                                 = 0,
	Bezier                                   = 1,
	ELineType_MAX                            = 2,
};

// Enum ChapterMap.ENodeType
// NumValues: 0x0002
enum class ENodeType : uint8
{
	Normal                                   = 0,
	ENodeType_MAX                            = 1,
};

// ScriptStruct ChapterMap.PointData
// 0x0018 (0x0018 - 0x0000)
struct FPointData final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Pos;                                               // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Direction;                                         // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELineType                                     Righttype;                                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPointData) == 0x000004, "Wrong alignment on FPointData");
static_assert(sizeof(FPointData) == 0x000018, "Wrong size on FPointData");
static_assert(offsetof(FPointData, ID) == 0x000000, "Member 'FPointData::ID' has a wrong offset!");
static_assert(offsetof(FPointData, Pos) == 0x000004, "Member 'FPointData::Pos' has a wrong offset!");
static_assert(offsetof(FPointData, Direction) == 0x00000C, "Member 'FPointData::Direction' has a wrong offset!");
static_assert(offsetof(FPointData, Righttype) == 0x000014, "Member 'FPointData::Righttype' has a wrong offset!");

// ScriptStruct ChapterMap.LineData
// 0x0020 (0x0020 - 0x0000)
struct FLineData final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StartNodeId;                                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EndNodeId;                                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPointData>                     Points;                                            // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLineData) == 0x000008, "Wrong alignment on FLineData");
static_assert(sizeof(FLineData) == 0x000020, "Wrong size on FLineData");
static_assert(offsetof(FLineData, ID) == 0x000000, "Member 'FLineData::ID' has a wrong offset!");
static_assert(offsetof(FLineData, StartNodeId) == 0x000004, "Member 'FLineData::StartNodeId' has a wrong offset!");
static_assert(offsetof(FLineData, EndNodeId) == 0x000008, "Member 'FLineData::EndNodeId' has a wrong offset!");
static_assert(offsetof(FLineData, Points) == 0x000010, "Member 'FLineData::Points' has a wrong offset!");

// ScriptStruct ChapterMap.NodeData
// 0x00C0 (0x00C0 - 0x0000)
struct FNodeData final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENodeType                                     Type;                                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENodeStyle                                    Style;                                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Pos;                                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<int32>                                   FogRegions;                                        // 0x0010(0x0050)(NativeAccessSpecifierPublic)
	TSet<int32>                                   Unlock_set;                                        // 0x0060(0x0050)(NativeAccessSpecifierPublic)
	class FString                                 Level_id;                                          // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNodeData) == 0x000008, "Wrong alignment on FNodeData");
static_assert(sizeof(FNodeData) == 0x0000C0, "Wrong size on FNodeData");
static_assert(offsetof(FNodeData, ID) == 0x000000, "Member 'FNodeData::ID' has a wrong offset!");
static_assert(offsetof(FNodeData, Type) == 0x000004, "Member 'FNodeData::Type' has a wrong offset!");
static_assert(offsetof(FNodeData, Style) == 0x000005, "Member 'FNodeData::Style' has a wrong offset!");
static_assert(offsetof(FNodeData, Pos) == 0x000008, "Member 'FNodeData::Pos' has a wrong offset!");
static_assert(offsetof(FNodeData, FogRegions) == 0x000010, "Member 'FNodeData::FogRegions' has a wrong offset!");
static_assert(offsetof(FNodeData, Unlock_set) == 0x000060, "Member 'FNodeData::Unlock_set' has a wrong offset!");
static_assert(offsetof(FNodeData, Level_id) == 0x0000B0, "Member 'FNodeData::Level_id' has a wrong offset!");

// ScriptStruct ChapterMap.RegionData
// 0x0014 (0x0014 - 0x0000)
struct FRegionData final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              StartPoint;                                        // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              EndPoint;                                          // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRegionData) == 0x000004, "Wrong alignment on FRegionData");
static_assert(sizeof(FRegionData) == 0x000014, "Wrong size on FRegionData");
static_assert(offsetof(FRegionData, ID) == 0x000000, "Member 'FRegionData::ID' has a wrong offset!");
static_assert(offsetof(FRegionData, StartPoint) == 0x000004, "Member 'FRegionData::StartPoint' has a wrong offset!");
static_assert(offsetof(FRegionData, EndPoint) == 0x00000C, "Member 'FRegionData::EndPoint' has a wrong offset!");

}

