#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterInteractionV3

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"
#include "CharacterInteractionV3_structs.hpp"
#include "SeasunAnimGraph_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CameraBlueprint_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "PhysicsControl_classes.hpp"


namespace SDK
{

// Class CharacterInteractionV3.ActorOperateAct
// 0x0118 (0x0140 - 0x0028)
class UActorOperateAct : public UObject
{
public:
	struct FInteractionVoiceConfig                VoiceConfig;                                       // 0x0028(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FInteractionV3OperateWwise             OperateWwiseData;                                  // 0x0070(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FString                                 ActorOperateActName;                               // 0x0080(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimSequence>           FacialAnim;                                        // 0x0090(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              BlendInAndOut;                                     // 0x00B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                           FacialAnimMontage;                                 // 0x00C0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsBlush;                                          // 0x00C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceEyeLookAtCamera;                             // 0x00C9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              EyesLookAtPosition;                                // 0x00CC(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FInteractionV3PhysProfileModifier      ProfileModifier;                                   // 0x00D4(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bPhysicsBlendOut;                                  // 0x0134(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAllPerformerPhysicsBlendOut;                      // 0x0135(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideKawaiiBlendOut;                           // 0x0136(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_137[0x1];                                      // 0x0137(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            OverrideDisableKawaiiBlendCurve;                   // 0x0138(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnPause(class AInteractionSkeletalActorV3* Actor);
	void OnRestart(class AInteractionSkeletalActorV3* Actor);
	void OnResume(class AInteractionSkeletalActorV3* Actor);
	void OnStart(class AInteractionSkeletalActorV3* Actor);
	void OnStartBlendOut(class AInteractionSkeletalActorV3* Actor);
	void OnStop(class AInteractionSkeletalActorV3* Actor);
	void OnUpdate(class UInteractionV3InputControl* InputControl, class AInteractionSkeletalActorV3* Actor, float DeltaSeconds);
	void ProcessStartAct(class AInteractionSkeletalActorV3* Actor);

	class UInteractionV3InputControl* GetInputControl() const;
	class UScenarioOperate* GetScenarioOperate() const;
	bool IsCompleteAndBlendOut() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorOperateAct">();
	}
	static class UActorOperateAct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorOperateAct>();
	}
};
static_assert(alignof(UActorOperateAct) == 0x000008, "Wrong alignment on UActorOperateAct");
static_assert(sizeof(UActorOperateAct) == 0x000140, "Wrong size on UActorOperateAct");
static_assert(offsetof(UActorOperateAct, VoiceConfig) == 0x000028, "Member 'UActorOperateAct::VoiceConfig' has a wrong offset!");
static_assert(offsetof(UActorOperateAct, OperateWwiseData) == 0x000070, "Member 'UActorOperateAct::OperateWwiseData' has a wrong offset!");
static_assert(offsetof(UActorOperateAct, ActorOperateActName) == 0x000080, "Member 'UActorOperateAct::ActorOperateActName' has a wrong offset!");
static_assert(offsetof(UActorOperateAct, FacialAnim) == 0x000090, "Member 'UActorOperateAct::FacialAnim' has a wrong offset!");
static_assert(offsetof(UActorOperateAct, BlendInAndOut) == 0x0000B8, "Member 'UActorOperateAct::BlendInAndOut' has a wrong offset!");
static_assert(offsetof(UActorOperateAct, FacialAnimMontage) == 0x0000C0, "Member 'UActorOperateAct::FacialAnimMontage' has a wrong offset!");
static_assert(offsetof(UActorOperateAct, bIsBlush) == 0x0000C8, "Member 'UActorOperateAct::bIsBlush' has a wrong offset!");
static_assert(offsetof(UActorOperateAct, bForceEyeLookAtCamera) == 0x0000C9, "Member 'UActorOperateAct::bForceEyeLookAtCamera' has a wrong offset!");
static_assert(offsetof(UActorOperateAct, EyesLookAtPosition) == 0x0000CC, "Member 'UActorOperateAct::EyesLookAtPosition' has a wrong offset!");
static_assert(offsetof(UActorOperateAct, ProfileModifier) == 0x0000D4, "Member 'UActorOperateAct::ProfileModifier' has a wrong offset!");
static_assert(offsetof(UActorOperateAct, bPhysicsBlendOut) == 0x000134, "Member 'UActorOperateAct::bPhysicsBlendOut' has a wrong offset!");
static_assert(offsetof(UActorOperateAct, bAllPerformerPhysicsBlendOut) == 0x000135, "Member 'UActorOperateAct::bAllPerformerPhysicsBlendOut' has a wrong offset!");
static_assert(offsetof(UActorOperateAct, bOverrideKawaiiBlendOut) == 0x000136, "Member 'UActorOperateAct::bOverrideKawaiiBlendOut' has a wrong offset!");
static_assert(offsetof(UActorOperateAct, OverrideDisableKawaiiBlendCurve) == 0x000138, "Member 'UActorOperateAct::OverrideDisableKawaiiBlendCurve' has a wrong offset!");

// Class CharacterInteractionV3.BlendSpaceOperateAct
// 0x0030 (0x0170 - 0x0140)
class UBlendSpaceOperateAct final : public UActorOperateAct
{
public:
	TSoftObjectPtr<class UBlendSpace>             BlendSpace;                                        // 0x0140(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInteractionV3BlendSpaceSlot                  SlotType;                                          // 0x0168(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlendSpaceOperateAct">();
	}
	static class UBlendSpaceOperateAct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlendSpaceOperateAct>();
	}
};
static_assert(alignof(UBlendSpaceOperateAct) == 0x000008, "Wrong alignment on UBlendSpaceOperateAct");
static_assert(sizeof(UBlendSpaceOperateAct) == 0x000170, "Wrong size on UBlendSpaceOperateAct");
static_assert(offsetof(UBlendSpaceOperateAct, BlendSpace) == 0x000140, "Member 'UBlendSpaceOperateAct::BlendSpace' has a wrong offset!");
static_assert(offsetof(UBlendSpaceOperateAct, SlotType) == 0x000168, "Member 'UBlendSpaceOperateAct::SlotType' has a wrong offset!");

// Class CharacterInteractionV3.InteractionV3FaceAnimInstance
// 0x0020 (0x02E0 - 0x02C0)
class UInteractionV3FaceAnimInstance final : public UAnimInstance
{
public:
	struct FVector2D                              MouseFollowEyeOffset;                              // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimSequence*                          IdleAnim;                                          // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBlendSpace*                            EyeBlend;                                          // 0x02C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                           LastFrameMontage;                                  // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                           ConfessionMontage;                                 // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UBlendSpace* GetEyeBlend();
	void PlayConfessionAnim(class UAnimSequence* InConfessionAnim, float InBlendInTime, float InBlendOutTime);
	void PlayLastFrameAnim(class UAnimSequence* InLastFrameAnim);
	void SetEyeBlend(class UBlendSpace* NewBlend);
	void SetFaceIdleAnim(class UAnimSequence* InAnimSequence);
	void SetMouseFollowEyeOffset(const struct FVector2D& InMouseFollowEyeOffset);
	void StopConfessionAnim();
	void StopLastFrameAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InteractionV3FaceAnimInstance">();
	}
	static class UInteractionV3FaceAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractionV3FaceAnimInstance>();
	}
};
static_assert(alignof(UInteractionV3FaceAnimInstance) == 0x000010, "Wrong alignment on UInteractionV3FaceAnimInstance");
static_assert(sizeof(UInteractionV3FaceAnimInstance) == 0x0002E0, "Wrong size on UInteractionV3FaceAnimInstance");
static_assert(offsetof(UInteractionV3FaceAnimInstance, MouseFollowEyeOffset) == 0x0002B8, "Member 'UInteractionV3FaceAnimInstance::MouseFollowEyeOffset' has a wrong offset!");
static_assert(offsetof(UInteractionV3FaceAnimInstance, IdleAnim) == 0x0002C0, "Member 'UInteractionV3FaceAnimInstance::IdleAnim' has a wrong offset!");
static_assert(offsetof(UInteractionV3FaceAnimInstance, EyeBlend) == 0x0002C8, "Member 'UInteractionV3FaceAnimInstance::EyeBlend' has a wrong offset!");
static_assert(offsetof(UInteractionV3FaceAnimInstance, LastFrameMontage) == 0x0002D0, "Member 'UInteractionV3FaceAnimInstance::LastFrameMontage' has a wrong offset!");
static_assert(offsetof(UInteractionV3FaceAnimInstance, ConfessionMontage) == 0x0002D8, "Member 'UInteractionV3FaceAnimInstance::ConfessionMontage' has a wrong offset!");

// Class CharacterInteractionV3.SequenceEvaluatorOperateAct
// 0x0078 (0x01B8 - 0x0140)
class USequenceEvaluatorOperateAct final : public UActorOperateAct
{
public:
	TSoftObjectPtr<class UAnimSequence>           InteractionAnim;                                   // 0x0140(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimSequence>           BreathAdditiveAnim;                                // 0x0168(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bControlFacialAnim;                                // 0x0190(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           InteractionMontage;                                // 0x0198(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                           BreathAdditiveMontage;                             // 0x01A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FAnimNotifyEvent>               ActiveFacialAnimNotifyState;                       // 0x01A8(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SequenceEvaluatorOperateAct">();
	}
	static class USequenceEvaluatorOperateAct* GetDefaultObj()
	{
		return GetDefaultObjImpl<USequenceEvaluatorOperateAct>();
	}
};
static_assert(alignof(USequenceEvaluatorOperateAct) == 0x000008, "Wrong alignment on USequenceEvaluatorOperateAct");
static_assert(sizeof(USequenceEvaluatorOperateAct) == 0x0001B8, "Wrong size on USequenceEvaluatorOperateAct");
static_assert(offsetof(USequenceEvaluatorOperateAct, InteractionAnim) == 0x000140, "Member 'USequenceEvaluatorOperateAct::InteractionAnim' has a wrong offset!");
static_assert(offsetof(USequenceEvaluatorOperateAct, BreathAdditiveAnim) == 0x000168, "Member 'USequenceEvaluatorOperateAct::BreathAdditiveAnim' has a wrong offset!");
static_assert(offsetof(USequenceEvaluatorOperateAct, bControlFacialAnim) == 0x000190, "Member 'USequenceEvaluatorOperateAct::bControlFacialAnim' has a wrong offset!");
static_assert(offsetof(USequenceEvaluatorOperateAct, InteractionMontage) == 0x000198, "Member 'USequenceEvaluatorOperateAct::InteractionMontage' has a wrong offset!");
static_assert(offsetof(USequenceEvaluatorOperateAct, BreathAdditiveMontage) == 0x0001A0, "Member 'USequenceEvaluatorOperateAct::BreathAdditiveMontage' has a wrong offset!");
static_assert(offsetof(USequenceEvaluatorOperateAct, ActiveFacialAnimNotifyState) == 0x0001A8, "Member 'USequenceEvaluatorOperateAct::ActiveFacialAnimNotifyState' has a wrong offset!");

// Class CharacterInteractionV3.LoopSequenceOperateAct
// 0x0038 (0x0178 - 0x0140)
class ULoopSequenceOperateAct final : public UActorOperateAct
{
public:
	TSoftObjectPtr<class UAnimSequence>           InteractionAnim;                                   // 0x0140(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartLoopTime;                                     // 0x0168(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndLoopTime;                                       // 0x016C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           InteractionMontage;                                // 0x0170(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LoopSequenceOperateAct">();
	}
	static class ULoopSequenceOperateAct* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoopSequenceOperateAct>();
	}
};
static_assert(alignof(ULoopSequenceOperateAct) == 0x000008, "Wrong alignment on ULoopSequenceOperateAct");
static_assert(sizeof(ULoopSequenceOperateAct) == 0x000178, "Wrong size on ULoopSequenceOperateAct");
static_assert(offsetof(ULoopSequenceOperateAct, InteractionAnim) == 0x000140, "Member 'ULoopSequenceOperateAct::InteractionAnim' has a wrong offset!");
static_assert(offsetof(ULoopSequenceOperateAct, StartLoopTime) == 0x000168, "Member 'ULoopSequenceOperateAct::StartLoopTime' has a wrong offset!");
static_assert(offsetof(ULoopSequenceOperateAct, EndLoopTime) == 0x00016C, "Member 'ULoopSequenceOperateAct::EndLoopTime' has a wrong offset!");
static_assert(offsetof(ULoopSequenceOperateAct, InteractionMontage) == 0x000170, "Member 'ULoopSequenceOperateAct::InteractionMontage' has a wrong offset!");

// Class CharacterInteractionV3.InteractionV3Event
// 0x0000 (0x0028 - 0x0028)
class UInteractionV3Event : public UObject
{
public:
	void DoAction();

	bool CanTrigger() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InteractionV3Event">();
	}
	static class UInteractionV3Event* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractionV3Event>();
	}
};
static_assert(alignof(UInteractionV3Event) == 0x000008, "Wrong alignment on UInteractionV3Event");
static_assert(sizeof(UInteractionV3Event) == 0x000028, "Wrong size on UInteractionV3Event");

// Class CharacterInteractionV3.OperateStandardCompelteEvent
// 0x0028 (0x0050 - 0x0028)
class UOperateStandardCompelteEvent final : public UInteractionV3Event
{
public:
	bool                                          bForceCameraBlend;                                 // 0x0028(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ShowElementName;                                   // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EndState;                                          // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OperateStandardCompelteEvent">();
	}
	static class UOperateStandardCompelteEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOperateStandardCompelteEvent>();
	}
};
static_assert(alignof(UOperateStandardCompelteEvent) == 0x000008, "Wrong alignment on UOperateStandardCompelteEvent");
static_assert(sizeof(UOperateStandardCompelteEvent) == 0x000050, "Wrong size on UOperateStandardCompelteEvent");
static_assert(offsetof(UOperateStandardCompelteEvent, bForceCameraBlend) == 0x000028, "Member 'UOperateStandardCompelteEvent::bForceCameraBlend' has a wrong offset!");
static_assert(offsetof(UOperateStandardCompelteEvent, ShowElementName) == 0x000030, "Member 'UOperateStandardCompelteEvent::ShowElementName' has a wrong offset!");
static_assert(offsetof(UOperateStandardCompelteEvent, EndState) == 0x000040, "Member 'UOperateStandardCompelteEvent::EndState' has a wrong offset!");

// Class CharacterInteractionV3.IKRefPoseFixOperateAct
// 0x0020 (0x0160 - 0x0140)
class UIKRefPoseFixOperateAct : public UActorOperateAct
{
public:
	struct FIKRefPoseFixData                      RefPoseFixData;                                    // 0x0140(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IKRefPoseFixOperateAct">();
	}
	static class UIKRefPoseFixOperateAct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRefPoseFixOperateAct>();
	}
};
static_assert(alignof(UIKRefPoseFixOperateAct) == 0x000008, "Wrong alignment on UIKRefPoseFixOperateAct");
static_assert(sizeof(UIKRefPoseFixOperateAct) == 0x000160, "Wrong size on UIKRefPoseFixOperateAct");
static_assert(offsetof(UIKRefPoseFixOperateAct, RefPoseFixData) == 0x000140, "Member 'UIKRefPoseFixOperateAct::RefPoseFixData' has a wrong offset!");

// Class CharacterInteractionV3.HeadModifyOperateAct
// 0x0058 (0x01B8 - 0x0160)
class UHeadModifyOperateAct final : public UIKRefPoseFixOperateAct
{
public:
	bool                                          UseYawChange;                                      // 0x0160(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeSpineWeight                    RuntimeSpineDatas;                                 // 0x0168(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HeadModifyOperateAct">();
	}
	static class UHeadModifyOperateAct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHeadModifyOperateAct>();
	}
};
static_assert(alignof(UHeadModifyOperateAct) == 0x000008, "Wrong alignment on UHeadModifyOperateAct");
static_assert(sizeof(UHeadModifyOperateAct) == 0x0001B8, "Wrong size on UHeadModifyOperateAct");
static_assert(offsetof(UHeadModifyOperateAct, UseYawChange) == 0x000160, "Member 'UHeadModifyOperateAct::UseYawChange' has a wrong offset!");
static_assert(offsetof(UHeadModifyOperateAct, RuntimeSpineDatas) == 0x000168, "Member 'UHeadModifyOperateAct::RuntimeSpineDatas' has a wrong offset!");

// Class CharacterInteractionV3.IKMaintainWorldSpaceRelativeOperateAct
// 0x0010 (0x0170 - 0x0160)
class UIKMaintainWorldSpaceRelativeOperateAct final : public UIKRefPoseFixOperateAct
{
public:
	struct FIKMaintainWorldSpaceRelativeData      MaintainRelativeData;                              // 0x0160(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IKMaintainWorldSpaceRelativeOperateAct">();
	}
	static class UIKMaintainWorldSpaceRelativeOperateAct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKMaintainWorldSpaceRelativeOperateAct>();
	}
};
static_assert(alignof(UIKMaintainWorldSpaceRelativeOperateAct) == 0x000008, "Wrong alignment on UIKMaintainWorldSpaceRelativeOperateAct");
static_assert(sizeof(UIKMaintainWorldSpaceRelativeOperateAct) == 0x000170, "Wrong size on UIKMaintainWorldSpaceRelativeOperateAct");
static_assert(offsetof(UIKMaintainWorldSpaceRelativeOperateAct, MaintainRelativeData) == 0x000160, "Member 'UIKMaintainWorldSpaceRelativeOperateAct::MaintainRelativeData' has a wrong offset!");

// Class CharacterInteractionV3.IKWorldSpaceOffsetOperateAct
// 0x0020 (0x0180 - 0x0160)
class UIKWorldSpaceOffsetOperateAct final : public UIKRefPoseFixOperateAct
{
public:
	struct FIKWorldSpaceOffsetData                WorldSpaceOffsetData;                              // 0x0160(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IKWorldSpaceOffsetOperateAct">();
	}
	static class UIKWorldSpaceOffsetOperateAct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKWorldSpaceOffsetOperateAct>();
	}
};
static_assert(alignof(UIKWorldSpaceOffsetOperateAct) == 0x000008, "Wrong alignment on UIKWorldSpaceOffsetOperateAct");
static_assert(sizeof(UIKWorldSpaceOffsetOperateAct) == 0x000180, "Wrong size on UIKWorldSpaceOffsetOperateAct");
static_assert(offsetof(UIKWorldSpaceOffsetOperateAct, WorldSpaceOffsetData) == 0x000160, "Member 'UIKWorldSpaceOffsetOperateAct::WorldSpaceOffsetData' has a wrong offset!");

// Class CharacterInteractionV3.CreateMaintainWorldSpaceRelativeControlEvent
// 0x0038 (0x0060 - 0x0028)
class UCreateMaintainWorldSpaceRelativeControlEvent final : public UInteractionV3Event
{
public:
	class FName                                   ControlName;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SetName;                                           // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParentActorName;                                   // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParentBoneName;                                    // 0x0040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ChildActorName;                                    // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ChildBoneName;                                     // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsChildAnimNode;                                  // 0x0058(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreateMaintainWorldSpaceRelativeControlEvent">();
	}
	static class UCreateMaintainWorldSpaceRelativeControlEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreateMaintainWorldSpaceRelativeControlEvent>();
	}
};
static_assert(alignof(UCreateMaintainWorldSpaceRelativeControlEvent) == 0x000008, "Wrong alignment on UCreateMaintainWorldSpaceRelativeControlEvent");
static_assert(sizeof(UCreateMaintainWorldSpaceRelativeControlEvent) == 0x000060, "Wrong size on UCreateMaintainWorldSpaceRelativeControlEvent");
static_assert(offsetof(UCreateMaintainWorldSpaceRelativeControlEvent, ControlName) == 0x000028, "Member 'UCreateMaintainWorldSpaceRelativeControlEvent::ControlName' has a wrong offset!");
static_assert(offsetof(UCreateMaintainWorldSpaceRelativeControlEvent, SetName) == 0x000030, "Member 'UCreateMaintainWorldSpaceRelativeControlEvent::SetName' has a wrong offset!");
static_assert(offsetof(UCreateMaintainWorldSpaceRelativeControlEvent, ParentActorName) == 0x000038, "Member 'UCreateMaintainWorldSpaceRelativeControlEvent::ParentActorName' has a wrong offset!");
static_assert(offsetof(UCreateMaintainWorldSpaceRelativeControlEvent, ParentBoneName) == 0x000040, "Member 'UCreateMaintainWorldSpaceRelativeControlEvent::ParentBoneName' has a wrong offset!");
static_assert(offsetof(UCreateMaintainWorldSpaceRelativeControlEvent, ChildActorName) == 0x000048, "Member 'UCreateMaintainWorldSpaceRelativeControlEvent::ChildActorName' has a wrong offset!");
static_assert(offsetof(UCreateMaintainWorldSpaceRelativeControlEvent, ChildBoneName) == 0x000050, "Member 'UCreateMaintainWorldSpaceRelativeControlEvent::ChildBoneName' has a wrong offset!");
static_assert(offsetof(UCreateMaintainWorldSpaceRelativeControlEvent, bIsChildAnimNode) == 0x000058, "Member 'UCreateMaintainWorldSpaceRelativeControlEvent::bIsChildAnimNode' has a wrong offset!");

// Class CharacterInteractionV3.EyesFollowOperateAct
// 0x0010 (0x0150 - 0x0140)
class UEyesFollowOperateAct final : public UActorOperateAct
{
public:
	struct FVector2D                              HeadRotationScale;                                 // 0x0140(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInterpHead;                                       // 0x0148(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HeadInterpSpeed;                                   // 0x014C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EyesFollowOperateAct">();
	}
	static class UEyesFollowOperateAct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEyesFollowOperateAct>();
	}
};
static_assert(alignof(UEyesFollowOperateAct) == 0x000008, "Wrong alignment on UEyesFollowOperateAct");
static_assert(sizeof(UEyesFollowOperateAct) == 0x000150, "Wrong size on UEyesFollowOperateAct");
static_assert(offsetof(UEyesFollowOperateAct, HeadRotationScale) == 0x000140, "Member 'UEyesFollowOperateAct::HeadRotationScale' has a wrong offset!");
static_assert(offsetof(UEyesFollowOperateAct, bInterpHead) == 0x000148, "Member 'UEyesFollowOperateAct::bInterpHead' has a wrong offset!");
static_assert(offsetof(UEyesFollowOperateAct, HeadInterpSpeed) == 0x00014C, "Member 'UEyesFollowOperateAct::HeadInterpSpeed' has a wrong offset!");

// Class CharacterInteractionV3.PhysicalOffsetOperateAct
// 0x0048 (0x0188 - 0x0140)
class UPhysicalOffsetOperateAct final : public UActorOperateAct
{
public:
	bool                                          bDragFixedBone;                                    // 0x0140(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DefaultDragBoneName;                               // 0x0144(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   DefaultDragLocationBoneName;                       // 0x014C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                DragScale;                                         // 0x0154(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                DragStartLocation;                                 // 0x0160(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   CurDragBone;                                       // 0x016C(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseAnimNodePhysicsControl;                        // 0x0174(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LinearStiffness;                                   // 0x0178(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LinearDamping;                                     // 0x017C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AngularStiffness;                                  // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AngularDamping;                                    // 0x0184(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicalOffsetOperateAct">();
	}
	static class UPhysicalOffsetOperateAct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicalOffsetOperateAct>();
	}
};
static_assert(alignof(UPhysicalOffsetOperateAct) == 0x000008, "Wrong alignment on UPhysicalOffsetOperateAct");
static_assert(sizeof(UPhysicalOffsetOperateAct) == 0x000188, "Wrong size on UPhysicalOffsetOperateAct");
static_assert(offsetof(UPhysicalOffsetOperateAct, bDragFixedBone) == 0x000140, "Member 'UPhysicalOffsetOperateAct::bDragFixedBone' has a wrong offset!");
static_assert(offsetof(UPhysicalOffsetOperateAct, DefaultDragBoneName) == 0x000144, "Member 'UPhysicalOffsetOperateAct::DefaultDragBoneName' has a wrong offset!");
static_assert(offsetof(UPhysicalOffsetOperateAct, DefaultDragLocationBoneName) == 0x00014C, "Member 'UPhysicalOffsetOperateAct::DefaultDragLocationBoneName' has a wrong offset!");
static_assert(offsetof(UPhysicalOffsetOperateAct, DragScale) == 0x000154, "Member 'UPhysicalOffsetOperateAct::DragScale' has a wrong offset!");
static_assert(offsetof(UPhysicalOffsetOperateAct, DragStartLocation) == 0x000160, "Member 'UPhysicalOffsetOperateAct::DragStartLocation' has a wrong offset!");
static_assert(offsetof(UPhysicalOffsetOperateAct, CurDragBone) == 0x00016C, "Member 'UPhysicalOffsetOperateAct::CurDragBone' has a wrong offset!");
static_assert(offsetof(UPhysicalOffsetOperateAct, bUseAnimNodePhysicsControl) == 0x000174, "Member 'UPhysicalOffsetOperateAct::bUseAnimNodePhysicsControl' has a wrong offset!");
static_assert(offsetof(UPhysicalOffsetOperateAct, LinearStiffness) == 0x000178, "Member 'UPhysicalOffsetOperateAct::LinearStiffness' has a wrong offset!");
static_assert(offsetof(UPhysicalOffsetOperateAct, LinearDamping) == 0x00017C, "Member 'UPhysicalOffsetOperateAct::LinearDamping' has a wrong offset!");
static_assert(offsetof(UPhysicalOffsetOperateAct, AngularStiffness) == 0x000180, "Member 'UPhysicalOffsetOperateAct::AngularStiffness' has a wrong offset!");
static_assert(offsetof(UPhysicalOffsetOperateAct, AngularDamping) == 0x000184, "Member 'UPhysicalOffsetOperateAct::AngularDamping' has a wrong offset!");

// Class CharacterInteractionV3.InteractionMouseHoverInterface
// 0x0000 (0x0028 - 0x0028)
class IInteractionMouseHoverInterface final : public IInterface
{
public:
	void OnMouseHover(const TArray<class FName>& BoneNames, const class UCurveFloat* CurveScale, const struct FVector2D& SlideVector, const struct FVector2D& SlideStartPos, const struct FVector2D& SlidEndPos);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InteractionMouseHoverInterface">();
	}
	static class IInteractionMouseHoverInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IInteractionMouseHoverInterface>();
	}
};
static_assert(alignof(IInteractionMouseHoverInterface) == 0x000008, "Wrong alignment on IInteractionMouseHoverInterface");
static_assert(sizeof(IInteractionMouseHoverInterface) == 0x000028, "Wrong size on IInteractionMouseHoverInterface");

// Class CharacterInteractionV3.InteractionCameraInstanceBase
// 0x0020 (0x03C0 - 0x03A0)
#pragma pack(push, 0x1)
class alignas(0x10) UInteractionCameraInstanceBase : public UCameraInstance
{
public:
	bool                                          bActiveBlendOut;                                   // 0x03A0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceBlendOut;                                    // 0x03A1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLockBlendOutChange;                               // 0x03A2(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A3[0x1];                                      // 0x03A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParams            CameraTransitionParams;                            // 0x03A4(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InteractionCameraInstanceBase">();
	}
	static class UInteractionCameraInstanceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractionCameraInstanceBase>();
	}
};
#pragma pack(pop)
static_assert(alignof(UInteractionCameraInstanceBase) == 0x000010, "Wrong alignment on UInteractionCameraInstanceBase");
static_assert(sizeof(UInteractionCameraInstanceBase) == 0x0003C0, "Wrong size on UInteractionCameraInstanceBase");
static_assert(offsetof(UInteractionCameraInstanceBase, bActiveBlendOut) == 0x0003A0, "Member 'UInteractionCameraInstanceBase::bActiveBlendOut' has a wrong offset!");
static_assert(offsetof(UInteractionCameraInstanceBase, bForceBlendOut) == 0x0003A1, "Member 'UInteractionCameraInstanceBase::bForceBlendOut' has a wrong offset!");
static_assert(offsetof(UInteractionCameraInstanceBase, bLockBlendOutChange) == 0x0003A2, "Member 'UInteractionCameraInstanceBase::bLockBlendOutChange' has a wrong offset!");
static_assert(offsetof(UInteractionCameraInstanceBase, CameraTransitionParams) == 0x0003A4, "Member 'UInteractionCameraInstanceBase::CameraTransitionParams' has a wrong offset!");

// Class CharacterInteractionV3.InteractionCameraInstance
// 0x02C0 (0x0680 - 0x03C0)
class UInteractionCameraInstance final : public UInteractionCameraInstanceBase
{
public:
	int32                                         MaxInputSubStep;                                   // 0x03B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxSubStepInputDist;                               // 0x03BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FStandbyCameraConfig                   StandbyCameraConfig;                               // 0x03C0(0x00F0)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FInteractionCameraModifierInfo         StandbyModifierInfo;                               // 0x04B0(0x0028)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4D8[0x40];                                     // 0x04D8(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStandbyCameraConfig                   OperateCameraConfig;                               // 0x0518(0x00F0)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FInteractionCameraModifierInfo         OperateModifierInfo;                               // 0x0608(0x0028)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_630[0x44];                                     // 0x0630(0x0044)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAllowCameraMove;                                  // 0x0674(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsOperateCamera;                                  // 0x0675(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_676[0xA];                                      // 0x0676(0x000A)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddInput(const struct FVector2D& Value);
	void SetOperateConfig(class FName ID);
	void SetStandbyConfig(class FName ID);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InteractionCameraInstance">();
	}
	static class UInteractionCameraInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractionCameraInstance>();
	}
};
static_assert(alignof(UInteractionCameraInstance) == 0x000010, "Wrong alignment on UInteractionCameraInstance");
static_assert(sizeof(UInteractionCameraInstance) == 0x000680, "Wrong size on UInteractionCameraInstance");
static_assert(offsetof(UInteractionCameraInstance, MaxInputSubStep) == 0x0003B8, "Member 'UInteractionCameraInstance::MaxInputSubStep' has a wrong offset!");
static_assert(offsetof(UInteractionCameraInstance, MaxSubStepInputDist) == 0x0003BC, "Member 'UInteractionCameraInstance::MaxSubStepInputDist' has a wrong offset!");
static_assert(offsetof(UInteractionCameraInstance, StandbyCameraConfig) == 0x0003C0, "Member 'UInteractionCameraInstance::StandbyCameraConfig' has a wrong offset!");
static_assert(offsetof(UInteractionCameraInstance, StandbyModifierInfo) == 0x0004B0, "Member 'UInteractionCameraInstance::StandbyModifierInfo' has a wrong offset!");
static_assert(offsetof(UInteractionCameraInstance, OperateCameraConfig) == 0x000518, "Member 'UInteractionCameraInstance::OperateCameraConfig' has a wrong offset!");
static_assert(offsetof(UInteractionCameraInstance, OperateModifierInfo) == 0x000608, "Member 'UInteractionCameraInstance::OperateModifierInfo' has a wrong offset!");
static_assert(offsetof(UInteractionCameraInstance, bAllowCameraMove) == 0x000674, "Member 'UInteractionCameraInstance::bAllowCameraMove' has a wrong offset!");
static_assert(offsetof(UInteractionCameraInstance, bIsOperateCamera) == 0x000675, "Member 'UInteractionCameraInstance::bIsOperateCamera' has a wrong offset!");

// Class CharacterInteractionV3.MouseHoverOperateAct
// 0x0020 (0x0160 - 0x0140)
class UMouseHoverOperateAct final : public UActorOperateAct
{
public:
	TArray<class FName>                           BoneNames;                                         // 0x0140(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UCurveFloat*                            CurveTorqueScale;                                  // 0x0150(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SampleInterval;                                    // 0x0158(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MouseHoverOperateAct">();
	}
	static class UMouseHoverOperateAct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMouseHoverOperateAct>();
	}
};
static_assert(alignof(UMouseHoverOperateAct) == 0x000008, "Wrong alignment on UMouseHoverOperateAct");
static_assert(sizeof(UMouseHoverOperateAct) == 0x000160, "Wrong size on UMouseHoverOperateAct");
static_assert(offsetof(UMouseHoverOperateAct, BoneNames) == 0x000140, "Member 'UMouseHoverOperateAct::BoneNames' has a wrong offset!");
static_assert(offsetof(UMouseHoverOperateAct, CurveTorqueScale) == 0x000150, "Member 'UMouseHoverOperateAct::CurveTorqueScale' has a wrong offset!");
static_assert(offsetof(UMouseHoverOperateAct, SampleInterval) == 0x000158, "Member 'UMouseHoverOperateAct::SampleInterval' has a wrong offset!");

// Class CharacterInteractionV3.InteractionV3DragInterface
// 0x0000 (0x0028 - 0x0028)
class IInteractionV3DragInterface final : public IInterface
{
public:
	void EndDrag(const struct FTransform& TargetTransform, const struct FVector& DeltaLocation);
	void StartDrag(const struct FTransform& TargetTransform, const struct FVector& DeltaLocation);
	void UpdateDrag(const struct FTransform& TargetTransform, const struct FVector& DeltaLocation);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InteractionV3DragInterface">();
	}
	static class IInteractionV3DragInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IInteractionV3DragInterface>();
	}
};
static_assert(alignof(IInteractionV3DragInterface) == 0x000008, "Wrong alignment on IInteractionV3DragInterface");
static_assert(sizeof(IInteractionV3DragInterface) == 0x000028, "Wrong size on IInteractionV3DragInterface");

// Class CharacterInteractionV3.ScenarioLittleGameBase
// 0x0008 (0x0030 - 0x0028)
class UScenarioLittleGameBase : public UObject
{
public:
	bool                                          bInitialize;                                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Exit();
	void Initialize();
	void OnExit();
	void OnInitialize();
	void OnStart();
	void OnUpdate(float DeltaSeconds);
	void Start();
	void Update(float DeltaSeconds);

	class UInteractionInputComponent* GetInteractionInputComponent() const;
	class UScenarioStateNode_LittleGame* GetStateNode() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ScenarioLittleGameBase">();
	}
	static class UScenarioLittleGameBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScenarioLittleGameBase>();
	}
};
static_assert(alignof(UScenarioLittleGameBase) == 0x000008, "Wrong alignment on UScenarioLittleGameBase");
static_assert(sizeof(UScenarioLittleGameBase) == 0x000030, "Wrong size on UScenarioLittleGameBase");
static_assert(offsetof(UScenarioLittleGameBase, bInitialize) == 0x000028, "Member 'UScenarioLittleGameBase::bInitialize' has a wrong offset!");

// Class CharacterInteractionV3.ScenarioStandardLittleGame
// 0x0038 (0x0068 - 0x0030)
class UScenarioStandardLittleGame : public UScenarioLittleGameBase
{
public:
	TSoftClassPtr<class UClass>                   LittleGameWidget;                                  // 0x0030(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EScenarioLittleGameUIState                    UIState;                                           // 0x0058(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AUniversalCameraActor*                  UniversalCharacter;                                // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void GameInput(const struct FLittleGameInputEvent& InputEvent);
	void MouseClick(const struct FLittleGameInputEvent& InputEvent);
	void MousePress(const struct FLittleGameInputEvent& InputEvent);
	void MouseRelease(const struct FLittleGameInputEvent& InputEvent);
	void OnGameInput(const struct FLittleGameInputEvent& InputEvent);
	void OnInitCameraSequenceFinished();
	void OnLookAround(float InValue);
	void OnLookUp(float InValue);
	void OnMouseClick(const struct FLittleGameInputEvent& InputEvent);
	void OnMousePress(const struct FLittleGameInputEvent& InputEvent);
	void OnMouseRelease(const struct FLittleGameInputEvent& InputEvent);
	void OnMoveForward(float InValue);
	void OnMoveRight(float InValue);
	void PlayShowElement(const class FString& ElementName, const class FString& NextState, bool bEndLastShowElement);
	void PlayShowElementList(const TArray<class FString>& InElements, const class FString& NextState, bool bEndLastShowElement);
	void SetUIState(EScenarioLittleGameUIState NewState);

	void DisableInput() const;
	void EnableInput() const;
	struct FSoftClassPath GetCustomGameUI() const;
	struct FVector2D GetMousePos() const;
	EScenarioLittleGameUIState GetUIState() const;
	bool IsBlockInput() const;
	bool IsCustomGameUI() const;
	int32 ListenForInputAction(class FName ActionName, EInputEvent EventType, bool bConsume, TDelegate<void()> Callback) const;
	void ListenForKeyAction(const struct FKey& InKey, EInputEvent EventType, bool bConsume, TDelegate<void()> Callback) const;
	void PlayShowElementByCallback(const class FString& ElementName, const class FString& NextState, TDelegate<void()> ShowElementPlayFinish, bool bEndLastShowElement) const;
	void PlayShowElementListByCallback(const TArray<class FString>& InElements, const class FString& NextState, TDelegate<void()> ShowElementPlayFinish, bool bEndLastShowElement) const;
	void SetInputModeGameAndUI(EMouseLockMode MouseLockMode) const;
	void SetInputModeGameOnly() const;
	void SetInputModeUIOnly() const;
	void StopAllListenForKeyAction() const;
	void StopAllListeningForHandle() const;
	void StopListenForKeyAction(const struct FKey& InKey, EInputEvent EventType) const;
	void StopListeningForHandle(int32 InHandle) const;
	void StopListeningForInputAction(class FName ActionName, EInputEvent EventType) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ScenarioStandardLittleGame">();
	}
	static class UScenarioStandardLittleGame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScenarioStandardLittleGame>();
	}
};
static_assert(alignof(UScenarioStandardLittleGame) == 0x000008, "Wrong alignment on UScenarioStandardLittleGame");
static_assert(sizeof(UScenarioStandardLittleGame) == 0x000068, "Wrong size on UScenarioStandardLittleGame");
static_assert(offsetof(UScenarioStandardLittleGame, LittleGameWidget) == 0x000030, "Member 'UScenarioStandardLittleGame::LittleGameWidget' has a wrong offset!");
static_assert(offsetof(UScenarioStandardLittleGame, UIState) == 0x000058, "Member 'UScenarioStandardLittleGame::UIState' has a wrong offset!");
static_assert(offsetof(UScenarioStandardLittleGame, UniversalCharacter) == 0x000060, "Member 'UScenarioStandardLittleGame::UniversalCharacter' has a wrong offset!");

// Class CharacterInteractionV3.FennyShowerLittleGame
// 0x0010 (0x0078 - 0x0068)
class UFennyShowerLittleGame final : public UScenarioStandardLittleGame
{
public:
	TArray<struct FFennyShowerStandbyCfg>         StandbyCfgs;                                       // 0x0068(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	void GetCameraAdditivePitchAndYaw(float* OutPitch, float* OutYaw) const;
	bool GetCanActiveCamera() const;
	void PlayStandBy(const int32 Idx) const;
	void SetCanActiveCamera(const bool bCan) const;
	void SetStandByInfo(const int32 Idx) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FennyShowerLittleGame">();
	}
	static class UFennyShowerLittleGame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFennyShowerLittleGame>();
	}
};
static_assert(alignof(UFennyShowerLittleGame) == 0x000008, "Wrong alignment on UFennyShowerLittleGame");
static_assert(sizeof(UFennyShowerLittleGame) == 0x000078, "Wrong size on UFennyShowerLittleGame");
static_assert(offsetof(UFennyShowerLittleGame, StandbyCfgs) == 0x000068, "Member 'UFennyShowerLittleGame::StandbyCfgs' has a wrong offset!");

// Class CharacterInteractionV3.DragPropWorldSpaceOffsetOperateAct
// 0x0070 (0x01B0 - 0x0140)
class UDragPropWorldSpaceOffsetOperateAct final : public UActorOperateAct
{
public:
	bool                                          bSpringInterp;                                     // 0x0140(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ErrorTolerance;                                    // 0x0144(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Stiffness;                                         // 0x0148(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CriticalDamping;                                   // 0x014C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DragSocketName;                                    // 0x0150(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DragLocation;                                      // 0x0158(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                DeltaLocation;                                     // 0x0164(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                TargetLocation;                                    // 0x0170(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                PreTargetLocation;                                 // 0x017C(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                InterpTarget;                                      // 0x0188(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DragDistance;                                      // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVectorSpringState                     SpringState;                                       // 0x0198(0x0018)(NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DragPropWorldSpaceOffsetOperateAct">();
	}
	static class UDragPropWorldSpaceOffsetOperateAct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDragPropWorldSpaceOffsetOperateAct>();
	}
};
static_assert(alignof(UDragPropWorldSpaceOffsetOperateAct) == 0x000008, "Wrong alignment on UDragPropWorldSpaceOffsetOperateAct");
static_assert(sizeof(UDragPropWorldSpaceOffsetOperateAct) == 0x0001B0, "Wrong size on UDragPropWorldSpaceOffsetOperateAct");
static_assert(offsetof(UDragPropWorldSpaceOffsetOperateAct, bSpringInterp) == 0x000140, "Member 'UDragPropWorldSpaceOffsetOperateAct::bSpringInterp' has a wrong offset!");
static_assert(offsetof(UDragPropWorldSpaceOffsetOperateAct, ErrorTolerance) == 0x000144, "Member 'UDragPropWorldSpaceOffsetOperateAct::ErrorTolerance' has a wrong offset!");
static_assert(offsetof(UDragPropWorldSpaceOffsetOperateAct, Stiffness) == 0x000148, "Member 'UDragPropWorldSpaceOffsetOperateAct::Stiffness' has a wrong offset!");
static_assert(offsetof(UDragPropWorldSpaceOffsetOperateAct, CriticalDamping) == 0x00014C, "Member 'UDragPropWorldSpaceOffsetOperateAct::CriticalDamping' has a wrong offset!");
static_assert(offsetof(UDragPropWorldSpaceOffsetOperateAct, DragSocketName) == 0x000150, "Member 'UDragPropWorldSpaceOffsetOperateAct::DragSocketName' has a wrong offset!");
static_assert(offsetof(UDragPropWorldSpaceOffsetOperateAct, DragLocation) == 0x000158, "Member 'UDragPropWorldSpaceOffsetOperateAct::DragLocation' has a wrong offset!");
static_assert(offsetof(UDragPropWorldSpaceOffsetOperateAct, DeltaLocation) == 0x000164, "Member 'UDragPropWorldSpaceOffsetOperateAct::DeltaLocation' has a wrong offset!");
static_assert(offsetof(UDragPropWorldSpaceOffsetOperateAct, TargetLocation) == 0x000170, "Member 'UDragPropWorldSpaceOffsetOperateAct::TargetLocation' has a wrong offset!");
static_assert(offsetof(UDragPropWorldSpaceOffsetOperateAct, PreTargetLocation) == 0x00017C, "Member 'UDragPropWorldSpaceOffsetOperateAct::PreTargetLocation' has a wrong offset!");
static_assert(offsetof(UDragPropWorldSpaceOffsetOperateAct, InterpTarget) == 0x000188, "Member 'UDragPropWorldSpaceOffsetOperateAct::InterpTarget' has a wrong offset!");
static_assert(offsetof(UDragPropWorldSpaceOffsetOperateAct, DragDistance) == 0x000194, "Member 'UDragPropWorldSpaceOffsetOperateAct::DragDistance' has a wrong offset!");
static_assert(offsetof(UDragPropWorldSpaceOffsetOperateAct, SpringState) == 0x000198, "Member 'UDragPropWorldSpaceOffsetOperateAct::SpringState' has a wrong offset!");

// Class CharacterInteractionV3.AnimNotifyState_SubtitleStatus
// 0x0010 (0x0040 - 0x0030)
class UAnimNotifyState_SubtitleStatus final : public UAnimNotifyState
{
public:
	class FString                                 SubtitleKey;                                       // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_SubtitleStatus">();
	}
	static class UAnimNotifyState_SubtitleStatus* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_SubtitleStatus>();
	}
};
static_assert(alignof(UAnimNotifyState_SubtitleStatus) == 0x000008, "Wrong alignment on UAnimNotifyState_SubtitleStatus");
static_assert(sizeof(UAnimNotifyState_SubtitleStatus) == 0x000040, "Wrong size on UAnimNotifyState_SubtitleStatus");
