#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterInteraction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "PhysicsControl_structs.hpp"


namespace SDK
{

// Enum CharacterInteraction.ELittleGameInputType
// NumValues: 0x0005
enum class ELittleGameInputType : uint8
{
	LittleGameInputInvalid                   = 0,
	GameClick                                = 1,
	GameDrag                                 = 16,
	GameClickAndDrag                         = 17,
	ELittleGameInputType_MAX                 = 18,
};

// Enum CharacterInteraction.EInteractionAchivementType
// NumValues: 0x0004
enum class EInteractionAchivementType : uint8
{
	Any                                      = 0,
	All                                      = 1,
	Order                                    = 2,
	EInteractionAchivementType_MAX           = 3,
};

// Enum CharacterInteraction.ELittleGameType
// NumValues: 0x0004
enum class ELittleGameType : uint8
{
	SimpleQTE                                = 0,
	SwimRingShow                             = 1,
	PropsInteraction                         = 2,
	ELittleGameType_MAX                      = 3,
};

// Enum CharacterInteraction.EIKFixMethod
// NumValues: 0x0004
enum class EIKFixMethod : uint8
{
	IKFM_FixTransform                        = 0,
	IKFM_DownwardTrace                       = 1,
	IKFM_KeepRelative                        = 2,
	IKFM_MAX                                 = 3,
};

// Enum CharacterInteraction.EInteractionCharacterInitialState
// NumValues: 0x0004
enum class EInteractionCharacterInitialState : uint8
{
	None                                     = 0,
	StandBy                                  = 1,
	ShowSequence                             = 2,
	EInteractionCharacterInitialState_MAX    = 3,
};

// Enum CharacterInteraction.EInteractionDragTriggerCompare
// NumValues: 0x0004
enum class EInteractionDragTriggerCompare : uint8
{
	Larger                                   = 0,
	Less                                     = 1,
	NotCompare                               = 2,
	EInteractionDragTriggerCompare_MAX       = 3,
};

// Enum CharacterInteraction.EInteractionDragTriggerValue
// NumValues: 0x0004
enum class EInteractionDragTriggerValue : uint8
{
	Absolute                                 = 0,
	Length                                   = 1,
	Signed                                   = 2,
	EInteractionDragTriggerValue_MAX         = 3,
};

// Enum CharacterInteraction.EInteractionDragTriggerAxis
// NumValues: 0x0004
enum class EInteractionDragTriggerAxis : uint8
{
	X                                        = 0,
	Y                                        = 1,
	XY                                       = 2,
	EInteractionDragTriggerAxis_MAX          = 3,
};

// Enum CharacterInteraction.EInteractionStandByEventType
// NumValues: 0x0004
enum class EInteractionStandByEventType : uint8
{
	StartEvent                               = 0,
	ProcessingEvent                          = 1,
	EndEvent                                 = 2,
	EInteractionStandByEventType_MAX         = 3,
};

// Enum CharacterInteraction.EInteractionShowEventType
// NumValues: 0x0004
enum class EInteractionShowEventType : uint8
{
	StartEvent                               = 0,
	ProcessingEvent                          = 1,
	EndEvent                                 = 2,
	EInteractionShowEventType_MAX            = 3,
};

// Enum CharacterInteraction.EInteractionOperateEventType
// NumValues: 0x0004
enum class EInteractionOperateEventType : uint8
{
	StartEvent                               = 0,
	ProcessingEvent                          = 1,
	EndEvent                                 = 2,
	EInteractionOperateEventType_MAX         = 3,
};

// Enum CharacterInteraction.EInteractionInputType
// NumValues: 0x0004
enum class EInteractionInputType : uint8
{
	MousePress                               = 0,
	MouseRelease                             = 1,
	MouseClick                               = 2,
	EInteractionInputType_MAX                = 3,
};

// Enum CharacterInteraction.EPlayerInteractionType
// NumValues: 0x0005
enum class EPlayerInteractionType : uint8
{
	IK                                       = 0,
	BS                                       = 1,
	ControlBone                              = 2,
	Animation                                = 3,
	EPlayerInteractionType_MAX               = 4,
};

// Enum CharacterInteraction.ECharacterInteractionState
// NumValues: 0x0005
enum class ECharacterInteractionState : uint8
{
	InteractionStateNone                     = 0,
	InteractionStandBy                       = 1,
	InteractionOperate                       = 2,
	Show                                     = 3,
	ECharacterInteractionState_MAX           = 4,
};

// ScriptStruct CharacterInteraction.PendingInteractionState
// 0x0008 (0x0008 - 0x0000)
struct FPendingInteractionState final
{
public:
	int32                                         NextStandByID;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NextShowSequenceID;                                // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPendingInteractionState) == 0x000004, "Wrong alignment on FPendingInteractionState");
static_assert(sizeof(FPendingInteractionState) == 0x000008, "Wrong size on FPendingInteractionState");
static_assert(offsetof(FPendingInteractionState, NextStandByID) == 0x000000, "Member 'FPendingInteractionState::NextStandByID' has a wrong offset!");
static_assert(offsetof(FPendingInteractionState, NextShowSequenceID) == 0x000004, "Member 'FPendingInteractionState::NextShowSequenceID' has a wrong offset!");

// ScriptStruct CharacterInteraction.AnimNode_FixPosition
// 0x0048 (0x0110 - 0x00C8)
struct alignas(0x10) FAnimNode_FixPosition final : public FAnimNode_SkeletalControlBase
{
public:
	struct FBoneReference                         FixBone;                                           // 0x00C8(0x0010)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_D8[0x38];                                      // 0x00D8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_FixPosition) == 0x000010, "Wrong alignment on FAnimNode_FixPosition");
static_assert(sizeof(FAnimNode_FixPosition) == 0x000110, "Wrong size on FAnimNode_FixPosition");
static_assert(offsetof(FAnimNode_FixPosition, FixBone) == 0x0000C8, "Member 'FAnimNode_FixPosition::FixBone' has a wrong offset!");

// ScriptStruct CharacterInteraction.AnimNode_InteractionBlendSpace
// 0x0030 (0x0040 - 0x0010)
struct FAnimNode_InteractionBlendSpace final : public FAnimNode_Base
{
public:
	uint8                                         Pad_10[0x30];                                      // 0x0010(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_InteractionBlendSpace) == 0x000008, "Wrong alignment on FAnimNode_InteractionBlendSpace");
static_assert(sizeof(FAnimNode_InteractionBlendSpace) == 0x000040, "Wrong size on FAnimNode_InteractionBlendSpace");

// ScriptStruct CharacterInteraction.AnimNode_InteractionIK
// 0x0010 (0x00D8 - 0x00C8)
struct FAnimNode_InteractionIK final : public FAnimNode_SkeletalControlBase
{
public:
	struct FComponentSpacePoseLink                RefComponentPose;                                  // 0x00C8(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAnimNode_InteractionIK) == 0x000008, "Wrong alignment on FAnimNode_InteractionIK");
static_assert(sizeof(FAnimNode_InteractionIK) == 0x0000D8, "Wrong size on FAnimNode_InteractionIK");
static_assert(offsetof(FAnimNode_InteractionIK, RefComponentPose) == 0x0000C8, "Member 'FAnimNode_InteractionIK::RefComponentPose' has a wrong offset!");

// ScriptStruct CharacterInteraction.InteractionAchivementConditionConfig
// 0x0010 (0x0018 - 0x0008)
struct FInteractionAchivementConditionConfig final : public FTableRowBase
{
public:
	int32                                         ID;                                                // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Condition;                                         // 0x000C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FInteractionAchivementConditionConfig) == 0x000008, "Wrong alignment on FInteractionAchivementConditionConfig");
static_assert(sizeof(FInteractionAchivementConditionConfig) == 0x000018, "Wrong size on FInteractionAchivementConditionConfig");
static_assert(offsetof(FInteractionAchivementConditionConfig, ID) == 0x000008, "Member 'FInteractionAchivementConditionConfig::ID' has a wrong offset!");
static_assert(offsetof(FInteractionAchivementConditionConfig, Condition) == 0x00000C, "Member 'FInteractionAchivementConditionConfig::Condition' has a wrong offset!");

// ScriptStruct CharacterInteraction.InteractionArchivementCondition
// 0x0018 (0x0018 - 0x0000)
struct FInteractionArchivementCondition final
{
public:
	TArray<int32>                                 ConditionIDs;                                      // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	EInteractionAchivementType                    ConditionType;                                     // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FInteractionArchivementCondition) == 0x000008, "Wrong alignment on FInteractionArchivementCondition");
static_assert(sizeof(FInteractionArchivementCondition) == 0x000018, "Wrong size on FInteractionArchivementCondition");
static_assert(offsetof(FInteractionArchivementCondition, ConditionIDs) == 0x000000, "Member 'FInteractionArchivementCondition::ConditionIDs' has a wrong offset!");
static_assert(offsetof(FInteractionArchivementCondition, ConditionType) == 0x000010, "Member 'FInteractionArchivementCondition::ConditionType' has a wrong offset!");

// ScriptStruct CharacterInteraction.InteractionArchivementConfig
// 0x0020 (0x0028 - 0x0008)
struct FInteractionArchivementConfig final : public FTableRowBase
{
public:
	int32                                         ID;                                                // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInteractionArchivementCondition> Conditions;                                        // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class ULevelSequence*                         EasterEggSequence;                                 // 0x0020(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FInteractionArchivementConfig) == 0x000008, "Wrong alignment on FInteractionArchivementConfig");
static_assert(sizeof(FInteractionArchivementConfig) == 0x000028, "Wrong size on FInteractionArchivementConfig");
static_assert(offsetof(FInteractionArchivementConfig, ID) == 0x000008, "Member 'FInteractionArchivementConfig::ID' has a wrong offset!");
static_assert(offsetof(FInteractionArchivementConfig, Conditions) == 0x000010, "Member 'FInteractionArchivementConfig::Conditions' has a wrong offset!");
static_assert(offsetof(FInteractionArchivementConfig, EasterEggSequence) == 0x000020, "Member 'FInteractionArchivementConfig::EasterEggSequence' has a wrong offset!");

// ScriptStruct CharacterInteraction.LastFrameAnimData
// 0x0030 (0x0030 - 0x0000)
struct FLastFrameAnimData final
{
public:
	class UAnimSequence*                          LastFrameAnim;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          LastFrameFacialAnim;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          LastFrameAdditive;                                 // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           LastFrameMontage;                                  // 0x0018(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           LastFrameFacialMontage;                            // 0x0020(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           LastFrameAdditiveMontage;                          // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLastFrameAnimData) == 0x000008, "Wrong alignment on FLastFrameAnimData");
static_assert(sizeof(FLastFrameAnimData) == 0x000030, "Wrong size on FLastFrameAnimData");
static_assert(offsetof(FLastFrameAnimData, LastFrameAnim) == 0x000000, "Member 'FLastFrameAnimData::LastFrameAnim' has a wrong offset!");
static_assert(offsetof(FLastFrameAnimData, LastFrameFacialAnim) == 0x000008, "Member 'FLastFrameAnimData::LastFrameFacialAnim' has a wrong offset!");
static_assert(offsetof(FLastFrameAnimData, LastFrameAdditive) == 0x000010, "Member 'FLastFrameAnimData::LastFrameAdditive' has a wrong offset!");
static_assert(offsetof(FLastFrameAnimData, LastFrameMontage) == 0x000018, "Member 'FLastFrameAnimData::LastFrameMontage' has a wrong offset!");
static_assert(offsetof(FLastFrameAnimData, LastFrameFacialMontage) == 0x000020, "Member 'FLastFrameAnimData::LastFrameFacialMontage' has a wrong offset!");
static_assert(offsetof(FLastFrameAnimData, LastFrameAdditiveMontage) == 0x000028, "Member 'FLastFrameAnimData::LastFrameAdditiveMontage' has a wrong offset!");

// ScriptStruct CharacterInteraction.InteractionHolyLightData
// 0x0020 (0x0020 - 0x0000)
struct FInteractionHolyLightData final
{
public:
	class FName                                   SocketName;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Intensity;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   UIName;                                            // 0x000C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            SizeRatio;                                         // 0x0018(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FInteractionHolyLightData) == 0x000008, "Wrong alignment on FInteractionHolyLightData");
static_assert(sizeof(FInteractionHolyLightData) == 0x000020, "Wrong size on FInteractionHolyLightData");
static_assert(offsetof(FInteractionHolyLightData, SocketName) == 0x000000, "Member 'FInteractionHolyLightData::SocketName' has a wrong offset!");
static_assert(offsetof(FInteractionHolyLightData, Intensity) == 0x000008, "Member 'FInteractionHolyLightData::Intensity' has a wrong offset!");
static_assert(offsetof(FInteractionHolyLightData, UIName) == 0x00000C, "Member 'FInteractionHolyLightData::UIName' has a wrong offset!");
static_assert(offsetof(FInteractionHolyLightData, SizeRatio) == 0x000018, "Member 'FInteractionHolyLightData::SizeRatio' has a wrong offset!");

// ScriptStruct CharacterInteraction.InteractionHolyLightRuntimeData
// 0x0028 (0x0028 - 0x0000)
struct FInteractionHolyLightRuntimeData final
{
public:
	struct FInteractionHolyLightData              Data;                                              // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         AddTimes;                                          // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FInteractionHolyLightRuntimeData) == 0x000008, "Wrong alignment on FInteractionHolyLightRuntimeData");
static_assert(sizeof(FInteractionHolyLightRuntimeData) == 0x000028, "Wrong size on FInteractionHolyLightRuntimeData");
static_assert(offsetof(FInteractionHolyLightRuntimeData, Data) == 0x000000, "Member 'FInteractionHolyLightRuntimeData::Data' has a wrong offset!");
static_assert(offsetof(FInteractionHolyLightRuntimeData, AddTimes) == 0x000020, "Member 'FInteractionHolyLightRuntimeData::AddTimes' has a wrong offset!");

// ScriptStruct CharacterInteraction.InteractionHolyLightRuntimeDataArray
// 0x0010 (0x0010 - 0x0000)
struct FInteractionHolyLightRuntimeDataArray final
{
public:
	TArray<struct FInteractionHolyLightRuntimeData> ArrayData;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FInteractionHolyLightRuntimeDataArray) == 0x000008, "Wrong alignment on FInteractionHolyLightRuntimeDataArray");
static_assert(sizeof(FInteractionHolyLightRuntimeDataArray) == 0x000010, "Wrong size on FInteractionHolyLightRuntimeDataArray");
static_assert(offsetof(FInteractionHolyLightRuntimeDataArray, ArrayData) == 0x000000, "Member 'FInteractionHolyLightRuntimeDataArray::ArrayData' has a wrong offset!");

// ScriptStruct CharacterInteraction.InteractionAnimInstanceProxy
// 0x01E0 (0x0940 - 0x0760)
struct FInteractionAnimInstanceProxy final : public FAnimInstanceProxy
{
public:
	uint8                                         Pad_760[0x1E0];                                    // 0x0760(0x01E0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FInteractionAnimInstanceProxy) == 0x000010, "Wrong alignment on FInteractionAnimInstanceProxy");
static_assert(sizeof(FInteractionAnimInstanceProxy) == 0x000940, "Wrong size on FInteractionAnimInstanceProxy");

// ScriptStruct CharacterInteraction.InteractionCableConstraint
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x04) FInteractionCableConstraint final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FInteractionCableConstraint) == 0x000004, "Wrong alignment on FInteractionCableConstraint");
static_assert(sizeof(FInteractionCableConstraint) == 0x000010, "Wrong size on FInteractionCableConstraint");

// ScriptStruct CharacterInteraction.ConfessionStandByConfig
// 0x0098 (0x00A0 - 0x0008)
struct FConfessionStandByConfig final : public FTableRowBase
{
public:
	int32                                         StandByID;                                         // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimSequence>           AdditiveBreathAnim;                                // 0x0010(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 NextSeqs;                                          // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         ButtonTextIDs;                                     // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bAutoPlaySequence;                                 // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           SyncPlayerIDs;                                     // 0x0060(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 SyncStandByIDs;                                    // 0x0070(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UAnimSequence*>                  SyncLastFrameSeq;                                  // 0x0080(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UAnimSequence*>                  SyncAdditivePoseSeq;                               // 0x0090(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConfessionStandByConfig) == 0x000008, "Wrong alignment on FConfessionStandByConfig");
static_assert(sizeof(FConfessionStandByConfig) == 0x0000A0, "Wrong size on FConfessionStandByConfig");
static_assert(offsetof(FConfessionStandByConfig, StandByID) == 0x000008, "Member 'FConfessionStandByConfig::StandByID' has a wrong offset!");
static_assert(offsetof(FConfessionStandByConfig, AdditiveBreathAnim) == 0x000010, "Member 'FConfessionStandByConfig::AdditiveBreathAnim' has a wrong offset!");
static_assert(offsetof(FConfessionStandByConfig, NextSeqs) == 0x000038, "Member 'FConfessionStandByConfig::NextSeqs' has a wrong offset!");
static_assert(offsetof(FConfessionStandByConfig, ButtonTextIDs) == 0x000048, "Member 'FConfessionStandByConfig::ButtonTextIDs' has a wrong offset!");
static_assert(offsetof(FConfessionStandByConfig, bAutoPlaySequence) == 0x000058, "Member 'FConfessionStandByConfig::bAutoPlaySequence' has a wrong offset!");
static_assert(offsetof(FConfessionStandByConfig, SyncPlayerIDs) == 0x000060, "Member 'FConfessionStandByConfig::SyncPlayerIDs' has a wrong offset!");
static_assert(offsetof(FConfessionStandByConfig, SyncStandByIDs) == 0x000070, "Member 'FConfessionStandByConfig::SyncStandByIDs' has a wrong offset!");
static_assert(offsetof(FConfessionStandByConfig, SyncLastFrameSeq) == 0x000080, "Member 'FConfessionStandByConfig::SyncLastFrameSeq' has a wrong offset!");
static_assert(offsetof(FConfessionStandByConfig, SyncAdditivePoseSeq) == 0x000090, "Member 'FConfessionStandByConfig::SyncAdditivePoseSeq' has a wrong offset!");

// ScriptStruct CharacterInteraction.ConfessionSequenceInfo
// 0x0040 (0x0048 - 0x0008)
struct FConfessionSequenceInfo final : public FTableRowBase
{
public:
	int32                                         ShowSequenceID;                                    // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AnalyzerVoiceID;                                   // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DelayTime;                                         // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NextStandByID;                                     // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           SyncPlayerIDs;                                     // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 SyncSequenceIDs;                                   // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConfessionSequenceInfo) == 0x000008, "Wrong alignment on FConfessionSequenceInfo");
static_assert(sizeof(FConfessionSequenceInfo) == 0x000048, "Wrong size on FConfessionSequenceInfo");
static_assert(offsetof(FConfessionSequenceInfo, ShowSequenceID) == 0x000008, "Member 'FConfessionSequenceInfo::ShowSequenceID' has a wrong offset!");
static_assert(offsetof(FConfessionSequenceInfo, AnalyzerVoiceID) == 0x000010, "Member 'FConfessionSequenceInfo::AnalyzerVoiceID' has a wrong offset!");
static_assert(offsetof(FConfessionSequenceInfo, DelayTime) == 0x000020, "Member 'FConfessionSequenceInfo::DelayTime' has a wrong offset!");
static_assert(offsetof(FConfessionSequenceInfo, NextStandByID) == 0x000024, "Member 'FConfessionSequenceInfo::NextStandByID' has a wrong offset!");
static_assert(offsetof(FConfessionSequenceInfo, SyncPlayerIDs) == 0x000028, "Member 'FConfessionSequenceInfo::SyncPlayerIDs' has a wrong offset!");
static_assert(offsetof(FConfessionSequenceInfo, SyncSequenceIDs) == 0x000038, "Member 'FConfessionSequenceInfo::SyncSequenceIDs' has a wrong offset!");

// ScriptStruct CharacterInteraction.ParamNameToSet
// 0x0010 (0x0010 - 0x0000)
struct FParamNameToSet final
{
public:
	TArray<class FName>                           ToSetParamName;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FParamNameToSet) == 0x000008, "Wrong alignment on FParamNameToSet");
static_assert(sizeof(FParamNameToSet) == 0x000010, "Wrong size on FParamNameToSet");
static_assert(offsetof(FParamNameToSet, ToSetParamName) == 0x000000, "Member 'FParamNameToSet::ToSetParamName' has a wrong offset!");

// ScriptStruct CharacterInteraction.MovementTypeInSet
// 0x0018 (0x0018 - 0x0000)
struct FMovementTypeInSet final
{
public:
	EPhysicsMovementType                          MovementType;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           SetNames;                                          // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMovementTypeInSet) == 0x000008, "Wrong alignment on FMovementTypeInSet");
static_assert(sizeof(FMovementTypeInSet) == 0x000018, "Wrong size on FMovementTypeInSet");
static_assert(offsetof(FMovementTypeInSet, MovementType) == 0x000000, "Member 'FMovementTypeInSet::MovementType' has a wrong offset!");
static_assert(offsetof(FMovementTypeInSet, SetNames) == 0x000008, "Member 'FMovementTypeInSet::SetNames' has a wrong offset!");

// ScriptStruct CharacterInteraction.ControlDataInSet
// 0x0028 (0x0028 - 0x0000)
struct FControlDataInSet final
{
public:
	class FName                                   SetName;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPhysicsControlData                    ControlData;                                       // 0x0008(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FControlDataInSet) == 0x000004, "Wrong alignment on FControlDataInSet");
static_assert(sizeof(FControlDataInSet) == 0x000028, "Wrong size on FControlDataInSet");
static_assert(offsetof(FControlDataInSet, SetName) == 0x000000, "Member 'FControlDataInSet::SetName' has a wrong offset!");
static_assert(offsetof(FControlDataInSet, ControlData) == 0x000008, "Member 'FControlDataInSet::ControlData' has a wrong offset!");

// ScriptStruct CharacterInteraction.InteractionPhysicsControlData
// 0x0180 (0x0188 - 0x0008)
struct FInteractionPhysicsControlData final : public FTableRowBase
{
public:
	TSoftObjectPtr<class UPhysicsAsset>           DefaultPhysicsAsset;                               // 0x0008(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ID;                                                // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPhysicsControlLimbSetupData>   LimbSetupData;                                     // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, struct FParamNameToSet>     BodyModifiersToSet;                                // 0x0048(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FMovementTypeInSet>             MovementTypesInSet;                                // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, struct FParamNameToSet>     ControlToSet;                                      // 0x00A8(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FControlDataInSet>              InSetControlData;                                  // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FPhysicsControlData                    WorldSpaceControlData;                             // 0x0108(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsControlSettings                WorldSpaceControlSettings;                         // 0x0128(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEnableWorldSpaceControls;                         // 0x0140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPhysicsControlData                    ParentSpaceControlData;                            // 0x0144(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsControlSettings                ParentSpaceControlSettings;                        // 0x0164(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEnableParentSpaceControls;                        // 0x017C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPhysicsMovementType                          PhysicsMovementType;                               // 0x017D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17E[0x2];                                      // 0x017E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GravityMultiplier;                                 // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PhysicsBlendWeight;                                // 0x0184(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FInteractionPhysicsControlData) == 0x000008, "Wrong alignment on FInteractionPhysicsControlData");
static_assert(sizeof(FInteractionPhysicsControlData) == 0x000188, "Wrong size on FInteractionPhysicsControlData");
static_assert(offsetof(FInteractionPhysicsControlData, DefaultPhysicsAsset) == 0x000008, "Member 'FInteractionPhysicsControlData::DefaultPhysicsAsset' has a wrong offset!");
static_assert(offsetof(FInteractionPhysicsControlData, ID) == 0x000030, "Member 'FInteractionPhysicsControlData::ID' has a wrong offset!");
static_assert(offsetof(FInteractionPhysicsControlData, LimbSetupData) == 0x000038, "Member 'FInteractionPhysicsControlData::LimbSetupData' has a wrong offset!");
static_assert(offsetof(FInteractionPhysicsControlData, BodyModifiersToSet) == 0x000048, "Member 'FInteractionPhysicsControlData::BodyModifiersToSet' has a wrong offset!");
static_assert(offsetof(FInteractionPhysicsControlData, MovementTypesInSet) == 0x000098, "Member 'FInteractionPhysicsControlData::MovementTypesInSet' has a wrong offset!");
static_assert(offsetof(FInteractionPhysicsControlData, ControlToSet) == 0x0000A8, "Member 'FInteractionPhysicsControlData::ControlToSet' has a wrong offset!");
static_assert(offsetof(FInteractionPhysicsControlData, InSetControlData) == 0x0000F8, "Member 'FInteractionPhysicsControlData::InSetControlData' has a wrong offset!");
static_assert(offsetof(FInteractionPhysicsControlData, WorldSpaceControlData) == 0x000108, "Member 'FInteractionPhysicsControlData::WorldSpaceControlData' has a wrong offset!");
static_assert(offsetof(FInteractionPhysicsControlData, WorldSpaceControlSettings) == 0x000128, "Member 'FInteractionPhysicsControlData::WorldSpaceControlSettings' has a wrong offset!");
static_assert(offsetof(FInteractionPhysicsControlData, bEnableWorldSpaceControls) == 0x000140, "Member 'FInteractionPhysicsControlData::bEnableWorldSpaceControls' has a wrong offset!");
static_assert(offsetof(FInteractionPhysicsControlData, ParentSpaceControlData) == 0x000144, "Member 'FInteractionPhysicsControlData::ParentSpaceControlData' has a wrong offset!");
static_assert(offsetof(FInteractionPhysicsControlData, ParentSpaceControlSettings) == 0x000164, "Member 'FInteractionPhysicsControlData::ParentSpaceControlSettings' has a wrong offset!");
static_assert(offsetof(FInteractionPhysicsControlData, bEnableParentSpaceControls) == 0x00017C, "Member 'FInteractionPhysicsControlData::bEnableParentSpaceControls' has a wrong offset!");
static_assert(offsetof(FInteractionPhysicsControlData, PhysicsMovementType) == 0x00017D, "Member 'FInteractionPhysicsControlData::PhysicsMovementType' has a wrong offset!");
static_assert(offsetof(FInteractionPhysicsControlData, GravityMultiplier) == 0x000180, "Member 'FInteractionPhysicsControlData::GravityMultiplier' has a wrong offset!");
static_assert(offsetof(FInteractionPhysicsControlData, PhysicsBlendWeight) == 0x000184, "Member 'FInteractionPhysicsControlData::PhysicsBlendWeight' has a wrong offset!");

// ScriptStruct CharacterInteraction.LevelSequenceMapping
// 0x0010 (0x0018 - 0x0008)
struct FLevelSequenceMapping final : public FTableRowBase
{
public:
	class FName                                   Name;                                              // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Length;                                            // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLevelSequenceMapping) == 0x000008, "Wrong alignment on FLevelSequenceMapping");
static_assert(sizeof(FLevelSequenceMapping) == 0x000018, "Wrong size on FLevelSequenceMapping");
static_assert(offsetof(FLevelSequenceMapping, Name) == 0x000008, "Member 'FLevelSequenceMapping::Name' has a wrong offset!");
static_assert(offsetof(FLevelSequenceMapping, Length) == 0x000010, "Member 'FLevelSequenceMapping::Length' has a wrong offset!");

// ScriptStruct CharacterInteraction.InteractionBlendSpaceData
// 0x0018 (0x0018 - 0x0000)
struct FInteractionBlendSpaceData final
{
public:
	class UBlendSpace*                            BlendSpace;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              BlendSpaceValue;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendRatio;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FInteractionBlendSpaceData) == 0x000008, "Wrong alignment on FInteractionBlendSpaceData");
static_assert(sizeof(FInteractionBlendSpaceData) == 0x000018, "Wrong size on FInteractionBlendSpaceData");
static_assert(offsetof(FInteractionBlendSpaceData, BlendSpace) == 0x000000, "Member 'FInteractionBlendSpaceData::BlendSpace' has a wrong offset!");
static_assert(offsetof(FInteractionBlendSpaceData, BlendSpaceValue) == 0x000008, "Member 'FInteractionBlendSpaceData::BlendSpaceValue' has a wrong offset!");
static_assert(offsetof(FInteractionBlendSpaceData, BlendRatio) == 0x000010, "Member 'FInteractionBlendSpaceData::BlendRatio' has a wrong offset!");

// ScriptStruct CharacterInteraction.IKTransformData
// 0x0060 (0x0060 - 0x0000)
struct FIKTransformData final
{
public:
	class FName                                   BoneName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ModTransform;                                      // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                JointControlVector;                                // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDownwardTrace;                                    // 0x004C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DownwardFixValue;                                  // 0x0050(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          KeepRotation;                                      // 0x0054(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0xB];                                       // 0x0055(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FIKTransformData) == 0x000010, "Wrong alignment on FIKTransformData");
static_assert(sizeof(FIKTransformData) == 0x000060, "Wrong size on FIKTransformData");
static_assert(offsetof(FIKTransformData, BoneName) == 0x000000, "Member 'FIKTransformData::BoneName' has a wrong offset!");
static_assert(offsetof(FIKTransformData, ModTransform) == 0x000010, "Member 'FIKTransformData::ModTransform' has a wrong offset!");
static_assert(offsetof(FIKTransformData, JointControlVector) == 0x000040, "Member 'FIKTransformData::JointControlVector' has a wrong offset!");
static_assert(offsetof(FIKTransformData, bDownwardTrace) == 0x00004C, "Member 'FIKTransformData::bDownwardTrace' has a wrong offset!");
static_assert(offsetof(FIKTransformData, DownwardFixValue) == 0x000050, "Member 'FIKTransformData::DownwardFixValue' has a wrong offset!");
static_assert(offsetof(FIKTransformData, KeepRotation) == 0x000054, "Member 'FIKTransformData::KeepRotation' has a wrong offset!");

// ScriptStruct CharacterInteraction.IKFixedTransformFixData
// 0x0014 (0x0014 - 0x0000)
struct FIKFixedTransformFixData final
{
public:
	class FName                                   BoneName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                JointControlVector;                                // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FIKFixedTransformFixData) == 0x000004, "Wrong alignment on FIKFixedTransformFixData");
static_assert(sizeof(FIKFixedTransformFixData) == 0x000014, "Wrong size on FIKFixedTransformFixData");
static_assert(offsetof(FIKFixedTransformFixData, BoneName) == 0x000000, "Member 'FIKFixedTransformFixData::BoneName' has a wrong offset!");
static_assert(offsetof(FIKFixedTransformFixData, JointControlVector) == 0x000008, "Member 'FIKFixedTransformFixData::JointControlVector' has a wrong offset!");

// ScriptStruct CharacterInteraction.JointIKTransformData
// 0x0040 (0x0040 - 0x0000)
struct FJointIKTransformData final
{
public:
	class FName                                   BoneName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ModTransform;                                      // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FJointIKTransformData) == 0x000010, "Wrong alignment on FJointIKTransformData");
static_assert(sizeof(FJointIKTransformData) == 0x000040, "Wrong size on FJointIKTransformData");
static_assert(offsetof(FJointIKTransformData, BoneName) == 0x000000, "Member 'FJointIKTransformData::BoneName' has a wrong offset!");
static_assert(offsetof(FJointIKTransformData, ModTransform) == 0x000010, "Member 'FJointIKTransformData::ModTransform' has a wrong offset!");

// ScriptStruct CharacterInteraction.IKFixRelativeTransformData
// 0x0010 (0x0010 - 0x0000)
struct FIKFixRelativeTransformData final
{
public:
	class FName                                   BoneName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RefBoneName;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FIKFixRelativeTransformData) == 0x000004, "Wrong alignment on FIKFixRelativeTransformData");
static_assert(sizeof(FIKFixRelativeTransformData) == 0x000010, "Wrong size on FIKFixRelativeTransformData");
static_assert(offsetof(FIKFixRelativeTransformData, BoneName) == 0x000000, "Member 'FIKFixRelativeTransformData::BoneName' has a wrong offset!");
static_assert(offsetof(FIKFixRelativeTransformData, RefBoneName) == 0x000008, "Member 'FIKFixRelativeTransformData::RefBoneName' has a wrong offset!");

// ScriptStruct CharacterInteraction.IKFixEffectorLocationAndRotation
// 0x0050 (0x0050 - 0x0000)
struct FIKFixEffectorLocationAndRotation final
{
public:
	class FName                                   BoneName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                JointControl;                                      // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RecoverValue;                                      // 0x004C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FIKFixEffectorLocationAndRotation) == 0x000010, "Wrong alignment on FIKFixEffectorLocationAndRotation");
static_assert(sizeof(FIKFixEffectorLocationAndRotation) == 0x000050, "Wrong size on FIKFixEffectorLocationAndRotation");
static_assert(offsetof(FIKFixEffectorLocationAndRotation, BoneName) == 0x000000, "Member 'FIKFixEffectorLocationAndRotation::BoneName' has a wrong offset!");
static_assert(offsetof(FIKFixEffectorLocationAndRotation, Transform) == 0x000010, "Member 'FIKFixEffectorLocationAndRotation::Transform' has a wrong offset!");
static_assert(offsetof(FIKFixEffectorLocationAndRotation, JointControl) == 0x000040, "Member 'FIKFixEffectorLocationAndRotation::JointControl' has a wrong offset!");
static_assert(offsetof(FIKFixEffectorLocationAndRotation, RecoverValue) == 0x00004C, "Member 'FIKFixEffectorLocationAndRotation::RecoverValue' has a wrong offset!");

// ScriptStruct CharacterInteraction.InteractionIKFixData
// 0x0190 (0x0190 - 0x0000)
struct FInteractionIKFixData final
{
public:
	TMap<class FName, struct FIKTransformData>    IKTransformDatas;                                  // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<class FName, struct FIKFixedTransformFixData> FixedIKDatas;                                      // 0x0050(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<class FName, struct FJointIKTransformData> JointIKTransformDatas;                             // 0x00A0(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<class FName, struct FIKFixRelativeTransformData> RelativeIKFixDatas;                                // 0x00F0(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<class FName, struct FIKFixEffectorLocationAndRotation> EffectorLocationAndRotations;                      // 0x0140(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FInteractionIKFixData) == 0x000008, "Wrong alignment on FInteractionIKFixData");
static_assert(sizeof(FInteractionIKFixData) == 0x000190, "Wrong size on FInteractionIKFixData");
static_assert(offsetof(FInteractionIKFixData, IKTransformDatas) == 0x000000, "Member 'FInteractionIKFixData::IKTransformDatas' has a wrong offset!");
static_assert(offsetof(FInteractionIKFixData, FixedIKDatas) == 0x000050, "Member 'FInteractionIKFixData::FixedIKDatas' has a wrong offset!");
static_assert(offsetof(FInteractionIKFixData, JointIKTransformDatas) == 0x0000A0, "Member 'FInteractionIKFixData::JointIKTransformDatas' has a wrong offset!");
static_assert(offsetof(FInteractionIKFixData, RelativeIKFixDatas) == 0x0000F0, "Member 'FInteractionIKFixData::RelativeIKFixDatas' has a wrong offset!");
static_assert(offsetof(FInteractionIKFixData, EffectorLocationAndRotations) == 0x000140, "Member 'FInteractionIKFixData::EffectorLocationAndRotations' has a wrong offset!");

// ScriptStruct CharacterInteraction.InteractionCollisionEventData
// 0x0020 (0x0020 - 0x0000)
struct FInteractionCollisionEventData final
{
public:
	TArray<int32>                                 ForbiddenCollisionIDs;                             // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 EnabledCollisionIDs;                               // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FInteractionCollisionEventData) == 0x000008, "Wrong alignment on FInteractionCollisionEventData");
static_assert(sizeof(FInteractionCollisionEventData) == 0x000020, "Wrong size on FInteractionCollisionEventData");
static_assert(offsetof(FInteractionCollisionEventData, ForbiddenCollisionIDs) == 0x000000, "Member 'FInteractionCollisionEventData::ForbiddenCollisionIDs' has a wrong offset!");
static_assert(offsetof(FInteractionCollisionEventData, EnabledCollisionIDs) == 0x000010, "Member 'FInteractionCollisionEventData::EnabledCollisionIDs' has a wrong offset!");

// ScriptStruct CharacterInteraction.WeightedShowSequence
// 0x0030 (0x0030 - 0x0000)
struct FWeightedShowSequence final
{
public:
	float                                         Weight;                                            // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ShowSequenceID;                                    // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UInteractionCustomActionAsset> CustomAction;                                      // 0x0008(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FWeightedShowSequence) == 0x000008, "Wrong alignment on FWeightedShowSequence");
static_assert(sizeof(FWeightedShowSequence) == 0x000030, "Wrong size on FWeightedShowSequence");
static_assert(offsetof(FWeightedShowSequence, Weight) == 0x000000, "Member 'FWeightedShowSequence::Weight' has a wrong offset!");
static_assert(offsetof(FWeightedShowSequence, ShowSequenceID) == 0x000004, "Member 'FWeightedShowSequence::ShowSequenceID' has a wrong offset!");
static_assert(offsetof(FWeightedShowSequence, CustomAction) == 0x000008, "Member 'FWeightedShowSequence::CustomAction' has a wrong offset!");

// ScriptStruct CharacterInteraction.InteractionOperateCollision
// 0x0068 (0x0068 - 0x0000)
struct FInteractionOperateCollision final
{
public:
	int32                                         CollisionID;                                       // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ClickOperateID;                                    // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DragOperateID;                                     // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SocketName;                                        // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AllAgeLevel;                                       // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BoxSize;                                           // 0x0024(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BoxOffset;                                         // 0x0030(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Range;                                             // 0x003C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 HideUIName;                                        // 0x0048(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               BoxRotator;                                        // 0x0058(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FInteractionOperateCollision) == 0x000008, "Wrong alignment on FInteractionOperateCollision");
static_assert(sizeof(FInteractionOperateCollision) == 0x000068, "Wrong size on FInteractionOperateCollision");
static_assert(offsetof(FInteractionOperateCollision, CollisionID) == 0x000000, "Member 'FInteractionOperateCollision::CollisionID' has a wrong offset!");
static_assert(offsetof(FInteractionOperateCollision, ClickOperateID) == 0x000004, "Member 'FInteractionOperateCollision::ClickOperateID' has a wrong offset!");
static_assert(offsetof(FInteractionOperateCollision, DragOperateID) == 0x000008, "Member 'FInteractionOperateCollision::DragOperateID' has a wrong offset!");
static_assert(offsetof(FInteractionOperateCollision, SocketName) == 0x000010, "Member 'FInteractionOperateCollision::SocketName' has a wrong offset!");
static_assert(offsetof(FInteractionOperateCollision, AllAgeLevel) == 0x000020, "Member 'FInteractionOperateCollision::AllAgeLevel' has a wrong offset!");
static_assert(offsetof(FInteractionOperateCollision, BoxSize) == 0x000024, "Member 'FInteractionOperateCollision::BoxSize' has a wrong offset!");
static_assert(offsetof(FInteractionOperateCollision, BoxOffset) == 0x000030, "Member 'FInteractionOperateCollision::BoxOffset' has a wrong offset!");
static_assert(offsetof(FInteractionOperateCollision, Range) == 0x00003C, "Member 'FInteractionOperateCollision::Range' has a wrong offset!");
static_assert(offsetof(FInteractionOperateCollision, HideUIName) == 0x000048, "Member 'FInteractionOperateCollision::HideUIName' has a wrong offset!");
static_assert(offsetof(FInteractionOperateCollision, BoxRotator) == 0x000058, "Member 'FInteractionOperateCollision::BoxRotator' has a wrong offset!");

// ScriptStruct CharacterInteraction.InteractionStandByConfig
// 0x00D8 (0x00E0 - 0x0008)
struct FInteractionStandByConfig final : public FTableRowBase
{
public:
	int32                                         ID;                                                // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SkinID;                                            // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimSequence>           StandbyAnim;                                       // 0x0010(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimSequence>           StandByFacialAnim;                                 // 0x0038(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShowSequenceTriggerTime;                           // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWeightedShowSequence>          ShowSequences;                                     // 0x0068(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UInteractionStandByEventAsset>> StandByEvents;                                     // 0x0078(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bIsEyeFollow;                                      // 0x0088(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverridePhysicsControl;                           // 0x0089(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UOverridePhysicsControl> OverridePhysicsControl;                            // 0x0090(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FInteractionHolyLightData>      HolyLights;                                        // 0x00B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
