#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterInteractionV3

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "UniversalCameraPlugin_structs.hpp"
#include "CharacterInteractionV3_structs.hpp"


namespace SDK::Params
{

// Function CharacterInteractionV3.ActorOperateAct.OnPause
// 0x0008 (0x0008 - 0x0000)
struct ActorOperateAct_OnPause final
{
public:
	class AInteractionSkeletalActorV3*            Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActorOperateAct_OnPause) == 0x000008, "Wrong alignment on ActorOperateAct_OnPause");
static_assert(sizeof(ActorOperateAct_OnPause) == 0x000008, "Wrong size on ActorOperateAct_OnPause");
static_assert(offsetof(ActorOperateAct_OnPause, Actor) == 0x000000, "Member 'ActorOperateAct_OnPause::Actor' has a wrong offset!");

// Function CharacterInteractionV3.ActorOperateAct.OnRestart
// 0x0008 (0x0008 - 0x0000)
struct ActorOperateAct_OnRestart final
{
public:
	class AInteractionSkeletalActorV3*            Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActorOperateAct_OnRestart) == 0x000008, "Wrong alignment on ActorOperateAct_OnRestart");
static_assert(sizeof(ActorOperateAct_OnRestart) == 0x000008, "Wrong size on ActorOperateAct_OnRestart");
static_assert(offsetof(ActorOperateAct_OnRestart, Actor) == 0x000000, "Member 'ActorOperateAct_OnRestart::Actor' has a wrong offset!");

// Function CharacterInteractionV3.ActorOperateAct.OnResume
// 0x0008 (0x0008 - 0x0000)
struct ActorOperateAct_OnResume final
{
public:
	class AInteractionSkeletalActorV3*            Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActorOperateAct_OnResume) == 0x000008, "Wrong alignment on ActorOperateAct_OnResume");
static_assert(sizeof(ActorOperateAct_OnResume) == 0x000008, "Wrong size on ActorOperateAct_OnResume");
static_assert(offsetof(ActorOperateAct_OnResume, Actor) == 0x000000, "Member 'ActorOperateAct_OnResume::Actor' has a wrong offset!");

// Function CharacterInteractionV3.ActorOperateAct.OnStart
// 0x0008 (0x0008 - 0x0000)
struct ActorOperateAct_OnStart final
{
public:
	class AInteractionSkeletalActorV3*            Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActorOperateAct_OnStart) == 0x000008, "Wrong alignment on ActorOperateAct_OnStart");
static_assert(sizeof(ActorOperateAct_OnStart) == 0x000008, "Wrong size on ActorOperateAct_OnStart");
static_assert(offsetof(ActorOperateAct_OnStart, Actor) == 0x000000, "Member 'ActorOperateAct_OnStart::Actor' has a wrong offset!");

// Function CharacterInteractionV3.ActorOperateAct.OnStartBlendOut
// 0x0008 (0x0008 - 0x0000)
struct ActorOperateAct_OnStartBlendOut final
{
public:
	class AInteractionSkeletalActorV3*            Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActorOperateAct_OnStartBlendOut) == 0x000008, "Wrong alignment on ActorOperateAct_OnStartBlendOut");
static_assert(sizeof(ActorOperateAct_OnStartBlendOut) == 0x000008, "Wrong size on ActorOperateAct_OnStartBlendOut");
static_assert(offsetof(ActorOperateAct_OnStartBlendOut, Actor) == 0x000000, "Member 'ActorOperateAct_OnStartBlendOut::Actor' has a wrong offset!");

// Function CharacterInteractionV3.ActorOperateAct.OnStop
// 0x0008 (0x0008 - 0x0000)
struct ActorOperateAct_OnStop final
{
public:
	class AInteractionSkeletalActorV3*            Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActorOperateAct_OnStop) == 0x000008, "Wrong alignment on ActorOperateAct_OnStop");
static_assert(sizeof(ActorOperateAct_OnStop) == 0x000008, "Wrong size on ActorOperateAct_OnStop");
static_assert(offsetof(ActorOperateAct_OnStop, Actor) == 0x000000, "Member 'ActorOperateAct_OnStop::Actor' has a wrong offset!");

// Function CharacterInteractionV3.ActorOperateAct.OnUpdate
// 0x0018 (0x0018 - 0x0000)
struct ActorOperateAct_OnUpdate final
{
public:
	class UInteractionV3InputControl*             InputControl;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AInteractionSkeletalActorV3*            Actor;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ActorOperateAct_OnUpdate) == 0x000008, "Wrong alignment on ActorOperateAct_OnUpdate");
static_assert(sizeof(ActorOperateAct_OnUpdate) == 0x000018, "Wrong size on ActorOperateAct_OnUpdate");
static_assert(offsetof(ActorOperateAct_OnUpdate, InputControl) == 0x000000, "Member 'ActorOperateAct_OnUpdate::InputControl' has a wrong offset!");
static_assert(offsetof(ActorOperateAct_OnUpdate, Actor) == 0x000008, "Member 'ActorOperateAct_OnUpdate::Actor' has a wrong offset!");
static_assert(offsetof(ActorOperateAct_OnUpdate, DeltaSeconds) == 0x000010, "Member 'ActorOperateAct_OnUpdate::DeltaSeconds' has a wrong offset!");

// Function CharacterInteractionV3.ActorOperateAct.ProcessStartAct
// 0x0008 (0x0008 - 0x0000)
struct ActorOperateAct_ProcessStartAct final
{
public:
	class AInteractionSkeletalActorV3*            Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActorOperateAct_ProcessStartAct) == 0x000008, "Wrong alignment on ActorOperateAct_ProcessStartAct");
static_assert(sizeof(ActorOperateAct_ProcessStartAct) == 0x000008, "Wrong size on ActorOperateAct_ProcessStartAct");
static_assert(offsetof(ActorOperateAct_ProcessStartAct, Actor) == 0x000000, "Member 'ActorOperateAct_ProcessStartAct::Actor' has a wrong offset!");

// Function CharacterInteractionV3.ActorOperateAct.GetInputControl
// 0x0008 (0x0008 - 0x0000)
struct ActorOperateAct_GetInputControl final
{
public:
	class UInteractionV3InputControl*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActorOperateAct_GetInputControl) == 0x000008, "Wrong alignment on ActorOperateAct_GetInputControl");
static_assert(sizeof(ActorOperateAct_GetInputControl) == 0x000008, "Wrong size on ActorOperateAct_GetInputControl");
static_assert(offsetof(ActorOperateAct_GetInputControl, ReturnValue) == 0x000000, "Member 'ActorOperateAct_GetInputControl::ReturnValue' has a wrong offset!");

// Function CharacterInteractionV3.ActorOperateAct.GetScenarioOperate
// 0x0008 (0x0008 - 0x0000)
struct ActorOperateAct_GetScenarioOperate final
{
public:
	class UScenarioOperate*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActorOperateAct_GetScenarioOperate) == 0x000008, "Wrong alignment on ActorOperateAct_GetScenarioOperate");
static_assert(sizeof(ActorOperateAct_GetScenarioOperate) == 0x000008, "Wrong size on ActorOperateAct_GetScenarioOperate");
static_assert(offsetof(ActorOperateAct_GetScenarioOperate, ReturnValue) == 0x000000, "Member 'ActorOperateAct_GetScenarioOperate::ReturnValue' has a wrong offset!");

// Function CharacterInteractionV3.ActorOperateAct.IsCompleteAndBlendOut
// 0x0001 (0x0001 - 0x0000)
struct ActorOperateAct_IsCompleteAndBlendOut final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActorOperateAct_IsCompleteAndBlendOut) == 0x000001, "Wrong alignment on ActorOperateAct_IsCompleteAndBlendOut");
static_assert(sizeof(ActorOperateAct_IsCompleteAndBlendOut) == 0x000001, "Wrong size on ActorOperateAct_IsCompleteAndBlendOut");
static_assert(offsetof(ActorOperateAct_IsCompleteAndBlendOut, ReturnValue) == 0x000000, "Member 'ActorOperateAct_IsCompleteAndBlendOut::ReturnValue' has a wrong offset!");

// Function CharacterInteractionV3.InteractionV3FaceAnimInstance.GetEyeBlend
// 0x0008 (0x0008 - 0x0000)
struct InteractionV3FaceAnimInstance_GetEyeBlend final
{
public:
	class UBlendSpace*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionV3FaceAnimInstance_GetEyeBlend) == 0x000008, "Wrong alignment on InteractionV3FaceAnimInstance_GetEyeBlend");
static_assert(sizeof(InteractionV3FaceAnimInstance_GetEyeBlend) == 0x000008, "Wrong size on InteractionV3FaceAnimInstance_GetEyeBlend");
static_assert(offsetof(InteractionV3FaceAnimInstance_GetEyeBlend, ReturnValue) == 0x000000, "Member 'InteractionV3FaceAnimInstance_GetEyeBlend::ReturnValue' has a wrong offset!");

// Function CharacterInteractionV3.InteractionV3FaceAnimInstance.PlayConfessionAnim
// 0x0010 (0x0010 - 0x0000)
struct InteractionV3FaceAnimInstance_PlayConfessionAnim final
{
public:
	class UAnimSequence*                          InConfessionAnim;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InBlendInTime;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InBlendOutTime;                                    // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionV3FaceAnimInstance_PlayConfessionAnim) == 0x000008, "Wrong alignment on InteractionV3FaceAnimInstance_PlayConfessionAnim");
static_assert(sizeof(InteractionV3FaceAnimInstance_PlayConfessionAnim) == 0x000010, "Wrong size on InteractionV3FaceAnimInstance_PlayConfessionAnim");
static_assert(offsetof(InteractionV3FaceAnimInstance_PlayConfessionAnim, InConfessionAnim) == 0x000000, "Member 'InteractionV3FaceAnimInstance_PlayConfessionAnim::InConfessionAnim' has a wrong offset!");
static_assert(offsetof(InteractionV3FaceAnimInstance_PlayConfessionAnim, InBlendInTime) == 0x000008, "Member 'InteractionV3FaceAnimInstance_PlayConfessionAnim::InBlendInTime' has a wrong offset!");
static_assert(offsetof(InteractionV3FaceAnimInstance_PlayConfessionAnim, InBlendOutTime) == 0x00000C, "Member 'InteractionV3FaceAnimInstance_PlayConfessionAnim::InBlendOutTime' has a wrong offset!");

// Function CharacterInteractionV3.InteractionV3FaceAnimInstance.PlayLastFrameAnim
// 0x0008 (0x0008 - 0x0000)
struct InteractionV3FaceAnimInstance_PlayLastFrameAnim final
{
public:
	class UAnimSequence*                          InLastFrameAnim;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionV3FaceAnimInstance_PlayLastFrameAnim) == 0x000008, "Wrong alignment on InteractionV3FaceAnimInstance_PlayLastFrameAnim");
static_assert(sizeof(InteractionV3FaceAnimInstance_PlayLastFrameAnim) == 0x000008, "Wrong size on InteractionV3FaceAnimInstance_PlayLastFrameAnim");
static_assert(offsetof(InteractionV3FaceAnimInstance_PlayLastFrameAnim, InLastFrameAnim) == 0x000000, "Member 'InteractionV3FaceAnimInstance_PlayLastFrameAnim::InLastFrameAnim' has a wrong offset!");

// Function CharacterInteractionV3.InteractionV3FaceAnimInstance.SetEyeBlend
// 0x0008 (0x0008 - 0x0000)
struct InteractionV3FaceAnimInstance_SetEyeBlend final
{
public:
	class UBlendSpace*                            NewBlend;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionV3FaceAnimInstance_SetEyeBlend) == 0x000008, "Wrong alignment on InteractionV3FaceAnimInstance_SetEyeBlend");
static_assert(sizeof(InteractionV3FaceAnimInstance_SetEyeBlend) == 0x000008, "Wrong size on InteractionV3FaceAnimInstance_SetEyeBlend");
static_assert(offsetof(InteractionV3FaceAnimInstance_SetEyeBlend, NewBlend) == 0x000000, "Member 'InteractionV3FaceAnimInstance_SetEyeBlend::NewBlend' has a wrong offset!");

// Function CharacterInteractionV3.InteractionV3FaceAnimInstance.SetFaceIdleAnim
// 0x0008 (0x0008 - 0x0000)
struct InteractionV3FaceAnimInstance_SetFaceIdleAnim final
{
public:
	class UAnimSequence*                          InAnimSequence;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionV3FaceAnimInstance_SetFaceIdleAnim) == 0x000008, "Wrong alignment on InteractionV3FaceAnimInstance_SetFaceIdleAnim");
static_assert(sizeof(InteractionV3FaceAnimInstance_SetFaceIdleAnim) == 0x000008, "Wrong size on InteractionV3FaceAnimInstance_SetFaceIdleAnim");
static_assert(offsetof(InteractionV3FaceAnimInstance_SetFaceIdleAnim, InAnimSequence) == 0x000000, "Member 'InteractionV3FaceAnimInstance_SetFaceIdleAnim::InAnimSequence' has a wrong offset!");

// Function CharacterInteractionV3.InteractionV3FaceAnimInstance.SetMouseFollowEyeOffset
// 0x0008 (0x0008 - 0x0000)
struct InteractionV3FaceAnimInstance_SetMouseFollowEyeOffset final
{
public:
	struct FVector2D                              InMouseFollowEyeOffset;                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionV3FaceAnimInstance_SetMouseFollowEyeOffset) == 0x000004, "Wrong alignment on InteractionV3FaceAnimInstance_SetMouseFollowEyeOffset");
static_assert(sizeof(InteractionV3FaceAnimInstance_SetMouseFollowEyeOffset) == 0x000008, "Wrong size on InteractionV3FaceAnimInstance_SetMouseFollowEyeOffset");
static_assert(offsetof(InteractionV3FaceAnimInstance_SetMouseFollowEyeOffset, InMouseFollowEyeOffset) == 0x000000, "Member 'InteractionV3FaceAnimInstance_SetMouseFollowEyeOffset::InMouseFollowEyeOffset' has a wrong offset!");

// Function CharacterInteractionV3.InteractionV3Event.CanTrigger
// 0x0001 (0x0001 - 0x0000)
struct InteractionV3Event_CanTrigger final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionV3Event_CanTrigger) == 0x000001, "Wrong alignment on InteractionV3Event_CanTrigger");
static_assert(sizeof(InteractionV3Event_CanTrigger) == 0x000001, "Wrong size on InteractionV3Event_CanTrigger");
static_assert(offsetof(InteractionV3Event_CanTrigger, ReturnValue) == 0x000000, "Member 'InteractionV3Event_CanTrigger::ReturnValue' has a wrong offset!");

// Function CharacterInteractionV3.InteractionMouseHoverInterface.OnMouseHover
// 0x0030 (0x0030 - 0x0000)
struct InteractionMouseHoverInterface_OnMouseHover final
{
public:
	TArray<class FName>                           BoneNames;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	const class UCurveFloat*                      CurveScale;                                        // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              SlideVector;                                       // 0x0018(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              SlideStartPos;                                     // 0x0020(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              SlidEndPos;                                        // 0x0028(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionMouseHoverInterface_OnMouseHover) == 0x000008, "Wrong alignment on InteractionMouseHoverInterface_OnMouseHover");
static_assert(sizeof(InteractionMouseHoverInterface_OnMouseHover) == 0x000030, "Wrong size on InteractionMouseHoverInterface_OnMouseHover");
static_assert(offsetof(InteractionMouseHoverInterface_OnMouseHover, BoneNames) == 0x000000, "Member 'InteractionMouseHoverInterface_OnMouseHover::BoneNames' has a wrong offset!");
static_assert(offsetof(InteractionMouseHoverInterface_OnMouseHover, CurveScale) == 0x000010, "Member 'InteractionMouseHoverInterface_OnMouseHover::CurveScale' has a wrong offset!");
static_assert(offsetof(InteractionMouseHoverInterface_OnMouseHover, SlideVector) == 0x000018, "Member 'InteractionMouseHoverInterface_OnMouseHover::SlideVector' has a wrong offset!");
static_assert(offsetof(InteractionMouseHoverInterface_OnMouseHover, SlideStartPos) == 0x000020, "Member 'InteractionMouseHoverInterface_OnMouseHover::SlideStartPos' has a wrong offset!");
static_assert(offsetof(InteractionMouseHoverInterface_OnMouseHover, SlidEndPos) == 0x000028, "Member 'InteractionMouseHoverInterface_OnMouseHover::SlidEndPos' has a wrong offset!");

// Function CharacterInteractionV3.InteractionCameraInstance.AddInput
// 0x0008 (0x0008 - 0x0000)
struct InteractionCameraInstance_AddInput final
{
public:
	struct FVector2D                              Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionCameraInstance_AddInput) == 0x000004, "Wrong alignment on InteractionCameraInstance_AddInput");
static_assert(sizeof(InteractionCameraInstance_AddInput) == 0x000008, "Wrong size on InteractionCameraInstance_AddInput");
static_assert(offsetof(InteractionCameraInstance_AddInput, Value) == 0x000000, "Member 'InteractionCameraInstance_AddInput::Value' has a wrong offset!");

// Function CharacterInteractionV3.InteractionCameraInstance.SetOperateConfig
// 0x0008 (0x0008 - 0x0000)
struct InteractionCameraInstance_SetOperateConfig final
{
public:
	class FName                                   ID;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionCameraInstance_SetOperateConfig) == 0x000004, "Wrong alignment on InteractionCameraInstance_SetOperateConfig");
static_assert(sizeof(InteractionCameraInstance_SetOperateConfig) == 0x000008, "Wrong size on InteractionCameraInstance_SetOperateConfig");
static_assert(offsetof(InteractionCameraInstance_SetOperateConfig, ID) == 0x000000, "Member 'InteractionCameraInstance_SetOperateConfig::ID' has a wrong offset!");

// Function CharacterInteractionV3.InteractionCameraInstance.SetStandbyConfig
// 0x0008 (0x0008 - 0x0000)
struct InteractionCameraInstance_SetStandbyConfig final
{
public:
	class FName                                   ID;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionCameraInstance_SetStandbyConfig) == 0x000004, "Wrong alignment on InteractionCameraInstance_SetStandbyConfig");
static_assert(sizeof(InteractionCameraInstance_SetStandbyConfig) == 0x000008, "Wrong size on InteractionCameraInstance_SetStandbyConfig");
static_assert(offsetof(InteractionCameraInstance_SetStandbyConfig, ID) == 0x000000, "Member 'InteractionCameraInstance_SetStandbyConfig::ID' has a wrong offset!");

// Function CharacterInteractionV3.InteractionV3DragInterface.EndDrag
// 0x0040 (0x0040 - 0x0000)
struct InteractionV3DragInterface_EndDrag final
{
public:
	struct FTransform                             TargetTransform;                                   // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                DeltaLocation;                                     // 0x0030(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InteractionV3DragInterface_EndDrag) == 0x000010, "Wrong alignment on InteractionV3DragInterface_EndDrag");
static_assert(sizeof(InteractionV3DragInterface_EndDrag) == 0x000040, "Wrong size on InteractionV3DragInterface_EndDrag");
static_assert(offsetof(InteractionV3DragInterface_EndDrag, TargetTransform) == 0x000000, "Member 'InteractionV3DragInterface_EndDrag::TargetTransform' has a wrong offset!");
static_assert(offsetof(InteractionV3DragInterface_EndDrag, DeltaLocation) == 0x000030, "Member 'InteractionV3DragInterface_EndDrag::DeltaLocation' has a wrong offset!");

// Function CharacterInteractionV3.InteractionV3DragInterface.StartDrag
// 0x0040 (0x0040 - 0x0000)
struct InteractionV3DragInterface_StartDrag final
{
public:
	struct FTransform                             TargetTransform;                                   // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                DeltaLocation;                                     // 0x0030(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InteractionV3DragInterface_StartDrag) == 0x000010, "Wrong alignment on InteractionV3DragInterface_StartDrag");
static_assert(sizeof(InteractionV3DragInterface_StartDrag) == 0x000040, "Wrong size on InteractionV3DragInterface_StartDrag");
static_assert(offsetof(InteractionV3DragInterface_StartDrag, TargetTransform) == 0x000000, "Member 'InteractionV3DragInterface_StartDrag::TargetTransform' has a wrong offset!");
static_assert(offsetof(InteractionV3DragInterface_StartDrag, DeltaLocation) == 0x000030, "Member 'InteractionV3DragInterface_StartDrag::DeltaLocation' has a wrong offset!");

// Function CharacterInteractionV3.InteractionV3DragInterface.UpdateDrag
// 0x0040 (0x0040 - 0x0000)
struct InteractionV3DragInterface_UpdateDrag final
{
public:
	struct FTransform                             TargetTransform;                                   // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                DeltaLocation;                                     // 0x0030(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InteractionV3DragInterface_UpdateDrag) == 0x000010, "Wrong alignment on InteractionV3DragInterface_UpdateDrag");
static_assert(sizeof(InteractionV3DragInterface_UpdateDrag) == 0x000040, "Wrong size on InteractionV3DragInterface_UpdateDrag");
static_assert(offsetof(InteractionV3DragInterface_UpdateDrag, TargetTransform) == 0x000000, "Member 'InteractionV3DragInterface_UpdateDrag::TargetTransform' has a wrong offset!");
static_assert(offsetof(InteractionV3DragInterface_UpdateDrag, DeltaLocation) == 0x000030, "Member 'InteractionV3DragInterface_UpdateDrag::DeltaLocation' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioLittleGameBase.OnUpdate
// 0x0004 (0x0004 - 0x0000)
struct ScenarioLittleGameBase_OnUpdate final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScenarioLittleGameBase_OnUpdate) == 0x000004, "Wrong alignment on ScenarioLittleGameBase_OnUpdate");
static_assert(sizeof(ScenarioLittleGameBase_OnUpdate) == 0x000004, "Wrong size on ScenarioLittleGameBase_OnUpdate");
static_assert(offsetof(ScenarioLittleGameBase_OnUpdate, DeltaSeconds) == 0x000000, "Member 'ScenarioLittleGameBase_OnUpdate::DeltaSeconds' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioLittleGameBase.Update
// 0x0004 (0x0004 - 0x0000)
struct ScenarioLittleGameBase_Update final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScenarioLittleGameBase_Update) == 0x000004, "Wrong alignment on ScenarioLittleGameBase_Update");
static_assert(sizeof(ScenarioLittleGameBase_Update) == 0x000004, "Wrong size on ScenarioLittleGameBase_Update");
static_assert(offsetof(ScenarioLittleGameBase_Update, DeltaSeconds) == 0x000000, "Member 'ScenarioLittleGameBase_Update::DeltaSeconds' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioLittleGameBase.GetInteractionInputComponent
// 0x0008 (0x0008 - 0x0000)
struct ScenarioLittleGameBase_GetInteractionInputComponent final
{
public:
	class UInteractionInputComponent*             ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScenarioLittleGameBase_GetInteractionInputComponent) == 0x000008, "Wrong alignment on ScenarioLittleGameBase_GetInteractionInputComponent");
static_assert(sizeof(ScenarioLittleGameBase_GetInteractionInputComponent) == 0x000008, "Wrong size on ScenarioLittleGameBase_GetInteractionInputComponent");
static_assert(offsetof(ScenarioLittleGameBase_GetInteractionInputComponent, ReturnValue) == 0x000000, "Member 'ScenarioLittleGameBase_GetInteractionInputComponent::ReturnValue' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioLittleGameBase.GetStateNode
// 0x0008 (0x0008 - 0x0000)
struct ScenarioLittleGameBase_GetStateNode final
{
public:
	class UScenarioStateNode_LittleGame*          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScenarioLittleGameBase_GetStateNode) == 0x000008, "Wrong alignment on ScenarioLittleGameBase_GetStateNode");
static_assert(sizeof(ScenarioLittleGameBase_GetStateNode) == 0x000008, "Wrong size on ScenarioLittleGameBase_GetStateNode");
static_assert(offsetof(ScenarioLittleGameBase_GetStateNode, ReturnValue) == 0x000000, "Member 'ScenarioLittleGameBase_GetStateNode::ReturnValue' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.GameInput
// 0x0018 (0x0018 - 0x0000)
struct ScenarioStandardLittleGame_GameInput final
{
public:
	struct FLittleGameInputEvent                  InputEvent;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScenarioStandardLittleGame_GameInput) == 0x000008, "Wrong alignment on ScenarioStandardLittleGame_GameInput");
static_assert(sizeof(ScenarioStandardLittleGame_GameInput) == 0x000018, "Wrong size on ScenarioStandardLittleGame_GameInput");
static_assert(offsetof(ScenarioStandardLittleGame_GameInput, InputEvent) == 0x000000, "Member 'ScenarioStandardLittleGame_GameInput::InputEvent' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.MouseClick
// 0x0018 (0x0018 - 0x0000)
struct ScenarioStandardLittleGame_MouseClick final
{
public:
	struct FLittleGameInputEvent                  InputEvent;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScenarioStandardLittleGame_MouseClick) == 0x000008, "Wrong alignment on ScenarioStandardLittleGame_MouseClick");
static_assert(sizeof(ScenarioStandardLittleGame_MouseClick) == 0x000018, "Wrong size on ScenarioStandardLittleGame_MouseClick");
static_assert(offsetof(ScenarioStandardLittleGame_MouseClick, InputEvent) == 0x000000, "Member 'ScenarioStandardLittleGame_MouseClick::InputEvent' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.MousePress
// 0x0018 (0x0018 - 0x0000)
struct ScenarioStandardLittleGame_MousePress final
{
public:
	struct FLittleGameInputEvent                  InputEvent;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScenarioStandardLittleGame_MousePress) == 0x000008, "Wrong alignment on ScenarioStandardLittleGame_MousePress");
static_assert(sizeof(ScenarioStandardLittleGame_MousePress) == 0x000018, "Wrong size on ScenarioStandardLittleGame_MousePress");
static_assert(offsetof(ScenarioStandardLittleGame_MousePress, InputEvent) == 0x000000, "Member 'ScenarioStandardLittleGame_MousePress::InputEvent' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.MouseRelease
// 0x0018 (0x0018 - 0x0000)
struct ScenarioStandardLittleGame_MouseRelease final
{
public:
	struct FLittleGameInputEvent                  InputEvent;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScenarioStandardLittleGame_MouseRelease) == 0x000008, "Wrong alignment on ScenarioStandardLittleGame_MouseRelease");
static_assert(sizeof(ScenarioStandardLittleGame_MouseRelease) == 0x000018, "Wrong size on ScenarioStandardLittleGame_MouseRelease");
static_assert(offsetof(ScenarioStandardLittleGame_MouseRelease, InputEvent) == 0x000000, "Member 'ScenarioStandardLittleGame_MouseRelease::InputEvent' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.OnGameInput
// 0x0018 (0x0018 - 0x0000)
struct ScenarioStandardLittleGame_OnGameInput final
{
public:
	struct FLittleGameInputEvent                  InputEvent;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScenarioStandardLittleGame_OnGameInput) == 0x000008, "Wrong alignment on ScenarioStandardLittleGame_OnGameInput");
static_assert(sizeof(ScenarioStandardLittleGame_OnGameInput) == 0x000018, "Wrong size on ScenarioStandardLittleGame_OnGameInput");
static_assert(offsetof(ScenarioStandardLittleGame_OnGameInput, InputEvent) == 0x000000, "Member 'ScenarioStandardLittleGame_OnGameInput::InputEvent' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.OnLookAround
// 0x0004 (0x0004 - 0x0000)
struct ScenarioStandardLittleGame_OnLookAround final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScenarioStandardLittleGame_OnLookAround) == 0x000004, "Wrong alignment on ScenarioStandardLittleGame_OnLookAround");
static_assert(sizeof(ScenarioStandardLittleGame_OnLookAround) == 0x000004, "Wrong size on ScenarioStandardLittleGame_OnLookAround");
static_assert(offsetof(ScenarioStandardLittleGame_OnLookAround, InValue) == 0x000000, "Member 'ScenarioStandardLittleGame_OnLookAround::InValue' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.OnLookUp
// 0x0004 (0x0004 - 0x0000)
struct ScenarioStandardLittleGame_OnLookUp final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScenarioStandardLittleGame_OnLookUp) == 0x000004, "Wrong alignment on ScenarioStandardLittleGame_OnLookUp");
static_assert(sizeof(ScenarioStandardLittleGame_OnLookUp) == 0x000004, "Wrong size on ScenarioStandardLittleGame_OnLookUp");
static_assert(offsetof(ScenarioStandardLittleGame_OnLookUp, InValue) == 0x000000, "Member 'ScenarioStandardLittleGame_OnLookUp::InValue' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.OnMouseClick
// 0x0018 (0x0018 - 0x0000)
struct ScenarioStandardLittleGame_OnMouseClick final
{
public:
	struct FLittleGameInputEvent                  InputEvent;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScenarioStandardLittleGame_OnMouseClick) == 0x000008, "Wrong alignment on ScenarioStandardLittleGame_OnMouseClick");
static_assert(sizeof(ScenarioStandardLittleGame_OnMouseClick) == 0x000018, "Wrong size on ScenarioStandardLittleGame_OnMouseClick");
static_assert(offsetof(ScenarioStandardLittleGame_OnMouseClick, InputEvent) == 0x000000, "Member 'ScenarioStandardLittleGame_OnMouseClick::InputEvent' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.OnMousePress
// 0x0018 (0x0018 - 0x0000)
struct ScenarioStandardLittleGame_OnMousePress final
{
public:
	struct FLittleGameInputEvent                  InputEvent;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScenarioStandardLittleGame_OnMousePress) == 0x000008, "Wrong alignment on ScenarioStandardLittleGame_OnMousePress");
static_assert(sizeof(ScenarioStandardLittleGame_OnMousePress) == 0x000018, "Wrong size on ScenarioStandardLittleGame_OnMousePress");
static_assert(offsetof(ScenarioStandardLittleGame_OnMousePress, InputEvent) == 0x000000, "Member 'ScenarioStandardLittleGame_OnMousePress::InputEvent' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.OnMouseRelease
// 0x0018 (0x0018 - 0x0000)
struct ScenarioStandardLittleGame_OnMouseRelease final
{
public:
	struct FLittleGameInputEvent                  InputEvent;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScenarioStandardLittleGame_OnMouseRelease) == 0x000008, "Wrong alignment on ScenarioStandardLittleGame_OnMouseRelease");
static_assert(sizeof(ScenarioStandardLittleGame_OnMouseRelease) == 0x000018, "Wrong size on ScenarioStandardLittleGame_OnMouseRelease");
static_assert(offsetof(ScenarioStandardLittleGame_OnMouseRelease, InputEvent) == 0x000000, "Member 'ScenarioStandardLittleGame_OnMouseRelease::InputEvent' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.OnMoveForward
// 0x0004 (0x0004 - 0x0000)
struct ScenarioStandardLittleGame_OnMoveForward final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScenarioStandardLittleGame_OnMoveForward) == 0x000004, "Wrong alignment on ScenarioStandardLittleGame_OnMoveForward");
static_assert(sizeof(ScenarioStandardLittleGame_OnMoveForward) == 0x000004, "Wrong size on ScenarioStandardLittleGame_OnMoveForward");
static_assert(offsetof(ScenarioStandardLittleGame_OnMoveForward, InValue) == 0x000000, "Member 'ScenarioStandardLittleGame_OnMoveForward::InValue' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.OnMoveRight
// 0x0004 (0x0004 - 0x0000)
struct ScenarioStandardLittleGame_OnMoveRight final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScenarioStandardLittleGame_OnMoveRight) == 0x000004, "Wrong alignment on ScenarioStandardLittleGame_OnMoveRight");
static_assert(sizeof(ScenarioStandardLittleGame_OnMoveRight) == 0x000004, "Wrong size on ScenarioStandardLittleGame_OnMoveRight");
static_assert(offsetof(ScenarioStandardLittleGame_OnMoveRight, InValue) == 0x000000, "Member 'ScenarioStandardLittleGame_OnMoveRight::InValue' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.PlayShowElement
// 0x0028 (0x0028 - 0x0000)
struct ScenarioStandardLittleGame_PlayShowElement final
{
public:
	class FString                                 ElementName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NextState;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEndLastShowElement;                               // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ScenarioStandardLittleGame_PlayShowElement) == 0x000008, "Wrong alignment on ScenarioStandardLittleGame_PlayShowElement");
static_assert(sizeof(ScenarioStandardLittleGame_PlayShowElement) == 0x000028, "Wrong size on ScenarioStandardLittleGame_PlayShowElement");
static_assert(offsetof(ScenarioStandardLittleGame_PlayShowElement, ElementName) == 0x000000, "Member 'ScenarioStandardLittleGame_PlayShowElement::ElementName' has a wrong offset!");
static_assert(offsetof(ScenarioStandardLittleGame_PlayShowElement, NextState) == 0x000010, "Member 'ScenarioStandardLittleGame_PlayShowElement::NextState' has a wrong offset!");
static_assert(offsetof(ScenarioStandardLittleGame_PlayShowElement, bEndLastShowElement) == 0x000020, "Member 'ScenarioStandardLittleGame_PlayShowElement::bEndLastShowElement' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.PlayShowElementList
// 0x0028 (0x0028 - 0x0000)
struct ScenarioStandardLittleGame_PlayShowElementList final
{
public:
	TArray<class FString>                         InElements;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 NextState;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEndLastShowElement;                               // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ScenarioStandardLittleGame_PlayShowElementList) == 0x000008, "Wrong alignment on ScenarioStandardLittleGame_PlayShowElementList");
static_assert(sizeof(ScenarioStandardLittleGame_PlayShowElementList) == 0x000028, "Wrong size on ScenarioStandardLittleGame_PlayShowElementList");
static_assert(offsetof(ScenarioStandardLittleGame_PlayShowElementList, InElements) == 0x000000, "Member 'ScenarioStandardLittleGame_PlayShowElementList::InElements' has a wrong offset!");
static_assert(offsetof(ScenarioStandardLittleGame_PlayShowElementList, NextState) == 0x000010, "Member 'ScenarioStandardLittleGame_PlayShowElementList::NextState' has a wrong offset!");
static_assert(offsetof(ScenarioStandardLittleGame_PlayShowElementList, bEndLastShowElement) == 0x000020, "Member 'ScenarioStandardLittleGame_PlayShowElementList::bEndLastShowElement' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.SetUIState
// 0x0001 (0x0001 - 0x0000)
struct ScenarioStandardLittleGame_SetUIState final
{
public:
	EScenarioLittleGameUIState                    NewState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScenarioStandardLittleGame_SetUIState) == 0x000001, "Wrong alignment on ScenarioStandardLittleGame_SetUIState");
static_assert(sizeof(ScenarioStandardLittleGame_SetUIState) == 0x000001, "Wrong size on ScenarioStandardLittleGame_SetUIState");
static_assert(offsetof(ScenarioStandardLittleGame_SetUIState, NewState) == 0x000000, "Member 'ScenarioStandardLittleGame_SetUIState::NewState' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.GetCustomGameUI
// 0x0018 (0x0018 - 0x0000)
struct ScenarioStandardLittleGame_GetCustomGameUI final
{
public:
	struct FSoftClassPath                         ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScenarioStandardLittleGame_GetCustomGameUI) == 0x000008, "Wrong alignment on ScenarioStandardLittleGame_GetCustomGameUI");
static_assert(sizeof(ScenarioStandardLittleGame_GetCustomGameUI) == 0x000018, "Wrong size on ScenarioStandardLittleGame_GetCustomGameUI");
static_assert(offsetof(ScenarioStandardLittleGame_GetCustomGameUI, ReturnValue) == 0x000000, "Member 'ScenarioStandardLittleGame_GetCustomGameUI::ReturnValue' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.GetMousePos
// 0x0008 (0x0008 - 0x0000)
struct ScenarioStandardLittleGame_GetMousePos final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScenarioStandardLittleGame_GetMousePos) == 0x000004, "Wrong alignment on ScenarioStandardLittleGame_GetMousePos");
static_assert(sizeof(ScenarioStandardLittleGame_GetMousePos) == 0x000008, "Wrong size on ScenarioStandardLittleGame_GetMousePos");
static_assert(offsetof(ScenarioStandardLittleGame_GetMousePos, ReturnValue) == 0x000000, "Member 'ScenarioStandardLittleGame_GetMousePos::ReturnValue' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.GetUIState
// 0x0001 (0x0001 - 0x0000)
struct ScenarioStandardLittleGame_GetUIState final
{
public:
	EScenarioLittleGameUIState                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScenarioStandardLittleGame_GetUIState) == 0x000001, "Wrong alignment on ScenarioStandardLittleGame_GetUIState");
static_assert(sizeof(ScenarioStandardLittleGame_GetUIState) == 0x000001, "Wrong size on ScenarioStandardLittleGame_GetUIState");
static_assert(offsetof(ScenarioStandardLittleGame_GetUIState, ReturnValue) == 0x000000, "Member 'ScenarioStandardLittleGame_GetUIState::ReturnValue' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.IsBlockInput
// 0x0001 (0x0001 - 0x0000)
struct ScenarioStandardLittleGame_IsBlockInput final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScenarioStandardLittleGame_IsBlockInput) == 0x000001, "Wrong alignment on ScenarioStandardLittleGame_IsBlockInput");
static_assert(sizeof(ScenarioStandardLittleGame_IsBlockInput) == 0x000001, "Wrong size on ScenarioStandardLittleGame_IsBlockInput");
static_assert(offsetof(ScenarioStandardLittleGame_IsBlockInput, ReturnValue) == 0x000000, "Member 'ScenarioStandardLittleGame_IsBlockInput::ReturnValue' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.IsCustomGameUI
// 0x0001 (0x0001 - 0x0000)
struct ScenarioStandardLittleGame_IsCustomGameUI final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScenarioStandardLittleGame_IsCustomGameUI) == 0x000001, "Wrong alignment on ScenarioStandardLittleGame_IsCustomGameUI");
static_assert(sizeof(ScenarioStandardLittleGame_IsCustomGameUI) == 0x000001, "Wrong size on ScenarioStandardLittleGame_IsCustomGameUI");
static_assert(offsetof(ScenarioStandardLittleGame_IsCustomGameUI, ReturnValue) == 0x000000, "Member 'ScenarioStandardLittleGame_IsCustomGameUI::ReturnValue' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.ListenForInputAction
// 0x0020 (0x0020 - 0x0000)
struct ScenarioStandardLittleGame_ListenForInputAction final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   EventType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConsume;                                          // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             Callback;                                          // 0x000C(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScenarioStandardLittleGame_ListenForInputAction) == 0x000004, "Wrong alignment on ScenarioStandardLittleGame_ListenForInputAction");
static_assert(sizeof(ScenarioStandardLittleGame_ListenForInputAction) == 0x000020, "Wrong size on ScenarioStandardLittleGame_ListenForInputAction");
static_assert(offsetof(ScenarioStandardLittleGame_ListenForInputAction, ActionName) == 0x000000, "Member 'ScenarioStandardLittleGame_ListenForInputAction::ActionName' has a wrong offset!");
static_assert(offsetof(ScenarioStandardLittleGame_ListenForInputAction, EventType) == 0x000008, "Member 'ScenarioStandardLittleGame_ListenForInputAction::EventType' has a wrong offset!");
static_assert(offsetof(ScenarioStandardLittleGame_ListenForInputAction, bConsume) == 0x000009, "Member 'ScenarioStandardLittleGame_ListenForInputAction::bConsume' has a wrong offset!");
static_assert(offsetof(ScenarioStandardLittleGame_ListenForInputAction, Callback) == 0x00000C, "Member 'ScenarioStandardLittleGame_ListenForInputAction::Callback' has a wrong offset!");
static_assert(offsetof(ScenarioStandardLittleGame_ListenForInputAction, ReturnValue) == 0x00001C, "Member 'ScenarioStandardLittleGame_ListenForInputAction::ReturnValue' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.ListenForKeyAction
// 0x0030 (0x0030 - 0x0000)
struct ScenarioStandardLittleGame_ListenForKeyAction final
{
public:
	struct FKey                                   InKey;                                             // 0x0000(0x0018)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   EventType;                                         // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConsume;                                          // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             Callback;                                          // 0x001C(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ScenarioStandardLittleGame_ListenForKeyAction) == 0x000008, "Wrong alignment on ScenarioStandardLittleGame_ListenForKeyAction");
static_assert(sizeof(ScenarioStandardLittleGame_ListenForKeyAction) == 0x000030, "Wrong size on ScenarioStandardLittleGame_ListenForKeyAction");
static_assert(offsetof(ScenarioStandardLittleGame_ListenForKeyAction, InKey) == 0x000000, "Member 'ScenarioStandardLittleGame_ListenForKeyAction::InKey' has a wrong offset!");
static_assert(offsetof(ScenarioStandardLittleGame_ListenForKeyAction, EventType) == 0x000018, "Member 'ScenarioStandardLittleGame_ListenForKeyAction::EventType' has a wrong offset!");
static_assert(offsetof(ScenarioStandardLittleGame_ListenForKeyAction, bConsume) == 0x000019, "Member 'ScenarioStandardLittleGame_ListenForKeyAction::bConsume' has a wrong offset!");
static_assert(offsetof(ScenarioStandardLittleGame_ListenForKeyAction, Callback) == 0x00001C, "Member 'ScenarioStandardLittleGame_ListenForKeyAction::Callback' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.PlayShowElementByCallback
// 0x0038 (0x0038 - 0x0000)
struct ScenarioStandardLittleGame_PlayShowElementByCallback final
{
public:
	class FString                                 ElementName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NextState;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             ShowElementPlayFinish;                             // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEndLastShowElement;                               // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ScenarioStandardLittleGame_PlayShowElementByCallback) == 0x000008, "Wrong alignment on ScenarioStandardLittleGame_PlayShowElementByCallback");
static_assert(sizeof(ScenarioStandardLittleGame_PlayShowElementByCallback) == 0x000038, "Wrong size on ScenarioStandardLittleGame_PlayShowElementByCallback");
static_assert(offsetof(ScenarioStandardLittleGame_PlayShowElementByCallback, ElementName) == 0x000000, "Member 'ScenarioStandardLittleGame_PlayShowElementByCallback::ElementName' has a wrong offset!");
static_assert(offsetof(ScenarioStandardLittleGame_PlayShowElementByCallback, NextState) == 0x000010, "Member 'ScenarioStandardLittleGame_PlayShowElementByCallback::NextState' has a wrong offset!");
static_assert(offsetof(ScenarioStandardLittleGame_PlayShowElementByCallback, ShowElementPlayFinish) == 0x000020, "Member 'ScenarioStandardLittleGame_PlayShowElementByCallback::ShowElementPlayFinish' has a wrong offset!");
static_assert(offsetof(ScenarioStandardLittleGame_PlayShowElementByCallback, bEndLastShowElement) == 0x000030, "Member 'ScenarioStandardLittleGame_PlayShowElementByCallback::bEndLastShowElement' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.PlayShowElementListByCallback
// 0x0038 (0x0038 - 0x0000)
struct ScenarioStandardLittleGame_PlayShowElementListByCallback final
{
public:
	TArray<class FString>                         InElements;                                        // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 NextState;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             ShowElementPlayFinish;                             // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEndLastShowElement;                               // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ScenarioStandardLittleGame_PlayShowElementListByCallback) == 0x000008, "Wrong alignment on ScenarioStandardLittleGame_PlayShowElementListByCallback");
static_assert(sizeof(ScenarioStandardLittleGame_PlayShowElementListByCallback) == 0x000038, "Wrong size on ScenarioStandardLittleGame_PlayShowElementListByCallback");
static_assert(offsetof(ScenarioStandardLittleGame_PlayShowElementListByCallback, InElements) == 0x000000, "Member 'ScenarioStandardLittleGame_PlayShowElementListByCallback::InElements' has a wrong offset!");
static_assert(offsetof(ScenarioStandardLittleGame_PlayShowElementListByCallback, NextState) == 0x000010, "Member 'ScenarioStandardLittleGame_PlayShowElementListByCallback::NextState' has a wrong offset!");
static_assert(offsetof(ScenarioStandardLittleGame_PlayShowElementListByCallback, ShowElementPlayFinish) == 0x000020, "Member 'ScenarioStandardLittleGame_PlayShowElementListByCallback::ShowElementPlayFinish' has a wrong offset!");
static_assert(offsetof(ScenarioStandardLittleGame_PlayShowElementListByCallback, bEndLastShowElement) == 0x000030, "Member 'ScenarioStandardLittleGame_PlayShowElementListByCallback::bEndLastShowElement' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.SetInputModeGameAndUI
// 0x0001 (0x0001 - 0x0000)
struct ScenarioStandardLittleGame_SetInputModeGameAndUI final
{
public:
	EMouseLockMode                                MouseLockMode;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScenarioStandardLittleGame_SetInputModeGameAndUI) == 0x000001, "Wrong alignment on ScenarioStandardLittleGame_SetInputModeGameAndUI");
static_assert(sizeof(ScenarioStandardLittleGame_SetInputModeGameAndUI) == 0x000001, "Wrong size on ScenarioStandardLittleGame_SetInputModeGameAndUI");
static_assert(offsetof(ScenarioStandardLittleGame_SetInputModeGameAndUI, MouseLockMode) == 0x000000, "Member 'ScenarioStandardLittleGame_SetInputModeGameAndUI::MouseLockMode' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.StopListenForKeyAction
// 0x0020 (0x0020 - 0x0000)
struct ScenarioStandardLittleGame_StopListenForKeyAction final
{
public:
	struct FKey                                   InKey;                                             // 0x0000(0x0018)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   EventType;                                         // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ScenarioStandardLittleGame_StopListenForKeyAction) == 0x000008, "Wrong alignment on ScenarioStandardLittleGame_StopListenForKeyAction");
static_assert(sizeof(ScenarioStandardLittleGame_StopListenForKeyAction) == 0x000020, "Wrong size on ScenarioStandardLittleGame_StopListenForKeyAction");
static_assert(offsetof(ScenarioStandardLittleGame_StopListenForKeyAction, InKey) == 0x000000, "Member 'ScenarioStandardLittleGame_StopListenForKeyAction::InKey' has a wrong offset!");
static_assert(offsetof(ScenarioStandardLittleGame_StopListenForKeyAction, EventType) == 0x000018, "Member 'ScenarioStandardLittleGame_StopListenForKeyAction::EventType' has a wrong offset!");

// Function CharacterInteractionV3.ScenarioStandardLittleGame.StopListeningForHandle
// 0x0004 (0x0004 - 0x0000)
struct ScenarioStandardLittleGame_StopListeningForHandle final
{
public:
	int32                                         InHandle;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
