#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterMaterialLib

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CharacterMaterialLib.CharacterMaterialLib_C.SetLayerTextureParameter
// 0x0080 (0x0080 - 0x0000)
struct CharacterMaterialLib_C_SetLayerTextureParameter final
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Value;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LayerIndex;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMaterialParameterInfo                 K2Node_MakeStruct_MaterialParameterInfo;           // 0x0028(0x0010)(NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0038(0x0010)(ReferenceParm)
	int32                                         ___int_Array_Index_Variable;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_As______;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterMaterialLib_C_SetLayerTextureParameter) == 0x000008, "Wrong alignment on CharacterMaterialLib_C_SetLayerTextureParameter");
static_assert(sizeof(CharacterMaterialLib_C_SetLayerTextureParameter) == 0x000080, "Wrong size on CharacterMaterialLib_C_SetLayerTextureParameter");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerTextureParameter, MeshComponent) == 0x000000, "Member 'CharacterMaterialLib_C_SetLayerTextureParameter::MeshComponent' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerTextureParameter, Name_0) == 0x000008, "Member 'CharacterMaterialLib_C_SetLayerTextureParameter::Name_0' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerTextureParameter, Value) == 0x000010, "Member 'CharacterMaterialLib_C_SetLayerTextureParameter::Value' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerTextureParameter, LayerIndex) == 0x000018, "Member 'CharacterMaterialLib_C_SetLayerTextureParameter::LayerIndex' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerTextureParameter, __WorldContext) == 0x000020, "Member 'CharacterMaterialLib_C_SetLayerTextureParameter::__WorldContext' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerTextureParameter, K2Node_MakeStruct_MaterialParameterInfo) == 0x000028, "Member 'CharacterMaterialLib_C_SetLayerTextureParameter::K2Node_MakeStruct_MaterialParameterInfo' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerTextureParameter, CallFunc_GetMaterials_ReturnValue) == 0x000038, "Member 'CharacterMaterialLib_C_SetLayerTextureParameter::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerTextureParameter, ___int_Array_Index_Variable) == 0x000048, "Member 'CharacterMaterialLib_C_SetLayerTextureParameter::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerTextureParameter, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'CharacterMaterialLib_C_SetLayerTextureParameter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerTextureParameter, CallFunc_Array_Get_Item) == 0x000050, "Member 'CharacterMaterialLib_C_SetLayerTextureParameter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerTextureParameter, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'CharacterMaterialLib_C_SetLayerTextureParameter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerTextureParameter, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000060, "Member 'CharacterMaterialLib_C_SetLayerTextureParameter::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerTextureParameter, K2Node_DynamicCast_As______) == 0x000068, "Member 'CharacterMaterialLib_C_SetLayerTextureParameter::K2Node_DynamicCast_As______' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerTextureParameter, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'CharacterMaterialLib_C_SetLayerTextureParameter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerTextureParameter, ___int_Loop_Counter_Variable) == 0x000074, "Member 'CharacterMaterialLib_C_SetLayerTextureParameter::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerTextureParameter, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'CharacterMaterialLib_C_SetLayerTextureParameter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerTextureParameter, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'CharacterMaterialLib_C_SetLayerTextureParameter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function CharacterMaterialLib.CharacterMaterialLib_C.SetLayerVectorParameter
// 0x0088 (0x0088 - 0x0000)
struct CharacterMaterialLib_C_SetLayerVectorParameter final
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Value;                                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LayerIndex;                                        // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMaterialParameterInfo                 K2Node_MakeStruct_MaterialParameterInfo;           // 0x0030(0x0010)(NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0040(0x0010)(ReferenceParm)
	int32                                         ___int_Array_Index_Variable;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_As______;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable;                      // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterMaterialLib_C_SetLayerVectorParameter) == 0x000008, "Wrong alignment on CharacterMaterialLib_C_SetLayerVectorParameter");
static_assert(sizeof(CharacterMaterialLib_C_SetLayerVectorParameter) == 0x000088, "Wrong size on CharacterMaterialLib_C_SetLayerVectorParameter");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerVectorParameter, MeshComponent) == 0x000000, "Member 'CharacterMaterialLib_C_SetLayerVectorParameter::MeshComponent' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerVectorParameter, Name_0) == 0x000008, "Member 'CharacterMaterialLib_C_SetLayerVectorParameter::Name_0' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerVectorParameter, Value) == 0x000010, "Member 'CharacterMaterialLib_C_SetLayerVectorParameter::Value' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerVectorParameter, LayerIndex) == 0x000020, "Member 'CharacterMaterialLib_C_SetLayerVectorParameter::LayerIndex' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerVectorParameter, __WorldContext) == 0x000028, "Member 'CharacterMaterialLib_C_SetLayerVectorParameter::__WorldContext' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerVectorParameter, K2Node_MakeStruct_MaterialParameterInfo) == 0x000030, "Member 'CharacterMaterialLib_C_SetLayerVectorParameter::K2Node_MakeStruct_MaterialParameterInfo' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerVectorParameter, CallFunc_GetMaterials_ReturnValue) == 0x000040, "Member 'CharacterMaterialLib_C_SetLayerVectorParameter::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerVectorParameter, ___int_Array_Index_Variable) == 0x000050, "Member 'CharacterMaterialLib_C_SetLayerVectorParameter::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerVectorParameter, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'CharacterMaterialLib_C_SetLayerVectorParameter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerVectorParameter, CallFunc_Array_Get_Item) == 0x000058, "Member 'CharacterMaterialLib_C_SetLayerVectorParameter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerVectorParameter, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'CharacterMaterialLib_C_SetLayerVectorParameter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerVectorParameter, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000068, "Member 'CharacterMaterialLib_C_SetLayerVectorParameter::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerVectorParameter, K2Node_DynamicCast_As______) == 0x000070, "Member 'CharacterMaterialLib_C_SetLayerVectorParameter::K2Node_DynamicCast_As______' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerVectorParameter, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'CharacterMaterialLib_C_SetLayerVectorParameter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerVectorParameter, ___int_Loop_Counter_Variable) == 0x00007C, "Member 'CharacterMaterialLib_C_SetLayerVectorParameter::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerVectorParameter, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'CharacterMaterialLib_C_SetLayerVectorParameter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerVectorParameter, CallFunc_Add_IntInt_ReturnValue) == 0x000084, "Member 'CharacterMaterialLib_C_SetLayerVectorParameter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function CharacterMaterialLib.CharacterMaterialLib_C.SetLayerScalarParameter
// 0x0078 (0x0078 - 0x0000)
struct CharacterMaterialLib_C_SetLayerScalarParameter final
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LayerIndex;                                        // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMaterialParameterInfo                 K2Node_MakeStruct_MaterialParameterInfo;           // 0x0020(0x0010)(NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0030(0x0010)(ReferenceParm)
	int32                                         ___int_Array_Index_Variable;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_As______;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable;                      // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterMaterialLib_C_SetLayerScalarParameter) == 0x000008, "Wrong alignment on CharacterMaterialLib_C_SetLayerScalarParameter");
static_assert(sizeof(CharacterMaterialLib_C_SetLayerScalarParameter) == 0x000078, "Wrong size on CharacterMaterialLib_C_SetLayerScalarParameter");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerScalarParameter, MeshComponent) == 0x000000, "Member 'CharacterMaterialLib_C_SetLayerScalarParameter::MeshComponent' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerScalarParameter, Name_0) == 0x000008, "Member 'CharacterMaterialLib_C_SetLayerScalarParameter::Name_0' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerScalarParameter, Value) == 0x000010, "Member 'CharacterMaterialLib_C_SetLayerScalarParameter::Value' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerScalarParameter, LayerIndex) == 0x000014, "Member 'CharacterMaterialLib_C_SetLayerScalarParameter::LayerIndex' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerScalarParameter, __WorldContext) == 0x000018, "Member 'CharacterMaterialLib_C_SetLayerScalarParameter::__WorldContext' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerScalarParameter, K2Node_MakeStruct_MaterialParameterInfo) == 0x000020, "Member 'CharacterMaterialLib_C_SetLayerScalarParameter::K2Node_MakeStruct_MaterialParameterInfo' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerScalarParameter, CallFunc_GetMaterials_ReturnValue) == 0x000030, "Member 'CharacterMaterialLib_C_SetLayerScalarParameter::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerScalarParameter, ___int_Array_Index_Variable) == 0x000040, "Member 'CharacterMaterialLib_C_SetLayerScalarParameter::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerScalarParameter, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'CharacterMaterialLib_C_SetLayerScalarParameter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerScalarParameter, CallFunc_Array_Get_Item) == 0x000048, "Member 'CharacterMaterialLib_C_SetLayerScalarParameter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerScalarParameter, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'CharacterMaterialLib_C_SetLayerScalarParameter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerScalarParameter, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000058, "Member 'CharacterMaterialLib_C_SetLayerScalarParameter::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerScalarParameter, K2Node_DynamicCast_As______) == 0x000060, "Member 'CharacterMaterialLib_C_SetLayerScalarParameter::K2Node_DynamicCast_As______' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerScalarParameter, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'CharacterMaterialLib_C_SetLayerScalarParameter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerScalarParameter, ___int_Loop_Counter_Variable) == 0x00006C, "Member 'CharacterMaterialLib_C_SetLayerScalarParameter::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerScalarParameter, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'CharacterMaterialLib_C_SetLayerScalarParameter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_SetLayerScalarParameter, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'CharacterMaterialLib_C_SetLayerScalarParameter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function CharacterMaterialLib.CharacterMaterialLib_C.UpdateEyeSpecularLight
// 0x00B8 (0x00B8 - 0x0000)
struct CharacterMaterialLib_C_UpdateEyeSpecularLight final
{
public:
	class USkeletalMeshComponent*                 FaceSkm;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EyeMatID;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        EyeSpecularLightPos;                               // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0080(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_As______;                       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable;                      // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterMaterialLib_C_UpdateEyeSpecularLight) == 0x000008, "Wrong alignment on CharacterMaterialLib_C_UpdateEyeSpecularLight");
static_assert(sizeof(CharacterMaterialLib_C_UpdateEyeSpecularLight) == 0x0000B8, "Wrong size on CharacterMaterialLib_C_UpdateEyeSpecularLight");
static_assert(offsetof(CharacterMaterialLib_C_UpdateEyeSpecularLight, FaceSkm) == 0x000000, "Member 'CharacterMaterialLib_C_UpdateEyeSpecularLight::FaceSkm' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_UpdateEyeSpecularLight, EyeMatID) == 0x000008, "Member 'CharacterMaterialLib_C_UpdateEyeSpecularLight::EyeMatID' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_UpdateEyeSpecularLight, EyeSpecularLightPos) == 0x000010, "Member 'CharacterMaterialLib_C_UpdateEyeSpecularLight::EyeSpecularLightPos' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_UpdateEyeSpecularLight, __WorldContext) == 0x000020, "Member 'CharacterMaterialLib_C_UpdateEyeSpecularLight::__WorldContext' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_UpdateEyeSpecularLight, ___int_Array_Index_Variable) == 0x000028, "Member 'CharacterMaterialLib_C_UpdateEyeSpecularLight::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_UpdateEyeSpecularLight, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'CharacterMaterialLib_C_UpdateEyeSpecularLight::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_UpdateEyeSpecularLight, CallFunc_Array_Get_Item) == 0x000030, "Member 'CharacterMaterialLib_C_UpdateEyeSpecularLight::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_UpdateEyeSpecularLight, CallFunc_Conv_IntToString_ReturnValue) == 0x000040, "Member 'CharacterMaterialLib_C_UpdateEyeSpecularLight::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_UpdateEyeSpecularLight, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000050, "Member 'CharacterMaterialLib_C_UpdateEyeSpecularLight::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_UpdateEyeSpecularLight, CallFunc_Concat_StrStr_ReturnValue) == 0x000060, "Member 'CharacterMaterialLib_C_UpdateEyeSpecularLight::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_UpdateEyeSpecularLight, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000070, "Member 'CharacterMaterialLib_C_UpdateEyeSpecularLight::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_UpdateEyeSpecularLight, CallFunc_GetMaterials_ReturnValue) == 0x000080, "Member 'CharacterMaterialLib_C_UpdateEyeSpecularLight::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_UpdateEyeSpecularLight, CallFunc_Conv_StringToName_ReturnValue) == 0x000090, "Member 'CharacterMaterialLib_C_UpdateEyeSpecularLight::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_UpdateEyeSpecularLight, CallFunc_Array_Get_Item_1) == 0x000098, "Member 'CharacterMaterialLib_C_UpdateEyeSpecularLight::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_UpdateEyeSpecularLight, K2Node_DynamicCast_As______) == 0x0000A0, "Member 'CharacterMaterialLib_C_UpdateEyeSpecularLight::K2Node_DynamicCast_As______' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_UpdateEyeSpecularLight, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'CharacterMaterialLib_C_UpdateEyeSpecularLight::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_UpdateEyeSpecularLight, ___int_Loop_Counter_Variable) == 0x0000AC, "Member 'CharacterMaterialLib_C_UpdateEyeSpecularLight::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_UpdateEyeSpecularLight, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'CharacterMaterialLib_C_UpdateEyeSpecularLight::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_UpdateEyeSpecularLight, CallFunc_Add_IntInt_ReturnValue) == 0x0000B4, "Member 'CharacterMaterialLib_C_UpdateEyeSpecularLight::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function CharacterMaterialLib.CharacterMaterialLib_C.UpdateFaceVectorFromBoneTransform
// 0x0100 (0x0100 - 0x0000)
struct CharacterMaterialLib_C_UpdateFaceVectorFromBoneTransform final
{
public:
	class USkeletalMeshComponent*                 FaceSkm;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FaceMatID;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERelativeTransformSpace                       TransformSpace;                                    // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0020(0x0010)(ReferenceParm)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_As______;                       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterMaterialLib_C_UpdateFaceVectorFromBoneTransform) == 0x000010, "Wrong alignment on CharacterMaterialLib_C_UpdateFaceVectorFromBoneTransform");
static_assert(sizeof(CharacterMaterialLib_C_UpdateFaceVectorFromBoneTransform) == 0x000100, "Wrong size on CharacterMaterialLib_C_UpdateFaceVectorFromBoneTransform");
static_assert(offsetof(CharacterMaterialLib_C_UpdateFaceVectorFromBoneTransform, FaceSkm) == 0x000000, "Member 'CharacterMaterialLib_C_UpdateFaceVectorFromBoneTransform::FaceSkm' has a wrong offset!");
static_assert(offsetof(CharacterMaterialLib_C_UpdateFaceVectorFromBoneTransform, FaceMatID) == 0x000008, "Member 'CharacterMaterialLib_C_UpdateFaceVectorFromBoneTransform::FaceMatID' has a wrong offset!");
