#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterAccompany

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CharacterAccompany_structs.hpp"


namespace SDK::Params
{

// Function CharacterAccompany.AccompanyCameraActor.SetStandbyConfig
// 0x0008 (0x0008 - 0x0000)
struct AccompanyCameraActor_SetStandbyConfig final
{
public:
	class FName                                   ID;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AccompanyCameraActor_SetStandbyConfig;

// Function CharacterAccompany.AccompanyCameraActor.AddInput
// 0x0008 (0x0008 - 0x0000)
struct AccompanyCameraActor_AddInput final
{
public:
	struct FVector2D                              InValue;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AccompanyCameraActor_AddInput;

// Function CharacterAccompany.AccompanyCameraActor.AddZoomFactor
// 0x0004 (0x0004 - 0x0000)
struct AccompanyCameraActor_AddZoomFactor final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AccompanyCameraActor_AddZoomFactor;

// Function CharacterAccompany.AccompanyCameraActor.IsActiveCamera
// 0x0001 (0x0001 - 0x0000)
struct AccompanyCameraActor_IsActiveCamera final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AccompanyCameraActor_IsActiveCamera;

// Function CharacterAccompany.AccompanyCameraInstance.AddInput
// 0x0008 (0x0008 - 0x0000)
struct AccompanyCameraInstance_AddInput final
{
public:
	struct FVector2D                              Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AccompanyCameraInstance_AddInput;

// Function CharacterAccompany.AccompanyCameraInstance.AddZoomFactor
// 0x0004 (0x0004 - 0x0000)
struct AccompanyCameraInstance_AddZoomFactor final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AccompanyCameraInstance_AddZoomFactor;

// Function CharacterAccompany.AccompanyCameraInstance.SetStandbyConfig
// 0x0008 (0x0008 - 0x0000)
struct AccompanyCameraInstance_SetStandbyConfig final
{
public:
	class FName                                   ID;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AccompanyCameraInstance_SetStandbyConfig;

// Function CharacterAccompany.AccompanySystemV2.BP_HandleSelectTopicOption
// 0x0004 (0x0004 - 0x0000)
struct AccompanySystemV2_BP_HandleSelectTopicOption final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AccompanySystemV2_BP_HandleSelectTopicOption;

// Function CharacterAccompany.AccompanySystemV2.ExitAccompany
// 0x0004 (0x0004 - 0x0000)
struct AccompanySystemV2_ExitAccompany final
{
public:
	float                                         AccompanyTime;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AccompanySystemV2_ExitAccompany;

// Function CharacterAccompany.AccompanySystemV2.GetAccompanyCharacter
// 0x0010 (0x0010 - 0x0000)
struct AccompanySystemV2_GetAccompanyCharacter final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACharacter*                             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AccompanySystemV2_GetAccompanyCharacter;

// Function CharacterAccompany.AccompanySystemV2.GetRunTimeConfig
// 0x0008 (0x0008 - 0x0000)
struct AccompanySystemV2_GetRunTimeConfig final
{
public:
	class UAccompanySystemDataAsset*              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AccompanySystemV2_GetRunTimeConfig;

// Function CharacterAccompany.AccompanySystemV2.HandleAccompanyTime
// 0x0004 (0x0004 - 0x0000)
struct AccompanySystemV2_HandleAccompanyTime final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AccompanySystemV2_HandleAccompanyTime;

// Function CharacterAccompany.AccompanySystemV2.HandleSelectTopicOption
// 0x0004 (0x0004 - 0x0000)
struct AccompanySystemV2_HandleSelectTopicOption final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AccompanySystemV2_HandleSelectTopicOption;

// Function CharacterAccompany.AccompanySystemV2.SetAccomState
// 0x0001 (0x0001 - 0x0000)
struct AccompanySystemV2_SetAccomState final
{
public:
	EAccompanyState                               NewState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AccompanySystemV2_SetAccomState;

// Function CharacterAccompany.AccompanySystemV2.TickLeaveStandBy
// 0x0004 (0x0004 - 0x0000)
struct AccompanySystemV2_TickLeaveStandBy final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AccompanySystemV2_TickLeaveStandBy;

// Function CharacterAccompany.AccompanySystemV2.TickStandBy
// 0x0004 (0x0004 - 0x0000)
struct AccompanySystemV2_TickStandBy final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AccompanySystemV2_TickStandBy;

// Function CharacterAccompany.AccompanySystemV2.BP_TickLeaveStandBy
// 0x0004 (0x0004 - 0x0000)
struct AccompanySystemV2_BP_TickLeaveStandBy final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AccompanySystemV2_BP_TickLeaveStandBy;

// Function CharacterAccompany.AccompanySystemV2.BP_TickStandBy
// 0x0004 (0x0004 - 0x0000)
struct AccompanySystemV2_BP_TickStandBy final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AccompanySystemV2_BP_TickStandBy;

// Function CharacterAccompany.AccompanySystemV2.CheckCanTransToStandBy
// 0x0001 (0x0001 - 0x0000)
struct AccompanySystemV2_CheckCanTransToStandBy final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AccompanySystemV2_CheckCanTransToStandBy;

// Function CharacterAccompany.AccompanySystemV2.GetAccompanyActorByName
// 0x0010 (0x0010 - 0x0000)
struct AccompanySystemV2_GetAccompanyActorByName final
{
public:
	class FName                                   ActorName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AccompanySystemV2_GetAccompanyActorByName;

// Function CharacterAccompany.AccomCheckCondition.CheckAccomCondition
// 0x0010 (0x0010 - 0x0000)
struct AccomCheckCondition_CheckAccomCondition final
{
public:
	class AAccompanySystemV2*                     AccompanySystem;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AccomCheckCondition_CheckAccomCondition;

// Function CharacterAccompany.AcompanyCharacterV2.GetResNameDec
// 0x0010 (0x0010 - 0x0000)
struct AcompanyCharacterV2_GetResNameDec final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AcompanyCharacterV2_GetResNameDec;

// Function CharacterAccompany.AcompanyCharacterV2.K2_GetMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct AcompanyCharacterV2_K2_GetMeshComponent final
{
public:
	class UMeshComponent*                         ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AcompanyCharacterV2_K2_GetMeshComponent;

}

