#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterAccompany

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CameraBlueprint_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CharacterInteractionV3_structs.hpp"
#include "CharacterAccompany_structs.hpp"


namespace SDK
{

// Class CharacterAccompany.AccomBindSkeletalMeshAnimNotify
// 0x00B8 (0x00E8 - 0x0030)
class UAccomBindSkeletalMeshAnimNotify final : public UAnimNotifyState
{
public:
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimationAsset*                        Sequence;                                          // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShouldBeginPos;                                    // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x0044(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttach;                                           // 0x0045(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Socket;                                            // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocationOffset;                                    // 0x0050(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RotatorOffset;                                     // 0x005C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Scale;                                             // 0x0068(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SkmUseAttachedParentBound;                         // 0x0074(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SkmBoundScale;                                     // 0x0078(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TickPosOnBegin;                                    // 0x007C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SkmPlayMontage;                                    // 0x007D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAnimInstance>              AnimClass;                                         // 0x0080(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           TargetMontage;                                     // 0x0088(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<TWeakObjectPtr<class USkeletalMeshComponent>, class ASkeletalMeshActor*> MeshActors;        // 0x0090(0x0050)(BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)
	bool                                          AddCharacterRenderCom;                             // 0x00E0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AccomBindSkeletalMeshAnimNotify")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AccomBindSkeletalMeshAnimNotify")
	}
	static class UAccomBindSkeletalMeshAnimNotify* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAccomBindSkeletalMeshAnimNotify>();
	}
};
DUMPER7_ASSERTS_UAccomBindSkeletalMeshAnimNotify;

// Class CharacterAccompany.AccomBlueprintFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UAccomBlueprintFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AccomBlueprintFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AccomBlueprintFunctionLibrary")
	}
	static class UAccomBlueprintFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAccomBlueprintFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UAccomBlueprintFunctionLibrary;

// Class CharacterAccompany.AccompanyCameraActor
// 0x0638 (0x0860 - 0x0228)
class AAccompanyCameraActor final : public AActor
{
public:
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCameraInstance>            CameraBlueprintClass;                              // 0x0230(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                CameraPos;                                         // 0x0238(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               CameraRot;                                         // 0x0244(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bActiveCamera;                                     // 0x0250(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_251[0xF];                                      // 0x0251(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMinimalViewInfo                       DefaultViewInfo;                                   // 0x0260(0x05F0)(Transient, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AActor>                  LastViewTarget;                                    // 0x0850(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_858[0x8];                                      // 0x0858(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActiveCamera();
	void DisableCamera();
	void SetStandbyConfig(class FName ID);

	void AddInput(const struct FVector2D& InValue) const;
	void AddZoomFactor(float Value) const;
	bool IsActiveCamera() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AccompanyCameraActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AccompanyCameraActor")
	}
	static class AAccompanyCameraActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAccompanyCameraActor>();
	}
};
DUMPER7_ASSERTS_AAccompanyCameraActor;

// Class CharacterAccompany.AccompanyCameraInstance
// 0x0140 (0x04E0 - 0x03A0)
class UAccompanyCameraInstance final : public UCameraInstance
{
public:
	struct FInteractionCameraModifierInfo         AccompanyModifierInfo;                             // 0x03A0(0x0028)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	float                                         MaxCameraZoomFactor;                               // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraZoomFactorMultiplier;                        // 0x03CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraZoomFactor;                                  // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D4[0xC];                                      // 0x03D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStandbyCameraConfig                   StandbyCameraConfig;                               // 0x03E0(0x00F0)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4D0[0x10];                                     // 0x04D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddInput(const struct FVector2D& Value);
	void AddZoomFactor(float Value);
	void SetStandbyConfig(class FName ID);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AccompanyCameraInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AccompanyCameraInstance")
	}
	static class UAccompanyCameraInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAccompanyCameraInstance>();
	}
};
DUMPER7_ASSERTS_UAccompanyCameraInstance;

// Class CharacterAccompany.AccompanyHeadAnimInstance
// 0x0020 (0x02E0 - 0x02C0)
class UAccompanyHeadAnimInstance final : public UAnimInstance
{
public:
	struct FVector2D                              EyeFollowScreenPos;                                // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              MouseFollowEyeOffset;                              // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseLipSync;                                       // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RangeFactor;                                       // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                            EyeBlend;                                          // 0x02D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D8[0x8];                                      // 0x02D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AccompanyHeadAnimInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AccompanyHeadAnimInstance")
	}
	static class UAccompanyHeadAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAccompanyHeadAnimInstance>();
	}
};
DUMPER7_ASSERTS_UAccompanyHeadAnimInstance;

// Class CharacterAccompany.AccompanySystemV2
// 0x0080 (0x02A8 - 0x0228)
class AAccompanySystemV2 final : public AActor
{
public:
	TMap<class FName, class AActor*>              AccompanyActors;                                   // 0x0228(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bPauseAccom;                                       // 0x0278(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(EAccompanyState NewAccompanyState)> StateChangedDelegate;          // 0x0280(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	EAccompanyState                               AccompanyState;                                    // 0x0290(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAccompanyState                               LastAccompanyState;                                // 0x0291(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_292[0x2];                                      // 0x0292(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EnterLeaveStandByCounter;                          // 0x0294(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EnterLeaveStandByTime;                             // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bReadyToEnterStandby;                              // 0x029C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bReadyToEnterLeaveStandby;                         // 0x029D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnteringStandbyFromLeave;                         // 0x029E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29F[0x1];                                      // 0x029F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EnterTopicCount;                                   // 0x02A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_HandleSelectTopicOption(int32 ID);
	void BP_HandleSkipCartoon();
	void BP_HandleThreeClick();
	void BP_PlayVoice();
	void EnterLeaveStandBy();
	void EnterStandBy();
	void ExitAccompany(float AccompanyTime);
	void ExitLeaveStandBy();
	void ExitStandBy();
	class ACharacter* GetAccompanyCharacter(class FName Name_0);
	class UAccompanySystemDataAsset* GetRunTimeConfig();
	void HandleAccompanyTime(int32 ID);
	void HandleSelectTopicOption(int32 ID);
	void InitSystem();
	void PauseAccomSystem();
	void PlayVoice();
	void ResumeAccomSystem();
	void SetAccomState(EAccompanyState NewState);
	void StartAccomTopic();
	void TickLeaveStandBy(float DeltaSeconds);
	void TickStandBy(float DeltaSeconds);

	void BP_EnterLeaveStandBy() const;
	void BP_EnterStandBy() const;
	void BP_HandleEventReminder() const;
	void BP_TickLeaveStandBy(float DeltaSeconds) const;
	void BP_TickStandBy(float DeltaSeconds) const;
	bool CheckCanTransToStandBy() const;
	class AActor* GetAccompanyActorByName(class FName ActorName) const;
	void StartAccompany() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AccompanySystemV2")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AccompanySystemV2")
	}
	static class AAccompanySystemV2* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAccompanySystemV2>();
	}
};
DUMPER7_ASSERTS_AAccompanySystemV2;

// Class CharacterAccompany.AccomCheckCondition
// 0x0000 (0x0028 - 0x0028)
class UAccomCheckCondition final : public UObject
{
public:
	bool CheckAccomCondition(class AAccompanySystemV2* AccompanySystem);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AccomCheckCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AccomCheckCondition")
	}
	static class UAccomCheckCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAccomCheckCondition>();
	}
};
DUMPER7_ASSERTS_UAccomCheckCondition;

// Class CharacterAccompany.AccompanySystemDataAsset
// 0x0200 (0x0230 - 0x0030)
class UAccompanySystemDataAsset final : public UDataAsset
{
public:
	struct FAccompanySystemRuntimeConfig          AccompanySystemRuntimeConfig;                      // 0x0030(0x0180)(Edit, BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TMap<class FName, struct FAccompanySystemAnimConfig> AccompanySystemAnimConfigs;                 // 0x01B0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FAccompanySystemCartoonConfig          AccompanySystemCartoonConfig;                      // 0x0200(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AccompanySystemDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AccompanySystemDataAsset")
	}
	static class UAccompanySystemDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAccompanySystemDataAsset>();
	}
};
DUMPER7_ASSERTS_UAccompanySystemDataAsset;

// Class CharacterAccompany.AcompanyCharacterV2
// 0x0020 (0x04E0 - 0x04C0)
class AAcompanyCharacterV2 final : public ACharacter
{
public:
	class FString                                 NameDec;                                           // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 FaceComponent;                                     // 0x04C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOVRLipSyncPlaybackActorComponent*      LipSyncComponent;                                  // 0x04D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4D8[0x8];                                      // 0x04D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FString GetResNameDec();
	class UMeshComponent* K2_GetMeshComponent();
	void OnLipSyncDataReady();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AcompanyCharacterV2")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AcompanyCharacterV2")
	}
	static class AAcompanyCharacterV2* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAcompanyCharacterV2>();
	}
};
DUMPER7_ASSERTS_AAcompanyCharacterV2;

}

