#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterInteraction

#include "Basic.hpp"

#include "CharacterInteraction_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "PhysicsControl_structs.hpp"


namespace SDK::Params
{

// Function CharacterInteraction.InteractionArchivementComponent.GetEggLevelSeqs
// 0x0010 (0x0010 - 0x0000)
struct InteractionArchivementComponent_GetEggLevelSeqs final
{
public:
	TArray<class ULevelSequence*>                 OutLevelSeqs;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionArchivementComponent_GetEggLevelSeqs) == 0x000008, "Wrong alignment on InteractionArchivementComponent_GetEggLevelSeqs");
static_assert(sizeof(InteractionArchivementComponent_GetEggLevelSeqs) == 0x000010, "Wrong size on InteractionArchivementComponent_GetEggLevelSeqs");
static_assert(offsetof(InteractionArchivementComponent_GetEggLevelSeqs, OutLevelSeqs) == 0x000000, "Member 'InteractionArchivementComponent_GetEggLevelSeqs::OutLevelSeqs' has a wrong offset!");

// Function CharacterInteraction.InteractionArchivementComponent.SetArchievementPlayed
// 0x0004 (0x0004 - 0x0000)
struct InteractionArchivementComponent_SetArchievementPlayed final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionArchivementComponent_SetArchievementPlayed) == 0x000004, "Wrong alignment on InteractionArchivementComponent_SetArchievementPlayed");
static_assert(sizeof(InteractionArchivementComponent_SetArchievementPlayed) == 0x000004, "Wrong size on InteractionArchivementComponent_SetArchievementPlayed");
static_assert(offsetof(InteractionArchivementComponent_SetArchievementPlayed, ID) == 0x000000, "Member 'InteractionArchivementComponent_SetArchievementPlayed::ID' has a wrong offset!");

// Function CharacterInteraction.InteractionArchivementComponent.SetArchivementComplete
// 0x0004 (0x0004 - 0x0000)
struct InteractionArchivementComponent_SetArchivementComplete final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionArchivementComponent_SetArchivementComplete) == 0x000004, "Wrong alignment on InteractionArchivementComponent_SetArchivementComplete");
static_assert(sizeof(InteractionArchivementComponent_SetArchivementComplete) == 0x000004, "Wrong size on InteractionArchivementComponent_SetArchivementComplete");
static_assert(offsetof(InteractionArchivementComponent_SetArchivementComplete, ID) == 0x000000, "Member 'InteractionArchivementComponent_SetArchivementComplete::ID' has a wrong offset!");

// Function CharacterInteraction.InteractionArchivementComponent.SetConditionComplete
// 0x0004 (0x0004 - 0x0000)
struct InteractionArchivementComponent_SetConditionComplete final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionArchivementComponent_SetConditionComplete) == 0x000004, "Wrong alignment on InteractionArchivementComponent_SetConditionComplete");
static_assert(sizeof(InteractionArchivementComponent_SetConditionComplete) == 0x000004, "Wrong size on InteractionArchivementComponent_SetConditionComplete");
static_assert(offsetof(InteractionArchivementComponent_SetConditionComplete, ID) == 0x000000, "Member 'InteractionArchivementComponent_SetConditionComplete::ID' has a wrong offset!");

// Function CharacterInteraction.InteractionArchivementComponent.SetConditionCompleteAdnRefresh
// 0x0004 (0x0004 - 0x0000)
struct InteractionArchivementComponent_SetConditionCompleteAdnRefresh final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionArchivementComponent_SetConditionCompleteAdnRefresh) == 0x000004, "Wrong alignment on InteractionArchivementComponent_SetConditionCompleteAdnRefresh");
static_assert(sizeof(InteractionArchivementComponent_SetConditionCompleteAdnRefresh) == 0x000004, "Wrong size on InteractionArchivementComponent_SetConditionCompleteAdnRefresh");
static_assert(offsetof(InteractionArchivementComponent_SetConditionCompleteAdnRefresh, ID) == 0x000000, "Member 'InteractionArchivementComponent_SetConditionCompleteAdnRefresh::ID' has a wrong offset!");

// Function CharacterInteraction.InteractionArchivementComponent.IsArchivementComplete
// 0x0008 (0x0008 - 0x0000)
struct InteractionArchivementComponent_IsArchivementComplete final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InteractionArchivementComponent_IsArchivementComplete) == 0x000004, "Wrong alignment on InteractionArchivementComponent_IsArchivementComplete");
static_assert(sizeof(InteractionArchivementComponent_IsArchivementComplete) == 0x000008, "Wrong size on InteractionArchivementComponent_IsArchivementComplete");
static_assert(offsetof(InteractionArchivementComponent_IsArchivementComplete, ID) == 0x000000, "Member 'InteractionArchivementComponent_IsArchivementComplete::ID' has a wrong offset!");
static_assert(offsetof(InteractionArchivementComponent_IsArchivementComplete, ReturnValue) == 0x000004, "Member 'InteractionArchivementComponent_IsArchivementComplete::ReturnValue' has a wrong offset!");

// Function CharacterInteraction.InteractionArchivementComponent.IsArchivementPlayed
// 0x0008 (0x0008 - 0x0000)
struct InteractionArchivementComponent_IsArchivementPlayed final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InteractionArchivementComponent_IsArchivementPlayed) == 0x000004, "Wrong alignment on InteractionArchivementComponent_IsArchivementPlayed");
static_assert(sizeof(InteractionArchivementComponent_IsArchivementPlayed) == 0x000008, "Wrong size on InteractionArchivementComponent_IsArchivementPlayed");
static_assert(offsetof(InteractionArchivementComponent_IsArchivementPlayed, ID) == 0x000000, "Member 'InteractionArchivementComponent_IsArchivementPlayed::ID' has a wrong offset!");
static_assert(offsetof(InteractionArchivementComponent_IsArchivementPlayed, ReturnValue) == 0x000004, "Member 'InteractionArchivementComponent_IsArchivementPlayed::ReturnValue' has a wrong offset!");

// Function CharacterInteraction.InteractionArchivementComponent.IsConditionComplete
// 0x0008 (0x0008 - 0x0000)
struct InteractionArchivementComponent_IsConditionComplete final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InteractionArchivementComponent_IsConditionComplete) == 0x000004, "Wrong alignment on InteractionArchivementComponent_IsConditionComplete");
static_assert(sizeof(InteractionArchivementComponent_IsConditionComplete) == 0x000008, "Wrong size on InteractionArchivementComponent_IsConditionComplete");
static_assert(offsetof(InteractionArchivementComponent_IsConditionComplete, ID) == 0x000000, "Member 'InteractionArchivementComponent_IsConditionComplete::ID' has a wrong offset!");
static_assert(offsetof(InteractionArchivementComponent_IsConditionComplete, ReturnValue) == 0x000004, "Member 'InteractionArchivementComponent_IsConditionComplete::ReturnValue' has a wrong offset!");

// Function CharacterInteraction.CharacterInteractionComponent.GetInteractionAnimInstance
// 0x0008 (0x0008 - 0x0000)
struct CharacterInteractionComponent_GetInteractionAnimInstance final
{
public:
	class UInteractionAnimInstance*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterInteractionComponent_GetInteractionAnimInstance) == 0x000008, "Wrong alignment on CharacterInteractionComponent_GetInteractionAnimInstance");
static_assert(sizeof(CharacterInteractionComponent_GetInteractionAnimInstance) == 0x000008, "Wrong size on CharacterInteractionComponent_GetInteractionAnimInstance");
static_assert(offsetof(CharacterInteractionComponent_GetInteractionAnimInstance, ReturnValue) == 0x000000, "Member 'CharacterInteractionComponent_GetInteractionAnimInstance::ReturnValue' has a wrong offset!");

// Function CharacterInteraction.CharacterInteractionComponent.GetInteractionHeadAnimInstance
// 0x0008 (0x0008 - 0x0000)
struct CharacterInteractionComponent_GetInteractionHeadAnimInstance final
{
public:
	class UInteractionHeadAnimInstance*           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterInteractionComponent_GetInteractionHeadAnimInstance) == 0x000008, "Wrong alignment on CharacterInteractionComponent_GetInteractionHeadAnimInstance");
static_assert(sizeof(CharacterInteractionComponent_GetInteractionHeadAnimInstance) == 0x000008, "Wrong size on CharacterInteractionComponent_GetInteractionHeadAnimInstance");
static_assert(offsetof(CharacterInteractionComponent_GetInteractionHeadAnimInstance, ReturnValue) == 0x000000, "Member 'CharacterInteractionComponent_GetInteractionHeadAnimInstance::ReturnValue' has a wrong offset!");

// Function CharacterInteraction.CharacterInteractionComponent.PlayShowSequence
// 0x0004 (0x0004 - 0x0000)
struct CharacterInteractionComponent_PlayShowSequence final
{
public:
	int32                                         ShowSequenceID;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterInteractionComponent_PlayShowSequence) == 0x000004, "Wrong alignment on CharacterInteractionComponent_PlayShowSequence");
static_assert(sizeof(CharacterInteractionComponent_PlayShowSequence) == 0x000004, "Wrong size on CharacterInteractionComponent_PlayShowSequence");
static_assert(offsetof(CharacterInteractionComponent_PlayShowSequence, ShowSequenceID) == 0x000000, "Member 'CharacterInteractionComponent_PlayShowSequence::ShowSequenceID' has a wrong offset!");

// Function CharacterInteraction.CharacterInteractionComponent.PlayWeightedVoice
// 0x0010 (0x0010 - 0x0000)
struct CharacterInteractionComponent_PlayWeightedVoice final
{
public:
	TArray<struct FWeightedVoice>                 VoiceIDs;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterInteractionComponent_PlayWeightedVoice) == 0x000008, "Wrong alignment on CharacterInteractionComponent_PlayWeightedVoice");
static_assert(sizeof(CharacterInteractionComponent_PlayWeightedVoice) == 0x000010, "Wrong size on CharacterInteractionComponent_PlayWeightedVoice");
static_assert(offsetof(CharacterInteractionComponent_PlayWeightedVoice, VoiceIDs) == 0x000000, "Member 'CharacterInteractionComponent_PlayWeightedVoice::VoiceIDs' has a wrong offset!");

// Function CharacterInteraction.CharacterInteractionComponent.SetbIsPlayingAnim
// 0x0001 (0x0001 - 0x0000)
struct CharacterInteractionComponent_SetbIsPlayingAnim final
{
public:
	bool                                          bIsPlaying;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterInteractionComponent_SetbIsPlayingAnim) == 0x000001, "Wrong alignment on CharacterInteractionComponent_SetbIsPlayingAnim");
static_assert(sizeof(CharacterInteractionComponent_SetbIsPlayingAnim) == 0x000001, "Wrong size on CharacterInteractionComponent_SetbIsPlayingAnim");
static_assert(offsetof(CharacterInteractionComponent_SetbIsPlayingAnim, bIsPlaying) == 0x000000, "Member 'CharacterInteractionComponent_SetbIsPlayingAnim::bIsPlaying' has a wrong offset!");

// Function CharacterInteraction.CharacterInteractionComponent.SetExplicitForbitEyeFollow
// 0x0001 (0x0001 - 0x0000)
struct CharacterInteractionComponent_SetExplicitForbitEyeFollow final
{
public:
	bool                                          bInExplicitForbit;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterInteractionComponent_SetExplicitForbitEyeFollow) == 0x000001, "Wrong alignment on CharacterInteractionComponent_SetExplicitForbitEyeFollow");
static_assert(sizeof(CharacterInteractionComponent_SetExplicitForbitEyeFollow) == 0x000001, "Wrong size on CharacterInteractionComponent_SetExplicitForbitEyeFollow");
static_assert(offsetof(CharacterInteractionComponent_SetExplicitForbitEyeFollow, bInExplicitForbit) == 0x000000, "Member 'CharacterInteractionComponent_SetExplicitForbitEyeFollow::bInExplicitForbit' has a wrong offset!");

// Function CharacterInteraction.CharacterInteractionComponent.SetFinishedInteractionTutorial
// 0x0001 (0x0001 - 0x0000)
struct CharacterInteractionComponent_SetFinishedInteractionTutorial final
{
public:
	bool                                          IsFinished;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterInteractionComponent_SetFinishedInteractionTutorial) == 0x000001, "Wrong alignment on CharacterInteractionComponent_SetFinishedInteractionTutorial");
static_assert(sizeof(CharacterInteractionComponent_SetFinishedInteractionTutorial) == 0x000001, "Wrong size on CharacterInteractionComponent_SetFinishedInteractionTutorial");
static_assert(offsetof(CharacterInteractionComponent_SetFinishedInteractionTutorial, IsFinished) == 0x000000, "Member 'CharacterInteractionComponent_SetFinishedInteractionTutorial::IsFinished' has a wrong offset!");

// Function CharacterInteraction.CharacterInteractionComponent.SetIsInteractionInterface
// 0x0001 (0x0001 - 0x0000)
struct CharacterInteractionComponent_SetIsInteractionInterface final
{
public:
	bool                                          NewBool;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterInteractionComponent_SetIsInteractionInterface) == 0x000001, "Wrong alignment on CharacterInteractionComponent_SetIsInteractionInterface");
static_assert(sizeof(CharacterInteractionComponent_SetIsInteractionInterface) == 0x000001, "Wrong size on CharacterInteractionComponent_SetIsInteractionInterface");
static_assert(offsetof(CharacterInteractionComponent_SetIsInteractionInterface, NewBool) == 0x000000, "Member 'CharacterInteractionComponent_SetIsInteractionInterface::NewBool' has a wrong offset!");

// Function CharacterInteraction.CharacterInteractionComponent.SetOperateEyeFollow
// 0x0001 (0x0001 - 0x0000)
struct CharacterInteractionComponent_SetOperateEyeFollow final
{
public:
	bool                                          bEyeFollow;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterInteractionComponent_SetOperateEyeFollow) == 0x000001, "Wrong alignment on CharacterInteractionComponent_SetOperateEyeFollow");
static_assert(sizeof(CharacterInteractionComponent_SetOperateEyeFollow) == 0x000001, "Wrong size on CharacterInteractionComponent_SetOperateEyeFollow");
static_assert(offsetof(CharacterInteractionComponent_SetOperateEyeFollow, bEyeFollow) == 0x000000, "Member 'CharacterInteractionComponent_SetOperateEyeFollow::bEyeFollow' has a wrong offset!");

// Function CharacterInteraction.CharacterInteractionComponent.StartStandby
// 0x0004 (0x0004 - 0x0000)
struct CharacterInteractionComponent_StartStandby final
{
public:
	int32                                         StandByID;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterInteractionComponent_StartStandby) == 0x000004, "Wrong alignment on CharacterInteractionComponent_StartStandby");
static_assert(sizeof(CharacterInteractionComponent_StartStandby) == 0x000004, "Wrong size on CharacterInteractionComponent_StartStandby");
static_assert(offsetof(CharacterInteractionComponent_StartStandby, StandByID) == 0x000000, "Member 'CharacterInteractionComponent_StartStandby::StandByID' has a wrong offset!");

// Function CharacterInteraction.CharacterInteractionComponent.UpdateKawaii
// 0x0008 (0x0008 - 0x0000)
struct CharacterInteractionComponent_UpdateKawaii final
{
public:
	float                                         NewBlendCounter;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NewShutDownKawaii;                                 // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CharacterInteractionComponent_UpdateKawaii) == 0x000004, "Wrong alignment on CharacterInteractionComponent_UpdateKawaii");
static_assert(sizeof(CharacterInteractionComponent_UpdateKawaii) == 0x000008, "Wrong size on CharacterInteractionComponent_UpdateKawaii");
static_assert(offsetof(CharacterInteractionComponent_UpdateKawaii, NewBlendCounter) == 0x000000, "Member 'CharacterInteractionComponent_UpdateKawaii::NewBlendCounter' has a wrong offset!");
static_assert(offsetof(CharacterInteractionComponent_UpdateKawaii, NewShutDownKawaii) == 0x000004, "Member 'CharacterInteractionComponent_UpdateKawaii::NewShutDownKawaii' has a wrong offset!");

// Function CharacterInteraction.CharacterInteractionComponent.GetIsInteractionInterface
// 0x0001 (0x0001 - 0x0000)
struct CharacterInteractionComponent_GetIsInteractionInterface final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterInteractionComponent_GetIsInteractionInterface) == 0x000001, "Wrong alignment on CharacterInteractionComponent_GetIsInteractionInterface");
static_assert(sizeof(CharacterInteractionComponent_GetIsInteractionInterface) == 0x000001, "Wrong size on CharacterInteractionComponent_GetIsInteractionInterface");
static_assert(offsetof(CharacterInteractionComponent_GetIsInteractionInterface, ReturnValue) == 0x000000, "Member 'CharacterInteractionComponent_GetIsInteractionInterface::ReturnValue' has a wrong offset!");

// Function CharacterInteraction.CharacterInteractionComponent.GetKawaiiAlphaValue
// 0x0004 (0x0004 - 0x0000)
struct CharacterInteractionComponent_GetKawaiiAlphaValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterInteractionComponent_GetKawaiiAlphaValue) == 0x000004, "Wrong alignment on CharacterInteractionComponent_GetKawaiiAlphaValue");
static_assert(sizeof(CharacterInteractionComponent_GetKawaiiAlphaValue) == 0x000004, "Wrong size on CharacterInteractionComponent_GetKawaiiAlphaValue");
static_assert(offsetof(CharacterInteractionComponent_GetKawaiiAlphaValue, ReturnValue) == 0x000000, "Member 'CharacterInteractionComponent_GetKawaiiAlphaValue::ReturnValue' has a wrong offset!");

// Function CharacterInteraction.FlowerMouseOverInterface.OnMouseOver
// 0x0018 (0x0018 - 0x0000)
struct FlowerMouseOverInterface_OnMouseOver final
{
public:
	struct FVector2D                              OverDistance;                                      // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              TargetPosition;                                    // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              LastMousePos;                                      // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FlowerMouseOverInterface_OnMouseOver) == 0x000004, "Wrong alignment on FlowerMouseOverInterface_OnMouseOver");
static_assert(sizeof(FlowerMouseOverInterface_OnMouseOver) == 0x000018, "Wrong size on FlowerMouseOverInterface_OnMouseOver");
static_assert(offsetof(FlowerMouseOverInterface_OnMouseOver, OverDistance) == 0x000000, "Member 'FlowerMouseOverInterface_OnMouseOver::OverDistance' has a wrong offset!");
static_assert(offsetof(FlowerMouseOverInterface_OnMouseOver, TargetPosition) == 0x000008, "Member 'FlowerMouseOverInterface_OnMouseOver::TargetPosition' has a wrong offset!");
static_assert(offsetof(FlowerMouseOverInterface_OnMouseOver, LastMousePos) == 0x000010, "Member 'FlowerMouseOverInterface_OnMouseOver::LastMousePos' has a wrong offset!");

// Function CharacterInteraction.InteractionOperate.OnInteractionEnd
// 0x0008 (0x0008 - 0x0000)
struct InteractionOperate_OnInteractionEnd final
{
public:
	class AInteractionCharacter*                  Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionOperate_OnInteractionEnd) == 0x000008, "Wrong alignment on InteractionOperate_OnInteractionEnd");
static_assert(sizeof(InteractionOperate_OnInteractionEnd) == 0x000008, "Wrong size on InteractionOperate_OnInteractionEnd");
static_assert(offsetof(InteractionOperate_OnInteractionEnd, Actor) == 0x000000, "Member 'InteractionOperate_OnInteractionEnd::Actor' has a wrong offset!");

// Function CharacterInteraction.InteractionOperate.OnInteractionRemove
// 0x0008 (0x0008 - 0x0000)
struct InteractionOperate_OnInteractionRemove final
{
public:
	class AInteractionCharacter*                  Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionOperate_OnInteractionRemove) == 0x000008, "Wrong alignment on InteractionOperate_OnInteractionRemove");
static_assert(sizeof(InteractionOperate_OnInteractionRemove) == 0x000008, "Wrong size on InteractionOperate_OnInteractionRemove");
static_assert(offsetof(InteractionOperate_OnInteractionRemove, Actor) == 0x000000, "Member 'InteractionOperate_OnInteractionRemove::Actor' has a wrong offset!");

// Function CharacterInteraction.InteractionOperate.OnInteractionReuse
// 0x0008 (0x0008 - 0x0000)
struct InteractionOperate_OnInteractionReuse final
{
public:
	class AInteractionCharacter*                  Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionOperate_OnInteractionReuse) == 0x000008, "Wrong alignment on InteractionOperate_OnInteractionReuse");
static_assert(sizeof(InteractionOperate_OnInteractionReuse) == 0x000008, "Wrong size on InteractionOperate_OnInteractionReuse");
static_assert(offsetof(InteractionOperate_OnInteractionReuse, Actor) == 0x000000, "Member 'InteractionOperate_OnInteractionReuse::Actor' has a wrong offset!");

// Function CharacterInteraction.InteractionOperate.OnInteractionStart
// 0x0008 (0x0008 - 0x0000)
struct InteractionOperate_OnInteractionStart final
{
public:
	class AInteractionCharacter*                  Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionOperate_OnInteractionStart) == 0x000008, "Wrong alignment on InteractionOperate_OnInteractionStart");
static_assert(sizeof(InteractionOperate_OnInteractionStart) == 0x000008, "Wrong size on InteractionOperate_OnInteractionStart");
static_assert(offsetof(InteractionOperate_OnInteractionStart, Actor) == 0x000000, "Member 'InteractionOperate_OnInteractionStart::Actor' has a wrong offset!");

// Function CharacterInteraction.InteractionOperate.OnInteractionUpdate
// 0x0010 (0x0010 - 0x0000)
struct InteractionOperate_OnInteractionUpdate final
{
public:
	class AInteractionCharacter*                  Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InteractionOperate_OnInteractionUpdate) == 0x000008, "Wrong alignment on InteractionOperate_OnInteractionUpdate");
static_assert(sizeof(InteractionOperate_OnInteractionUpdate) == 0x000010, "Wrong size on InteractionOperate_OnInteractionUpdate");
static_assert(offsetof(InteractionOperate_OnInteractionUpdate, Actor) == 0x000000, "Member 'InteractionOperate_OnInteractionUpdate::Actor' has a wrong offset!");
static_assert(offsetof(InteractionOperate_OnInteractionUpdate, DeltaTime) == 0x000008, "Member 'InteractionOperate_OnInteractionUpdate::DeltaTime' has a wrong offset!");

// Function CharacterInteraction.InteractionOperate.OnScenarioChange
// 0x0004 (0x0004 - 0x0000)
struct InteractionOperate_OnScenarioChange final
{
public:
	int32                                         ScenarioID;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionOperate_OnScenarioChange) == 0x000004, "Wrong alignment on InteractionOperate_OnScenarioChange");
static_assert(sizeof(InteractionOperate_OnScenarioChange) == 0x000004, "Wrong size on InteractionOperate_OnScenarioChange");
static_assert(offsetof(InteractionOperate_OnScenarioChange, ScenarioID) == 0x000000, "Member 'InteractionOperate_OnScenarioChange::ScenarioID' has a wrong offset!");

// Function CharacterInteraction.InteractionOperate.OnStandByChange
// 0x0004 (0x0004 - 0x0000)
struct InteractionOperate_OnStandByChange final
{
public:
	int32                                         ScenarioID;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionOperate_OnStandByChange) == 0x000004, "Wrong alignment on InteractionOperate_OnStandByChange");
static_assert(sizeof(InteractionOperate_OnStandByChange) == 0x000004, "Wrong size on InteractionOperate_OnStandByChange");
static_assert(offsetof(InteractionOperate_OnStandByChange, ScenarioID) == 0x000000, "Member 'InteractionOperate_OnStandByChange::ScenarioID' has a wrong offset!");

// Function CharacterInteraction.InteractionOperate.SetIsStop
// 0x0001 (0x0001 - 0x0000)
struct InteractionOperate_SetIsStop final
{
public:
	bool                                          bInStop;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionOperate_SetIsStop) == 0x000001, "Wrong alignment on InteractionOperate_SetIsStop");
static_assert(sizeof(InteractionOperate_SetIsStop) == 0x000001, "Wrong size on InteractionOperate_SetIsStop");
static_assert(offsetof(InteractionOperate_SetIsStop, bInStop) == 0x000000, "Member 'InteractionOperate_SetIsStop::bInStop' has a wrong offset!");

// Function CharacterInteraction.InteractionOperate.ShouldRemove
// 0x0010 (0x0010 - 0x0000)
struct InteractionOperate_ShouldRemove final
{
public:
	class AInteractionCharacter*                  Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InteractionOperate_ShouldRemove) == 0x000008, "Wrong alignment on InteractionOperate_ShouldRemove");
static_assert(sizeof(InteractionOperate_ShouldRemove) == 0x000010, "Wrong size on InteractionOperate_ShouldRemove");
static_assert(offsetof(InteractionOperate_ShouldRemove, Actor) == 0x000000, "Member 'InteractionOperate_ShouldRemove::Actor' has a wrong offset!");
static_assert(offsetof(InteractionOperate_ShouldRemove, ReturnValue) == 0x000008, "Member 'InteractionOperate_ShouldRemove::ReturnValue' has a wrong offset!");

// Function CharacterInteraction.InteractionOperate.GetIsStop
// 0x0001 (0x0001 - 0x0000)
struct InteractionOperate_GetIsStop final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionOperate_GetIsStop) == 0x000001, "Wrong alignment on InteractionOperate_GetIsStop");
static_assert(sizeof(InteractionOperate_GetIsStop) == 0x000001, "Wrong size on InteractionOperate_GetIsStop");
static_assert(offsetof(InteractionOperate_GetIsStop, ReturnValue) == 0x000000, "Member 'InteractionOperate_GetIsStop::ReturnValue' has a wrong offset!");

// Function CharacterInteraction.InteractionOperate.IsBlockOperate
// 0x0001 (0x0001 - 0x0000)
struct InteractionOperate_IsBlockOperate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionOperate_IsBlockOperate) == 0x000001, "Wrong alignment on InteractionOperate_IsBlockOperate");
static_assert(sizeof(InteractionOperate_IsBlockOperate) == 0x000001, "Wrong size on InteractionOperate_IsBlockOperate");
static_assert(offsetof(InteractionOperate_IsBlockOperate, ReturnValue) == 0x000000, "Member 'InteractionOperate_IsBlockOperate::ReturnValue' has a wrong offset!");

// Function CharacterInteraction.InteractionOperate.OnInteractionResume
// 0x0008 (0x0008 - 0x0000)
struct InteractionOperate_OnInteractionResume final
{
public:
	class AInteractionCharacter*                  Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionOperate_OnInteractionResume) == 0x000008, "Wrong alignment on InteractionOperate_OnInteractionResume");
static_assert(sizeof(InteractionOperate_OnInteractionResume) == 0x000008, "Wrong size on InteractionOperate_OnInteractionResume");
static_assert(offsetof(InteractionOperate_OnInteractionResume, Actor) == 0x000000, "Member 'InteractionOperate_OnInteractionResume::Actor' has a wrong offset!");

// Function CharacterInteraction.InteractionOperate.OnInteractionStop
// 0x0008 (0x0008 - 0x0000)
struct InteractionOperate_OnInteractionStop final
{
public:
	class AInteractionCharacter*                  Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionOperate_OnInteractionStop) == 0x000008, "Wrong alignment on InteractionOperate_OnInteractionStop");
static_assert(sizeof(InteractionOperate_OnInteractionStop) == 0x000008, "Wrong size on InteractionOperate_OnInteractionStop");
static_assert(offsetof(InteractionOperate_OnInteractionStop, Actor) == 0x000000, "Member 'InteractionOperate_OnInteractionStop::Actor' has a wrong offset!");

// Function CharacterInteraction.InteractionOperate.ShouldStopOnRelease
// 0x0001 (0x0001 - 0x0000)
struct InteractionOperate_ShouldStopOnRelease final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionOperate_ShouldStopOnRelease) == 0x000001, "Wrong alignment on InteractionOperate_ShouldStopOnRelease");
static_assert(sizeof(InteractionOperate_ShouldStopOnRelease) == 0x000001, "Wrong size on InteractionOperate_ShouldStopOnRelease");
static_assert(offsetof(InteractionOperate_ShouldStopOnRelease, ReturnValue) == 0x000000, "Member 'InteractionOperate_ShouldStopOnRelease::ReturnValue' has a wrong offset!");

// Function CharacterInteraction.DragInteraction.UpdateDrag
// 0x0010 (0x0010 - 0x0000)
struct DragInteraction_UpdateDrag final
{
public:
	class AInteractionCharacter*                  Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaSecond;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DragInteraction_UpdateDrag) == 0x000008, "Wrong alignment on DragInteraction_UpdateDrag");
static_assert(sizeof(DragInteraction_UpdateDrag) == 0x000010, "Wrong size on DragInteraction_UpdateDrag");
static_assert(offsetof(DragInteraction_UpdateDrag, Actor) == 0x000000, "Member 'DragInteraction_UpdateDrag::Actor' has a wrong offset!");
static_assert(offsetof(DragInteraction_UpdateDrag, DeltaSecond) == 0x000008, "Member 'DragInteraction_UpdateDrag::DeltaSecond' has a wrong offset!");

// Function CharacterInteraction.DragInteraction.UpdateRecover
// 0x0010 (0x0010 - 0x0000)
struct DragInteraction_UpdateRecover final
{
public:
	class AInteractionCharacter*                  Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DragInteraction_UpdateRecover) == 0x000008, "Wrong alignment on DragInteraction_UpdateRecover");
static_assert(sizeof(DragInteraction_UpdateRecover) == 0x000010, "Wrong size on DragInteraction_UpdateRecover");
static_assert(offsetof(DragInteraction_UpdateRecover, Actor) == 0x000000, "Member 'DragInteraction_UpdateRecover::Actor' has a wrong offset!");
static_assert(offsetof(DragInteraction_UpdateRecover, DeltaSeconds) == 0x000008, "Member 'DragInteraction_UpdateRecover::DeltaSeconds' has a wrong offset!");

// Function CharacterInteraction.PropsUpdateInterface.PropsUpdate
// 0x0030 (0x0030 - 0x0000)
struct PropsUpdateInterface_PropsUpdate final
{
public:
	struct FTransform                             NewTransform;                                      // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(PropsUpdateInterface_PropsUpdate) == 0x000010, "Wrong alignment on PropsUpdateInterface_PropsUpdate");
static_assert(sizeof(PropsUpdateInterface_PropsUpdate) == 0x000030, "Wrong size on PropsUpdateInterface_PropsUpdate");
static_assert(offsetof(PropsUpdateInterface_PropsUpdate, NewTransform) == 0x000000, "Member 'PropsUpdateInterface_PropsUpdate::NewTransform' has a wrong offset!");

// Function CharacterInteraction.InteractionAnimInstance.SetIsDebugDraw
// 0x0001 (0x0001 - 0x0000)
struct InteractionAnimInstance_SetIsDebugDraw final
{
public:
	bool                                          bInDebugDraw;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionAnimInstance_SetIsDebugDraw) == 0x000001, "Wrong alignment on InteractionAnimInstance_SetIsDebugDraw");
static_assert(sizeof(InteractionAnimInstance_SetIsDebugDraw) == 0x000001, "Wrong size on InteractionAnimInstance_SetIsDebugDraw");
static_assert(offsetof(InteractionAnimInstance_SetIsDebugDraw, bInDebugDraw) == 0x000000, "Member 'InteractionAnimInstance_SetIsDebugDraw::bInDebugDraw' has a wrong offset!");

// Function CharacterInteraction.InteractionAnimInstance.GetIsDebugDraw
// 0x0001 (0x0001 - 0x0000)
struct InteractionAnimInstance_GetIsDebugDraw final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionAnimInstance_GetIsDebugDraw) == 0x000001, "Wrong alignment on InteractionAnimInstance_GetIsDebugDraw");
static_assert(sizeof(InteractionAnimInstance_GetIsDebugDraw) == 0x000001, "Wrong size on InteractionAnimInstance_GetIsDebugDraw");
static_assert(offsetof(InteractionAnimInstance_GetIsDebugDraw, ReturnValue) == 0x000000, "Member 'InteractionAnimInstance_GetIsDebugDraw::ReturnValue' has a wrong offset!");

// Function CharacterInteraction.InteractionCableComponent.AddConstraint
// 0x0008 (0x0008 - 0x0000)
struct InteractionCableComponent_AddConstraint final
{
public:
	int32                                         IndexA;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IndexB;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionCableComponent_AddConstraint) == 0x000004, "Wrong alignment on InteractionCableComponent_AddConstraint");
static_assert(sizeof(InteractionCableComponent_AddConstraint) == 0x000008, "Wrong size on InteractionCableComponent_AddConstraint");
static_assert(offsetof(InteractionCableComponent_AddConstraint, IndexA) == 0x000000, "Member 'InteractionCableComponent_AddConstraint::IndexA' has a wrong offset!");
static_assert(offsetof(InteractionCableComponent_AddConstraint, IndexB) == 0x000004, "Member 'InteractionCableComponent_AddConstraint::IndexB' has a wrong offset!");

// Function CharacterInteraction.InteractionCableComponent.GrabParticles
// 0x0010 (0x0010 - 0x0000)
struct InteractionCableComponent_GrabParticles final
{
public:
	int32                                         ParticleIndex;                                     // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DragForce;                                         // 0x0004(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionCableComponent_GrabParticles) == 0x000004, "Wrong alignment on InteractionCableComponent_GrabParticles");
static_assert(sizeof(InteractionCableComponent_GrabParticles) == 0x000010, "Wrong size on InteractionCableComponent_GrabParticles");
static_assert(offsetof(InteractionCableComponent_GrabParticles, ParticleIndex) == 0x000000, "Member 'InteractionCableComponent_GrabParticles::ParticleIndex' has a wrong offset!");
static_assert(offsetof(InteractionCableComponent_GrabParticles, DragForce) == 0x000004, "Member 'InteractionCableComponent_GrabParticles::DragForce' has a wrong offset!");

// Function CharacterInteraction.InteractionCableComponent.IntegrateParticles
// 0x0004 (0x0004 - 0x0000)
struct InteractionCableComponent_IntegrateParticles final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionCableComponent_IntegrateParticles) == 0x000004, "Wrong alignment on InteractionCableComponent_IntegrateParticles");
static_assert(sizeof(InteractionCableComponent_IntegrateParticles) == 0x000004, "Wrong size on InteractionCableComponent_IntegrateParticles");
static_assert(offsetof(InteractionCableComponent_IntegrateParticles, DeltaTime) == 0x000000, "Member 'InteractionCableComponent_IntegrateParticles::DeltaTime' has a wrong offset!");

// Function CharacterInteraction.InteractionCableComponent.SetAttachEndTo
// 0x0018 (0x0018 - 0x0000)
struct InteractionCableComponent_SetAttachEndTo final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ComponentProperty;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionCableComponent_SetAttachEndTo) == 0x000008, "Wrong alignment on InteractionCableComponent_SetAttachEndTo");
static_assert(sizeof(InteractionCableComponent_SetAttachEndTo) == 0x000018, "Wrong size on InteractionCableComponent_SetAttachEndTo");
static_assert(offsetof(InteractionCableComponent_SetAttachEndTo, Actor) == 0x000000, "Member 'InteractionCableComponent_SetAttachEndTo::Actor' has a wrong offset!");
static_assert(offsetof(InteractionCableComponent_SetAttachEndTo, ComponentProperty) == 0x000008, "Member 'InteractionCableComponent_SetAttachEndTo::ComponentProperty' has a wrong offset!");
static_assert(offsetof(InteractionCableComponent_SetAttachEndTo, SocketName) == 0x000010, "Member 'InteractionCableComponent_SetAttachEndTo::SocketName' has a wrong offset!");

// Function CharacterInteraction.InteractionCableComponent.SetAttachEndToComponent
// 0x0010 (0x0010 - 0x0000)
struct InteractionCableComponent_SetAttachEndToComponent final
{
public:
	class USceneComponent*                        Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionCableComponent_SetAttachEndToComponent) == 0x000008, "Wrong alignment on InteractionCableComponent_SetAttachEndToComponent");
static_assert(sizeof(InteractionCableComponent_SetAttachEndToComponent) == 0x000010, "Wrong size on InteractionCableComponent_SetAttachEndToComponent");
static_assert(offsetof(InteractionCableComponent_SetAttachEndToComponent, Component) == 0x000000, "Member 'InteractionCableComponent_SetAttachEndToComponent::Component' has a wrong offset!");
static_assert(offsetof(InteractionCableComponent_SetAttachEndToComponent, SocketName) == 0x000008, "Member 'InteractionCableComponent_SetAttachEndToComponent::SocketName' has a wrong offset!");

// Function CharacterInteraction.InteractionCableComponent.SolveDistanceConstraints
// 0x0004 (0x0004 - 0x0000)
struct InteractionCableComponent_SolveDistanceConstraints final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionCableComponent_SolveDistanceConstraints) == 0x000004, "Wrong alignment on InteractionCableComponent_SolveDistanceConstraints");
static_assert(sizeof(InteractionCableComponent_SolveDistanceConstraints) == 0x000004, "Wrong size on InteractionCableComponent_SolveDistanceConstraints");
static_assert(offsetof(InteractionCableComponent_SolveDistanceConstraints, DeltaTime) == 0x000000, "Member 'InteractionCableComponent_SolveDistanceConstraints::DeltaTime' has a wrong offset!");

// Function CharacterInteraction.InteractionCableComponent.UpdateVelocities
// 0x0004 (0x0004 - 0x0000)
struct InteractionCableComponent_UpdateVelocities final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionCableComponent_UpdateVelocities) == 0x000004, "Wrong alignment on InteractionCableComponent_UpdateVelocities");
static_assert(sizeof(InteractionCableComponent_UpdateVelocities) == 0x000004, "Wrong size on InteractionCableComponent_UpdateVelocities");
static_assert(offsetof(InteractionCableComponent_UpdateVelocities, DeltaTime) == 0x000000, "Member 'InteractionCableComponent_UpdateVelocities::DeltaTime' has a wrong offset!");

// Function CharacterInteraction.InteractionCableComponent.GetAttachedActor
// 0x0008 (0x0008 - 0x0000)
struct InteractionCableComponent_GetAttachedActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionCableComponent_GetAttachedActor) == 0x000008, "Wrong alignment on InteractionCableComponent_GetAttachedActor");
static_assert(sizeof(InteractionCableComponent_GetAttachedActor) == 0x000008, "Wrong size on InteractionCableComponent_GetAttachedActor");
static_assert(offsetof(InteractionCableComponent_GetAttachedActor, ReturnValue) == 0x000000, "Member 'InteractionCableComponent_GetAttachedActor::ReturnValue' has a wrong offset!");

// Function CharacterInteraction.InteractionCableComponent.GetAttachedComponent
// 0x0008 (0x0008 - 0x0000)
struct InteractionCableComponent_GetAttachedComponent final
{
public:
	class USceneComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionCableComponent_GetAttachedComponent) == 0x000008, "Wrong alignment on InteractionCableComponent_GetAttachedComponent");
static_assert(sizeof(InteractionCableComponent_GetAttachedComponent) == 0x000008, "Wrong size on InteractionCableComponent_GetAttachedComponent");
static_assert(offsetof(InteractionCableComponent_GetAttachedComponent, ReturnValue) == 0x000000, "Member 'InteractionCableComponent_GetAttachedComponent::ReturnValue' has a wrong offset!");

// Function CharacterInteraction.InteractionCableComponent.GetInteractionCableParticleLocations
// 0x0010 (0x0010 - 0x0000)
struct InteractionCableComponent_GetInteractionCableParticleLocations final
{
public:
	TArray<struct FVector>                        Locations;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionCableComponent_GetInteractionCableParticleLocations) == 0x000008, "Wrong alignment on InteractionCableComponent_GetInteractionCableParticleLocations");
static_assert(sizeof(InteractionCableComponent_GetInteractionCableParticleLocations) == 0x000010, "Wrong size on InteractionCableComponent_GetInteractionCableParticleLocations");
static_assert(offsetof(InteractionCableComponent_GetInteractionCableParticleLocations, Locations) == 0x000000, "Member 'InteractionCableComponent_GetInteractionCableParticleLocations::Locations' has a wrong offset!");

// Function CharacterInteraction.InteractionCharacter.BlendPhysics
// 0x0004 (0x0004 - 0x0000)
struct InteractionCharacter_BlendPhysics final
{
public:
	float                                         TimelineLength;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionCharacter_BlendPhysics) == 0x000004, "Wrong alignment on InteractionCharacter_BlendPhysics");
static_assert(sizeof(InteractionCharacter_BlendPhysics) == 0x000004, "Wrong size on InteractionCharacter_BlendPhysics");
static_assert(offsetof(InteractionCharacter_BlendPhysics, TimelineLength) == 0x000000, "Member 'InteractionCharacter_BlendPhysics::TimelineLength' has a wrong offset!");

// Function CharacterInteraction.InteractionCharacter.GetStandByConfig
// 0x00F0 (0x00F0 - 0x0000)
struct InteractionCharacter_GetStandByConfig final
{
public:
	int32                                         StandByID;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractionStandByConfig              Config;                                            // 0x0008(0x00E0)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InteractionCharacter_GetStandByConfig) == 0x000008, "Wrong alignment on InteractionCharacter_GetStandByConfig");
static_assert(sizeof(InteractionCharacter_GetStandByConfig) == 0x0000F0, "Wrong size on InteractionCharacter_GetStandByConfig");
static_assert(offsetof(InteractionCharacter_GetStandByConfig, StandByID) == 0x000000, "Member 'InteractionCharacter_GetStandByConfig::StandByID' has a wrong offset!");
static_assert(offsetof(InteractionCharacter_GetStandByConfig, Config) == 0x000008, "Member 'InteractionCharacter_GetStandByConfig::Config' has a wrong offset!");
static_assert(offsetof(InteractionCharacter_GetStandByConfig, ReturnValue) == 0x0000E8, "Member 'InteractionCharacter_GetStandByConfig::ReturnValue' has a wrong offset!");

// Function CharacterInteraction.InteractionCharacter.SetPhysicsBlendWeight
// 0x0018 (0x0018 - 0x0000)
struct InteractionCharacter_SetPhysicsBlendWeight final
{
public:
	class FName                                   SetName;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartBlend;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Target;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendSpeed;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CompleteClose;                                     // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InteractionCharacter_SetPhysicsBlendWeight) == 0x000004, "Wrong alignment on InteractionCharacter_SetPhysicsBlendWeight");
static_assert(sizeof(InteractionCharacter_SetPhysicsBlendWeight) == 0x000018, "Wrong size on InteractionCharacter_SetPhysicsBlendWeight");
static_assert(offsetof(InteractionCharacter_SetPhysicsBlendWeight, SetName) == 0x000000, "Member 'InteractionCharacter_SetPhysicsBlendWeight::SetName' has a wrong offset!");
static_assert(offsetof(InteractionCharacter_SetPhysicsBlendWeight, StartBlend) == 0x000008, "Member 'InteractionCharacter_SetPhysicsBlendWeight::StartBlend' has a wrong offset!");
static_assert(offsetof(InteractionCharacter_SetPhysicsBlendWeight, Target) == 0x00000C, "Member 'InteractionCharacter_SetPhysicsBlendWeight::Target' has a wrong offset!");
static_assert(offsetof(InteractionCharacter_SetPhysicsBlendWeight, BlendSpeed) == 0x000010, "Member 'InteractionCharacter_SetPhysicsBlendWeight::BlendSpeed' has a wrong offset!");
static_assert(offsetof(InteractionCharacter_SetPhysicsBlendWeight, CompleteClose) == 0x000014, "Member 'InteractionCharacter_SetPhysicsBlendWeight::CompleteClose' has a wrong offset!");

// Function CharacterInteraction.InteractionCharacter.SetReceiveInteraction
// 0x0001 (0x0001 - 0x0000)
struct InteractionCharacter_SetReceiveInteraction final
{
public:
	bool                                          bInReceive;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionCharacter_SetReceiveInteraction) == 0x000001, "Wrong alignment on InteractionCharacter_SetReceiveInteraction");
static_assert(sizeof(InteractionCharacter_SetReceiveInteraction) == 0x000001, "Wrong size on InteractionCharacter_SetReceiveInteraction");
static_assert(offsetof(InteractionCharacter_SetReceiveInteraction, bInReceive) == 0x000000, "Member 'InteractionCharacter_SetReceiveInteraction::bInReceive' has a wrong offset!");

// Function CharacterInteraction.InteractionCharacter.GetBodyComponent
// 0x0008 (0x0008 - 0x0000)
struct InteractionCharacter_GetBodyComponent final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionCharacter_GetBodyComponent) == 0x000008, "Wrong alignment on InteractionCharacter_GetBodyComponent");
static_assert(sizeof(InteractionCharacter_GetBodyComponent) == 0x000008, "Wrong size on InteractionCharacter_GetBodyComponent");
static_assert(offsetof(InteractionCharacter_GetBodyComponent, ReturnValue) == 0x000000, "Member 'InteractionCharacter_GetBodyComponent::ReturnValue' has a wrong offset!");

// Function CharacterInteraction.InteractionCharacter.GetHeadComponent
// 0x0008 (0x0008 - 0x0000)
struct InteractionCharacter_GetHeadComponent final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionCharacter_GetHeadComponent) == 0x000008, "Wrong alignment on InteractionCharacter_GetHeadComponent");
static_assert(sizeof(InteractionCharacter_GetHeadComponent) == 0x000008, "Wrong size on InteractionCharacter_GetHeadComponent");
