#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterInteraction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CharacterInteraction_structs.hpp"
#include "SeasunAnimGraph_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "PhysicsControl_structs.hpp"


namespace SDK
{

// Class CharacterInteraction.InteractionArchivementComponent
// 0x0038 (0x00E8 - 0x00B0)
class UInteractionArchivementComponent final : public UActorComponent
{
public:
	TArray<int32>                                 CompleteConditions;                                // 0x00B0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                 CompleteArchivements;                              // 0x00C0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                 PlayedArchivements;                                // 0x00D0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UDataTable*                             ArchivementDataTable;                              // 0x00E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void GetEggLevelSeqs(TArray<class ULevelSequence*>* OutLevelSeqs);
	void SetArchievementPlayed(int32 ID);
	void SetArchivementComplete(int32 ID);
	void SetConditionComplete(int32 ID);
	void SetConditionCompleteAdnRefresh(int32 ID);

	bool IsArchivementComplete(int32 ID) const;
	bool IsArchivementPlayed(int32 ID) const;
	bool IsConditionComplete(int32 ID) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InteractionArchivementComponent">();
	}
	static class UInteractionArchivementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractionArchivementComponent>();
	}
};
static_assert(alignof(UInteractionArchivementComponent) == 0x000008, "Wrong alignment on UInteractionArchivementComponent");
static_assert(sizeof(UInteractionArchivementComponent) == 0x0000E8, "Wrong size on UInteractionArchivementComponent");
static_assert(offsetof(UInteractionArchivementComponent, CompleteConditions) == 0x0000B0, "Member 'UInteractionArchivementComponent::CompleteConditions' has a wrong offset!");
static_assert(offsetof(UInteractionArchivementComponent, CompleteArchivements) == 0x0000C0, "Member 'UInteractionArchivementComponent::CompleteArchivements' has a wrong offset!");
static_assert(offsetof(UInteractionArchivementComponent, PlayedArchivements) == 0x0000D0, "Member 'UInteractionArchivementComponent::PlayedArchivements' has a wrong offset!");
static_assert(offsetof(UInteractionArchivementComponent, ArchivementDataTable) == 0x0000E0, "Member 'UInteractionArchivementComponent::ArchivementDataTable' has a wrong offset!");

// Class CharacterInteraction.CharacterInteractionComponent
// 0x01D0 (0x0280 - 0x00B0)
class UCharacterInteractionComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UInteractionOperate*>            InstancedResistentOperates;                        // 0x00B8(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	ECharacterInteractionState                    InteractionState;                                  // 0x00C8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C9[0x13];                                      // 0x00C9(0x0013)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LastStandByID;                                     // 0x00DC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UInteractionStandByEvent*>       StandByEvents;                                     // 0x00E0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UInteractionStandByEventContext*        StandByEventContext;                               // 0x00F0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F8[0x20];                                      // 0x00F8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UInteractionShowEvent*>          ShowEvents;                                        // 0x0118(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UInteractionShowEventContext*           ShowEventContext;                                  // 0x0128(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_130[0x10];                                     // 0x0130(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           ShowElementMontage;                                // 0x0140(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                           ShowElementFacialMontage;                          // 0x0148(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCustomShowElement*                     CurCustomShowElement;                              // 0x0150(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_158[0x8];                                      // 0x0158(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractionOperate*                    CurrentOperate;                                    // 0x0160(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_168[0x10];                                     // 0x0168(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UInteractionOperate*>            ResidentOperates;                                  // 0x0178(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class UInteractionOperate*>            ActiveOperates;                                    // 0x0188(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_198[0x10];                                     // 0x0198(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UInteractionExtraSequenceProcessor*> ExtraSequenceProcesses;                            // 0x01A8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class UInteractionExtraStandByProcessor*> ExtraStandByProcesses;                             // 0x01B8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C8[0x1];                                      // 0x01C8(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bHasFinishedInteractionTutorial;                   // 0x01C9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPendingInteractionState               PendingState;                                      // 0x01CC(0x0008)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLastFrameAnimData                     LastFrameAnimData;                                 // 0x01D8(0x0030)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bExplicitFobirdEyeFollow;                          // 0x0208(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMouseFollowLookAtCamera;                          // 0x0209(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_20A[0x2];                                      // 0x020A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              EyesLookAtPosition;                                // 0x020C(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOperateEyeFollow;                                 // 0x0214(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShutDownKawaii;                                   // 0x0215(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_216[0x2];                                      // 0x0216(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         KawaiiAlpha;                                       // 0x0218(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         KawaiiBlendDuration;                               // 0x021C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         KawaiiShutdownSpeed;                               // 0x0220(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsEnableKawaiiBlendCurve;                         // 0x0224(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            EnableKawaiiBlendCurve;                            // 0x0228(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            DisableKawaiiBlendCurve;                           // 0x0230(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_238[0x4];                                      // 0x0238(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         KawaiBlendSpeedScale;                              // 0x023C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsPlayingAnim;                                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateKawaii;                                     // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopMontages;                                     // 0x0242(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_243[0x5];                                      // 0x0243(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             PropsInteractionDelegate;                          // 0x0248(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_258[0x8];                                      // 0x0258(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsHideBone;                                       // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           BoneNames;                                         // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bIsInteractionInterface;                           // 0x0278(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UInteractionAnimInstance* GetInteractionAnimInstance();
	class UInteractionHeadAnimInstance* GetInteractionHeadAnimInstance();
	void OnPropsInteractionEnd();
	void PlayShowSequence(int32 ShowSequenceID);
	void PlayWeightedVoice(const TArray<struct FWeightedVoice>& VoiceIDs);
	void ResetInteraction();
	void SetbIsPlayingAnim(bool bIsPlaying);
	void SetExplicitForbitEyeFollow(bool bInExplicitForbit);
	void SetFinishedInteractionTutorial(bool IsFinished);
	void SetIsInteractionInterface(bool NewBool);
	void SetOperateEyeFollow(bool bEyeFollow);
	void StartStandby(int32 StandByID);
	void UpdateKawaii(float NewBlendCounter, bool NewShutDownKawaii);

	bool GetIsInteractionInterface() const;
	float GetKawaiiAlphaValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CharacterInteractionComponent">();
	}
	static class UCharacterInteractionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterInteractionComponent>();
	}
};
static_assert(alignof(UCharacterInteractionComponent) == 0x000008, "Wrong alignment on UCharacterInteractionComponent");
static_assert(sizeof(UCharacterInteractionComponent) == 0x000280, "Wrong size on UCharacterInteractionComponent");
static_assert(offsetof(UCharacterInteractionComponent, InstancedResistentOperates) == 0x0000B8, "Member 'UCharacterInteractionComponent::InstancedResistentOperates' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, InteractionState) == 0x0000C8, "Member 'UCharacterInteractionComponent::InteractionState' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, LastStandByID) == 0x0000DC, "Member 'UCharacterInteractionComponent::LastStandByID' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, StandByEvents) == 0x0000E0, "Member 'UCharacterInteractionComponent::StandByEvents' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, StandByEventContext) == 0x0000F0, "Member 'UCharacterInteractionComponent::StandByEventContext' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, ShowEvents) == 0x000118, "Member 'UCharacterInteractionComponent::ShowEvents' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, ShowEventContext) == 0x000128, "Member 'UCharacterInteractionComponent::ShowEventContext' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, ShowElementMontage) == 0x000140, "Member 'UCharacterInteractionComponent::ShowElementMontage' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, ShowElementFacialMontage) == 0x000148, "Member 'UCharacterInteractionComponent::ShowElementFacialMontage' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, CurCustomShowElement) == 0x000150, "Member 'UCharacterInteractionComponent::CurCustomShowElement' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, CurrentOperate) == 0x000160, "Member 'UCharacterInteractionComponent::CurrentOperate' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, ResidentOperates) == 0x000178, "Member 'UCharacterInteractionComponent::ResidentOperates' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, ActiveOperates) == 0x000188, "Member 'UCharacterInteractionComponent::ActiveOperates' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, ExtraSequenceProcesses) == 0x0001A8, "Member 'UCharacterInteractionComponent::ExtraSequenceProcesses' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, ExtraStandByProcesses) == 0x0001B8, "Member 'UCharacterInteractionComponent::ExtraStandByProcesses' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, bHasFinishedInteractionTutorial) == 0x0001C9, "Member 'UCharacterInteractionComponent::bHasFinishedInteractionTutorial' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, PendingState) == 0x0001CC, "Member 'UCharacterInteractionComponent::PendingState' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, LastFrameAnimData) == 0x0001D8, "Member 'UCharacterInteractionComponent::LastFrameAnimData' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, bExplicitFobirdEyeFollow) == 0x000208, "Member 'UCharacterInteractionComponent::bExplicitFobirdEyeFollow' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, bMouseFollowLookAtCamera) == 0x000209, "Member 'UCharacterInteractionComponent::bMouseFollowLookAtCamera' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, EyesLookAtPosition) == 0x00020C, "Member 'UCharacterInteractionComponent::EyesLookAtPosition' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, bOperateEyeFollow) == 0x000214, "Member 'UCharacterInteractionComponent::bOperateEyeFollow' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, bShutDownKawaii) == 0x000215, "Member 'UCharacterInteractionComponent::bShutDownKawaii' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, KawaiiAlpha) == 0x000218, "Member 'UCharacterInteractionComponent::KawaiiAlpha' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, KawaiiBlendDuration) == 0x00021C, "Member 'UCharacterInteractionComponent::KawaiiBlendDuration' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, KawaiiShutdownSpeed) == 0x000220, "Member 'UCharacterInteractionComponent::KawaiiShutdownSpeed' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, bIsEnableKawaiiBlendCurve) == 0x000224, "Member 'UCharacterInteractionComponent::bIsEnableKawaiiBlendCurve' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, EnableKawaiiBlendCurve) == 0x000228, "Member 'UCharacterInteractionComponent::EnableKawaiiBlendCurve' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, DisableKawaiiBlendCurve) == 0x000230, "Member 'UCharacterInteractionComponent::DisableKawaiiBlendCurve' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, KawaiBlendSpeedScale) == 0x00023C, "Member 'UCharacterInteractionComponent::KawaiBlendSpeedScale' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, bIsPlayingAnim) == 0x000240, "Member 'UCharacterInteractionComponent::bIsPlayingAnim' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, bUpdateKawaii) == 0x000241, "Member 'UCharacterInteractionComponent::bUpdateKawaii' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, bStopMontages) == 0x000242, "Member 'UCharacterInteractionComponent::bStopMontages' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, PropsInteractionDelegate) == 0x000248, "Member 'UCharacterInteractionComponent::PropsInteractionDelegate' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, bIsHideBone) == 0x000260, "Member 'UCharacterInteractionComponent::bIsHideBone' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, BoneNames) == 0x000268, "Member 'UCharacterInteractionComponent::BoneNames' has a wrong offset!");
static_assert(offsetof(UCharacterInteractionComponent, bIsInteractionInterface) == 0x000278, "Member 'UCharacterInteractionComponent::bIsInteractionInterface' has a wrong offset!");

// Class CharacterInteraction.FlowerMouseOverInterface
// 0x0000 (0x0028 - 0x0028)
class IFlowerMouseOverInterface final : public IInterface
{
public:
	void OnMouseOver(const struct FVector2D& OverDistance, const struct FVector2D& TargetPosition, const struct FVector2D& LastMousePos);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FlowerMouseOverInterface">();
	}
	static class IFlowerMouseOverInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFlowerMouseOverInterface>();
	}
};
static_assert(alignof(IFlowerMouseOverInterface) == 0x000008, "Wrong alignment on IFlowerMouseOverInterface");
static_assert(sizeof(IFlowerMouseOverInterface) == 0x000028, "Wrong size on IFlowerMouseOverInterface");

// Class CharacterInteraction.InteractionOperate
// 0x00A8 (0x00D0 - 0x0028)
class UInteractionOperate : public UObject
{
public:
	TArray<TSoftObjectPtr<class UInteractionOperateEventAsset>> InteractionEvents;                                 // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimSequence>           FacialAnim;                                        // 0x0038(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FSyncOperate>                   SyncOperates;                                      // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FInteractionHolyLightData>      HolyLights;                                        // 0x0070(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FWeightedVoice>                 VoiceIDs;                                          // 0x0080(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           PhysOperates;                                      // 0x0090(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UInteractionOperateEvent*>       Events;                                            // 0x00A0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UInteractionOperateEventContext*        EventContext;                                      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsDraging;                                        // 0x00B8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsStop;                                           // 0x00B9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           FacialAnimMontage;                                 // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnInteractionEnd(class AInteractionCharacter* Actor);
	void OnInteractionRemove(class AInteractionCharacter* Actor);
	void OnInteractionReuse(class AInteractionCharacter* Actor);
	void OnInteractionStart(class AInteractionCharacter* Actor);
	void OnInteractionUpdate(class AInteractionCharacter* Actor, float DeltaTime);
	void OnScenarioChange(int32 ScenarioID);
	void OnStandByChange(int32 ScenarioID);
	void SetIsStop(bool bInStop);
	bool ShouldRemove(class AInteractionCharacter* Actor);

	bool GetIsStop() const;
	bool IsBlockOperate() const;
	void OnInteractionResume(class AInteractionCharacter* Actor) const;
	void OnInteractionStop(class AInteractionCharacter* Actor) const;
	bool ShouldStopOnRelease() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InteractionOperate">();
	}
	static class UInteractionOperate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractionOperate>();
	}
};
static_assert(alignof(UInteractionOperate) == 0x000008, "Wrong alignment on UInteractionOperate");
static_assert(sizeof(UInteractionOperate) == 0x0000D0, "Wrong size on UInteractionOperate");
static_assert(offsetof(UInteractionOperate, InteractionEvents) == 0x000028, "Member 'UInteractionOperate::InteractionEvents' has a wrong offset!");
static_assert(offsetof(UInteractionOperate, FacialAnim) == 0x000038, "Member 'UInteractionOperate::FacialAnim' has a wrong offset!");
static_assert(offsetof(UInteractionOperate, SyncOperates) == 0x000060, "Member 'UInteractionOperate::SyncOperates' has a wrong offset!");
static_assert(offsetof(UInteractionOperate, HolyLights) == 0x000070, "Member 'UInteractionOperate::HolyLights' has a wrong offset!");
static_assert(offsetof(UInteractionOperate, VoiceIDs) == 0x000080, "Member 'UInteractionOperate::VoiceIDs' has a wrong offset!");
static_assert(offsetof(UInteractionOperate, PhysOperates) == 0x000090, "Member 'UInteractionOperate::PhysOperates' has a wrong offset!");
static_assert(offsetof(UInteractionOperate, Events) == 0x0000A0, "Member 'UInteractionOperate::Events' has a wrong offset!");
static_assert(offsetof(UInteractionOperate, EventContext) == 0x0000B0, "Member 'UInteractionOperate::EventContext' has a wrong offset!");
static_assert(offsetof(UInteractionOperate, bIsDraging) == 0x0000B8, "Member 'UInteractionOperate::bIsDraging' has a wrong offset!");
static_assert(offsetof(UInteractionOperate, bIsStop) == 0x0000B9, "Member 'UInteractionOperate::bIsStop' has a wrong offset!");
static_assert(offsetof(UInteractionOperate, FacialAnimMontage) == 0x0000C0, "Member 'UInteractionOperate::FacialAnimMontage' has a wrong offset!");

// Class CharacterInteraction.DragInteraction
// 0x0090 (0x0160 - 0x00D0)
class UDragInteraction : public UInteractionOperate
{
public:
	struct FDragControlData                       DragControl;                                       // 0x00D0(0x0048)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FIKFixData>                     FixBones;                                          // 0x0118(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FExtraFixData>                  ExtraFixDatas;                                     // 0x0128(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bBlockStandby;                                     // 0x0138(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBlush;                                          // 0x0139(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceEyeLookAtCamera;                             // 0x013A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13B[0x1];                                      // 0x013B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              LookAtPosition;                                    // 0x013C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_144[0x1C];                                     // 0x0144(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateDrag(class AInteractionCharacter* Actor, float DeltaSecond);
	void UpdateRecover(class AInteractionCharacter* Actor, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DragInteraction">();
	}
	static class UDragInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDragInteraction>();
	}
};
static_assert(alignof(UDragInteraction) == 0x000008, "Wrong alignment on UDragInteraction");
static_assert(sizeof(UDragInteraction) == 0x000160, "Wrong size on UDragInteraction");
static_assert(offsetof(UDragInteraction, DragControl) == 0x0000D0, "Member 'UDragInteraction::DragControl' has a wrong offset!");
static_assert(offsetof(UDragInteraction, FixBones) == 0x000118, "Member 'UDragInteraction::FixBones' has a wrong offset!");
static_assert(offsetof(UDragInteraction, ExtraFixDatas) == 0x000128, "Member 'UDragInteraction::ExtraFixDatas' has a wrong offset!");
static_assert(offsetof(UDragInteraction, bBlockStandby) == 0x000138, "Member 'UDragInteraction::bBlockStandby' has a wrong offset!");
static_assert(offsetof(UDragInteraction, bIsBlush) == 0x000139, "Member 'UDragInteraction::bIsBlush' has a wrong offset!");
static_assert(offsetof(UDragInteraction, bForceEyeLookAtCamera) == 0x00013A, "Member 'UDragInteraction::bForceEyeLookAtCamera' has a wrong offset!");
static_assert(offsetof(UDragInteraction, LookAtPosition) == 0x00013C, "Member 'UDragInteraction::LookAtPosition' has a wrong offset!");

// Class CharacterInteraction.MouseOverFlowerInteraction
// 0x0010 (0x0170 - 0x0160)
class UMouseOverFlowerInteraction final : public UDragInteraction
{
public:
	float                                         SampleInterval;                                    // 0x0160(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_164[0xC];                                      // 0x0164(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MouseOverFlowerInteraction">();
	}
	static class UMouseOverFlowerInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMouseOverFlowerInteraction>();
	}
};
static_assert(alignof(UMouseOverFlowerInteraction) == 0x000008, "Wrong alignment on UMouseOverFlowerInteraction");
static_assert(sizeof(UMouseOverFlowerInteraction) == 0x000170, "Wrong size on UMouseOverFlowerInteraction");
static_assert(offsetof(UMouseOverFlowerInteraction, SampleInterval) == 0x000160, "Member 'UMouseOverFlowerInteraction::SampleInterval' has a wrong offset!");

// Class CharacterInteraction.PropsUpdateInterface
// 0x0000 (0x0028 - 0x0028)
class IPropsUpdateInterface final : public IInterface
{
public:
	void PropsUpdate(const struct FTransform& NewTransform);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PropsUpdateInterface">();
	}
	static class IPropsUpdateInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IPropsUpdateInterface>();
	}
};
static_assert(alignof(IPropsUpdateInterface) == 0x000008, "Wrong alignment on IPropsUpdateInterface");
static_assert(sizeof(IPropsUpdateInterface) == 0x000028, "Wrong size on IPropsUpdateInterface");

// Class CharacterInteraction.PropsClickedInterface
// 0x0000 (0x0028 - 0x0028)
class IPropsClickedInterface final : public IInterface
{
public:
	void PropsClicked();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PropsClickedInterface">();
	}
	static class IPropsClickedInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IPropsClickedInterface>();
	}
};
static_assert(alignof(IPropsClickedInterface) == 0x000008, "Wrong alignment on IPropsClickedInterface");
static_assert(sizeof(IPropsClickedInterface) == 0x000028, "Wrong size on IPropsClickedInterface");

// Class CharacterInteraction.FBAnimationDefinition
// 0x0280 (0x02B0 - 0x0030)
class UFBAnimationDefinition final : public UDataAsset
{
public:
	int32                                         InteractionName;                                   // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DragSpeedMultiplying;                              // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SampleInterval;                                    // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AttenuationEnergyPerSecond;                        // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeAttenuationThreshold;                          // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinClickEnergy;                                    // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxClickEnergy;                                    // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxEnergy;                                         // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormalInversion;                                   // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RotatorOffer;                                      // 0x0054(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         MaxShortAnimTriggerTime;                           // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableSubtract;                                   // 0x0064(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           SubtractBoneNames;                                 // 0x0068(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bEnableAdditive;                                   // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           AdditiveBoneNames;                                 // 0x0080(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         AnimA_BlendInTime;                                 // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimA_BlendOutTime;                                // 0x0094(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UAnimSequence>>   AnimA;                                             // 0x0098(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimSequence>           FaceAnimA;                                         // 0x00A8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           FaceAnimAMontage;                                  // 0x00D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimMontage>            AnimB;                                             // 0x00D8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimMontage>            FaceAnimB;                                         // 0x0100(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimB1_BlendInTime;                                // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimB1_BlendOutTime;                               // 0x012C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimSequence>           AnimB1;                                            // 0x0130(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimSequence>           FaceAnimB1;                                        // 0x0158(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimMontage>            AnimC;                                             // 0x0180(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimMontage>            FaceAnimC;                                         // 0x01A8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimPropA_BlendInTime;                             // 0x01D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimPropA_BlendOutTime;                            // 0x01D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimSequence>           AnimPropA;                                         // 0x01D8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimMontage>            AnimPropB;                                         // 0x0200(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimPropB1_BlendInTime;                            // 0x0228(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimPropB1_BlendOutTime;                           // 0x022C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimSequence>           AnimPropB1;                                        // 0x0230(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimMontage>            AnimPropC;                                         // 0x0258(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FWeightedVoice>                 AnimAVoiceIDs;                                     // 0x0280(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWeightedVoice>                 AnimBVoiceIDs;                                     // 0x0290(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWeightedVoice>                 AnimCVoiceIDs;                                     // 0x02A0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FBAnimationDefinition">();
	}
	static class UFBAnimationDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFBAnimationDefinition>();
	}
};
static_assert(alignof(UFBAnimationDefinition) == 0x000008, "Wrong alignment on UFBAnimationDefinition");
static_assert(sizeof(UFBAnimationDefinition) == 0x0002B0, "Wrong size on UFBAnimationDefinition");
static_assert(offsetof(UFBAnimationDefinition, InteractionName) == 0x000030, "Member 'UFBAnimationDefinition::InteractionName' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, DragSpeedMultiplying) == 0x000034, "Member 'UFBAnimationDefinition::DragSpeedMultiplying' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, SampleInterval) == 0x000038, "Member 'UFBAnimationDefinition::SampleInterval' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, AttenuationEnergyPerSecond) == 0x00003C, "Member 'UFBAnimationDefinition::AttenuationEnergyPerSecond' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, TimeAttenuationThreshold) == 0x000040, "Member 'UFBAnimationDefinition::TimeAttenuationThreshold' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, MinClickEnergy) == 0x000044, "Member 'UFBAnimationDefinition::MinClickEnergy' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, MaxClickEnergy) == 0x000048, "Member 'UFBAnimationDefinition::MaxClickEnergy' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, MaxEnergy) == 0x00004C, "Member 'UFBAnimationDefinition::MaxEnergy' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, NormalInversion) == 0x000050, "Member 'UFBAnimationDefinition::NormalInversion' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, RotatorOffer) == 0x000054, "Member 'UFBAnimationDefinition::RotatorOffer' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, MaxShortAnimTriggerTime) == 0x000060, "Member 'UFBAnimationDefinition::MaxShortAnimTriggerTime' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, bEnableSubtract) == 0x000064, "Member 'UFBAnimationDefinition::bEnableSubtract' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, SubtractBoneNames) == 0x000068, "Member 'UFBAnimationDefinition::SubtractBoneNames' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, bEnableAdditive) == 0x000078, "Member 'UFBAnimationDefinition::bEnableAdditive' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, AdditiveBoneNames) == 0x000080, "Member 'UFBAnimationDefinition::AdditiveBoneNames' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, AnimA_BlendInTime) == 0x000090, "Member 'UFBAnimationDefinition::AnimA_BlendInTime' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, AnimA_BlendOutTime) == 0x000094, "Member 'UFBAnimationDefinition::AnimA_BlendOutTime' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, AnimA) == 0x000098, "Member 'UFBAnimationDefinition::AnimA' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, FaceAnimA) == 0x0000A8, "Member 'UFBAnimationDefinition::FaceAnimA' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, FaceAnimAMontage) == 0x0000D0, "Member 'UFBAnimationDefinition::FaceAnimAMontage' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, AnimB) == 0x0000D8, "Member 'UFBAnimationDefinition::AnimB' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, FaceAnimB) == 0x000100, "Member 'UFBAnimationDefinition::FaceAnimB' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, AnimB1_BlendInTime) == 0x000128, "Member 'UFBAnimationDefinition::AnimB1_BlendInTime' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, AnimB1_BlendOutTime) == 0x00012C, "Member 'UFBAnimationDefinition::AnimB1_BlendOutTime' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, AnimB1) == 0x000130, "Member 'UFBAnimationDefinition::AnimB1' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, FaceAnimB1) == 0x000158, "Member 'UFBAnimationDefinition::FaceAnimB1' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, AnimC) == 0x000180, "Member 'UFBAnimationDefinition::AnimC' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, FaceAnimC) == 0x0001A8, "Member 'UFBAnimationDefinition::FaceAnimC' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, AnimPropA_BlendInTime) == 0x0001D0, "Member 'UFBAnimationDefinition::AnimPropA_BlendInTime' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, AnimPropA_BlendOutTime) == 0x0001D4, "Member 'UFBAnimationDefinition::AnimPropA_BlendOutTime' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, AnimPropA) == 0x0001D8, "Member 'UFBAnimationDefinition::AnimPropA' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, AnimPropB) == 0x000200, "Member 'UFBAnimationDefinition::AnimPropB' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, AnimPropB1_BlendInTime) == 0x000228, "Member 'UFBAnimationDefinition::AnimPropB1_BlendInTime' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, AnimPropB1_BlendOutTime) == 0x00022C, "Member 'UFBAnimationDefinition::AnimPropB1_BlendOutTime' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, AnimPropB1) == 0x000230, "Member 'UFBAnimationDefinition::AnimPropB1' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, AnimPropC) == 0x000258, "Member 'UFBAnimationDefinition::AnimPropC' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, AnimAVoiceIDs) == 0x000280, "Member 'UFBAnimationDefinition::AnimAVoiceIDs' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, AnimBVoiceIDs) == 0x000290, "Member 'UFBAnimationDefinition::AnimBVoiceIDs' has a wrong offset!");
static_assert(offsetof(UFBAnimationDefinition, AnimCVoiceIDs) == 0x0002A0, "Member 'UFBAnimationDefinition::AnimCVoiceIDs' has a wrong offset!");

// Class CharacterInteraction.InteractionPropsDrag
// 0x01B0 (0x0310 - 0x0160)
class UInteractionPropsDrag final : public UDragInteraction
{
public:
	bool                                          EnableInteractionUpdate;                           // 0x0160(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentTickOperateIndex;                           // 0x0164(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TiltAngle;                                         // 0x0168(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YawAngle;                                          // 0x016C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, class UFBAnimationDefinition*> PropsAnimDefinition;                               // 0x0170(0x0050)(Edit, NativeAccessSpecifierPublic)
	float                                         ShortAnimTriggerTime;                              // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AInteractionCharacter*                  InteractionCharacter;                              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCharacterInteractionComponent*         InteractionComponent;                              // 0x01D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFBAnimationDefinition*                 CurrentFBAnimationDefinition;                      // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CurrentEnergy;                                     // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TimeCounter;                                       // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CurrentTimeAttenuationThreshold;                   // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractionPropsDrag*                  CurrentTickOperate;                                // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AInteractionCharacter*                  CurrentProp;                                       // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimMontage*                           AnimAMontage;                                      // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimMontage*                           AnimBMontage;                                      // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimMontage*                           AnimBEndMontage;                                   // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimMontage*                           AnimCMontage;                                      // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_220[0x98];                                     // 0x0220(0x0098)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeltaSeconds;                                      // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             HitTransform;                                      // 0x02C0(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          bShowMouseCursor;                                  // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPlayAnimC;                                        // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPlayAnimB;                                        // 0x02F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F3[0x5];                                      // 0x02F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          AnimInstance;                                      // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           TimerHandle;                                       // 0x0300(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_308[0x8];                                      // 0x0308(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ReSetCurrentEnergy();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InteractionPropsDrag">();
	}
	static class UInteractionPropsDrag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractionPropsDrag>();
	}
};
static_assert(alignof(UInteractionPropsDrag) == 0x000010, "Wrong alignment on UInteractionPropsDrag");
static_assert(sizeof(UInteractionPropsDrag) == 0x000310, "Wrong size on UInteractionPropsDrag");
static_assert(offsetof(UInteractionPropsDrag, EnableInteractionUpdate) == 0x000160, "Member 'UInteractionPropsDrag::EnableInteractionUpdate' has a wrong offset!");
static_assert(offsetof(UInteractionPropsDrag, CurrentTickOperateIndex) == 0x000164, "Member 'UInteractionPropsDrag::CurrentTickOperateIndex' has a wrong offset!");
static_assert(offsetof(UInteractionPropsDrag, TiltAngle) == 0x000168, "Member 'UInteractionPropsDrag::TiltAngle' has a wrong offset!");
static_assert(offsetof(UInteractionPropsDrag, YawAngle) == 0x00016C, "Member 'UInteractionPropsDrag::YawAngle' has a wrong offset!");
static_assert(offsetof(UInteractionPropsDrag, PropsAnimDefinition) == 0x000170, "Member 'UInteractionPropsDrag::PropsAnimDefinition' has a wrong offset!");
static_assert(offsetof(UInteractionPropsDrag, ShortAnimTriggerTime) == 0x0001C0, "Member 'UInteractionPropsDrag::ShortAnimTriggerTime' has a wrong offset!");
static_assert(offsetof(UInteractionPropsDrag, InteractionCharacter) == 0x0001C8, "Member 'UInteractionPropsDrag::InteractionCharacter' has a wrong offset!");
static_assert(offsetof(UInteractionPropsDrag, InteractionComponent) == 0x0001D0, "Member 'UInteractionPropsDrag::InteractionComponent' has a wrong offset!");
static_assert(offsetof(UInteractionPropsDrag, CurrentFBAnimationDefinition) == 0x0001D8, "Member 'UInteractionPropsDrag::CurrentFBAnimationDefinition' has a wrong offset!");
static_assert(offsetof(UInteractionPropsDrag, CurrentEnergy) == 0x0001E0, "Member 'UInteractionPropsDrag::CurrentEnergy' has a wrong offset!");
static_assert(offsetof(UInteractionPropsDrag, TimeCounter) == 0x0001E4, "Member 'UInteractionPropsDrag::TimeCounter' has a wrong offset!");
static_assert(offsetof(UInteractionPropsDrag, CurrentTimeAttenuationThreshold) == 0x0001E8, "Member 'UInteractionPropsDrag::CurrentTimeAttenuationThreshold' has a wrong offset!");
static_assert(offsetof(UInteractionPropsDrag, CurrentTickOperate) == 0x0001F0, "Member 'UInteractionPropsDrag::CurrentTickOperate' has a wrong offset!");
static_assert(offsetof(UInteractionPropsDrag, CurrentProp) == 0x0001F8, "Member 'UInteractionPropsDrag::CurrentProp' has a wrong offset!");
static_assert(offsetof(UInteractionPropsDrag, AnimAMontage) == 0x000200, "Member 'UInteractionPropsDrag::AnimAMontage' has a wrong offset!");
static_assert(offsetof(UInteractionPropsDrag, AnimBMontage) == 0x000208, "Member 'UInteractionPropsDrag::AnimBMontage' has a wrong offset!");
static_assert(offsetof(UInteractionPropsDrag, AnimBEndMontage) == 0x000210, "Member 'UInteractionPropsDrag::AnimBEndMontage' has a wrong offset!");
static_assert(offsetof(UInteractionPropsDrag, AnimCMontage) == 0x000218, "Member 'UInteractionPropsDrag::AnimCMontage' has a wrong offset!");
static_assert(offsetof(UInteractionPropsDrag, DeltaSeconds) == 0x0002B8, "Member 'UInteractionPropsDrag::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(UInteractionPropsDrag, HitTransform) == 0x0002C0, "Member 'UInteractionPropsDrag::HitTransform' has a wrong offset!");
static_assert(offsetof(UInteractionPropsDrag, bShowMouseCursor) == 0x0002F0, "Member 'UInteractionPropsDrag::bShowMouseCursor' has a wrong offset!");
static_assert(offsetof(UInteractionPropsDrag, bPlayAnimC) == 0x0002F1, "Member 'UInteractionPropsDrag::bPlayAnimC' has a wrong offset!");
static_assert(offsetof(UInteractionPropsDrag, bPlayAnimB) == 0x0002F2, "Member 'UInteractionPropsDrag::bPlayAnimB' has a wrong offset!");
static_assert(offsetof(UInteractionPropsDrag, AnimInstance) == 0x0002F8, "Member 'UInteractionPropsDrag::AnimInstance' has a wrong offset!");
static_assert(offsetof(UInteractionPropsDrag, TimerHandle) == 0x000300, "Member 'UInteractionPropsDrag::TimerHandle' has a wrong offset!");

// Class CharacterInteraction.PropUpdateDefinition
// 0x0050 (0x0080 - 0x0030)
class UPropUpdateDefinition final : public UDataAsset
{
public:
	float                                         DragSpeedMultiplying;                              // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
