#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CheckClashModifierBuffer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CheckClashModifierBuffer.CheckClashModifierBuffer_C
// 0x0028 (0x0118 - 0x00F0)
class UCheckClashModifierBuffer_C final : public UCustomGameAbilityBuffer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         ModifierID;                                        // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ModifierCount;                                     // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAddNew;                                           // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAbilityComponentBase*>          Targets;                                           // 0x0108(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void OnRemoveModifier(class UModifier* InModifier);
	void OnApplyModifier(class UModifier* InModifier);
	void K2_ReceiveInitialize(const TArray<struct FParamInfo>& Info, const class UGameAbilityComponent* LpInstigator);
	void K2_ReceiveActive(const class UObject* Instigator);
	void K2_ReceiveDeActive(const class UGameAbilityComponent* Pawn);
	void OnModifierPreApply(class UModifier* InModifier);
	void OnModifierRemove(class UModifier* InModifier);
	void ExecuteUbergraph_CheckClashModifierBuffer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CheckClashModifierBuffer_C">();
	}
	static class UCheckClashModifierBuffer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCheckClashModifierBuffer_C>();
	}
};
static_assert(alignof(UCheckClashModifierBuffer_C) == 0x000008, "Wrong alignment on UCheckClashModifierBuffer_C");
static_assert(sizeof(UCheckClashModifierBuffer_C) == 0x000118, "Wrong size on UCheckClashModifierBuffer_C");
static_assert(offsetof(UCheckClashModifierBuffer_C, UberGraphFrame) == 0x0000F0, "Member 'UCheckClashModifierBuffer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCheckClashModifierBuffer_C, ModifierID) == 0x0000F8, "Member 'UCheckClashModifierBuffer_C::ModifierID' has a wrong offset!");
static_assert(offsetof(UCheckClashModifierBuffer_C, ModifierCount) == 0x0000FC, "Member 'UCheckClashModifierBuffer_C::ModifierCount' has a wrong offset!");
static_assert(offsetof(UCheckClashModifierBuffer_C, bAddNew) == 0x000100, "Member 'UCheckClashModifierBuffer_C::bAddNew' has a wrong offset!");
static_assert(offsetof(UCheckClashModifierBuffer_C, Targets) == 0x000108, "Member 'UCheckClashModifierBuffer_C::Targets' has a wrong offset!");

}

