#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CheckClashModifierBuffer

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function CheckClashModifierBuffer.CheckClashModifierBuffer_C.OnRemoveModifier
// 0x0028 (0x0028 - 0x0000)
struct CheckClashModifierBuffer_C_OnRemoveModifier final
{
public:
	class UModifier*                              InModifier;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponentBase*                  CallFunc_GetTarget_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponentBase*                  CallFunc_GetLauncher_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetID_ReturnValue;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CheckClashModifierBuffer_C_OnRemoveModifier) == 0x000008, "Wrong alignment on CheckClashModifierBuffer_C_OnRemoveModifier");
static_assert(sizeof(CheckClashModifierBuffer_C_OnRemoveModifier) == 0x000028, "Wrong size on CheckClashModifierBuffer_C_OnRemoveModifier");
static_assert(offsetof(CheckClashModifierBuffer_C_OnRemoveModifier, InModifier) == 0x000000, "Member 'CheckClashModifierBuffer_C_OnRemoveModifier::InModifier' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_OnRemoveModifier, CallFunc_GetTarget_ReturnValue) == 0x000008, "Member 'CheckClashModifierBuffer_C_OnRemoveModifier::CallFunc_GetTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_OnRemoveModifier, CallFunc_GetLauncher_ReturnValue) == 0x000010, "Member 'CheckClashModifierBuffer_C_OnRemoveModifier::CallFunc_GetLauncher_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_OnRemoveModifier, CallFunc_Array_RemoveItem_ReturnValue) == 0x000018, "Member 'CheckClashModifierBuffer_C_OnRemoveModifier::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_OnRemoveModifier, CallFunc_GetID_ReturnValue) == 0x00001C, "Member 'CheckClashModifierBuffer_C_OnRemoveModifier::CallFunc_GetID_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_OnRemoveModifier, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000020, "Member 'CheckClashModifierBuffer_C_OnRemoveModifier::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_OnRemoveModifier, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000021, "Member 'CheckClashModifierBuffer_C_OnRemoveModifier::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_OnRemoveModifier, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'CheckClashModifierBuffer_C_OnRemoveModifier::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function CheckClashModifierBuffer.CheckClashModifierBuffer_C.OnApplyModifier
// 0x0048 (0x0048 - 0x0000)
struct CheckClashModifierBuffer_C_OnApplyModifier final
{
public:
	class UModifier*                              InModifier;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAddTarget;                                        // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  CallFunc_GetTarget_ReturnValue;                    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponentBase*                  CallFunc_GetLauncher_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetID_ReturnValue;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CheckClashModifierBuffer_C_OnApplyModifier) == 0x000008, "Wrong alignment on CheckClashModifierBuffer_C_OnApplyModifier");
static_assert(sizeof(CheckClashModifierBuffer_C_OnApplyModifier) == 0x000048, "Wrong size on CheckClashModifierBuffer_C_OnApplyModifier");
static_assert(offsetof(CheckClashModifierBuffer_C_OnApplyModifier, InModifier) == 0x000000, "Member 'CheckClashModifierBuffer_C_OnApplyModifier::InModifier' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_OnApplyModifier, bAddTarget) == 0x000008, "Member 'CheckClashModifierBuffer_C_OnApplyModifier::bAddTarget' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_OnApplyModifier, CallFunc_GetTarget_ReturnValue) == 0x000010, "Member 'CheckClashModifierBuffer_C_OnApplyModifier::CallFunc_GetTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_OnApplyModifier, CallFunc_GetLauncher_ReturnValue) == 0x000018, "Member 'CheckClashModifierBuffer_C_OnApplyModifier::CallFunc_GetLauncher_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_OnApplyModifier, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'CheckClashModifierBuffer_C_OnApplyModifier::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_OnApplyModifier, CallFunc_GetID_ReturnValue) == 0x000024, "Member 'CheckClashModifierBuffer_C_OnApplyModifier::CallFunc_GetID_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_OnApplyModifier, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000028, "Member 'CheckClashModifierBuffer_C_OnApplyModifier::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_OnApplyModifier, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000029, "Member 'CheckClashModifierBuffer_C_OnApplyModifier::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_OnApplyModifier, CallFunc_BooleanAND_ReturnValue) == 0x00002A, "Member 'CheckClashModifierBuffer_C_OnApplyModifier::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_OnApplyModifier, CallFunc_Array_Get_Item) == 0x000030, "Member 'CheckClashModifierBuffer_C_OnApplyModifier::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_OnApplyModifier, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'CheckClashModifierBuffer_C_OnApplyModifier::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_OnApplyModifier, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'CheckClashModifierBuffer_C_OnApplyModifier::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_OnApplyModifier, CallFunc_Array_Add_ReturnValue) == 0x000040, "Member 'CheckClashModifierBuffer_C_OnApplyModifier::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_OnApplyModifier, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000044, "Member 'CheckClashModifierBuffer_C_OnApplyModifier::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function CheckClashModifierBuffer.CheckClashModifierBuffer_C.K2_ReceiveInitialize
// 0x0018 (0x0018 - 0x0000)
struct CheckClashModifierBuffer_C_K2_ReceiveInitialize final
{
public:
	TArray<struct FParamInfo>                     Info;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	const class UGameAbilityComponent*            LpInstigator;                                      // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CheckClashModifierBuffer_C_K2_ReceiveInitialize) == 0x000008, "Wrong alignment on CheckClashModifierBuffer_C_K2_ReceiveInitialize");
static_assert(sizeof(CheckClashModifierBuffer_C_K2_ReceiveInitialize) == 0x000018, "Wrong size on CheckClashModifierBuffer_C_K2_ReceiveInitialize");
static_assert(offsetof(CheckClashModifierBuffer_C_K2_ReceiveInitialize, Info) == 0x000000, "Member 'CheckClashModifierBuffer_C_K2_ReceiveInitialize::Info' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_K2_ReceiveInitialize, LpInstigator) == 0x000010, "Member 'CheckClashModifierBuffer_C_K2_ReceiveInitialize::LpInstigator' has a wrong offset!");

// Function CheckClashModifierBuffer.CheckClashModifierBuffer_C.K2_ReceiveActive
// 0x0008 (0x0008 - 0x0000)
struct CheckClashModifierBuffer_C_K2_ReceiveActive final
{
public:
	const class UObject*                          Instigator;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CheckClashModifierBuffer_C_K2_ReceiveActive) == 0x000008, "Wrong alignment on CheckClashModifierBuffer_C_K2_ReceiveActive");
static_assert(sizeof(CheckClashModifierBuffer_C_K2_ReceiveActive) == 0x000008, "Wrong size on CheckClashModifierBuffer_C_K2_ReceiveActive");
static_assert(offsetof(CheckClashModifierBuffer_C_K2_ReceiveActive, Instigator) == 0x000000, "Member 'CheckClashModifierBuffer_C_K2_ReceiveActive::Instigator' has a wrong offset!");

// Function CheckClashModifierBuffer.CheckClashModifierBuffer_C.K2_ReceiveDeActive
// 0x0008 (0x0008 - 0x0000)
struct CheckClashModifierBuffer_C_K2_ReceiveDeActive final
{
public:
	const class UGameAbilityComponent*            Pawn;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CheckClashModifierBuffer_C_K2_ReceiveDeActive) == 0x000008, "Wrong alignment on CheckClashModifierBuffer_C_K2_ReceiveDeActive");
static_assert(sizeof(CheckClashModifierBuffer_C_K2_ReceiveDeActive) == 0x000008, "Wrong size on CheckClashModifierBuffer_C_K2_ReceiveDeActive");
static_assert(offsetof(CheckClashModifierBuffer_C_K2_ReceiveDeActive, Pawn) == 0x000000, "Member 'CheckClashModifierBuffer_C_K2_ReceiveDeActive::Pawn' has a wrong offset!");

// Function CheckClashModifierBuffer.CheckClashModifierBuffer_C.OnModifierPreApply
// 0x0008 (0x0008 - 0x0000)
struct CheckClashModifierBuffer_C_OnModifierPreApply final
{
public:
	class UModifier*                              InModifier;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CheckClashModifierBuffer_C_OnModifierPreApply) == 0x000008, "Wrong alignment on CheckClashModifierBuffer_C_OnModifierPreApply");
static_assert(sizeof(CheckClashModifierBuffer_C_OnModifierPreApply) == 0x000008, "Wrong size on CheckClashModifierBuffer_C_OnModifierPreApply");
static_assert(offsetof(CheckClashModifierBuffer_C_OnModifierPreApply, InModifier) == 0x000000, "Member 'CheckClashModifierBuffer_C_OnModifierPreApply::InModifier' has a wrong offset!");

// Function CheckClashModifierBuffer.CheckClashModifierBuffer_C.OnModifierRemove
// 0x0008 (0x0008 - 0x0000)
struct CheckClashModifierBuffer_C_OnModifierRemove final
{
public:
	class UModifier*                              InModifier;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CheckClashModifierBuffer_C_OnModifierRemove) == 0x000008, "Wrong alignment on CheckClashModifierBuffer_C_OnModifierRemove");
static_assert(sizeof(CheckClashModifierBuffer_C_OnModifierRemove) == 0x000008, "Wrong size on CheckClashModifierBuffer_C_OnModifierRemove");
static_assert(offsetof(CheckClashModifierBuffer_C_OnModifierRemove, InModifier) == 0x000000, "Member 'CheckClashModifierBuffer_C_OnModifierRemove::InModifier' has a wrong offset!");

// Function CheckClashModifierBuffer.CheckClashModifierBuffer_C.ExecuteUbergraph_CheckClashModifierBuffer
// 0x0078 (0x0078 - 0x0000)
struct CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParamInfo>                     K2Node_Event_Info;                                 // 0x0008(0x0010)(ConstParm, ReferenceParm)
	const class UGameAbilityComponent*            K2Node_Event_lpInstigator;                         // 0x0018(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetParamboolValue_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetParamintValue_ReturnValue;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UObject*                          K2Node_Event_Instigator;                           // 0x0028(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParamintValue_ReturnValue_1;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UModifier* InModifier)>  K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	const class UGameAbilityComponent*            K2Node_Event_Pawn;                                 // 0x0048(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UModifier* InModifier)>  K2Node_CreateDelegate_OutputDelegate_1;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UModifier*                              K2Node_CustomEvent_InModifier_1;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UModifier*                              K2Node_CustomEvent_InModifier;                     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer) == 0x000008, "Wrong alignment on CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer");
static_assert(sizeof(CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer) == 0x000078, "Wrong size on CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer");
static_assert(offsetof(CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer, EntryPoint) == 0x000000, "Member 'CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer::EntryPoint' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer, K2Node_Event_Info) == 0x000008, "Member 'CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer::K2Node_Event_Info' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer, K2Node_Event_lpInstigator) == 0x000018, "Member 'CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer::K2Node_Event_lpInstigator' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer, CallFunc_GetParamboolValue_ReturnValue) == 0x000020, "Member 'CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer::CallFunc_GetParamboolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer, CallFunc_GetParamintValue_ReturnValue) == 0x000024, "Member 'CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer::CallFunc_GetParamintValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer, K2Node_Event_Instigator) == 0x000028, "Member 'CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer::K2Node_Event_Instigator' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer, CallFunc_GetParamintValue_ReturnValue_1) == 0x000030, "Member 'CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer::CallFunc_GetParamintValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer, K2Node_Event_Pawn) == 0x000048, "Member 'CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer::K2Node_Event_Pawn' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000054, "Member 'CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer, K2Node_CustomEvent_InModifier_1) == 0x000068, "Member 'CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer::K2Node_CustomEvent_InModifier_1' has a wrong offset!");
static_assert(offsetof(CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer, K2Node_CustomEvent_InModifier) == 0x000070, "Member 'CheckClashModifierBuffer_C_ExecuteUbergraph_CheckClashModifierBuffer::K2Node_CustomEvent_InModifier' has a wrong offset!");

}

