#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChessMap

#include "Basic.hpp"


namespace SDK
{

// Enum ChessMap.EChessMapPathType
// NumValues: 0x0004
enum class EChessMapPathType : uint8
{
	None                                     = 0,
	OceanFlow                                = 1,
	RichMan                                  = 2,
	EChessMapPathType_MAX                    = 3,
};

// ScriptStruct ChessMap.NPCActorPool_Region
// 0x0028 (0x0028 - 0x0000)
struct FNPCActorPool_Region final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AChessFlowNpcBase*>              AllNpc_Array;                                      // 0x0008(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<class AChessFlowNpcBase*>              RecycleNpc_Array;                                  // 0x0018(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNPCActorPool_Region) == 0x000008, "Wrong alignment on FNPCActorPool_Region");
static_assert(sizeof(FNPCActorPool_Region) == 0x000028, "Wrong size on FNPCActorPool_Region");
static_assert(offsetof(FNPCActorPool_Region, AllNpc_Array) == 0x000008, "Member 'FNPCActorPool_Region::AllNpc_Array' has a wrong offset!");
static_assert(offsetof(FNPCActorPool_Region, RecycleNpc_Array) == 0x000018, "Member 'FNPCActorPool_Region::RecycleNpc_Array' has a wrong offset!");

// ScriptStruct ChessMap.ChessMapPoolData
// 0x0010 (0x0010 - 0x0000)
struct FChessMapPoolData final
{
public:
	TArray<class AChessBase*>                     List;                                              // 0x0000(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChessMapPoolData) == 0x000008, "Wrong alignment on FChessMapPoolData");
static_assert(sizeof(FChessMapPoolData) == 0x000010, "Wrong size on FChessMapPoolData");
static_assert(offsetof(FChessMapPoolData, List) == 0x000000, "Member 'FChessMapPoolData::List' has a wrong offset!");

}

