#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChessMap

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "ChessMap_structs.hpp"


namespace SDK
{

// Class ChessMap.ChessBase
// 0x0030 (0x0258 - 0x0228)
class AChessBase : public AActor
{
public:
	class AChessRegion*                           RegionActor;                                       // 0x0228(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_230[0x8];                                      // 0x0230(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        Uid;                                               // 0x0238(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PosX;                                              // 0x023C(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PosY;                                              // 0x0240(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TplId;                                             // 0x0244(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_248[0x10];                                     // 0x0248(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FString GetClassName();
	int32 GetTplId();
	bool HasTag(class FName InTagName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChessBase">();
	}
	static class AChessBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AChessBase>();
	}
};
static_assert(alignof(AChessBase) == 0x000008, "Wrong alignment on AChessBase");
static_assert(sizeof(AChessBase) == 0x000258, "Wrong size on AChessBase");
static_assert(offsetof(AChessBase, RegionActor) == 0x000228, "Member 'AChessBase::RegionActor' has a wrong offset!");
static_assert(offsetof(AChessBase, Uid) == 0x000238, "Member 'AChessBase::Uid' has a wrong offset!");
static_assert(offsetof(AChessBase, PosX) == 0x00023C, "Member 'AChessBase::PosX' has a wrong offset!");
static_assert(offsetof(AChessBase, PosY) == 0x000240, "Member 'AChessBase::PosY' has a wrong offset!");
static_assert(offsetof(AChessBase, TplId) == 0x000244, "Member 'AChessBase::TplId' has a wrong offset!");

// Class ChessMap.ChessBullet
// 0x0008 (0x0230 - 0x0228)
class AChessBullet final : public AActor
{
public:
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnOverlapBegin(class UPrimitiveComponent* OverlappedComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnOverlapEnd(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChessBullet">();
	}
	static class AChessBullet* GetDefaultObj()
	{
		return GetDefaultObjImpl<AChessBullet>();
	}
};
static_assert(alignof(AChessBullet) == 0x000008, "Wrong alignment on AChessBullet");
static_assert(sizeof(AChessBullet) == 0x000230, "Wrong size on AChessBullet");

// Class ChessMap.ChessGround
// 0x0020 (0x0278 - 0x0258)
class AChessGround : public AChessBase
{
public:
	TArray<class AChessObject*>                   Objects;                                           // 0x0258(0x0010)(Net, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_268[0x10];                                     // 0x0268(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CheckObject(const class FString& ClassName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChessGround">();
	}
	static class AChessGround* GetDefaultObj()
	{
		return GetDefaultObjImpl<AChessGround>();
	}
};
static_assert(alignof(AChessGround) == 0x000008, "Wrong alignment on AChessGround");
static_assert(sizeof(AChessGround) == 0x000278, "Wrong size on AChessGround");
static_assert(offsetof(AChessGround, Objects) == 0x000258, "Member 'AChessGround::Objects' has a wrong offset!");

// Class ChessMap.ChessMapActor
// 0x0128 (0x0350 - 0x0228)
class AChessMapActor final : public AActor
{
public:
	bool                                          OpenDebug;                                         // 0x0228(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AChessPool*                             ChessPool;                                         // 0x0230(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AChessRegion*>                   AllRegions;                                        // 0x0238(0x0010)(Net, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	EChessMapPathType                             CurMapPathType;                                    // 0x0248(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      PlayerController;                                  // 0x0250(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_258[0xE0];                                     // 0x0258(0x00E0)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentRegionId;                                   // 0x0338(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33C[0x14];                                     // 0x033C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRsp_CurMapPathType();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChessMapActor">();
	}
	static class AChessMapActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AChessMapActor>();
	}
};
static_assert(alignof(AChessMapActor) == 0x000008, "Wrong alignment on AChessMapActor");
static_assert(sizeof(AChessMapActor) == 0x000350, "Wrong size on AChessMapActor");
static_assert(offsetof(AChessMapActor, OpenDebug) == 0x000228, "Member 'AChessMapActor::OpenDebug' has a wrong offset!");
static_assert(offsetof(AChessMapActor, ChessPool) == 0x000230, "Member 'AChessMapActor::ChessPool' has a wrong offset!");
static_assert(offsetof(AChessMapActor, AllRegions) == 0x000238, "Member 'AChessMapActor::AllRegions' has a wrong offset!");
static_assert(offsetof(AChessMapActor, CurMapPathType) == 0x000248, "Member 'AChessMapActor::CurMapPathType' has a wrong offset!");
static_assert(offsetof(AChessMapActor, PlayerController) == 0x000250, "Member 'AChessMapActor::PlayerController' has a wrong offset!");
static_assert(offsetof(AChessMapActor, CurrentRegionId) == 0x000338, "Member 'AChessMapActor::CurrentRegionId' has a wrong offset!");

// Class ChessMap.ChessMapLibrary
// 0x0000 (0x0028 - 0x0028)
class UChessMapLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChessMapLibrary">();
	}
	static class UChessMapLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChessMapLibrary>();
	}
};
static_assert(alignof(UChessMapLibrary) == 0x000008, "Wrong alignment on UChessMapLibrary");
static_assert(sizeof(UChessMapLibrary) == 0x000028, "Wrong size on UChessMapLibrary");

// Class ChessMap.ChessNpcBase
// 0x0010 (0x04D0 - 0x04C0)
#pragma pack(push, 0x1)
class alignas(0x10) AChessNpcBase : public ACharacter
{
public:
	uint8                                         Pad_4B8[0x8];                                      // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AChessGround*                           CurrentGroundActor;                                // 0x04C0(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChessNpcBase">();
	}
	static class AChessNpcBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AChessNpcBase>();
	}
};
#pragma pack(pop)
static_assert(alignof(AChessNpcBase) == 0x000010, "Wrong alignment on AChessNpcBase");
static_assert(sizeof(AChessNpcBase) == 0x0004D0, "Wrong size on AChessNpcBase");
static_assert(offsetof(AChessNpcBase, CurrentGroundActor) == 0x0004C0, "Member 'AChessNpcBase::CurrentGroundActor' has a wrong offset!");

// Class ChessMap.ChessFlowNpcBase
// 0x0020 (0x04F0 - 0x04D0)
class AChessFlowNpcBase final : public AChessNpcBase
{
public:
	uint8                                         Pad_4C8[0x10];                                     // 0x04C8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class USphereComponent*                       SphereComp;                                        // 0x04D8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4E0[0x10];                                     // 0x04E0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnOverlapBegin(class UPrimitiveComponent* OverlappedComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnOverlapEnd(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChessFlowNpcBase">();
	}
	static class AChessFlowNpcBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AChessFlowNpcBase>();
	}
};
static_assert(alignof(AChessFlowNpcBase) == 0x000010, "Wrong alignment on AChessFlowNpcBase");
static_assert(sizeof(AChessFlowNpcBase) == 0x0004F0, "Wrong size on AChessFlowNpcBase");
static_assert(offsetof(AChessFlowNpcBase, SphereComp) == 0x0004D8, "Member 'AChessFlowNpcBase::SphereComp' has a wrong offset!");

// Class ChessMap.ChessObject
// 0x0000 (0x0258 - 0x0258)
class AChessObject : public AChessBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChessObject">();
	}
	static class AChessObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<AChessObject>();
	}
};
static_assert(alignof(AChessObject) == 0x000008, "Wrong alignment on AChessObject");
static_assert(sizeof(AChessObject) == 0x000258, "Wrong size on AChessObject");

// Class ChessMap.ChessPool
// 0x00A0 (0x02C8 - 0x0228)
class AChessPool final : public AActor
{
public:
	TMap<class UClass*, struct FChessMapPoolData> GridPool;                                          // 0x0228(0x0050)(Transient, NativeAccessSpecifierPublic)
	TMap<int32, struct FNPCActorPool_Region>      Region_NpcPool;                                    // 0x0278(0x0050)(Transient, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChessPool">();
	}
	static class AChessPool* GetDefaultObj()
	{
		return GetDefaultObjImpl<AChessPool>();
	}
};
static_assert(alignof(AChessPool) == 0x000008, "Wrong alignment on AChessPool");
static_assert(sizeof(AChessPool) == 0x0002C8, "Wrong size on AChessPool");
static_assert(offsetof(AChessPool, GridPool) == 0x000228, "Member 'AChessPool::GridPool' has a wrong offset!");
static_assert(offsetof(AChessPool, Region_NpcPool) == 0x000278, "Member 'AChessPool::Region_NpcPool' has a wrong offset!");

// Class ChessMap.ChessRegion
// 0x00E8 (0x0310 - 0x0228)
class AChessRegion final : public AActor
{
public:
	TArray<class AChessObject*>                   AllObjects;                                        // 0x0228(0x0010)(Net, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<class AChessGround*>                   AllGrounds;                                        // 0x0238(0x0010)(Net, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	class AChessMapActor*                         ChessMapActor;                                     // 0x0248(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RegionId;                                          // 0x0250(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AChessBase*>                     AllClassObject;                                    // 0x0258(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TMap<int32, class AChessNpcBase*>             AllNpc;                                            // 0x0268(0x0050)(Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B8[0x58];                                     // 0x02B8(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChessRegion">();
	}
	static class AChessRegion* GetDefaultObj()
	{
		return GetDefaultObjImpl<AChessRegion>();
	}
};
static_assert(alignof(AChessRegion) == 0x000008, "Wrong alignment on AChessRegion");
static_assert(sizeof(AChessRegion) == 0x000310, "Wrong size on AChessRegion");
static_assert(offsetof(AChessRegion, AllObjects) == 0x000228, "Member 'AChessRegion::AllObjects' has a wrong offset!");
static_assert(offsetof(AChessRegion, AllGrounds) == 0x000238, "Member 'AChessRegion::AllGrounds' has a wrong offset!");
static_assert(offsetof(AChessRegion, ChessMapActor) == 0x000248, "Member 'AChessRegion::ChessMapActor' has a wrong offset!");
static_assert(offsetof(AChessRegion, RegionId) == 0x000250, "Member 'AChessRegion::RegionId' has a wrong offset!");
static_assert(offsetof(AChessRegion, AllClassObject) == 0x000258, "Member 'AChessRegion::AllClassObject' has a wrong offset!");
static_assert(offsetof(AChessRegion, AllNpc) == 0x000268, "Member 'AChessRegion::AllNpc' has a wrong offset!");

}

