#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClampAttributeBuffer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function ClampAttributeBuffer.ClampAttributeBuffer_C.GetAllParamsValue
// 0x0020 (0x0020 - 0x0000)
struct ClampAttributeBuffer_C_GetAllParamsValue final
{
public:
	float                                         CallFunc_GetAttributeValue_ReturnValue;            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetFVector2DValue_ReturnValue;            // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetParamboolValue_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InitAbilityAttribute_ReturnValue;         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ClampAttributeBuffer_C_GetAllParamsValue) == 0x000004, "Wrong alignment on ClampAttributeBuffer_C_GetAllParamsValue");
static_assert(sizeof(ClampAttributeBuffer_C_GetAllParamsValue) == 0x000020, "Wrong size on ClampAttributeBuffer_C_GetAllParamsValue");
static_assert(offsetof(ClampAttributeBuffer_C_GetAllParamsValue, CallFunc_GetAttributeValue_ReturnValue) == 0x000000, "Member 'ClampAttributeBuffer_C_GetAllParamsValue::CallFunc_GetAttributeValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_GetAllParamsValue, CallFunc_MakeVector2D_ReturnValue) == 0x000004, "Member 'ClampAttributeBuffer_C_GetAllParamsValue::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_GetAllParamsValue, CallFunc_GetFVector2DValue_ReturnValue) == 0x00000C, "Member 'ClampAttributeBuffer_C_GetAllParamsValue::CallFunc_GetFVector2DValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_GetAllParamsValue, CallFunc_GetParamboolValue_ReturnValue) == 0x000014, "Member 'ClampAttributeBuffer_C_GetAllParamsValue::CallFunc_GetParamboolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_GetAllParamsValue, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'ClampAttributeBuffer_C_GetAllParamsValue::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_GetAllParamsValue, CallFunc_InitAbilityAttribute_ReturnValue) == 0x00001C, "Member 'ClampAttributeBuffer_C_GetAllParamsValue::CallFunc_InitAbilityAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_GetAllParamsValue, CallFunc_Greater_IntInt_ReturnValue) == 0x00001D, "Member 'ClampAttributeBuffer_C_GetAllParamsValue::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_GetAllParamsValue, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00001E, "Member 'ClampAttributeBuffer_C_GetAllParamsValue::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");

// Function ClampAttributeBuffer.ClampAttributeBuffer_C.SearchTypeByString
// 0x0050 (0x0050 - 0x0000)
struct ClampAttributeBuffer_C_SearchTypeByString final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	EAttributeType                                AttributeType_0;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SearchSuccess_;                                    // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable;                                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable_1;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ClampAttributeBuffer_C_SearchTypeByString) == 0x000008, "Wrong alignment on ClampAttributeBuffer_C_SearchTypeByString");
static_assert(sizeof(ClampAttributeBuffer_C_SearchTypeByString) == 0x000050, "Wrong size on ClampAttributeBuffer_C_SearchTypeByString");
static_assert(offsetof(ClampAttributeBuffer_C_SearchTypeByString, Name_0) == 0x000000, "Member 'ClampAttributeBuffer_C_SearchTypeByString::Name_0' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_SearchTypeByString, AttributeType_0) == 0x000010, "Member 'ClampAttributeBuffer_C_SearchTypeByString::AttributeType_0' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_SearchTypeByString, SearchSuccess_) == 0x000011, "Member 'ClampAttributeBuffer_C_SearchTypeByString::SearchSuccess_' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_SearchTypeByString, CallFunc_MakeLiteralInt_ReturnValue) == 0x000014, "Member 'ClampAttributeBuffer_C_SearchTypeByString::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_SearchTypeByString, ___int_Variable) == 0x000018, "Member 'ClampAttributeBuffer_C_SearchTypeByString::___int_Variable' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_SearchTypeByString, ___int_Variable_1) == 0x00001C, "Member 'ClampAttributeBuffer_C_SearchTypeByString::___int_Variable_1' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_SearchTypeByString, CallFunc_Conv_IntToByte_ReturnValue) == 0x000020, "Member 'ClampAttributeBuffer_C_SearchTypeByString::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_SearchTypeByString, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'ClampAttributeBuffer_C_SearchTypeByString::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_SearchTypeByString, CallFunc_GetValidValue_ReturnValue) == 0x000028, "Member 'ClampAttributeBuffer_C_SearchTypeByString::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_SearchTypeByString, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000029, "Member 'ClampAttributeBuffer_C_SearchTypeByString::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_SearchTypeByString, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000030, "Member 'ClampAttributeBuffer_C_SearchTypeByString::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_SearchTypeByString, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000040, "Member 'ClampAttributeBuffer_C_SearchTypeByString::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_SearchTypeByString, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000041, "Member 'ClampAttributeBuffer_C_SearchTypeByString::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_SearchTypeByString, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000044, "Member 'ClampAttributeBuffer_C_SearchTypeByString::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_SearchTypeByString, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'ClampAttributeBuffer_C_SearchTypeByString::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function ClampAttributeBuffer.ClampAttributeBuffer_C.K2_ReceiveInitialize
// 0x0018 (0x0018 - 0x0000)
struct ClampAttributeBuffer_C_K2_ReceiveInitialize final
{
public:
	TArray<struct FParamInfo>                     Info_0;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	const class UGameAbilityComponent*            LpInstigator;                                      // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClampAttributeBuffer_C_K2_ReceiveInitialize) == 0x000008, "Wrong alignment on ClampAttributeBuffer_C_K2_ReceiveInitialize");
static_assert(sizeof(ClampAttributeBuffer_C_K2_ReceiveInitialize) == 0x000018, "Wrong size on ClampAttributeBuffer_C_K2_ReceiveInitialize");
static_assert(offsetof(ClampAttributeBuffer_C_K2_ReceiveInitialize, Info_0) == 0x000000, "Member 'ClampAttributeBuffer_C_K2_ReceiveInitialize::Info_0' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_K2_ReceiveInitialize, LpInstigator) == 0x000010, "Member 'ClampAttributeBuffer_C_K2_ReceiveInitialize::LpInstigator' has a wrong offset!");

// Function ClampAttributeBuffer.ClampAttributeBuffer_C.K2_ReceiveTick
// 0x0010 (0x0010 - 0x0000)
struct ClampAttributeBuffer_C_K2_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGameAbilityComponent*            Pawn;                                              // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClampAttributeBuffer_C_K2_ReceiveTick) == 0x000008, "Wrong alignment on ClampAttributeBuffer_C_K2_ReceiveTick");
static_assert(sizeof(ClampAttributeBuffer_C_K2_ReceiveTick) == 0x000010, "Wrong size on ClampAttributeBuffer_C_K2_ReceiveTick");
static_assert(offsetof(ClampAttributeBuffer_C_K2_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'ClampAttributeBuffer_C_K2_ReceiveTick::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_K2_ReceiveTick, Pawn) == 0x000008, "Member 'ClampAttributeBuffer_C_K2_ReceiveTick::Pawn' has a wrong offset!");

// Function ClampAttributeBuffer.ClampAttributeBuffer_C.ExecuteUbergraph_ClampAttributeBuffer
// 0x0048 (0x0048 - 0x0000)
struct ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParamInfo>                     K2Node_Event_Info;                                 // 0x0008(0x0010)(ConstParm, ReferenceParm)
	const class UGameAbilityComponent*            K2Node_Event_lpInstigator;                         // 0x0018(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGameAbilityComponent*            K2Node_Event_Pawn;                                 // 0x0028(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAttributeValue_ReturnValue;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetValueToTargetAttribute_ReturnValue;    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer) == 0x000008, "Wrong alignment on ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer");
static_assert(sizeof(ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer) == 0x000048, "Wrong size on ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer");
static_assert(offsetof(ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer, EntryPoint) == 0x000000, "Member 'ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer::EntryPoint' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer, K2Node_Event_Info) == 0x000008, "Member 'ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer::K2Node_Event_Info' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer, K2Node_Event_lpInstigator) == 0x000018, "Member 'ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer::K2Node_Event_lpInstigator' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer, K2Node_Event_Pawn) == 0x000028, "Member 'ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer::K2Node_Event_Pawn' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer, CallFunc_GetAttributeValue_ReturnValue) == 0x000030, "Member 'ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer::CallFunc_GetAttributeValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer, CallFunc_BreakVector2D_X) == 0x000034, "Member 'ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer, CallFunc_BreakVector2D_Y) == 0x000038, "Member 'ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer, CallFunc_FClamp_ReturnValue) == 0x00003C, "Member 'ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer, CallFunc_SetValueToTargetAttribute_ReturnValue) == 0x000044, "Member 'ClampAttributeBuffer_C_ExecuteUbergraph_ClampAttributeBuffer::CallFunc_SetValueToTargetAttribute_ReturnValue' has a wrong offset!");

}

