#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClusterBullet_WWISE_Temporary

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ClusterBullet_WWISE_Temporary.ClusterBullet_WWISE_Temporary_C
// 0x0030 (0x0610 - 0x05E0)
#pragma pack(push, 0x1)
class alignas(0x10) AClusterBullet_WWISE_Temporary_C : public ABulletScreenReplicateEditor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         BulletInfoID;                                      // 0x05F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F4[0x4];                                      // 0x05F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 BulletLaunchSoundEvent;                            // 0x05F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ClusterBullet_WWISE_Temporary(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ClusterBullet_WWISE_Temporary_C">();
	}
	static class AClusterBullet_WWISE_Temporary_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AClusterBullet_WWISE_Temporary_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(AClusterBullet_WWISE_Temporary_C) == 0x000010, "Wrong alignment on AClusterBullet_WWISE_Temporary_C");
static_assert(sizeof(AClusterBullet_WWISE_Temporary_C) == 0x000610, "Wrong size on AClusterBullet_WWISE_Temporary_C");
static_assert(offsetof(AClusterBullet_WWISE_Temporary_C, UberGraphFrame) == 0x0005E0, "Member 'AClusterBullet_WWISE_Temporary_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AClusterBullet_WWISE_Temporary_C, DefaultSceneRoot) == 0x0005E8, "Member 'AClusterBullet_WWISE_Temporary_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AClusterBullet_WWISE_Temporary_C, BulletInfoID) == 0x0005F0, "Member 'AClusterBullet_WWISE_Temporary_C::BulletInfoID' has a wrong offset!");
static_assert(offsetof(AClusterBullet_WWISE_Temporary_C, BulletLaunchSoundEvent) == 0x0005F8, "Member 'AClusterBullet_WWISE_Temporary_C::BulletLaunchSoundEvent' has a wrong offset!");

}

