#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CompareMonsterNum

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function CompareMonsterNum.CompareMonsterNum_C.CheckTagMonsterNum
// 0x0058 (0x0058 - 0x0000)
struct CompareMonsterNum_C_CheckTagMonsterNum final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp;                                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOperationType                                ___byte_Variable;                                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGameAICharacter*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0028(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAICharacter*                       CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAlive_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAI_ReturnValue;                         // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CompareMonsterNum_C_CheckTagMonsterNum) == 0x000008, "Wrong alignment on CompareMonsterNum_C_CheckTagMonsterNum");
static_assert(sizeof(CompareMonsterNum_C_CheckTagMonsterNum) == 0x000058, "Wrong size on CompareMonsterNum_C_CheckTagMonsterNum");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, ReturnValue) == 0x000000, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::ReturnValue' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, Count) == 0x000004, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::Count' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, Temp) == 0x000008, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::Temp' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, ___int_Array_Index_Variable) == 0x00000C, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, ___int_Loop_Counter_Variable) == 0x000010, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, ___byte_Variable) == 0x000018, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::___byte_Variable' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000019, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, CallFunc_Greater_IntInt_ReturnValue) == 0x00001A, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001B, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00001D, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00001E, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, K2Node_Select_Default) == 0x00001F, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, CallFunc_GetAllActorsOfClass_OutActors) == 0x000028, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000038, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, CallFunc_Array_Get_Item) == 0x000040, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, CallFunc_IsAlive_ReturnValue) == 0x00004C, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::CallFunc_IsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, CallFunc_Less_IntInt_ReturnValue_1) == 0x00004D, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, CallFunc_IsAI_ReturnValue) == 0x00004E, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::CallFunc_IsAI_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, CallFunc_Array_Contains_ReturnValue) == 0x00004F, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, CallFunc_BooleanOR_ReturnValue) == 0x000050, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, CallFunc_BooleanAND_ReturnValue) == 0x000051, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_CheckTagMonsterNum, CallFunc_BooleanAND_ReturnValue_1) == 0x000052, "Member 'CompareMonsterNum_C_CheckTagMonsterNum::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function CompareMonsterNum.CompareMonsterNum_C.GetSpecialStaticDescription
// 0x0090 (0x0090 - 0x0000)
struct CompareMonsterNum_C_GetSpecialStaticDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CompareMonsterNum_C_GetSpecialStaticDescription) == 0x000008, "Wrong alignment on CompareMonsterNum_C_GetSpecialStaticDescription");
static_assert(sizeof(CompareMonsterNum_C_GetSpecialStaticDescription) == 0x000090, "Wrong size on CompareMonsterNum_C_GetSpecialStaticDescription");
static_assert(offsetof(CompareMonsterNum_C_GetSpecialStaticDescription, ReturnValue) == 0x000000, "Member 'CompareMonsterNum_C_GetSpecialStaticDescription::ReturnValue' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_GetSpecialStaticDescription, CallFunc_Conv_IntToString_ReturnValue) == 0x000010, "Member 'CompareMonsterNum_C_GetSpecialStaticDescription::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_GetSpecialStaticDescription, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000020, "Member 'CompareMonsterNum_C_GetSpecialStaticDescription::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_GetSpecialStaticDescription, CallFunc_Conv_NameToString_ReturnValue) == 0x000030, "Member 'CompareMonsterNum_C_GetSpecialStaticDescription::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'CompareMonsterNum_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000050, "Member 'CompareMonsterNum_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000060, "Member 'CompareMonsterNum_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000070, "Member 'CompareMonsterNum_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CompareMonsterNum_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000080, "Member 'CompareMonsterNum_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");

// Function CompareMonsterNum.CompareMonsterNum_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct CompareMonsterNum_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(CompareMonsterNum_C_GetModuleName) == 0x000008, "Wrong alignment on CompareMonsterNum_C_GetModuleName");
static_assert(sizeof(CompareMonsterNum_C_GetModuleName) == 0x000010, "Wrong size on CompareMonsterNum_C_GetModuleName");
static_assert(offsetof(CompareMonsterNum_C_GetModuleName, ReturnValue) == 0x000000, "Member 'CompareMonsterNum_C_GetModuleName::ReturnValue' has a wrong offset!");

}

