#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_PreheatOver

#include "Basic.hpp"


namespace SDK::Params
{

// Function Condition_PreheatOver.Condition_PreheatOver_C.K2_CheckCondition
// 0x0030 (0x0030 - 0x0000)
struct Condition_PreheatOver_C_K2_CheckCondition final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerWeapon*                          CallFunc_GetWeapon_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerWeapon_Bow*                      K2Node_DynamicCast_AsPlayer_Weapon_Bow;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_PreheatOver_C_K2_CheckCondition) == 0x000008, "Wrong alignment on Condition_PreheatOver_C_K2_CheckCondition");
static_assert(sizeof(Condition_PreheatOver_C_K2_CheckCondition) == 0x000030, "Wrong size on Condition_PreheatOver_C_K2_CheckCondition");
static_assert(offsetof(Condition_PreheatOver_C_K2_CheckCondition, InCurLauncher) == 0x000000, "Member 'Condition_PreheatOver_C_K2_CheckCondition::InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_PreheatOver_C_K2_CheckCondition, InCurLauncherChara) == 0x000008, "Member 'Condition_PreheatOver_C_K2_CheckCondition::InCurLauncherChara' has a wrong offset!");
static_assert(offsetof(Condition_PreheatOver_C_K2_CheckCondition, ReturnValue) == 0x000010, "Member 'Condition_PreheatOver_C_K2_CheckCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_PreheatOver_C_K2_CheckCondition, CallFunc_GetWeapon_ReturnValue) == 0x000018, "Member 'Condition_PreheatOver_C_K2_CheckCondition::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_PreheatOver_C_K2_CheckCondition, K2Node_DynamicCast_AsPlayer_Weapon_Bow) == 0x000020, "Member 'Condition_PreheatOver_C_K2_CheckCondition::K2Node_DynamicCast_AsPlayer_Weapon_Bow' has a wrong offset!");
static_assert(offsetof(Condition_PreheatOver_C_K2_CheckCondition, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Condition_PreheatOver_C_K2_CheckCondition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Condition_PreheatOver_C_K2_CheckCondition, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000029, "Member 'Condition_PreheatOver_C_K2_CheckCondition::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_PreheatOver_C_K2_CheckCondition, CallFunc_BooleanOR_ReturnValue) == 0x00002A, "Member 'Condition_PreheatOver_C_K2_CheckCondition::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function Condition_PreheatOver.Condition_PreheatOver_C.OnPreheatPhase_Event_0
// 0x0004 (0x0004 - 0x0000)
struct Condition_PreheatOver_C_OnPreheatPhase_Event_0 final
{
public:
	int32                                         Phase;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_PreheatOver_C_OnPreheatPhase_Event_0) == 0x000004, "Wrong alignment on Condition_PreheatOver_C_OnPreheatPhase_Event_0");
static_assert(sizeof(Condition_PreheatOver_C_OnPreheatPhase_Event_0) == 0x000004, "Wrong size on Condition_PreheatOver_C_OnPreheatPhase_Event_0");
static_assert(offsetof(Condition_PreheatOver_C_OnPreheatPhase_Event_0, Phase) == 0x000000, "Member 'Condition_PreheatOver_C_OnPreheatPhase_Event_0::Phase' has a wrong offset!");

// Function Condition_PreheatOver.Condition_PreheatOver_C.K2_UnbindEvent
// 0x0010 (0x0010 - 0x0000)
struct Condition_PreheatOver_C_K2_UnbindEvent final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_PreheatOver_C_K2_UnbindEvent) == 0x000008, "Wrong alignment on Condition_PreheatOver_C_K2_UnbindEvent");
static_assert(sizeof(Condition_PreheatOver_C_K2_UnbindEvent) == 0x000010, "Wrong size on Condition_PreheatOver_C_K2_UnbindEvent");
static_assert(offsetof(Condition_PreheatOver_C_K2_UnbindEvent, InCurLauncher) == 0x000000, "Member 'Condition_PreheatOver_C_K2_UnbindEvent::InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_PreheatOver_C_K2_UnbindEvent, InCurLauncherChara) == 0x000008, "Member 'Condition_PreheatOver_C_K2_UnbindEvent::InCurLauncherChara' has a wrong offset!");

// Function Condition_PreheatOver.Condition_PreheatOver_C.K2_BindEvent
// 0x0010 (0x0010 - 0x0000)
struct Condition_PreheatOver_C_K2_BindEvent final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_PreheatOver_C_K2_BindEvent) == 0x000008, "Wrong alignment on Condition_PreheatOver_C_K2_BindEvent");
static_assert(sizeof(Condition_PreheatOver_C_K2_BindEvent) == 0x000010, "Wrong size on Condition_PreheatOver_C_K2_BindEvent");
static_assert(offsetof(Condition_PreheatOver_C_K2_BindEvent, InCurLauncher) == 0x000000, "Member 'Condition_PreheatOver_C_K2_BindEvent::InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_PreheatOver_C_K2_BindEvent, InCurLauncherChara) == 0x000008, "Member 'Condition_PreheatOver_C_K2_BindEvent::InCurLauncherChara' has a wrong offset!");

// Function Condition_PreheatOver.Condition_PreheatOver_C.ExecuteUbergraph_Condition_PreheatOver
// 0x0070 (0x0070 - 0x0000)
struct Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Phase)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_Phase;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_Event_InCurLauncher_1;                      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_InCurLauncherChara_1;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerWeapon*                          CallFunc_GetWeapon_ReturnValue;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponentBase*                  K2Node_Event_InCurLauncher;                        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_InCurLauncherChara;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerWeapon_Bow*                      K2Node_DynamicCast_AsPlayer_Weapon_Bow;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerWeapon*                          CallFunc_GetWeapon_ReturnValue_1;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerWeapon_Bow*                      K2Node_DynamicCast_AsPlayer_Weapon_Bow_1;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver) == 0x000008, "Wrong alignment on Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver");
static_assert(sizeof(Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver) == 0x000070, "Wrong size on Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver");
static_assert(offsetof(Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver, EntryPoint) == 0x000000, "Member 'Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver::EntryPoint' has a wrong offset!");
static_assert(offsetof(Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver, K2Node_CustomEvent_Phase) == 0x000014, "Member 'Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver::K2Node_CustomEvent_Phase' has a wrong offset!");
static_assert(offsetof(Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000018, "Member 'Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver, K2Node_Event_InCurLauncher_1) == 0x000020, "Member 'Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver::K2Node_Event_InCurLauncher_1' has a wrong offset!");
static_assert(offsetof(Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver, K2Node_Event_InCurLauncherChara_1) == 0x000028, "Member 'Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver::K2Node_Event_InCurLauncherChara_1' has a wrong offset!");
static_assert(offsetof(Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver, CallFunc_GetWeapon_ReturnValue) == 0x000030, "Member 'Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver, K2Node_Event_InCurLauncher) == 0x000038, "Member 'Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver::K2Node_Event_InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver, K2Node_Event_InCurLauncherChara) == 0x000040, "Member 'Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver::K2Node_Event_InCurLauncherChara' has a wrong offset!");
static_assert(offsetof(Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver, K2Node_DynamicCast_AsPlayer_Weapon_Bow) == 0x000048, "Member 'Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver::K2Node_DynamicCast_AsPlayer_Weapon_Bow' has a wrong offset!");
static_assert(offsetof(Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver, CallFunc_GetWeapon_ReturnValue_1) == 0x000058, "Member 'Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver::CallFunc_GetWeapon_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver, K2Node_DynamicCast_AsPlayer_Weapon_Bow_1) == 0x000060, "Member 'Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver::K2Node_DynamicCast_AsPlayer_Weapon_Bow_1' has a wrong offset!");
static_assert(offsetof(Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'Condition_PreheatOver_C_ExecuteUbergraph_Condition_PreheatOver::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

