#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_CheckWeaponFireType

#include "Basic.hpp"


namespace SDK::Params
{

// Function Condition_CheckWeaponFireType.Condition_CheckWeaponFireType_C.K2_CheckCondition
// 0x0028 (0x0028 - 0x0000)
struct Condition_CheckWeaponFireType_C_K2_CheckCondition final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerWeapon*                          CallFunc_GetWeapon_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_CheckWeaponFireType_C_K2_CheckCondition) == 0x000008, "Wrong alignment on Condition_CheckWeaponFireType_C_K2_CheckCondition");
static_assert(sizeof(Condition_CheckWeaponFireType_C_K2_CheckCondition) == 0x000028, "Wrong size on Condition_CheckWeaponFireType_C_K2_CheckCondition");
static_assert(offsetof(Condition_CheckWeaponFireType_C_K2_CheckCondition, InCurLauncher) == 0x000000, "Member 'Condition_CheckWeaponFireType_C_K2_CheckCondition::InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_CheckWeaponFireType_C_K2_CheckCondition, InCurLauncherChara) == 0x000008, "Member 'Condition_CheckWeaponFireType_C_K2_CheckCondition::InCurLauncherChara' has a wrong offset!");
static_assert(offsetof(Condition_CheckWeaponFireType_C_K2_CheckCondition, ReturnValue) == 0x000010, "Member 'Condition_CheckWeaponFireType_C_K2_CheckCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckWeaponFireType_C_K2_CheckCondition, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'Condition_CheckWeaponFireType_C_K2_CheckCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckWeaponFireType_C_K2_CheckCondition, CallFunc_GetWeapon_ReturnValue) == 0x000018, "Member 'Condition_CheckWeaponFireType_C_K2_CheckCondition::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckWeaponFireType_C_K2_CheckCondition, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'Condition_CheckWeaponFireType_C_K2_CheckCondition::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_CheckWeaponFireType_C_K2_CheckCondition, CallFunc_Greater_IntInt_ReturnValue) == 0x000021, "Member 'Condition_CheckWeaponFireType_C_K2_CheckCondition::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckWeaponFireType_C_K2_CheckCondition, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000022, "Member 'Condition_CheckWeaponFireType_C_K2_CheckCondition::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function Condition_CheckWeaponFireType.Condition_CheckWeaponFireType_C.ExecuteUbergraph_Condition_CheckWeaponFireType
// 0x0008 (0x0008 - 0x0000)
struct Condition_CheckWeaponFireType_C_ExecuteUbergraph_Condition_CheckWeaponFireType final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetParamboolValue_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_CheckWeaponFireType_C_ExecuteUbergraph_Condition_CheckWeaponFireType) == 0x000004, "Wrong alignment on Condition_CheckWeaponFireType_C_ExecuteUbergraph_Condition_CheckWeaponFireType");
static_assert(sizeof(Condition_CheckWeaponFireType_C_ExecuteUbergraph_Condition_CheckWeaponFireType) == 0x000008, "Wrong size on Condition_CheckWeaponFireType_C_ExecuteUbergraph_Condition_CheckWeaponFireType");
static_assert(offsetof(Condition_CheckWeaponFireType_C_ExecuteUbergraph_Condition_CheckWeaponFireType, EntryPoint) == 0x000000, "Member 'Condition_CheckWeaponFireType_C_ExecuteUbergraph_Condition_CheckWeaponFireType::EntryPoint' has a wrong offset!");
static_assert(offsetof(Condition_CheckWeaponFireType_C_ExecuteUbergraph_Condition_CheckWeaponFireType, CallFunc_GetParamboolValue_ReturnValue) == 0x000004, "Member 'Condition_CheckWeaponFireType_C_ExecuteUbergraph_Condition_CheckWeaponFireType::CallFunc_GetParamboolValue_ReturnValue' has a wrong offset!");

}

