#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_ApplyAbnormal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Condition_ApplyAbnormal.Condition_ApplyAbnormal_C
// 0x0030 (0x0138 - 0x0108)
class UCondition_ApplyAbnormal_C final : public UCastConditionCheck
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bApplyAbnormal;                                    // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EAbnormalState>                        IgnoreAbnormalStates;                              // 0x0118(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         IgnoreAbnormalStateStrings;                        // 0x0128(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BindEvent(class UAbilityComponentBase* Ability);
	void UnbindEvent(class UAbilityComponentBase* Ability);
	void K2_InitCondition();
	void OnApplyAbnormal(class UAbilityComponentBase* Target, class UAbilityComponentBase* Causer, EAbnormalState AbnormalState);
	void K2_BindEvent(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void K2_UnbindEvent(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void ExecuteUbergraph_Condition_ApplyAbnormal(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Condition_ApplyAbnormal_C">();
	}
	static class UCondition_ApplyAbnormal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCondition_ApplyAbnormal_C>();
	}
};
static_assert(alignof(UCondition_ApplyAbnormal_C) == 0x000008, "Wrong alignment on UCondition_ApplyAbnormal_C");
static_assert(sizeof(UCondition_ApplyAbnormal_C) == 0x000138, "Wrong size on UCondition_ApplyAbnormal_C");
static_assert(offsetof(UCondition_ApplyAbnormal_C, UberGraphFrame) == 0x000108, "Member 'UCondition_ApplyAbnormal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCondition_ApplyAbnormal_C, bApplyAbnormal) == 0x000110, "Member 'UCondition_ApplyAbnormal_C::bApplyAbnormal' has a wrong offset!");
static_assert(offsetof(UCondition_ApplyAbnormal_C, IgnoreAbnormalStates) == 0x000118, "Member 'UCondition_ApplyAbnormal_C::IgnoreAbnormalStates' has a wrong offset!");
static_assert(offsetof(UCondition_ApplyAbnormal_C, IgnoreAbnormalStateStrings) == 0x000128, "Member 'UCondition_ApplyAbnormal_C::IgnoreAbnormalStateStrings' has a wrong offset!");

}

