#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_SkillCast

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Condition_SkillCast.Condition_SkillCast_C
// 0x0018 (0x0120 - 0x0108)
class UCondition_SkillCast_C final : public UCastConditionCheck
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          ListenSkillEmit;                                   // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  Ability;                                           // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool ResetCondition();
	void BindEventToSkillEmit(class UAbilityComponentBase* Ability_0);
	void SkillEmit(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void UnbindEventToSkillEmit(class UAbilityComponentBase* Ability_0);
	void K2_InitCondition();
	void OnFire(uint8 ForceShootCount, class APlayerWeapon* InCurWeapon);
	void K2_BindEvent(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void K2_UnbindEvent(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void ExecuteUbergraph_Condition_SkillCast(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Condition_SkillCast_C">();
	}
	static class UCondition_SkillCast_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCondition_SkillCast_C>();
	}
};
static_assert(alignof(UCondition_SkillCast_C) == 0x000008, "Wrong alignment on UCondition_SkillCast_C");
static_assert(sizeof(UCondition_SkillCast_C) == 0x000120, "Wrong size on UCondition_SkillCast_C");
static_assert(offsetof(UCondition_SkillCast_C, UberGraphFrame) == 0x000108, "Member 'UCondition_SkillCast_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCondition_SkillCast_C, ListenSkillEmit) == 0x000110, "Member 'UCondition_SkillCast_C::ListenSkillEmit' has a wrong offset!");
static_assert(offsetof(UCondition_SkillCast_C, Ability) == 0x000118, "Member 'UCondition_SkillCast_C::Ability' has a wrong offset!");

}

