#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_CharacterStating

#include "Basic.hpp"


namespace SDK::Params
{

// Function Condition_CharacterStating.Condition_CharacterStating_C.Check
// 0x0018 (0x0018 - 0x0000)
struct Condition_CharacterStating_C_Check final
{
public:
	class AGameCharacter*                         InCharacter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue_1;        // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCharacterActionState_ReturnValue;    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue_2;        // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_CharacterStating_C_Check) == 0x000008, "Wrong alignment on Condition_CharacterStating_C_Check");
static_assert(sizeof(Condition_CharacterStating_C_Check) == 0x000018, "Wrong size on Condition_CharacterStating_C_Check");
static_assert(offsetof(Condition_CharacterStating_C_Check, InCharacter) == 0x000000, "Member 'Condition_CharacterStating_C_Check::InCharacter' has a wrong offset!");
static_assert(offsetof(Condition_CharacterStating_C_Check, ReturnValue) == 0x000008, "Member 'Condition_CharacterStating_C_Check::ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CharacterStating_C_Check, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'Condition_CharacterStating_C_Check::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CharacterStating_C_Check, CallFunc_VSizeSquared_ReturnValue) == 0x00000C, "Member 'Condition_CharacterStating_C_Check::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CharacterStating_C_Check, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000010, "Member 'Condition_CharacterStating_C_Check::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CharacterStating_C_Check, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000011, "Member 'Condition_CharacterStating_C_Check::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CharacterStating_C_Check, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000012, "Member 'Condition_CharacterStating_C_Check::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CharacterStating_C_Check, CallFunc_EqualEqual_BoolBool_ReturnValue_1) == 0x000013, "Member 'Condition_CharacterStating_C_Check::CallFunc_EqualEqual_BoolBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_CharacterStating_C_Check, K2Node_SwitchEnum_CmpSuccess) == 0x000014, "Member 'Condition_CharacterStating_C_Check::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Condition_CharacterStating_C_Check, CallFunc_CheckCharacterActionState_ReturnValue) == 0x000015, "Member 'Condition_CharacterStating_C_Check::CallFunc_CheckCharacterActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CharacterStating_C_Check, CallFunc_EqualEqual_BoolBool_ReturnValue_2) == 0x000016, "Member 'Condition_CharacterStating_C_Check::CallFunc_EqualEqual_BoolBool_ReturnValue_2' has a wrong offset!");

// Function Condition_CharacterStating.Condition_CharacterStating_C.K2_CheckCondition
// 0x0018 (0x0018 - 0x0000)
struct Condition_CharacterStating_C_K2_CheckCondition final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Check_ReturnValue;                        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_CharacterStating_C_K2_CheckCondition) == 0x000008, "Wrong alignment on Condition_CharacterStating_C_K2_CheckCondition");
static_assert(sizeof(Condition_CharacterStating_C_K2_CheckCondition) == 0x000018, "Wrong size on Condition_CharacterStating_C_K2_CheckCondition");
static_assert(offsetof(Condition_CharacterStating_C_K2_CheckCondition, InCurLauncher) == 0x000000, "Member 'Condition_CharacterStating_C_K2_CheckCondition::InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_CharacterStating_C_K2_CheckCondition, InCurLauncherChara) == 0x000008, "Member 'Condition_CharacterStating_C_K2_CheckCondition::InCurLauncherChara' has a wrong offset!");
static_assert(offsetof(Condition_CharacterStating_C_K2_CheckCondition, ReturnValue) == 0x000010, "Member 'Condition_CharacterStating_C_K2_CheckCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CharacterStating_C_K2_CheckCondition, CallFunc_Check_ReturnValue) == 0x000011, "Member 'Condition_CharacterStating_C_K2_CheckCondition::CallFunc_Check_ReturnValue' has a wrong offset!");

// Function Condition_CharacterStating.Condition_CharacterStating_C.ExecuteUbergraph_Condition_CharacterStating
// 0x0008 (0x0008 - 0x0000)
struct Condition_CharacterStating_C_ExecuteUbergraph_Condition_CharacterStating final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess_1;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_CharacterStating_C_ExecuteUbergraph_Condition_CharacterStating) == 0x000004, "Wrong alignment on Condition_CharacterStating_C_ExecuteUbergraph_Condition_CharacterStating");
static_assert(sizeof(Condition_CharacterStating_C_ExecuteUbergraph_Condition_CharacterStating) == 0x000008, "Wrong size on Condition_CharacterStating_C_ExecuteUbergraph_Condition_CharacterStating");
static_assert(offsetof(Condition_CharacterStating_C_ExecuteUbergraph_Condition_CharacterStating, EntryPoint) == 0x000000, "Member 'Condition_CharacterStating_C_ExecuteUbergraph_Condition_CharacterStating::EntryPoint' has a wrong offset!");
static_assert(offsetof(Condition_CharacterStating_C_ExecuteUbergraph_Condition_CharacterStating, K2Node_SwitchString_CmpSuccess) == 0x000004, "Member 'Condition_CharacterStating_C_ExecuteUbergraph_Condition_CharacterStating::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Condition_CharacterStating_C_ExecuteUbergraph_Condition_CharacterStating, K2Node_SwitchString_CmpSuccess_1) == 0x000005, "Member 'Condition_CharacterStating_C_ExecuteUbergraph_Condition_CharacterStating::K2Node_SwitchString_CmpSuccess_1' has a wrong offset!");

}

