#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_ModifierExist

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Condition_ModifierExist.Condition_ModifierExist_C
// 0x0028 (0x0130 - 0x0108)
class UCondition_ModifierExist_C final : public UCastConditionCheck
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AGameCharacter*                         TempLauncher;                                      // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Tag;                                               // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         ModifierID;                                        // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool Check(class UAbilityComponentBase* InAbility);
	bool K2_CheckCondition(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void K2_InitCondition();
	void ExecuteUbergraph_Condition_ModifierExist(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Condition_ModifierExist_C">();
	}
	static class UCondition_ModifierExist_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCondition_ModifierExist_C>();
	}
};
static_assert(alignof(UCondition_ModifierExist_C) == 0x000008, "Wrong alignment on UCondition_ModifierExist_C");
static_assert(sizeof(UCondition_ModifierExist_C) == 0x000130, "Wrong size on UCondition_ModifierExist_C");
static_assert(offsetof(UCondition_ModifierExist_C, UberGraphFrame) == 0x000108, "Member 'UCondition_ModifierExist_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCondition_ModifierExist_C, TempLauncher) == 0x000110, "Member 'UCondition_ModifierExist_C::TempLauncher' has a wrong offset!");
static_assert(offsetof(UCondition_ModifierExist_C, Tag) == 0x000118, "Member 'UCondition_ModifierExist_C::Tag' has a wrong offset!");
static_assert(offsetof(UCondition_ModifierExist_C, ModifierID) == 0x000128, "Member 'UCondition_ModifierExist_C::ModifierID' has a wrong offset!");

}

