#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_CheckIsFightPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Condition_CheckIsFightPlayer.Condition_CheckIsFightPlayer_C
// 0x0010 (0x0118 - 0x0108)
class UCondition_CheckIsFightPlayer_C final : public UCastConditionCheck_CharacterDie
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bFight;                                            // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bContainQTE;                                       // 0x0111(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	bool K2_CheckCondition(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void K2_InitCondition();
	void ExecuteUbergraph_Condition_CheckIsFightPlayer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Condition_CheckIsFightPlayer_C">();
	}
	static class UCondition_CheckIsFightPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCondition_CheckIsFightPlayer_C>();
	}
};
static_assert(alignof(UCondition_CheckIsFightPlayer_C) == 0x000008, "Wrong alignment on UCondition_CheckIsFightPlayer_C");
static_assert(sizeof(UCondition_CheckIsFightPlayer_C) == 0x000118, "Wrong size on UCondition_CheckIsFightPlayer_C");
static_assert(offsetof(UCondition_CheckIsFightPlayer_C, UberGraphFrame) == 0x000108, "Member 'UCondition_CheckIsFightPlayer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCondition_CheckIsFightPlayer_C, bFight) == 0x000110, "Member 'UCondition_CheckIsFightPlayer_C::bFight' has a wrong offset!");
static_assert(offsetof(UCondition_CheckIsFightPlayer_C, bContainQTE) == 0x000111, "Member 'UCondition_CheckIsFightPlayer_C::bContainQTE' has a wrong offset!");

}

