#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_SkillCastableKeepTime

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function Condition_SkillCastableKeepTime.Condition_SkillCastableKeepTime_C.K2_CheckCondition
// 0x0050 (0x0050 - 0x0000)
struct Condition_SkillCastableKeepTime_C_K2_CheckCondition final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponentBase*                  CallFunc_GetLauncherAbility_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FValueRangeInfo                        CallFunc_Array_Get_Item;                           // 0x0028(0x000C)(NoDestructor)
	int32                                         CallFunc_GetParamintValue_ReturnValue;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAvailableSkill*                        CallFunc_K2_GetAvaliableSkillInfo_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_SkillCastableKeepTime_C_K2_CheckCondition) == 0x000008, "Wrong alignment on Condition_SkillCastableKeepTime_C_K2_CheckCondition");
static_assert(sizeof(Condition_SkillCastableKeepTime_C_K2_CheckCondition) == 0x000050, "Wrong size on Condition_SkillCastableKeepTime_C_K2_CheckCondition");
static_assert(offsetof(Condition_SkillCastableKeepTime_C_K2_CheckCondition, InCurLauncher) == 0x000000, "Member 'Condition_SkillCastableKeepTime_C_K2_CheckCondition::InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_SkillCastableKeepTime_C_K2_CheckCondition, InCurLauncherChara) == 0x000008, "Member 'Condition_SkillCastableKeepTime_C_K2_CheckCondition::InCurLauncherChara' has a wrong offset!");
static_assert(offsetof(Condition_SkillCastableKeepTime_C_K2_CheckCondition, ReturnValue) == 0x000010, "Member 'Condition_SkillCastableKeepTime_C_K2_CheckCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_SkillCastableKeepTime_C_K2_CheckCondition, ___int_Array_Index_Variable) == 0x000014, "Member 'Condition_SkillCastableKeepTime_C_K2_CheckCondition::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Condition_SkillCastableKeepTime_C_K2_CheckCondition, ___int_Loop_Counter_Variable) == 0x000018, "Member 'Condition_SkillCastableKeepTime_C_K2_CheckCondition::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Condition_SkillCastableKeepTime_C_K2_CheckCondition, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'Condition_SkillCastableKeepTime_C_K2_CheckCondition::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_SkillCastableKeepTime_C_K2_CheckCondition, CallFunc_GetLauncherAbility_ReturnValue) == 0x000020, "Member 'Condition_SkillCastableKeepTime_C_K2_CheckCondition::CallFunc_GetLauncherAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_SkillCastableKeepTime_C_K2_CheckCondition, CallFunc_Array_Get_Item) == 0x000028, "Member 'Condition_SkillCastableKeepTime_C_K2_CheckCondition::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Condition_SkillCastableKeepTime_C_K2_CheckCondition, CallFunc_GetParamintValue_ReturnValue) == 0x000034, "Member 'Condition_SkillCastableKeepTime_C_K2_CheckCondition::CallFunc_GetParamintValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_SkillCastableKeepTime_C_K2_CheckCondition, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'Condition_SkillCastableKeepTime_C_K2_CheckCondition::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_SkillCastableKeepTime_C_K2_CheckCondition, CallFunc_K2_GetAvaliableSkillInfo_ReturnValue) == 0x000040, "Member 'Condition_SkillCastableKeepTime_C_K2_CheckCondition::CallFunc_K2_GetAvaliableSkillInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_SkillCastableKeepTime_C_K2_CheckCondition, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'Condition_SkillCastableKeepTime_C_K2_CheckCondition::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_SkillCastableKeepTime_C_K2_CheckCondition, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'Condition_SkillCastableKeepTime_C_K2_CheckCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_SkillCastableKeepTime_C_K2_CheckCondition, CallFunc_InRange_FloatFloat_ReturnValue) == 0x00004A, "Member 'Condition_SkillCastableKeepTime_C_K2_CheckCondition::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");

// Function Condition_SkillCastableKeepTime.Condition_SkillCastableKeepTime_C.ExecuteUbergraph_Condition_SkillCastableKeepTime
// 0x0018 (0x0018 - 0x0000)
struct Condition_SkillCastableKeepTime_C_ExecuteUbergraph_Condition_SkillCastableKeepTime final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FValueRangeInfo>                CallFunc_GetValueRangeInfoArray_ReturnValue;       // 0x0008(0x0010)(ReferenceParm)
};
static_assert(alignof(Condition_SkillCastableKeepTime_C_ExecuteUbergraph_Condition_SkillCastableKeepTime) == 0x000008, "Wrong alignment on Condition_SkillCastableKeepTime_C_ExecuteUbergraph_Condition_SkillCastableKeepTime");
static_assert(sizeof(Condition_SkillCastableKeepTime_C_ExecuteUbergraph_Condition_SkillCastableKeepTime) == 0x000018, "Wrong size on Condition_SkillCastableKeepTime_C_ExecuteUbergraph_Condition_SkillCastableKeepTime");
static_assert(offsetof(Condition_SkillCastableKeepTime_C_ExecuteUbergraph_Condition_SkillCastableKeepTime, EntryPoint) == 0x000000, "Member 'Condition_SkillCastableKeepTime_C_ExecuteUbergraph_Condition_SkillCastableKeepTime::EntryPoint' has a wrong offset!");
static_assert(offsetof(Condition_SkillCastableKeepTime_C_ExecuteUbergraph_Condition_SkillCastableKeepTime, CallFunc_GetValueRangeInfoArray_ReturnValue) == 0x000008, "Member 'Condition_SkillCastableKeepTime_C_ExecuteUbergraph_Condition_SkillCastableKeepTime::CallFunc_GetValueRangeInfoArray_ReturnValue' has a wrong offset!");

}

