#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_NotifyAttributeChangeTheAmount

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Condition_NotifyAttributeChangeTheAmount.Condition_NotifyAttributeChangeTheAmount_C
// 0x0028 (0x0138 - 0x0110)
class UCondition_NotifyAttributeChangeTheAmount_C final : public UCastConditionCheck_NotifyAttributeChangeBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0110(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         ChangeValue;                                       // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CompareType;                                       // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bUsePercent;                                       // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ChangeTypoe;                                       // 0x0134(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool CheckAttributeValue(class UGameAbilityComponent* Ability, const class UAbilityAttribute* AttributeClass, float CurValue, float OldValue, float MaxValue);
	void K2_InitCondition();
	void ExecuteUbergraph_Condition_NotifyAttributeChangeTheAmount(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Condition_NotifyAttributeChangeTheAmount_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Condition_NotifyAttributeChangeTheAmount_C")
	}
	static class UCondition_NotifyAttributeChangeTheAmount_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCondition_NotifyAttributeChangeTheAmount_C>();
	}
};
DUMPER7_ASSERTS_UCondition_NotifyAttributeChangeTheAmount_C;

}

