#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_EmitterTrigger

#include "Basic.hpp"


namespace SDK::Params
{

// Function Condition_EmitterTrigger.Condition_EmitterTrigger_C.Bind
// 0x0008 (0x0008 - 0x0000)
struct Condition_EmitterTrigger_C_Bind final
{
public:
	class UAbilityComponentBase*                  BindAbility;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_EmitterTrigger_C_Bind) == 0x000008, "Wrong alignment on Condition_EmitterTrigger_C_Bind");
static_assert(sizeof(Condition_EmitterTrigger_C_Bind) == 0x000008, "Wrong size on Condition_EmitterTrigger_C_Bind");
static_assert(offsetof(Condition_EmitterTrigger_C_Bind, BindAbility) == 0x000000, "Member 'Condition_EmitterTrigger_C_Bind::BindAbility' has a wrong offset!");

// Function Condition_EmitterTrigger.Condition_EmitterTrigger_C.UnBind
// 0x0008 (0x0008 - 0x0000)
struct Condition_EmitterTrigger_C_UnBind final
{
public:
	class UAbilityComponentBase*                  BindAbility;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_EmitterTrigger_C_UnBind) == 0x000008, "Wrong alignment on Condition_EmitterTrigger_C_UnBind");
static_assert(sizeof(Condition_EmitterTrigger_C_UnBind) == 0x000008, "Wrong size on Condition_EmitterTrigger_C_UnBind");
static_assert(offsetof(Condition_EmitterTrigger_C_UnBind, BindAbility) == 0x000000, "Member 'Condition_EmitterTrigger_C_UnBind::BindAbility' has a wrong offset!");

// Function Condition_EmitterTrigger.Condition_EmitterTrigger_C.EmitterTrigger
// 0x0010 (0x0010 - 0x0000)
struct Condition_EmitterTrigger_C_EmitterTrigger final
{
public:
	int32                                         EmitterID;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  OwnerAbility;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_EmitterTrigger_C_EmitterTrigger) == 0x000008, "Wrong alignment on Condition_EmitterTrigger_C_EmitterTrigger");
static_assert(sizeof(Condition_EmitterTrigger_C_EmitterTrigger) == 0x000010, "Wrong size on Condition_EmitterTrigger_C_EmitterTrigger");
static_assert(offsetof(Condition_EmitterTrigger_C_EmitterTrigger, EmitterID) == 0x000000, "Member 'Condition_EmitterTrigger_C_EmitterTrigger::EmitterID' has a wrong offset!");
static_assert(offsetof(Condition_EmitterTrigger_C_EmitterTrigger, OwnerAbility) == 0x000008, "Member 'Condition_EmitterTrigger_C_EmitterTrigger::OwnerAbility' has a wrong offset!");

// Function Condition_EmitterTrigger.Condition_EmitterTrigger_C.K2_BindEvent
// 0x0010 (0x0010 - 0x0000)
struct Condition_EmitterTrigger_C_K2_BindEvent final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_EmitterTrigger_C_K2_BindEvent) == 0x000008, "Wrong alignment on Condition_EmitterTrigger_C_K2_BindEvent");
static_assert(sizeof(Condition_EmitterTrigger_C_K2_BindEvent) == 0x000010, "Wrong size on Condition_EmitterTrigger_C_K2_BindEvent");
static_assert(offsetof(Condition_EmitterTrigger_C_K2_BindEvent, InCurLauncher) == 0x000000, "Member 'Condition_EmitterTrigger_C_K2_BindEvent::InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_EmitterTrigger_C_K2_BindEvent, InCurLauncherChara) == 0x000008, "Member 'Condition_EmitterTrigger_C_K2_BindEvent::InCurLauncherChara' has a wrong offset!");

// Function Condition_EmitterTrigger.Condition_EmitterTrigger_C.K2_UnbindEvent
// 0x0010 (0x0010 - 0x0000)
struct Condition_EmitterTrigger_C_K2_UnbindEvent final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_EmitterTrigger_C_K2_UnbindEvent) == 0x000008, "Wrong alignment on Condition_EmitterTrigger_C_K2_UnbindEvent");
static_assert(sizeof(Condition_EmitterTrigger_C_K2_UnbindEvent) == 0x000010, "Wrong size on Condition_EmitterTrigger_C_K2_UnbindEvent");
static_assert(offsetof(Condition_EmitterTrigger_C_K2_UnbindEvent, InCurLauncher) == 0x000000, "Member 'Condition_EmitterTrigger_C_K2_UnbindEvent::InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_EmitterTrigger_C_K2_UnbindEvent, InCurLauncherChara) == 0x000008, "Member 'Condition_EmitterTrigger_C_K2_UnbindEvent::InCurLauncherChara' has a wrong offset!");

// Function Condition_EmitterTrigger.Condition_EmitterTrigger_C.ExecuteUbergraph_Condition_EmitterTrigger
// 0x0060 (0x0060 - 0x0000)
struct Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_Event_InCurLauncher;                        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_InCurLauncherChara;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 EmitterID, class UAbilityComponentBase* OwnerAbility)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityComponentBase*                  K2Node_CustomEvent_BindAbility_1;                  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponentBase*                  K2Node_CustomEvent_BindAbility;                    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_EmitterID;                      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_CustomEvent_OwnerAbility;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParamintValue_ReturnValue;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_Event_InCurLauncher_1;                      // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_InCurLauncherChara_1;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger) == 0x000008, "Wrong alignment on Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger");
static_assert(sizeof(Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger) == 0x000060, "Wrong size on Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger");
static_assert(offsetof(Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger, EntryPoint) == 0x000000, "Member 'Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger::EntryPoint' has a wrong offset!");
static_assert(offsetof(Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger, K2Node_Event_InCurLauncher) == 0x000008, "Member 'Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger::K2Node_Event_InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger, K2Node_Event_InCurLauncherChara) == 0x000010, "Member 'Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger::K2Node_Event_InCurLauncherChara' has a wrong offset!");
static_assert(offsetof(Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger, K2Node_CustomEvent_BindAbility_1) == 0x000028, "Member 'Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger::K2Node_CustomEvent_BindAbility_1' has a wrong offset!");
static_assert(offsetof(Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger, K2Node_CustomEvent_BindAbility) == 0x000030, "Member 'Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger::K2Node_CustomEvent_BindAbility' has a wrong offset!");
static_assert(offsetof(Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger, K2Node_CustomEvent_EmitterID) == 0x000038, "Member 'Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger::K2Node_CustomEvent_EmitterID' has a wrong offset!");
static_assert(offsetof(Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger, K2Node_CustomEvent_OwnerAbility) == 0x000040, "Member 'Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger::K2Node_CustomEvent_OwnerAbility' has a wrong offset!");
static_assert(offsetof(Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger, CallFunc_GetParamintValue_ReturnValue) == 0x000048, "Member 'Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger::CallFunc_GetParamintValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00004C, "Member 'Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger, K2Node_Event_InCurLauncher_1) == 0x000050, "Member 'Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger::K2Node_Event_InCurLauncher_1' has a wrong offset!");
static_assert(offsetof(Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger, K2Node_Event_InCurLauncherChara_1) == 0x000058, "Member 'Condition_EmitterTrigger_C_ExecuteUbergraph_Condition_EmitterTrigger::K2Node_Event_InCurLauncherChara_1' has a wrong offset!");

}

