#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_AttributeValueCheck

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Condition_AttributeValueCheck.Condition_AttributeValueCheck_C
// 0x0048 (0x0150 - 0x0108)
class UCondition_AttributeValueCheck_C final : public UCastConditionCheck
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAbilityComponentBase*                  Ability;                                           // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPercent;                                          // 0x0118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Value;                                             // 0x011C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 AttributeType;                                     // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 CompareType;                                       // 0x0130(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FValueRangeInfo                        ValueRange;                                        // 0x0140(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void CheckAttribute(class UAbilityComponentBase* InAbility, bool* OutReuslt);
	bool K2_CheckCondition(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void K2_InitCondition();
	void ExecuteUbergraph_Condition_AttributeValueCheck(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Condition_AttributeValueCheck_C">();
	}
	static class UCondition_AttributeValueCheck_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCondition_AttributeValueCheck_C>();
	}
};
static_assert(alignof(UCondition_AttributeValueCheck_C) == 0x000008, "Wrong alignment on UCondition_AttributeValueCheck_C");
static_assert(sizeof(UCondition_AttributeValueCheck_C) == 0x000150, "Wrong size on UCondition_AttributeValueCheck_C");
static_assert(offsetof(UCondition_AttributeValueCheck_C, UberGraphFrame) == 0x000108, "Member 'UCondition_AttributeValueCheck_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCondition_AttributeValueCheck_C, Ability) == 0x000110, "Member 'UCondition_AttributeValueCheck_C::Ability' has a wrong offset!");
static_assert(offsetof(UCondition_AttributeValueCheck_C, bPercent) == 0x000118, "Member 'UCondition_AttributeValueCheck_C::bPercent' has a wrong offset!");
static_assert(offsetof(UCondition_AttributeValueCheck_C, Value) == 0x00011C, "Member 'UCondition_AttributeValueCheck_C::Value' has a wrong offset!");
static_assert(offsetof(UCondition_AttributeValueCheck_C, AttributeType) == 0x000120, "Member 'UCondition_AttributeValueCheck_C::AttributeType' has a wrong offset!");
static_assert(offsetof(UCondition_AttributeValueCheck_C, CompareType) == 0x000130, "Member 'UCondition_AttributeValueCheck_C::CompareType' has a wrong offset!");
static_assert(offsetof(UCondition_AttributeValueCheck_C, ValueRange) == 0x000140, "Member 'UCondition_AttributeValueCheck_C::ValueRange' has a wrong offset!");

}

