#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_AttributeValueCheck

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function Condition_AttributeValueCheck.Condition_AttributeValueCheck_C.CheckAttribute
// 0x0058 (0x0058 - 0x0000)
struct Condition_AttributeValueCheck_C_CheckAttribute final
{
public:
	class UAbilityComponentBase*                  InAbility;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutReuslt;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable;                                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetOriginCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerWeapon*                          CallFunc_GetWeapon_ReturnValue;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPropertieMaxValueFromString_ReturnValue; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPropertieValueFromString_ReturnValue;  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SafeDivide_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  CallFunc_GetLauncherAbility_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_AttributeValueCheck_C_CheckAttribute) == 0x000008, "Wrong alignment on Condition_AttributeValueCheck_C_CheckAttribute");
static_assert(sizeof(Condition_AttributeValueCheck_C_CheckAttribute) == 0x000058, "Wrong size on Condition_AttributeValueCheck_C_CheckAttribute");
static_assert(offsetof(Condition_AttributeValueCheck_C_CheckAttribute, InAbility) == 0x000000, "Member 'Condition_AttributeValueCheck_C_CheckAttribute::InAbility' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_CheckAttribute, OutReuslt) == 0x000008, "Member 'Condition_AttributeValueCheck_C_CheckAttribute::OutReuslt' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_CheckAttribute, ___bool_Variable) == 0x000009, "Member 'Condition_AttributeValueCheck_C_CheckAttribute::___bool_Variable' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_CheckAttribute, CallFunc_GetOriginCharacter_ReturnValue) == 0x000010, "Member 'Condition_AttributeValueCheck_C_CheckAttribute::CallFunc_GetOriginCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_CheckAttribute, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'Condition_AttributeValueCheck_C_CheckAttribute::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_CheckAttribute, CallFunc_GetWeapon_ReturnValue) == 0x000020, "Member 'Condition_AttributeValueCheck_C_CheckAttribute::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_CheckAttribute, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'Condition_AttributeValueCheck_C_CheckAttribute::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_CheckAttribute, K2Node_SwitchString_CmpSuccess) == 0x000029, "Member 'Condition_AttributeValueCheck_C_CheckAttribute::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_CheckAttribute, CallFunc_GetPropertieMaxValueFromString_ReturnValue) == 0x00002C, "Member 'Condition_AttributeValueCheck_C_CheckAttribute::CallFunc_GetPropertieMaxValueFromString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_CheckAttribute, CallFunc_IsValid_ReturnValue_2) == 0x000030, "Member 'Condition_AttributeValueCheck_C_CheckAttribute::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_CheckAttribute, CallFunc_GetPropertieValueFromString_ReturnValue) == 0x000034, "Member 'Condition_AttributeValueCheck_C_CheckAttribute::CallFunc_GetPropertieValueFromString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_CheckAttribute, CallFunc_SafeDivide_ReturnValue) == 0x000038, "Member 'Condition_AttributeValueCheck_C_CheckAttribute::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_CheckAttribute, CallFunc_GetLauncherAbility_ReturnValue) == 0x000040, "Member 'Condition_AttributeValueCheck_C_CheckAttribute::CallFunc_GetLauncherAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_CheckAttribute, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000048, "Member 'Condition_AttributeValueCheck_C_CheckAttribute::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_CheckAttribute, K2Node_Select_Default) == 0x00004C, "Member 'Condition_AttributeValueCheck_C_CheckAttribute::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_CheckAttribute, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000050, "Member 'Condition_AttributeValueCheck_C_CheckAttribute::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_CheckAttribute, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000051, "Member 'Condition_AttributeValueCheck_C_CheckAttribute::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_CheckAttribute, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000052, "Member 'Condition_AttributeValueCheck_C_CheckAttribute::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_CheckAttribute, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000053, "Member 'Condition_AttributeValueCheck_C_CheckAttribute::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_CheckAttribute, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000054, "Member 'Condition_AttributeValueCheck_C_CheckAttribute::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_CheckAttribute, CallFunc_Less_FloatFloat_ReturnValue) == 0x000055, "Member 'Condition_AttributeValueCheck_C_CheckAttribute::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function Condition_AttributeValueCheck.Condition_AttributeValueCheck_C.K2_CheckCondition
// 0x0018 (0x0018 - 0x0000)
struct Condition_AttributeValueCheck_C_K2_CheckCondition final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckAttribute_OutReuslt;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_AttributeValueCheck_C_K2_CheckCondition) == 0x000008, "Wrong alignment on Condition_AttributeValueCheck_C_K2_CheckCondition");
static_assert(sizeof(Condition_AttributeValueCheck_C_K2_CheckCondition) == 0x000018, "Wrong size on Condition_AttributeValueCheck_C_K2_CheckCondition");
static_assert(offsetof(Condition_AttributeValueCheck_C_K2_CheckCondition, InCurLauncher) == 0x000000, "Member 'Condition_AttributeValueCheck_C_K2_CheckCondition::InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_K2_CheckCondition, InCurLauncherChara) == 0x000008, "Member 'Condition_AttributeValueCheck_C_K2_CheckCondition::InCurLauncherChara' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_K2_CheckCondition, ReturnValue) == 0x000010, "Member 'Condition_AttributeValueCheck_C_K2_CheckCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_K2_CheckCondition, CallFunc_CheckAttribute_OutReuslt) == 0x000011, "Member 'Condition_AttributeValueCheck_C_K2_CheckCondition::CallFunc_CheckAttribute_OutReuslt' has a wrong offset!");

// Function Condition_AttributeValueCheck.Condition_AttributeValueCheck_C.ExecuteUbergraph_Condition_AttributeValueCheck
// 0x0030 (0x0030 - 0x0000)
struct Condition_AttributeValueCheck_C_ExecuteUbergraph_Condition_AttributeValueCheck final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParamfloatValue_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FValueRangeInfo>                CallFunc_GetValueRangeInfoArray_ReturnValue;       // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_AttributeValueCheck_C_ExecuteUbergraph_Condition_AttributeValueCheck) == 0x000008, "Wrong alignment on Condition_AttributeValueCheck_C_ExecuteUbergraph_Condition_AttributeValueCheck");
static_assert(sizeof(Condition_AttributeValueCheck_C_ExecuteUbergraph_Condition_AttributeValueCheck) == 0x000030, "Wrong size on Condition_AttributeValueCheck_C_ExecuteUbergraph_Condition_AttributeValueCheck");
static_assert(offsetof(Condition_AttributeValueCheck_C_ExecuteUbergraph_Condition_AttributeValueCheck, EntryPoint) == 0x000000, "Member 'Condition_AttributeValueCheck_C_ExecuteUbergraph_Condition_AttributeValueCheck::EntryPoint' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_ExecuteUbergraph_Condition_AttributeValueCheck, CallFunc_GetParamfloatValue_ReturnValue) == 0x000004, "Member 'Condition_AttributeValueCheck_C_ExecuteUbergraph_Condition_AttributeValueCheck::CallFunc_GetParamfloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_ExecuteUbergraph_Condition_AttributeValueCheck, K2Node_SwitchString_CmpSuccess) == 0x000008, "Member 'Condition_AttributeValueCheck_C_ExecuteUbergraph_Condition_AttributeValueCheck::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_ExecuteUbergraph_Condition_AttributeValueCheck, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'Condition_AttributeValueCheck_C_ExecuteUbergraph_Condition_AttributeValueCheck::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_ExecuteUbergraph_Condition_AttributeValueCheck, CallFunc_GetValueRangeInfoArray_ReturnValue) == 0x000010, "Member 'Condition_AttributeValueCheck_C_ExecuteUbergraph_Condition_AttributeValueCheck::CallFunc_GetValueRangeInfoArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_ExecuteUbergraph_Condition_AttributeValueCheck, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'Condition_AttributeValueCheck_C_ExecuteUbergraph_Condition_AttributeValueCheck::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_ExecuteUbergraph_Condition_AttributeValueCheck, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'Condition_AttributeValueCheck_C_ExecuteUbergraph_Condition_AttributeValueCheck::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_ExecuteUbergraph_Condition_AttributeValueCheck, CallFunc_Len_ReturnValue) == 0x000028, "Member 'Condition_AttributeValueCheck_C_ExecuteUbergraph_Condition_AttributeValueCheck::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_AttributeValueCheck_C_ExecuteUbergraph_Condition_AttributeValueCheck, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00002C, "Member 'Condition_AttributeValueCheck_C_ExecuteUbergraph_Condition_AttributeValueCheck::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

}

