#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_ModifierNotExist

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Condition_ModifierNotExist.Condition_ModifierNotExist_C
// 0x0028 (0x0130 - 0x0108)
class UCondition_ModifierNotExist_C final : public UCastConditionCheck
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AGameCharacter*                         TempLauncher;                                      // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ModifierID;                                        // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOnlySelf;                                         // 0x011C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TagName;                                           // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void GetModiferLauner(class UAbilityComponentBase** OutAbility);
	void CheckModifierExit(class AGameCharacter* NewParam, bool* bExit);
	void GetLauncher(class AGameCharacter** GameCharacter);
	bool K2_CheckCondition(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void K2_InitCondition();
	void ExecuteUbergraph_Condition_ModifierNotExist(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Condition_ModifierNotExist_C">();
	}
	static class UCondition_ModifierNotExist_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCondition_ModifierNotExist_C>();
	}
};
static_assert(alignof(UCondition_ModifierNotExist_C) == 0x000008, "Wrong alignment on UCondition_ModifierNotExist_C");
static_assert(sizeof(UCondition_ModifierNotExist_C) == 0x000130, "Wrong size on UCondition_ModifierNotExist_C");
static_assert(offsetof(UCondition_ModifierNotExist_C, UberGraphFrame) == 0x000108, "Member 'UCondition_ModifierNotExist_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCondition_ModifierNotExist_C, TempLauncher) == 0x000110, "Member 'UCondition_ModifierNotExist_C::TempLauncher' has a wrong offset!");
static_assert(offsetof(UCondition_ModifierNotExist_C, ModifierID) == 0x000118, "Member 'UCondition_ModifierNotExist_C::ModifierID' has a wrong offset!");
static_assert(offsetof(UCondition_ModifierNotExist_C, bOnlySelf) == 0x00011C, "Member 'UCondition_ModifierNotExist_C::bOnlySelf' has a wrong offset!");
static_assert(offsetof(UCondition_ModifierNotExist_C, TagName) == 0x000120, "Member 'UCondition_ModifierNotExist_C::TagName' has a wrong offset!");

}

