#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_CheckIsFightPlayer

#include "Basic.hpp"


namespace SDK::Params
{

// Function Condition_CheckIsFightPlayer.Condition_CheckIsFightPlayer_C.K2_CheckCondition
// 0x0048 (0x0048 - 0x0000)
struct Condition_CheckIsFightPlayer_C_K2_CheckCondition final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetLauncherOriginCharacter_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         CallFunc_GetOriginPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentCharacter_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayerController*                  CallFunc_GetCharacterController_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         CallFunc_GetQTEChar_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_CheckIsFightPlayer_C_K2_CheckCondition) == 0x000008, "Wrong alignment on Condition_CheckIsFightPlayer_C_K2_CheckCondition");
static_assert(sizeof(Condition_CheckIsFightPlayer_C_K2_CheckCondition) == 0x000048, "Wrong size on Condition_CheckIsFightPlayer_C_K2_CheckCondition");
static_assert(offsetof(Condition_CheckIsFightPlayer_C_K2_CheckCondition, InCurLauncher) == 0x000000, "Member 'Condition_CheckIsFightPlayer_C_K2_CheckCondition::InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_CheckIsFightPlayer_C_K2_CheckCondition, InCurLauncherChara) == 0x000008, "Member 'Condition_CheckIsFightPlayer_C_K2_CheckCondition::InCurLauncherChara' has a wrong offset!");
static_assert(offsetof(Condition_CheckIsFightPlayer_C_K2_CheckCondition, ReturnValue) == 0x000010, "Member 'Condition_CheckIsFightPlayer_C_K2_CheckCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckIsFightPlayer_C_K2_CheckCondition, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'Condition_CheckIsFightPlayer_C_K2_CheckCondition::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckIsFightPlayer_C_K2_CheckCondition, CallFunc_GetLauncherOriginCharacter_ReturnValue) == 0x000018, "Member 'Condition_CheckIsFightPlayer_C_K2_CheckCondition::CallFunc_GetLauncherOriginCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckIsFightPlayer_C_K2_CheckCondition, CallFunc_GetOriginPlayer_ReturnValue) == 0x000020, "Member 'Condition_CheckIsFightPlayer_C_K2_CheckCondition::CallFunc_GetOriginPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckIsFightPlayer_C_K2_CheckCondition, CallFunc_IsCurrentCharacter_ReturnValue) == 0x000028, "Member 'Condition_CheckIsFightPlayer_C_K2_CheckCondition::CallFunc_IsCurrentCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckIsFightPlayer_C_K2_CheckCondition, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'Condition_CheckIsFightPlayer_C_K2_CheckCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckIsFightPlayer_C_K2_CheckCondition, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x00002A, "Member 'Condition_CheckIsFightPlayer_C_K2_CheckCondition::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckIsFightPlayer_C_K2_CheckCondition, CallFunc_GetCharacterController_ReturnValue) == 0x000030, "Member 'Condition_CheckIsFightPlayer_C_K2_CheckCondition::CallFunc_GetCharacterController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckIsFightPlayer_C_K2_CheckCondition, CallFunc_GetQTEChar_ReturnValue) == 0x000038, "Member 'Condition_CheckIsFightPlayer_C_K2_CheckCondition::CallFunc_GetQTEChar_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckIsFightPlayer_C_K2_CheckCondition, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'Condition_CheckIsFightPlayer_C_K2_CheckCondition::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_CheckIsFightPlayer_C_K2_CheckCondition, CallFunc_IsValid_ReturnValue_2) == 0x000041, "Member 'Condition_CheckIsFightPlayer_C_K2_CheckCondition::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function Condition_CheckIsFightPlayer.Condition_CheckIsFightPlayer_C.ExecuteUbergraph_Condition_CheckIsFightPlayer
// 0x0008 (0x0008 - 0x0000)
struct Condition_CheckIsFightPlayer_C_ExecuteUbergraph_Condition_CheckIsFightPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetParamboolValue_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_CheckIsFightPlayer_C_ExecuteUbergraph_Condition_CheckIsFightPlayer) == 0x000004, "Wrong alignment on Condition_CheckIsFightPlayer_C_ExecuteUbergraph_Condition_CheckIsFightPlayer");
static_assert(sizeof(Condition_CheckIsFightPlayer_C_ExecuteUbergraph_Condition_CheckIsFightPlayer) == 0x000008, "Wrong size on Condition_CheckIsFightPlayer_C_ExecuteUbergraph_Condition_CheckIsFightPlayer");
static_assert(offsetof(Condition_CheckIsFightPlayer_C_ExecuteUbergraph_Condition_CheckIsFightPlayer, EntryPoint) == 0x000000, "Member 'Condition_CheckIsFightPlayer_C_ExecuteUbergraph_Condition_CheckIsFightPlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(Condition_CheckIsFightPlayer_C_ExecuteUbergraph_Condition_CheckIsFightPlayer, CallFunc_GetParamboolValue_ReturnValue) == 0x000004, "Member 'Condition_CheckIsFightPlayer_C_ExecuteUbergraph_Condition_CheckIsFightPlayer::CallFunc_GetParamboolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckIsFightPlayer_C_ExecuteUbergraph_Condition_CheckIsFightPlayer, K2Node_SwitchString_CmpSuccess) == 0x000005, "Member 'Condition_CheckIsFightPlayer_C_ExecuteUbergraph_Condition_CheckIsFightPlayer::K2Node_SwitchString_CmpSuccess' has a wrong offset!");

}

