#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_ApplyAbnormal

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Game_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Condition_ApplyAbnormal.Condition_ApplyAbnormal_C
// 0x0030 (0x0138 - 0x0108)
class UCondition_ApplyAbnormal_C final : public UCastConditionCheck
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bApplyAbnormal;                                    // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EAbnormalState>                        IgnoreAbnormalStates;                              // 0x0118(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         IgnoreAbnormalStateStrings;                        // 0x0128(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BindEvent(class UAbilityComponentBase* Ability);
	void UnbindEvent(class UAbilityComponentBase* Ability);
	void K2_InitCondition();
	void OnApplyAbnormal(class UAbilityComponentBase* Target, class UAbilityComponentBase* Causer, EAbnormalState AbnormalState);
	void K2_BindEvent(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void K2_UnbindEvent(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void ExecuteUbergraph_Condition_ApplyAbnormal(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Condition_ApplyAbnormal_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Condition_ApplyAbnormal_C")
	}
	static class UCondition_ApplyAbnormal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCondition_ApplyAbnormal_C>();
	}
};
DUMPER7_ASSERTS_UCondition_ApplyAbnormal_C;

}

