#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_CheckBowArrowCount

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Game_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Condition_CheckBowArrowCount.Condition_CheckBowArrowCount_C
// 0x0038 (0x0140 - 0x0108)
class UCondition_CheckBowArrowCount_C final : public UCastConditionCheck
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class FString>                         Tags;                                              // 0x0110(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FValueRangeInfo>                ValueRange;                                        // 0x0120(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<EBowArrowResidueType>                  CheckType;                                         // 0x0130(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	bool K2_CheckCondition(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void K2_InitCondition();
	void ExecuteUbergraph_Condition_CheckBowArrowCount(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Condition_CheckBowArrowCount_C">();
	}
	static class UCondition_CheckBowArrowCount_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCondition_CheckBowArrowCount_C>();
	}
};
static_assert(alignof(UCondition_CheckBowArrowCount_C) == 0x000008, "Wrong alignment on UCondition_CheckBowArrowCount_C");
static_assert(sizeof(UCondition_CheckBowArrowCount_C) == 0x000140, "Wrong size on UCondition_CheckBowArrowCount_C");
static_assert(offsetof(UCondition_CheckBowArrowCount_C, UberGraphFrame) == 0x000108, "Member 'UCondition_CheckBowArrowCount_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCondition_CheckBowArrowCount_C, Tags) == 0x000110, "Member 'UCondition_CheckBowArrowCount_C::Tags' has a wrong offset!");
static_assert(offsetof(UCondition_CheckBowArrowCount_C, ValueRange) == 0x000120, "Member 'UCondition_CheckBowArrowCount_C::ValueRange' has a wrong offset!");
static_assert(offsetof(UCondition_CheckBowArrowCount_C, CheckType) == 0x000130, "Member 'UCondition_CheckBowArrowCount_C::CheckType' has a wrong offset!");

}

