#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_ModifierCheckTime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Condition_ModifierCheckTime.Condition_ModifierCheckTime_C
// 0x0028 (0x0130 - 0x0108)
class UCondition_ModifierCheckTime_C final : public UCastConditionCheck
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AGameCharacter*                         TempLauncher;                                      // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ModifierID;                                        // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LifeTime;                                          // 0x011C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Compare;                                           // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void K2_InitCondition();
	void ExecuteUbergraph_Condition_ModifierCheckTime(int32 EntryPoint);
	bool K2_CheckCondition(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Condition_ModifierCheckTime_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Condition_ModifierCheckTime_C")
	}
	static class UCondition_ModifierCheckTime_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCondition_ModifierCheckTime_C>();
	}
};
DUMPER7_ASSERTS_UCondition_ModifierCheckTime_C;

}

