#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_CheckViewDirection_F

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Condition_CheckViewDirection_F.Condition_CheckViewDirection_F_C.UpdateCoefficient
// 0x0028 (0x0028 - 0x0000)
struct Condition_CheckViewDirection_F_C_UpdateCoefficient final
{
public:
	TArray<float>                                 Coefficients;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         CallFunc_Array_Get_Item;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_1;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Array_Get_Item_2;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_3;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_2;         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_3;         // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_CheckViewDirection_F_C_UpdateCoefficient) == 0x000008, "Wrong alignment on Condition_CheckViewDirection_F_C_UpdateCoefficient");
static_assert(sizeof(Condition_CheckViewDirection_F_C_UpdateCoefficient) == 0x000028, "Wrong size on Condition_CheckViewDirection_F_C_UpdateCoefficient");
static_assert(offsetof(Condition_CheckViewDirection_F_C_UpdateCoefficient, Coefficients) == 0x000000, "Member 'Condition_CheckViewDirection_F_C_UpdateCoefficient::Coefficients' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_UpdateCoefficient, CallFunc_Array_Get_Item) == 0x000010, "Member 'Condition_CheckViewDirection_F_C_UpdateCoefficient::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_UpdateCoefficient, CallFunc_Array_Get_Item_1) == 0x000014, "Member 'Condition_CheckViewDirection_F_C_UpdateCoefficient::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_UpdateCoefficient, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000018, "Member 'Condition_CheckViewDirection_F_C_UpdateCoefficient::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_UpdateCoefficient, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000019, "Member 'Condition_CheckViewDirection_F_C_UpdateCoefficient::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_UpdateCoefficient, CallFunc_Array_Get_Item_2) == 0x00001C, "Member 'Condition_CheckViewDirection_F_C_UpdateCoefficient::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_UpdateCoefficient, CallFunc_Array_Get_Item_3) == 0x000020, "Member 'Condition_CheckViewDirection_F_C_UpdateCoefficient::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_UpdateCoefficient, CallFunc_Array_IsValidIndex_ReturnValue_2) == 0x000024, "Member 'Condition_CheckViewDirection_F_C_UpdateCoefficient::CallFunc_Array_IsValidIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_UpdateCoefficient, CallFunc_Array_IsValidIndex_ReturnValue_3) == 0x000025, "Member 'Condition_CheckViewDirection_F_C_UpdateCoefficient::CallFunc_Array_IsValidIndex_ReturnValue_3' has a wrong offset!");

// Function Condition_CheckViewDirection_F.Condition_CheckViewDirection_F_C.K2_CheckCondition
// 0x0038 (0x0038 - 0x0000)
struct Condition_CheckViewDirection_F_C_K2_CheckCondition final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CalcViewOffsetDirection_Direction;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParamintValue_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 CallFunc_GetParamfloatArrayValue_ReturnValue;      // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetParamintValue_ReturnValue_1;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_CheckViewDirection_F_C_K2_CheckCondition) == 0x000008, "Wrong alignment on Condition_CheckViewDirection_F_C_K2_CheckCondition");
static_assert(sizeof(Condition_CheckViewDirection_F_C_K2_CheckCondition) == 0x000038, "Wrong size on Condition_CheckViewDirection_F_C_K2_CheckCondition");
static_assert(offsetof(Condition_CheckViewDirection_F_C_K2_CheckCondition, InCurLauncher) == 0x000000, "Member 'Condition_CheckViewDirection_F_C_K2_CheckCondition::InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_K2_CheckCondition, InCurLauncherChara) == 0x000008, "Member 'Condition_CheckViewDirection_F_C_K2_CheckCondition::InCurLauncherChara' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_K2_CheckCondition, ReturnValue) == 0x000010, "Member 'Condition_CheckViewDirection_F_C_K2_CheckCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_K2_CheckCondition, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'Condition_CheckViewDirection_F_C_K2_CheckCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_K2_CheckCondition, CallFunc_CalcViewOffsetDirection_Direction) == 0x000014, "Member 'Condition_CheckViewDirection_F_C_K2_CheckCondition::CallFunc_CalcViewOffsetDirection_Direction' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_K2_CheckCondition, CallFunc_GetParamintValue_ReturnValue) == 0x000018, "Member 'Condition_CheckViewDirection_F_C_K2_CheckCondition::CallFunc_GetParamintValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_K2_CheckCondition, CallFunc_GetParamfloatArrayValue_ReturnValue) == 0x000020, "Member 'Condition_CheckViewDirection_F_C_K2_CheckCondition::CallFunc_GetParamfloatArrayValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_K2_CheckCondition, CallFunc_GetParamintValue_ReturnValue_1) == 0x000030, "Member 'Condition_CheckViewDirection_F_C_K2_CheckCondition::CallFunc_GetParamintValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_K2_CheckCondition, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000034, "Member 'Condition_CheckViewDirection_F_C_K2_CheckCondition::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function Condition_CheckViewDirection_F.Condition_CheckViewDirection_F_C.CalcViewOffsetDirection
// 0x00E0 (0x00E0 - 0x0000)
struct Condition_CheckViewDirection_F_C_CalcViewOffsetDirection final
{
public:
	class AGameCharacter*                         Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Direction;                                         // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LeftDotResult;                                     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RightDotResult;                                    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BackDotResult;                                     // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ForwardDotResult;                                  // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCurrentAcceleration_ReturnValue;       // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayerController*                  K2Node_DynamicCast_AsGame_Player_Controller;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_2;                       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_1;      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_2;      // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_3;      // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorInt_ReturnValue;           // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorInt_ReturnValue_1;         // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_2;           // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_3;           // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection) == 0x000008, "Wrong alignment on Condition_CheckViewDirection_F_C_CalcViewOffsetDirection");
static_assert(sizeof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection) == 0x0000E0, "Wrong size on Condition_CheckViewDirection_F_C_CalcViewOffsetDirection");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, Character) == 0x000000, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::Character' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, Direction) == 0x000008, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::Direction' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, LeftDotResult) == 0x00000C, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::LeftDotResult' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, RightDotResult) == 0x000010, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::RightDotResult' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, BackDotResult) == 0x000014, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::BackDotResult' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, ForwardDotResult) == 0x000018, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::ForwardDotResult' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_GetController_ReturnValue) == 0x000020, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_GetCurrentAcceleration_ReturnValue) == 0x000028, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_GetCurrentAcceleration_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, K2Node_DynamicCast_AsGame_Player_Controller) == 0x000038, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::K2Node_DynamicCast_AsGame_Player_Controller' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_VSize_ReturnValue) == 0x000044, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_GetActorForwardVector_ReturnValue) == 0x000048, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000054, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_GetActorForwardVector_ReturnValue_1) == 0x000058, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_GetActorForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_FMax_ReturnValue) == 0x000064, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_FMax_ReturnValue_1) == 0x000068, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_FMax_ReturnValue_2) == 0x00006C, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_FMax_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000070, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_EqualEqual_FloatFloat_ReturnValue_1) == 0x000071, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_EqualEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_EqualEqual_FloatFloat_ReturnValue_2) == 0x000072, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_EqualEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_EqualEqual_FloatFloat_ReturnValue_3) == 0x000073, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_EqualEqual_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_MakeVector_ReturnValue) == 0x000074, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_FindLookAtRotation_ReturnValue) == 0x000080, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_GetRightVector_ReturnValue) == 0x00008C, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_GetForwardVector_ReturnValue) == 0x000098, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_Multiply_VectorInt_ReturnValue) == 0x0000A4, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_Multiply_VectorInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_Multiply_VectorInt_ReturnValue_1) == 0x0000B0, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_Multiply_VectorInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_Dot_VectorVector_ReturnValue) == 0x0000BC, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x0000C0, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000C4, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000C8, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_Dot_VectorVector_ReturnValue_2) == 0x0000CC, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_Dot_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_Dot_VectorVector_ReturnValue_3) == 0x0000D0, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_Dot_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0000D4, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Condition_CheckViewDirection_F_C_CalcViewOffsetDirection, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0000D8, "Member 'Condition_CheckViewDirection_F_C_CalcViewOffsetDirection::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");

}

