#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_CharacterState

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Game_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Condition_CharacterState.Condition_CharacterState_C
// 0x0018 (0x0120 - 0x0108)
class UCondition_CharacterState_C final : public UCastConditionCheck
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsEnter;                                           // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ECharacterActionState                         PlayerAction;                                      // 0x0111(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMoveAction;                                      // 0x0112(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EGamePlayerMoveState                          MoveState;                                         // 0x0113(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastPos;                                           // 0x0114(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CheckShiftDistance();
	void InitEnterCheck();
	void K2_InitCondition();
	void BindEvent(class AGameCharacter* InCharacter);
	void UnbindEvent(class AGameCharacter* InCharacter);
	void OnNotifyPlayerAction(class AGameCharacter* CurCharacter, ECharacterActionState InType, bool bSet);
	void NotifyPlayerAction(class AGameCharacter* InCharacter, ECharacterActionState InType, bool bSet);
	void OnNotifyPlayerMove(class AGameCharacter* CurCharacter, EGamePlayerMoveState LastType, EGamePlayerMoveState CurType);
	void NotifyPlayerMove(class AGameCharacter* InCharacter, EGamePlayerMoveState LastType, EGamePlayerMoveState CurType);
	void K2_BindEvent(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void K2_UnbindEvent(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void ExecuteUbergraph_Condition_CharacterState(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Condition_CharacterState_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Condition_CharacterState_C")
	}
	static class UCondition_CharacterState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCondition_CharacterState_C>();
	}
};
DUMPER7_ASSERTS_UCondition_CharacterState_C;

}

