#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_SkillKeepIdentifyNotify

#include "Basic.hpp"


namespace SDK::Params
{

// Function Condition_SkillKeepIdentifyNotify.Condition_SkillKeepIdentifyNotify_C.OnNotifySkillKeepIdentify
// 0x000C (0x000C - 0x0000)
struct Condition_SkillKeepIdentifyNotify_C_OnNotifySkillKeepIdentify final
{
public:
	class FName                                   IdentifyName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bStartKeeping;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bInterrupt;                                        // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_SkillKeepIdentifyNotify_C_OnNotifySkillKeepIdentify) == 0x000004, "Wrong alignment on Condition_SkillKeepIdentifyNotify_C_OnNotifySkillKeepIdentify");
static_assert(sizeof(Condition_SkillKeepIdentifyNotify_C_OnNotifySkillKeepIdentify) == 0x00000C, "Wrong size on Condition_SkillKeepIdentifyNotify_C_OnNotifySkillKeepIdentify");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_OnNotifySkillKeepIdentify, IdentifyName) == 0x000000, "Member 'Condition_SkillKeepIdentifyNotify_C_OnNotifySkillKeepIdentify::IdentifyName' has a wrong offset!");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_OnNotifySkillKeepIdentify, bStartKeeping) == 0x000008, "Member 'Condition_SkillKeepIdentifyNotify_C_OnNotifySkillKeepIdentify::bStartKeeping' has a wrong offset!");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_OnNotifySkillKeepIdentify, bInterrupt) == 0x000009, "Member 'Condition_SkillKeepIdentifyNotify_C_OnNotifySkillKeepIdentify::bInterrupt' has a wrong offset!");

// Function Condition_SkillKeepIdentifyNotify.Condition_SkillKeepIdentifyNotify_C.K2_UnbindEvent
// 0x0010 (0x0010 - 0x0000)
struct Condition_SkillKeepIdentifyNotify_C_K2_UnbindEvent final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_SkillKeepIdentifyNotify_C_K2_UnbindEvent) == 0x000008, "Wrong alignment on Condition_SkillKeepIdentifyNotify_C_K2_UnbindEvent");
static_assert(sizeof(Condition_SkillKeepIdentifyNotify_C_K2_UnbindEvent) == 0x000010, "Wrong size on Condition_SkillKeepIdentifyNotify_C_K2_UnbindEvent");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_K2_UnbindEvent, InCurLauncher) == 0x000000, "Member 'Condition_SkillKeepIdentifyNotify_C_K2_UnbindEvent::InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_K2_UnbindEvent, InCurLauncherChara) == 0x000008, "Member 'Condition_SkillKeepIdentifyNotify_C_K2_UnbindEvent::InCurLauncherChara' has a wrong offset!");

// Function Condition_SkillKeepIdentifyNotify.Condition_SkillKeepIdentifyNotify_C.ExecuteUbergraph_Condition_SkillKeepIdentifyNotify
// 0x0070 (0x0070 - 0x0000)
struct Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  CallFunc_GetLauncherAbility_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  CallFunc_GetLauncherAbility_ReturnValue_1;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName IdentifyName, bool bStartKeeping, bool bInterrupt)> K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_IdentifyName;                   // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bStartKeeping;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bInterrupt;                     // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_Event_InCurLauncher_1;                      // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_InCurLauncherChara_1;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponentBase*                  K2Node_Event_InCurLauncher;                        // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_InCurLauncherChara;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify) == 0x000008, "Wrong alignment on Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify");
static_assert(sizeof(Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify) == 0x000070, "Wrong size on Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify, EntryPoint) == 0x000000, "Member 'Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify::EntryPoint' has a wrong offset!");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify, CallFunc_GetLauncherAbility_ReturnValue) == 0x000008, "Member 'Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify::CallFunc_GetLauncherAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify, K2Node_SwitchString_CmpSuccess) == 0x000011, "Member 'Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify, CallFunc_GetLauncherAbility_ReturnValue_1) == 0x000018, "Member 'Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify::CallFunc_GetLauncherAbility_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify, CallFunc_Conv_StringToName_ReturnValue) == 0x000020, "Member 'Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify, K2Node_CustomEvent_IdentifyName) == 0x00003C, "Member 'Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify::K2Node_CustomEvent_IdentifyName' has a wrong offset!");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify, K2Node_CustomEvent_bStartKeeping) == 0x000044, "Member 'Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify::K2Node_CustomEvent_bStartKeeping' has a wrong offset!");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify, K2Node_CustomEvent_bInterrupt) == 0x000045, "Member 'Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify::K2Node_CustomEvent_bInterrupt' has a wrong offset!");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify, CallFunc_Not_PreBool_ReturnValue) == 0x000046, "Member 'Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify, CallFunc_BooleanAND_ReturnValue) == 0x000047, "Member 'Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000048, "Member 'Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify, K2Node_SwitchInteger_CmpSuccess) == 0x000049, "Member 'Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify, K2Node_Event_InCurLauncher_1) == 0x000050, "Member 'Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify::K2Node_Event_InCurLauncher_1' has a wrong offset!");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify, K2Node_Event_InCurLauncherChara_1) == 0x000058, "Member 'Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify::K2Node_Event_InCurLauncherChara_1' has a wrong offset!");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify, K2Node_Event_InCurLauncher) == 0x000060, "Member 'Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify::K2Node_Event_InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify, K2Node_Event_InCurLauncherChara) == 0x000068, "Member 'Condition_SkillKeepIdentifyNotify_C_ExecuteUbergraph_Condition_SkillKeepIdentifyNotify::K2Node_Event_InCurLauncherChara' has a wrong offset!");

// Function Condition_SkillKeepIdentifyNotify.Condition_SkillKeepIdentifyNotify_C.K2_BindEvent
// 0x0010 (0x0010 - 0x0000)
struct Condition_SkillKeepIdentifyNotify_C_K2_BindEvent final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_SkillKeepIdentifyNotify_C_K2_BindEvent) == 0x000008, "Wrong alignment on Condition_SkillKeepIdentifyNotify_C_K2_BindEvent");
static_assert(sizeof(Condition_SkillKeepIdentifyNotify_C_K2_BindEvent) == 0x000010, "Wrong size on Condition_SkillKeepIdentifyNotify_C_K2_BindEvent");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_K2_BindEvent, InCurLauncher) == 0x000000, "Member 'Condition_SkillKeepIdentifyNotify_C_K2_BindEvent::InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_SkillKeepIdentifyNotify_C_K2_BindEvent, InCurLauncherChara) == 0x000008, "Member 'Condition_SkillKeepIdentifyNotify_C_K2_BindEvent::InCurLauncherChara' has a wrong offset!");

}

