#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_CharacterState

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Condition_CharacterState.Condition_CharacterState_C.CheckShiftDistance
// 0x0038 (0x0038 - 0x0000)
struct Condition_CharacterState_C_CheckShiftDistance final
{
public:
	class AGameCharacter*                         CallFunc_GetLauncherOriginCharacter_ReturnValue;   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetLauncherOriginCharacter_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_CharacterState_C_CheckShiftDistance) == 0x000008, "Wrong alignment on Condition_CharacterState_C_CheckShiftDistance");
static_assert(sizeof(Condition_CharacterState_C_CheckShiftDistance) == 0x000038, "Wrong size on Condition_CharacterState_C_CheckShiftDistance");
static_assert(offsetof(Condition_CharacterState_C_CheckShiftDistance, CallFunc_GetLauncherOriginCharacter_ReturnValue) == 0x000000, "Member 'Condition_CharacterState_C_CheckShiftDistance::CallFunc_GetLauncherOriginCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CharacterState_C_CheckShiftDistance, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'Condition_CharacterState_C_CheckShiftDistance::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CharacterState_C_CheckShiftDistance, K2Node_SwitchEnum_CmpSuccess) == 0x000009, "Member 'Condition_CharacterState_C_CheckShiftDistance::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Condition_CharacterState_C_CheckShiftDistance, CallFunc_GetLauncherOriginCharacter_ReturnValue_1) == 0x000010, "Member 'Condition_CharacterState_C_CheckShiftDistance::CallFunc_GetLauncherOriginCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_CharacterState_C_CheckShiftDistance, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'Condition_CharacterState_C_CheckShiftDistance::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CharacterState_C_CheckShiftDistance, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000024, "Member 'Condition_CharacterState_C_CheckShiftDistance::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CharacterState_C_CheckShiftDistance, CallFunc_VSize_ReturnValue) == 0x000030, "Member 'Condition_CharacterState_C_CheckShiftDistance::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CharacterState_C_CheckShiftDistance, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000034, "Member 'Condition_CharacterState_C_CheckShiftDistance::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CharacterState_C_CheckShiftDistance, CallFunc_BooleanAND_ReturnValue) == 0x000035, "Member 'Condition_CharacterState_C_CheckShiftDistance::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function Condition_CharacterState.Condition_CharacterState_C.InitEnterCheck
// 0x0018 (0x0018 - 0x0000)
struct Condition_CharacterState_C_InitEnterCheck final
{
public:
	class AGameCharacter*                         CallFunc_GetLauncherOriginCharacter_ReturnValue;   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterStateMachineComponent*        K2Node_DynamicCast_AsCharacter_State_Machine_Component; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCharacterActionState_ReturnValue;    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGamePlayerMoveState                          CallFunc_GetPlayerMoveState_ReturnValue;           // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_CharacterState_C_InitEnterCheck) == 0x000008, "Wrong alignment on Condition_CharacterState_C_InitEnterCheck");
static_assert(sizeof(Condition_CharacterState_C_InitEnterCheck) == 0x000018, "Wrong size on Condition_CharacterState_C_InitEnterCheck");
static_assert(offsetof(Condition_CharacterState_C_InitEnterCheck, CallFunc_GetLauncherOriginCharacter_ReturnValue) == 0x000000, "Member 'Condition_CharacterState_C_InitEnterCheck::CallFunc_GetLauncherOriginCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CharacterState_C_InitEnterCheck, K2Node_DynamicCast_AsCharacter_State_Machine_Component) == 0x000008, "Member 'Condition_CharacterState_C_InitEnterCheck::K2Node_DynamicCast_AsCharacter_State_Machine_Component' has a wrong offset!");
static_assert(offsetof(Condition_CharacterState_C_InitEnterCheck, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'Condition_CharacterState_C_InitEnterCheck::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Condition_CharacterState_C_InitEnterCheck, CallFunc_CheckCharacterActionState_ReturnValue) == 0x000011, "Member 'Condition_CharacterState_C_InitEnterCheck::CallFunc_CheckCharacterActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CharacterState_C_InitEnterCheck, CallFunc_GetPlayerMoveState_ReturnValue) == 0x000012, "Member 'Condition_CharacterState_C_InitEnterCheck::CallFunc_GetPlayerMoveState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CharacterState_C_InitEnterCheck, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000013, "Member 'Condition_CharacterState_C_InitEnterCheck::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function Condition_CharacterState.Condition_CharacterState_C.BindEvent
// 0x0008 (0x0008 - 0x0000)
struct Condition_CharacterState_C_BindEvent final
{
public:
	class AGameCharacter*                         InCharacter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_CharacterState_C_BindEvent) == 0x000008, "Wrong alignment on Condition_CharacterState_C_BindEvent");
static_assert(sizeof(Condition_CharacterState_C_BindEvent) == 0x000008, "Wrong size on Condition_CharacterState_C_BindEvent");
static_assert(offsetof(Condition_CharacterState_C_BindEvent, InCharacter) == 0x000000, "Member 'Condition_CharacterState_C_BindEvent::InCharacter' has a wrong offset!");

// Function Condition_CharacterState.Condition_CharacterState_C.UnbindEvent
// 0x0008 (0x0008 - 0x0000)
struct Condition_CharacterState_C_UnbindEvent final
{
public:
	class AGameCharacter*                         InCharacter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_CharacterState_C_UnbindEvent) == 0x000008, "Wrong alignment on Condition_CharacterState_C_UnbindEvent");
static_assert(sizeof(Condition_CharacterState_C_UnbindEvent) == 0x000008, "Wrong size on Condition_CharacterState_C_UnbindEvent");
static_assert(offsetof(Condition_CharacterState_C_UnbindEvent, InCharacter) == 0x000000, "Member 'Condition_CharacterState_C_UnbindEvent::InCharacter' has a wrong offset!");

// Function Condition_CharacterState.Condition_CharacterState_C.OnNotifyPlayerAction
// 0x0010 (0x0010 - 0x0000)
struct Condition_CharacterState_C_OnNotifyPlayerAction final
{
public:
	class AGameCharacter*                         CurCharacter;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterActionState                         InType;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSet;                                              // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_CharacterState_C_OnNotifyPlayerAction) == 0x000008, "Wrong alignment on Condition_CharacterState_C_OnNotifyPlayerAction");
static_assert(sizeof(Condition_CharacterState_C_OnNotifyPlayerAction) == 0x000010, "Wrong size on Condition_CharacterState_C_OnNotifyPlayerAction");
static_assert(offsetof(Condition_CharacterState_C_OnNotifyPlayerAction, CurCharacter) == 0x000000, "Member 'Condition_CharacterState_C_OnNotifyPlayerAction::CurCharacter' has a wrong offset!");
static_assert(offsetof(Condition_CharacterState_C_OnNotifyPlayerAction, InType) == 0x000008, "Member 'Condition_CharacterState_C_OnNotifyPlayerAction::InType' has a wrong offset!");
static_assert(offsetof(Condition_CharacterState_C_OnNotifyPlayerAction, bSet) == 0x000009, "Member 'Condition_CharacterState_C_OnNotifyPlayerAction::bSet' has a wrong offset!");

// Function Condition_CharacterState.Condition_CharacterState_C.NotifyPlayerAction
// 0x0010 (0x0010 - 0x0000)
struct Condition_CharacterState_C_NotifyPlayerAction final
{
public:
	class AGameCharacter*                         InCharacter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterActionState                         InType;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSet;                                              // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_CharacterState_C_NotifyPlayerAction) == 0x000008, "Wrong alignment on Condition_CharacterState_C_NotifyPlayerAction");
static_assert(sizeof(Condition_CharacterState_C_NotifyPlayerAction) == 0x000010, "Wrong size on Condition_CharacterState_C_NotifyPlayerAction");
static_assert(offsetof(Condition_CharacterState_C_NotifyPlayerAction, InCharacter) == 0x000000, "Member 'Condition_CharacterState_C_NotifyPlayerAction::InCharacter' has a wrong offset!");
static_assert(offsetof(Condition_CharacterState_C_NotifyPlayerAction, InType) == 0x000008, "Member 'Condition_CharacterState_C_NotifyPlayerAction::InType' has a wrong offset!");
static_assert(offsetof(Condition_CharacterState_C_NotifyPlayerAction, bSet) == 0x000009, "Member 'Condition_CharacterState_C_NotifyPlayerAction::bSet' has a wrong offset!");

// Function Condition_CharacterState.Condition_CharacterState_C.OnNotifyPlayerMove
// 0x0010 (0x0010 - 0x0000)
struct Condition_CharacterState_C_OnNotifyPlayerMove final
{
public:
	class AGameCharacter*                         CurCharacter;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGamePlayerMoveState                          LastType;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGamePlayerMoveState                          CurType;                                           // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_CharacterState_C_OnNotifyPlayerMove) == 0x000008, "Wrong alignment on Condition_CharacterState_C_OnNotifyPlayerMove");
static_assert(sizeof(Condition_CharacterState_C_OnNotifyPlayerMove) == 0x000010, "Wrong size on Condition_CharacterState_C_OnNotifyPlayerMove");
static_assert(offsetof(Condition_CharacterState_C_OnNotifyPlayerMove, CurCharacter) == 0x000000, "Member 'Condition_CharacterState_C_OnNotifyPlayerMove::CurCharacter' has a wrong offset!");
static_assert(offsetof(Condition_CharacterState_C_OnNotifyPlayerMove, LastType) == 0x000008, "Member 'Condition_CharacterState_C_OnNotifyPlayerMove::LastType' has a wrong offset!");
static_assert(offsetof(Condition_CharacterState_C_OnNotifyPlayerMove, CurType) == 0x000009, "Member 'Condition_CharacterState_C_OnNotifyPlayerMove::CurType' has a wrong offset!");

// Function Condition_CharacterState.Condition_CharacterState_C.NotifyPlayerMove
// 0x0010 (0x0010 - 0x0000)
struct Condition_CharacterState_C_NotifyPlayerMove final
{
public:
	class AGameCharacter*                         InCharacter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGamePlayerMoveState                          LastType;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGamePlayerMoveState                          CurType;                                           // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_CharacterState_C_NotifyPlayerMove) == 0x000008, "Wrong alignment on Condition_CharacterState_C_NotifyPlayerMove");
static_assert(sizeof(Condition_CharacterState_C_NotifyPlayerMove) == 0x000010, "Wrong size on Condition_CharacterState_C_NotifyPlayerMove");
static_assert(offsetof(Condition_CharacterState_C_NotifyPlayerMove, InCharacter) == 0x000000, "Member 'Condition_CharacterState_C_NotifyPlayerMove::InCharacter' has a wrong offset!");
static_assert(offsetof(Condition_CharacterState_C_NotifyPlayerMove, LastType) == 0x000008, "Member 'Condition_CharacterState_C_NotifyPlayerMove::LastType' has a wrong offset!");
static_assert(offsetof(Condition_CharacterState_C_NotifyPlayerMove, CurType) == 0x000009, "Member 'Condition_CharacterState_C_NotifyPlayerMove::CurType' has a wrong offset!");

// Function Condition_CharacterState.Condition_CharacterState_C.K2_BindEvent
// 0x0010 (0x0010 - 0x0000)
struct Condition_CharacterState_C_K2_BindEvent final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_CharacterState_C_K2_BindEvent) == 0x000008, "Wrong alignment on Condition_CharacterState_C_K2_BindEvent");
static_assert(sizeof(Condition_CharacterState_C_K2_BindEvent) == 0x000010, "Wrong size on Condition_CharacterState_C_K2_BindEvent");
static_assert(offsetof(Condition_CharacterState_C_K2_BindEvent, InCurLauncher) == 0x000000, "Member 'Condition_CharacterState_C_K2_BindEvent::InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_CharacterState_C_K2_BindEvent, InCurLauncherChara) == 0x000008, "Member 'Condition_CharacterState_C_K2_BindEvent::InCurLauncherChara' has a wrong offset!");

// Function Condition_CharacterState.Condition_CharacterState_C.K2_UnbindEvent
// 0x0010 (0x0010 - 0x0000)
struct Condition_CharacterState_C_K2_UnbindEvent final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_CharacterState_C_K2_UnbindEvent) == 0x000008, "Wrong alignment on Condition_CharacterState_C_K2_UnbindEvent");
static_assert(sizeof(Condition_CharacterState_C_K2_UnbindEvent) == 0x000010, "Wrong size on Condition_CharacterState_C_K2_UnbindEvent");
static_assert(offsetof(Condition_CharacterState_C_K2_UnbindEvent, InCurLauncher) == 0x000000, "Member 'Condition_CharacterState_C_K2_UnbindEvent::InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_CharacterState_C_K2_UnbindEvent, InCurLauncherChara) == 0x000008, "Member 'Condition_CharacterState_C_K2_UnbindEvent::InCurLauncherChara' has a wrong offset!");

// Function Condition_CharacterState.Condition_CharacterState_C.ExecuteUbergraph_Condition_CharacterState
// 0x00D0 (0x00D0 - 0x0000)
struct Condition_CharacterState_C_ExecuteUbergraph_Condition_CharacterState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_Event_InCurLauncher;                        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_InCurLauncherChara;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess_1;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_CustomEvent_InCharacter_3;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_CustomEvent_InCharacter_2;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_CustomEvent_CurCharacter_1;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterActionState                         K2Node_CustomEvent_InType_1;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSet_1;                         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_CustomEvent_InCharacter_1;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterActionState                         K2Node_CustomEvent_InType;                         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSet;                           // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_CustomEvent_CurCharacter;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGamePlayerMoveState                          K2Node_CustomEvent_LastType_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGamePlayerMoveState                          K2Node_CustomEvent_CurType_1;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_CustomEvent_InCharacter;                    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGamePlayerMoveState                          K2Node_CustomEvent_LastType;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGamePlayerMoveState                          K2Node_CustomEvent_CurType;                        // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AGameCharacter* CurCharacter, EGamePlayerMoveState LastType, EGamePlayerMoveState CurType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AGameCharacter* CurCharacter, ECharacterActionState InType, bool bSet)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         CallFunc_GetLauncherOriginCharacter_ReturnValue;   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponentBase*                  K2Node_Event_InCurLauncher_1;                      // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_InCurLauncherChara_1;                 // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_CharacterState_C_ExecuteUbergraph_Condition_CharacterState) == 0x000008, "Wrong alignment on Condition_CharacterState_C_ExecuteUbergraph_Condition_CharacterState");
static_assert(sizeof(Condition_CharacterState_C_ExecuteUbergraph_Condition_CharacterState) == 0x0000D0, "Wrong size on Condition_CharacterState_C_ExecuteUbergraph_Condition_CharacterState");
static_assert(offsetof(Condition_CharacterState_C_ExecuteUbergraph_Condition_CharacterState, EntryPoint) == 0x000000, "Member 'Condition_CharacterState_C_ExecuteUbergraph_Condition_CharacterState::EntryPoint' has a wrong offset!");
static_assert(offsetof(Condition_CharacterState_C_ExecuteUbergraph_Condition_CharacterState, K2Node_Event_InCurLauncher) == 0x000008, "Member 'Condition_CharacterState_C_ExecuteUbergraph_Condition_CharacterState::K2Node_Event_InCurLauncher' has a wrong offset!");
