#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_SkillCast

#include "Basic.hpp"


namespace SDK::Params
{

// Function Condition_SkillCast.Condition_SkillCast_C.ResetCondition
// 0x0001 (0x0001 - 0x0000)
struct Condition_SkillCast_C_ResetCondition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_SkillCast_C_ResetCondition) == 0x000001, "Wrong alignment on Condition_SkillCast_C_ResetCondition");
static_assert(sizeof(Condition_SkillCast_C_ResetCondition) == 0x000001, "Wrong size on Condition_SkillCast_C_ResetCondition");
static_assert(offsetof(Condition_SkillCast_C_ResetCondition, ReturnValue) == 0x000000, "Member 'Condition_SkillCast_C_ResetCondition::ReturnValue' has a wrong offset!");

// Function Condition_SkillCast.Condition_SkillCast_C.BindEventToSkillEmit
// 0x0008 (0x0008 - 0x0000)
struct Condition_SkillCast_C_BindEventToSkillEmit final
{
public:
	class UAbilityComponentBase*                  Ability_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_SkillCast_C_BindEventToSkillEmit) == 0x000008, "Wrong alignment on Condition_SkillCast_C_BindEventToSkillEmit");
static_assert(sizeof(Condition_SkillCast_C_BindEventToSkillEmit) == 0x000008, "Wrong size on Condition_SkillCast_C_BindEventToSkillEmit");
static_assert(offsetof(Condition_SkillCast_C_BindEventToSkillEmit, Ability_0) == 0x000000, "Member 'Condition_SkillCast_C_BindEventToSkillEmit::Ability_0' has a wrong offset!");

// Function Condition_SkillCast.Condition_SkillCast_C.SkillEmit
// 0x0020 (0x0020 - 0x0000)
struct Condition_SkillCast_C_SkillEmit final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OriginSkills;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UGameAbilityComponent*                  AbilityRef;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_SkillCast_C_SkillEmit) == 0x000008, "Wrong alignment on Condition_SkillCast_C_SkillEmit");
static_assert(sizeof(Condition_SkillCast_C_SkillEmit) == 0x000020, "Wrong size on Condition_SkillCast_C_SkillEmit");
static_assert(offsetof(Condition_SkillCast_C_SkillEmit, SkillID) == 0x000000, "Member 'Condition_SkillCast_C_SkillEmit::SkillID' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_SkillEmit, OriginSkills) == 0x000008, "Member 'Condition_SkillCast_C_SkillEmit::OriginSkills' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_SkillEmit, AbilityRef) == 0x000018, "Member 'Condition_SkillCast_C_SkillEmit::AbilityRef' has a wrong offset!");

// Function Condition_SkillCast.Condition_SkillCast_C.UnbindEventToSkillEmit
// 0x0008 (0x0008 - 0x0000)
struct Condition_SkillCast_C_UnbindEventToSkillEmit final
{
public:
	class UAbilityComponentBase*                  Ability_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_SkillCast_C_UnbindEventToSkillEmit) == 0x000008, "Wrong alignment on Condition_SkillCast_C_UnbindEventToSkillEmit");
static_assert(sizeof(Condition_SkillCast_C_UnbindEventToSkillEmit) == 0x000008, "Wrong size on Condition_SkillCast_C_UnbindEventToSkillEmit");
static_assert(offsetof(Condition_SkillCast_C_UnbindEventToSkillEmit, Ability_0) == 0x000000, "Member 'Condition_SkillCast_C_UnbindEventToSkillEmit::Ability_0' has a wrong offset!");

// Function Condition_SkillCast.Condition_SkillCast_C.OnFire
// 0x0010 (0x0010 - 0x0000)
struct Condition_SkillCast_C_OnFire final
{
public:
	uint8                                         ForceShootCount;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerWeapon*                          InCurWeapon;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_SkillCast_C_OnFire) == 0x000008, "Wrong alignment on Condition_SkillCast_C_OnFire");
static_assert(sizeof(Condition_SkillCast_C_OnFire) == 0x000010, "Wrong size on Condition_SkillCast_C_OnFire");
static_assert(offsetof(Condition_SkillCast_C_OnFire, ForceShootCount) == 0x000000, "Member 'Condition_SkillCast_C_OnFire::ForceShootCount' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_OnFire, InCurWeapon) == 0x000008, "Member 'Condition_SkillCast_C_OnFire::InCurWeapon' has a wrong offset!");

// Function Condition_SkillCast.Condition_SkillCast_C.K2_BindEvent
// 0x0010 (0x0010 - 0x0000)
struct Condition_SkillCast_C_K2_BindEvent final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_SkillCast_C_K2_BindEvent) == 0x000008, "Wrong alignment on Condition_SkillCast_C_K2_BindEvent");
static_assert(sizeof(Condition_SkillCast_C_K2_BindEvent) == 0x000010, "Wrong size on Condition_SkillCast_C_K2_BindEvent");
static_assert(offsetof(Condition_SkillCast_C_K2_BindEvent, InCurLauncher) == 0x000000, "Member 'Condition_SkillCast_C_K2_BindEvent::InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_K2_BindEvent, InCurLauncherChara) == 0x000008, "Member 'Condition_SkillCast_C_K2_BindEvent::InCurLauncherChara' has a wrong offset!");

// Function Condition_SkillCast.Condition_SkillCast_C.K2_UnbindEvent
// 0x0010 (0x0010 - 0x0000)
struct Condition_SkillCast_C_K2_UnbindEvent final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_SkillCast_C_K2_UnbindEvent) == 0x000008, "Wrong alignment on Condition_SkillCast_C_K2_UnbindEvent");
static_assert(sizeof(Condition_SkillCast_C_K2_UnbindEvent) == 0x000010, "Wrong size on Condition_SkillCast_C_K2_UnbindEvent");
static_assert(offsetof(Condition_SkillCast_C_K2_UnbindEvent, InCurLauncher) == 0x000000, "Member 'Condition_SkillCast_C_K2_UnbindEvent::InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_K2_UnbindEvent, InCurLauncherChara) == 0x000008, "Member 'Condition_SkillCast_C_K2_UnbindEvent::InCurLauncherChara' has a wrong offset!");

// Function Condition_SkillCast.Condition_SkillCast_C.ExecuteUbergraph_Condition_SkillCast
// 0x00D8 (0x00D8 - 0x0000)
struct Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_Event_InCurLauncher;                        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_InCurLauncherChara;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(uint8 ForceShootCount, class APlayerWeapon* InCurWeapon)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityComponentBase*                  K2Node_CustomEvent_Ability_1;                      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SkillID;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_CustomEvent_OriginSkills;                   // 0x0038(0x0010)(ConstParm, ReferenceParm)
	class UGameAbilityComponent*                  K2Node_CustomEvent_AbilityRef;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponentBase*                  K2Node_CustomEvent_Ability;                        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerWeapon*                          CallFunc_GetWeapon_ReturnValue;                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character_1;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerWeapon*                          CallFunc_GetWeapon_ReturnValue_1;                  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParamintValue_ReturnValue;             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetParamintValue_ReturnValue_1;           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         K2Node_CustomEvent_ForceShootCount;                // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerWeapon*                          K2Node_CustomEvent_InCurWeapon;                    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SkillID, TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetParamintValue_ReturnValue_2;           // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_Event_InCurLauncher_1;                      // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_InCurLauncherChara_1;                 // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast) == 0x000008, "Wrong alignment on Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast");
static_assert(sizeof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast) == 0x0000D8, "Wrong size on Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, EntryPoint) == 0x000000, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::EntryPoint' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, K2Node_Event_InCurLauncher) == 0x000008, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::K2Node_Event_InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, K2Node_Event_InCurLauncherChara) == 0x000010, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::K2Node_Event_InCurLauncherChara' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, K2Node_CustomEvent_Ability_1) == 0x000028, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::K2Node_CustomEvent_Ability_1' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, K2Node_CustomEvent_SkillID) == 0x000030, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::K2Node_CustomEvent_SkillID' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, K2Node_CustomEvent_OriginSkills) == 0x000038, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::K2Node_CustomEvent_OriginSkills' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, K2Node_CustomEvent_AbilityRef) == 0x000048, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::K2Node_CustomEvent_AbilityRef' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, CallFunc_GetOwner_ReturnValue) == 0x000050, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, K2Node_CustomEvent_Ability) == 0x000058, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::K2Node_CustomEvent_Ability' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, K2Node_DynamicCast_AsGame_Character) == 0x000060, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, CallFunc_GetOwner_ReturnValue_1) == 0x000070, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, CallFunc_GetWeapon_ReturnValue) == 0x000078, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, K2Node_DynamicCast_AsGame_Character_1) == 0x000080, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::K2Node_DynamicCast_AsGame_Character_1' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, CallFunc_GetWeapon_ReturnValue_1) == 0x000090, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::CallFunc_GetWeapon_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, CallFunc_GetParamintValue_ReturnValue) == 0x000098, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::CallFunc_GetParamintValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00009C, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, CallFunc_GetParamintValue_ReturnValue_1) == 0x0000A0, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::CallFunc_GetParamintValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000A4, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, K2Node_CustomEvent_ForceShootCount) == 0x0000A5, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::K2Node_CustomEvent_ForceShootCount' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, K2Node_CustomEvent_InCurWeapon) == 0x0000A8, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::K2Node_CustomEvent_InCurWeapon' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B0, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, CallFunc_GetParamintValue_ReturnValue_2) == 0x0000C0, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::CallFunc_GetParamintValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0000C4, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, K2Node_Event_InCurLauncher_1) == 0x0000C8, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::K2Node_Event_InCurLauncher_1' has a wrong offset!");
static_assert(offsetof(Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast, K2Node_Event_InCurLauncherChara_1) == 0x0000D0, "Member 'Condition_SkillCast_C_ExecuteUbergraph_Condition_SkillCast::K2Node_Event_InCurLauncherChara_1' has a wrong offset!");

}

