#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_PlayerBunkerState

#include "Basic.hpp"

#include "Game_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Condition_PlayerBunkerState.Condition_PlayerBunkerState_C
// 0x0030 (0x0138 - 0x0108)
class UCondition_PlayerBunkerState_C final : public UCastConditionCheck
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bin;                                               // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bInBunker;                                         // 0x0111(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BunkerType;                                        // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HalfType;                                          // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 EdgeType;                                          // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bInState;                                          // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void CheckBunkerLeader(class UAbilityComponentBase* InAbility, bool* InType);
	void CheckEdgeType(class AGamePlayer* InPlayer, bool* InType);
	void CheckBunkerType(class AGamePlayer* InPlayer, bool* InType);
	void CheckState(class UAbilityComponentBase* InAbility, bool* bCom);
	bool K2_CheckCondition(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void K2_InitCondition();
	void ExecuteUbergraph_Condition_PlayerBunkerState(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Condition_PlayerBunkerState_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Condition_PlayerBunkerState_C")
	}
	static class UCondition_PlayerBunkerState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCondition_PlayerBunkerState_C>();
	}
};
DUMPER7_ASSERTS_UCondition_PlayerBunkerState_C;

}

