#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_CharacterState

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Game_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Condition_CharacterState.Condition_CharacterState_C
// 0x0018 (0x0120 - 0x0108)
class UCondition_CharacterState_C final : public UCastConditionCheck
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsEnter;                                           // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ECharacterActionState                         PlayerAction;                                      // 0x0111(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMoveAction;                                      // 0x0112(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EGamePlayerMoveState                          MoveState;                                         // 0x0113(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastPos;                                           // 0x0114(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CheckShiftDistance();
	void InitEnterCheck();
	void K2_InitCondition();
	void BindEvent(class AGameCharacter* InCharacter);
	void UnbindEvent(class AGameCharacter* InCharacter);
	void OnNotifyPlayerAction(class AGameCharacter* CurCharacter, ECharacterActionState InType, bool bSet);
	void NotifyPlayerAction(class AGameCharacter* InCharacter, ECharacterActionState InType, bool bSet);
	void OnNotifyPlayerMove(class AGameCharacter* CurCharacter, EGamePlayerMoveState LastType, EGamePlayerMoveState CurType);
	void NotifyPlayerMove(class AGameCharacter* InCharacter, EGamePlayerMoveState LastType, EGamePlayerMoveState CurType);
	void K2_BindEvent(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void K2_UnbindEvent(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void ExecuteUbergraph_Condition_CharacterState(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Condition_CharacterState_C">();
	}
	static class UCondition_CharacterState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCondition_CharacterState_C>();
	}
};
static_assert(alignof(UCondition_CharacterState_C) == 0x000008, "Wrong alignment on UCondition_CharacterState_C");
static_assert(sizeof(UCondition_CharacterState_C) == 0x000120, "Wrong size on UCondition_CharacterState_C");
static_assert(offsetof(UCondition_CharacterState_C, UberGraphFrame) == 0x000108, "Member 'UCondition_CharacterState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCondition_CharacterState_C, IsEnter) == 0x000110, "Member 'UCondition_CharacterState_C::IsEnter' has a wrong offset!");
static_assert(offsetof(UCondition_CharacterState_C, PlayerAction) == 0x000111, "Member 'UCondition_CharacterState_C::PlayerAction' has a wrong offset!");
static_assert(offsetof(UCondition_CharacterState_C, IsMoveAction) == 0x000112, "Member 'UCondition_CharacterState_C::IsMoveAction' has a wrong offset!");
static_assert(offsetof(UCondition_CharacterState_C, MoveState) == 0x000113, "Member 'UCondition_CharacterState_C::MoveState' has a wrong offset!");
static_assert(offsetof(UCondition_CharacterState_C, LastPos) == 0x000114, "Member 'UCondition_CharacterState_C::LastPos' has a wrong offset!");

}

