#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_SkillKeepIdentifyNotify

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Condition_SkillKeepIdentifyNotify.Condition_SkillKeepIdentifyNotify_C
// 0x0018 (0x0120 - 0x0108)
class UCondition_SkillKeepIdentifyNotify_C final : public UCastConditionCheck
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   IndentifyName;                                     // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Type;                                              // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UnbindEvent();
	void OnNotifySkillKeepIdentify(class FName IdentifyName, bool bStartKeeping, bool bInterrupt);
	void K2_UnbindEvent(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void ExecuteUbergraph_Condition_SkillKeepIdentifyNotify(int32 EntryPoint);
	void K2_InitCondition();
	void BindEvent();
	void K2_BindEvent(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Condition_SkillKeepIdentifyNotify_C">();
	}
	static class UCondition_SkillKeepIdentifyNotify_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCondition_SkillKeepIdentifyNotify_C>();
	}
};
static_assert(alignof(UCondition_SkillKeepIdentifyNotify_C) == 0x000008, "Wrong alignment on UCondition_SkillKeepIdentifyNotify_C");
static_assert(sizeof(UCondition_SkillKeepIdentifyNotify_C) == 0x000120, "Wrong size on UCondition_SkillKeepIdentifyNotify_C");
static_assert(offsetof(UCondition_SkillKeepIdentifyNotify_C, UberGraphFrame) == 0x000108, "Member 'UCondition_SkillKeepIdentifyNotify_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCondition_SkillKeepIdentifyNotify_C, IndentifyName) == 0x000110, "Member 'UCondition_SkillKeepIdentifyNotify_C::IndentifyName' has a wrong offset!");
static_assert(offsetof(UCondition_SkillKeepIdentifyNotify_C, Type) == 0x000118, "Member 'UCondition_SkillKeepIdentifyNotify_C::Type' has a wrong offset!");

}

