#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_Probility

#include "Basic.hpp"


namespace SDK::Params
{

// Function Condition_Probility.Condition_Probility_C.K2_CheckCondition
// 0x0040 (0x0040 - 0x0000)
struct Condition_Probility_C_K2_CheckCondition final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  CallFunc_GetLauncherAbility_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAvailableSkill*                        CallFunc_K2_GetAvaliableSkillInfo_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValueStringForLevel_ReturnValue;  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_Probility_C_K2_CheckCondition) == 0x000008, "Wrong alignment on Condition_Probility_C_K2_CheckCondition");
static_assert(sizeof(Condition_Probility_C_K2_CheckCondition) == 0x000040, "Wrong size on Condition_Probility_C_K2_CheckCondition");
static_assert(offsetof(Condition_Probility_C_K2_CheckCondition, InCurLauncher) == 0x000000, "Member 'Condition_Probility_C_K2_CheckCondition::InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_Probility_C_K2_CheckCondition, InCurLauncherChara) == 0x000008, "Member 'Condition_Probility_C_K2_CheckCondition::InCurLauncherChara' has a wrong offset!");
static_assert(offsetof(Condition_Probility_C_K2_CheckCondition, ReturnValue) == 0x000010, "Member 'Condition_Probility_C_K2_CheckCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_Probility_C_K2_CheckCondition, CallFunc_GetLauncherAbility_ReturnValue) == 0x000018, "Member 'Condition_Probility_C_K2_CheckCondition::CallFunc_GetLauncherAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_Probility_C_K2_CheckCondition, CallFunc_RandomFloatInRange_ReturnValue) == 0x000020, "Member 'Condition_Probility_C_K2_CheckCondition::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_Probility_C_K2_CheckCondition, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'Condition_Probility_C_K2_CheckCondition::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_Probility_C_K2_CheckCondition, CallFunc_K2_GetAvaliableSkillInfo_ReturnValue) == 0x000028, "Member 'Condition_Probility_C_K2_CheckCondition::CallFunc_K2_GetAvaliableSkillInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_Probility_C_K2_CheckCondition, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'Condition_Probility_C_K2_CheckCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_Probility_C_K2_CheckCondition, CallFunc_GetFloatValueStringForLevel_ReturnValue) == 0x000034, "Member 'Condition_Probility_C_K2_CheckCondition::CallFunc_GetFloatValueStringForLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_Probility_C_K2_CheckCondition, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000038, "Member 'Condition_Probility_C_K2_CheckCondition::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

