#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_ModifierApply

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Condition_ModifierApply.Condition_ModifierApply_C
// 0x0028 (0x0130 - 0x0108)
class UCondition_ModifierApply_C final : public UCastConditionCheck
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         ModifierID;                                        // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ModifierTag;                                       // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bApply;                                            // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void K2_InitCondition();
	void BindEvent();
	void UnbindEvent();
	void OnAppliedModifierChange(int32 ModifierID_0, bool IsApply);
	void ApplyModifier(int32 InModifierID, bool IsApply);
	void K2_BindEvent(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void K2_UnbindEvent(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void ExecuteUbergraph_Condition_ModifierApply(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Condition_ModifierApply_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Condition_ModifierApply_C")
	}
	static class UCondition_ModifierApply_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCondition_ModifierApply_C>();
	}
};
DUMPER7_ASSERTS_UCondition_ModifierApply_C;

}

