#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_CheckCharacterAttribute

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Condition_CheckCharacterAttribute.Condition_CheckCharacterAttribute_C
// 0x0030 (0x0138 - 0x0108)
class UCondition_CheckCharacterAttribute_C final : public UCastConditionCheck
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bOnlySelf;                                         // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EModifyHPType>                         Attributes;                                        // 0x0118(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bOr;                                               // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bContainSelf;                                      // 0x0129(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x2];                                      // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count;                                             // 0x012C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Num;                                               // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool K2_CheckCondition(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void ExecuteUbergraph_Condition_CheckCharacterAttribute(int32 EntryPoint);
	void Check_Attribute(class AGamePlayer* InPlayer, bool* bCheck);
	void K2_InitCondition();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Condition_CheckCharacterAttribute_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Condition_CheckCharacterAttribute_C")
	}
	static class UCondition_CheckCharacterAttribute_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCondition_CheckCharacterAttribute_C>();
	}
};
DUMPER7_ASSERTS_UCondition_CheckCharacterAttribute_C;

}

