#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_ModifierExist

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function Condition_ModifierExist.Condition_ModifierExist_C.Check
// 0x0048 (0x0048 - 0x0000)
struct Condition_ModifierExist_C_Check final
{
public:
	class UAbilityComponentBase*                  InAbility;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FModifierExhibitionData>        CallFunc_FindModifierDataInfoByTagName_ReturnValue; // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsModifierDataInfoExist_ReturnValue;      // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  CallFunc_GetLauncherAbility_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsModifierExist_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsModifierExistByTagName_ReturnValue;     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_ModifierExist_C_Check) == 0x000008, "Wrong alignment on Condition_ModifierExist_C_Check");
static_assert(sizeof(Condition_ModifierExist_C_Check) == 0x000048, "Wrong size on Condition_ModifierExist_C_Check");
static_assert(offsetof(Condition_ModifierExist_C_Check, InAbility) == 0x000000, "Member 'Condition_ModifierExist_C_Check::InAbility' has a wrong offset!");
static_assert(offsetof(Condition_ModifierExist_C_Check, ReturnValue) == 0x000008, "Member 'Condition_ModifierExist_C_Check::ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_ModifierExist_C_Check, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'Condition_ModifierExist_C_Check::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_ModifierExist_C_Check, CallFunc_FindModifierDataInfoByTagName_ReturnValue) == 0x000010, "Member 'Condition_ModifierExist_C_Check::CallFunc_FindModifierDataInfoByTagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_ModifierExist_C_Check, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'Condition_ModifierExist_C_Check::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_ModifierExist_C_Check, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'Condition_ModifierExist_C_Check::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_ModifierExist_C_Check, CallFunc_Greater_IntInt_ReturnValue) == 0x000030, "Member 'Condition_ModifierExist_C_Check::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_ModifierExist_C_Check, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'Condition_ModifierExist_C_Check::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_ModifierExist_C_Check, CallFunc_HasAuthority_ReturnValue) == 0x000032, "Member 'Condition_ModifierExist_C_Check::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_ModifierExist_C_Check, CallFunc_IsModifierDataInfoExist_ReturnValue) == 0x000033, "Member 'Condition_ModifierExist_C_Check::CallFunc_IsModifierDataInfoExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_ModifierExist_C_Check, CallFunc_GetLauncherAbility_ReturnValue) == 0x000038, "Member 'Condition_ModifierExist_C_Check::CallFunc_GetLauncherAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_ModifierExist_C_Check, CallFunc_IsModifierExist_ReturnValue) == 0x000040, "Member 'Condition_ModifierExist_C_Check::CallFunc_IsModifierExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_ModifierExist_C_Check, CallFunc_IsModifierExistByTagName_ReturnValue) == 0x000041, "Member 'Condition_ModifierExist_C_Check::CallFunc_IsModifierExistByTagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_ModifierExist_C_Check, CallFunc_IsEmpty_ReturnValue) == 0x000042, "Member 'Condition_ModifierExist_C_Check::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");

// Function Condition_ModifierExist.Condition_ModifierExist_C.K2_CheckCondition
// 0x0018 (0x0018 - 0x0000)
struct Condition_ModifierExist_C_K2_CheckCondition final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Check_ReturnValue;                        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_ModifierExist_C_K2_CheckCondition) == 0x000008, "Wrong alignment on Condition_ModifierExist_C_K2_CheckCondition");
static_assert(sizeof(Condition_ModifierExist_C_K2_CheckCondition) == 0x000018, "Wrong size on Condition_ModifierExist_C_K2_CheckCondition");
static_assert(offsetof(Condition_ModifierExist_C_K2_CheckCondition, InCurLauncher) == 0x000000, "Member 'Condition_ModifierExist_C_K2_CheckCondition::InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_ModifierExist_C_K2_CheckCondition, InCurLauncherChara) == 0x000008, "Member 'Condition_ModifierExist_C_K2_CheckCondition::InCurLauncherChara' has a wrong offset!");
static_assert(offsetof(Condition_ModifierExist_C_K2_CheckCondition, ReturnValue) == 0x000010, "Member 'Condition_ModifierExist_C_K2_CheckCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_ModifierExist_C_K2_CheckCondition, CallFunc_Check_ReturnValue) == 0x000011, "Member 'Condition_ModifierExist_C_K2_CheckCondition::CallFunc_Check_ReturnValue' has a wrong offset!");

// Function Condition_ModifierExist.Condition_ModifierExist_C.ExecuteUbergraph_Condition_ModifierExist
// 0x0008 (0x0008 - 0x0000)
struct Condition_ModifierExist_C_ExecuteUbergraph_Condition_ModifierExist final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParamintValue_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_ModifierExist_C_ExecuteUbergraph_Condition_ModifierExist) == 0x000004, "Wrong alignment on Condition_ModifierExist_C_ExecuteUbergraph_Condition_ModifierExist");
static_assert(sizeof(Condition_ModifierExist_C_ExecuteUbergraph_Condition_ModifierExist) == 0x000008, "Wrong size on Condition_ModifierExist_C_ExecuteUbergraph_Condition_ModifierExist");
static_assert(offsetof(Condition_ModifierExist_C_ExecuteUbergraph_Condition_ModifierExist, EntryPoint) == 0x000000, "Member 'Condition_ModifierExist_C_ExecuteUbergraph_Condition_ModifierExist::EntryPoint' has a wrong offset!");
static_assert(offsetof(Condition_ModifierExist_C_ExecuteUbergraph_Condition_ModifierExist, CallFunc_GetParamintValue_ReturnValue) == 0x000004, "Member 'Condition_ModifierExist_C_ExecuteUbergraph_Condition_ModifierExist::CallFunc_GetParamintValue_ReturnValue' has a wrong offset!");

}

