#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_CheckViewDirection_F

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Condition_CheckViewDirection_F.Condition_CheckViewDirection_F_C
// 0x0010 (0x0118 - 0x0108)
class UCondition_CheckViewDirection_F_C final : public UCastConditionCheck
{
public:
	float                                         ForwardCoefficient;                                // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BackCoefficient;                                   // 0x010C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LeftCoefficient;                                   // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RightCoefficient;                                  // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateCoefficient(TArray<float>& Coefficients);
	bool K2_CheckCondition(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void CalcViewOffsetDirection(class AGameCharacter* Character, int32* Direction);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Condition_CheckViewDirection_F_C">();
	}
	static class UCondition_CheckViewDirection_F_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCondition_CheckViewDirection_F_C>();
	}
};
static_assert(alignof(UCondition_CheckViewDirection_F_C) == 0x000008, "Wrong alignment on UCondition_CheckViewDirection_F_C");
static_assert(sizeof(UCondition_CheckViewDirection_F_C) == 0x000118, "Wrong size on UCondition_CheckViewDirection_F_C");
static_assert(offsetof(UCondition_CheckViewDirection_F_C, ForwardCoefficient) == 0x000108, "Member 'UCondition_CheckViewDirection_F_C::ForwardCoefficient' has a wrong offset!");
static_assert(offsetof(UCondition_CheckViewDirection_F_C, BackCoefficient) == 0x00010C, "Member 'UCondition_CheckViewDirection_F_C::BackCoefficient' has a wrong offset!");
static_assert(offsetof(UCondition_CheckViewDirection_F_C, LeftCoefficient) == 0x000110, "Member 'UCondition_CheckViewDirection_F_C::LeftCoefficient' has a wrong offset!");
static_assert(offsetof(UCondition_CheckViewDirection_F_C, RightCoefficient) == 0x000114, "Member 'UCondition_CheckViewDirection_F_C::RightCoefficient' has a wrong offset!");

}

