#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_PlayerBunkerState

#include "Basic.hpp"


namespace SDK::Params
{

// Function Condition_PlayerBunkerState.Condition_PlayerBunkerState_C.CheckBunkerLeader
// 0x0010 (0x0010 - 0x0000)
struct Condition_PlayerBunkerState_C_CheckBunkerLeader final
{
public:
	class UAbilityComponentBase*                  InAbility;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InType;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInState_ReturnValue;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_PlayerBunkerState_C_CheckBunkerLeader) == 0x000008, "Wrong alignment on Condition_PlayerBunkerState_C_CheckBunkerLeader");
static_assert(sizeof(Condition_PlayerBunkerState_C_CheckBunkerLeader) == 0x000010, "Wrong size on Condition_PlayerBunkerState_C_CheckBunkerLeader");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckBunkerLeader, InAbility) == 0x000000, "Member 'Condition_PlayerBunkerState_C_CheckBunkerLeader::InAbility' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckBunkerLeader, InType) == 0x000008, "Member 'Condition_PlayerBunkerState_C_CheckBunkerLeader::InType' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckBunkerLeader, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'Condition_PlayerBunkerState_C_CheckBunkerLeader::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckBunkerLeader, K2Node_SwitchInteger_CmpSuccess) == 0x00000A, "Member 'Condition_PlayerBunkerState_C_CheckBunkerLeader::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckBunkerLeader, CallFunc_IsInState_ReturnValue) == 0x00000B, "Member 'Condition_PlayerBunkerState_C_CheckBunkerLeader::CallFunc_IsInState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckBunkerLeader, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'Condition_PlayerBunkerState_C_CheckBunkerLeader::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function Condition_PlayerBunkerState.Condition_PlayerBunkerState_C.CheckEdgeType
// 0x0010 (0x0010 - 0x0000)
struct Condition_PlayerBunkerState_C_CheckEdgeType final
{
public:
	class AGamePlayer*                            InPlayer;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InType;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsReachRightPeak_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsReachLeftPeak_ReturnValue;           // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_2;                   // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_PlayerBunkerState_C_CheckEdgeType) == 0x000008, "Wrong alignment on Condition_PlayerBunkerState_C_CheckEdgeType");
static_assert(sizeof(Condition_PlayerBunkerState_C_CheckEdgeType) == 0x000010, "Wrong size on Condition_PlayerBunkerState_C_CheckEdgeType");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckEdgeType, InPlayer) == 0x000000, "Member 'Condition_PlayerBunkerState_C_CheckEdgeType::InPlayer' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckEdgeType, InType) == 0x000008, "Member 'Condition_PlayerBunkerState_C_CheckEdgeType::InType' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckEdgeType, CallFunc_GetIsReachRightPeak_ReturnValue) == 0x000009, "Member 'Condition_PlayerBunkerState_C_CheckEdgeType::CallFunc_GetIsReachRightPeak_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckEdgeType, CallFunc_GetIsReachLeftPeak_ReturnValue) == 0x00000A, "Member 'Condition_PlayerBunkerState_C_CheckEdgeType::CallFunc_GetIsReachLeftPeak_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckEdgeType, CallFunc_IsValid_ReturnValue) == 0x00000B, "Member 'Condition_PlayerBunkerState_C_CheckEdgeType::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckEdgeType, CallFunc_IsEmpty_ReturnValue) == 0x00000C, "Member 'Condition_PlayerBunkerState_C_CheckEdgeType::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckEdgeType, CallFunc_Contains_ReturnValue) == 0x00000D, "Member 'Condition_PlayerBunkerState_C_CheckEdgeType::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckEdgeType, CallFunc_Contains_ReturnValue_1) == 0x00000E, "Member 'Condition_PlayerBunkerState_C_CheckEdgeType::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckEdgeType, CallFunc_Contains_ReturnValue_2) == 0x00000F, "Member 'Condition_PlayerBunkerState_C_CheckEdgeType::CallFunc_Contains_ReturnValue_2' has a wrong offset!");

// Function Condition_PlayerBunkerState.Condition_PlayerBunkerState_C.CheckBunkerType
// 0x0010 (0x0010 - 0x0000)
struct Condition_PlayerBunkerState_C_CheckBunkerType final
{
public:
	class AGamePlayer*                            InPlayer;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InType;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsHalfBunker_ReturnValue;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsHalfBunker_ReturnValue_1;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_PlayerBunkerState_C_CheckBunkerType) == 0x000008, "Wrong alignment on Condition_PlayerBunkerState_C_CheckBunkerType");
static_assert(sizeof(Condition_PlayerBunkerState_C_CheckBunkerType) == 0x000010, "Wrong size on Condition_PlayerBunkerState_C_CheckBunkerType");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckBunkerType, InPlayer) == 0x000000, "Member 'Condition_PlayerBunkerState_C_CheckBunkerType::InPlayer' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckBunkerType, InType) == 0x000008, "Member 'Condition_PlayerBunkerState_C_CheckBunkerType::InType' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckBunkerType, CallFunc_GetIsHalfBunker_ReturnValue) == 0x000009, "Member 'Condition_PlayerBunkerState_C_CheckBunkerType::CallFunc_GetIsHalfBunker_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckBunkerType, CallFunc_GetIsHalfBunker_ReturnValue_1) == 0x00000A, "Member 'Condition_PlayerBunkerState_C_CheckBunkerType::CallFunc_GetIsHalfBunker_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckBunkerType, CallFunc_Not_PreBool_ReturnValue) == 0x00000B, "Member 'Condition_PlayerBunkerState_C_CheckBunkerType::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckBunkerType, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'Condition_PlayerBunkerState_C_CheckBunkerType::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckBunkerType, K2Node_SwitchInteger_CmpSuccess) == 0x00000D, "Member 'Condition_PlayerBunkerState_C_CheckBunkerType::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function Condition_PlayerBunkerState.Condition_PlayerBunkerState_C.CheckState
// 0x0038 (0x0038 - 0x0000)
struct Condition_PlayerBunkerState_C_CheckState final
{
public:
	class UAbilityComponentBase*                  InAbility;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCom;                                              // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckBunkerLeader_InType;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetOriginCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEdgeType_InType;                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckBunkerType_InType;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCharacterActionState_ReturnValue;    // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_PlayerBunkerState_C_CheckState) == 0x000008, "Wrong alignment on Condition_PlayerBunkerState_C_CheckState");
static_assert(sizeof(Condition_PlayerBunkerState_C_CheckState) == 0x000038, "Wrong size on Condition_PlayerBunkerState_C_CheckState");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckState, InAbility) == 0x000000, "Member 'Condition_PlayerBunkerState_C_CheckState::InAbility' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckState, bCom) == 0x000008, "Member 'Condition_PlayerBunkerState_C_CheckState::bCom' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckState, CallFunc_CheckBunkerLeader_InType) == 0x000009, "Member 'Condition_PlayerBunkerState_C_CheckState::CallFunc_CheckBunkerLeader_InType' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckState, CallFunc_Not_PreBool_ReturnValue) == 0x00000A, "Member 'Condition_PlayerBunkerState_C_CheckState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckState, CallFunc_GetOriginCharacter_ReturnValue) == 0x000010, "Member 'Condition_PlayerBunkerState_C_CheckState::CallFunc_GetOriginCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckState, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'Condition_PlayerBunkerState_C_CheckState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckState, K2Node_DynamicCast_AsGame_Player) == 0x000020, "Member 'Condition_PlayerBunkerState_C_CheckState::K2Node_DynamicCast_AsGame_Player' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckState, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Condition_PlayerBunkerState_C_CheckState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckState, CallFunc_CheckEdgeType_InType) == 0x000029, "Member 'Condition_PlayerBunkerState_C_CheckState::CallFunc_CheckEdgeType_InType' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckState, CallFunc_CheckBunkerType_InType) == 0x00002A, "Member 'Condition_PlayerBunkerState_C_CheckState::CallFunc_CheckBunkerType_InType' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckState, CallFunc_CheckCharacterActionState_ReturnValue) == 0x00002B, "Member 'Condition_PlayerBunkerState_C_CheckState::CallFunc_CheckCharacterActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckState, CallFunc_BooleanAND_ReturnValue) == 0x00002C, "Member 'Condition_PlayerBunkerState_C_CheckState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckState, CallFunc_BooleanAND_ReturnValue_1) == 0x00002D, "Member 'Condition_PlayerBunkerState_C_CheckState::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckState, CallFunc_BooleanAND_ReturnValue_2) == 0x00002E, "Member 'Condition_PlayerBunkerState_C_CheckState::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckState, CallFunc_Not_PreBool_ReturnValue_1) == 0x00002F, "Member 'Condition_PlayerBunkerState_C_CheckState::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_CheckState, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000030, "Member 'Condition_PlayerBunkerState_C_CheckState::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function Condition_PlayerBunkerState.Condition_PlayerBunkerState_C.K2_CheckCondition
// 0x0028 (0x0028 - 0x0000)
struct Condition_PlayerBunkerState_C_K2_CheckCondition final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  CallFunc_GetLauncherAbility_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckState_bCom;                          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_PlayerBunkerState_C_K2_CheckCondition) == 0x000008, "Wrong alignment on Condition_PlayerBunkerState_C_K2_CheckCondition");
static_assert(sizeof(Condition_PlayerBunkerState_C_K2_CheckCondition) == 0x000028, "Wrong size on Condition_PlayerBunkerState_C_K2_CheckCondition");
static_assert(offsetof(Condition_PlayerBunkerState_C_K2_CheckCondition, InCurLauncher) == 0x000000, "Member 'Condition_PlayerBunkerState_C_K2_CheckCondition::InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_K2_CheckCondition, InCurLauncherChara) == 0x000008, "Member 'Condition_PlayerBunkerState_C_K2_CheckCondition::InCurLauncherChara' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_K2_CheckCondition, ReturnValue) == 0x000010, "Member 'Condition_PlayerBunkerState_C_K2_CheckCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_K2_CheckCondition, CallFunc_GetLauncherAbility_ReturnValue) == 0x000018, "Member 'Condition_PlayerBunkerState_C_K2_CheckCondition::CallFunc_GetLauncherAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_K2_CheckCondition, CallFunc_CheckState_bCom) == 0x000020, "Member 'Condition_PlayerBunkerState_C_K2_CheckCondition::CallFunc_CheckState_bCom' has a wrong offset!");

// Function Condition_PlayerBunkerState.Condition_PlayerBunkerState_C.ExecuteUbergraph_Condition_PlayerBunkerState
// 0x0008 (0x0008 - 0x0000)
struct Condition_PlayerBunkerState_C_ExecuteUbergraph_Condition_PlayerBunkerState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess_1;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess_2;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess_3;                  // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_PlayerBunkerState_C_ExecuteUbergraph_Condition_PlayerBunkerState) == 0x000004, "Wrong alignment on Condition_PlayerBunkerState_C_ExecuteUbergraph_Condition_PlayerBunkerState");
static_assert(sizeof(Condition_PlayerBunkerState_C_ExecuteUbergraph_Condition_PlayerBunkerState) == 0x000008, "Wrong size on Condition_PlayerBunkerState_C_ExecuteUbergraph_Condition_PlayerBunkerState");
static_assert(offsetof(Condition_PlayerBunkerState_C_ExecuteUbergraph_Condition_PlayerBunkerState, EntryPoint) == 0x000000, "Member 'Condition_PlayerBunkerState_C_ExecuteUbergraph_Condition_PlayerBunkerState::EntryPoint' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_ExecuteUbergraph_Condition_PlayerBunkerState, K2Node_SwitchString_CmpSuccess) == 0x000004, "Member 'Condition_PlayerBunkerState_C_ExecuteUbergraph_Condition_PlayerBunkerState::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_ExecuteUbergraph_Condition_PlayerBunkerState, K2Node_SwitchString_CmpSuccess_1) == 0x000005, "Member 'Condition_PlayerBunkerState_C_ExecuteUbergraph_Condition_PlayerBunkerState::K2Node_SwitchString_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_ExecuteUbergraph_Condition_PlayerBunkerState, K2Node_SwitchString_CmpSuccess_2) == 0x000006, "Member 'Condition_PlayerBunkerState_C_ExecuteUbergraph_Condition_PlayerBunkerState::K2Node_SwitchString_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(Condition_PlayerBunkerState_C_ExecuteUbergraph_Condition_PlayerBunkerState, K2Node_SwitchString_CmpSuccess_3) == 0x000007, "Member 'Condition_PlayerBunkerState_C_ExecuteUbergraph_Condition_PlayerBunkerState::K2Node_SwitchString_CmpSuccess_3' has a wrong offset!");

}

