#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_ModifierApply

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Condition_ModifierApply.Condition_ModifierApply_C
// 0x0028 (0x0130 - 0x0108)
class UCondition_ModifierApply_C final : public UCastConditionCheck
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         ModifierID;                                        // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ModifierTag;                                       // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bApply;                                            // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void K2_InitCondition();
	void BindEvent();
	void UnbindEvent();
	void OnAppliedModifierChange(int32 ModifierID_0, bool IsApply);
	void ApplyModifier(int32 InModifierID, bool IsApply);
	void K2_BindEvent(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void K2_UnbindEvent(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void ExecuteUbergraph_Condition_ModifierApply(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Condition_ModifierApply_C">();
	}
	static class UCondition_ModifierApply_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCondition_ModifierApply_C>();
	}
};
static_assert(alignof(UCondition_ModifierApply_C) == 0x000008, "Wrong alignment on UCondition_ModifierApply_C");
static_assert(sizeof(UCondition_ModifierApply_C) == 0x000130, "Wrong size on UCondition_ModifierApply_C");
static_assert(offsetof(UCondition_ModifierApply_C, UberGraphFrame) == 0x000108, "Member 'UCondition_ModifierApply_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCondition_ModifierApply_C, ModifierID) == 0x000110, "Member 'UCondition_ModifierApply_C::ModifierID' has a wrong offset!");
static_assert(offsetof(UCondition_ModifierApply_C, ModifierTag) == 0x000118, "Member 'UCondition_ModifierApply_C::ModifierTag' has a wrong offset!");
static_assert(offsetof(UCondition_ModifierApply_C, bApply) == 0x000128, "Member 'UCondition_ModifierApply_C::bApply' has a wrong offset!");

}

