#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_CheckLauncherModifierOverlaidNum

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Game_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Condition_CheckLauncherModifierOverlaidNum.Condition_CheckLauncherModifierOverlaidNum_C
// 0x0038 (0x0140 - 0x0108)
class UCondition_CheckLauncherModifierOverlaidNum_C final : public UCastConditionCheck
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FValueRangeInfo>                ValueRange;                                        // 0x0110(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         ModifierID;                                        // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OverlaidNum;                                       // 0x0124(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Type;                                              // 0x0128(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bCreateAddModifer;                                 // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void CheckOverlaidRange(class UModifier* InModifier, bool* InRange);
	bool K2_CheckCondition(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void K2_InitCondition();
	void ExecuteUbergraph_Condition_CheckLauncherModifierOverlaidNum(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Condition_CheckLauncherModifierOverlaidNum_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Condition_CheckLauncherModifierOverlaidNum_C")
	}
	static class UCondition_CheckLauncherModifierOverlaidNum_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCondition_CheckLauncherModifierOverlaidNum_C>();
	}
};
DUMPER7_ASSERTS_UCondition_CheckLauncherModifierOverlaidNum_C;

}

