#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_CaptainBirthed

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function Condition_CaptainBirthed.Condition_CaptainBirthed_C.K2_CheckCondition
// 0x0040 (0x0040 - 0x0000)
struct Condition_CaptainBirthed_C_K2_CheckCondition final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetLauncherOriginCharacter_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayerController*                  CallFunc_GetCharacterController_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetCurrentChar_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCharacterActionState_ReturnValue;    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_CaptainBirthed_C_K2_CheckCondition) == 0x000008, "Wrong alignment on Condition_CaptainBirthed_C_K2_CheckCondition");
static_assert(sizeof(Condition_CaptainBirthed_C_K2_CheckCondition) == 0x000040, "Wrong size on Condition_CaptainBirthed_C_K2_CheckCondition");
static_assert(offsetof(Condition_CaptainBirthed_C_K2_CheckCondition, InCurLauncher) == 0x000000, "Member 'Condition_CaptainBirthed_C_K2_CheckCondition::InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_K2_CheckCondition, InCurLauncherChara) == 0x000008, "Member 'Condition_CaptainBirthed_C_K2_CheckCondition::InCurLauncherChara' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_K2_CheckCondition, ReturnValue) == 0x000010, "Member 'Condition_CaptainBirthed_C_K2_CheckCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_K2_CheckCondition, CallFunc_GetLauncherOriginCharacter_ReturnValue) == 0x000018, "Member 'Condition_CaptainBirthed_C_K2_CheckCondition::CallFunc_GetLauncherOriginCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_K2_CheckCondition, CallFunc_GetCharacterController_ReturnValue) == 0x000020, "Member 'Condition_CaptainBirthed_C_K2_CheckCondition::CallFunc_GetCharacterController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_K2_CheckCondition, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'Condition_CaptainBirthed_C_K2_CheckCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_K2_CheckCondition, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'Condition_CaptainBirthed_C_K2_CheckCondition::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_K2_CheckCondition, CallFunc_GetCurrentChar_ReturnValue) == 0x000030, "Member 'Condition_CaptainBirthed_C_K2_CheckCondition::CallFunc_GetCurrentChar_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_K2_CheckCondition, CallFunc_CheckCharacterActionState_ReturnValue) == 0x000038, "Member 'Condition_CaptainBirthed_C_K2_CheckCondition::CallFunc_CheckCharacterActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_K2_CheckCondition, CallFunc_IsValid_ReturnValue_2) == 0x000039, "Member 'Condition_CaptainBirthed_C_K2_CheckCondition::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_K2_CheckCondition, CallFunc_Not_PreBool_ReturnValue) == 0x00003A, "Member 'Condition_CaptainBirthed_C_K2_CheckCondition::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function Condition_CaptainBirthed.Condition_CaptainBirthed_C.CustomEvent
// 0x0010 (0x0010 - 0x0000)
struct Condition_CaptainBirthed_C_CustomEvent final
{
public:
	class AGameCharacter*                         CurCharacter;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterActionState                         InType;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSet;                                              // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_CaptainBirthed_C_CustomEvent) == 0x000008, "Wrong alignment on Condition_CaptainBirthed_C_CustomEvent");
static_assert(sizeof(Condition_CaptainBirthed_C_CustomEvent) == 0x000010, "Wrong size on Condition_CaptainBirthed_C_CustomEvent");
static_assert(offsetof(Condition_CaptainBirthed_C_CustomEvent, CurCharacter) == 0x000000, "Member 'Condition_CaptainBirthed_C_CustomEvent::CurCharacter' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_CustomEvent, InType) == 0x000008, "Member 'Condition_CaptainBirthed_C_CustomEvent::InType' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_CustomEvent, bSet) == 0x000009, "Member 'Condition_CaptainBirthed_C_CustomEvent::bSet' has a wrong offset!");

// Function Condition_CaptainBirthed.Condition_CaptainBirthed_C.K2_BindEvent
// 0x0010 (0x0010 - 0x0000)
struct Condition_CaptainBirthed_C_K2_BindEvent final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_CaptainBirthed_C_K2_BindEvent) == 0x000008, "Wrong alignment on Condition_CaptainBirthed_C_K2_BindEvent");
static_assert(sizeof(Condition_CaptainBirthed_C_K2_BindEvent) == 0x000010, "Wrong size on Condition_CaptainBirthed_C_K2_BindEvent");
static_assert(offsetof(Condition_CaptainBirthed_C_K2_BindEvent, InCurLauncher) == 0x000000, "Member 'Condition_CaptainBirthed_C_K2_BindEvent::InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_K2_BindEvent, InCurLauncherChara) == 0x000008, "Member 'Condition_CaptainBirthed_C_K2_BindEvent::InCurLauncherChara' has a wrong offset!");

// Function Condition_CaptainBirthed.Condition_CaptainBirthed_C.K2_UnbindEvent
// 0x0010 (0x0010 - 0x0000)
struct Condition_CaptainBirthed_C_K2_UnbindEvent final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_CaptainBirthed_C_K2_UnbindEvent) == 0x000008, "Wrong alignment on Condition_CaptainBirthed_C_K2_UnbindEvent");
static_assert(sizeof(Condition_CaptainBirthed_C_K2_UnbindEvent) == 0x000010, "Wrong size on Condition_CaptainBirthed_C_K2_UnbindEvent");
static_assert(offsetof(Condition_CaptainBirthed_C_K2_UnbindEvent, InCurLauncher) == 0x000000, "Member 'Condition_CaptainBirthed_C_K2_UnbindEvent::InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_K2_UnbindEvent, InCurLauncherChara) == 0x000008, "Member 'Condition_CaptainBirthed_C_K2_UnbindEvent::InCurLauncherChara' has a wrong offset!");

// Function Condition_CaptainBirthed.Condition_CaptainBirthed_C.ExecuteUbergraph_Condition_CaptainBirthed
// 0x0090 (0x0090 - 0x0000)
struct Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetLauncherOriginCharacter_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AGameCharacter* CurCharacter, ECharacterActionState InType, bool bSet)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayerController*                  CallFunc_GetCharacterController_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         CallFunc_GetLauncherOriginCharacter_ReturnValue_1; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayerController*                  CallFunc_GetCharacterController_ReturnValue_1;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         CallFunc_GetCurrentChar_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetCurrentChar_ReturnValue_1;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_CustomEvent_CurCharacter;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterActionState                         K2Node_CustomEvent_InType;                         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSet;                           // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_Event_InCurLauncher_1;                      // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_InCurLauncherChara_1;                 // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponentBase*                  K2Node_Event_InCurLauncher;                        // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_InCurLauncherChara;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed) == 0x000008, "Wrong alignment on Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed");
static_assert(sizeof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed) == 0x000090, "Wrong size on Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed");
static_assert(offsetof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed, EntryPoint) == 0x000000, "Member 'Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed::EntryPoint' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed, CallFunc_GetLauncherOriginCharacter_ReturnValue) == 0x000008, "Member 'Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed::CallFunc_GetLauncherOriginCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed, CallFunc_GetCharacterController_ReturnValue) == 0x000028, "Member 'Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed::CallFunc_GetCharacterController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed, CallFunc_GetLauncherOriginCharacter_ReturnValue_1) == 0x000030, "Member 'Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed::CallFunc_GetLauncherOriginCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed, CallFunc_IsValid_ReturnValue_2) == 0x000039, "Member 'Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed, CallFunc_GetCharacterController_ReturnValue_1) == 0x000040, "Member 'Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed::CallFunc_GetCharacterController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed, CallFunc_GetCurrentChar_ReturnValue) == 0x000048, "Member 'Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed::CallFunc_GetCurrentChar_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed, CallFunc_IsValid_ReturnValue_3) == 0x000050, "Member 'Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed, CallFunc_IsValid_ReturnValue_4) == 0x000051, "Member 'Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed, CallFunc_GetCurrentChar_ReturnValue_1) == 0x000058, "Member 'Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed::CallFunc_GetCurrentChar_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed, K2Node_CustomEvent_CurCharacter) == 0x000060, "Member 'Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed::K2Node_CustomEvent_CurCharacter' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed, K2Node_CustomEvent_InType) == 0x000068, "Member 'Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed::K2Node_CustomEvent_InType' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed, K2Node_CustomEvent_bSet) == 0x000069, "Member 'Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed::K2Node_CustomEvent_bSet' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed, CallFunc_IsValid_ReturnValue_5) == 0x00006A, "Member 'Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x00006B, "Member 'Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00006C, "Member 'Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed, CallFunc_BooleanAND_ReturnValue) == 0x00006D, "Member 'Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed, K2Node_Event_InCurLauncher_1) == 0x000070, "Member 'Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed::K2Node_Event_InCurLauncher_1' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed, K2Node_Event_InCurLauncherChara_1) == 0x000078, "Member 'Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed::K2Node_Event_InCurLauncherChara_1' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed, K2Node_Event_InCurLauncher) == 0x000080, "Member 'Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed::K2Node_Event_InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed, K2Node_Event_InCurLauncherChara) == 0x000088, "Member 'Condition_CaptainBirthed_C_ExecuteUbergraph_Condition_CaptainBirthed::K2Node_Event_InCurLauncherChara' has a wrong offset!");

}

