#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_CharacterEnergyLessThan

#include "Basic.hpp"


namespace SDK::Params
{

// Function Condition_CharacterEnergyLessThan.Condition_CharacterEnergyLessThan_C.GetLauncher
// 0x0068 (0x0068 - 0x0000)
struct Condition_CharacterEnergyLessThan_C_GetLauncher final
{
public:
	class AGameCharacter*                         GameCharacter;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         TempLauncher;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ___object_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         CallFunc_GetLauncherOriginCharacter_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_DynamicCast_AsAbility_Component_Base;       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAbilityCharacterInterface> K2Node_DynamicCast_AsAbility_Character_Interface;  // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Condition_CharacterEnergyLessThan_C_GetLauncher) == 0x000008, "Wrong alignment on Condition_CharacterEnergyLessThan_C_GetLauncher");
static_assert(sizeof(Condition_CharacterEnergyLessThan_C_GetLauncher) == 0x000068, "Wrong size on Condition_CharacterEnergyLessThan_C_GetLauncher");
static_assert(offsetof(Condition_CharacterEnergyLessThan_C_GetLauncher, GameCharacter) == 0x000000, "Member 'Condition_CharacterEnergyLessThan_C_GetLauncher::GameCharacter' has a wrong offset!");
static_assert(offsetof(Condition_CharacterEnergyLessThan_C_GetLauncher, TempLauncher) == 0x000008, "Member 'Condition_CharacterEnergyLessThan_C_GetLauncher::TempLauncher' has a wrong offset!");
static_assert(offsetof(Condition_CharacterEnergyLessThan_C_GetLauncher, ___object_Variable) == 0x000010, "Member 'Condition_CharacterEnergyLessThan_C_GetLauncher::___object_Variable' has a wrong offset!");
static_assert(offsetof(Condition_CharacterEnergyLessThan_C_GetLauncher, CallFunc_GetLauncherOriginCharacter_ReturnValue) == 0x000018, "Member 'Condition_CharacterEnergyLessThan_C_GetLauncher::CallFunc_GetLauncherOriginCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CharacterEnergyLessThan_C_GetLauncher, K2Node_DynamicCast_AsGame_Character) == 0x000020, "Member 'Condition_CharacterEnergyLessThan_C_GetLauncher::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(Condition_CharacterEnergyLessThan_C_GetLauncher, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Condition_CharacterEnergyLessThan_C_GetLauncher::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Condition_CharacterEnergyLessThan_C_GetLauncher, K2Node_DynamicCast_AsAbility_Component_Base) == 0x000030, "Member 'Condition_CharacterEnergyLessThan_C_GetLauncher::K2Node_DynamicCast_AsAbility_Component_Base' has a wrong offset!");
static_assert(offsetof(Condition_CharacterEnergyLessThan_C_GetLauncher, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'Condition_CharacterEnergyLessThan_C_GetLauncher::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Condition_CharacterEnergyLessThan_C_GetLauncher, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'Condition_CharacterEnergyLessThan_C_GetLauncher::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CharacterEnergyLessThan_C_GetLauncher, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'Condition_CharacterEnergyLessThan_C_GetLauncher::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CharacterEnergyLessThan_C_GetLauncher, K2Node_DynamicCast_AsAbility_Character_Interface) == 0x000048, "Member 'Condition_CharacterEnergyLessThan_C_GetLauncher::K2Node_DynamicCast_AsAbility_Character_Interface' has a wrong offset!");
static_assert(offsetof(Condition_CharacterEnergyLessThan_C_GetLauncher, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'Condition_CharacterEnergyLessThan_C_GetLauncher::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Condition_CharacterEnergyLessThan_C_GetLauncher, CallFunc_GetOwnerActor_ReturnValue) == 0x000060, "Member 'Condition_CharacterEnergyLessThan_C_GetLauncher::CallFunc_GetOwnerActor_ReturnValue' has a wrong offset!");

// Function Condition_CharacterEnergyLessThan.Condition_CharacterEnergyLessThan_C.K2_CheckCondition
// 0x0040 (0x0040 - 0x0000)
struct Condition_CharacterEnergyLessThan_C_K2_CheckCondition final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         TempLauncher;                                      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         CallFunc_GetLauncher_GameCharacter;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTeamAbilityComponent*                  CallFunc_GetTeamAbilityComponent_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRolePropertieValue_ReturnValue;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParamfloatValue_ReturnValue;           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_CharacterEnergyLessThan_C_K2_CheckCondition) == 0x000008, "Wrong alignment on Condition_CharacterEnergyLessThan_C_K2_CheckCondition");
static_assert(sizeof(Condition_CharacterEnergyLessThan_C_K2_CheckCondition) == 0x000040, "Wrong size on Condition_CharacterEnergyLessThan_C_K2_CheckCondition");
static_assert(offsetof(Condition_CharacterEnergyLessThan_C_K2_CheckCondition, InCurLauncher) == 0x000000, "Member 'Condition_CharacterEnergyLessThan_C_K2_CheckCondition::InCurLauncher' has a wrong offset!");
static_assert(offsetof(Condition_CharacterEnergyLessThan_C_K2_CheckCondition, InCurLauncherChara) == 0x000008, "Member 'Condition_CharacterEnergyLessThan_C_K2_CheckCondition::InCurLauncherChara' has a wrong offset!");
static_assert(offsetof(Condition_CharacterEnergyLessThan_C_K2_CheckCondition, ReturnValue) == 0x000010, "Member 'Condition_CharacterEnergyLessThan_C_K2_CheckCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CharacterEnergyLessThan_C_K2_CheckCondition, TempLauncher) == 0x000018, "Member 'Condition_CharacterEnergyLessThan_C_K2_CheckCondition::TempLauncher' has a wrong offset!");
static_assert(offsetof(Condition_CharacterEnergyLessThan_C_K2_CheckCondition, CallFunc_GetLauncher_GameCharacter) == 0x000020, "Member 'Condition_CharacterEnergyLessThan_C_K2_CheckCondition::CallFunc_GetLauncher_GameCharacter' has a wrong offset!");
static_assert(offsetof(Condition_CharacterEnergyLessThan_C_K2_CheckCondition, CallFunc_GetTeamAbilityComponent_ReturnValue) == 0x000028, "Member 'Condition_CharacterEnergyLessThan_C_K2_CheckCondition::CallFunc_GetTeamAbilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CharacterEnergyLessThan_C_K2_CheckCondition, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'Condition_CharacterEnergyLessThan_C_K2_CheckCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CharacterEnergyLessThan_C_K2_CheckCondition, CallFunc_GetRolePropertieValue_ReturnValue) == 0x000034, "Member 'Condition_CharacterEnergyLessThan_C_K2_CheckCondition::CallFunc_GetRolePropertieValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CharacterEnergyLessThan_C_K2_CheckCondition, CallFunc_GetParamfloatValue_ReturnValue) == 0x000038, "Member 'Condition_CharacterEnergyLessThan_C_K2_CheckCondition::CallFunc_GetParamfloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_CharacterEnergyLessThan_C_K2_CheckCondition, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00003C, "Member 'Condition_CharacterEnergyLessThan_C_K2_CheckCondition::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

