#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_CheckLauncherModifierOverlaidNum

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Condition_CheckLauncherModifierOverlaidNum.Condition_CheckLauncherModifierOverlaidNum_C
// 0x0038 (0x0140 - 0x0108)
class UCondition_CheckLauncherModifierOverlaidNum_C final : public UCastConditionCheck
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FValueRangeInfo>                ValueRange;                                        // 0x0110(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         ModifierID;                                        // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OverlaidNum;                                       // 0x0124(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Type;                                              // 0x0128(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bCreateAddModifer;                                 // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void CheckOverlaidRange(class UModifier* InModifier, bool* InRange);
	bool K2_CheckCondition(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void K2_InitCondition();
	void ExecuteUbergraph_Condition_CheckLauncherModifierOverlaidNum(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Condition_CheckLauncherModifierOverlaidNum_C">();
	}
	static class UCondition_CheckLauncherModifierOverlaidNum_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCondition_CheckLauncherModifierOverlaidNum_C>();
	}
};
static_assert(alignof(UCondition_CheckLauncherModifierOverlaidNum_C) == 0x000008, "Wrong alignment on UCondition_CheckLauncherModifierOverlaidNum_C");
static_assert(sizeof(UCondition_CheckLauncherModifierOverlaidNum_C) == 0x000140, "Wrong size on UCondition_CheckLauncherModifierOverlaidNum_C");
static_assert(offsetof(UCondition_CheckLauncherModifierOverlaidNum_C, UberGraphFrame) == 0x000108, "Member 'UCondition_CheckLauncherModifierOverlaidNum_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCondition_CheckLauncherModifierOverlaidNum_C, ValueRange) == 0x000110, "Member 'UCondition_CheckLauncherModifierOverlaidNum_C::ValueRange' has a wrong offset!");
static_assert(offsetof(UCondition_CheckLauncherModifierOverlaidNum_C, ModifierID) == 0x000120, "Member 'UCondition_CheckLauncherModifierOverlaidNum_C::ModifierID' has a wrong offset!");
static_assert(offsetof(UCondition_CheckLauncherModifierOverlaidNum_C, OverlaidNum) == 0x000124, "Member 'UCondition_CheckLauncherModifierOverlaidNum_C::OverlaidNum' has a wrong offset!");
static_assert(offsetof(UCondition_CheckLauncherModifierOverlaidNum_C, Type) == 0x000128, "Member 'UCondition_CheckLauncherModifierOverlaidNum_C::Type' has a wrong offset!");
static_assert(offsetof(UCondition_CheckLauncherModifierOverlaidNum_C, bCreateAddModifer) == 0x000138, "Member 'UCondition_CheckLauncherModifierOverlaidNum_C::bCreateAddModifer' has a wrong offset!");

}

