#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_CheckIsDistance2TargetBetweenRange

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Condition_CheckIsDistance2TargetBetweenRange.Condition_CheckIsDistance2TargetBetweenRange_C
// 0x0018 (0x0120 - 0x0108)
class UCondition_CheckIsDistance2TargetBetweenRange_C final : public UCastConditionCheck
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         RangeMin;                                          // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RangeMax;                                          // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNOT;                                              // 0x0118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	bool K2_CheckCondition(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void K2_InitCondition();
	void ExecuteUbergraph_Condition_CheckIsDistance2TargetBetweenRange(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Condition_CheckIsDistance2TargetBetweenRange_C">();
	}
	static class UCondition_CheckIsDistance2TargetBetweenRange_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCondition_CheckIsDistance2TargetBetweenRange_C>();
	}
};
static_assert(alignof(UCondition_CheckIsDistance2TargetBetweenRange_C) == 0x000008, "Wrong alignment on UCondition_CheckIsDistance2TargetBetweenRange_C");
static_assert(sizeof(UCondition_CheckIsDistance2TargetBetweenRange_C) == 0x000120, "Wrong size on UCondition_CheckIsDistance2TargetBetweenRange_C");
static_assert(offsetof(UCondition_CheckIsDistance2TargetBetweenRange_C, UberGraphFrame) == 0x000108, "Member 'UCondition_CheckIsDistance2TargetBetweenRange_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCondition_CheckIsDistance2TargetBetweenRange_C, RangeMin) == 0x000110, "Member 'UCondition_CheckIsDistance2TargetBetweenRange_C::RangeMin' has a wrong offset!");
static_assert(offsetof(UCondition_CheckIsDistance2TargetBetweenRange_C, RangeMax) == 0x000114, "Member 'UCondition_CheckIsDistance2TargetBetweenRange_C::RangeMax' has a wrong offset!");
static_assert(offsetof(UCondition_CheckIsDistance2TargetBetweenRange_C, bNOT) == 0x000118, "Member 'UCondition_CheckIsDistance2TargetBetweenRange_C::bNOT' has a wrong offset!");

}

