#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Create002_03_bp

#include "Basic.hpp"

#include "CollisionType_Enum_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass create002_03_bp.create002_03_bp_C
// 0x0060 (0x0288 - 0x0228)
class ACreate002_03_bp_C final : public AActor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            _____;                                             // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     __bP_;                                             // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      __bi_;                                             // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EComponentMobility                            ______0;                                           // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionType_Enum                           ______1;                                           // 0x0249(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _P_X__;                                            // 0x024A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          _P_Y__;                                            // 0x024B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ____90__b;                                         // 0x024C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ____180__b;                                        // 0x024D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          _L_l;                                              // 0x024E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          GvL_l;                                             // 0x024F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          __q;                                               // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          __bZt;                                             // 0x0251(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_252[0x2];                                      // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         _Xp_;                                              // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _Y_orZp_;                                          // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _XtiSK___;                                         // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _YtiSK___;                                         // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _ZtiSK___;                                         // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __nLightMapRes;                                    // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         _LightMapRes;                                      // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _Td__;                                             // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHierarchicalInstancedStaticMeshComponent* ____;                                              // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDetailMode                                   Detail_Mode;                                       // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Refresh_Light_Map();
	void _n__(class UInstancedStaticMeshComponent* _e__);
	void __iS__(class UStaticMeshComponent* _e____, struct FVector* _____0);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"create002_03_bp_C">();
	}
	static class ACreate002_03_bp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACreate002_03_bp_C>();
	}
};
static_assert(alignof(ACreate002_03_bp_C) == 0x000008, "Wrong alignment on ACreate002_03_bp_C");
static_assert(sizeof(ACreate002_03_bp_C) == 0x000288, "Wrong size on ACreate002_03_bp_C");
static_assert(offsetof(ACreate002_03_bp_C, DefaultSceneRoot) == 0x000228, "Member 'ACreate002_03_bp_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ACreate002_03_bp_C, _____) == 0x000230, "Member 'ACreate002_03_bp_C::_____' has a wrong offset!");
static_assert(offsetof(ACreate002_03_bp_C, __bP_) == 0x000238, "Member 'ACreate002_03_bp_C::__bP_' has a wrong offset!");
static_assert(offsetof(ACreate002_03_bp_C, __bi_) == 0x000240, "Member 'ACreate002_03_bp_C::__bi_' has a wrong offset!");
static_assert(offsetof(ACreate002_03_bp_C, ______0) == 0x000248, "Member 'ACreate002_03_bp_C::______0' has a wrong offset!");
static_assert(offsetof(ACreate002_03_bp_C, ______1) == 0x000249, "Member 'ACreate002_03_bp_C::______1' has a wrong offset!");
static_assert(offsetof(ACreate002_03_bp_C, _P_X__) == 0x00024A, "Member 'ACreate002_03_bp_C::_P_X__' has a wrong offset!");
static_assert(offsetof(ACreate002_03_bp_C, _P_Y__) == 0x00024B, "Member 'ACreate002_03_bp_C::_P_Y__' has a wrong offset!");
static_assert(offsetof(ACreate002_03_bp_C, ____90__b) == 0x00024C, "Member 'ACreate002_03_bp_C::____90__b' has a wrong offset!");
static_assert(offsetof(ACreate002_03_bp_C, ____180__b) == 0x00024D, "Member 'ACreate002_03_bp_C::____180__b' has a wrong offset!");
static_assert(offsetof(ACreate002_03_bp_C, _L_l) == 0x00024E, "Member 'ACreate002_03_bp_C::_L_l' has a wrong offset!");
static_assert(offsetof(ACreate002_03_bp_C, GvL_l) == 0x00024F, "Member 'ACreate002_03_bp_C::GvL_l' has a wrong offset!");
static_assert(offsetof(ACreate002_03_bp_C, __q) == 0x000250, "Member 'ACreate002_03_bp_C::__q' has a wrong offset!");
static_assert(offsetof(ACreate002_03_bp_C, __bZt) == 0x000251, "Member 'ACreate002_03_bp_C::__bZt' has a wrong offset!");
static_assert(offsetof(ACreate002_03_bp_C, _Xp_) == 0x000254, "Member 'ACreate002_03_bp_C::_Xp_' has a wrong offset!");
static_assert(offsetof(ACreate002_03_bp_C, _Y_orZp_) == 0x000258, "Member 'ACreate002_03_bp_C::_Y_orZp_' has a wrong offset!");
static_assert(offsetof(ACreate002_03_bp_C, _XtiSK___) == 0x00025C, "Member 'ACreate002_03_bp_C::_XtiSK___' has a wrong offset!");
static_assert(offsetof(ACreate002_03_bp_C, _YtiSK___) == 0x000260, "Member 'ACreate002_03_bp_C::_YtiSK___' has a wrong offset!");
static_assert(offsetof(ACreate002_03_bp_C, _ZtiSK___) == 0x000264, "Member 'ACreate002_03_bp_C::_ZtiSK___' has a wrong offset!");
static_assert(offsetof(ACreate002_03_bp_C, __nLightMapRes) == 0x000268, "Member 'ACreate002_03_bp_C::__nLightMapRes' has a wrong offset!");
static_assert(offsetof(ACreate002_03_bp_C, _LightMapRes) == 0x00026C, "Member 'ACreate002_03_bp_C::_LightMapRes' has a wrong offset!");
static_assert(offsetof(ACreate002_03_bp_C, _Td__) == 0x000270, "Member 'ACreate002_03_bp_C::_Td__' has a wrong offset!");
static_assert(offsetof(ACreate002_03_bp_C, ____) == 0x000278, "Member 'ACreate002_03_bp_C::____' has a wrong offset!");
static_assert(offsetof(ACreate002_03_bp_C, Detail_Mode) == 0x000280, "Member 'ACreate002_03_bp_C::Detail_Mode' has a wrong offset!");

}

