#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Create020_01_bp_NEW

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "TwostFogOringin_Str_structs.hpp"
#include "TwostFogInSide_Str_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Snow_Str_structs.hpp"
#include "PostFogInSide_Str_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass create020_01_bp_NEW.create020_01_bp_NEW_C
// 0x0240 (0x0468 - 0x0228)
class ACreate020_01_bp_NEW_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    BillBoard;                                         // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_SnowTime_1999607E4415D4BB754668883ADF17CC; // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_1999607E4415D4BB754668883ADF17CC; // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_SnowTime_E1F40EB747E818F849F3CAA5ED665C76; // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_E1F40EB747E818F849F3CAA5ED665C76; // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___I___;                                           // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ___r;                                              // 0x025C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           GI_r;                                              // 0x026C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           _I_r;                                              // 0x027C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __;                                                // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____;                                              // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _____0;                                            // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         V___;                                              // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         V____0;                                            // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __UV;                                              // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __UV_0;                                            // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _IUV;                                              // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Minus__r;                                          // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GI__;                                              // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _____1;                                            // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _I__;                                              // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AExpFog_C*                              GetExpFog;                                         // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPostFogInSide_Str                     __1stFog__;                                        // 0x02C8(0x0024)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTwostFogInSide_Str                    __2stFog__;                                        // 0x02EC(0x0024)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASk00_01_bp_C*                          ___z;                                              // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ___zr;                                             // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPostFogInSide_Str                     _____;                                             // 0x0328(0x0024)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ___zr_0;                                           // 0x034C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___0;                                              // 0x035C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          __G_;                                              // 0x035D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35E[0x2];                                      // 0x035E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTwostFogOringin_Str                   Oringin2stFogParam;                                // 0x0360(0x0024)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __I6_;                                             // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __I__;                                             // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Roughness;                                         // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Normal;                                            // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AO;                                                // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          __G_H_;                                            // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x3];                                      // 0x0399(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSnow_Str                              G__p;                                              // 0x039C(0x0060)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSnow_Str                              ___p;                                              // 0x03FC(0x0060)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __a_;                                              // 0x045C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ClearSnowEffOnEnd;                                 // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ___n_(float Time, const struct FSnow_Str& A_p, const struct FSnow_Str& B_p);
	void __G__H_();
	void _n_H_();
	void Get_Original_Fog_Parameter();
	void UpdateFromeOldData(const struct FLinearColor& ___r_0, float Param____0, float Param______0, float Param______1, float __NoiseUV, float Param_V____0, float Param_V____1, float _I___0, class AExpFog_C* GetExpFog_0, const struct FPostFogInSide_Str& ______0, const struct FPostFogInSide_Str& ______1, class ASk00_01_bp_C* ___z_0, const struct FLinearColor& Param____zr_0, const struct FLinearColor& Param____zr_1, bool Param____1);
	void GetFog();
	void SelectProperty(struct FPostFogInSide_Str* STFog);
	void _b_H(float InputPin);
	void UserConstructionScript();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Snow_OFF();
	void Snow_ON();
	void ReceiveBeginPlay();
	void SnowrRefresh();
	void G_a_A();
	void __a_A();
	void G_a_OnOff(float G_);
	void Snow_OnOFF(float EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ExecuteUbergraph_create020_01_bp_NEW(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"create020_01_bp_NEW_C">();
	}
	static class ACreate020_01_bp_NEW_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACreate020_01_bp_NEW_C>();
	}
};
static_assert(alignof(ACreate020_01_bp_NEW_C) == 0x000008, "Wrong alignment on ACreate020_01_bp_NEW_C");
static_assert(sizeof(ACreate020_01_bp_NEW_C) == 0x000468, "Wrong size on ACreate020_01_bp_NEW_C");
static_assert(offsetof(ACreate020_01_bp_NEW_C, UberGraphFrame) == 0x000228, "Member 'ACreate020_01_bp_NEW_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, BillBoard) == 0x000230, "Member 'ACreate020_01_bp_NEW_C::BillBoard' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, Timeline_1_SnowTime_1999607E4415D4BB754668883ADF17CC) == 0x000238, "Member 'ACreate020_01_bp_NEW_C::Timeline_1_SnowTime_1999607E4415D4BB754668883ADF17CC' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, Timeline_1__Direction_1999607E4415D4BB754668883ADF17CC) == 0x00023C, "Member 'ACreate020_01_bp_NEW_C::Timeline_1__Direction_1999607E4415D4BB754668883ADF17CC' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, Timeline_1) == 0x000240, "Member 'ACreate020_01_bp_NEW_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, Timeline_0_SnowTime_E1F40EB747E818F849F3CAA5ED665C76) == 0x000248, "Member 'ACreate020_01_bp_NEW_C::Timeline_0_SnowTime_E1F40EB747E818F849F3CAA5ED665C76' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, Timeline_0__Direction_E1F40EB747E818F849F3CAA5ED665C76) == 0x00024C, "Member 'ACreate020_01_bp_NEW_C::Timeline_0__Direction_E1F40EB747E818F849F3CAA5ED665C76' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, Timeline_0) == 0x000250, "Member 'ACreate020_01_bp_NEW_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, ___I___) == 0x000258, "Member 'ACreate020_01_bp_NEW_C::___I___' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, ___r) == 0x00025C, "Member 'ACreate020_01_bp_NEW_C::___r' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, GI_r) == 0x00026C, "Member 'ACreate020_01_bp_NEW_C::GI_r' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, _I_r) == 0x00027C, "Member 'ACreate020_01_bp_NEW_C::_I_r' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, __) == 0x00028C, "Member 'ACreate020_01_bp_NEW_C::__' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, ____) == 0x000290, "Member 'ACreate020_01_bp_NEW_C::____' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, _____0) == 0x000294, "Member 'ACreate020_01_bp_NEW_C::_____0' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, V___) == 0x000298, "Member 'ACreate020_01_bp_NEW_C::V___' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, V____0) == 0x00029C, "Member 'ACreate020_01_bp_NEW_C::V____0' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, __UV) == 0x0002A0, "Member 'ACreate020_01_bp_NEW_C::__UV' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, __UV_0) == 0x0002A4, "Member 'ACreate020_01_bp_NEW_C::__UV_0' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, _IUV) == 0x0002A8, "Member 'ACreate020_01_bp_NEW_C::_IUV' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, Minus__r) == 0x0002AC, "Member 'ACreate020_01_bp_NEW_C::Minus__r' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, GI__) == 0x0002B0, "Member 'ACreate020_01_bp_NEW_C::GI__' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, _____1) == 0x0002B4, "Member 'ACreate020_01_bp_NEW_C::_____1' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, _I__) == 0x0002B8, "Member 'ACreate020_01_bp_NEW_C::_I__' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, GetExpFog) == 0x0002C0, "Member 'ACreate020_01_bp_NEW_C::GetExpFog' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, __1stFog__) == 0x0002C8, "Member 'ACreate020_01_bp_NEW_C::__1stFog__' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, __2stFog__) == 0x0002EC, "Member 'ACreate020_01_bp_NEW_C::__2stFog__' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, ___z) == 0x000310, "Member 'ACreate020_01_bp_NEW_C::___z' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, ___zr) == 0x000318, "Member 'ACreate020_01_bp_NEW_C::___zr' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, _____) == 0x000328, "Member 'ACreate020_01_bp_NEW_C::_____' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, ___zr_0) == 0x00034C, "Member 'ACreate020_01_bp_NEW_C::___zr_0' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, ___0) == 0x00035C, "Member 'ACreate020_01_bp_NEW_C::___0' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, __G_) == 0x00035D, "Member 'ACreate020_01_bp_NEW_C::__G_' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, Oringin2stFogParam) == 0x000360, "Member 'ACreate020_01_bp_NEW_C::Oringin2stFogParam' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, __I6_) == 0x000384, "Member 'ACreate020_01_bp_NEW_C::__I6_' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, __I__) == 0x000388, "Member 'ACreate020_01_bp_NEW_C::__I__' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, Roughness) == 0x00038C, "Member 'ACreate020_01_bp_NEW_C::Roughness' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, Normal) == 0x000390, "Member 'ACreate020_01_bp_NEW_C::Normal' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, AO) == 0x000394, "Member 'ACreate020_01_bp_NEW_C::AO' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, __G_H_) == 0x000398, "Member 'ACreate020_01_bp_NEW_C::__G_H_' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, G__p) == 0x00039C, "Member 'ACreate020_01_bp_NEW_C::G__p' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, ___p) == 0x0003FC, "Member 'ACreate020_01_bp_NEW_C::___p' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, __a_) == 0x00045C, "Member 'ACreate020_01_bp_NEW_C::__a_' has a wrong offset!");
static_assert(offsetof(ACreate020_01_bp_NEW_C, ClearSnowEffOnEnd) == 0x000460, "Member 'ACreate020_01_bp_NEW_C::ClearSnowEffOnEnd' has a wrong offset!");

}

