#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Create004_02_bp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CollisionType_Enum_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass create004_02_bp.create004_02_bp_C
// 0x0168 (0x0390 - 0x0228)
class ACreate004_02_bp_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Create004_s032_sm;                                 // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            ____;                                              // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     _bP_;                                              // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      __bi_;                                             // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                _S___;                                             // 0x0258(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EComponentMobility                            _____;                                             // 0x0264(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionType_Enum                           ______0;                                           // 0x0265(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _B0_;                                              // 0x0266(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_267[0x1];                                      // 0x0267(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            _B__;                                              // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     _BP_;                                              // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               __BBaseColor;                                      // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               __BNormal;                                         // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _B___0;                                            // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __q;                                               // 0x028C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          __nLightMapRes;                                    // 0x028D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28E[0x2];                                      // 0x028E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         _LightMapRes;                                      // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _Td__;                                             // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ____a__;                                           // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinusMinusMinusMinusUV___RBMinusMinusMinusMinus;   // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         MinusMinusMinusMinusUV___GBMinusMinusMinusMinus;   // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               _BaseColor_1;                                      // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               _Normal_1;                                         // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           _Color_1;                                          // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _ColorScale_1;                                     // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Roughness_1_Scale;                                 // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _Normal_1_Scale;                                   // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _UV_1_Scale;                                       // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _UV_1_Rotator;                                     // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   __;                                                // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDetailMode                                   Detail_Mode;                                       // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DetailMode;                                        // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               _BaseColor_2;                                      // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               _Normal_2;                                         // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           _Color_2;                                          // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _ColorScale_2;                                     // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Roughness_2_Scale;                                 // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _Normal_2_Scale;                                   // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _UV_2_Scale;                                       // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _UV_2_Rotator;                                     // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           _WaterColor;                                       // 0x0324(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _Water_Scale;                                      // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _Water_Metal;                                      // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _Water_Rough;                                      // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _Water_Specular;                                   // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SnowScale;                                         // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___1B;                                             // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___2B;                                             // 0x034C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___3B;                                             // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               ___P_;                                             // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   __BMesh;                                           // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               __B__P_;                                           // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           __BColor;                                          // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __BColorScale;                                     // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _BRoughness_Scale;                                 // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __BUV_Scale;                                       // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __BUV_Rotator;                                     // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Initialization();
	void Refresh_Light_Map();
	void SetDetailMode(class UStaticMeshComponent* InputPin);
	void UserConstructionScript();
	void Snow7_();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_create004_02_bp(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"create004_02_bp_C">();
	}
	static class ACreate004_02_bp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACreate004_02_bp_C>();
	}
};
static_assert(alignof(ACreate004_02_bp_C) == 0x000008, "Wrong alignment on ACreate004_02_bp_C");
static_assert(sizeof(ACreate004_02_bp_C) == 0x000390, "Wrong size on ACreate004_02_bp_C");
static_assert(offsetof(ACreate004_02_bp_C, UberGraphFrame) == 0x000228, "Member 'ACreate004_02_bp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, Create004_s032_sm) == 0x000230, "Member 'ACreate004_02_bp_C::Create004_s032_sm' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, DefaultSceneRoot) == 0x000238, "Member 'ACreate004_02_bp_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, ____) == 0x000240, "Member 'ACreate004_02_bp_C::____' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _bP_) == 0x000248, "Member 'ACreate004_02_bp_C::_bP_' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, __bi_) == 0x000250, "Member 'ACreate004_02_bp_C::__bi_' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _S___) == 0x000258, "Member 'ACreate004_02_bp_C::_S___' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _____) == 0x000264, "Member 'ACreate004_02_bp_C::_____' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, ______0) == 0x000265, "Member 'ACreate004_02_bp_C::______0' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _B0_) == 0x000266, "Member 'ACreate004_02_bp_C::_B0_' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _B__) == 0x000268, "Member 'ACreate004_02_bp_C::_B__' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _BP_) == 0x000270, "Member 'ACreate004_02_bp_C::_BP_' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, __BBaseColor) == 0x000278, "Member 'ACreate004_02_bp_C::__BBaseColor' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, __BNormal) == 0x000280, "Member 'ACreate004_02_bp_C::__BNormal' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _B___0) == 0x000288, "Member 'ACreate004_02_bp_C::_B___0' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, __q) == 0x00028C, "Member 'ACreate004_02_bp_C::__q' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, __nLightMapRes) == 0x00028D, "Member 'ACreate004_02_bp_C::__nLightMapRes' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _LightMapRes) == 0x000290, "Member 'ACreate004_02_bp_C::_LightMapRes' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _Td__) == 0x000294, "Member 'ACreate004_02_bp_C::_Td__' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, ____a__) == 0x000298, "Member 'ACreate004_02_bp_C::____a__' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, MinusMinusMinusMinusUV___RBMinusMinusMinusMinus) == 0x00029C, "Member 'ACreate004_02_bp_C::MinusMinusMinusMinusUV___RBMinusMinusMinusMinus' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, MinusMinusMinusMinusUV___GBMinusMinusMinusMinus) == 0x0002A0, "Member 'ACreate004_02_bp_C::MinusMinusMinusMinusUV___GBMinusMinusMinusMinus' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _BaseColor_1) == 0x0002A8, "Member 'ACreate004_02_bp_C::_BaseColor_1' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _Normal_1) == 0x0002B0, "Member 'ACreate004_02_bp_C::_Normal_1' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _Color_1) == 0x0002B8, "Member 'ACreate004_02_bp_C::_Color_1' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _ColorScale_1) == 0x0002C8, "Member 'ACreate004_02_bp_C::_ColorScale_1' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, Roughness_1_Scale) == 0x0002CC, "Member 'ACreate004_02_bp_C::Roughness_1_Scale' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _Normal_1_Scale) == 0x0002D0, "Member 'ACreate004_02_bp_C::_Normal_1_Scale' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _UV_1_Scale) == 0x0002D4, "Member 'ACreate004_02_bp_C::_UV_1_Scale' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _UV_1_Rotator) == 0x0002D8, "Member 'ACreate004_02_bp_C::_UV_1_Rotator' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, __) == 0x0002E0, "Member 'ACreate004_02_bp_C::__' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, Detail_Mode) == 0x0002E8, "Member 'ACreate004_02_bp_C::Detail_Mode' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, DetailMode) == 0x0002EC, "Member 'ACreate004_02_bp_C::DetailMode' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _BaseColor_2) == 0x0002F0, "Member 'ACreate004_02_bp_C::_BaseColor_2' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _Normal_2) == 0x0002F8, "Member 'ACreate004_02_bp_C::_Normal_2' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _Color_2) == 0x000300, "Member 'ACreate004_02_bp_C::_Color_2' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _ColorScale_2) == 0x000310, "Member 'ACreate004_02_bp_C::_ColorScale_2' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, Roughness_2_Scale) == 0x000314, "Member 'ACreate004_02_bp_C::Roughness_2_Scale' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _Normal_2_Scale) == 0x000318, "Member 'ACreate004_02_bp_C::_Normal_2_Scale' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _UV_2_Scale) == 0x00031C, "Member 'ACreate004_02_bp_C::_UV_2_Scale' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _UV_2_Rotator) == 0x000320, "Member 'ACreate004_02_bp_C::_UV_2_Rotator' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _WaterColor) == 0x000324, "Member 'ACreate004_02_bp_C::_WaterColor' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _Water_Scale) == 0x000334, "Member 'ACreate004_02_bp_C::_Water_Scale' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _Water_Metal) == 0x000338, "Member 'ACreate004_02_bp_C::_Water_Metal' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _Water_Rough) == 0x00033C, "Member 'ACreate004_02_bp_C::_Water_Rough' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _Water_Specular) == 0x000340, "Member 'ACreate004_02_bp_C::_Water_Specular' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, SnowScale) == 0x000344, "Member 'ACreate004_02_bp_C::SnowScale' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, ___1B) == 0x000348, "Member 'ACreate004_02_bp_C::___1B' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, ___2B) == 0x00034C, "Member 'ACreate004_02_bp_C::___2B' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, ___3B) == 0x000350, "Member 'ACreate004_02_bp_C::___3B' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, ___P_) == 0x000358, "Member 'ACreate004_02_bp_C::___P_' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, __BMesh) == 0x000360, "Member 'ACreate004_02_bp_C::__BMesh' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, __B__P_) == 0x000368, "Member 'ACreate004_02_bp_C::__B__P_' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, __BColor) == 0x000370, "Member 'ACreate004_02_bp_C::__BColor' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, __BColorScale) == 0x000380, "Member 'ACreate004_02_bp_C::__BColorScale' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, _BRoughness_Scale) == 0x000384, "Member 'ACreate004_02_bp_C::_BRoughness_Scale' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, __BUV_Scale) == 0x000388, "Member 'ACreate004_02_bp_C::__BUV_Scale' has a wrong offset!");
static_assert(offsetof(ACreate004_02_bp_C, __BUV_Rotator) == 0x00038C, "Member 'ACreate004_02_bp_C::__BUV_Rotator' has a wrong offset!");

}

