#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Create005_01_bp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function create005_01_bp.create005_01_bp_C.Ø7° LMR„È
// 0x000C (0x000C - 0x0000)
struct Create005_01_bp_C____7__LMR__ final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes;  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes_1; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create005_01_bp_C____7__LMR__) == 0x000004, "Wrong alignment on Create005_01_bp_C____7__LMR__");
static_assert(sizeof(Create005_01_bp_C____7__LMR__) == 0x00000C, "Wrong size on Create005_01_bp_C____7__LMR__");
static_assert(offsetof(Create005_01_bp_C____7__LMR__, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'Create005_01_bp_C____7__LMR__::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C____7__LMR__, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'Create005_01_bp_C____7__LMR__::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C____7__LMR__, CallFunc_SetLightmapResolution_OutNewLightmapRes) == 0x000004, "Member 'Create005_01_bp_C____7__LMR__::CallFunc_SetLightmapResolution_OutNewLightmapRes' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C____7__LMR__, CallFunc_SetLightmapResolution_OutNewLightmapRes_1) == 0x000008, "Member 'Create005_01_bp_C____7__LMR__::CallFunc_SetLightmapResolution_OutNewLightmapRes_1' has a wrong offset!");

// Function create005_01_bp.create005_01_bp_C.ú!‹
// 0x0090 (0x0090 - 0x0000)
struct Create005_01_bp_C______0 final
{
public:
	struct FTransform                             ___struct_Variable;                                // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             ___struct_Variable_1;                              // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue_1;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes;  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes_1; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc____________;                              // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Create005_01_bp_C_____) == 0x000010, "Wrong alignment on Create005_01_bp_C_____");
static_assert(sizeof(Create005_01_bp_C_____) == 0x000090, "Wrong size on Create005_01_bp_C_____");
static_assert(offsetof(Create005_01_bp_C_____, ___struct_Variable) == 0x000000, "Member 'Create005_01_bp_C_____::___struct_Variable' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_____, ___struct_Variable_1) == 0x000030, "Member 'Create005_01_bp_C_____::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_____, CallFunc_AddComponent_ReturnValue) == 0x000060, "Member 'Create005_01_bp_C_____::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_____, CallFunc_AddComponent_ReturnValue_1) == 0x000068, "Member 'Create005_01_bp_C_____::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_____, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000070, "Member 'Create005_01_bp_C_____::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_____, CallFunc_SetLightmapResolution_OutNewLightmapRes) == 0x000074, "Member 'Create005_01_bp_C_____::CallFunc_SetLightmapResolution_OutNewLightmapRes' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_____, CallFunc_SetLightmapResolution_OutNewLightmapRes_1) == 0x000078, "Member 'Create005_01_bp_C_____::CallFunc_SetLightmapResolution_OutNewLightmapRes_1' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_____, CallFunc_SetStaticMesh_ReturnValue) == 0x00007C, "Member 'Create005_01_bp_C_____::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_____, CallFunc____________) == 0x000080, "Member 'Create005_01_bp_C_____::CallFunc____________' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_____, CallFunc_SetStaticMesh_ReturnValue_1) == 0x00008C, "Member 'Create005_01_bp_C_____::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");

// Function create005_01_bp.create005_01_bp_C.¾n!‹
// 0x0010 (0x0010 - 0x0000)
struct Create005_01_bp_C__n__ final
{
public:
	class UInstancedStaticMeshComponent*          _e__;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_CollisionType_TypeName;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create005_01_bp_C__n__) == 0x000008, "Wrong alignment on Create005_01_bp_C__n__");
static_assert(sizeof(Create005_01_bp_C__n__) == 0x000010, "Wrong size on Create005_01_bp_C__n__");
static_assert(offsetof(Create005_01_bp_C__n__, _e__) == 0x000000, "Member 'Create005_01_bp_C__n__::_e__' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C__n__, CallFunc_CollisionType_TypeName) == 0x000008, "Member 'Create005_01_bp_C__n__::CallFunc_CollisionType_TypeName' has a wrong offset!");

// Function create005_01_bp.create005_01_bp_C.·ÖiS:ø
// 0x0068 (0x0068 - 0x0000)
struct Create005_01_bp_C___iS__ final
{
public:
	class UStaticMeshComponent*                   _e____;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Param______0;                                      // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalBounds_Min;                       // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalBounds_Max;                       // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_2;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create005_01_bp_C___iS__) == 0x000008, "Wrong alignment on Create005_01_bp_C___iS__");
static_assert(sizeof(Create005_01_bp_C___iS__) == 0x000068, "Wrong size on Create005_01_bp_C___iS__");
static_assert(offsetof(Create005_01_bp_C___iS__, _e____) == 0x000000, "Member 'Create005_01_bp_C___iS__::_e____' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C___iS__, Param______0) == 0x000008, "Member 'Create005_01_bp_C___iS__::Param______0' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C___iS__, CallFunc_GetLocalBounds_Min) == 0x000014, "Member 'Create005_01_bp_C___iS__::CallFunc_GetLocalBounds_Min' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C___iS__, CallFunc_GetLocalBounds_Max) == 0x000020, "Member 'Create005_01_bp_C___iS__::CallFunc_GetLocalBounds_Max' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C___iS__, CallFunc_BreakVector_X) == 0x00002C, "Member 'Create005_01_bp_C___iS__::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C___iS__, CallFunc_BreakVector_Y) == 0x000030, "Member 'Create005_01_bp_C___iS__::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C___iS__, CallFunc_BreakVector_Z) == 0x000034, "Member 'Create005_01_bp_C___iS__::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C___iS__, CallFunc_BreakVector_X_1) == 0x000038, "Member 'Create005_01_bp_C___iS__::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C___iS__, CallFunc_BreakVector_Y_1) == 0x00003C, "Member 'Create005_01_bp_C___iS__::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C___iS__, CallFunc_BreakVector_Z_1) == 0x000040, "Member 'Create005_01_bp_C___iS__::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C___iS__, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000044, "Member 'Create005_01_bp_C___iS__::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C___iS__, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000048, "Member 'Create005_01_bp_C___iS__::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C___iS__, CallFunc_Abs_ReturnValue) == 0x00004C, "Member 'Create005_01_bp_C___iS__::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C___iS__, CallFunc_Abs_ReturnValue_1) == 0x000050, "Member 'Create005_01_bp_C___iS__::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C___iS__, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000054, "Member 'Create005_01_bp_C___iS__::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C___iS__, CallFunc_Abs_ReturnValue_2) == 0x000058, "Member 'Create005_01_bp_C___iS__::CallFunc_Abs_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C___iS__, CallFunc_MakeVector_ReturnValue) == 0x00005C, "Member 'Create005_01_bp_C___iS__::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function create005_01_bp.create005_01_bp_C.UserConstructionScript
// 0x00F0 (0x00F0 - 0x0000)
struct Create005_01_bp_C_UserConstructionScript final
{
public:
	int32                                         ___int_Variable;                                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable_1;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue_1;                // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create005_01_bp_C_UserConstructionScript) == 0x000010, "Wrong alignment on Create005_01_bp_C_UserConstructionScript");
static_assert(sizeof(Create005_01_bp_C_UserConstructionScript) == 0x0000F0, "Wrong size on Create005_01_bp_C_UserConstructionScript");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, ___int_Variable) == 0x000000, "Member 'Create005_01_bp_C_UserConstructionScript::___int_Variable' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_Percent_IntInt_ReturnValue) == 0x000008, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_Conv_IntToBool_ReturnValue) == 0x00000C, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000010, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000014, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000018, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, ___int_Variable_1) == 0x00001C, "Member 'Create005_01_bp_C_UserConstructionScript::___int_Variable_1' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_BreakVector_X_1) == 0x000020, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_BreakVector_Y_1) == 0x000024, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_BreakVector_Z_1) == 0x000028, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue) == 0x00002C, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000034, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x000038, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00003C, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000040, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000044, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_2) == 0x000048, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00004C, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000050, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000054, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x000064, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x000070, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_Clamp_ReturnValue) == 0x00007C, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_SelectRotator_ReturnValue) == 0x000080, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_BreakRotator_Roll) == 0x00008C, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_BreakRotator_Pitch) == 0x000090, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_BreakRotator_Yaw) == 0x000094, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000098, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x00009C, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x0000A0, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue_1) == 0x0000A4, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x0000B0, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_AddInstance_ReturnValue) == 0x0000E0, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_AddInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create005_01_bp_C_UserConstructionScript, CallFunc_AddInstance_ReturnValue_1) == 0x0000E4, "Member 'Create005_01_bp_C_UserConstructionScript::CallFunc_AddInstance_ReturnValue_1' has a wrong offset!");

}

