#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Create001_03a_bp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function create001_03a_bp.create001_03a_bp_C.`7∞
// 0x01A0 (0x01A0 - 0x0000)
struct Create001_03a_bp_C___7_ final
{
public:
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable;                                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0xC];                                       // 0x0034(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetInstanceTransform_OutInstanceTransform; // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetInstanceTransform_ReturnValue;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue; // 0x00F0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0160(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateInstanceTransform_ReturnValue;      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Create001_03a_bp_C___7_) == 0x000010, "Wrong alignment on Create001_03a_bp_C___7_");
static_assert(sizeof(Create001_03a_bp_C___7_) == 0x0001A0, "Wrong size on Create001_03a_bp_C___7_");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_Subtract_IntInt_ReturnValue) == 0x000000, "Member 'Create001_03a_bp_C___7_::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000004, "Member 'Create001_03a_bp_C___7_::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'Create001_03a_bp_C___7_::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, ___int_Variable) == 0x00000C, "Member 'Create001_03a_bp_C___7_::___int_Variable' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'Create001_03a_bp_C___7_::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000011, "Member 'Create001_03a_bp_C___7_::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_SelectInt_ReturnValue) == 0x000014, "Member 'Create001_03a_bp_C___7_::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000018, "Member 'Create001_03a_bp_C___7_::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_SelectInt_ReturnValue_1) == 0x00001C, "Member 'Create001_03a_bp_C___7_::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000020, "Member 'Create001_03a_bp_C___7_::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_Array_Get_Item) == 0x000024, "Member 'Create001_03a_bp_C___7_::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_SelectFloat_ReturnValue_1) == 0x000030, "Member 'Create001_03a_bp_C___7_::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_GetInstanceTransform_OutInstanceTransform) == 0x000040, "Member 'Create001_03a_bp_C___7_::CallFunc_GetInstanceTransform_OutInstanceTransform' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_GetInstanceTransform_ReturnValue) == 0x000070, "Member 'Create001_03a_bp_C___7_::CallFunc_GetInstanceTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'Create001_03a_bp_C___7_::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_BreakTransform_Location) == 0x000078, "Member 'Create001_03a_bp_C___7_::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_BreakTransform_Rotation) == 0x000084, "Member 'Create001_03a_bp_C___7_::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_BreakTransform_Scale) == 0x000090, "Member 'Create001_03a_bp_C___7_::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_SelectInt_ReturnValue_2) == 0x00009C, "Member 'Create001_03a_bp_C___7_::CallFunc_SelectInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_BreakVector_X) == 0x0000A0, "Member 'Create001_03a_bp_C___7_::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_BreakVector_Y) == 0x0000A4, "Member 'Create001_03a_bp_C___7_::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_BreakVector_Z) == 0x0000A8, "Member 'Create001_03a_bp_C___7_::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000AC, "Member 'Create001_03a_bp_C___7_::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_MakeRotator_ReturnValue) == 0x0000B0, "Member 'Create001_03a_bp_C___7_::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_BreakRotator_Roll) == 0x0000BC, "Member 'Create001_03a_bp_C___7_::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_BreakRotator_Pitch) == 0x0000C0, "Member 'Create001_03a_bp_C___7_::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_BreakRotator_Yaw) == 0x0000C4, "Member 'Create001_03a_bp_C___7_::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000C8, "Member 'Create001_03a_bp_C___7_::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000CC, "Member 'Create001_03a_bp_C___7_::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_MakeRotator_ReturnValue_1) == 0x0000D0, "Member 'Create001_03a_bp_C___7_::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_GetSplineLength_ReturnValue) == 0x0000DC, "Member 'Create001_03a_bp_C___7_::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x0000E0, "Member 'Create001_03a_bp_C___7_::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000E4, "Member 'Create001_03a_bp_C___7_::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x0000E8, "Member 'Create001_03a_bp_C___7_::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_Multiply_IntFloat_ReturnValue) == 0x0000EC, "Member 'Create001_03a_bp_C___7_::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue) == 0x0000F0, "Member 'Create001_03a_bp_C___7_::CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_BreakTransform_Location_1) == 0x000120, "Member 'Create001_03a_bp_C___7_::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_BreakTransform_Rotation_1) == 0x00012C, "Member 'Create001_03a_bp_C___7_::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_BreakTransform_Scale_1) == 0x000138, "Member 'Create001_03a_bp_C___7_::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_BreakVector_X_1) == 0x000144, "Member 'Create001_03a_bp_C___7_::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_BreakVector_Y_1) == 0x000148, "Member 'Create001_03a_bp_C___7_::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_BreakVector_Z_1) == 0x00014C, "Member 'Create001_03a_bp_C___7_::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000150, "Member 'Create001_03a_bp_C___7_::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_MakeVector_ReturnValue) == 0x000154, "Member 'Create001_03a_bp_C___7_::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_MakeTransform_ReturnValue) == 0x000160, "Member 'Create001_03a_bp_C___7_::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C___7_, CallFunc_UpdateInstanceTransform_ReturnValue) == 0x000190, "Member 'Create001_03a_bp_C___7_::CallFunc_UpdateInstanceTransform_ReturnValue' has a wrong offset!");

// Function create001_03a_bp.create001_03a_bp_C.æn`!ã
// 0x0060 (0x0060 - 0x0000)
struct Create001_03a_bp_C__n____ final
{
public:
	class UHierarchicalInstancedStaticMeshComponent* ______;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_CollisionType_TypeName;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ___struct_Variable;                                // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes;  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Create001_03a_bp_C__n____) == 0x000010, "Wrong alignment on Create001_03a_bp_C__n____");
static_assert(sizeof(Create001_03a_bp_C__n____) == 0x000060, "Wrong size on Create001_03a_bp_C__n____");
static_assert(offsetof(Create001_03a_bp_C__n____, ______) == 0x000000, "Member 'Create001_03a_bp_C__n____::______' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C__n____, CallFunc_CollisionType_TypeName) == 0x000008, "Member 'Create001_03a_bp_C__n____::CallFunc_CollisionType_TypeName' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C__n____, ___struct_Variable) == 0x000010, "Member 'Create001_03a_bp_C__n____::___struct_Variable' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C__n____, CallFunc_FTrunc_ReturnValue) == 0x000040, "Member 'Create001_03a_bp_C__n____::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C__n____, CallFunc_AddComponent_ReturnValue) == 0x000048, "Member 'Create001_03a_bp_C__n____::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C__n____, CallFunc_SetLightmapResolution_OutNewLightmapRes) == 0x000050, "Member 'Create001_03a_bp_C__n____::CallFunc_SetLightmapResolution_OutNewLightmapRes' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C__n____, CallFunc_SetStaticMesh_ReturnValue) == 0x000054, "Member 'Create001_03a_bp_C__n____::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function create001_03a_bp.create001_03a_bp_C.`
// 0x01A0 (0x01A0 - 0x0000)
struct Create001_03a_bp_C_Func______0 final
{
public:
	int32                                         ___int_Variable;                                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ___struct_Variable;                                // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable;                                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               ___struct_Variable_1;                              // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         ___int_Variable_1;                                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc______________;                            // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable_1;                                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_Select_Default;                             // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_1;                           // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue; // 0x00E0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0160(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create001_03a_bp_C_____) == 0x000010, "Wrong alignment on Create001_03a_bp_C_____");
static_assert(sizeof(Create001_03a_bp_C_____) == 0x0001A0, "Wrong size on Create001_03a_bp_C_____");
static_assert(offsetof(Create001_03a_bp_C_____, ___int_Variable) == 0x000000, "Member 'Create001_03a_bp_C_____::___int_Variable' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'Create001_03a_bp_C_____::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'Create001_03a_bp_C_____::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_Add_IntInt_ReturnValue_1) == 0x00000C, "Member 'Create001_03a_bp_C_____::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_SelectInt_ReturnValue) == 0x000010, "Member 'Create001_03a_bp_C_____::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, ___struct_Variable) == 0x000014, "Member 'Create001_03a_bp_C_____::___struct_Variable' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_MakeRotator_ReturnValue) == 0x000020, "Member 'Create001_03a_bp_C_____::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_Array_Get_Item) == 0x00002C, "Member 'Create001_03a_bp_C_____::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, ___bool_Variable) == 0x000038, "Member 'Create001_03a_bp_C_____::___bool_Variable' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, ___struct_Variable_1) == 0x00003C, "Member 'Create001_03a_bp_C_____::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, ___int_Variable_1) == 0x000048, "Member 'Create001_03a_bp_C_____::___int_Variable_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_Subtract_IntInt_ReturnValue) == 0x00004C, "Member 'Create001_03a_bp_C_____::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000050, "Member 'Create001_03a_bp_C_____::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_BooleanOR_ReturnValue) == 0x000051, "Member 'Create001_03a_bp_C_____::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_Add_IntInt_ReturnValue_2) == 0x000054, "Member 'Create001_03a_bp_C_____::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000058, "Member 'Create001_03a_bp_C_____::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00005C, "Member 'Create001_03a_bp_C_____::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc______________) == 0x000060, "Member 'Create001_03a_bp_C_____::CallFunc______________' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000068, "Member 'Create001_03a_bp_C_____::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, ___bool_Variable_1) == 0x000069, "Member 'Create001_03a_bp_C_____::___bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, K2Node_Select_Default) == 0x00006C, "Member 'Create001_03a_bp_C_____::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_BreakRotator_Roll) == 0x000078, "Member 'Create001_03a_bp_C_____::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_BreakRotator_Pitch) == 0x00007C, "Member 'Create001_03a_bp_C_____::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_BreakRotator_Yaw) == 0x000080, "Member 'Create001_03a_bp_C_____::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_Add_FloatFloat_ReturnValue) == 0x000084, "Member 'Create001_03a_bp_C_____::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x000088, "Member 'Create001_03a_bp_C_____::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_MakeRotator_ReturnValue_1) == 0x00008C, "Member 'Create001_03a_bp_C_____::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_MakeVector_ReturnValue) == 0x000098, "Member 'Create001_03a_bp_C_____::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, K2Node_Select_Default_1) == 0x0000A4, "Member 'Create001_03a_bp_C_____::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000B0, "Member 'Create001_03a_bp_C_____::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000BC, "Member 'Create001_03a_bp_C_____::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x0000C0, "Member 'Create001_03a_bp_C_____::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000C4, "Member 'Create001_03a_bp_C_____::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_GetSplineLength_ReturnValue) == 0x0000C8, "Member 'Create001_03a_bp_C_____::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_SelectFloat_ReturnValue) == 0x0000CC, "Member 'Create001_03a_bp_C_____::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000D0, "Member 'Create001_03a_bp_C_____::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x0000D4, "Member 'Create001_03a_bp_C_____::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_Multiply_IntFloat_ReturnValue) == 0x0000D8, "Member 'Create001_03a_bp_C_____::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x0000DC, "Member 'Create001_03a_bp_C_____::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue) == 0x0000E0, "Member 'Create001_03a_bp_C_____::CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_BreakTransform_Location) == 0x000110, "Member 'Create001_03a_bp_C_____::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_BreakTransform_Rotation) == 0x00011C, "Member 'Create001_03a_bp_C_____::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_BreakTransform_Scale) == 0x000128, "Member 'Create001_03a_bp_C_____::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_BreakVector_X) == 0x000134, "Member 'Create001_03a_bp_C_____::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_BreakVector_Y) == 0x000138, "Member 'Create001_03a_bp_C_____::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_BreakVector_Z) == 0x00013C, "Member 'Create001_03a_bp_C_____::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000140, "Member 'Create001_03a_bp_C_____::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00014C, "Member 'Create001_03a_bp_C_____::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_Array_Add_ReturnValue) == 0x000150, "Member 'Create001_03a_bp_C_____::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_MakeVector_ReturnValue_1) == 0x000154, "Member 'Create001_03a_bp_C_____::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_MakeTransform_ReturnValue) == 0x000160, "Member 'Create001_03a_bp_C_____::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C_____, CallFunc_AddInstance_ReturnValue) == 0x000190, "Member 'Create001_03a_bp_C_____::CallFunc_AddInstance_ReturnValue' has a wrong offset!");

// Function create001_03a_bp.create001_03a_bp_C.ÛP7∞
// 0x0080 (0x0080 - 0x0000)
struct Create001_03a_bp_C__P7_ final
{
public:
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USplineMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable;                                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location; // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent; // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location_1; // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1; // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create001_03a_bp_C__P7_) == 0x000008, "Wrong alignment on Create001_03a_bp_C__P7_");
static_assert(sizeof(Create001_03a_bp_C__P7_) == 0x000080, "Wrong size on Create001_03a_bp_C__P7_");
static_assert(offsetof(Create001_03a_bp_C__P7_, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000000, "Member 'Create001_03a_bp_C__P7_::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C__P7_, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000008, "Member 'Create001_03a_bp_C__P7_::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C__P7_, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'Create001_03a_bp_C__P7_::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C__P7_, ___int_Variable) == 0x00001C, "Member 'Create001_03a_bp_C__P7_::___int_Variable' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C__P7_, CallFunc_Array_Get_Item) == 0x000020, "Member 'Create001_03a_bp_C__P7_::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C__P7_, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'Create001_03a_bp_C__P7_::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C__P7_, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00002C, "Member 'Create001_03a_bp_C__P7_::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C__P7_, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'Create001_03a_bp_C__P7_::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C__P7_, CallFunc_GetLocationAndTangentAtSplinePoint_Location) == 0x000034, "Member 'Create001_03a_bp_C__P7_::CallFunc_GetLocationAndTangentAtSplinePoint_Location' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C__P7_, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent) == 0x000040, "Member 'Create001_03a_bp_C__P7_::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C__P7_, CallFunc_K2_AttachToComponent_ReturnValue) == 0x00004C, "Member 'Create001_03a_bp_C__P7_::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C__P7_, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000050, "Member 'Create001_03a_bp_C__P7_::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C__P7_, CallFunc_GetLocationAndTangentAtSplinePoint_Location_1) == 0x00005C, "Member 'Create001_03a_bp_C__P7_::CallFunc_GetLocationAndTangentAtSplinePoint_Location_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C__P7_, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1) == 0x000068, "Member 'Create001_03a_bp_C__P7_::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C__P7_, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000074, "Member 'Create001_03a_bp_C__P7_::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");

// Function create001_03a_bp.create001_03a_bp_C.Refresh Light Map
// 0x0004 (0x0004 - 0x0000)
struct Create001_03a_bp_C_Refresh_Light_Map final
{
public:
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes;  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create001_03a_bp_C_Refresh_Light_Map) == 0x000004, "Wrong alignment on Create001_03a_bp_C_Refresh_Light_Map");
static_assert(sizeof(Create001_03a_bp_C_Refresh_Light_Map) == 0x000004, "Wrong size on Create001_03a_bp_C_Refresh_Light_Map");
static_assert(offsetof(Create001_03a_bp_C_Refresh_Light_Map, CallFunc_SetLightmapResolution_OutNewLightmapRes) == 0x000000, "Member 'Create001_03a_bp_C_Refresh_Light_Map::CallFunc_SetLightmapResolution_OutNewLightmapRes' has a wrong offset!");

// Function create001_03a_bp.create001_03a_bp_C.ÛP
// 0x00B0 (0x00B0 - 0x0000)
struct Create001_03a_bp_C____P final
{
public:
	int32                                         PointIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_CollisionType_TypeName;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ___struct_Variable;                                // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes;  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location; // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent; // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location_1; // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1; // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create001_03a_bp_C____P) == 0x000010, "Wrong alignment on Create001_03a_bp_C____P");
static_assert(sizeof(Create001_03a_bp_C____P) == 0x0000B0, "Wrong size on Create001_03a_bp_C____P");
static_assert(offsetof(Create001_03a_bp_C____P, PointIndex) == 0x000000, "Member 'Create001_03a_bp_C____P::PointIndex' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C____P, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'Create001_03a_bp_C____P::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C____P, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000008, "Member 'Create001_03a_bp_C____P::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C____P, CallFunc_CollisionType_TypeName) == 0x000010, "Member 'Create001_03a_bp_C____P::CallFunc_CollisionType_TypeName' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C____P, ___struct_Variable) == 0x000020, "Member 'Create001_03a_bp_C____P::___struct_Variable' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C____P, CallFunc_AddComponent_ReturnValue) == 0x000050, "Member 'Create001_03a_bp_C____P::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C____P, CallFunc_SetLightmapResolution_OutNewLightmapRes) == 0x000058, "Member 'Create001_03a_bp_C____P::CallFunc_SetLightmapResolution_OutNewLightmapRes' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C____P, CallFunc_SetStaticMesh_ReturnValue) == 0x00005C, "Member 'Create001_03a_bp_C____P::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C____P, CallFunc_GetLocationAndTangentAtSplinePoint_Location) == 0x000060, "Member 'Create001_03a_bp_C____P::CallFunc_GetLocationAndTangentAtSplinePoint_Location' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C____P, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent) == 0x00006C, "Member 'Create001_03a_bp_C____P::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C____P, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000078, "Member 'Create001_03a_bp_C____P::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C____P, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00007C, "Member 'Create001_03a_bp_C____P::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C____P, CallFunc_GetLocationAndTangentAtSplinePoint_Location_1) == 0x000088, "Member 'Create001_03a_bp_C____P::CallFunc_GetLocationAndTangentAtSplinePoint_Location_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C____P, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1) == 0x000094, "Member 'Create001_03a_bp_C____P::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1' has a wrong offset!");
static_assert(offsetof(Create001_03a_bp_C____P, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000A0, "Member 'Create001_03a_bp_C____P::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");

// Function create001_03a_bp.create001_03a_bp_C.UserConstructionScript
// 0x0130 (0x0130 - 0x0000)
struct Create001_03a_bp_C_UserConstructionScript final
{
public:
	bool                                          ___bool_Variable;                                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Variable;                                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UInstancedStaticMeshComponent*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetInstanceTransform_OutInstanceTransform; // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetInstanceTransform_ReturnValue;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetInstanceCount_ReturnValue;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0098(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create001_03a_bp_C_UserConstructionScript) == 0x000010, "Wrong alignment on Create001_03a_bp_C_UserConstructionScript");
