#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Create002_03_bp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function create002_03_bp.create002_03_bp_C.Refresh Light Map
// 0x0004 (0x0004 - 0x0000)
struct Create002_03_bp_C_Refresh_Light_Map final
{
public:
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes;  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create002_03_bp_C_Refresh_Light_Map) == 0x000004, "Wrong alignment on Create002_03_bp_C_Refresh_Light_Map");
static_assert(sizeof(Create002_03_bp_C_Refresh_Light_Map) == 0x000004, "Wrong size on Create002_03_bp_C_Refresh_Light_Map");
static_assert(offsetof(Create002_03_bp_C_Refresh_Light_Map, CallFunc_SetLightmapResolution_OutNewLightmapRes) == 0x000000, "Member 'Create002_03_bp_C_Refresh_Light_Map::CallFunc_SetLightmapResolution_OutNewLightmapRes' has a wrong offset!");

// Function create002_03_bp.create002_03_bp_C.¾n!‹
// 0x0018 (0x0018 - 0x0000)
struct Create002_03_bp_C__n__ final
{
public:
	class UInstancedStaticMeshComponent*          _e__;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_CollisionType_TypeName;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes;  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create002_03_bp_C__n__) == 0x000008, "Wrong alignment on Create002_03_bp_C__n__");
static_assert(sizeof(Create002_03_bp_C__n__) == 0x000018, "Wrong size on Create002_03_bp_C__n__");
static_assert(offsetof(Create002_03_bp_C__n__, _e__) == 0x000000, "Member 'Create002_03_bp_C__n__::_e__' has a wrong offset!");
static_assert(offsetof(Create002_03_bp_C__n__, CallFunc_CollisionType_TypeName) == 0x000008, "Member 'Create002_03_bp_C__n__::CallFunc_CollisionType_TypeName' has a wrong offset!");
static_assert(offsetof(Create002_03_bp_C__n__, CallFunc_SetLightmapResolution_OutNewLightmapRes) == 0x000010, "Member 'Create002_03_bp_C__n__::CallFunc_SetLightmapResolution_OutNewLightmapRes' has a wrong offset!");

// Function create002_03_bp.create002_03_bp_C.·ÖiS:ø
// 0x0068 (0x0068 - 0x0000)
struct Create002_03_bp_C___iS__ final
{
public:
	class UStaticMeshComponent*                   _e____;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                _____0;                                            // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalBounds_Min;                       // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalBounds_Max;                       // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_2;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create002_03_bp_C___iS__) == 0x000008, "Wrong alignment on Create002_03_bp_C___iS__");
static_assert(sizeof(Create002_03_bp_C___iS__) == 0x000068, "Wrong size on Create002_03_bp_C___iS__");
static_assert(offsetof(Create002_03_bp_C___iS__, _e____) == 0x000000, "Member 'Create002_03_bp_C___iS__::_e____' has a wrong offset!");
static_assert(offsetof(Create002_03_bp_C___iS__, _____0) == 0x000008, "Member 'Create002_03_bp_C___iS__::_____0' has a wrong offset!");
static_assert(offsetof(Create002_03_bp_C___iS__, CallFunc_GetLocalBounds_Min) == 0x000014, "Member 'Create002_03_bp_C___iS__::CallFunc_GetLocalBounds_Min' has a wrong offset!");
static_assert(offsetof(Create002_03_bp_C___iS__, CallFunc_GetLocalBounds_Max) == 0x000020, "Member 'Create002_03_bp_C___iS__::CallFunc_GetLocalBounds_Max' has a wrong offset!");
static_assert(offsetof(Create002_03_bp_C___iS__, CallFunc_BreakVector_X) == 0x00002C, "Member 'Create002_03_bp_C___iS__::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Create002_03_bp_C___iS__, CallFunc_BreakVector_Y) == 0x000030, "Member 'Create002_03_bp_C___iS__::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Create002_03_bp_C___iS__, CallFunc_BreakVector_Z) == 0x000034, "Member 'Create002_03_bp_C___iS__::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Create002_03_bp_C___iS__, CallFunc_BreakVector_X_1) == 0x000038, "Member 'Create002_03_bp_C___iS__::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Create002_03_bp_C___iS__, CallFunc_BreakVector_Y_1) == 0x00003C, "Member 'Create002_03_bp_C___iS__::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Create002_03_bp_C___iS__, CallFunc_BreakVector_Z_1) == 0x000040, "Member 'Create002_03_bp_C___iS__::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Create002_03_bp_C___iS__, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000044, "Member 'Create002_03_bp_C___iS__::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create002_03_bp_C___iS__, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000048, "Member 'Create002_03_bp_C___iS__::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create002_03_bp_C___iS__, CallFunc_Abs_ReturnValue) == 0x00004C, "Member 'Create002_03_bp_C___iS__::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create002_03_bp_C___iS__, CallFunc_Abs_ReturnValue_1) == 0x000050, "Member 'Create002_03_bp_C___iS__::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create002_03_bp_C___iS__, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000054, "Member 'Create002_03_bp_C___iS__::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create002_03_bp_C___iS__, CallFunc_Abs_ReturnValue_2) == 0x000058, "Member 'Create002_03_bp_C___iS__::CallFunc_Abs_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create002_03_bp_C___iS__, CallFunc_MakeVector_ReturnValue) == 0x00005C, "Member 'Create002_03_bp_C___iS__::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function create002_03_bp.create002_03_bp_C.UserConstructionScript
// 0x0150 (0x0150 - 0x0000)
struct Create002_03_bp_C_UserConstructionScript final
{
public:
	bool                                          ___bool_Variable;                                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Variable;                                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ___struct_Variable;                                // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc____________;                              // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable_1;                                // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_3;                // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_4;                // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_5;                // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_6;                // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_7;                // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_8;                // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_9;                // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_10;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_11;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_12;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Select_Default_1;                           // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0110(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create002_03_bp_C_UserConstructionScript) == 0x000010, "Wrong alignment on Create002_03_bp_C_UserConstructionScript");
static_assert(sizeof(Create002_03_bp_C_UserConstructionScript) == 0x000150, "Wrong size on Create002_03_bp_C_UserConstructionScript");
static_assert(offsetof(Create002_03_bp_C_UserConstructionScript, ___bool_Variable) == 0x000000, "Member 'Create002_03_bp_C_UserConstructionScript::___bool_Variable' has a wrong offset!");
static_assert(offsetof(Create002_03_bp_C_UserConstructionScript, ___int_Variable) == 0x000004, "Member 'Create002_03_bp_C_UserConstructionScript::___int_Variable' has a wrong offset!");
static_assert(offsetof(Create002_03_bp_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Create002_03_bp_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
