#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Create002_02_bp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "CollisionType_Enum_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass create002_02_bp.create002_02_bp_C
// 0x0080 (0x02A8 - 0x0228)
class ACreate002_02_bp_C final : public ANoCookConstructionActor
{
public:
	class UBoxComponent*                          Box_Volume;                                        // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            _Y___;                                             // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                _S___;                                             // 0x0240(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EComponentMobility                            _____;                                             // 0x024C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionType_Enum                           ______0;                                           // 0x024D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __q;                                               // 0x024E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ____Mn;                                            // 0x024F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          __Zt_l;                                            // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___P_;                                             // 0x0251(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_252[0x2];                                      // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRandomStream                          ____P;                                             // 0x0254(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor)
	int32                                         ___p_;                                             // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _iS___p;                                           // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _iS___p_0;                                         // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _P___0Minus2;                                      // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     _P_0;                                              // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     _P_1;                                              // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     _P_2;                                              // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __nLightMapRes;                                    // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         _LightMapRes;                                      // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _Td__;                                             // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   Y_____;                                            // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDetailMode                                   Detail_Mode;                                       // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Refresh_Light_Map();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"create002_02_bp_C">();
	}
	static class ACreate002_02_bp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACreate002_02_bp_C>();
	}
};
static_assert(alignof(ACreate002_02_bp_C) == 0x000008, "Wrong alignment on ACreate002_02_bp_C");
static_assert(sizeof(ACreate002_02_bp_C) == 0x0002A8, "Wrong size on ACreate002_02_bp_C");
static_assert(offsetof(ACreate002_02_bp_C, Box_Volume) == 0x000228, "Member 'ACreate002_02_bp_C::Box_Volume' has a wrong offset!");
static_assert(offsetof(ACreate002_02_bp_C, DefaultSceneRoot) == 0x000230, "Member 'ACreate002_02_bp_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ACreate002_02_bp_C, _Y___) == 0x000238, "Member 'ACreate002_02_bp_C::_Y___' has a wrong offset!");
static_assert(offsetof(ACreate002_02_bp_C, _S___) == 0x000240, "Member 'ACreate002_02_bp_C::_S___' has a wrong offset!");
static_assert(offsetof(ACreate002_02_bp_C, _____) == 0x00024C, "Member 'ACreate002_02_bp_C::_____' has a wrong offset!");
static_assert(offsetof(ACreate002_02_bp_C, ______0) == 0x00024D, "Member 'ACreate002_02_bp_C::______0' has a wrong offset!");
static_assert(offsetof(ACreate002_02_bp_C, __q) == 0x00024E, "Member 'ACreate002_02_bp_C::__q' has a wrong offset!");
static_assert(offsetof(ACreate002_02_bp_C, ____Mn) == 0x00024F, "Member 'ACreate002_02_bp_C::____Mn' has a wrong offset!");
static_assert(offsetof(ACreate002_02_bp_C, __Zt_l) == 0x000250, "Member 'ACreate002_02_bp_C::__Zt_l' has a wrong offset!");
static_assert(offsetof(ACreate002_02_bp_C, ___P_) == 0x000251, "Member 'ACreate002_02_bp_C::___P_' has a wrong offset!");
static_assert(offsetof(ACreate002_02_bp_C, ____P) == 0x000254, "Member 'ACreate002_02_bp_C::____P' has a wrong offset!");
static_assert(offsetof(ACreate002_02_bp_C, ___p_) == 0x00025C, "Member 'ACreate002_02_bp_C::___p_' has a wrong offset!");
static_assert(offsetof(ACreate002_02_bp_C, _iS___p) == 0x000260, "Member 'ACreate002_02_bp_C::_iS___p' has a wrong offset!");
static_assert(offsetof(ACreate002_02_bp_C, _iS___p_0) == 0x000264, "Member 'ACreate002_02_bp_C::_iS___p_0' has a wrong offset!");
static_assert(offsetof(ACreate002_02_bp_C, _P___0Minus2) == 0x000268, "Member 'ACreate002_02_bp_C::_P___0Minus2' has a wrong offset!");
static_assert(offsetof(ACreate002_02_bp_C, _P_0) == 0x000270, "Member 'ACreate002_02_bp_C::_P_0' has a wrong offset!");
static_assert(offsetof(ACreate002_02_bp_C, _P_1) == 0x000278, "Member 'ACreate002_02_bp_C::_P_1' has a wrong offset!");
static_assert(offsetof(ACreate002_02_bp_C, _P_2) == 0x000280, "Member 'ACreate002_02_bp_C::_P_2' has a wrong offset!");
static_assert(offsetof(ACreate002_02_bp_C, __nLightMapRes) == 0x000288, "Member 'ACreate002_02_bp_C::__nLightMapRes' has a wrong offset!");
static_assert(offsetof(ACreate002_02_bp_C, _LightMapRes) == 0x00028C, "Member 'ACreate002_02_bp_C::_LightMapRes' has a wrong offset!");
static_assert(offsetof(ACreate002_02_bp_C, _Td__) == 0x000290, "Member 'ACreate002_02_bp_C::_Td__' has a wrong offset!");
static_assert(offsetof(ACreate002_02_bp_C, Y_____) == 0x000298, "Member 'ACreate002_02_bp_C::Y_____' has a wrong offset!");
static_assert(offsetof(ACreate002_02_bp_C, Detail_Mode) == 0x0002A0, "Member 'ACreate002_02_bp_C::Detail_Mode' has a wrong offset!");

}

