#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Create007_01_bp

#include "Basic.hpp"


namespace SDK::Params
{

// Function create007_01_bp.create007_01_bp_C.¾n!‹^'
// 0x0018 (0x0018 - 0x0000)
struct Create007_01_bp_C__n____ final
{
public:
	class UStaticMeshComponent*                   _e__;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_CollisionType_TypeName;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create007_01_bp_C__n____) == 0x000008, "Wrong alignment on Create007_01_bp_C__n____");
static_assert(sizeof(Create007_01_bp_C__n____) == 0x000018, "Wrong size on Create007_01_bp_C__n____");
static_assert(offsetof(Create007_01_bp_C__n____, _e__) == 0x000000, "Member 'Create007_01_bp_C__n____::_e__' has a wrong offset!");
static_assert(offsetof(Create007_01_bp_C__n____, CallFunc_CollisionType_TypeName) == 0x000008, "Member 'Create007_01_bp_C__n____::CallFunc_CollisionType_TypeName' has a wrong offset!");
static_assert(offsetof(Create007_01_bp_C__n____, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000010, "Member 'Create007_01_bp_C__n____::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");

// Function create007_01_bp.create007_01_bp_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct Create007_01_bp_C_UserConstructionScript final
{
public:
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Create007_01_bp_C_UserConstructionScript) == 0x000008, "Wrong alignment on Create007_01_bp_C_UserConstructionScript");
static_assert(sizeof(Create007_01_bp_C_UserConstructionScript) == 0x000018, "Wrong size on Create007_01_bp_C_UserConstructionScript");
static_assert(offsetof(Create007_01_bp_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000000, "Member 'Create007_01_bp_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create007_01_bp_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'Create007_01_bp_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create007_01_bp_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000010, "Member 'Create007_01_bp_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

}

