#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Create004_01_bp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function create004_01_bp.create004_01_bp_C.Refresh Light Map
// 0x0004 (0x0004 - 0x0000)
struct Create004_01_bp_C_Refresh_Light_Map final
{
public:
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes;  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create004_01_bp_C_Refresh_Light_Map) == 0x000004, "Wrong alignment on Create004_01_bp_C_Refresh_Light_Map");
static_assert(sizeof(Create004_01_bp_C_Refresh_Light_Map) == 0x000004, "Wrong size on Create004_01_bp_C_Refresh_Light_Map");
static_assert(offsetof(Create004_01_bp_C_Refresh_Light_Map, CallFunc_SetLightmapResolution_OutNewLightmapRes) == 0x000000, "Member 'Create004_01_bp_C_Refresh_Light_Map::CallFunc_SetLightmapResolution_OutNewLightmapRes' has a wrong offset!");

// Function create004_01_bp.create004_01_bp_C.SetDetailMode
// 0x0010 (0x0010 - 0x0000)
struct Create004_01_bp_C_SetDetailMode final
{
public:
	class UStaticMeshComponent*                   InputPin;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRenderingDetailMode_ReturnValue;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Create004_01_bp_C_SetDetailMode) == 0x000008, "Wrong alignment on Create004_01_bp_C_SetDetailMode");
static_assert(sizeof(Create004_01_bp_C_SetDetailMode) == 0x000010, "Wrong size on Create004_01_bp_C_SetDetailMode");
static_assert(offsetof(Create004_01_bp_C_SetDetailMode, InputPin) == 0x000000, "Member 'Create004_01_bp_C_SetDetailMode::InputPin' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_SetDetailMode, CallFunc_GetRenderingDetailMode_ReturnValue) == 0x000008, "Member 'Create004_01_bp_C_SetDetailMode::CallFunc_GetRenderingDetailMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_SetDetailMode, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000C, "Member 'Create004_01_bp_C_SetDetailMode::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function create004_01_bp.create004_01_bp_C.UserConstructionScript
// 0x01C0 (0x01C0 - 0x0000)
struct Create004_01_bp_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue_1;         // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0080(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_CollisionType_TypeName;                   // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_CollisionType_TypeName_1;                 // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes;  // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue_2;         // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue_3;         // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0180(0x0030)(IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create004_01_bp_C_UserConstructionScript) == 0x000010, "Wrong alignment on Create004_01_bp_C_UserConstructionScript");
static_assert(sizeof(Create004_01_bp_C_UserConstructionScript) == 0x0001C0, "Wrong size on Create004_01_bp_C_UserConstructionScript");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000000, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_Divide_VectorFloat_ReturnValue_1) == 0x00000C, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_Divide_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000018, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x00001C, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000020, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_BreakVector_X_1) == 0x000024, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_BreakVector_Y_1) == 0x000028, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_BreakVector_Z_1) == 0x00002C, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000030, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x00003C, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x000080, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_SelectFloat_ReturnValue) == 0x00010C, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_CollisionType_TypeName) == 0x000110, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_CollisionType_TypeName' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_CollisionType_TypeName_1) == 0x000118, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_CollisionType_TypeName_1' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000120, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000128, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_SetLightmapResolution_OutNewLightmapRes) == 0x000130, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_SetLightmapResolution_OutNewLightmapRes' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000134, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_Divide_VectorFloat_ReturnValue_2) == 0x000138, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_Divide_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_Divide_VectorFloat_ReturnValue_3) == 0x000144, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_Divide_VectorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_BreakVector_X_2) == 0x000150, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_BreakVector_Y_2) == 0x000154, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_BreakVector_Z_2) == 0x000158, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_BreakVector_X_3) == 0x00015C, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_BreakVector_Y_3) == 0x000160, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_BreakVector_Z_3) == 0x000164, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_2) == 0x000168, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_3) == 0x000174, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue_1) == 0x000180, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x0001B0, "Member 'Create004_01_bp_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

// Function create004_01_bp.create004_01_bp_C.ExecuteUbergraph_create004_01_bp
// 0x000C (0x000C - 0x0000)
struct Create004_01_bp_C_ExecuteUbergraph_create004_01_bp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_CollisionType_TypeName;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create004_01_bp_C_ExecuteUbergraph_create004_01_bp) == 0x000004, "Wrong alignment on Create004_01_bp_C_ExecuteUbergraph_create004_01_bp");
static_assert(sizeof(Create004_01_bp_C_ExecuteUbergraph_create004_01_bp) == 0x00000C, "Wrong size on Create004_01_bp_C_ExecuteUbergraph_create004_01_bp");
static_assert(offsetof(Create004_01_bp_C_ExecuteUbergraph_create004_01_bp, EntryPoint) == 0x000000, "Member 'Create004_01_bp_C_ExecuteUbergraph_create004_01_bp::EntryPoint' has a wrong offset!");
static_assert(offsetof(Create004_01_bp_C_ExecuteUbergraph_create004_01_bp, CallFunc_CollisionType_TypeName) == 0x000004, "Member 'Create004_01_bp_C_ExecuteUbergraph_create004_01_bp::CallFunc_CollisionType_TypeName' has a wrong offset!");

}

