#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Create001_01b_bp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass create001_01b_bp.create001_01b_bp_C
// 0x0058 (0x0278 - 0x0220)
class ACreate001_01b_bp_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USplineComponent*                       Spline;                                            // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     _P_;                                               // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __;                                                // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___0;                                              // 0x0241(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ____4;                                             // 0x0242(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          _____;                                             // 0x0243(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          __q;                                               // 0x0244(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ______0;                                           // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___;                                               // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____0;                                             // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____1;                                             // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _Td__;                                             // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DetailMode;                                        // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDetailMode                                   Detail_Mode;                                       // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCableComponent*>                _P;                                                // 0x0268(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Creat_UnlockEnd(int32 PointIndex);
	void Creat_UnlockStart(int32 PointIndex);
	void Creat_a(int32 PointIndex);
	void UserConstructionScript();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_create001_01b_bp(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"create001_01b_bp_C">();
	}
	static class ACreate001_01b_bp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACreate001_01b_bp_C>();
	}
};
static_assert(alignof(ACreate001_01b_bp_C) == 0x000008, "Wrong alignment on ACreate001_01b_bp_C");
static_assert(sizeof(ACreate001_01b_bp_C) == 0x000278, "Wrong size on ACreate001_01b_bp_C");
static_assert(offsetof(ACreate001_01b_bp_C, UberGraphFrame) == 0x000220, "Member 'ACreate001_01b_bp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACreate001_01b_bp_C, Spline) == 0x000228, "Member 'ACreate001_01b_bp_C::Spline' has a wrong offset!");
static_assert(offsetof(ACreate001_01b_bp_C, DefaultSceneRoot) == 0x000230, "Member 'ACreate001_01b_bp_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ACreate001_01b_bp_C, _P_) == 0x000238, "Member 'ACreate001_01b_bp_C::_P_' has a wrong offset!");
static_assert(offsetof(ACreate001_01b_bp_C, __) == 0x000240, "Member 'ACreate001_01b_bp_C::__' has a wrong offset!");
static_assert(offsetof(ACreate001_01b_bp_C, ___0) == 0x000241, "Member 'ACreate001_01b_bp_C::___0' has a wrong offset!");
static_assert(offsetof(ACreate001_01b_bp_C, ____4) == 0x000242, "Member 'ACreate001_01b_bp_C::____4' has a wrong offset!");
static_assert(offsetof(ACreate001_01b_bp_C, _____) == 0x000243, "Member 'ACreate001_01b_bp_C::_____' has a wrong offset!");
static_assert(offsetof(ACreate001_01b_bp_C, __q) == 0x000244, "Member 'ACreate001_01b_bp_C::__q' has a wrong offset!");
static_assert(offsetof(ACreate001_01b_bp_C, ______0) == 0x000248, "Member 'ACreate001_01b_bp_C::______0' has a wrong offset!");
static_assert(offsetof(ACreate001_01b_bp_C, ___) == 0x00024C, "Member 'ACreate001_01b_bp_C::___' has a wrong offset!");
static_assert(offsetof(ACreate001_01b_bp_C, ____0) == 0x000250, "Member 'ACreate001_01b_bp_C::____0' has a wrong offset!");
static_assert(offsetof(ACreate001_01b_bp_C, ____1) == 0x000254, "Member 'ACreate001_01b_bp_C::____1' has a wrong offset!");
static_assert(offsetof(ACreate001_01b_bp_C, _Td__) == 0x000258, "Member 'ACreate001_01b_bp_C::_Td__' has a wrong offset!");
static_assert(offsetof(ACreate001_01b_bp_C, DetailMode) == 0x00025C, "Member 'ACreate001_01b_bp_C::DetailMode' has a wrong offset!");
static_assert(offsetof(ACreate001_01b_bp_C, Detail_Mode) == 0x000260, "Member 'ACreate001_01b_bp_C::Detail_Mode' has a wrong offset!");
static_assert(offsetof(ACreate001_01b_bp_C, _P) == 0x000268, "Member 'ACreate001_01b_bp_C::_P' has a wrong offset!");

}

