#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Create020_01_bp

#include "Basic.hpp"

#include "Snow_Str_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PostFog_Str_structs.hpp"


namespace SDK::Params
{

// Function create020_01_bp.create020_01_bp_C.Ç!¾nê
// 0x0124 (0x0124 - 0x0000)
struct Create020_01_bp_C____n_ final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSnow_Str                              A_p;                                               // 0x0004(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSnow_Str                              B_p;                                               // 0x0064(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x00C4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_4;                       // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_5;                       // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_6;                       // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_7;                       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_8;                       // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_9;                       // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_10;                      // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_11;                      // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_1;            // 0x0104(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_2;            // 0x0114(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create020_01_bp_C____n_) == 0x000004, "Wrong alignment on Create020_01_bp_C____n_");
static_assert(sizeof(Create020_01_bp_C____n_) == 0x000124, "Wrong size on Create020_01_bp_C____n_");
static_assert(offsetof(Create020_01_bp_C____n_, Time) == 0x000000, "Member 'Create020_01_bp_C____n_::Time' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C____n_, A_p) == 0x000004, "Member 'Create020_01_bp_C____n_::A_p' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C____n_, B_p) == 0x000064, "Member 'Create020_01_bp_C____n_::B_p' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C____n_, CallFunc_LinearColorLerp_ReturnValue) == 0x0000C4, "Member 'Create020_01_bp_C____n_::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C____n_, CallFunc_Lerp_ReturnValue) == 0x0000D4, "Member 'Create020_01_bp_C____n_::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C____n_, CallFunc_Lerp_ReturnValue_1) == 0x0000D8, "Member 'Create020_01_bp_C____n_::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C____n_, CallFunc_Lerp_ReturnValue_2) == 0x0000DC, "Member 'Create020_01_bp_C____n_::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C____n_, CallFunc_Lerp_ReturnValue_3) == 0x0000E0, "Member 'Create020_01_bp_C____n_::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C____n_, CallFunc_Lerp_ReturnValue_4) == 0x0000E4, "Member 'Create020_01_bp_C____n_::CallFunc_Lerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C____n_, CallFunc_Lerp_ReturnValue_5) == 0x0000E8, "Member 'Create020_01_bp_C____n_::CallFunc_Lerp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C____n_, CallFunc_Lerp_ReturnValue_6) == 0x0000EC, "Member 'Create020_01_bp_C____n_::CallFunc_Lerp_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C____n_, CallFunc_Lerp_ReturnValue_7) == 0x0000F0, "Member 'Create020_01_bp_C____n_::CallFunc_Lerp_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C____n_, CallFunc_Lerp_ReturnValue_8) == 0x0000F4, "Member 'Create020_01_bp_C____n_::CallFunc_Lerp_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C____n_, CallFunc_Lerp_ReturnValue_9) == 0x0000F8, "Member 'Create020_01_bp_C____n_::CallFunc_Lerp_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C____n_, CallFunc_Lerp_ReturnValue_10) == 0x0000FC, "Member 'Create020_01_bp_C____n_::CallFunc_Lerp_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C____n_, CallFunc_Lerp_ReturnValue_11) == 0x000100, "Member 'Create020_01_bp_C____n_::CallFunc_Lerp_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C____n_, CallFunc_LinearColorLerp_ReturnValue_1) == 0x000104, "Member 'Create020_01_bp_C____n_::CallFunc_LinearColorLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C____n_, CallFunc_LinearColorLerp_ReturnValue_2) == 0x000114, "Member 'Create020_01_bp_C____n_::CallFunc_LinearColorLerp_ReturnValue_2' has a wrong offset!");

// Function create020_01_bp.create020_01_bp_C.„ÈG§êHœ
// 0x0004 (0x0004 - 0x0000)
struct Create020_01_bp_C___G__H_ final
{
public:
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create020_01_bp_C___G__H_) == 0x000004, "Wrong alignment on Create020_01_bp_C___G__H_");
static_assert(sizeof(Create020_01_bp_C___G__H_) == 0x000004, "Wrong size on Create020_01_bp_C___G__H_");
static_assert(offsetof(Create020_01_bp_C___G__H_, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000000, "Member 'Create020_01_bp_C___G__H_::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function create020_01_bp.create020_01_bp_C.¾nêHœ
// 0x0008 (0x0008 - 0x0000)
struct Create020_01_bp_C__n_H_ final
{
public:
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Create020_01_bp_C__n_H_) == 0x000004, "Wrong alignment on Create020_01_bp_C__n_H_");
static_assert(sizeof(Create020_01_bp_C__n_H_) == 0x000008, "Wrong size on Create020_01_bp_C__n_H_");
static_assert(offsetof(Create020_01_bp_C__n_H_, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000000, "Member 'Create020_01_bp_C__n_H_::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C__n_H_, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'Create020_01_bp_C__n_H_::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function create020_01_bp.create020_01_bp_C.bþH
// 0x0024 (0x0024 - 0x0000)
struct Create020_01_bp_C__b_H final
{
public:
	float                                         InputPin;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create020_01_bp_C__b_H) == 0x000004, "Wrong alignment on Create020_01_bp_C__b_H");
static_assert(sizeof(Create020_01_bp_C__b_H) == 0x000024, "Wrong size on Create020_01_bp_C__b_H");
static_assert(offsetof(Create020_01_bp_C__b_H, InputPin) == 0x000000, "Member 'Create020_01_bp_C__b_H::InputPin' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C__b_H, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'Create020_01_bp_C__b_H::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C__b_H, CallFunc_Lerp_ReturnValue_1) == 0x000008, "Member 'Create020_01_bp_C__b_H::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C__b_H, CallFunc_Lerp_ReturnValue_2) == 0x00000C, "Member 'Create020_01_bp_C__b_H::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C__b_H, CallFunc_Lerp_ReturnValue_3) == 0x000010, "Member 'Create020_01_bp_C__b_H::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C__b_H, CallFunc_LinearColorLerp_ReturnValue) == 0x000014, "Member 'Create020_01_bp_C__b_H::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");

// Function create020_01_bp.create020_01_bp_C.UserConstructionScript
// 0x0024 (0x0024 - 0x0000)
struct Create020_01_bp_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostFog_Str                           K2Node_MakeStruct_PostFog_Str;                     // 0x0004(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create020_01_bp_C_UserConstructionScript) == 0x000004, "Wrong alignment on Create020_01_bp_C_UserConstructionScript");
static_assert(sizeof(Create020_01_bp_C_UserConstructionScript) == 0x000024, "Wrong size on Create020_01_bp_C_UserConstructionScript");
static_assert(offsetof(Create020_01_bp_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'Create020_01_bp_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'Create020_01_bp_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C_UserConstructionScript, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000002, "Member 'Create020_01_bp_C_UserConstructionScript::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C_UserConstructionScript, K2Node_MakeStruct_PostFog_Str) == 0x000004, "Member 'Create020_01_bp_C_UserConstructionScript::K2Node_MakeStruct_PostFog_Str' has a wrong offset!");

// Function create020_01_bp.create020_01_bp_C.Snow_OnOFF
// 0x0004 (0x0004 - 0x0000)
struct Create020_01_bp_C_Snow_OnOFF final
{
public:
	float                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create020_01_bp_C_Snow_OnOFF) == 0x000004, "Wrong alignment on Create020_01_bp_C_Snow_OnOFF");
static_assert(sizeof(Create020_01_bp_C_Snow_OnOFF) == 0x000004, "Wrong size on Create020_01_bp_C_Snow_OnOFF");
static_assert(offsetof(Create020_01_bp_C_Snow_OnOFF, EntryPoint) == 0x000000, "Member 'Create020_01_bp_C_Snow_OnOFF::EntryPoint' has a wrong offset!");

// Function create020_01_bp.create020_01_bp_C.G§aÓOnOff
// 0x0004 (0x0004 - 0x0000)
struct Create020_01_bp_C_G_a_OnOff final
{
public:
	float                                         G_;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create020_01_bp_C_G_a_OnOff) == 0x000004, "Wrong alignment on Create020_01_bp_C_G_a_OnOff");
static_assert(sizeof(Create020_01_bp_C_G_a_OnOff) == 0x000004, "Wrong size on Create020_01_bp_C_G_a_OnOff");
static_assert(offsetof(Create020_01_bp_C_G_a_OnOff, G_) == 0x000000, "Member 'Create020_01_bp_C_G_a_OnOff::G_' has a wrong offset!");

// Function create020_01_bp.create020_01_bp_C.ExecuteUbergraph_create020_01_bp
// 0x00A4 (0x00A4 - 0x0000)
struct Create020_01_bp_C_ExecuteUbergraph_create020_01_bp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_1;            // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_____;                           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent___;                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSnow_Str                              K2Node_MakeStruct_Snow_Str;                        // 0x0044(0x0060)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create020_01_bp_C_ExecuteUbergraph_create020_01_bp) == 0x000004, "Wrong alignment on Create020_01_bp_C_ExecuteUbergraph_create020_01_bp");
static_assert(sizeof(Create020_01_bp_C_ExecuteUbergraph_create020_01_bp) == 0x0000A4, "Wrong size on Create020_01_bp_C_ExecuteUbergraph_create020_01_bp");
static_assert(offsetof(Create020_01_bp_C_ExecuteUbergraph_create020_01_bp, EntryPoint) == 0x000000, "Member 'Create020_01_bp_C_ExecuteUbergraph_create020_01_bp::EntryPoint' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C_ExecuteUbergraph_create020_01_bp, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'Create020_01_bp_C_ExecuteUbergraph_create020_01_bp::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C_ExecuteUbergraph_create020_01_bp, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'Create020_01_bp_C_ExecuteUbergraph_create020_01_bp::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C_ExecuteUbergraph_create020_01_bp, CallFunc_LinearColorLerp_ReturnValue) == 0x000008, "Member 'Create020_01_bp_C_ExecuteUbergraph_create020_01_bp::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C_ExecuteUbergraph_create020_01_bp, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'Create020_01_bp_C_ExecuteUbergraph_create020_01_bp::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C_ExecuteUbergraph_create020_01_bp, CallFunc_IsValid_ReturnValue_2) == 0x000019, "Member 'Create020_01_bp_C_ExecuteUbergraph_create020_01_bp::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C_ExecuteUbergraph_create020_01_bp, CallFunc_LinearColorLerp_ReturnValue_1) == 0x00001C, "Member 'Create020_01_bp_C_ExecuteUbergraph_create020_01_bp::CallFunc_LinearColorLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C_ExecuteUbergraph_create020_01_bp, CallFunc_IsValid_ReturnValue_3) == 0x00002C, "Member 'Create020_01_bp_C_ExecuteUbergraph_create020_01_bp::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C_ExecuteUbergraph_create020_01_bp, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000030, "Member 'Create020_01_bp_C_ExecuteUbergraph_create020_01_bp::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C_ExecuteUbergraph_create020_01_bp, K2Node_CustomEvent_____) == 0x000034, "Member 'Create020_01_bp_C_ExecuteUbergraph_create020_01_bp::K2Node_CustomEvent_____' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C_ExecuteUbergraph_create020_01_bp, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000038, "Member 'Create020_01_bp_C_ExecuteUbergraph_create020_01_bp::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C_ExecuteUbergraph_create020_01_bp, K2Node_CustomEvent___) == 0x00003C, "Member 'Create020_01_bp_C_ExecuteUbergraph_create020_01_bp::K2Node_CustomEvent___' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C_ExecuteUbergraph_create020_01_bp, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x000040, "Member 'Create020_01_bp_C_ExecuteUbergraph_create020_01_bp::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create020_01_bp_C_ExecuteUbergraph_create020_01_bp, K2Node_MakeStruct_Snow_Str) == 0x000044, "Member 'Create020_01_bp_C_ExecuteUbergraph_create020_01_bp::K2Node_MakeStruct_Snow_Str' has a wrong offset!");

}

