#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Create003_02_bp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function create003_02_bp.create003_02_bp_C.>)Oû
// 0x0024 (0x0024 - 0x0000)
struct Create003_02_bp_C___O_ final
{
public:
	float                                         _____0;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         T___;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __O__0;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __O__1;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __O_Mn;                                            // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create003_02_bp_C___O_) == 0x000004, "Wrong alignment on Create003_02_bp_C___O_");
static_assert(sizeof(Create003_02_bp_C___O_) == 0x000024, "Wrong size on Create003_02_bp_C___O_");
static_assert(offsetof(Create003_02_bp_C___O_, _____0) == 0x000000, "Member 'Create003_02_bp_C___O_::_____0' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C___O_, T___) == 0x000004, "Member 'Create003_02_bp_C___O_::T___' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C___O_, __O__0) == 0x000008, "Member 'Create003_02_bp_C___O_::__O__0' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C___O_, __O__1) == 0x00000C, "Member 'Create003_02_bp_C___O_::__O__1' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C___O_, __O_Mn) == 0x000010, "Member 'Create003_02_bp_C___O_::__O_Mn' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C___O_, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000014, "Member 'Create003_02_bp_C___O_::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C___O_, CallFunc_Add_FloatFloat_ReturnValue) == 0x000018, "Member 'Create003_02_bp_C___O_::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C___O_, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00001C, "Member 'Create003_02_bp_C___O_::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C___O_, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000020, "Member 'Create003_02_bp_C___O_::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function create003_02_bp.create003_02_bp_C.Refresh Light Map
// 0x0028 (0x0028 - 0x0000)
struct Create003_02_bp_C_Refresh_Light_Map final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes;  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes_1; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes_2; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes_3; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes_4; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes_5; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes_6; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create003_02_bp_C_Refresh_Light_Map) == 0x000004, "Wrong alignment on Create003_02_bp_C_Refresh_Light_Map");
static_assert(sizeof(Create003_02_bp_C_Refresh_Light_Map) == 0x000028, "Wrong size on Create003_02_bp_C_Refresh_Light_Map");
static_assert(offsetof(Create003_02_bp_C_Refresh_Light_Map, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'Create003_02_bp_C_Refresh_Light_Map::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_Refresh_Light_Map, CallFunc_SetLightmapResolution_OutNewLightmapRes) == 0x000004, "Member 'Create003_02_bp_C_Refresh_Light_Map::CallFunc_SetLightmapResolution_OutNewLightmapRes' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_Refresh_Light_Map, CallFunc_IsValid_ReturnValue_1) == 0x000008, "Member 'Create003_02_bp_C_Refresh_Light_Map::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_Refresh_Light_Map, CallFunc_IsValid_ReturnValue_2) == 0x000009, "Member 'Create003_02_bp_C_Refresh_Light_Map::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_Refresh_Light_Map, CallFunc_IsValid_ReturnValue_3) == 0x00000A, "Member 'Create003_02_bp_C_Refresh_Light_Map::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_Refresh_Light_Map, CallFunc_IsValid_ReturnValue_4) == 0x00000B, "Member 'Create003_02_bp_C_Refresh_Light_Map::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_Refresh_Light_Map, CallFunc_IsValid_ReturnValue_5) == 0x00000C, "Member 'Create003_02_bp_C_Refresh_Light_Map::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_Refresh_Light_Map, CallFunc_IsValid_ReturnValue_6) == 0x00000D, "Member 'Create003_02_bp_C_Refresh_Light_Map::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_Refresh_Light_Map, CallFunc_SetLightmapResolution_OutNewLightmapRes_1) == 0x000010, "Member 'Create003_02_bp_C_Refresh_Light_Map::CallFunc_SetLightmapResolution_OutNewLightmapRes_1' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_Refresh_Light_Map, CallFunc_SetLightmapResolution_OutNewLightmapRes_2) == 0x000014, "Member 'Create003_02_bp_C_Refresh_Light_Map::CallFunc_SetLightmapResolution_OutNewLightmapRes_2' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_Refresh_Light_Map, CallFunc_SetLightmapResolution_OutNewLightmapRes_3) == 0x000018, "Member 'Create003_02_bp_C_Refresh_Light_Map::CallFunc_SetLightmapResolution_OutNewLightmapRes_3' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_Refresh_Light_Map, CallFunc_SetLightmapResolution_OutNewLightmapRes_4) == 0x00001C, "Member 'Create003_02_bp_C_Refresh_Light_Map::CallFunc_SetLightmapResolution_OutNewLightmapRes_4' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_Refresh_Light_Map, CallFunc_SetLightmapResolution_OutNewLightmapRes_5) == 0x000020, "Member 'Create003_02_bp_C_Refresh_Light_Map::CallFunc_SetLightmapResolution_OutNewLightmapRes_5' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_Refresh_Light_Map, CallFunc_SetLightmapResolution_OutNewLightmapRes_6) == 0x000024, "Member 'Create003_02_bp_C_Refresh_Light_Map::CallFunc_SetLightmapResolution_OutNewLightmapRes_6' has a wrong offset!");

// Function create003_02_bp.create003_02_bp_C.h@¾n!‹Ê—:ø
// 0x0350 (0x0350 - 0x0000)
struct Create003_02_bp_C_H__n______ final
{
public:
	struct FTransform                             ___struct_Variable;                                // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             ___struct_Variable_1;                              // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue_1;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ___struct_Variable_2;                              // 0x0070(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             ___struct_Variable_3;                              // 0x00A0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue_2;               // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue_3;               // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ___struct_Variable_4;                              // 0x00E0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             ___struct_Variable_5;                              // 0x0110(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue_4;               // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue_5;               // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ___struct_Variable_6;                              // 0x0150(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             ___struct_Variable_7;                              // 0x0180(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue_6;               // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue_7;               // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ___struct_Variable_8;                              // 0x01C0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             ___struct_Variable_9;                              // 0x01F0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue_8;               // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue_9;               // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes;  // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ___struct_Variable_10;                             // 0x0250(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes_1; // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue_10;              // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0292(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0293(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0295(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0296(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0297(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x029D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x029E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x029F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_3;        // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_4;        // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x02A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_5;        // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_11;                // 0x02A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x02A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A7[0x1];                                      // 0x02A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes_2; // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes_3; // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x02B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x02B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B7[0x1];                                      // 0x02B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes_4; // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes_5; // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes_6; // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes_7; // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes_8; // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes_9; // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes_10; // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc____________;                              // 0x02E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_3;              // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F2[0x2];                                      // 0x02F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_____________1;                            // 0x02F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_4;              // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_12;                // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x0302(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x0303(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_9;                  // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_____________2;                            // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_____________3;                            // 0x0314(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_____________4;                            // 0x0320(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_____________5;                            // 0x032C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_____________6;                            // 0x0338(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_5;              // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_6;              // 0x0345(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_7;              // 0x0346(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_8;              // 0x0347(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_9;              // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_10;             // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_13;                // 0x034A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_14;                // 0x034B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_10;                 // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Create003_02_bp_C_H__n______) == 0x000010, "Wrong alignment on Create003_02_bp_C_H__n______");
static_assert(sizeof(Create003_02_bp_C_H__n______) == 0x000350, "Wrong size on Create003_02_bp_C_H__n______");
static_assert(offsetof(Create003_02_bp_C_H__n______, ___struct_Variable) == 0x000000, "Member 'Create003_02_bp_C_H__n______::___struct_Variable' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, ___struct_Variable_1) == 0x000030, "Member 'Create003_02_bp_C_H__n______::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_AddComponent_ReturnValue) == 0x000060, "Member 'Create003_02_bp_C_H__n______::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_AddComponent_ReturnValue_1) == 0x000068, "Member 'Create003_02_bp_C_H__n______::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, ___struct_Variable_2) == 0x000070, "Member 'Create003_02_bp_C_H__n______::___struct_Variable_2' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, ___struct_Variable_3) == 0x0000A0, "Member 'Create003_02_bp_C_H__n______::___struct_Variable_3' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_AddComponent_ReturnValue_2) == 0x0000D0, "Member 'Create003_02_bp_C_H__n______::CallFunc_AddComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_AddComponent_ReturnValue_3) == 0x0000D8, "Member 'Create003_02_bp_C_H__n______::CallFunc_AddComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, ___struct_Variable_4) == 0x0000E0, "Member 'Create003_02_bp_C_H__n______::___struct_Variable_4' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, ___struct_Variable_5) == 0x000110, "Member 'Create003_02_bp_C_H__n______::___struct_Variable_5' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_AddComponent_ReturnValue_4) == 0x000140, "Member 'Create003_02_bp_C_H__n______::CallFunc_AddComponent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_AddComponent_ReturnValue_5) == 0x000148, "Member 'Create003_02_bp_C_H__n______::CallFunc_AddComponent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, ___struct_Variable_6) == 0x000150, "Member 'Create003_02_bp_C_H__n______::___struct_Variable_6' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, ___struct_Variable_7) == 0x000180, "Member 'Create003_02_bp_C_H__n______::___struct_Variable_7' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_AddComponent_ReturnValue_6) == 0x0001B0, "Member 'Create003_02_bp_C_H__n______::CallFunc_AddComponent_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_AddComponent_ReturnValue_7) == 0x0001B8, "Member 'Create003_02_bp_C_H__n______::CallFunc_AddComponent_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, ___struct_Variable_8) == 0x0001C0, "Member 'Create003_02_bp_C_H__n______::___struct_Variable_8' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, ___struct_Variable_9) == 0x0001F0, "Member 'Create003_02_bp_C_H__n______::___struct_Variable_9' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_AddComponent_ReturnValue_8) == 0x000220, "Member 'Create003_02_bp_C_H__n______::CallFunc_AddComponent_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_AddComponent_ReturnValue_9) == 0x000228, "Member 'Create003_02_bp_C_H__n______::CallFunc_AddComponent_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000230, "Member 'Create003_02_bp_C_H__n______::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_SelectFloat_ReturnValue) == 0x000238, "Member 'Create003_02_bp_C_H__n______::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000240, "Member 'Create003_02_bp_C_H__n______::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_SetLightmapResolution_OutNewLightmapRes) == 0x000248, "Member 'Create003_02_bp_C_H__n______::CallFunc_SetLightmapResolution_OutNewLightmapRes' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, ___struct_Variable_10) == 0x000250, "Member 'Create003_02_bp_C_H__n______::___struct_Variable_10' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_SetLightmapResolution_OutNewLightmapRes_1) == 0x000280, "Member 'Create003_02_bp_C_H__n______::CallFunc_SetLightmapResolution_OutNewLightmapRes_1' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_AddComponent_ReturnValue_10) == 0x000288, "Member 'Create003_02_bp_C_H__n______::CallFunc_AddComponent_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanAND_ReturnValue) == 0x000290, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanAND_ReturnValue_1) == 0x000291, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanAND_ReturnValue_2) == 0x000292, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanOR_ReturnValue) == 0x000293, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanOR_ReturnValue_1) == 0x000294, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanOR_ReturnValue_2) == 0x000295, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanAND_ReturnValue_3) == 0x000296, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanAND_ReturnValue_4) == 0x000297, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanAND_ReturnValue_5) == 0x000298, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanAND_ReturnValue_6) == 0x000299, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanAND_ReturnValue_7) == 0x00029A, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanAND_ReturnValue_8) == 0x00029B, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanAND_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanAND_ReturnValue_9) == 0x00029C, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanAND_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanAND_ReturnValue_10) == 0x00029D, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanAND_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00029E, "Member 'Create003_02_bp_C_H__n______::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x00029F, "Member 'Create003_02_bp_C_H__n______::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_GreaterEqual_IntInt_ReturnValue_2) == 0x0002A0, "Member 'Create003_02_bp_C_H__n______::CallFunc_GreaterEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_GreaterEqual_IntInt_ReturnValue_3) == 0x0002A1, "Member 'Create003_02_bp_C_H__n______::CallFunc_GreaterEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_GreaterEqual_IntInt_ReturnValue_4) == 0x0002A2, "Member 'Create003_02_bp_C_H__n______::CallFunc_GreaterEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanOR_ReturnValue_3) == 0x0002A3, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_GreaterEqual_IntInt_ReturnValue_5) == 0x0002A4, "Member 'Create003_02_bp_C_H__n______::CallFunc_GreaterEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanAND_ReturnValue_11) == 0x0002A5, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanAND_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_SetStaticMesh_ReturnValue) == 0x0002A6, "Member 'Create003_02_bp_C_H__n______::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_SetLightmapResolution_OutNewLightmapRes_2) == 0x0002A8, "Member 'Create003_02_bp_C_H__n______::CallFunc_SetLightmapResolution_OutNewLightmapRes_2' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_SetStaticMesh_ReturnValue_1) == 0x0002AC, "Member 'Create003_02_bp_C_H__n______::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_SetLightmapResolution_OutNewLightmapRes_3) == 0x0002B0, "Member 'Create003_02_bp_C_H__n______::CallFunc_SetLightmapResolution_OutNewLightmapRes_3' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanOR_ReturnValue_4) == 0x0002B4, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanOR_ReturnValue_5) == 0x0002B5, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanOR_ReturnValue_6) == 0x0002B6, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanOR_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_SetLightmapResolution_OutNewLightmapRes_4) == 0x0002B8, "Member 'Create003_02_bp_C_H__n______::CallFunc_SetLightmapResolution_OutNewLightmapRes_4' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_SelectFloat_ReturnValue_1) == 0x0002BC, "Member 'Create003_02_bp_C_H__n______::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_SetLightmapResolution_OutNewLightmapRes_5) == 0x0002C0, "Member 'Create003_02_bp_C_H__n______::CallFunc_SetLightmapResolution_OutNewLightmapRes_5' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_SetLightmapResolution_OutNewLightmapRes_6) == 0x0002C4, "Member 'Create003_02_bp_C_H__n______::CallFunc_SetLightmapResolution_OutNewLightmapRes_6' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_SetLightmapResolution_OutNewLightmapRes_7) == 0x0002C8, "Member 'Create003_02_bp_C_H__n______::CallFunc_SetLightmapResolution_OutNewLightmapRes_7' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_SetLightmapResolution_OutNewLightmapRes_8) == 0x0002CC, "Member 'Create003_02_bp_C_H__n______::CallFunc_SetLightmapResolution_OutNewLightmapRes_8' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_SetLightmapResolution_OutNewLightmapRes_9) == 0x0002D0, "Member 'Create003_02_bp_C_H__n______::CallFunc_SetLightmapResolution_OutNewLightmapRes_9' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_SetLightmapResolution_OutNewLightmapRes_10) == 0x0002D4, "Member 'Create003_02_bp_C_H__n______::CallFunc_SetLightmapResolution_OutNewLightmapRes_10' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x0002D8, "Member 'Create003_02_bp_C_H__n______::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_SelectFloat_ReturnValue_2) == 0x0002E0, "Member 'Create003_02_bp_C_H__n______::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc____________) == 0x0002E4, "Member 'Create003_02_bp_C_H__n______::CallFunc____________' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_SetStaticMesh_ReturnValue_2) == 0x0002F0, "Member 'Create003_02_bp_C_H__n______::CallFunc_SetStaticMesh_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_SetStaticMesh_ReturnValue_3) == 0x0002F1, "Member 'Create003_02_bp_C_H__n______::CallFunc_SetStaticMesh_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_____________1) == 0x0002F4, "Member 'Create003_02_bp_C_H__n______::CallFunc_____________1' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_SetStaticMesh_ReturnValue_4) == 0x000300, "Member 'Create003_02_bp_C_H__n______::CallFunc_SetStaticMesh_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanAND_ReturnValue_12) == 0x000301, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanAND_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanOR_ReturnValue_7) == 0x000302, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanOR_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanOR_ReturnValue_8) == 0x000303, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanOR_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanOR_ReturnValue_9) == 0x000304, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanOR_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_____________2) == 0x000308, "Member 'Create003_02_bp_C_H__n______::CallFunc_____________2' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_____________3) == 0x000314, "Member 'Create003_02_bp_C_H__n______::CallFunc_____________3' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_____________4) == 0x000320, "Member 'Create003_02_bp_C_H__n______::CallFunc_____________4' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_____________5) == 0x00032C, "Member 'Create003_02_bp_C_H__n______::CallFunc_____________5' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_____________6) == 0x000338, "Member 'Create003_02_bp_C_H__n______::CallFunc_____________6' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_SetStaticMesh_ReturnValue_5) == 0x000344, "Member 'Create003_02_bp_C_H__n______::CallFunc_SetStaticMesh_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_SetStaticMesh_ReturnValue_6) == 0x000345, "Member 'Create003_02_bp_C_H__n______::CallFunc_SetStaticMesh_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_SetStaticMesh_ReturnValue_7) == 0x000346, "Member 'Create003_02_bp_C_H__n______::CallFunc_SetStaticMesh_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_SetStaticMesh_ReturnValue_8) == 0x000347, "Member 'Create003_02_bp_C_H__n______::CallFunc_SetStaticMesh_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_SetStaticMesh_ReturnValue_9) == 0x000348, "Member 'Create003_02_bp_C_H__n______::CallFunc_SetStaticMesh_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_SetStaticMesh_ReturnValue_10) == 0x000349, "Member 'Create003_02_bp_C_H__n______::CallFunc_SetStaticMesh_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanAND_ReturnValue_13) == 0x00034A, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanAND_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanAND_ReturnValue_14) == 0x00034B, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanAND_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C_H__n______, CallFunc_BooleanOR_ReturnValue_10) == 0x00034C, "Member 'Create003_02_bp_C_H__n______::CallFunc_BooleanOR_ReturnValue_10' has a wrong offset!");

// Function create003_02_bp.create003_02_bp_C.¾n!‹^'
// 0x0010 (0x0010 - 0x0000)
struct Create003_02_bp_C__n____ final
{
public:
	class UHierarchicalInstancedStaticMeshComponent* _e__;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_CollisionType_TypeName;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create003_02_bp_C__n____) == 0x000008, "Wrong alignment on Create003_02_bp_C__n____");
static_assert(sizeof(Create003_02_bp_C__n____) == 0x000010, "Wrong size on Create003_02_bp_C__n____");
static_assert(offsetof(Create003_02_bp_C__n____, _e__) == 0x000000, "Member 'Create003_02_bp_C__n____::_e__' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C__n____, CallFunc_CollisionType_TypeName) == 0x000008, "Member 'Create003_02_bp_C__n____::CallFunc_CollisionType_TypeName' has a wrong offset!");

// Function create003_02_bp.create003_02_bp_C.·ÖiS:ø
// 0x0068 (0x0068 - 0x0000)
struct Create003_02_bp_C___iS__ final
{
public:
	class UStaticMeshComponent*                   _e____;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                _____0;                                            // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalBounds_Min;                       // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalBounds_Max;                       // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_2;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create003_02_bp_C___iS__) == 0x000008, "Wrong alignment on Create003_02_bp_C___iS__");
static_assert(sizeof(Create003_02_bp_C___iS__) == 0x000068, "Wrong size on Create003_02_bp_C___iS__");
static_assert(offsetof(Create003_02_bp_C___iS__, _e____) == 0x000000, "Member 'Create003_02_bp_C___iS__::_e____' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C___iS__, _____0) == 0x000008, "Member 'Create003_02_bp_C___iS__::_____0' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C___iS__, CallFunc_GetLocalBounds_Min) == 0x000014, "Member 'Create003_02_bp_C___iS__::CallFunc_GetLocalBounds_Min' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C___iS__, CallFunc_GetLocalBounds_Max) == 0x000020, "Member 'Create003_02_bp_C___iS__::CallFunc_GetLocalBounds_Max' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C___iS__, CallFunc_BreakVector_X) == 0x00002C, "Member 'Create003_02_bp_C___iS__::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C___iS__, CallFunc_BreakVector_Y) == 0x000030, "Member 'Create003_02_bp_C___iS__::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C___iS__, CallFunc_BreakVector_Z) == 0x000034, "Member 'Create003_02_bp_C___iS__::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C___iS__, CallFunc_BreakVector_X_1) == 0x000038, "Member 'Create003_02_bp_C___iS__::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C___iS__, CallFunc_BreakVector_Y_1) == 0x00003C, "Member 'Create003_02_bp_C___iS__::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C___iS__, CallFunc_BreakVector_Z_1) == 0x000040, "Member 'Create003_02_bp_C___iS__::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C___iS__, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000044, "Member 'Create003_02_bp_C___iS__::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C___iS__, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000048, "Member 'Create003_02_bp_C___iS__::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C___iS__, CallFunc_Abs_ReturnValue) == 0x00004C, "Member 'Create003_02_bp_C___iS__::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C___iS__, CallFunc_Abs_ReturnValue_1) == 0x000050, "Member 'Create003_02_bp_C___iS__::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C___iS__, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000054, "Member 'Create003_02_bp_C___iS__::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C___iS__, CallFunc_Abs_ReturnValue_2) == 0x000058, "Member 'Create003_02_bp_C___iS__::CallFunc_Abs_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create003_02_bp_C___iS__, CallFunc_MakeVector_ReturnValue) == 0x00005C, "Member 'Create003_02_bp_C___iS__::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function create003_02_bp.create003_02_bp_C.UserConstructionScript
// 0x1820 (0x1820 - 0x0000)
struct Create003_02_bp_C_UserConstructionScript final
{
public:
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable;                                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_5;             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_6;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_3;                // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_7;             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_8;             // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
