#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Create003_03_bp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CollisionType_Enum_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass create003_03_bp.create003_03_bp_C
// 0x00B8 (0x02D8 - 0x0220)
class ACreate003_03_bp_C final : public ANoCookConstructionActor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            ___A;                                              // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            ___B;                                              // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            _4___;                                             // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _P___O_;                                           // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Four__;                                            // 0x0241(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___;                                               // 0x0242(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___l180;                                           // 0x0243(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ABi___;                                            // 0x0244(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ____;                                              // 0x0245(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TS____;                                            // 0x0246(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          __Zt_l;                                            // 0x0247(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EComponentMobility                            _____;                                             // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionType_Enum                           ______0;                                           // 0x0249(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __q;                                               // 0x024A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24B[0x1];                                      // 0x024B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ______1;                                           // 0x024C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               __l__;                                             // 0x0258(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         _Star_Starp;                                       // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___e_;                                             // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _4_O_;                                             // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ______2;                                           // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          ____P;                                             // 0x0274(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor)
	float                                         _iS___p;                                           // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _iS___p_0;                                         // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __A__;                                             // 0x0284(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* __A___0;                                           // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* __B__;                                             // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __nLightMapRes;                                    // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         _LMR___A;                                          // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _LMR___B;                                          // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _LMR_4_;                                           // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _Td__;                                             // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDetailMode                                   Detail_Mode;                                       // 0x02B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DetailMode;                                        // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHierarchicalInstancedStaticMeshComponent* __4___;                                            // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Four_____;                                         // 0x02C8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Refresh_Light_Map();
	void ______(ECollisionType_Enum _____0, class FName* NewVar_0);
	void H__n______();
	void _n____(class UHierarchicalInstancedStaticMeshComponent* _e__);
	void __iS__(class UStaticMeshComponent* _e____, struct FVector* _____0);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"create003_03_bp_C">();
	}
	static class ACreate003_03_bp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACreate003_03_bp_C>();
	}
};
static_assert(alignof(ACreate003_03_bp_C) == 0x000008, "Wrong alignment on ACreate003_03_bp_C");
static_assert(sizeof(ACreate003_03_bp_C) == 0x0002D8, "Wrong size on ACreate003_03_bp_C");
static_assert(offsetof(ACreate003_03_bp_C, DefaultSceneRoot) == 0x000220, "Member 'ACreate003_03_bp_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, ___A) == 0x000228, "Member 'ACreate003_03_bp_C::___A' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, ___B) == 0x000230, "Member 'ACreate003_03_bp_C::___B' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, _4___) == 0x000238, "Member 'ACreate003_03_bp_C::_4___' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, _P___O_) == 0x000240, "Member 'ACreate003_03_bp_C::_P___O_' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, Four__) == 0x000241, "Member 'ACreate003_03_bp_C::Four__' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, ___) == 0x000242, "Member 'ACreate003_03_bp_C::___' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, ___l180) == 0x000243, "Member 'ACreate003_03_bp_C::___l180' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, ABi___) == 0x000244, "Member 'ACreate003_03_bp_C::ABi___' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, ____) == 0x000245, "Member 'ACreate003_03_bp_C::____' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, TS____) == 0x000246, "Member 'ACreate003_03_bp_C::TS____' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, __Zt_l) == 0x000247, "Member 'ACreate003_03_bp_C::__Zt_l' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, _____) == 0x000248, "Member 'ACreate003_03_bp_C::_____' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, ______0) == 0x000249, "Member 'ACreate003_03_bp_C::______0' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, __q) == 0x00024A, "Member 'ACreate003_03_bp_C::__q' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, ______1) == 0x00024C, "Member 'ACreate003_03_bp_C::______1' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, __l__) == 0x000258, "Member 'ACreate003_03_bp_C::__l__' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, _Star_Starp) == 0x000264, "Member 'ACreate003_03_bp_C::_Star_Starp' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, ___e_) == 0x000268, "Member 'ACreate003_03_bp_C::___e_' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, _4_O_) == 0x00026C, "Member 'ACreate003_03_bp_C::_4_O_' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, ______2) == 0x000270, "Member 'ACreate003_03_bp_C::______2' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, ____P) == 0x000274, "Member 'ACreate003_03_bp_C::____P' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, _iS___p) == 0x00027C, "Member 'ACreate003_03_bp_C::_iS___p' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, _iS___p_0) == 0x000280, "Member 'ACreate003_03_bp_C::_iS___p_0' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, __A__) == 0x000284, "Member 'ACreate003_03_bp_C::__A__' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, __A___0) == 0x000290, "Member 'ACreate003_03_bp_C::__A___0' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, __B__) == 0x000298, "Member 'ACreate003_03_bp_C::__B__' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, __nLightMapRes) == 0x0002A0, "Member 'ACreate003_03_bp_C::__nLightMapRes' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, _LMR___A) == 0x0002A4, "Member 'ACreate003_03_bp_C::_LMR___A' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, _LMR___B) == 0x0002A8, "Member 'ACreate003_03_bp_C::_LMR___B' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, _LMR_4_) == 0x0002AC, "Member 'ACreate003_03_bp_C::_LMR_4_' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, _Td__) == 0x0002B0, "Member 'ACreate003_03_bp_C::_Td__' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, Detail_Mode) == 0x0002B4, "Member 'ACreate003_03_bp_C::Detail_Mode' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, DetailMode) == 0x0002B8, "Member 'ACreate003_03_bp_C::DetailMode' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, __4___) == 0x0002C0, "Member 'ACreate003_03_bp_C::__4___' has a wrong offset!");
static_assert(offsetof(ACreate003_03_bp_C, Four_____) == 0x0002C8, "Member 'ACreate003_03_bp_C::Four_____' has a wrong offset!");

}

