#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Create002_01_bp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "CollisionType_Enum_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass create002_01_bp.create002_01_bp_C
// 0x0080 (0x02A0 - 0x0220)
class ACreate002_01_bp_C final : public ANoCookConstructionActor
{
public:
	class UBoxComponent*                          Box_Volume;                                        // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            _Y___;                                             // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                _S___;                                             // 0x0238(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EComponentMobility                            _____;                                             // 0x0244(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionType_Enum                           ______0;                                           // 0x0245(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __q;                                               // 0x0246(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          EightD0b;                                          // 0x0247(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___0hb;                                            // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ____Mn;                                            // 0x0249(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          __Zt_l;                                            // 0x024A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          __XYt_l;                                           // 0x024B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRandomStream                          ____P;                                             // 0x024C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor)
	int32                                         ___p_;                                             // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _iS___p;                                           // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _iS___p_0;                                         // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___O___;                                           // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _iSXY_lP6;                                         // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __nLightMapRes;                                    // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         _LightMapRes;                                      // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _Td__;                                             // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHierarchicalInstancedStaticMeshComponent* Instance____;                                      // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDetailMode                                   Detail_Mode;                                       // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ______;                                            // 0x0284(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                _______0;                                          // 0x0290(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___Decale;                                         // 0x029C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void Refresh_Light_Map();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"create002_01_bp_C">();
	}
	static class ACreate002_01_bp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACreate002_01_bp_C>();
	}
};
static_assert(alignof(ACreate002_01_bp_C) == 0x000008, "Wrong alignment on ACreate002_01_bp_C");
static_assert(sizeof(ACreate002_01_bp_C) == 0x0002A0, "Wrong size on ACreate002_01_bp_C");
static_assert(offsetof(ACreate002_01_bp_C, Box_Volume) == 0x000220, "Member 'ACreate002_01_bp_C::Box_Volume' has a wrong offset!");
static_assert(offsetof(ACreate002_01_bp_C, DefaultSceneRoot) == 0x000228, "Member 'ACreate002_01_bp_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ACreate002_01_bp_C, _Y___) == 0x000230, "Member 'ACreate002_01_bp_C::_Y___' has a wrong offset!");
static_assert(offsetof(ACreate002_01_bp_C, _S___) == 0x000238, "Member 'ACreate002_01_bp_C::_S___' has a wrong offset!");
static_assert(offsetof(ACreate002_01_bp_C, _____) == 0x000244, "Member 'ACreate002_01_bp_C::_____' has a wrong offset!");
static_assert(offsetof(ACreate002_01_bp_C, ______0) == 0x000245, "Member 'ACreate002_01_bp_C::______0' has a wrong offset!");
static_assert(offsetof(ACreate002_01_bp_C, __q) == 0x000246, "Member 'ACreate002_01_bp_C::__q' has a wrong offset!");
static_assert(offsetof(ACreate002_01_bp_C, EightD0b) == 0x000247, "Member 'ACreate002_01_bp_C::EightD0b' has a wrong offset!");
static_assert(offsetof(ACreate002_01_bp_C, ___0hb) == 0x000248, "Member 'ACreate002_01_bp_C::___0hb' has a wrong offset!");
static_assert(offsetof(ACreate002_01_bp_C, ____Mn) == 0x000249, "Member 'ACreate002_01_bp_C::____Mn' has a wrong offset!");
static_assert(offsetof(ACreate002_01_bp_C, __Zt_l) == 0x00024A, "Member 'ACreate002_01_bp_C::__Zt_l' has a wrong offset!");
static_assert(offsetof(ACreate002_01_bp_C, __XYt_l) == 0x00024B, "Member 'ACreate002_01_bp_C::__XYt_l' has a wrong offset!");
static_assert(offsetof(ACreate002_01_bp_C, ____P) == 0x00024C, "Member 'ACreate002_01_bp_C::____P' has a wrong offset!");
static_assert(offsetof(ACreate002_01_bp_C, ___p_) == 0x000254, "Member 'ACreate002_01_bp_C::___p_' has a wrong offset!");
static_assert(offsetof(ACreate002_01_bp_C, _iS___p) == 0x000258, "Member 'ACreate002_01_bp_C::_iS___p' has a wrong offset!");
static_assert(offsetof(ACreate002_01_bp_C, _iS___p_0) == 0x00025C, "Member 'ACreate002_01_bp_C::_iS___p_0' has a wrong offset!");
static_assert(offsetof(ACreate002_01_bp_C, ___O___) == 0x000260, "Member 'ACreate002_01_bp_C::___O___' has a wrong offset!");
static_assert(offsetof(ACreate002_01_bp_C, _iSXY_lP6) == 0x000264, "Member 'ACreate002_01_bp_C::_iSXY_lP6' has a wrong offset!");
static_assert(offsetof(ACreate002_01_bp_C, __nLightMapRes) == 0x000268, "Member 'ACreate002_01_bp_C::__nLightMapRes' has a wrong offset!");
static_assert(offsetof(ACreate002_01_bp_C, _LightMapRes) == 0x00026C, "Member 'ACreate002_01_bp_C::_LightMapRes' has a wrong offset!");
static_assert(offsetof(ACreate002_01_bp_C, _Td__) == 0x000270, "Member 'ACreate002_01_bp_C::_Td__' has a wrong offset!");
static_assert(offsetof(ACreate002_01_bp_C, Instance____) == 0x000278, "Member 'ACreate002_01_bp_C::Instance____' has a wrong offset!");
static_assert(offsetof(ACreate002_01_bp_C, Detail_Mode) == 0x000280, "Member 'ACreate002_01_bp_C::Detail_Mode' has a wrong offset!");
static_assert(offsetof(ACreate002_01_bp_C, ______) == 0x000284, "Member 'ACreate002_01_bp_C::______' has a wrong offset!");
static_assert(offsetof(ACreate002_01_bp_C, _______0) == 0x000290, "Member 'ACreate002_01_bp_C::_______0' has a wrong offset!");
static_assert(offsetof(ACreate002_01_bp_C, ___Decale) == 0x00029C, "Member 'ACreate002_01_bp_C::___Decale' has a wrong offset!");

}

