#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Create004_01_bp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CollisionType_Enum_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass create004_01_bp.create004_01_bp_C
// 0x00A8 (0x02C8 - 0x0220)
class ACreate004_01_bp_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBlockPushComponent_Box*                BlockBox;                                          // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            ____;                                              // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     _bP_;                                              // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                _S___;                                             // 0x0248(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EComponentMobility                            _____;                                             // 0x0254(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionType_Enum                           ______0;                                           // 0x0255(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_256[0x2];                                      // 0x0256(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      __ni_P_;                                           // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionType_Enum                           ______1;                                           // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __q;                                               // 0x0261(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          __nLightMapRes;                                    // 0x0262(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_263[0x1];                                      // 0x0263(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         _LightMapRes;                                      // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _Td__;                                             // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               _BaseColor;                                        // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               _Normal;                                           // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           _Color;                                            // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _ColorScale;                                       // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Roughness_Scale;                                   // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SnowScale;                                         // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _UV_Scale;                                         // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _UV_Rotator;                                       // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ____a__;                                           // 0x02A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _UV___RB;                                          // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         _UV___GB;                                          // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UStaticMeshComponent*                   __;                                                // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDetailMode                                   Detail_Mode;                                       // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DetailMode;                                        // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ___P_;                                             // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Refresh_Light_Map();
	void SetDetailMode(class UStaticMeshComponent* InputPin);
	void UserConstructionScript();
	void Snow7_();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_create004_01_bp(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"create004_01_bp_C">();
	}
	static class ACreate004_01_bp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACreate004_01_bp_C>();
	}
};
static_assert(alignof(ACreate004_01_bp_C) == 0x000008, "Wrong alignment on ACreate004_01_bp_C");
static_assert(sizeof(ACreate004_01_bp_C) == 0x0002C8, "Wrong size on ACreate004_01_bp_C");
static_assert(offsetof(ACreate004_01_bp_C, UberGraphFrame) == 0x000220, "Member 'ACreate004_01_bp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, BlockBox) == 0x000228, "Member 'ACreate004_01_bp_C::BlockBox' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, DefaultSceneRoot) == 0x000230, "Member 'ACreate004_01_bp_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, ____) == 0x000238, "Member 'ACreate004_01_bp_C::____' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, _bP_) == 0x000240, "Member 'ACreate004_01_bp_C::_bP_' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, _S___) == 0x000248, "Member 'ACreate004_01_bp_C::_S___' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, _____) == 0x000254, "Member 'ACreate004_01_bp_C::_____' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, ______0) == 0x000255, "Member 'ACreate004_01_bp_C::______0' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, __ni_P_) == 0x000258, "Member 'ACreate004_01_bp_C::__ni_P_' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, ______1) == 0x000260, "Member 'ACreate004_01_bp_C::______1' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, __q) == 0x000261, "Member 'ACreate004_01_bp_C::__q' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, __nLightMapRes) == 0x000262, "Member 'ACreate004_01_bp_C::__nLightMapRes' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, _LightMapRes) == 0x000264, "Member 'ACreate004_01_bp_C::_LightMapRes' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, _Td__) == 0x000268, "Member 'ACreate004_01_bp_C::_Td__' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, _BaseColor) == 0x000270, "Member 'ACreate004_01_bp_C::_BaseColor' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, _Normal) == 0x000278, "Member 'ACreate004_01_bp_C::_Normal' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, _Color) == 0x000280, "Member 'ACreate004_01_bp_C::_Color' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, _ColorScale) == 0x000290, "Member 'ACreate004_01_bp_C::_ColorScale' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, Roughness_Scale) == 0x000294, "Member 'ACreate004_01_bp_C::Roughness_Scale' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, SnowScale) == 0x000298, "Member 'ACreate004_01_bp_C::SnowScale' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, _UV_Scale) == 0x00029C, "Member 'ACreate004_01_bp_C::_UV_Scale' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, _UV_Rotator) == 0x0002A0, "Member 'ACreate004_01_bp_C::_UV_Rotator' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, ____a__) == 0x0002A4, "Member 'ACreate004_01_bp_C::____a__' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, _UV___RB) == 0x0002A8, "Member 'ACreate004_01_bp_C::_UV___RB' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, _UV___GB) == 0x0002AC, "Member 'ACreate004_01_bp_C::_UV___GB' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, __) == 0x0002B0, "Member 'ACreate004_01_bp_C::__' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, Detail_Mode) == 0x0002B8, "Member 'ACreate004_01_bp_C::Detail_Mode' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, DetailMode) == 0x0002BC, "Member 'ACreate004_01_bp_C::DetailMode' has a wrong offset!");
static_assert(offsetof(ACreate004_01_bp_C, ___P_) == 0x0002C0, "Member 'ACreate004_01_bp_C::___P_' has a wrong offset!");

}

