#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Create004_02_bp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function create004_02_bp.create004_02_bp_C.Initialization
// 0x0008 (0x0008 - 0x0000)
struct Create004_02_bp_C_Initialization final
{
public:
	class FName                                   CallFunc_CollisionType_TypeName;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create004_02_bp_C_Initialization) == 0x000004, "Wrong alignment on Create004_02_bp_C_Initialization");
static_assert(sizeof(Create004_02_bp_C_Initialization) == 0x000008, "Wrong size on Create004_02_bp_C_Initialization");
static_assert(offsetof(Create004_02_bp_C_Initialization, CallFunc_CollisionType_TypeName) == 0x000000, "Member 'Create004_02_bp_C_Initialization::CallFunc_CollisionType_TypeName' has a wrong offset!");

// Function create004_02_bp.create004_02_bp_C.Refresh Light Map
// 0x0004 (0x0004 - 0x0000)
struct Create004_02_bp_C_Refresh_Light_Map final
{
public:
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes;  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create004_02_bp_C_Refresh_Light_Map) == 0x000004, "Wrong alignment on Create004_02_bp_C_Refresh_Light_Map");
static_assert(sizeof(Create004_02_bp_C_Refresh_Light_Map) == 0x000004, "Wrong size on Create004_02_bp_C_Refresh_Light_Map");
static_assert(offsetof(Create004_02_bp_C_Refresh_Light_Map, CallFunc_SetLightmapResolution_OutNewLightmapRes) == 0x000000, "Member 'Create004_02_bp_C_Refresh_Light_Map::CallFunc_SetLightmapResolution_OutNewLightmapRes' has a wrong offset!");

// Function create004_02_bp.create004_02_bp_C.SetDetailMode
// 0x0010 (0x0010 - 0x0000)
struct Create004_02_bp_C_SetDetailMode final
{
public:
	class UStaticMeshComponent*                   InputPin;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRenderingDetailMode_ReturnValue;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Create004_02_bp_C_SetDetailMode) == 0x000008, "Wrong alignment on Create004_02_bp_C_SetDetailMode");
static_assert(sizeof(Create004_02_bp_C_SetDetailMode) == 0x000010, "Wrong size on Create004_02_bp_C_SetDetailMode");
static_assert(offsetof(Create004_02_bp_C_SetDetailMode, InputPin) == 0x000000, "Member 'Create004_02_bp_C_SetDetailMode::InputPin' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_SetDetailMode, CallFunc_GetRenderingDetailMode_ReturnValue) == 0x000008, "Member 'Create004_02_bp_C_SetDetailMode::CallFunc_GetRenderingDetailMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_SetDetailMode, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000C, "Member 'Create004_02_bp_C_SetDetailMode::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function create004_02_bp.create004_02_bp_C.UserConstructionScript
// 0x01F0 (0x01F0 - 0x0000)
struct Create004_02_bp_C_UserConstructionScript final
{
public:
	class FName                                   CallFunc_CollisionType_TypeName;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes;  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue_1;         // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0xC];                                       // 0x0054(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_CollisionType_TypeName_1;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue_2;         // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue_3;         // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes_1; // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0110(0x0030)(IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0148(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_CollisionType_TypeName_2;                 // 0x01DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create004_02_bp_C_UserConstructionScript) == 0x000010, "Wrong alignment on Create004_02_bp_C_UserConstructionScript");
static_assert(sizeof(Create004_02_bp_C_UserConstructionScript) == 0x0001F0, "Wrong size on Create004_02_bp_C_UserConstructionScript");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_CollisionType_TypeName) == 0x000000, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_CollisionType_TypeName' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_SetLightmapResolution_OutNewLightmapRes) == 0x000008, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_SetLightmapResolution_OutNewLightmapRes' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_Divide_VectorFloat_ReturnValue) == 0x00000C, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000018, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x00001C, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000020, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_Divide_VectorFloat_ReturnValue_1) == 0x000024, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_Divide_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000030, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_BreakVector_X_1) == 0x00003C, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_BreakVector_Y_1) == 0x000040, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_BreakVector_Z_1) == 0x000044, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x000048, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_SelectFloat_ReturnValue) == 0x000090, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000098, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_CollisionType_TypeName_1) == 0x0000A0, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_CollisionType_TypeName_1' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x0000A8, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_1) == 0x0000A9, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_SelectFloat_ReturnValue_1) == 0x0000AC, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000B0, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000B8, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_Divide_VectorFloat_ReturnValue_2) == 0x0000BC, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_Divide_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_Divide_VectorFloat_ReturnValue_3) == 0x0000C8, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_Divide_VectorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_BreakVector_X_2) == 0x0000D4, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_BreakVector_Y_2) == 0x0000D8, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_BreakVector_Z_2) == 0x0000DC, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_BreakVector_X_3) == 0x0000E0, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_BreakVector_Y_3) == 0x0000E4, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_BreakVector_Z_3) == 0x0000E8, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_2) == 0x0000EC, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_3) == 0x0000F8, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_SetLightmapResolution_OutNewLightmapRes_1) == 0x000104, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_SetLightmapResolution_OutNewLightmapRes_1' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue_1) == 0x000110, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000140, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x000148, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_2) == 0x0001D4, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0001D8, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_CollisionType_TypeName_2) == 0x0001DC, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_CollisionType_TypeName_2' has a wrong offset!");
static_assert(offsetof(Create004_02_bp_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0001E4, "Member 'Create004_02_bp_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");

// Function create004_02_bp.create004_02_bp_C.ExecuteUbergraph_create004_02_bp
// 0x0004 (0x0004 - 0x0000)
struct Create004_02_bp_C_ExecuteUbergraph_create004_02_bp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create004_02_bp_C_ExecuteUbergraph_create004_02_bp) == 0x000004, "Wrong alignment on Create004_02_bp_C_ExecuteUbergraph_create004_02_bp");
static_assert(sizeof(Create004_02_bp_C_ExecuteUbergraph_create004_02_bp) == 0x000004, "Wrong size on Create004_02_bp_C_ExecuteUbergraph_create004_02_bp");
static_assert(offsetof(Create004_02_bp_C_ExecuteUbergraph_create004_02_bp, EntryPoint) == 0x000000, "Member 'Create004_02_bp_C_ExecuteUbergraph_create004_02_bp::EntryPoint' has a wrong offset!");

}

