#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Create001_01_bp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function create001_01_bp.create001_01_bp_C.Refresh Light Map
// 0x0004 (0x0004 - 0x0000)
struct Create001_01_bp_C_Refresh_Light_Map final
{
public:
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes;  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create001_01_bp_C_Refresh_Light_Map) == 0x000004, "Wrong alignment on Create001_01_bp_C_Refresh_Light_Map");
static_assert(sizeof(Create001_01_bp_C_Refresh_Light_Map) == 0x000004, "Wrong size on Create001_01_bp_C_Refresh_Light_Map");
static_assert(offsetof(Create001_01_bp_C_Refresh_Light_Map, CallFunc_SetLightmapResolution_OutNewLightmapRes) == 0x000000, "Member 'Create001_01_bp_C_Refresh_Light_Map::CallFunc_SetLightmapResolution_OutNewLightmapRes' has a wrong offset!");

// Function create001_01_bp.create001_01_bp_C.creat_a
// 0x00B0 (0x00B0 - 0x0000)
struct Create001_01_bp_C_Creat_a final
{
public:
	int32                                         PointIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_CollisionType_TypeName;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ___struct_Variable;                                // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetLightmapResolution_OutNewLightmapRes;  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location; // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent; // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location_1; // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1; // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Create001_01_bp_C_Creat_a) == 0x000010, "Wrong alignment on Create001_01_bp_C_Creat_a");
static_assert(sizeof(Create001_01_bp_C_Creat_a) == 0x0000B0, "Wrong size on Create001_01_bp_C_Creat_a");
static_assert(offsetof(Create001_01_bp_C_Creat_a, PointIndex) == 0x000000, "Member 'Create001_01_bp_C_Creat_a::PointIndex' has a wrong offset!");
static_assert(offsetof(Create001_01_bp_C_Creat_a, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'Create001_01_bp_C_Creat_a::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_01_bp_C_Creat_a, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000008, "Member 'Create001_01_bp_C_Creat_a::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_01_bp_C_Creat_a, CallFunc_CollisionType_TypeName) == 0x000010, "Member 'Create001_01_bp_C_Creat_a::CallFunc_CollisionType_TypeName' has a wrong offset!");
static_assert(offsetof(Create001_01_bp_C_Creat_a, ___struct_Variable) == 0x000020, "Member 'Create001_01_bp_C_Creat_a::___struct_Variable' has a wrong offset!");
static_assert(offsetof(Create001_01_bp_C_Creat_a, CallFunc_AddComponent_ReturnValue) == 0x000050, "Member 'Create001_01_bp_C_Creat_a::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_01_bp_C_Creat_a, CallFunc_SetLightmapResolution_OutNewLightmapRes) == 0x000058, "Member 'Create001_01_bp_C_Creat_a::CallFunc_SetLightmapResolution_OutNewLightmapRes' has a wrong offset!");
static_assert(offsetof(Create001_01_bp_C_Creat_a, CallFunc_SetStaticMesh_ReturnValue) == 0x00005C, "Member 'Create001_01_bp_C_Creat_a::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_01_bp_C_Creat_a, CallFunc_GetLocationAndTangentAtSplinePoint_Location) == 0x000060, "Member 'Create001_01_bp_C_Creat_a::CallFunc_GetLocationAndTangentAtSplinePoint_Location' has a wrong offset!");
static_assert(offsetof(Create001_01_bp_C_Creat_a, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent) == 0x00006C, "Member 'Create001_01_bp_C_Creat_a::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent' has a wrong offset!");
static_assert(offsetof(Create001_01_bp_C_Creat_a, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000078, "Member 'Create001_01_bp_C_Creat_a::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_01_bp_C_Creat_a, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00007C, "Member 'Create001_01_bp_C_Creat_a::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_01_bp_C_Creat_a, CallFunc_GetLocationAndTangentAtSplinePoint_Location_1) == 0x000088, "Member 'Create001_01_bp_C_Creat_a::CallFunc_GetLocationAndTangentAtSplinePoint_Location_1' has a wrong offset!");
static_assert(offsetof(Create001_01_bp_C_Creat_a, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1) == 0x000094, "Member 'Create001_01_bp_C_Creat_a::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1' has a wrong offset!");
static_assert(offsetof(Create001_01_bp_C_Creat_a, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000A0, "Member 'Create001_01_bp_C_Creat_a::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");

// Function create001_01_bp.create001_01_bp_C.UserConstructionScript
// 0x0014 (0x0014 - 0x0000)
struct Create001_01_bp_C_UserConstructionScript final
{
public:
	int32                                         ___int_Variable;                                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Create001_01_bp_C_UserConstructionScript) == 0x000004, "Wrong alignment on Create001_01_bp_C_UserConstructionScript");
static_assert(sizeof(Create001_01_bp_C_UserConstructionScript) == 0x000014, "Wrong size on Create001_01_bp_C_UserConstructionScript");
static_assert(offsetof(Create001_01_bp_C_UserConstructionScript, ___int_Variable) == 0x000000, "Member 'Create001_01_bp_C_UserConstructionScript::___int_Variable' has a wrong offset!");
static_assert(offsetof(Create001_01_bp_C_UserConstructionScript, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000004, "Member 'Create001_01_bp_C_UserConstructionScript::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_01_bp_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'Create001_01_bp_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_01_bp_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Create001_01_bp_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Create001_01_bp_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'Create001_01_bp_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

}

