#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrossSkill

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CrossSkill.CrossSkill_C
// 0x0050 (0x0A50 - 0x0A00)
class ACrossSkill_C final : public AGameSkill
{
public:
	uint8                                         Pad_9F8[0x8];                                      // 0x09F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USkillProhibitComponent*                SkillProhibit;                                     // 0x0A00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillStorageComponent*                 SkillStorage;                                      // 0x0A08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMontageStateComponent*                 MontageState;                                      // 0x0A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillEmitterComponent*                 SkillEmitter;                                      // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPlaySkillMontageComponent*             PlaySkillMontage;                                  // 0x0A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillCostComponent*                    SkillCost;                                         // 0x0A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillCDComponent*                      SkillCD;                                           // 0x0A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillSelectorComponent*                SkillSelector;                                     // 0x0A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CrossSkill_C">();
	}
	static class ACrossSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACrossSkill_C>();
	}
};
static_assert(alignof(ACrossSkill_C) == 0x000010, "Wrong alignment on ACrossSkill_C");
static_assert(sizeof(ACrossSkill_C) == 0x000A50, "Wrong size on ACrossSkill_C");
static_assert(offsetof(ACrossSkill_C, SkillProhibit) == 0x000A00, "Member 'ACrossSkill_C::SkillProhibit' has a wrong offset!");
static_assert(offsetof(ACrossSkill_C, SkillStorage) == 0x000A08, "Member 'ACrossSkill_C::SkillStorage' has a wrong offset!");
static_assert(offsetof(ACrossSkill_C, MontageState) == 0x000A10, "Member 'ACrossSkill_C::MontageState' has a wrong offset!");
static_assert(offsetof(ACrossSkill_C, SkillEmitter) == 0x000A18, "Member 'ACrossSkill_C::SkillEmitter' has a wrong offset!");
static_assert(offsetof(ACrossSkill_C, PlaySkillMontage) == 0x000A20, "Member 'ACrossSkill_C::PlaySkillMontage' has a wrong offset!");
static_assert(offsetof(ACrossSkill_C, SkillCost) == 0x000A28, "Member 'ACrossSkill_C::SkillCost' has a wrong offset!");
static_assert(offsetof(ACrossSkill_C, SkillCD) == 0x000A30, "Member 'ACrossSkill_C::SkillCD' has a wrong offset!");
static_assert(offsetof(ACrossSkill_C, SkillSelector) == 0x000A38, "Member 'ACrossSkill_C::SkillSelector' has a wrong offset!");
static_assert(offsetof(ACrossSkill_C, DefaultSceneRoot) == 0x000A40, "Member 'ACrossSkill_C::DefaultSceneRoot' has a wrong offset!");

}

