#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DamageEffect_ArrowPreheat

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function DamageEffect_ArrowPreheat.DamageEffect_ArrowPreheat_C.K2_CheckCondition
// 0x0210 (0x0210 - 0x0000)
struct DamageEffect_ArrowPreheat_C_K2_CheckCondition final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPreDamageResultData                   CallFunc_GetPreDamageData_Data;                    // 0x0018(0x01E0)(ContainsInstancedReference)
	bool                                          CallFunc_GetPreDamageData_ReturnValue;             // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APreheatBullet*                         K2Node_DynamicCast_AsPreheat_Bullet;               // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DamageEffect_ArrowPreheat_C_K2_CheckCondition) == 0x000008, "Wrong alignment on DamageEffect_ArrowPreheat_C_K2_CheckCondition");
static_assert(sizeof(DamageEffect_ArrowPreheat_C_K2_CheckCondition) == 0x000210, "Wrong size on DamageEffect_ArrowPreheat_C_K2_CheckCondition");
static_assert(offsetof(DamageEffect_ArrowPreheat_C_K2_CheckCondition, InCurLauncher) == 0x000000, "Member 'DamageEffect_ArrowPreheat_C_K2_CheckCondition::InCurLauncher' has a wrong offset!");
static_assert(offsetof(DamageEffect_ArrowPreheat_C_K2_CheckCondition, InCurLauncherChara) == 0x000008, "Member 'DamageEffect_ArrowPreheat_C_K2_CheckCondition::InCurLauncherChara' has a wrong offset!");
static_assert(offsetof(DamageEffect_ArrowPreheat_C_K2_CheckCondition, ReturnValue) == 0x000010, "Member 'DamageEffect_ArrowPreheat_C_K2_CheckCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(DamageEffect_ArrowPreheat_C_K2_CheckCondition, CallFunc_GetPreDamageData_Data) == 0x000018, "Member 'DamageEffect_ArrowPreheat_C_K2_CheckCondition::CallFunc_GetPreDamageData_Data' has a wrong offset!");
static_assert(offsetof(DamageEffect_ArrowPreheat_C_K2_CheckCondition, CallFunc_GetPreDamageData_ReturnValue) == 0x0001F8, "Member 'DamageEffect_ArrowPreheat_C_K2_CheckCondition::CallFunc_GetPreDamageData_ReturnValue' has a wrong offset!");
static_assert(offsetof(DamageEffect_ArrowPreheat_C_K2_CheckCondition, K2Node_DynamicCast_AsPreheat_Bullet) == 0x000200, "Member 'DamageEffect_ArrowPreheat_C_K2_CheckCondition::K2Node_DynamicCast_AsPreheat_Bullet' has a wrong offset!");
static_assert(offsetof(DamageEffect_ArrowPreheat_C_K2_CheckCondition, K2Node_DynamicCast_bSuccess) == 0x000208, "Member 'DamageEffect_ArrowPreheat_C_K2_CheckCondition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DamageEffect_ArrowPreheat_C_K2_CheckCondition, CallFunc_IsValid_ReturnValue) == 0x000209, "Member 'DamageEffect_ArrowPreheat_C_K2_CheckCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DamageEffect_ArrowPreheat_C_K2_CheckCondition, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00020A, "Member 'DamageEffect_ArrowPreheat_C_K2_CheckCondition::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

