#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DarkZone

#include "Basic.hpp"


namespace SDK
{

// Enum DarkZone.EDarkZoneType
// NumValues: 0x0003
enum class EDarkZoneType : uint8
{
	DarkZone                                 = 0,
	Explore                                  = 1,
	EDarkZoneType_MAX                        = 2,
};

// ScriptStruct DarkZone.DarkZoneRegionPreviewButton
// 0x0004 (0x0004 - 0x0000)
struct FDarkZoneRegionPreviewButton final
{
public:
	int32                                         OverrideButton;                                    // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDarkZoneRegionPreviewButton) == 0x000004, "Wrong alignment on FDarkZoneRegionPreviewButton");
static_assert(sizeof(FDarkZoneRegionPreviewButton) == 0x000004, "Wrong size on FDarkZoneRegionPreviewButton");
static_assert(offsetof(FDarkZoneRegionPreviewButton, OverrideButton) == 0x000000, "Member 'FDarkZoneRegionPreviewButton::OverrideButton' has a wrong offset!");

// ScriptStruct DarkZone.DarkZoneRegionExportButton
// 0x0001 (0x0001 - 0x0000)
struct FDarkZoneRegionExportButton final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDarkZoneRegionExportButton) == 0x000001, "Wrong alignment on FDarkZoneRegionExportButton");
static_assert(sizeof(FDarkZoneRegionExportButton) == 0x000001, "Wrong size on FDarkZoneRegionExportButton");

// ScriptStruct DarkZone.DarkZoneNavLinkProxyUI
// 0x0001 (0x0001 - 0x0000)
struct FDarkZoneNavLinkProxyUI final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDarkZoneNavLinkProxyUI) == 0x000001, "Wrong alignment on FDarkZoneNavLinkProxyUI");
static_assert(sizeof(FDarkZoneNavLinkProxyUI) == 0x000001, "Wrong size on FDarkZoneNavLinkProxyUI");

// ScriptStruct DarkZone.DarkZoneNpcPointExportButton
// 0x0001 (0x0001 - 0x0000)
struct FDarkZoneNpcPointExportButton final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDarkZoneNpcPointExportButton) == 0x000001, "Wrong alignment on FDarkZoneNpcPointExportButton");
static_assert(sizeof(FDarkZoneNpcPointExportButton) == 0x000001, "Wrong size on FDarkZoneNpcPointExportButton");

// ScriptStruct DarkZone.DarkZonePointInteractionComboBox
// 0x0004 (0x0004 - 0x0000)
struct FDarkZonePointInteractionComboBox final
{
public:
	int32                                         OverrideButton;                                    // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDarkZonePointInteractionComboBox) == 0x000004, "Wrong alignment on FDarkZonePointInteractionComboBox");
static_assert(sizeof(FDarkZonePointInteractionComboBox) == 0x000004, "Wrong size on FDarkZonePointInteractionComboBox");
static_assert(offsetof(FDarkZonePointInteractionComboBox, OverrideButton) == 0x000000, "Member 'FDarkZonePointInteractionComboBox::OverrideButton' has a wrong offset!");

// ScriptStruct DarkZone.DarkZonePointTypeComboBox
// 0x0004 (0x0004 - 0x0000)
struct FDarkZonePointTypeComboBox final
{
public:
	int32                                         OverrideButton;                                    // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDarkZonePointTypeComboBox) == 0x000004, "Wrong alignment on FDarkZonePointTypeComboBox");
static_assert(sizeof(FDarkZonePointTypeComboBox) == 0x000004, "Wrong size on FDarkZonePointTypeComboBox");
static_assert(offsetof(FDarkZonePointTypeComboBox, OverrideButton) == 0x000000, "Member 'FDarkZonePointTypeComboBox::OverrideButton' has a wrong offset!");

// ScriptStruct DarkZone.DarkZonePointExportButton
// 0x0001 (0x0001 - 0x0000)
struct FDarkZonePointExportButton final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDarkZonePointExportButton) == 0x000001, "Wrong alignment on FDarkZonePointExportButton");
static_assert(sizeof(FDarkZonePointExportButton) == 0x000001, "Wrong size on FDarkZonePointExportButton");

}

