#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DarkZone

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function DarkZone.DarkZoneActorInterface.InitActor
// 0x0018 (0x0018 - 0x0000)
struct DarkZoneActorInterface_InitActor final
{
public:
	int32                                         InActorId;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         State;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 CustomParam;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneActorInterface_InitActor) == 0x000008, "Wrong alignment on DarkZoneActorInterface_InitActor");
static_assert(sizeof(DarkZoneActorInterface_InitActor) == 0x000018, "Wrong size on DarkZoneActorInterface_InitActor");
static_assert(offsetof(DarkZoneActorInterface_InitActor, InActorId) == 0x000000, "Member 'DarkZoneActorInterface_InitActor::InActorId' has a wrong offset!");
static_assert(offsetof(DarkZoneActorInterface_InitActor, State) == 0x000004, "Member 'DarkZoneActorInterface_InitActor::State' has a wrong offset!");
static_assert(offsetof(DarkZoneActorInterface_InitActor, CustomParam) == 0x000008, "Member 'DarkZoneActorInterface_InitActor::CustomParam' has a wrong offset!");

// Function DarkZone.DarkZoneFogSwitchActor.ActiveCustomFog
// 0x0004 (0x0004 - 0x0000)
struct DarkZoneFogSwitchActor_ActiveCustomFog final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneFogSwitchActor_ActiveCustomFog) == 0x000004, "Wrong alignment on DarkZoneFogSwitchActor_ActiveCustomFog");
static_assert(sizeof(DarkZoneFogSwitchActor_ActiveCustomFog) == 0x000004, "Wrong size on DarkZoneFogSwitchActor_ActiveCustomFog");
static_assert(offsetof(DarkZoneFogSwitchActor_ActiveCustomFog, InIndex) == 0x000000, "Member 'DarkZoneFogSwitchActor_ActiveCustomFog::InIndex' has a wrong offset!");

// Function DarkZone.DarkZoneFogSwitchActor.Switch
// 0x000C (0x000C - 0x0000)
struct DarkZoneFogSwitchActor_Switch final
{
public:
	int32                                         A;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         B;                                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InProgress;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneFogSwitchActor_Switch) == 0x000004, "Wrong alignment on DarkZoneFogSwitchActor_Switch");
static_assert(sizeof(DarkZoneFogSwitchActor_Switch) == 0x00000C, "Wrong size on DarkZoneFogSwitchActor_Switch");
static_assert(offsetof(DarkZoneFogSwitchActor_Switch, A) == 0x000000, "Member 'DarkZoneFogSwitchActor_Switch::A' has a wrong offset!");
static_assert(offsetof(DarkZoneFogSwitchActor_Switch, B) == 0x000004, "Member 'DarkZoneFogSwitchActor_Switch::B' has a wrong offset!");
static_assert(offsetof(DarkZoneFogSwitchActor_Switch, InProgress) == 0x000008, "Member 'DarkZoneFogSwitchActor_Switch::InProgress' has a wrong offset!");

// Function DarkZone.DarkZoneGeneralTriggerRegion.GetList
// 0x0010 (0x0010 - 0x0000)
struct DarkZoneGeneralTriggerRegion_GetList final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneGeneralTriggerRegion_GetList) == 0x000008, "Wrong alignment on DarkZoneGeneralTriggerRegion_GetList");
static_assert(sizeof(DarkZoneGeneralTriggerRegion_GetList) == 0x000010, "Wrong size on DarkZoneGeneralTriggerRegion_GetList");
static_assert(offsetof(DarkZoneGeneralTriggerRegion_GetList, ReturnValue) == 0x000000, "Member 'DarkZoneGeneralTriggerRegion_GetList::ReturnValue' has a wrong offset!");

// Function DarkZone.DarkZoneMapPointMgr.GetSpawnActor
// 0x0010 (0x0010 - 0x0000)
struct DarkZoneMapPointMgr_GetSpawnActor final
{
public:
	int32                                         ActorId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneMapPointMgr_GetSpawnActor) == 0x000008, "Wrong alignment on DarkZoneMapPointMgr_GetSpawnActor");
static_assert(sizeof(DarkZoneMapPointMgr_GetSpawnActor) == 0x000010, "Wrong size on DarkZoneMapPointMgr_GetSpawnActor");
static_assert(offsetof(DarkZoneMapPointMgr_GetSpawnActor, ActorId) == 0x000000, "Member 'DarkZoneMapPointMgr_GetSpawnActor::ActorId' has a wrong offset!");
static_assert(offsetof(DarkZoneMapPointMgr_GetSpawnActor, ReturnValue) == 0x000008, "Member 'DarkZoneMapPointMgr_GetSpawnActor::ReturnValue' has a wrong offset!");

// Function DarkZone.DarkZoneMapPointMgr.OnDestroyActor
// 0x0004 (0x0004 - 0x0000)
struct DarkZoneMapPointMgr_OnDestroyActor final
{
public:
	int32                                         ActorId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneMapPointMgr_OnDestroyActor) == 0x000004, "Wrong alignment on DarkZoneMapPointMgr_OnDestroyActor");
static_assert(sizeof(DarkZoneMapPointMgr_OnDestroyActor) == 0x000004, "Wrong size on DarkZoneMapPointMgr_OnDestroyActor");
static_assert(offsetof(DarkZoneMapPointMgr_OnDestroyActor, ActorId) == 0x000000, "Member 'DarkZoneMapPointMgr_OnDestroyActor::ActorId' has a wrong offset!");

// Function DarkZone.DarkZoneMapPointMgr.TrySpawnActor
// 0x0010 (0x0010 - 0x0000)
struct DarkZoneMapPointMgr_TrySpawnActor final
{
public:
	int32                                         ActorId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneMapPointMgr_TrySpawnActor) == 0x000008, "Wrong alignment on DarkZoneMapPointMgr_TrySpawnActor");
static_assert(sizeof(DarkZoneMapPointMgr_TrySpawnActor) == 0x000010, "Wrong size on DarkZoneMapPointMgr_TrySpawnActor");
static_assert(offsetof(DarkZoneMapPointMgr_TrySpawnActor, ActorId) == 0x000000, "Member 'DarkZoneMapPointMgr_TrySpawnActor::ActorId' has a wrong offset!");
static_assert(offsetof(DarkZoneMapPointMgr_TrySpawnActor, ReturnValue) == 0x000008, "Member 'DarkZoneMapPointMgr_TrySpawnActor::ReturnValue' has a wrong offset!");

// Function DarkZone.DarkZonePatrolArea.GetRandomPos
// 0x000C (0x000C - 0x0000)
struct DarkZonePatrolArea_GetRandomPos final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZonePatrolArea_GetRandomPos) == 0x000004, "Wrong alignment on DarkZonePatrolArea_GetRandomPos");
static_assert(sizeof(DarkZonePatrolArea_GetRandomPos) == 0x00000C, "Wrong size on DarkZonePatrolArea_GetRandomPos");
static_assert(offsetof(DarkZonePatrolArea_GetRandomPos, ReturnValue) == 0x000000, "Member 'DarkZonePatrolArea_GetRandomPos::ReturnValue' has a wrong offset!");

// Function DarkZone.DarkZoneSpecialLogic.AddGZ
// 0x0008 (0x0008 - 0x0000)
struct DarkZoneSpecialLogic_AddGZ final
{
public:
	int32                                         Val;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneSpecialLogic_AddGZ) == 0x000004, "Wrong alignment on DarkZoneSpecialLogic_AddGZ");
static_assert(sizeof(DarkZoneSpecialLogic_AddGZ) == 0x000008, "Wrong size on DarkZoneSpecialLogic_AddGZ");
static_assert(offsetof(DarkZoneSpecialLogic_AddGZ, Val) == 0x000000, "Member 'DarkZoneSpecialLogic_AddGZ::Val' has a wrong offset!");
static_assert(offsetof(DarkZoneSpecialLogic_AddGZ, ReturnValue) == 0x000004, "Member 'DarkZoneSpecialLogic_AddGZ::ReturnValue' has a wrong offset!");

// Function DarkZone.DarkZoneSpecialLogic.GetGZ
// 0x0004 (0x0004 - 0x0000)
struct DarkZoneSpecialLogic_GetGZ final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneSpecialLogic_GetGZ) == 0x000004, "Wrong alignment on DarkZoneSpecialLogic_GetGZ");
static_assert(sizeof(DarkZoneSpecialLogic_GetGZ) == 0x000004, "Wrong size on DarkZoneSpecialLogic_GetGZ");
static_assert(offsetof(DarkZoneSpecialLogic_GetGZ, ReturnValue) == 0x000000, "Member 'DarkZoneSpecialLogic_GetGZ::ReturnValue' has a wrong offset!");

// Function DarkZone.DarkZoneSpecialLogic.GetGZLevel
// 0x0004 (0x0004 - 0x0000)
struct DarkZoneSpecialLogic_GetGZLevel final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneSpecialLogic_GetGZLevel) == 0x000004, "Wrong alignment on DarkZoneSpecialLogic_GetGZLevel");
static_assert(sizeof(DarkZoneSpecialLogic_GetGZLevel) == 0x000004, "Wrong size on DarkZoneSpecialLogic_GetGZLevel");
static_assert(offsetof(DarkZoneSpecialLogic_GetGZLevel, ReturnValue) == 0x000000, "Member 'DarkZoneSpecialLogic_GetGZLevel::ReturnValue' has a wrong offset!");

// Function DarkZone.DarkZoneSpecialLogic.GetGZMax
// 0x0004 (0x0004 - 0x0000)
struct DarkZoneSpecialLogic_GetGZMax final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneSpecialLogic_GetGZMax) == 0x000004, "Wrong alignment on DarkZoneSpecialLogic_GetGZMax");
static_assert(sizeof(DarkZoneSpecialLogic_GetGZMax) == 0x000004, "Wrong size on DarkZoneSpecialLogic_GetGZMax");
static_assert(offsetof(DarkZoneSpecialLogic_GetGZMax, ReturnValue) == 0x000000, "Member 'DarkZoneSpecialLogic_GetGZMax::ReturnValue' has a wrong offset!");

// Function DarkZone.DarkZoneSpecialLogic.GetGZSpeed
// 0x0004 (0x0004 - 0x0000)
struct DarkZoneSpecialLogic_GetGZSpeed final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneSpecialLogic_GetGZSpeed) == 0x000004, "Wrong alignment on DarkZoneSpecialLogic_GetGZSpeed");
static_assert(sizeof(DarkZoneSpecialLogic_GetGZSpeed) == 0x000004, "Wrong size on DarkZoneSpecialLogic_GetGZSpeed");
static_assert(offsetof(DarkZoneSpecialLogic_GetGZSpeed, ReturnValue) == 0x000000, "Member 'DarkZoneSpecialLogic_GetGZSpeed::ReturnValue' has a wrong offset!");

// Function DarkZone.DarkZoneSpecialLogic.SetGZ
// 0x0004 (0x0004 - 0x0000)
struct DarkZoneSpecialLogic_SetGZ final
{
public:
	int32                                         Val;                                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneSpecialLogic_SetGZ) == 0x000004, "Wrong alignment on DarkZoneSpecialLogic_SetGZ");
static_assert(sizeof(DarkZoneSpecialLogic_SetGZ) == 0x000004, "Wrong size on DarkZoneSpecialLogic_SetGZ");
static_assert(offsetof(DarkZoneSpecialLogic_SetGZ, Val) == 0x000000, "Member 'DarkZoneSpecialLogic_SetGZ::Val' has a wrong offset!");

// Function DarkZone.DarkZoneSpecialLogic.SetGZLevelAndSpeed
// 0x0008 (0x0008 - 0x0000)
struct DarkZoneSpecialLogic_SetGZLevelAndSpeed final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Speed;                                             // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneSpecialLogic_SetGZLevelAndSpeed) == 0x000004, "Wrong alignment on DarkZoneSpecialLogic_SetGZLevelAndSpeed");
static_assert(sizeof(DarkZoneSpecialLogic_SetGZLevelAndSpeed) == 0x000008, "Wrong size on DarkZoneSpecialLogic_SetGZLevelAndSpeed");
static_assert(offsetof(DarkZoneSpecialLogic_SetGZLevelAndSpeed, Level) == 0x000000, "Member 'DarkZoneSpecialLogic_SetGZLevelAndSpeed::Level' has a wrong offset!");
static_assert(offsetof(DarkZoneSpecialLogic_SetGZLevelAndSpeed, Speed) == 0x000004, "Member 'DarkZoneSpecialLogic_SetGZLevelAndSpeed::Speed' has a wrong offset!");

// Function DarkZone.DarkZoneSpecialLogic.SetGZMax
// 0x0004 (0x0004 - 0x0000)
struct DarkZoneSpecialLogic_SetGZMax final
{
public:
	int32                                         Val;                                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneSpecialLogic_SetGZMax) == 0x000004, "Wrong alignment on DarkZoneSpecialLogic_SetGZMax");
static_assert(sizeof(DarkZoneSpecialLogic_SetGZMax) == 0x000004, "Wrong size on DarkZoneSpecialLogic_SetGZMax");
static_assert(offsetof(DarkZoneSpecialLogic_SetGZMax, Val) == 0x000000, "Member 'DarkZoneSpecialLogic_SetGZMax::Val' has a wrong offset!");

// Function DarkZone.DarkZoneSpecialLogic.SetGZRate
// 0x0004 (0x0004 - 0x0000)
struct DarkZoneSpecialLogic_SetGZRate final
{
public:
	float                                         Val;                                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneSpecialLogic_SetGZRate) == 0x000004, "Wrong alignment on DarkZoneSpecialLogic_SetGZRate");
static_assert(sizeof(DarkZoneSpecialLogic_SetGZRate) == 0x000004, "Wrong size on DarkZoneSpecialLogic_SetGZRate");
static_assert(offsetof(DarkZoneSpecialLogic_SetGZRate, Val) == 0x000000, "Member 'DarkZoneSpecialLogic_SetGZRate::Val' has a wrong offset!");

// Function DarkZone.DarkZoneSystem.CanFreeRush
// 0x0001 (0x0001 - 0x0000)
struct DarkZoneSystem_CanFreeRush final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneSystem_CanFreeRush) == 0x000001, "Wrong alignment on DarkZoneSystem_CanFreeRush");
static_assert(sizeof(DarkZoneSystem_CanFreeRush) == 0x000001, "Wrong size on DarkZoneSystem_CanFreeRush");
static_assert(offsetof(DarkZoneSystem_CanFreeRush, ReturnValue) == 0x000000, "Member 'DarkZoneSystem_CanFreeRush::ReturnValue' has a wrong offset!");

// Function DarkZone.DarkZoneSystem.SetFreeRush
// 0x0001 (0x0001 - 0x0000)
struct DarkZoneSystem_SetFreeRush final
{
public:
	bool                                          CanFree;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneSystem_SetFreeRush) == 0x000001, "Wrong alignment on DarkZoneSystem_SetFreeRush");
static_assert(sizeof(DarkZoneSystem_SetFreeRush) == 0x000001, "Wrong size on DarkZoneSystem_SetFreeRush");
static_assert(offsetof(DarkZoneSystem_SetFreeRush, CanFree) == 0x000000, "Member 'DarkZoneSystem_SetFreeRush::CanFree' has a wrong offset!");

// Function DarkZone.DarkZoneTaskMgr.BeginTask
// 0x0028 (0x0028 - 0x0000)
struct DarkZoneTaskMgr_BeginTask final
{
public:
	int32                                         RegionId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TaskId;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TaskPath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LevelStreamingPath;                                // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneTaskMgr_BeginTask) == 0x000008, "Wrong alignment on DarkZoneTaskMgr_BeginTask");
static_assert(sizeof(DarkZoneTaskMgr_BeginTask) == 0x000028, "Wrong size on DarkZoneTaskMgr_BeginTask");
static_assert(offsetof(DarkZoneTaskMgr_BeginTask, RegionId) == 0x000000, "Member 'DarkZoneTaskMgr_BeginTask::RegionId' has a wrong offset!");
static_assert(offsetof(DarkZoneTaskMgr_BeginTask, TaskId) == 0x000004, "Member 'DarkZoneTaskMgr_BeginTask::TaskId' has a wrong offset!");
static_assert(offsetof(DarkZoneTaskMgr_BeginTask, TaskPath) == 0x000008, "Member 'DarkZoneTaskMgr_BeginTask::TaskPath' has a wrong offset!");
static_assert(offsetof(DarkZoneTaskMgr_BeginTask, LevelStreamingPath) == 0x000018, "Member 'DarkZoneTaskMgr_BeginTask::LevelStreamingPath' has a wrong offset!");

// Function DarkZone.DarkZoneTaskMgr.CheckRegionHasTask
// 0x0008 (0x0008 - 0x0000)
struct DarkZoneTaskMgr_CheckRegionHasTask final
{
public:
	int32                                         InRegionId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DarkZoneTaskMgr_CheckRegionHasTask) == 0x000004, "Wrong alignment on DarkZoneTaskMgr_CheckRegionHasTask");
static_assert(sizeof(DarkZoneTaskMgr_CheckRegionHasTask) == 0x000008, "Wrong size on DarkZoneTaskMgr_CheckRegionHasTask");
static_assert(offsetof(DarkZoneTaskMgr_CheckRegionHasTask, InRegionId) == 0x000000, "Member 'DarkZoneTaskMgr_CheckRegionHasTask::InRegionId' has a wrong offset!");
static_assert(offsetof(DarkZoneTaskMgr_CheckRegionHasTask, ReturnValue) == 0x000004, "Member 'DarkZoneTaskMgr_CheckRegionHasTask::ReturnValue' has a wrong offset!");

// Function DarkZone.DarkZoneTaskMgr.GetCurrentRegionList
// 0x0010 (0x0010 - 0x0000)
struct DarkZoneTaskMgr_GetCurrentRegionList final
{
public:
	TArray<int32>                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneTaskMgr_GetCurrentRegionList) == 0x000008, "Wrong alignment on DarkZoneTaskMgr_GetCurrentRegionList");
static_assert(sizeof(DarkZoneTaskMgr_GetCurrentRegionList) == 0x000010, "Wrong size on DarkZoneTaskMgr_GetCurrentRegionList");
static_assert(offsetof(DarkZoneTaskMgr_GetCurrentRegionList, ReturnValue) == 0x000000, "Member 'DarkZoneTaskMgr_GetCurrentRegionList::ReturnValue' has a wrong offset!");

// Function DarkZone.DarkZoneTaskMgr.GetCurrentTaskCount
// 0x0004 (0x0004 - 0x0000)
struct DarkZoneTaskMgr_GetCurrentTaskCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneTaskMgr_GetCurrentTaskCount) == 0x000004, "Wrong alignment on DarkZoneTaskMgr_GetCurrentTaskCount");
static_assert(sizeof(DarkZoneTaskMgr_GetCurrentTaskCount) == 0x000004, "Wrong size on DarkZoneTaskMgr_GetCurrentTaskCount");
static_assert(offsetof(DarkZoneTaskMgr_GetCurrentTaskCount, ReturnValue) == 0x000000, "Member 'DarkZoneTaskMgr_GetCurrentTaskCount::ReturnValue' has a wrong offset!");

// Function DarkZone.DarkZoneTaskMgr.GetCurrentTaskId
// 0x0008 (0x0008 - 0x0000)
struct DarkZoneTaskMgr_GetCurrentTaskId final
{
public:
	int32                                         InRegionId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneTaskMgr_GetCurrentTaskId) == 0x000004, "Wrong alignment on DarkZoneTaskMgr_GetCurrentTaskId");
static_assert(sizeof(DarkZoneTaskMgr_GetCurrentTaskId) == 0x000008, "Wrong size on DarkZoneTaskMgr_GetCurrentTaskId");
static_assert(offsetof(DarkZoneTaskMgr_GetCurrentTaskId, InRegionId) == 0x000000, "Member 'DarkZoneTaskMgr_GetCurrentTaskId::InRegionId' has a wrong offset!");
static_assert(offsetof(DarkZoneTaskMgr_GetCurrentTaskId, ReturnValue) == 0x000004, "Member 'DarkZoneTaskMgr_GetCurrentTaskId::ReturnValue' has a wrong offset!");

// Function DarkZone.DarkZoneTaskMgr.GetNpcLevel
// 0x0004 (0x0004 - 0x0000)
struct DarkZoneTaskMgr_GetNpcLevel final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneTaskMgr_GetNpcLevel) == 0x000004, "Wrong alignment on DarkZoneTaskMgr_GetNpcLevel");
static_assert(sizeof(DarkZoneTaskMgr_GetNpcLevel) == 0x000004, "Wrong size on DarkZoneTaskMgr_GetNpcLevel");
static_assert(offsetof(DarkZoneTaskMgr_GetNpcLevel, ReturnValue) == 0x000000, "Member 'DarkZoneTaskMgr_GetNpcLevel::ReturnValue' has a wrong offset!");

// Function DarkZone.DarkZoneTaskMgr.GetTaskDuration
// 0x0008 (0x0008 - 0x0000)
struct DarkZoneTaskMgr_GetTaskDuration final
{
public:
	int32                                         InRegionId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneTaskMgr_GetTaskDuration) == 0x000004, "Wrong alignment on DarkZoneTaskMgr_GetTaskDuration");
static_assert(sizeof(DarkZoneTaskMgr_GetTaskDuration) == 0x000008, "Wrong size on DarkZoneTaskMgr_GetTaskDuration");
static_assert(offsetof(DarkZoneTaskMgr_GetTaskDuration, InRegionId) == 0x000000, "Member 'DarkZoneTaskMgr_GetTaskDuration::InRegionId' has a wrong offset!");
static_assert(offsetof(DarkZoneTaskMgr_GetTaskDuration, ReturnValue) == 0x000004, "Member 'DarkZoneTaskMgr_GetTaskDuration::ReturnValue' has a wrong offset!");

// Function DarkZone.DarkZoneTaskMgr.NotifyTaskBegin
// 0x0008 (0x0008 - 0x0000)
struct DarkZoneTaskMgr_NotifyTaskBegin final
{
public:
	class AGameTaskActor*                         InTaskActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneTaskMgr_NotifyTaskBegin) == 0x000008, "Wrong alignment on DarkZoneTaskMgr_NotifyTaskBegin");
static_assert(sizeof(DarkZoneTaskMgr_NotifyTaskBegin) == 0x000008, "Wrong size on DarkZoneTaskMgr_NotifyTaskBegin");
static_assert(offsetof(DarkZoneTaskMgr_NotifyTaskBegin, InTaskActor) == 0x000000, "Member 'DarkZoneTaskMgr_NotifyTaskBegin::InTaskActor' has a wrong offset!");

// Function DarkZone.DarkZoneTaskMgr.OnTaskFailedMain
// 0x0008 (0x0008 - 0x0000)
struct DarkZoneTaskMgr_OnTaskFailedMain final
{
public:
	class AGameTaskActor*                         InTaskActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneTaskMgr_OnTaskFailedMain) == 0x000008, "Wrong alignment on DarkZoneTaskMgr_OnTaskFailedMain");
static_assert(sizeof(DarkZoneTaskMgr_OnTaskFailedMain) == 0x000008, "Wrong size on DarkZoneTaskMgr_OnTaskFailedMain");
static_assert(offsetof(DarkZoneTaskMgr_OnTaskFailedMain, InTaskActor) == 0x000000, "Member 'DarkZoneTaskMgr_OnTaskFailedMain::InTaskActor' has a wrong offset!");

// Function DarkZone.DarkZoneTaskMgr.OnTaskFailedSimple
// 0x0008 (0x0008 - 0x0000)
struct DarkZoneTaskMgr_OnTaskFailedSimple final
{
public:
	class AGameTaskActor*                         InTaskActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneTaskMgr_OnTaskFailedSimple) == 0x000008, "Wrong alignment on DarkZoneTaskMgr_OnTaskFailedSimple");
static_assert(sizeof(DarkZoneTaskMgr_OnTaskFailedSimple) == 0x000008, "Wrong size on DarkZoneTaskMgr_OnTaskFailedSimple");
static_assert(offsetof(DarkZoneTaskMgr_OnTaskFailedSimple, InTaskActor) == 0x000000, "Member 'DarkZoneTaskMgr_OnTaskFailedSimple::InTaskActor' has a wrong offset!");

// Function DarkZone.DarkZoneTaskMgr.OnTaskFinishSimple
// 0x0008 (0x0008 - 0x0000)
struct DarkZoneTaskMgr_OnTaskFinishSimple final
{
public:
	class AGameTaskActor*                         InTaskActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneTaskMgr_OnTaskFinishSimple) == 0x000008, "Wrong alignment on DarkZoneTaskMgr_OnTaskFinishSimple");
static_assert(sizeof(DarkZoneTaskMgr_OnTaskFinishSimple) == 0x000008, "Wrong size on DarkZoneTaskMgr_OnTaskFinishSimple");
static_assert(offsetof(DarkZoneTaskMgr_OnTaskFinishSimple, InTaskActor) == 0x000000, "Member 'DarkZoneTaskMgr_OnTaskFinishSimple::InTaskActor' has a wrong offset!");

// Function DarkZone.DarkZoneTaskMgr.SetMainTaskActor
// 0x0008 (0x0008 - 0x0000)
struct DarkZoneTaskMgr_SetMainTaskActor final
{
public:
	class AGameTaskActor*                         InTaskActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneTaskMgr_SetMainTaskActor) == 0x000008, "Wrong alignment on DarkZoneTaskMgr_SetMainTaskActor");
static_assert(sizeof(DarkZoneTaskMgr_SetMainTaskActor) == 0x000008, "Wrong size on DarkZoneTaskMgr_SetMainTaskActor");
static_assert(offsetof(DarkZoneTaskMgr_SetMainTaskActor, InTaskActor) == 0x000000, "Member 'DarkZoneTaskMgr_SetMainTaskActor::InTaskActor' has a wrong offset!");

// Function DarkZone.DarkZoneTaskMgr.StopAllTask
// 0x0001 (0x0001 - 0x0000)
struct DarkZoneTaskMgr_StopAllTask final
{
public:
	bool                                          IsUnloadLevel;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneTaskMgr_StopAllTask) == 0x000001, "Wrong alignment on DarkZoneTaskMgr_StopAllTask");
static_assert(sizeof(DarkZoneTaskMgr_StopAllTask) == 0x000001, "Wrong size on DarkZoneTaskMgr_StopAllTask");
static_assert(offsetof(DarkZoneTaskMgr_StopAllTask, IsUnloadLevel) == 0x000000, "Member 'DarkZoneTaskMgr_StopAllTask::IsUnloadLevel' has a wrong offset!");

// Function DarkZone.DarkZoneTaskMgr.StopRegionTask
// 0x0008 (0x0008 - 0x0000)
struct DarkZoneTaskMgr_StopRegionTask final
{
public:
	int32                                         InRegionId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsUnloadLevel;                                     // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DarkZoneTaskMgr_StopRegionTask) == 0x000004, "Wrong alignment on DarkZoneTaskMgr_StopRegionTask");
static_assert(sizeof(DarkZoneTaskMgr_StopRegionTask) == 0x000008, "Wrong size on DarkZoneTaskMgr_StopRegionTask");
static_assert(offsetof(DarkZoneTaskMgr_StopRegionTask, InRegionId) == 0x000000, "Member 'DarkZoneTaskMgr_StopRegionTask::InRegionId' has a wrong offset!");
static_assert(offsetof(DarkZoneTaskMgr_StopRegionTask, IsUnloadLevel) == 0x000004, "Member 'DarkZoneTaskMgr_StopRegionTask::IsUnloadLevel' has a wrong offset!");

}

