#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeadPerformance_Common

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function DeadPerformance_Common.DeadPerformance_Common_C.DeadPerformanceLogic
// 0x01C8 (0x01C8 - 0x0000)
struct DeadPerformance_Common_C_DeadPerformanceLogic final
{
public:
	class AGameCharacter*                         DeadCharacter;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         Killer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDeadPerformanceComponent*              DeadComponent;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     HealthChangeValue;                                 // 0x0018(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(DeadPerformance_Common_C_DeadPerformanceLogic) == 0x000008, "Wrong alignment on DeadPerformance_Common_C_DeadPerformanceLogic");
static_assert(sizeof(DeadPerformance_Common_C_DeadPerformanceLogic) == 0x0001C8, "Wrong size on DeadPerformance_Common_C_DeadPerformanceLogic");
static_assert(offsetof(DeadPerformance_Common_C_DeadPerformanceLogic, DeadCharacter) == 0x000000, "Member 'DeadPerformance_Common_C_DeadPerformanceLogic::DeadCharacter' has a wrong offset!");
static_assert(offsetof(DeadPerformance_Common_C_DeadPerformanceLogic, Killer) == 0x000008, "Member 'DeadPerformance_Common_C_DeadPerformanceLogic::Killer' has a wrong offset!");
static_assert(offsetof(DeadPerformance_Common_C_DeadPerformanceLogic, DeadComponent) == 0x000010, "Member 'DeadPerformance_Common_C_DeadPerformanceLogic::DeadComponent' has a wrong offset!");
static_assert(offsetof(DeadPerformance_Common_C_DeadPerformanceLogic, HealthChangeValue) == 0x000018, "Member 'DeadPerformance_Common_C_DeadPerformanceLogic::HealthChangeValue' has a wrong offset!");

// Function DeadPerformance_Common.DeadPerformance_Common_C.ExecuteUbergraph_DeadPerformance_Common
// 0x01F8 (0x01F8 - 0x0000)
struct DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_Event_DeadCharacter;                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_Killer;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDeadPerformanceComponent*              K2Node_Event_DeadComponent;                        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_Event_HealthChangeValue;                    // 0x0020(0x01B0)(ConstParm, ContainsInstancedReference)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Vector_IsNAN_ReturnValue;                 // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SignOfFloat_ReturnValue;                  // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common) == 0x000008, "Wrong alignment on DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common");
static_assert(sizeof(DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common) == 0x0001F8, "Wrong size on DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common");
static_assert(offsetof(DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common, EntryPoint) == 0x000000, "Member 'DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common::EntryPoint' has a wrong offset!");
static_assert(offsetof(DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common, K2Node_Event_DeadCharacter) == 0x000008, "Member 'DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common::K2Node_Event_DeadCharacter' has a wrong offset!");
static_assert(offsetof(DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common, K2Node_Event_Killer) == 0x000010, "Member 'DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common::K2Node_Event_Killer' has a wrong offset!");
static_assert(offsetof(DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common, K2Node_Event_DeadComponent) == 0x000018, "Member 'DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common::K2Node_Event_DeadComponent' has a wrong offset!");
static_assert(offsetof(DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common, K2Node_Event_HealthChangeValue) == 0x000020, "Member 'DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common::K2Node_Event_HealthChangeValue' has a wrong offset!");
static_assert(offsetof(DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001D0, "Member 'DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common, CallFunc_Vector_IsNAN_ReturnValue) == 0x0001DC, "Member 'DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common::CallFunc_Vector_IsNAN_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common, CallFunc_BreakVector_X) == 0x0001E0, "Member 'DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common, CallFunc_BreakVector_Y) == 0x0001E4, "Member 'DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common, CallFunc_BreakVector_Z) == 0x0001E8, "Member 'DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common, CallFunc_SignOfFloat_ReturnValue) == 0x0001EC, "Member 'DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common::CallFunc_SignOfFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x0001F0, "Member 'DeadPerformance_Common_C_ExecuteUbergraph_DeadPerformance_Common::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function DeadPerformance_Common.DeadPerformance_Common_C.NewFunction_0
// 0x0190 (0x0190 - 0x0000)
struct DeadPerformance_Common_C_NewFunction_0 final
{
public:
	class AGameCharacter*                         DeadCharacter;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Self2;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         A_X;                                               // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         A_Y;                                               // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         A_Z;                                               // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   A;                                                 // 0x001C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 InComponent;                                       // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InBoneName;                                        // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 InComponent2;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InBoneName2;                                       // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewParam;                                          // 0x0048(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_2;          // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_2;                   // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseMonster_C*                         K2Node_DynamicCast_AsBase_Monster;                 // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetPhysicsLinearVelocity_ReturnValue;     // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVectorInConeInRadians_ReturnValue; // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_GetAbs_ReturnValue;                // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_2;                     // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DeadPerformance_Common_C_NewFunction_0) == 0x000008, "Wrong alignment on DeadPerformance_Common_C_NewFunction_0");
static_assert(sizeof(DeadPerformance_Common_C_NewFunction_0) == 0x000190, "Wrong size on DeadPerformance_Common_C_NewFunction_0");
static_assert(offsetof(DeadPerformance_Common_C_NewFunction_0, DeadCharacter) == 0x000000, "Member 'DeadPerformance_Common_C_NewFunction_0::DeadCharacter' has a wrong offset!");
static_assert(offsetof(DeadPerformance_Common_C_NewFunction_0, Self2) == 0x000008, "Member 'DeadPerformance_Common_C_NewFunction_0::Self2' has a wrong offset!");
static_assert(offsetof(DeadPerformance_Common_C_NewFunction_0, A_X) == 0x000010, "Member 'DeadPerformance_Common_C_NewFunction_0::A_X' has a wrong offset!");
