#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeadPerformance_Girl005_a01ThroughBullet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DeadPerformance_BlueprintBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DeadPerformance_Girl005_a01ThroughBullet.DeadPerformance_Girl005_a01ThroughBullet_C
// 0x0038 (0x0060 - 0x0028)
class UDeadPerformance_Girl005_a01ThroughBullet_C final : public UDeadPerformance_BlueprintBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCurveFloat*                            DissolveTImeCurve;                                 // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Value;                                             // 0x0038(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCurveFloat*>                    AnimTimeCurve;                                     // 0x0048(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         ID;                                                // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DeadPerformanceLogic(class AGameCharacter* DeadCharacter, class AGameCharacter* Killer, class UDeadPerformanceComponent* DeadComponent, const struct FHealthChangeValue& HealthChangeValue);
	void OnTick(class AGameCharacter* DeadCharacter, class AGameCharacter* Killer, class UDeadPerformanceComponent* DeadComponent, const struct FHealthChangeValue& HealthChangeValue, float DeltaTime, float TimeFromBegin);
	void ExecuteUbergraph_DeadPerformance_Girl005_a01ThroughBullet(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DeadPerformance_Girl005_a01ThroughBullet_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DeadPerformance_Girl005_a01ThroughBullet_C")
	}
	static class UDeadPerformance_Girl005_a01ThroughBullet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeadPerformance_Girl005_a01ThroughBullet_C>();
	}
};
DUMPER7_ASSERTS_UDeadPerformance_Girl005_a01ThroughBullet_C;

}

