#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeadPerformance_DLC8

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function DeadPerformance_DLC8.DeadPerformance_DLC8_C.DeadPerformanceLogic
// 0x01C8 (0x01C8 - 0x0000)
struct DeadPerformance_DLC8_C_DeadPerformanceLogic final
{
public:
	class AGameCharacter*                         DeadCharacter;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         Killer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDeadPerformanceComponent*              DeadComponent;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     HealthChangeValue;                                 // 0x0018(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(DeadPerformance_DLC8_C_DeadPerformanceLogic) == 0x000008, "Wrong alignment on DeadPerformance_DLC8_C_DeadPerformanceLogic");
static_assert(sizeof(DeadPerformance_DLC8_C_DeadPerformanceLogic) == 0x0001C8, "Wrong size on DeadPerformance_DLC8_C_DeadPerformanceLogic");
static_assert(offsetof(DeadPerformance_DLC8_C_DeadPerformanceLogic, DeadCharacter) == 0x000000, "Member 'DeadPerformance_DLC8_C_DeadPerformanceLogic::DeadCharacter' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_DeadPerformanceLogic, Killer) == 0x000008, "Member 'DeadPerformance_DLC8_C_DeadPerformanceLogic::Killer' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_DeadPerformanceLogic, DeadComponent) == 0x000010, "Member 'DeadPerformance_DLC8_C_DeadPerformanceLogic::DeadComponent' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_DeadPerformanceLogic, HealthChangeValue) == 0x000018, "Member 'DeadPerformance_DLC8_C_DeadPerformanceLogic::HealthChangeValue' has a wrong offset!");

// Function DeadPerformance_DLC8.DeadPerformance_DLC8_C.ExecuteUbergraph_DeadPerformance_DLC8
// 0x0298 (0x0298 - 0x0000)
struct DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_2;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_3;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_4;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_5;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_6;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_7;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysiqueType                                 ___byte_Variable;                                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ___float_Variable_8;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_9;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_10;                              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_11;                              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_12;                              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_13;                              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_14;                              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_15;                              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysiqueType                                 ___byte_Variable_1;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_Event_DeadCharacter;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_Killer;                               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDeadPerformanceComponent*              K2Node_Event_DeadComponent;                        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_Event_HealthChangeValue;                    // 0x0078(0x01B0)(ConstParm, ContainsInstancedReference)
	EPhysiqueType                                 CallFunc_GetPhysiqueType_ReturnValue;              // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACharacterAccessory*>            CallFunc_GetCharacterAccessories_OutCharacterAccessories; // 0x0238(0x0010)(ReferenceParm)
	class ACharacterAccessory*                    CallFunc_Array_Get_Item;                           // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetGameAnimInstance_ReturnValue;          // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbnormalAnimBase*                      K2Node_DynamicCast_AsAbnormal_Anim_Base;           // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsInFloating_ReturnValue;              // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8) == 0x000008, "Wrong alignment on DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8");
static_assert(sizeof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8) == 0x000298, "Wrong size on DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, EntryPoint) == 0x000000, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::EntryPoint' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, ___float_Variable) == 0x000004, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::___float_Variable' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, ___float_Variable_1) == 0x000008, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::___float_Variable_1' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, ___float_Variable_2) == 0x00000C, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::___float_Variable_2' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, ___float_Variable_3) == 0x000010, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::___float_Variable_3' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, ___float_Variable_4) == 0x000014, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::___float_Variable_4' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, ___float_Variable_5) == 0x000018, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::___float_Variable_5' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, ___float_Variable_6) == 0x00001C, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::___float_Variable_6' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, ___float_Variable_7) == 0x000020, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::___float_Variable_7' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, ___byte_Variable) == 0x000024, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::___byte_Variable' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, ___float_Variable_8) == 0x000028, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::___float_Variable_8' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, ___float_Variable_9) == 0x00002C, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::___float_Variable_9' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, ___float_Variable_10) == 0x000030, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::___float_Variable_10' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, ___float_Variable_11) == 0x000034, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::___float_Variable_11' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, ___float_Variable_12) == 0x000038, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::___float_Variable_12' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, ___float_Variable_13) == 0x00003C, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::___float_Variable_13' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, ___float_Variable_14) == 0x000040, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::___float_Variable_14' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, ___float_Variable_15) == 0x000044, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::___float_Variable_15' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, ___int_Loop_Counter_Variable) == 0x000048, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, CallFunc_Subtract_IntInt_ReturnValue) == 0x00004C, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000050, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, ___int_Array_Index_Variable) == 0x000054, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, ___byte_Variable_1) == 0x000058, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::___byte_Variable_1' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, K2Node_Event_DeadCharacter) == 0x000060, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::K2Node_Event_DeadCharacter' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, K2Node_Event_Killer) == 0x000068, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::K2Node_Event_Killer' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, K2Node_Event_DeadComponent) == 0x000070, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::K2Node_Event_DeadComponent' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, K2Node_Event_HealthChangeValue) == 0x000078, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::K2Node_Event_HealthChangeValue' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, CallFunc_GetPhysiqueType_ReturnValue) == 0x000228, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::CallFunc_GetPhysiqueType_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, K2Node_Select_Default) == 0x00022C, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, K2Node_Select_Default_1) == 0x000230, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, CallFunc_GetCharacterAccessories_OutCharacterAccessories) == 0x000238, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::CallFunc_GetCharacterAccessories_OutCharacterAccessories' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, CallFunc_Array_Get_Item) == 0x000248, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000250, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, CallFunc_Array_Length_ReturnValue) == 0x000258, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, CallFunc_GetGameAnimInstance_ReturnValue) == 0x000260, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::CallFunc_GetGameAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000268, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue) == 0x000270, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, CallFunc_Max_ReturnValue) == 0x000278, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, CallFunc_IsValid_ReturnValue) == 0x00027C, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, K2Node_DynamicCast_AsAbnormal_Anim_Base) == 0x000280, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::K2Node_DynamicCast_AsAbnormal_Anim_Base' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, K2Node_DynamicCast_bSuccess) == 0x000288, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, CallFunc_Montage_Play_ReturnValue) == 0x00028C, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8, CallFunc_GetIsInFloating_ReturnValue) == 0x000290, "Member 'DeadPerformance_DLC8_C_ExecuteUbergraph_DeadPerformance_DLC8::CallFunc_GetIsInFloating_ReturnValue' has a wrong offset!");

}

