#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeadPerformance_Mon101

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DeadPerformance_Mon101.DeadPerformance_Mon101_C.DeadPerformanceLogic
// 0x01C8 (0x01C8 - 0x0000)
struct DeadPerformance_Mon101_C_DeadPerformanceLogic final
{
public:
	class AGameCharacter*                         DeadCharacter;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         Killer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDeadPerformanceComponent*              DeadComponent;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     HealthChangeValue;                                 // 0x0018(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(DeadPerformance_Mon101_C_DeadPerformanceLogic) == 0x000008, "Wrong alignment on DeadPerformance_Mon101_C_DeadPerformanceLogic");
static_assert(sizeof(DeadPerformance_Mon101_C_DeadPerformanceLogic) == 0x0001C8, "Wrong size on DeadPerformance_Mon101_C_DeadPerformanceLogic");
static_assert(offsetof(DeadPerformance_Mon101_C_DeadPerformanceLogic, DeadCharacter) == 0x000000, "Member 'DeadPerformance_Mon101_C_DeadPerformanceLogic::DeadCharacter' has a wrong offset!");
static_assert(offsetof(DeadPerformance_Mon101_C_DeadPerformanceLogic, Killer) == 0x000008, "Member 'DeadPerformance_Mon101_C_DeadPerformanceLogic::Killer' has a wrong offset!");
static_assert(offsetof(DeadPerformance_Mon101_C_DeadPerformanceLogic, DeadComponent) == 0x000010, "Member 'DeadPerformance_Mon101_C_DeadPerformanceLogic::DeadComponent' has a wrong offset!");
static_assert(offsetof(DeadPerformance_Mon101_C_DeadPerformanceLogic, HealthChangeValue) == 0x000018, "Member 'DeadPerformance_Mon101_C_DeadPerformanceLogic::HealthChangeValue' has a wrong offset!");

// Function DeadPerformance_Mon101.DeadPerformance_Mon101_C.ExecuteUbergraph_DeadPerformance_Mon101
// 0x0260 (0x0260 - 0x0000)
struct DeadPerformance_Mon101_C_ExecuteUbergraph_DeadPerformance_Mon101 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_Event_DeadCharacter;                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_Killer;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDeadPerformanceComponent*              K2Node_Event_DeadComponent;                        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_Event_HealthChangeValue;                    // 0x0020(0x01B0)(ConstParm, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x01D0(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(DeadPerformance_Mon101_C_ExecuteUbergraph_DeadPerformance_Mon101) == 0x000008, "Wrong alignment on DeadPerformance_Mon101_C_ExecuteUbergraph_DeadPerformance_Mon101");
static_assert(sizeof(DeadPerformance_Mon101_C_ExecuteUbergraph_DeadPerformance_Mon101) == 0x000260, "Wrong size on DeadPerformance_Mon101_C_ExecuteUbergraph_DeadPerformance_Mon101");
static_assert(offsetof(DeadPerformance_Mon101_C_ExecuteUbergraph_DeadPerformance_Mon101, EntryPoint) == 0x000000, "Member 'DeadPerformance_Mon101_C_ExecuteUbergraph_DeadPerformance_Mon101::EntryPoint' has a wrong offset!");
static_assert(offsetof(DeadPerformance_Mon101_C_ExecuteUbergraph_DeadPerformance_Mon101, K2Node_Event_DeadCharacter) == 0x000008, "Member 'DeadPerformance_Mon101_C_ExecuteUbergraph_DeadPerformance_Mon101::K2Node_Event_DeadCharacter' has a wrong offset!");
static_assert(offsetof(DeadPerformance_Mon101_C_ExecuteUbergraph_DeadPerformance_Mon101, K2Node_Event_Killer) == 0x000010, "Member 'DeadPerformance_Mon101_C_ExecuteUbergraph_DeadPerformance_Mon101::K2Node_Event_Killer' has a wrong offset!");
static_assert(offsetof(DeadPerformance_Mon101_C_ExecuteUbergraph_DeadPerformance_Mon101, K2Node_Event_DeadComponent) == 0x000018, "Member 'DeadPerformance_Mon101_C_ExecuteUbergraph_DeadPerformance_Mon101::K2Node_Event_DeadComponent' has a wrong offset!");
static_assert(offsetof(DeadPerformance_Mon101_C_ExecuteUbergraph_DeadPerformance_Mon101, K2Node_Event_HealthChangeValue) == 0x000020, "Member 'DeadPerformance_Mon101_C_ExecuteUbergraph_DeadPerformance_Mon101::K2Node_Event_HealthChangeValue' has a wrong offset!");
static_assert(offsetof(DeadPerformance_Mon101_C_ExecuteUbergraph_DeadPerformance_Mon101, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0001D0, "Member 'DeadPerformance_Mon101_C_ExecuteUbergraph_DeadPerformance_Mon101::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

}

