#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeadPerformance_BlueprintBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function DeadPerformance_BlueprintBase.DeadPerformance_BlueprintBase_C.CustomFunctionExample
// 0x0058 (0x0058 - 0x0000)
struct DeadPerformance_BlueprintBase_C_CustomFunctionExample final
{
public:
	class AGameCharacter*                         DeadCharacter;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         Killer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DeadPerformance_BlueprintBase_C_CustomFunctionExample) == 0x000008, "Wrong alignment on DeadPerformance_BlueprintBase_C_CustomFunctionExample");
static_assert(sizeof(DeadPerformance_BlueprintBase_C_CustomFunctionExample) == 0x000058, "Wrong size on DeadPerformance_BlueprintBase_C_CustomFunctionExample");
static_assert(offsetof(DeadPerformance_BlueprintBase_C_CustomFunctionExample, DeadCharacter) == 0x000000, "Member 'DeadPerformance_BlueprintBase_C_CustomFunctionExample::DeadCharacter' has a wrong offset!");
static_assert(offsetof(DeadPerformance_BlueprintBase_C_CustomFunctionExample, Killer) == 0x000008, "Member 'DeadPerformance_BlueprintBase_C_CustomFunctionExample::Killer' has a wrong offset!");
static_assert(offsetof(DeadPerformance_BlueprintBase_C_CustomFunctionExample, BoneName) == 0x000010, "Member 'DeadPerformance_BlueprintBase_C_CustomFunctionExample::BoneName' has a wrong offset!");
static_assert(offsetof(DeadPerformance_BlueprintBase_C_CustomFunctionExample, CallFunc_RandomFloatInRange_ReturnValue) == 0x000018, "Member 'DeadPerformance_BlueprintBase_C_CustomFunctionExample::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeadPerformance_BlueprintBase_C_CustomFunctionExample, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'DeadPerformance_BlueprintBase_C_CustomFunctionExample::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeadPerformance_BlueprintBase_C_CustomFunctionExample, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000028, "Member 'DeadPerformance_BlueprintBase_C_CustomFunctionExample::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DeadPerformance_BlueprintBase_C_CustomFunctionExample, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000034, "Member 'DeadPerformance_BlueprintBase_C_CustomFunctionExample::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeadPerformance_BlueprintBase_C_CustomFunctionExample, CallFunc_Normal_ReturnValue) == 0x000040, "Member 'DeadPerformance_BlueprintBase_C_CustomFunctionExample::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeadPerformance_BlueprintBase_C_CustomFunctionExample, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00004C, "Member 'DeadPerformance_BlueprintBase_C_CustomFunctionExample::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

}

