#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeadPerformance_Common

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DeadPerformance_BlueprintBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DeadPerformance_Common.DeadPerformance_Common_C
// 0x0018 (0x0040 - 0x0028)
class UDeadPerformance_Common_C : public UDeadPerformance_BlueprintBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         ImpulseMin;                                        // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ImpulseMax;                                        // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Angle;                                             // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DeadPerformanceLogic(class AGameCharacter* DeadCharacter, class AGameCharacter* Killer, class UDeadPerformanceComponent* DeadComponent, const struct FHealthChangeValue& HealthChangeValue);
	void ExecuteUbergraph_DeadPerformance_Common(int32 EntryPoint);
	void NewFunction_0(class AGameCharacter* DeadCharacter, class USkeletalMeshComponent* Self2, float A_X, float A_Y, float A_Z, class FName A, class USkeletalMeshComponent* InComponent, class FName InBoneName, class USkeletalMeshComponent* InComponent2, class FName InBoneName2, float NewParam);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DeadPerformance_Common_C">();
	}
	static class UDeadPerformance_Common_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeadPerformance_Common_C>();
	}
};
static_assert(alignof(UDeadPerformance_Common_C) == 0x000008, "Wrong alignment on UDeadPerformance_Common_C");
static_assert(sizeof(UDeadPerformance_Common_C) == 0x000040, "Wrong size on UDeadPerformance_Common_C");
static_assert(offsetof(UDeadPerformance_Common_C, UberGraphFrame) == 0x000028, "Member 'UDeadPerformance_Common_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDeadPerformance_Common_C, ImpulseMin) == 0x000030, "Member 'UDeadPerformance_Common_C::ImpulseMin' has a wrong offset!");
static_assert(offsetof(UDeadPerformance_Common_C, ImpulseMax) == 0x000034, "Member 'UDeadPerformance_Common_C::ImpulseMax' has a wrong offset!");
static_assert(offsetof(UDeadPerformance_Common_C, Angle) == 0x000038, "Member 'UDeadPerformance_Common_C::Angle' has a wrong offset!");

}

