#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeadPerformance_Zuma

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DeadPerformance_BlueprintBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DeadPerformance_Zuma.DeadPerformance_Zuma_C
// 0x0018 (0x0040 - 0x0028)
class UDeadPerformance_Zuma_C final : public UDeadPerformance_BlueprintBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCurveFloat*                            DissolveCurve;                                     // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CustomDelay;                                       // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DeadPerformance_Zuma(int32 EntryPoint);
	void DeadPerformanceLogic(class AGameCharacter* DeadCharacter, class AGameCharacter* Killer, class UDeadPerformanceComponent* DeadComponent, const struct FHealthChangeValue& HealthChangeValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DeadPerformance_Zuma_C">();
	}
	static class UDeadPerformance_Zuma_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeadPerformance_Zuma_C>();
	}
};
static_assert(alignof(UDeadPerformance_Zuma_C) == 0x000008, "Wrong alignment on UDeadPerformance_Zuma_C");
static_assert(sizeof(UDeadPerformance_Zuma_C) == 0x000040, "Wrong size on UDeadPerformance_Zuma_C");
static_assert(offsetof(UDeadPerformance_Zuma_C, UberGraphFrame) == 0x000028, "Member 'UDeadPerformance_Zuma_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDeadPerformance_Zuma_C, DissolveCurve) == 0x000030, "Member 'UDeadPerformance_Zuma_C::DissolveCurve' has a wrong offset!");
static_assert(offsetof(UDeadPerformance_Zuma_C, CustomDelay) == 0x000038, "Member 'UDeadPerformance_Zuma_C::CustomDelay' has a wrong offset!");

}

