#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeadPerformance_Mon101

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DeadPerformance_BlueprintBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DeadPerformance_Mon101.DeadPerformance_Mon101_C
// 0x0020 (0x0048 - 0x0028)
class UDeadPerformance_Mon101_C final : public UDeadPerformance_BlueprintBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FString                                 TestString;                                        // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         ImpulseMin;                                        // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ImpulseMax;                                        // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DeadPerformanceLogic(class AGameCharacter* DeadCharacter, class AGameCharacter* Killer, class UDeadPerformanceComponent* DeadComponent, const struct FHealthChangeValue& HealthChangeValue);
	void ExecuteUbergraph_DeadPerformance_Mon101(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DeadPerformance_Mon101_C">();
	}
	static class UDeadPerformance_Mon101_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeadPerformance_Mon101_C>();
	}
};
static_assert(alignof(UDeadPerformance_Mon101_C) == 0x000008, "Wrong alignment on UDeadPerformance_Mon101_C");
static_assert(sizeof(UDeadPerformance_Mon101_C) == 0x000048, "Wrong size on UDeadPerformance_Mon101_C");
static_assert(offsetof(UDeadPerformance_Mon101_C, UberGraphFrame) == 0x000028, "Member 'UDeadPerformance_Mon101_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDeadPerformance_Mon101_C, TestString) == 0x000030, "Member 'UDeadPerformance_Mon101_C::TestString' has a wrong offset!");
static_assert(offsetof(UDeadPerformance_Mon101_C, ImpulseMin) == 0x000040, "Member 'UDeadPerformance_Mon101_C::ImpulseMin' has a wrong offset!");
static_assert(offsetof(UDeadPerformance_Mon101_C, ImpulseMax) == 0x000044, "Member 'UDeadPerformance_Mon101_C::ImpulseMax' has a wrong offset!");

}

