#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DecryptItem

#include "Basic.hpp"


namespace SDK::Params
{

// Function DecryptItem.DecryptItem_C.OnSwitchToOff
// 0x0008 (0x0008 - 0x0000)
struct DecryptItem_C_OnSwitchToOff final
{
public:
	class UObject*                                Switch;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DecryptItem_C_OnSwitchToOff) == 0x000008, "Wrong alignment on DecryptItem_C_OnSwitchToOff");
static_assert(sizeof(DecryptItem_C_OnSwitchToOff) == 0x000008, "Wrong size on DecryptItem_C_OnSwitchToOff");
static_assert(offsetof(DecryptItem_C_OnSwitchToOff, Switch) == 0x000000, "Member 'DecryptItem_C_OnSwitchToOff::Switch' has a wrong offset!");

// Function DecryptItem.DecryptItem_C.OnSwitchToOpen
// 0x0008 (0x0008 - 0x0000)
struct DecryptItem_C_OnSwitchToOpen final
{
public:
	class UObject*                                Switch;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DecryptItem_C_OnSwitchToOpen) == 0x000008, "Wrong alignment on DecryptItem_C_OnSwitchToOpen");
static_assert(sizeof(DecryptItem_C_OnSwitchToOpen) == 0x000008, "Wrong size on DecryptItem_C_OnSwitchToOpen");
static_assert(offsetof(DecryptItem_C_OnSwitchToOpen, Switch) == 0x000000, "Member 'DecryptItem_C_OnSwitchToOpen::Switch' has a wrong offset!");

}

