#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DefaultPlayerMoveComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DefaultPlayerMoveComponent.DefaultPlayerMoveComponent_C
// 0x0030 (0x1410 - 0x13E0)
#pragma pack(push, 0x1)
class alignas(0x10) UDefaultPlayerMoveComponent_C : public UPlayerMovementComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x13E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          NewVar_0;                                          // 0x13E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13E9[0x7];                                     // 0x13E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameController_C*                   PlayerController;                                  // 0x13F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponent*                      Ability;                                           // 0x13F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         GameCharacter;                                     // 0x1400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool ReceiveCustomSpeedCurve(struct FCustomSpeedCurve* CustomSpeedCurve);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_DefaultPlayerMoveComponent(int32 EntryPoint);

	struct FRotator ReceiveCustomRotation(const struct FRotator& CurrentRotation, const struct FRotator& TargetRotation, float DeltaTime) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DefaultPlayerMoveComponent_C">();
	}
	static class UDefaultPlayerMoveComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultPlayerMoveComponent_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(UDefaultPlayerMoveComponent_C) == 0x000010, "Wrong alignment on UDefaultPlayerMoveComponent_C");
static_assert(sizeof(UDefaultPlayerMoveComponent_C) == 0x001410, "Wrong size on UDefaultPlayerMoveComponent_C");
static_assert(offsetof(UDefaultPlayerMoveComponent_C, UberGraphFrame) == 0x0013E0, "Member 'UDefaultPlayerMoveComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDefaultPlayerMoveComponent_C, NewVar_0) == 0x0013E8, "Member 'UDefaultPlayerMoveComponent_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UDefaultPlayerMoveComponent_C, PlayerController) == 0x0013F0, "Member 'UDefaultPlayerMoveComponent_C::PlayerController' has a wrong offset!");
static_assert(offsetof(UDefaultPlayerMoveComponent_C, Ability) == 0x0013F8, "Member 'UDefaultPlayerMoveComponent_C::Ability' has a wrong offset!");
static_assert(offsetof(UDefaultPlayerMoveComponent_C, GameCharacter) == 0x001400, "Member 'UDefaultPlayerMoveComponent_C::GameCharacter' has a wrong offset!");

}

