#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DefaultPlayerMoveComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function DefaultPlayerMoveComponent.DefaultPlayerMoveComponent_C.ReceiveCustomSpeedCurve
// 0x00D0 (0x00D0 - 0x0000)
struct DefaultPlayerMoveComponent_C_ReceiveCustomSpeedCurve final
{
public:
	struct FCustomSpeedCurve                      CustomSpeedCurve;                                  // 0x0000(0x0030)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable;                                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomSpeedCurve                      CallFunc_GetCustomSpeed_ReturnValue;               // 0x0038(0x0030)()
	struct FCustomSpeedCurve                      CallFunc_GetCustomSpeed_ReturnValue_1;             // 0x0068(0x0030)()
	bool                                          CallFunc_IsAdvancedAction_ReturnValue;             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomSpeedCurve                      K2Node_Select_Default;                             // 0x00A0(0x0030)()
};
static_assert(alignof(DefaultPlayerMoveComponent_C_ReceiveCustomSpeedCurve) == 0x000008, "Wrong alignment on DefaultPlayerMoveComponent_C_ReceiveCustomSpeedCurve");
static_assert(sizeof(DefaultPlayerMoveComponent_C_ReceiveCustomSpeedCurve) == 0x0000D0, "Wrong size on DefaultPlayerMoveComponent_C_ReceiveCustomSpeedCurve");
static_assert(offsetof(DefaultPlayerMoveComponent_C_ReceiveCustomSpeedCurve, CustomSpeedCurve) == 0x000000, "Member 'DefaultPlayerMoveComponent_C_ReceiveCustomSpeedCurve::CustomSpeedCurve' has a wrong offset!");
static_assert(offsetof(DefaultPlayerMoveComponent_C_ReceiveCustomSpeedCurve, ReturnValue) == 0x000030, "Member 'DefaultPlayerMoveComponent_C_ReceiveCustomSpeedCurve::ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultPlayerMoveComponent_C_ReceiveCustomSpeedCurve, ___bool_Variable) == 0x000031, "Member 'DefaultPlayerMoveComponent_C_ReceiveCustomSpeedCurve::___bool_Variable' has a wrong offset!");
static_assert(offsetof(DefaultPlayerMoveComponent_C_ReceiveCustomSpeedCurve, CallFunc_GetCustomSpeed_ReturnValue) == 0x000038, "Member 'DefaultPlayerMoveComponent_C_ReceiveCustomSpeedCurve::CallFunc_GetCustomSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultPlayerMoveComponent_C_ReceiveCustomSpeedCurve, CallFunc_GetCustomSpeed_ReturnValue_1) == 0x000068, "Member 'DefaultPlayerMoveComponent_C_ReceiveCustomSpeedCurve::CallFunc_GetCustomSpeed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DefaultPlayerMoveComponent_C_ReceiveCustomSpeedCurve, CallFunc_IsAdvancedAction_ReturnValue) == 0x000098, "Member 'DefaultPlayerMoveComponent_C_ReceiveCustomSpeedCurve::CallFunc_IsAdvancedAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultPlayerMoveComponent_C_ReceiveCustomSpeedCurve, K2Node_Select_Default) == 0x0000A0, "Member 'DefaultPlayerMoveComponent_C_ReceiveCustomSpeedCurve::K2Node_Select_Default' has a wrong offset!");

// Function DefaultPlayerMoveComponent.DefaultPlayerMoveComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct DefaultPlayerMoveComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DefaultPlayerMoveComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on DefaultPlayerMoveComponent_C_ReceiveTick");
static_assert(sizeof(DefaultPlayerMoveComponent_C_ReceiveTick) == 0x000004, "Wrong size on DefaultPlayerMoveComponent_C_ReceiveTick");
static_assert(offsetof(DefaultPlayerMoveComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'DefaultPlayerMoveComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function DefaultPlayerMoveComponent.DefaultPlayerMoveComponent_C.ExecuteUbergraph_DefaultPlayerMoveComponent
// 0x0058 (0x0058 - 0x0000)
struct DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayerController*                  CallFunc_GetCharacterController_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameController_C*                   K2Node_DynamicCast_AsBP_Game_Controller;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponent*                      CallFunc_GetComponentByClass_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent) == 0x000008, "Wrong alignment on DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent");
static_assert(sizeof(DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent) == 0x000058, "Wrong size on DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent");
static_assert(offsetof(DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent, EntryPoint) == 0x000000, "Member 'DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent, K2Node_DynamicCast_AsGame_Character) == 0x000018, "Member 'DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent, CallFunc_GetOwner_ReturnValue_1) == 0x000028, "Member 'DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent, CallFunc_GetCharacterController_ReturnValue) == 0x000038, "Member 'DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent::CallFunc_GetCharacterController_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent, K2Node_DynamicCast_AsBP_Game_Controller) == 0x000040, "Member 'DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent::K2Node_DynamicCast_AsBP_Game_Controller' has a wrong offset!");
static_assert(offsetof(DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent, CallFunc_GetComponentByClass_ReturnValue) == 0x000050, "Member 'DefaultPlayerMoveComponent_C_ExecuteUbergraph_DefaultPlayerMoveComponent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function DefaultPlayerMoveComponent.DefaultPlayerMoveComponent_C.ReceiveCustomRotation
// 0x0038 (0x0038 - 0x0000)
struct DefaultPlayerMoveComponent_C_ReceiveCustomRotation final
{
public:
	struct FRotator                               CurrentRotation;                                   // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               TargetRotation;                                    // 0x000C(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         DeltaTime;                                         // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ReturnValue;                                       // 0x001C(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTureSpeed_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DefaultPlayerMoveComponent_C_ReceiveCustomRotation) == 0x000004, "Wrong alignment on DefaultPlayerMoveComponent_C_ReceiveCustomRotation");
static_assert(sizeof(DefaultPlayerMoveComponent_C_ReceiveCustomRotation) == 0x000038, "Wrong size on DefaultPlayerMoveComponent_C_ReceiveCustomRotation");
static_assert(offsetof(DefaultPlayerMoveComponent_C_ReceiveCustomRotation, CurrentRotation) == 0x000000, "Member 'DefaultPlayerMoveComponent_C_ReceiveCustomRotation::CurrentRotation' has a wrong offset!");
static_assert(offsetof(DefaultPlayerMoveComponent_C_ReceiveCustomRotation, TargetRotation) == 0x00000C, "Member 'DefaultPlayerMoveComponent_C_ReceiveCustomRotation::TargetRotation' has a wrong offset!");
static_assert(offsetof(DefaultPlayerMoveComponent_C_ReceiveCustomRotation, DeltaTime) == 0x000018, "Member 'DefaultPlayerMoveComponent_C_ReceiveCustomRotation::DeltaTime' has a wrong offset!");
static_assert(offsetof(DefaultPlayerMoveComponent_C_ReceiveCustomRotation, ReturnValue) == 0x00001C, "Member 'DefaultPlayerMoveComponent_C_ReceiveCustomRotation::ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultPlayerMoveComponent_C_ReceiveCustomRotation, CallFunc_GetTureSpeed_ReturnValue) == 0x000028, "Member 'DefaultPlayerMoveComponent_C_ReceiveCustomRotation::CallFunc_GetTureSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultPlayerMoveComponent_C_ReceiveCustomRotation, CallFunc_RInterpTo_ReturnValue) == 0x00002C, "Member 'DefaultPlayerMoveComponent_C_ReceiveCustomRotation::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");

}

