#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DefaultCharacterStateMachine

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CharacterStateId_structs.hpp"
#include "Game_structs.hpp"
#include "FireStateEvent_structs.hpp"
#include "FireStateId_structs.hpp"
#include "CharacterStateEvent_structs.hpp"


namespace SDK::Params
{

// Function DefaultCharacterStateMachine.DefaultCharacterStateMachine_C.ReceiveHook
// 0x0020 (0x0020 - 0x0000)
struct DefaultCharacterStateMachine_C_ReceiveHook final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DefaultCharacterStateMachine_C_ReceiveHook) == 0x000008, "Wrong alignment on DefaultCharacterStateMachine_C_ReceiveHook");
static_assert(sizeof(DefaultCharacterStateMachine_C_ReceiveHook) == 0x000020, "Wrong size on DefaultCharacterStateMachine_C_ReceiveHook");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveHook, ReturnValue) == 0x000000, "Member 'DefaultCharacterStateMachine_C_ReceiveHook::ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveHook, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'DefaultCharacterStateMachine_C_ReceiveHook::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveHook, K2Node_DynamicCast_AsGame_Character) == 0x000010, "Member 'DefaultCharacterStateMachine_C_ReceiveHook::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveHook, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'DefaultCharacterStateMachine_C_ReceiveHook::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function DefaultCharacterStateMachine.DefaultCharacterStateMachine_C.TryInterruptDodge
// 0x0030 (0x0030 - 0x0000)
struct DefaultCharacterStateMachine_C_TryInterruptDodge final
{
public:
	int32                                         DodgeIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponent*                      CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryInterruptAnimSkill_ReturnValue;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DefaultCharacterStateMachine_C_TryInterruptDodge) == 0x000008, "Wrong alignment on DefaultCharacterStateMachine_C_TryInterruptDodge");
static_assert(sizeof(DefaultCharacterStateMachine_C_TryInterruptDodge) == 0x000030, "Wrong size on DefaultCharacterStateMachine_C_TryInterruptDodge");
static_assert(offsetof(DefaultCharacterStateMachine_C_TryInterruptDodge, DodgeIndex) == 0x000000, "Member 'DefaultCharacterStateMachine_C_TryInterruptDodge::DodgeIndex' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_TryInterruptDodge, OutValue) == 0x000004, "Member 'DefaultCharacterStateMachine_C_TryInterruptDodge::OutValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_TryInterruptDodge, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000005, "Member 'DefaultCharacterStateMachine_C_TryInterruptDodge::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_TryInterruptDodge, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'DefaultCharacterStateMachine_C_TryInterruptDodge::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_TryInterruptDodge, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'DefaultCharacterStateMachine_C_TryInterruptDodge::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_TryInterruptDodge, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'DefaultCharacterStateMachine_C_TryInterruptDodge::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_TryInterruptDodge, CallFunc_Array_Get_Item) == 0x00001C, "Member 'DefaultCharacterStateMachine_C_TryInterruptDodge::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_TryInterruptDodge, CallFunc_TryInterruptAnimSkill_ReturnValue) == 0x000020, "Member 'DefaultCharacterStateMachine_C_TryInterruptDodge::CallFunc_TryInterruptAnimSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_TryInterruptDodge, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'DefaultCharacterStateMachine_C_TryInterruptDodge::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_TryInterruptDodge, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'DefaultCharacterStateMachine_C_TryInterruptDodge::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_TryInterruptDodge, CallFunc_BooleanAND_ReturnValue) == 0x000029, "Member 'DefaultCharacterStateMachine_C_TryInterruptDodge::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function DefaultCharacterStateMachine.DefaultCharacterStateMachine_C.ReceiveStopSlide
// 0x0006 (0x0006 - 0x0000)
struct DefaultCharacterStateMachine_C_ReceiveStopSlide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetCurrentStateId_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStateEventId_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DefaultCharacterStateMachine_C_ReceiveStopSlide) == 0x000001, "Wrong alignment on DefaultCharacterStateMachine_C_ReceiveStopSlide");
static_assert(sizeof(DefaultCharacterStateMachine_C_ReceiveStopSlide) == 0x000006, "Wrong size on DefaultCharacterStateMachine_C_ReceiveStopSlide");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveStopSlide, ReturnValue) == 0x000000, "Member 'DefaultCharacterStateMachine_C_ReceiveStopSlide::ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveStopSlide, CallFunc_MakeLiteralByte_ReturnValue) == 0x000001, "Member 'DefaultCharacterStateMachine_C_ReceiveStopSlide::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveStopSlide, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000002, "Member 'DefaultCharacterStateMachine_C_ReceiveStopSlide::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveStopSlide, CallFunc_GetCurrentStateId_ReturnValue) == 0x000003, "Member 'DefaultCharacterStateMachine_C_ReceiveStopSlide::CallFunc_GetCurrentStateId_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveStopSlide, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'DefaultCharacterStateMachine_C_ReceiveStopSlide::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveStopSlide, CallFunc_SetStateEventId_ReturnValue) == 0x000005, "Member 'DefaultCharacterStateMachine_C_ReceiveStopSlide::CallFunc_SetStateEventId_ReturnValue' has a wrong offset!");

// Function DefaultCharacterStateMachine.DefaultCharacterStateMachine_C.ReceiveStartSlide
// 0x0003 (0x0003 - 0x0000)
struct DefaultCharacterStateMachine_C_ReceiveStartSlide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStateEventId_ReturnValue;              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DefaultCharacterStateMachine_C_ReceiveStartSlide) == 0x000001, "Wrong alignment on DefaultCharacterStateMachine_C_ReceiveStartSlide");
static_assert(sizeof(DefaultCharacterStateMachine_C_ReceiveStartSlide) == 0x000003, "Wrong size on DefaultCharacterStateMachine_C_ReceiveStartSlide");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveStartSlide, ReturnValue) == 0x000000, "Member 'DefaultCharacterStateMachine_C_ReceiveStartSlide::ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveStartSlide, CallFunc_MakeLiteralByte_ReturnValue) == 0x000001, "Member 'DefaultCharacterStateMachine_C_ReceiveStartSlide::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveStartSlide, CallFunc_SetStateEventId_ReturnValue) == 0x000002, "Member 'DefaultCharacterStateMachine_C_ReceiveStartSlide::CallFunc_SetStateEventId_ReturnValue' has a wrong offset!");

// Function DefaultCharacterStateMachine.DefaultCharacterStateMachine_C.ReceiveBunkerInteract
// 0x0128 (0x0128 - 0x0000)
struct DefaultCharacterStateMachine_C_ReceiveBunkerInteract final
{
public:
	bool                                          bMoveNextLinkedBunker;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIngnoreAngleCondition;                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalcBunkerInfo_WithLinkedBlindage_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStateEventId_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CalcBunkerInfo_WithBlindage_ReturnValue;  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStateEventId_ReturnValue_1;            // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player_1;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInBlindageReadyState_ReturnValue;       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player_2;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_4;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponent*                      CallFunc_GetComponentByClass_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStateEventId_ReturnValue_2;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckBunkerInteractSkill_ReturnValue;     // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_5;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_6;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponent*                      CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckBunkerSwitchSkill_ReturnValue;       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_7;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player_3;                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_8;                   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStateEventId_ReturnValue_3;            // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_9;                   // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_10;                  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player_4;                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_11;                  // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player_5;                // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_12;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponent*                      CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStateEventId_ReturnValue_4;            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckBunkerInteractSkill_ReturnValue_1;   // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetCurrentStateId_ReturnValue;            // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract) == 0x000008, "Wrong alignment on DefaultCharacterStateMachine_C_ReceiveBunkerInteract");
static_assert(sizeof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract) == 0x000128, "Wrong size on DefaultCharacterStateMachine_C_ReceiveBunkerInteract");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, bMoveNextLinkedBunker) == 0x000000, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::bMoveNextLinkedBunker' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, bIngnoreAngleCondition) == 0x000001, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::bIngnoreAngleCondition' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, ReturnValue) == 0x000002, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_MakeLiteralByte_ReturnValue) == 0x000003, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_CalcBunkerInfo_WithLinkedBlindage_ReturnValue) == 0x000004, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_CalcBunkerInfo_WithLinkedBlindage_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_SetStateEventId_ReturnValue) == 0x00000C, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_SetStateEventId_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000D, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x00000E, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_CalcBunkerInfo_WithBlindage_ReturnValue) == 0x000010, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_CalcBunkerInfo_WithBlindage_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_GreaterEqual_IntInt_ReturnValue_2) == 0x000014, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_GreaterEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000015, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000016, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_SetStateEventId_ReturnValue_1) == 0x000017, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_SetStateEventId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_GetOwner_ReturnValue_1) == 0x000020, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, K2Node_DynamicCast_AsGame_Player) == 0x000028, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::K2Node_DynamicCast_AsGame_Player' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, K2Node_DynamicCast_AsGame_Player_1) == 0x000038, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::K2Node_DynamicCast_AsGame_Player_1' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_IsInBlindageReadyState_ReturnValue) == 0x000041, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_IsInBlindageReadyState_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_GetOwner_ReturnValue_2) == 0x000048, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, K2Node_DynamicCast_AsGame_Player_2) == 0x000050, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::K2Node_DynamicCast_AsGame_Player_2' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_GetOwner_ReturnValue_3) == 0x000060, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000068, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_GetOwner_ReturnValue_4) == 0x000070, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_GetOwner_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_GetComponentByClass_ReturnValue) == 0x000078, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_SetStateEventId_ReturnValue_2) == 0x000080, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_SetStateEventId_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_CheckBunkerInteractSkill_ReturnValue) == 0x000081, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_CheckBunkerInteractSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_GetOwner_ReturnValue_5) == 0x000088, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_GetOwner_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_GetOwner_ReturnValue_6) == 0x000090, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_GetOwner_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000098, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_CheckBunkerSwitchSkill_ReturnValue) == 0x0000A0, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_CheckBunkerSwitchSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_GetOwner_ReturnValue_7) == 0x0000A8, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_GetOwner_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, K2Node_DynamicCast_AsGame_Player_3) == 0x0000B0, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::K2Node_DynamicCast_AsGame_Player_3' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, K2Node_DynamicCast_bSuccess_3) == 0x0000B8, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x0000B9, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_GetOwner_ReturnValue_8) == 0x0000C0, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_GetOwner_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_SetStateEventId_ReturnValue_3) == 0x0000C8, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_SetStateEventId_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_GetOwner_ReturnValue_9) == 0x0000D0, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_GetOwner_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_GetOwner_ReturnValue_10) == 0x0000D8, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_GetOwner_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, K2Node_DynamicCast_AsGame_Player_4) == 0x0000E0, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::K2Node_DynamicCast_AsGame_Player_4' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, K2Node_DynamicCast_bSuccess_4) == 0x0000E8, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_GetOwner_ReturnValue_11) == 0x0000F0, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_GetOwner_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, K2Node_DynamicCast_AsGame_Player_5) == 0x0000F8, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::K2Node_DynamicCast_AsGame_Player_5' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, K2Node_DynamicCast_bSuccess_5) == 0x000100, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_GetOwner_ReturnValue_12) == 0x000108, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_GetOwner_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000110, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_GetComponentByClass_ReturnValue_2) == 0x000118, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_SetStateEventId_ReturnValue_4) == 0x000120, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_SetStateEventId_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_CheckBunkerInteractSkill_ReturnValue_1) == 0x000121, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_CheckBunkerInteractSkill_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_GetCurrentStateId_ReturnValue) == 0x000122, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_GetCurrentStateId_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveBunkerInteract, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000123, "Member 'DefaultCharacterStateMachine_C_ReceiveBunkerInteract::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function DefaultCharacterStateMachine.DefaultCharacterStateMachine_C.ReceiveCross
// 0x0030 (0x0030 - 0x0000)
struct DefaultCharacterStateMachine_C_ReceiveCross final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalcCrossInfo_ReturnValue;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponent*                      CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCrossSkill_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DefaultCharacterStateMachine_C_ReceiveCross) == 0x000008, "Wrong alignment on DefaultCharacterStateMachine_C_ReceiveCross");
static_assert(sizeof(DefaultCharacterStateMachine_C_ReceiveCross) == 0x000030, "Wrong size on DefaultCharacterStateMachine_C_ReceiveCross");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveCross, ReturnValue) == 0x000000, "Member 'DefaultCharacterStateMachine_C_ReceiveCross::ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveCross, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'DefaultCharacterStateMachine_C_ReceiveCross::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveCross, CallFunc_CalcCrossInfo_ReturnValue) == 0x000010, "Member 'DefaultCharacterStateMachine_C_ReceiveCross::CallFunc_CalcCrossInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveCross, CallFunc_GetOwner_ReturnValue_1) == 0x000018, "Member 'DefaultCharacterStateMachine_C_ReceiveCross::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveCross, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'DefaultCharacterStateMachine_C_ReceiveCross::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveCross, CallFunc_CheckCrossSkill_ReturnValue) == 0x000028, "Member 'DefaultCharacterStateMachine_C_ReceiveCross::CallFunc_CheckCrossSkill_ReturnValue' has a wrong offset!");

// Function DefaultCharacterStateMachine.DefaultCharacterStateMachine_C.StopWeaponFire
// 0x0028 (0x0028 - 0x0000)
struct DefaultCharacterStateMachine_C_StopWeaponFire final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerWeapon*                          CallFunc_GetWeapon_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DefaultCharacterStateMachine_C_StopWeaponFire) == 0x000008, "Wrong alignment on DefaultCharacterStateMachine_C_StopWeaponFire");
static_assert(sizeof(DefaultCharacterStateMachine_C_StopWeaponFire) == 0x000028, "Wrong size on DefaultCharacterStateMachine_C_StopWeaponFire");
static_assert(offsetof(DefaultCharacterStateMachine_C_StopWeaponFire, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'DefaultCharacterStateMachine_C_StopWeaponFire::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_StopWeaponFire, K2Node_DynamicCast_AsGame_Character) == 0x000008, "Member 'DefaultCharacterStateMachine_C_StopWeaponFire::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_StopWeaponFire, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'DefaultCharacterStateMachine_C_StopWeaponFire::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_StopWeaponFire, CallFunc_GetWeapon_ReturnValue) == 0x000018, "Member 'DefaultCharacterStateMachine_C_StopWeaponFire::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_StopWeaponFire, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'DefaultCharacterStateMachine_C_StopWeaponFire::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function DefaultCharacterStateMachine.DefaultCharacterStateMachine_C.IsFalling
// 0x0020 (0x0020 - 0x0000)
struct DefaultCharacterStateMachine_C_IsFalling final
{
public:
	bool                                          bResult;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_As__;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DefaultCharacterStateMachine_C_IsFalling) == 0x000008, "Wrong alignment on DefaultCharacterStateMachine_C_IsFalling");
static_assert(sizeof(DefaultCharacterStateMachine_C_IsFalling) == 0x000020, "Wrong size on DefaultCharacterStateMachine_C_IsFalling");
static_assert(offsetof(DefaultCharacterStateMachine_C_IsFalling, bResult) == 0x000000, "Member 'DefaultCharacterStateMachine_C_IsFalling::bResult' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_IsFalling, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'DefaultCharacterStateMachine_C_IsFalling::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_IsFalling, K2Node_DynamicCast_As__) == 0x000010, "Member 'DefaultCharacterStateMachine_C_IsFalling::K2Node_DynamicCast_As__' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_IsFalling, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'DefaultCharacterStateMachine_C_IsFalling::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_IsFalling, CallFunc_IsFalling_ReturnValue) == 0x000019, "Member 'DefaultCharacterStateMachine_C_IsFalling::CallFunc_IsFalling_ReturnValue' has a wrong offset!");

// Function DefaultCharacterStateMachine.DefaultCharacterStateMachine_C.ReceiveForceIdle
// 0x0021 (0x0021 - 0x0000)
struct DefaultCharacterStateMachine_C_ReceiveForceIdle final
{
public:
	bool                                          bIsUpperBody;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterStateId                             ___byte_Variable;                                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable;                                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable_1;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable_2;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable_3;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable_4;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable_5;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable_6;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable_7;                                // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable_8;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable_9;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable_10;                               // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStateEventId_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetCurrentStateId_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCharacterActionState_ReturnValue;    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCharacterActionState_ReturnValue_1;  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCharacterActionState_ReturnValue_2;  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCharacterActionState_ReturnValue_3;  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetCurrentStateId_ReturnValue_1;          // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_ByteByte_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStateEventId_ReturnValue_1;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetCurrentStateId_ReturnValue_2;          // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DefaultCharacterStateMachine_C_ReceiveForceIdle) == 0x000001, "Wrong alignment on DefaultCharacterStateMachine_C_ReceiveForceIdle");
static_assert(sizeof(DefaultCharacterStateMachine_C_ReceiveForceIdle) == 0x000021, "Wrong size on DefaultCharacterStateMachine_C_ReceiveForceIdle");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, bIsUpperBody) == 0x000000, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::bIsUpperBody' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, ReturnValue) == 0x000001, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, CallFunc_MakeLiteralByte_ReturnValue) == 0x000002, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, ___byte_Variable) == 0x000003, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::___byte_Variable' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, ___bool_Variable) == 0x000004, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::___bool_Variable' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, ___bool_Variable_1) == 0x000005, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::___bool_Variable_1' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, ___bool_Variable_2) == 0x000006, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::___bool_Variable_2' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, ___bool_Variable_3) == 0x000007, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::___bool_Variable_3' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, ___bool_Variable_4) == 0x000008, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::___bool_Variable_4' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, ___bool_Variable_5) == 0x000009, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::___bool_Variable_5' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, ___bool_Variable_6) == 0x00000A, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::___bool_Variable_6' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, ___bool_Variable_7) == 0x00000B, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::___bool_Variable_7' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, ___bool_Variable_8) == 0x00000C, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::___bool_Variable_8' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, ___bool_Variable_9) == 0x00000D, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::___bool_Variable_9' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, ___bool_Variable_10) == 0x00000E, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::___bool_Variable_10' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00000F, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, CallFunc_SetStateEventId_ReturnValue) == 0x000010, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::CallFunc_SetStateEventId_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, CallFunc_GetCurrentStateId_ReturnValue) == 0x000011, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::CallFunc_GetCurrentStateId_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, CallFunc_CheckCharacterActionState_ReturnValue) == 0x000012, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::CallFunc_CheckCharacterActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, CallFunc_CheckCharacterActionState_ReturnValue_1) == 0x000013, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::CallFunc_CheckCharacterActionState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, CallFunc_CheckCharacterActionState_ReturnValue_2) == 0x000014, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::CallFunc_CheckCharacterActionState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, CallFunc_CheckCharacterActionState_ReturnValue_3) == 0x000015, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::CallFunc_CheckCharacterActionState_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000016, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, CallFunc_GetCurrentStateId_ReturnValue_1) == 0x000017, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::CallFunc_GetCurrentStateId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, CallFunc_Less_ByteByte_ReturnValue) == 0x000018, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::CallFunc_Less_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, CallFunc_SetStateEventId_ReturnValue_1) == 0x000019, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::CallFunc_SetStateEventId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x00001A, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, CallFunc_GetCurrentStateId_ReturnValue_2) == 0x00001B, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::CallFunc_GetCurrentStateId_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, CallFunc_GetValidValue_ReturnValue) == 0x00001C, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultCharacterStateMachine_C_ReceiveForceIdle, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001D, "Member 'DefaultCharacterStateMachine_C_ReceiveForceIdle::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
