#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DefaultPlayerMoveComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DefaultPlayerMoveComponent.DefaultPlayerMoveComponent_C
// 0x0030 (0x1420 - 0x13F0)
#pragma pack(push, 0x1)
class alignas(0x10) UDefaultPlayerMoveComponent_C : public UPlayerMovementComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x13F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          NewVar_0;                                          // 0x13F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13F9[0x7];                                     // 0x13F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameController_C*                   PlayerController;                                  // 0x1400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponent*                      Ability;                                           // 0x1408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         GameCharacter;                                     // 0x1410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool ReceiveCustomSpeedCurve(struct FCustomSpeedCurve* CustomSpeedCurve);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_DefaultPlayerMoveComponent(int32 EntryPoint);

	struct FRotator ReceiveCustomRotation(const struct FRotator& CurrentRotation, const struct FRotator& TargetRotation, float DeltaTime) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DefaultPlayerMoveComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DefaultPlayerMoveComponent_C")
	}
	static class UDefaultPlayerMoveComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultPlayerMoveComponent_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UDefaultPlayerMoveComponent_C;

}

