#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeleteUITipItemEvent

#include "Basic.hpp"


namespace SDK::Params
{

// Function DeleteUITipItemEvent.DeleteUITipItemEvent_C.OnTrigger__Overridden
// 0x0001 (0x0001 - 0x0000)
struct DeleteUITipItemEvent_C_OnTrigger__Overridden final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DeleteUITipItemEvent_C_OnTrigger__Overridden) == 0x000001, "Wrong alignment on DeleteUITipItemEvent_C_OnTrigger__Overridden");
static_assert(sizeof(DeleteUITipItemEvent_C_OnTrigger__Overridden) == 0x000001, "Wrong size on DeleteUITipItemEvent_C_OnTrigger__Overridden");
static_assert(offsetof(DeleteUITipItemEvent_C_OnTrigger__Overridden, ReturnValue) == 0x000000, "Member 'DeleteUITipItemEvent_C_OnTrigger__Overridden::ReturnValue' has a wrong offset!");

// Function DeleteUITipItemEvent.DeleteUITipItemEvent_C.GetBindActor
// 0x0010 (0x0010 - 0x0000)
struct DeleteUITipItemEvent_C_GetBindActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FindActorByName_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DeleteUITipItemEvent_C_GetBindActor) == 0x000008, "Wrong alignment on DeleteUITipItemEvent_C_GetBindActor");
static_assert(sizeof(DeleteUITipItemEvent_C_GetBindActor) == 0x000010, "Wrong size on DeleteUITipItemEvent_C_GetBindActor");
static_assert(offsetof(DeleteUITipItemEvent_C_GetBindActor, ReturnValue) == 0x000000, "Member 'DeleteUITipItemEvent_C_GetBindActor::ReturnValue' has a wrong offset!");
static_assert(offsetof(DeleteUITipItemEvent_C_GetBindActor, CallFunc_FindActorByName_ReturnValue) == 0x000008, "Member 'DeleteUITipItemEvent_C_GetBindActor::CallFunc_FindActorByName_ReturnValue' has a wrong offset!");

// LuaFunction DeleteUITipItemEvent.DeleteUITipItemEvent_C.OnTrigger
// 0x0001 (0x0001 - 0x0000)
struct DeleteUITipItemEvent_C_OnTrigger final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DeleteUITipItemEvent_C_OnTrigger) == 0x000001, "Wrong alignment on DeleteUITipItemEvent_C_OnTrigger");
static_assert(sizeof(DeleteUITipItemEvent_C_OnTrigger) == 0x000001, "Wrong size on DeleteUITipItemEvent_C_OnTrigger");
static_assert(offsetof(DeleteUITipItemEvent_C_OnTrigger, ReturnValue) == 0x000000, "Member 'DeleteUITipItemEvent_C_OnTrigger::ReturnValue' has a wrong offset!");

// Function DeleteUITipItemEvent.DeleteUITipItemEvent_C.GetSpecialStaticDescription
// 0x0050 (0x0050 - 0x0000)
struct DeleteUITipItemEvent_C_GetSpecialStaticDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(DeleteUITipItemEvent_C_GetSpecialStaticDescription) == 0x000008, "Wrong alignment on DeleteUITipItemEvent_C_GetSpecialStaticDescription");
static_assert(sizeof(DeleteUITipItemEvent_C_GetSpecialStaticDescription) == 0x000050, "Wrong size on DeleteUITipItemEvent_C_GetSpecialStaticDescription");
static_assert(offsetof(DeleteUITipItemEvent_C_GetSpecialStaticDescription, ReturnValue) == 0x000000, "Member 'DeleteUITipItemEvent_C_GetSpecialStaticDescription::ReturnValue' has a wrong offset!");
static_assert(offsetof(DeleteUITipItemEvent_C_GetSpecialStaticDescription, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000010, "Member 'DeleteUITipItemEvent_C_GetSpecialStaticDescription::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeleteUITipItemEvent_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'DeleteUITipItemEvent_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeleteUITipItemEvent_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000030, "Member 'DeleteUITipItemEvent_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DeleteUITipItemEvent_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000040, "Member 'DeleteUITipItemEvent_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");

// Function DeleteUITipItemEvent.DeleteUITipItemEvent_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct DeleteUITipItemEvent_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(DeleteUITipItemEvent_C_GetModuleName) == 0x000008, "Wrong alignment on DeleteUITipItemEvent_C_GetModuleName");
static_assert(sizeof(DeleteUITipItemEvent_C_GetModuleName) == 0x000010, "Wrong size on DeleteUITipItemEvent_C_GetModuleName");
static_assert(offsetof(DeleteUITipItemEvent_C_GetModuleName, ReturnValue) == 0x000000, "Member 'DeleteUITipItemEvent_C_GetModuleName::ReturnValue' has a wrong offset!");

}

