#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DesignerCore

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class DesignerCore.DesignerCore
// 0x00C8 (0x00F0 - 0x0028)
class UDesignerCore final : public UObject
{
public:
	uint8                                         Pad_28[0xC8];                                      // 0x0028(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DesignerCore">();
	}
	static class UDesignerCore* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDesignerCore>();
	}
};
static_assert(alignof(UDesignerCore) == 0x000008, "Wrong alignment on UDesignerCore");
static_assert(sizeof(UDesignerCore) == 0x0000F0, "Wrong size on UDesignerCore");

// Class DesignerCore.DesignerCoreRSThread
// 0x0060 (0x0088 - 0x0028)
class UDesignerCoreRSThread final : public UObject
{
public:
	uint8                                         Pad_28[0x60];                                      // 0x0028(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DesignerCoreRSThread">();
	}
	static class UDesignerCoreRSThread* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDesignerCoreRSThread>();
	}
};
static_assert(alignof(UDesignerCoreRSThread) == 0x000008, "Wrong alignment on UDesignerCoreRSThread");
static_assert(sizeof(UDesignerCoreRSThread) == 0x000088, "Wrong size on UDesignerCoreRSThread");

// Class DesignerCore.DesignerCoreSocket
// 0x00B8 (0x00E0 - 0x0028)
class alignas(0x10) UDesignerCoreSocket final : public UObject
{
public:
	uint8                                         Pad_28[0x40];                                      // 0x0028(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDesignerCoreRSThread*>          RecThreads;                                        // 0x0068(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             ReceiveSocketDataDelegate;                         // 0x0078(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             ConnectedServerResultDelegate;                     // 0x0088(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_98[0x48];                                      // 0x0098(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Close();
	bool CreateServer(const class FString& IP, int32 Port, int32 ReceiveSize, int32 SendSize);
	void OnDisConnected(class UDesignerCoreRSThread* PThread);
	void SendData(const class FString& Message);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DesignerCoreSocket">();
	}
	static class UDesignerCoreSocket* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDesignerCoreSocket>();
	}
};
static_assert(alignof(UDesignerCoreSocket) == 0x000010, "Wrong alignment on UDesignerCoreSocket");
static_assert(sizeof(UDesignerCoreSocket) == 0x0000E0, "Wrong size on UDesignerCoreSocket");
static_assert(offsetof(UDesignerCoreSocket, RecThreads) == 0x000068, "Member 'UDesignerCoreSocket::RecThreads' has a wrong offset!");
static_assert(offsetof(UDesignerCoreSocket, ReceiveSocketDataDelegate) == 0x000078, "Member 'UDesignerCoreSocket::ReceiveSocketDataDelegate' has a wrong offset!");
static_assert(offsetof(UDesignerCoreSocket, ConnectedServerResultDelegate) == 0x000088, "Member 'UDesignerCoreSocket::ConnectedServerResultDelegate' has a wrong offset!");

}

