#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DesignerCore

#include "Basic.hpp"


namespace SDK::Params
{

// Function DesignerCore.DesignerCoreSocket.CreateServer
// 0x0020 (0x0020 - 0x0000)
struct DesignerCoreSocket_CreateServer final
{
public:
	class FString                                 IP;                                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Port;                                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReceiveSize;                                       // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SendSize;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DesignerCoreSocket_CreateServer) == 0x000008, "Wrong alignment on DesignerCoreSocket_CreateServer");
static_assert(sizeof(DesignerCoreSocket_CreateServer) == 0x000020, "Wrong size on DesignerCoreSocket_CreateServer");
static_assert(offsetof(DesignerCoreSocket_CreateServer, IP) == 0x000000, "Member 'DesignerCoreSocket_CreateServer::IP' has a wrong offset!");
static_assert(offsetof(DesignerCoreSocket_CreateServer, Port) == 0x000010, "Member 'DesignerCoreSocket_CreateServer::Port' has a wrong offset!");
static_assert(offsetof(DesignerCoreSocket_CreateServer, ReceiveSize) == 0x000014, "Member 'DesignerCoreSocket_CreateServer::ReceiveSize' has a wrong offset!");
static_assert(offsetof(DesignerCoreSocket_CreateServer, SendSize) == 0x000018, "Member 'DesignerCoreSocket_CreateServer::SendSize' has a wrong offset!");
static_assert(offsetof(DesignerCoreSocket_CreateServer, ReturnValue) == 0x00001C, "Member 'DesignerCoreSocket_CreateServer::ReturnValue' has a wrong offset!");

// Function DesignerCore.DesignerCoreSocket.OnDisConnected
// 0x0008 (0x0008 - 0x0000)
struct DesignerCoreSocket_OnDisConnected final
{
public:
	class UDesignerCoreRSThread*                  PThread;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DesignerCoreSocket_OnDisConnected) == 0x000008, "Wrong alignment on DesignerCoreSocket_OnDisConnected");
static_assert(sizeof(DesignerCoreSocket_OnDisConnected) == 0x000008, "Wrong size on DesignerCoreSocket_OnDisConnected");
static_assert(offsetof(DesignerCoreSocket_OnDisConnected, PThread) == 0x000000, "Member 'DesignerCoreSocket_OnDisConnected::PThread' has a wrong offset!");

// Function DesignerCore.DesignerCoreSocket.SendData
// 0x0010 (0x0010 - 0x0000)
struct DesignerCoreSocket_SendData final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DesignerCoreSocket_SendData) == 0x000008, "Wrong alignment on DesignerCoreSocket_SendData");
static_assert(sizeof(DesignerCoreSocket_SendData) == 0x000010, "Wrong size on DesignerCoreSocket_SendData");
static_assert(offsetof(DesignerCoreSocket_SendData, Message) == 0x000000, "Member 'DesignerCoreSocket_SendData::Message' has a wrong offset!");

}

