#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DestroyMonstersEvent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function DestroyMonstersEvent.DestroyMonstersEvent_C.OnTrigger
// 0x0078 (0x0078 - 0x0000)
struct DestroyMonstersEvent_C_OnTrigger final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGameCharacter*>                 Monsters;                                          // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         ___int_Array_Index_Variable;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AGameAICharacter*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0028(0x0010)(ReferenceParm)
	class AGameAICharacter*                       CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         CallFunc_Array_Get_Item_1;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue;                      // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57[0x1];                                       // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeModifier_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DestroyMonstersEvent_C_OnTrigger) == 0x000008, "Wrong alignment on DestroyMonstersEvent_C_OnTrigger");
static_assert(sizeof(DestroyMonstersEvent_C_OnTrigger) == 0x000078, "Wrong size on DestroyMonstersEvent_C_OnTrigger");
static_assert(offsetof(DestroyMonstersEvent_C_OnTrigger, ReturnValue) == 0x000000, "Member 'DestroyMonstersEvent_C_OnTrigger::ReturnValue' has a wrong offset!");
static_assert(offsetof(DestroyMonstersEvent_C_OnTrigger, Monsters) == 0x000008, "Member 'DestroyMonstersEvent_C_OnTrigger::Monsters' has a wrong offset!");
static_assert(offsetof(DestroyMonstersEvent_C_OnTrigger, ___int_Array_Index_Variable) == 0x000018, "Member 'DestroyMonstersEvent_C_OnTrigger::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DestroyMonstersEvent_C_OnTrigger, ___int_Loop_Counter_Variable) == 0x00001C, "Member 'DestroyMonstersEvent_C_OnTrigger::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DestroyMonstersEvent_C_OnTrigger, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'DestroyMonstersEvent_C_OnTrigger::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DestroyMonstersEvent_C_OnTrigger, ___int_Array_Index_Variable_1) == 0x000024, "Member 'DestroyMonstersEvent_C_OnTrigger::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(DestroyMonstersEvent_C_OnTrigger, CallFunc_GetAllActorsOfClass_OutActors) == 0x000028, "Member 'DestroyMonstersEvent_C_OnTrigger::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(DestroyMonstersEvent_C_OnTrigger, CallFunc_Array_Get_Item) == 0x000038, "Member 'DestroyMonstersEvent_C_OnTrigger::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DestroyMonstersEvent_C_OnTrigger, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'DestroyMonstersEvent_C_OnTrigger::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DestroyMonstersEvent_C_OnTrigger, ___int_Loop_Counter_Variable_1) == 0x000044, "Member 'DestroyMonstersEvent_C_OnTrigger::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(DestroyMonstersEvent_C_OnTrigger, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'DestroyMonstersEvent_C_OnTrigger::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(DestroyMonstersEvent_C_OnTrigger, CallFunc_Array_Length_ReturnValue_1) == 0x000050, "Member 'DestroyMonstersEvent_C_OnTrigger::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DestroyMonstersEvent_C_OnTrigger, CallFunc_IsValid_ReturnValue) == 0x000054, "Member 'DestroyMonstersEvent_C_OnTrigger::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DestroyMonstersEvent_C_OnTrigger, CallFunc_Less_IntInt_ReturnValue) == 0x000055, "Member 'DestroyMonstersEvent_C_OnTrigger::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DestroyMonstersEvent_C_OnTrigger, CallFunc_IsAlive_ReturnValue) == 0x000056, "Member 'DestroyMonstersEvent_C_OnTrigger::CallFunc_IsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(DestroyMonstersEvent_C_OnTrigger, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000058, "Member 'DestroyMonstersEvent_C_OnTrigger::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DestroyMonstersEvent_C_OnTrigger, CallFunc_MakeModifier_ReturnValue) == 0x000064, "Member 'DestroyMonstersEvent_C_OnTrigger::CallFunc_MakeModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(DestroyMonstersEvent_C_OnTrigger, CallFunc_Array_Add_ReturnValue) == 0x000068, "Member 'DestroyMonstersEvent_C_OnTrigger::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(DestroyMonstersEvent_C_OnTrigger, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00006C, "Member 'DestroyMonstersEvent_C_OnTrigger::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(DestroyMonstersEvent_C_OnTrigger, CallFunc_Less_IntInt_ReturnValue_1) == 0x00006D, "Member 'DestroyMonstersEvent_C_OnTrigger::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DestroyMonstersEvent_C_OnTrigger, CallFunc_Add_IntInt_ReturnValue_1) == 0x000070, "Member 'DestroyMonstersEvent_C_OnTrigger::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DestroyMonstersEvent_C_OnTrigger, CallFunc_Array_Contains_ReturnValue) == 0x000074, "Member 'DestroyMonstersEvent_C_OnTrigger::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(DestroyMonstersEvent_C_OnTrigger, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000075, "Member 'DestroyMonstersEvent_C_OnTrigger::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(DestroyMonstersEvent_C_OnTrigger, CallFunc_BooleanOR_ReturnValue) == 0x000076, "Member 'DestroyMonstersEvent_C_OnTrigger::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

