#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Distance

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Distance.Distance_C.FindMinorMaxDistanceResult
// 0x0220 (0x0220 - 0x0000)
struct Distance_C_FindMinorMaxDistanceResult final
{
public:
	struct FVector                                Center;                                            // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FQueryResult>                   Results;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          Far;                                               // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseNearestDistance;                                // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQueryResult                           Result;                                            // 0x0028(0x0090)(Parm, OutParm, ContainsInstancedReference)
	float                                         CurDistance;                                       // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQueryResult                           OutResult;                                         // 0x00C0(0x0090)(Edit, BlueprintVisible, ContainsInstancedReference)
	float                                         Distance;                                          // 0x0150(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQueryResult                           CallFunc_Array_Get_Item;                           // 0x0168(0x0090)(ContainsInstancedReference)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VerifyRealDistance_ReturnValue;           // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x021A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x021B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Distance_C_FindMinorMaxDistanceResult) == 0x000008, "Wrong alignment on Distance_C_FindMinorMaxDistanceResult");
static_assert(sizeof(Distance_C_FindMinorMaxDistanceResult) == 0x000220, "Wrong size on Distance_C_FindMinorMaxDistanceResult");
static_assert(offsetof(Distance_C_FindMinorMaxDistanceResult, Center) == 0x000000, "Member 'Distance_C_FindMinorMaxDistanceResult::Center' has a wrong offset!");
static_assert(offsetof(Distance_C_FindMinorMaxDistanceResult, Results) == 0x000010, "Member 'Distance_C_FindMinorMaxDistanceResult::Results' has a wrong offset!");
static_assert(offsetof(Distance_C_FindMinorMaxDistanceResult, Far) == 0x000020, "Member 'Distance_C_FindMinorMaxDistanceResult::Far' has a wrong offset!");
static_assert(offsetof(Distance_C_FindMinorMaxDistanceResult, UseNearestDistance) == 0x000021, "Member 'Distance_C_FindMinorMaxDistanceResult::UseNearestDistance' has a wrong offset!");
static_assert(offsetof(Distance_C_FindMinorMaxDistanceResult, Result) == 0x000028, "Member 'Distance_C_FindMinorMaxDistanceResult::Result' has a wrong offset!");
static_assert(offsetof(Distance_C_FindMinorMaxDistanceResult, CurDistance) == 0x0000B8, "Member 'Distance_C_FindMinorMaxDistanceResult::CurDistance' has a wrong offset!");
static_assert(offsetof(Distance_C_FindMinorMaxDistanceResult, OutResult) == 0x0000C0, "Member 'Distance_C_FindMinorMaxDistanceResult::OutResult' has a wrong offset!");
static_assert(offsetof(Distance_C_FindMinorMaxDistanceResult, Distance) == 0x000150, "Member 'Distance_C_FindMinorMaxDistanceResult::Distance' has a wrong offset!");
static_assert(offsetof(Distance_C_FindMinorMaxDistanceResult, CallFunc_Not_PreBool_ReturnValue) == 0x000154, "Member 'Distance_C_FindMinorMaxDistanceResult::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Distance_C_FindMinorMaxDistanceResult, CallFunc_Array_Length_ReturnValue) == 0x000158, "Member 'Distance_C_FindMinorMaxDistanceResult::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Distance_C_FindMinorMaxDistanceResult, CallFunc_BooleanAND_ReturnValue) == 0x00015C, "Member 'Distance_C_FindMinorMaxDistanceResult::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Distance_C_FindMinorMaxDistanceResult, ___int_Array_Index_Variable) == 0x000160, "Member 'Distance_C_FindMinorMaxDistanceResult::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Distance_C_FindMinorMaxDistanceResult, CallFunc_Array_Get_Item) == 0x000168, "Member 'Distance_C_FindMinorMaxDistanceResult::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Distance_C_FindMinorMaxDistanceResult, ___int_Loop_Counter_Variable) == 0x0001F8, "Member 'Distance_C_FindMinorMaxDistanceResult::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Distance_C_FindMinorMaxDistanceResult, CallFunc_VerifyRealDistance_ReturnValue) == 0x0001FC, "Member 'Distance_C_FindMinorMaxDistanceResult::CallFunc_VerifyRealDistance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Distance_C_FindMinorMaxDistanceResult, CallFunc_Less_IntInt_ReturnValue) == 0x000200, "Member 'Distance_C_FindMinorMaxDistanceResult::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Distance_C_FindMinorMaxDistanceResult, CallFunc_Add_IntInt_ReturnValue) == 0x000204, "Member 'Distance_C_FindMinorMaxDistanceResult::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Distance_C_FindMinorMaxDistanceResult, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000208, "Member 'Distance_C_FindMinorMaxDistanceResult::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Distance_C_FindMinorMaxDistanceResult, CallFunc_VSize_ReturnValue) == 0x000214, "Member 'Distance_C_FindMinorMaxDistanceResult::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Distance_C_FindMinorMaxDistanceResult, CallFunc_Less_FloatFloat_ReturnValue) == 0x000218, "Member 'Distance_C_FindMinorMaxDistanceResult::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Distance_C_FindMinorMaxDistanceResult, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000219, "Member 'Distance_C_FindMinorMaxDistanceResult::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Distance_C_FindMinorMaxDistanceResult, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00021A, "Member 'Distance_C_FindMinorMaxDistanceResult::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Distance_C_FindMinorMaxDistanceResult, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x00021B, "Member 'Distance_C_FindMinorMaxDistanceResult::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Distance_C_FindMinorMaxDistanceResult, CallFunc_BooleanAND_ReturnValue_1) == 0x00021C, "Member 'Distance_C_FindMinorMaxDistanceResult::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function Distance.Distance_C.Sort by Distance
// 0x0138 (0x0138 - 0x0000)
struct Distance_C_Sort_by_Distance final
{
public:
	int32                                         Priority;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Center;                                            // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FQueryResult>                   InResults;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          Far;                                               // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseNearestDistance;                                // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFinish;                                           // 0x0022(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTargetSortResult>              NewParam;                                          // 0x0028(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<struct FQueryResult>                   TempResults;                                       // 0x0038(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<struct FTargetSortResult>              OutResults;                                        // 0x0048(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQueryResult                           CallFunc_FindMinorMaxDistanceResult_Result;        // 0x0068(0x0090)(ContainsInstancedReference)
	TArray<struct FQueryResult>                   K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FTargetSortResult                      K2Node_MakeStruct_TargetSortResult;                // 0x0108(0x0018)(ContainsInstancedReference)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Variable;                                   // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Distance_C_Sort_by_Distance) == 0x000008, "Wrong alignment on Distance_C_Sort_by_Distance");
static_assert(sizeof(Distance_C_Sort_by_Distance) == 0x000138, "Wrong size on Distance_C_Sort_by_Distance");
static_assert(offsetof(Distance_C_Sort_by_Distance, Priority) == 0x000000, "Member 'Distance_C_Sort_by_Distance::Priority' has a wrong offset!");
static_assert(offsetof(Distance_C_Sort_by_Distance, Center) == 0x000004, "Member 'Distance_C_Sort_by_Distance::Center' has a wrong offset!");
static_assert(offsetof(Distance_C_Sort_by_Distance, InResults) == 0x000010, "Member 'Distance_C_Sort_by_Distance::InResults' has a wrong offset!");
static_assert(offsetof(Distance_C_Sort_by_Distance, Far) == 0x000020, "Member 'Distance_C_Sort_by_Distance::Far' has a wrong offset!");
static_assert(offsetof(Distance_C_Sort_by_Distance, UseNearestDistance) == 0x000021, "Member 'Distance_C_Sort_by_Distance::UseNearestDistance' has a wrong offset!");
static_assert(offsetof(Distance_C_Sort_by_Distance, bFinish) == 0x000022, "Member 'Distance_C_Sort_by_Distance::bFinish' has a wrong offset!");
static_assert(offsetof(Distance_C_Sort_by_Distance, NewParam) == 0x000028, "Member 'Distance_C_Sort_by_Distance::NewParam' has a wrong offset!");
static_assert(offsetof(Distance_C_Sort_by_Distance, TempResults) == 0x000038, "Member 'Distance_C_Sort_by_Distance::TempResults' has a wrong offset!");
static_assert(offsetof(Distance_C_Sort_by_Distance, OutResults) == 0x000048, "Member 'Distance_C_Sort_by_Distance::OutResults' has a wrong offset!");
static_assert(offsetof(Distance_C_Sort_by_Distance, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'Distance_C_Sort_by_Distance::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Distance_C_Sort_by_Distance, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'Distance_C_Sort_by_Distance::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Distance_C_Sort_by_Distance, CallFunc_Greater_IntInt_ReturnValue) == 0x000060, "Member 'Distance_C_Sort_by_Distance::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Distance_C_Sort_by_Distance, CallFunc_FindMinorMaxDistanceResult_Result) == 0x000068, "Member 'Distance_C_Sort_by_Distance::CallFunc_FindMinorMaxDistanceResult_Result' has a wrong offset!");
static_assert(offsetof(Distance_C_Sort_by_Distance, K2Node_MakeArray_Array) == 0x0000F8, "Member 'Distance_C_Sort_by_Distance::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Distance_C_Sort_by_Distance, K2Node_MakeStruct_TargetSortResult) == 0x000108, "Member 'Distance_C_Sort_by_Distance::K2Node_MakeStruct_TargetSortResult' has a wrong offset!");
static_assert(offsetof(Distance_C_Sort_by_Distance, CallFunc_Array_RemoveItem_ReturnValue) == 0x000120, "Member 'Distance_C_Sort_by_Distance::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Distance_C_Sort_by_Distance, ___int_Variable) == 0x000124, "Member 'Distance_C_Sort_by_Distance::___int_Variable' has a wrong offset!");
static_assert(offsetof(Distance_C_Sort_by_Distance, CallFunc_Array_Add_ReturnValue) == 0x000128, "Member 'Distance_C_Sort_by_Distance::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Distance_C_Sort_by_Distance, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00012C, "Member 'Distance_C_Sort_by_Distance::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Distance_C_Sort_by_Distance, CallFunc_Add_IntInt_ReturnValue_1) == 0x000130, "Member 'Distance_C_Sort_by_Distance::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function Distance.Distance_C.Rule
// 0x00B8 (0x00B8 - 0x0000)
struct Distance_C_Rule final
{
public:
	int32                                         Priority;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FQueryResult>                   InResults;                                         // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UAbilityComponentBase*                  Querier;                                           // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FParamInfo>                     Infos;                                             // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class AActor*                                 CastActor;                                         // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTargetSortResult>              Out;                                               // 0x0038(0x0010)(Parm, OutParm, ContainsInstancedReference)
	bool                                          bUseNearestDistance;                               // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FQueryResult>                   Temp;                                              // 0x0050(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	struct FVector                                CenterLoc;                                         // 0x0060(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Far;                                               // 0x006C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetParamboolValue_ReturnValue;            // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable;                                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Sort_by_Distance_bFinish;                 // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTargetSortResult>              CallFunc_Sort_by_Distance_NewParam;                // 0x0090(0x0010)(ReferenceParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Select_Default;                             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Distance_C_Rule) == 0x000008, "Wrong alignment on Distance_C_Rule");
static_assert(sizeof(Distance_C_Rule) == 0x0000B8, "Wrong size on Distance_C_Rule");
static_assert(offsetof(Distance_C_Rule, Priority) == 0x000000, "Member 'Distance_C_Rule::Priority' has a wrong offset!");
static_assert(offsetof(Distance_C_Rule, InResults) == 0x000008, "Member 'Distance_C_Rule::InResults' has a wrong offset!");
static_assert(offsetof(Distance_C_Rule, Querier) == 0x000018, "Member 'Distance_C_Rule::Querier' has a wrong offset!");
static_assert(offsetof(Distance_C_Rule, Infos) == 0x000020, "Member 'Distance_C_Rule::Infos' has a wrong offset!");
static_assert(offsetof(Distance_C_Rule, CastActor) == 0x000030, "Member 'Distance_C_Rule::CastActor' has a wrong offset!");
static_assert(offsetof(Distance_C_Rule, Out) == 0x000038, "Member 'Distance_C_Rule::Out' has a wrong offset!");
static_assert(offsetof(Distance_C_Rule, bUseNearestDistance) == 0x000048, "Member 'Distance_C_Rule::bUseNearestDistance' has a wrong offset!");
static_assert(offsetof(Distance_C_Rule, Temp) == 0x000050, "Member 'Distance_C_Rule::Temp' has a wrong offset!");
static_assert(offsetof(Distance_C_Rule, CenterLoc) == 0x000060, "Member 'Distance_C_Rule::CenterLoc' has a wrong offset!");
static_assert(offsetof(Distance_C_Rule, Far) == 0x00006C, "Member 'Distance_C_Rule::Far' has a wrong offset!");
static_assert(offsetof(Distance_C_Rule, CallFunc_IsValid_ReturnValue) == 0x00006D, "Member 'Distance_C_Rule::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Distance_C_Rule, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'Distance_C_Rule::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Distance_C_Rule, CallFunc_Greater_IntInt_ReturnValue) == 0x000074, "Member 'Distance_C_Rule::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Distance_C_Rule, K2Node_SwitchString_CmpSuccess) == 0x000075, "Member 'Distance_C_Rule::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Distance_C_Rule, CallFunc_Array_Length_ReturnValue_1) == 0x000078, "Member 'Distance_C_Rule::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Distance_C_Rule, CallFunc_GetParamboolValue_ReturnValue) == 0x00007C, "Member 'Distance_C_Rule::CallFunc_GetParamboolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Distance_C_Rule, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00007D, "Member 'Distance_C_Rule::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Distance_C_Rule, CallFunc_GetOwner_ReturnValue) == 0x000080, "Member 'Distance_C_Rule::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Distance_C_Rule, ___bool_Variable) == 0x000088, "Member 'Distance_C_Rule::___bool_Variable' has a wrong offset!");
static_assert(offsetof(Distance_C_Rule, CallFunc_Sort_by_Distance_bFinish) == 0x000089, "Member 'Distance_C_Rule::CallFunc_Sort_by_Distance_bFinish' has a wrong offset!");
static_assert(offsetof(Distance_C_Rule, CallFunc_Sort_by_Distance_NewParam) == 0x000090, "Member 'Distance_C_Rule::CallFunc_Sort_by_Distance_NewParam' has a wrong offset!");
static_assert(offsetof(Distance_C_Rule, K2Node_Select_Default) == 0x0000A0, "Member 'Distance_C_Rule::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Distance_C_Rule, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000A8, "Member 'Distance_C_Rule::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

}

