#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DLC9_Container_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DLC9_Container_Base.DLC9_Container_Base_C
// 0x0040 (0x1070 - 0x1030)
class ADLC9_Container_Base_C : public AGameCharacter
{
public:
	uint8                                         Pad_1028[0x8];                                     // 0x1028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsMoving;                                          // 0x1038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsRotate;                                          // 0x1039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsOpen;                                            // 0x103A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_103B[0x1];                                     // 0x103B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Config_DeltaMove;                                  // 0x103C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Config_DeltaMoveTime;                              // 0x1048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Config_MaxMoveCount;                               // 0x104C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Config_InitMoveCount;                              // 0x1050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Config_DeltaRotateZ;                               // 0x1054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Config_DeltaRotateTime;                            // 0x1058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105C[0x4];                                     // 0x105C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            Config_RotateSpeedCurve;                           // 0x1060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            Config_MoveSpeedCurve;                             // 0x1068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateMove__Overridden(float DeltaTime);
	void EndMovement();
	void BeginMovement();
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_DLC9_Container_Base(int32 EntryPoint);
	void UpdateMove(float DeltaTime);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DLC9_Container_Base_C">();
	}
	static class ADLC9_Container_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADLC9_Container_Base_C>();
	}
};
static_assert(alignof(ADLC9_Container_Base_C) == 0x000010, "Wrong alignment on ADLC9_Container_Base_C");
static_assert(sizeof(ADLC9_Container_Base_C) == 0x001070, "Wrong size on ADLC9_Container_Base_C");
static_assert(offsetof(ADLC9_Container_Base_C, UberGraphFrame) == 0x001030, "Member 'ADLC9_Container_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADLC9_Container_Base_C, IsMoving) == 0x001038, "Member 'ADLC9_Container_Base_C::IsMoving' has a wrong offset!");
static_assert(offsetof(ADLC9_Container_Base_C, IsRotate) == 0x001039, "Member 'ADLC9_Container_Base_C::IsRotate' has a wrong offset!");
static_assert(offsetof(ADLC9_Container_Base_C, IsOpen) == 0x00103A, "Member 'ADLC9_Container_Base_C::IsOpen' has a wrong offset!");
static_assert(offsetof(ADLC9_Container_Base_C, Config_DeltaMove) == 0x00103C, "Member 'ADLC9_Container_Base_C::Config_DeltaMove' has a wrong offset!");
static_assert(offsetof(ADLC9_Container_Base_C, Config_DeltaMoveTime) == 0x001048, "Member 'ADLC9_Container_Base_C::Config_DeltaMoveTime' has a wrong offset!");
static_assert(offsetof(ADLC9_Container_Base_C, Config_MaxMoveCount) == 0x00104C, "Member 'ADLC9_Container_Base_C::Config_MaxMoveCount' has a wrong offset!");
static_assert(offsetof(ADLC9_Container_Base_C, Config_InitMoveCount) == 0x001050, "Member 'ADLC9_Container_Base_C::Config_InitMoveCount' has a wrong offset!");
static_assert(offsetof(ADLC9_Container_Base_C, Config_DeltaRotateZ) == 0x001054, "Member 'ADLC9_Container_Base_C::Config_DeltaRotateZ' has a wrong offset!");
static_assert(offsetof(ADLC9_Container_Base_C, Config_DeltaRotateTime) == 0x001058, "Member 'ADLC9_Container_Base_C::Config_DeltaRotateTime' has a wrong offset!");
static_assert(offsetof(ADLC9_Container_Base_C, Config_RotateSpeedCurve) == 0x001060, "Member 'ADLC9_Container_Base_C::Config_RotateSpeedCurve' has a wrong offset!");
static_assert(offsetof(ADLC9_Container_Base_C, Config_MoveSpeedCurve) == 0x001068, "Member 'ADLC9_Container_Base_C::Config_MoveSpeedCurve' has a wrong offset!");

}

