#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DLC9_Container_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DLC9_Container_Base.DLC9_Container_Base_C.UpdateMove__Overridden
// 0x0004 (0x0004 - 0x0000)
struct DLC9_Container_Base_C_UpdateMove__Overridden final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DLC9_Container_Base_C_UpdateMove__Overridden) == 0x000004, "Wrong alignment on DLC9_Container_Base_C_UpdateMove__Overridden");
static_assert(sizeof(DLC9_Container_Base_C_UpdateMove__Overridden) == 0x000004, "Wrong size on DLC9_Container_Base_C_UpdateMove__Overridden");
static_assert(offsetof(DLC9_Container_Base_C_UpdateMove__Overridden, DeltaTime) == 0x000000, "Member 'DLC9_Container_Base_C_UpdateMove__Overridden::DeltaTime' has a wrong offset!");

// Function DLC9_Container_Base.DLC9_Container_Base_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct DLC9_Container_Base_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DLC9_Container_Base_C_ReceiveTick) == 0x000004, "Wrong alignment on DLC9_Container_Base_C_ReceiveTick");
static_assert(sizeof(DLC9_Container_Base_C_ReceiveTick) == 0x000004, "Wrong size on DLC9_Container_Base_C_ReceiveTick");
static_assert(offsetof(DLC9_Container_Base_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'DLC9_Container_Base_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function DLC9_Container_Base.DLC9_Container_Base_C.ExecuteUbergraph_DLC9_Container_Base
// 0x0008 (0x0008 - 0x0000)
struct DLC9_Container_Base_C_ExecuteUbergraph_DLC9_Container_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DLC9_Container_Base_C_ExecuteUbergraph_DLC9_Container_Base) == 0x000004, "Wrong alignment on DLC9_Container_Base_C_ExecuteUbergraph_DLC9_Container_Base");
static_assert(sizeof(DLC9_Container_Base_C_ExecuteUbergraph_DLC9_Container_Base) == 0x000008, "Wrong size on DLC9_Container_Base_C_ExecuteUbergraph_DLC9_Container_Base");
static_assert(offsetof(DLC9_Container_Base_C_ExecuteUbergraph_DLC9_Container_Base, EntryPoint) == 0x000000, "Member 'DLC9_Container_Base_C_ExecuteUbergraph_DLC9_Container_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(DLC9_Container_Base_C_ExecuteUbergraph_DLC9_Container_Base, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'DLC9_Container_Base_C_ExecuteUbergraph_DLC9_Container_Base::K2Node_Event_DeltaSeconds' has a wrong offset!");

// LuaFunction DLC9_Container_Base.DLC9_Container_Base_C.UpdateMove
// 0x0004 (0x0004 - 0x0000)
struct DLC9_Container_Base_C_UpdateMove final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DLC9_Container_Base_C_UpdateMove) == 0x000004, "Wrong alignment on DLC9_Container_Base_C_UpdateMove");
static_assert(sizeof(DLC9_Container_Base_C_UpdateMove) == 0x000004, "Wrong size on DLC9_Container_Base_C_UpdateMove");
static_assert(offsetof(DLC9_Container_Base_C_UpdateMove, DeltaTime) == 0x000000, "Member 'DLC9_Container_Base_C_UpdateMove::DeltaTime' has a wrong offset!");

// LuaFunction DLC9_Container_Base.DLC9_Container_Base_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct DLC9_Container_Base_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DLC9_Container_Base_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on DLC9_Container_Base_C_ReceiveEndPlay");
static_assert(sizeof(DLC9_Container_Base_C_ReceiveEndPlay) == 0x000001, "Wrong size on DLC9_Container_Base_C_ReceiveEndPlay");
static_assert(offsetof(DLC9_Container_Base_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'DLC9_Container_Base_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function DLC9_Container_Base.DLC9_Container_Base_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct DLC9_Container_Base_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(DLC9_Container_Base_C_GetModuleName) == 0x000008, "Wrong alignment on DLC9_Container_Base_C_GetModuleName");
static_assert(sizeof(DLC9_Container_Base_C_GetModuleName) == 0x000010, "Wrong size on DLC9_Container_Base_C_GetModuleName");
static_assert(offsetof(DLC9_Container_Base_C_GetModuleName, ReturnValue) == 0x000000, "Member 'DLC9_Container_Base_C_GetModuleName::ReturnValue' has a wrong offset!");

}

