#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DLC9_Container_BoxFull

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DLC9_Container_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DLC9_Container_BoxFull.DLC9_Container_BoxFull_C
// 0x0040 (0x10B0 - 0x1070)
class ADLC9_Container_BoxFull_C final : public ADLC9_Container_Base_C
{
public:
	class UStaticMeshComponent*                   BlueBox24;                                         // 0x1070(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BlueBox23;                                         // 0x1078(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RedBox22;                                          // 0x1080(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BlueBox22;                                         // 0x1088(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BlueBox21;                                         // 0x1090(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RedBox21;                                          // 0x1098(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Prop_interact074_03_sm;                            // 0x10A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MeshBox;                                           // 0x10A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateMove(float DeltaTime);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DLC9_Container_BoxFull_C">();
	}
	static class ADLC9_Container_BoxFull_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADLC9_Container_BoxFull_C>();
	}
};
static_assert(alignof(ADLC9_Container_BoxFull_C) == 0x000010, "Wrong alignment on ADLC9_Container_BoxFull_C");
static_assert(sizeof(ADLC9_Container_BoxFull_C) == 0x0010B0, "Wrong size on ADLC9_Container_BoxFull_C");
static_assert(offsetof(ADLC9_Container_BoxFull_C, BlueBox24) == 0x001070, "Member 'ADLC9_Container_BoxFull_C::BlueBox24' has a wrong offset!");
static_assert(offsetof(ADLC9_Container_BoxFull_C, BlueBox23) == 0x001078, "Member 'ADLC9_Container_BoxFull_C::BlueBox23' has a wrong offset!");
static_assert(offsetof(ADLC9_Container_BoxFull_C, RedBox22) == 0x001080, "Member 'ADLC9_Container_BoxFull_C::RedBox22' has a wrong offset!");
static_assert(offsetof(ADLC9_Container_BoxFull_C, BlueBox22) == 0x001088, "Member 'ADLC9_Container_BoxFull_C::BlueBox22' has a wrong offset!");
static_assert(offsetof(ADLC9_Container_BoxFull_C, BlueBox21) == 0x001090, "Member 'ADLC9_Container_BoxFull_C::BlueBox21' has a wrong offset!");
static_assert(offsetof(ADLC9_Container_BoxFull_C, RedBox21) == 0x001098, "Member 'ADLC9_Container_BoxFull_C::RedBox21' has a wrong offset!");
static_assert(offsetof(ADLC9_Container_BoxFull_C, Prop_interact074_03_sm) == 0x0010A0, "Member 'ADLC9_Container_BoxFull_C::Prop_interact074_03_sm' has a wrong offset!");
static_assert(offsetof(ADLC9_Container_BoxFull_C, MeshBox) == 0x0010A8, "Member 'ADLC9_Container_BoxFull_C::MeshBox' has a wrong offset!");

}

