#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DLC9_Container_BoxFull

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// LuaFunction DLC9_Container_BoxFull.DLC9_Container_BoxFull_C.UpdateMove
// 0x0004 (0x0004 - 0x0000)
struct DLC9_Container_BoxFull_C_UpdateMove final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DLC9_Container_BoxFull_C_UpdateMove) == 0x000004, "Wrong alignment on DLC9_Container_BoxFull_C_UpdateMove");
static_assert(sizeof(DLC9_Container_BoxFull_C_UpdateMove) == 0x000004, "Wrong size on DLC9_Container_BoxFull_C_UpdateMove");
static_assert(offsetof(DLC9_Container_BoxFull_C_UpdateMove, DeltaTime) == 0x000000, "Member 'DLC9_Container_BoxFull_C_UpdateMove::DeltaTime' has a wrong offset!");

// LuaFunction DLC9_Container_BoxFull.DLC9_Container_BoxFull_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct DLC9_Container_BoxFull_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DLC9_Container_BoxFull_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on DLC9_Container_BoxFull_C_ReceiveEndPlay");
static_assert(sizeof(DLC9_Container_BoxFull_C_ReceiveEndPlay) == 0x000001, "Wrong size on DLC9_Container_BoxFull_C_ReceiveEndPlay");
static_assert(offsetof(DLC9_Container_BoxFull_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'DLC9_Container_BoxFull_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

