#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DLCOnline

#include "Basic.hpp"

#include "DLCOnline_structs.hpp"


namespace SDK::Params
{

// Function DLCOnline.DLCOnlineGameMode.GetHostInfo
// 0x0028 (0x0028 - 0x0000)
struct DLCOnlineGameMode_GetHostInfo final
{
public:
	int32                                         TargetIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Key;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DLCOnlineGameMode_GetHostInfo) == 0x000008, "Wrong alignment on DLCOnlineGameMode_GetHostInfo");
static_assert(sizeof(DLCOnlineGameMode_GetHostInfo) == 0x000028, "Wrong size on DLCOnlineGameMode_GetHostInfo");
static_assert(offsetof(DLCOnlineGameMode_GetHostInfo, TargetIndex) == 0x000000, "Member 'DLCOnlineGameMode_GetHostInfo::TargetIndex' has a wrong offset!");
static_assert(offsetof(DLCOnlineGameMode_GetHostInfo, Key) == 0x000008, "Member 'DLCOnlineGameMode_GetHostInfo::Key' has a wrong offset!");
static_assert(offsetof(DLCOnlineGameMode_GetHostInfo, ReturnValue) == 0x000018, "Member 'DLCOnlineGameMode_GetHostInfo::ReturnValue' has a wrong offset!");

// Function DLCOnline.DLCOnlineGameMode.GetHostSize
// 0x0004 (0x0004 - 0x0000)
struct DLCOnlineGameMode_GetHostSize final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DLCOnlineGameMode_GetHostSize) == 0x000004, "Wrong alignment on DLCOnlineGameMode_GetHostSize");
static_assert(sizeof(DLCOnlineGameMode_GetHostSize) == 0x000004, "Wrong size on DLCOnlineGameMode_GetHostSize");
static_assert(offsetof(DLCOnlineGameMode_GetHostSize, ReturnValue) == 0x000000, "Member 'DLCOnlineGameMode_GetHostSize::ReturnValue' has a wrong offset!");

// Function DLCOnline.DLCOnlineGameMode.JoinRoom
// 0x0010 (0x0010 - 0x0000)
struct DLCOnlineGameMode_JoinRoom final
{
public:
	class FString                                 InRoomGUID;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DLCOnlineGameMode_JoinRoom) == 0x000008, "Wrong alignment on DLCOnlineGameMode_JoinRoom");
static_assert(sizeof(DLCOnlineGameMode_JoinRoom) == 0x000010, "Wrong size on DLCOnlineGameMode_JoinRoom");
static_assert(offsetof(DLCOnlineGameMode_JoinRoom, InRoomGUID) == 0x000000, "Member 'DLCOnlineGameMode_JoinRoom::InRoomGUID' has a wrong offset!");

// Function DLCOnline.DLCOnlineGameMode.StorageHostData
// 0x0080 (0x0080 - 0x0000)
struct DLCOnlineGameMode_StorageHostData final
{
public:
	class FString                                 HostName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HostOwnerName;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MapId;                                             // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomType;                                          // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CampsNum;                                          // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TeamNum;                                           // 0x0050(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TeamPlayerNum;                                     // 0x0060(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerType;                                        // 0x0070(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DLCOnlineGameMode_StorageHostData) == 0x000008, "Wrong alignment on DLCOnlineGameMode_StorageHostData");
static_assert(sizeof(DLCOnlineGameMode_StorageHostData) == 0x000080, "Wrong size on DLCOnlineGameMode_StorageHostData");
static_assert(offsetof(DLCOnlineGameMode_StorageHostData, HostName) == 0x000000, "Member 'DLCOnlineGameMode_StorageHostData::HostName' has a wrong offset!");
static_assert(offsetof(DLCOnlineGameMode_StorageHostData, HostOwnerName) == 0x000010, "Member 'DLCOnlineGameMode_StorageHostData::HostOwnerName' has a wrong offset!");
static_assert(offsetof(DLCOnlineGameMode_StorageHostData, MapId) == 0x000020, "Member 'DLCOnlineGameMode_StorageHostData::MapId' has a wrong offset!");
static_assert(offsetof(DLCOnlineGameMode_StorageHostData, RoomType) == 0x000030, "Member 'DLCOnlineGameMode_StorageHostData::RoomType' has a wrong offset!");
static_assert(offsetof(DLCOnlineGameMode_StorageHostData, CampsNum) == 0x000040, "Member 'DLCOnlineGameMode_StorageHostData::CampsNum' has a wrong offset!");
static_assert(offsetof(DLCOnlineGameMode_StorageHostData, TeamNum) == 0x000050, "Member 'DLCOnlineGameMode_StorageHostData::TeamNum' has a wrong offset!");
static_assert(offsetof(DLCOnlineGameMode_StorageHostData, TeamPlayerNum) == 0x000060, "Member 'DLCOnlineGameMode_StorageHostData::TeamPlayerNum' has a wrong offset!");
static_assert(offsetof(DLCOnlineGameMode_StorageHostData, ServerType) == 0x000070, "Member 'DLCOnlineGameMode_StorageHostData::ServerType' has a wrong offset!");

// Function DLCOnline.DLCOnlinePlayerController.AutoFillRobot
// 0x000C (0x000C - 0x0000)
struct DLCOnlinePlayerController_AutoFillRobot final
{
public:
	int32                                         InCamp;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InTeam;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InCount;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DLCOnlinePlayerController_AutoFillRobot) == 0x000004, "Wrong alignment on DLCOnlinePlayerController_AutoFillRobot");
static_assert(sizeof(DLCOnlinePlayerController_AutoFillRobot) == 0x00000C, "Wrong size on DLCOnlinePlayerController_AutoFillRobot");
static_assert(offsetof(DLCOnlinePlayerController_AutoFillRobot, InCamp) == 0x000000, "Member 'DLCOnlinePlayerController_AutoFillRobot::InCamp' has a wrong offset!");
static_assert(offsetof(DLCOnlinePlayerController_AutoFillRobot, InTeam) == 0x000004, "Member 'DLCOnlinePlayerController_AutoFillRobot::InTeam' has a wrong offset!");
static_assert(offsetof(DLCOnlinePlayerController_AutoFillRobot, InCount) == 0x000008, "Member 'DLCOnlinePlayerController_AutoFillRobot::InCount' has a wrong offset!");

// Function DLCOnline.DLCOnlinePlayerController.ChangeRole
// 0x0001 (0x0001 - 0x0000)
struct DLCOnlinePlayerController_ChangeRole final
{
public:
	EDLCOnlineRoleType                            InRoleType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DLCOnlinePlayerController_ChangeRole) == 0x000001, "Wrong alignment on DLCOnlinePlayerController_ChangeRole");
static_assert(sizeof(DLCOnlinePlayerController_ChangeRole) == 0x000001, "Wrong size on DLCOnlinePlayerController_ChangeRole");
static_assert(offsetof(DLCOnlinePlayerController_ChangeRole, InRoleType) == 0x000000, "Member 'DLCOnlinePlayerController_ChangeRole::InRoleType' has a wrong offset!");

// Function DLCOnline.DLCOnlinePlayerController.ChangeToFightPlayer
// 0x0010 (0x0010 - 0x0000)
struct DLCOnlinePlayerController_ChangeToFightPlayer final
{
public:
	EDLCOnlineRoleType                            InRoleType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CampId;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TeamID;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PosID;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DLCOnlinePlayerController_ChangeToFightPlayer) == 0x000004, "Wrong alignment on DLCOnlinePlayerController_ChangeToFightPlayer");
static_assert(sizeof(DLCOnlinePlayerController_ChangeToFightPlayer) == 0x000010, "Wrong size on DLCOnlinePlayerController_ChangeToFightPlayer");
static_assert(offsetof(DLCOnlinePlayerController_ChangeToFightPlayer, InRoleType) == 0x000000, "Member 'DLCOnlinePlayerController_ChangeToFightPlayer::InRoleType' has a wrong offset!");
static_assert(offsetof(DLCOnlinePlayerController_ChangeToFightPlayer, CampId) == 0x000004, "Member 'DLCOnlinePlayerController_ChangeToFightPlayer::CampId' has a wrong offset!");
static_assert(offsetof(DLCOnlinePlayerController_ChangeToFightPlayer, TeamID) == 0x000008, "Member 'DLCOnlinePlayerController_ChangeToFightPlayer::TeamID' has a wrong offset!");
static_assert(offsetof(DLCOnlinePlayerController_ChangeToFightPlayer, PosID) == 0x00000C, "Member 'DLCOnlinePlayerController_ChangeToFightPlayer::PosID' has a wrong offset!");

// Function DLCOnline.DLCOnlinePlayerController.GetPlayerData
// 0x0040 (0x0040 - 0x0000)
struct DLCOnlinePlayerController_GetPlayerData final
{
public:
	struct FDLCOnlinePlayer                       ReturnValue;                                       // 0x0000(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DLCOnlinePlayerController_GetPlayerData) == 0x000008, "Wrong alignment on DLCOnlinePlayerController_GetPlayerData");
static_assert(sizeof(DLCOnlinePlayerController_GetPlayerData) == 0x000040, "Wrong size on DLCOnlinePlayerController_GetPlayerData");
static_assert(offsetof(DLCOnlinePlayerController_GetPlayerData, ReturnValue) == 0x000000, "Member 'DLCOnlinePlayerController_GetPlayerData::ReturnValue' has a wrong offset!");

// Function DLCOnline.DLCOnlinePlayerController.IsMaster
// 0x0001 (0x0001 - 0x0000)
struct DLCOnlinePlayerController_IsMaster final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DLCOnlinePlayerController_IsMaster) == 0x000001, "Wrong alignment on DLCOnlinePlayerController_IsMaster");
static_assert(sizeof(DLCOnlinePlayerController_IsMaster) == 0x000001, "Wrong size on DLCOnlinePlayerController_IsMaster");
static_assert(offsetof(DLCOnlinePlayerController_IsMaster, ReturnValue) == 0x000000, "Member 'DLCOnlinePlayerController_IsMaster::ReturnValue' has a wrong offset!");

// Function DLCOnline.DLCOnlinePlayerController.KickPlayer
// 0x0008 (0x0008 - 0x0000)
struct DLCOnlinePlayerController_KickPlayer final
{
public:
	int64                                         InPlayerId;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DLCOnlinePlayerController_KickPlayer) == 0x000008, "Wrong alignment on DLCOnlinePlayerController_KickPlayer");
static_assert(sizeof(DLCOnlinePlayerController_KickPlayer) == 0x000008, "Wrong size on DLCOnlinePlayerController_KickPlayer");
static_assert(offsetof(DLCOnlinePlayerController_KickPlayer, InPlayerId) == 0x000000, "Member 'DLCOnlinePlayerController_KickPlayer::InPlayerId' has a wrong offset!");

// Function DLCOnline.DLCOnlinePlayerController.SetPlayerName
// 0x0010 (0x0010 - 0x0000)
struct DLCOnlinePlayerController_SetPlayerName final
{
public:
	class FString                                 InName;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DLCOnlinePlayerController_SetPlayerName) == 0x000008, "Wrong alignment on DLCOnlinePlayerController_SetPlayerName");
static_assert(sizeof(DLCOnlinePlayerController_SetPlayerName) == 0x000010, "Wrong size on DLCOnlinePlayerController_SetPlayerName");
static_assert(offsetof(DLCOnlinePlayerController_SetPlayerName, InName) == 0x000000, "Member 'DLCOnlinePlayerController_SetPlayerName::InName' has a wrong offset!");

// Function DLCOnline.DLCOnlineSyncActor.FindPlayerByPos
// 0x0050 (0x0050 - 0x0000)
struct DLCOnlineSyncActor_FindPlayerByPos final
{
public:
	int32                                         CampId;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TeamID;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PosID;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDLCOnlinePlayer                       ReturnValue;                                       // 0x0010(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DLCOnlineSyncActor_FindPlayerByPos) == 0x000008, "Wrong alignment on DLCOnlineSyncActor_FindPlayerByPos");
static_assert(sizeof(DLCOnlineSyncActor_FindPlayerByPos) == 0x000050, "Wrong size on DLCOnlineSyncActor_FindPlayerByPos");
static_assert(offsetof(DLCOnlineSyncActor_FindPlayerByPos, CampId) == 0x000000, "Member 'DLCOnlineSyncActor_FindPlayerByPos::CampId' has a wrong offset!");
static_assert(offsetof(DLCOnlineSyncActor_FindPlayerByPos, TeamID) == 0x000004, "Member 'DLCOnlineSyncActor_FindPlayerByPos::TeamID' has a wrong offset!");
static_assert(offsetof(DLCOnlineSyncActor_FindPlayerByPos, PosID) == 0x000008, "Member 'DLCOnlineSyncActor_FindPlayerByPos::PosID' has a wrong offset!");
static_assert(offsetof(DLCOnlineSyncActor_FindPlayerByPos, ReturnValue) == 0x000010, "Member 'DLCOnlineSyncActor_FindPlayerByPos::ReturnValue' has a wrong offset!");

// Function DLCOnline.DLCOnlineSystem.Get
// 0x0010 (0x0010 - 0x0000)
struct DLCOnlineSystem_Get final
{
public:
	class UObject*                                InWorldContext;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDLCOnlineSystem*                       ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DLCOnlineSystem_Get) == 0x000008, "Wrong alignment on DLCOnlineSystem_Get");
static_assert(sizeof(DLCOnlineSystem_Get) == 0x000010, "Wrong size on DLCOnlineSystem_Get");
static_assert(offsetof(DLCOnlineSystem_Get, InWorldContext) == 0x000000, "Member 'DLCOnlineSystem_Get::InWorldContext' has a wrong offset!");
static_assert(offsetof(DLCOnlineSystem_Get, ReturnValue) == 0x000008, "Member 'DLCOnlineSystem_Get::ReturnValue' has a wrong offset!");

}

