#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Door_On

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Door_On.Door_On_C
// 0x00B8 (0x02E0 - 0x0228)
class ADoor_On_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Cube2;                                             // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DitherOpacity1;                                    // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DitherOpacity;                                     // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tip02;                                             // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tip01;                                             // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Ar03_jz007_02_sm;                                  // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Ar03_jz007_03_sm;                                  // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube1;                                             // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USimpleAnimComponent*                   Off;                                               // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USimpleAnimComponent*                   RightOnNew;                                        // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USimpleAnimComponent*                   LeftOnNew;                                         // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Left;                                              // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Right;                                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled;                                        // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsOpen;                                            // 0x02B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B2[0x2];                                      // 0x02B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Side;                                              // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLocked;                                          // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsLeft;                                            // 0x02B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsPlayerInDoor;                                    // 0x02BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsPlayerHasPass;                                   // 0x02BB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         DoorState;                                         // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            State0;                                            // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            State1;                                            // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            State2;                                            // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlayerInLeftBox;                                 // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsPlayerInRightBox;                                // 0x02D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsPlayerFromLeftIn;                                // 0x02DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsPlayerFromRightIn;                               // 0x02DB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsSetRot;                                          // 0x02DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void SetDitherRot();
	void CanRunTask(bool* Res);
	void SetDoorState(int32 State);
	void CloseTheDoor();
	void OnPostOpenDoor();
	void CloseDoor();
	void OpenDoor();
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void BndEvt__Door_On_Left_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__Door_On_Right_K2Node_ComponentBoundEvent_7_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__Door_Test_Left_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__Door_Test_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void ExecuteUbergraph_Door_On(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Door_On_C">();
	}
	static class ADoor_On_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADoor_On_C>();
	}
};
static_assert(alignof(ADoor_On_C) == 0x000008, "Wrong alignment on ADoor_On_C");
static_assert(sizeof(ADoor_On_C) == 0x0002E0, "Wrong size on ADoor_On_C");
static_assert(offsetof(ADoor_On_C, UberGraphFrame) == 0x000228, "Member 'ADoor_On_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, Cube2) == 0x000230, "Member 'ADoor_On_C::Cube2' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, DitherOpacity1) == 0x000238, "Member 'ADoor_On_C::DitherOpacity1' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, Box) == 0x000240, "Member 'ADoor_On_C::Box' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, DitherOpacity) == 0x000248, "Member 'ADoor_On_C::DitherOpacity' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, Tip02) == 0x000250, "Member 'ADoor_On_C::Tip02' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, Tip01) == 0x000258, "Member 'ADoor_On_C::Tip01' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, Ar03_jz007_02_sm) == 0x000260, "Member 'ADoor_On_C::Ar03_jz007_02_sm' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, Ar03_jz007_03_sm) == 0x000268, "Member 'ADoor_On_C::Ar03_jz007_03_sm' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, Cube1) == 0x000270, "Member 'ADoor_On_C::Cube1' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, Off) == 0x000278, "Member 'ADoor_On_C::Off' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, RightOnNew) == 0x000280, "Member 'ADoor_On_C::RightOnNew' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, LeftOnNew) == 0x000288, "Member 'ADoor_On_C::LeftOnNew' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, Left) == 0x000290, "Member 'ADoor_On_C::Left' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, Right) == 0x000298, "Member 'ADoor_On_C::Right' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, Cube) == 0x0002A0, "Member 'ADoor_On_C::Cube' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, DefaultSceneRoot) == 0x0002A8, "Member 'ADoor_On_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, bIsEnabled) == 0x0002B0, "Member 'ADoor_On_C::bIsEnabled' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, IsOpen) == 0x0002B1, "Member 'ADoor_On_C::IsOpen' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, Side) == 0x0002B4, "Member 'ADoor_On_C::Side' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, IsLocked) == 0x0002B8, "Member 'ADoor_On_C::IsLocked' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, IsLeft) == 0x0002B9, "Member 'ADoor_On_C::IsLeft' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, IsPlayerInDoor) == 0x0002BA, "Member 'ADoor_On_C::IsPlayerInDoor' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, IsPlayerHasPass) == 0x0002BB, "Member 'ADoor_On_C::IsPlayerHasPass' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, DoorState) == 0x0002BC, "Member 'ADoor_On_C::DoorState' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, State0) == 0x0002C0, "Member 'ADoor_On_C::State0' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, State1) == 0x0002C8, "Member 'ADoor_On_C::State1' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, State2) == 0x0002D0, "Member 'ADoor_On_C::State2' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, IsPlayerInLeftBox) == 0x0002D8, "Member 'ADoor_On_C::IsPlayerInLeftBox' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, IsPlayerInRightBox) == 0x0002D9, "Member 'ADoor_On_C::IsPlayerInRightBox' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, IsPlayerFromLeftIn) == 0x0002DA, "Member 'ADoor_On_C::IsPlayerFromLeftIn' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, IsPlayerFromRightIn) == 0x0002DB, "Member 'ADoor_On_C::IsPlayerFromRightIn' has a wrong offset!");
static_assert(offsetof(ADoor_On_C, IsSetRot) == 0x0002DC, "Member 'ADoor_On_C::IsSetRot' has a wrong offset!");

}

