#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DronesNormalSlotConfigNum5

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DronesNormalSlotConfigNum5.DronesNormalSlotConfigNum5_C
// 0x0028 (0x0260 - 0x0238)
class ADronesNormalSlotConfigNum5_C final : public AAITeamSlotConfig
{
public:
	class USlotConfigComponent*                   SlotConfig4;                                       // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USlotConfigComponent*                   SlotConfig3;                                       // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USlotConfigComponent*                   SlotConfig2;                                       // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USlotConfigComponent*                   SlotConfig0;                                       // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USlotConfigComponent*                   SlotConfig1;                                       // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DronesNormalSlotConfigNum5_C">();
	}
	static class ADronesNormalSlotConfigNum5_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADronesNormalSlotConfigNum5_C>();
	}
};
static_assert(alignof(ADronesNormalSlotConfigNum5_C) == 0x000008, "Wrong alignment on ADronesNormalSlotConfigNum5_C");
static_assert(sizeof(ADronesNormalSlotConfigNum5_C) == 0x000260, "Wrong size on ADronesNormalSlotConfigNum5_C");
static_assert(offsetof(ADronesNormalSlotConfigNum5_C, SlotConfig4) == 0x000238, "Member 'ADronesNormalSlotConfigNum5_C::SlotConfig4' has a wrong offset!");
static_assert(offsetof(ADronesNormalSlotConfigNum5_C, SlotConfig3) == 0x000240, "Member 'ADronesNormalSlotConfigNum5_C::SlotConfig3' has a wrong offset!");
static_assert(offsetof(ADronesNormalSlotConfigNum5_C, SlotConfig2) == 0x000248, "Member 'ADronesNormalSlotConfigNum5_C::SlotConfig2' has a wrong offset!");
static_assert(offsetof(ADronesNormalSlotConfigNum5_C, SlotConfig0) == 0x000250, "Member 'ADronesNormalSlotConfigNum5_C::SlotConfig0' has a wrong offset!");
static_assert(offsetof(ADronesNormalSlotConfigNum5_C, SlotConfig1) == 0x000258, "Member 'ADronesNormalSlotConfigNum5_C::SlotConfig1' has a wrong offset!");

}

