#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DronesNormalSlotConfigNum1

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DronesNormalSlotConfigNum1.DronesNormalSlotConfigNum1_C
// 0x0028 (0x0260 - 0x0238)
class ADronesNormalSlotConfigNum1_C final : public AAITeamSlotConfig
{
public:
	class USlotConfigComponent*                   SlotConfig4;                                       // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USlotConfigComponent*                   SlotConfig3;                                       // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USlotConfigComponent*                   SlotConfig2;                                       // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USlotConfigComponent*                   SlotConfig0;                                       // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USlotConfigComponent*                   SlotConfig1;                                       // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DronesNormalSlotConfigNum1_C">();
	}
	static class ADronesNormalSlotConfigNum1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADronesNormalSlotConfigNum1_C>();
	}
};
static_assert(alignof(ADronesNormalSlotConfigNum1_C) == 0x000008, "Wrong alignment on ADronesNormalSlotConfigNum1_C");
static_assert(sizeof(ADronesNormalSlotConfigNum1_C) == 0x000260, "Wrong size on ADronesNormalSlotConfigNum1_C");
static_assert(offsetof(ADronesNormalSlotConfigNum1_C, SlotConfig4) == 0x000238, "Member 'ADronesNormalSlotConfigNum1_C::SlotConfig4' has a wrong offset!");
static_assert(offsetof(ADronesNormalSlotConfigNum1_C, SlotConfig3) == 0x000240, "Member 'ADronesNormalSlotConfigNum1_C::SlotConfig3' has a wrong offset!");
static_assert(offsetof(ADronesNormalSlotConfigNum1_C, SlotConfig2) == 0x000248, "Member 'ADronesNormalSlotConfigNum1_C::SlotConfig2' has a wrong offset!");
static_assert(offsetof(ADronesNormalSlotConfigNum1_C, SlotConfig0) == 0x000250, "Member 'ADronesNormalSlotConfigNum1_C::SlotConfig0' has a wrong offset!");
static_assert(offsetof(ADronesNormalSlotConfigNum1_C, SlotConfig1) == 0x000258, "Member 'ADronesNormalSlotConfigNum1_C::SlotConfig1' has a wrong offset!");

}

