#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Drop_SurgeBox

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Drop_SurgeBox.Drop_SurgeBox_C.ExecuteUbergraph_Drop_SurgeBox
// 0x0060 (0x0060 - 0x0000)
struct Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerController*>              CallFunc_GetPlayerControllerList_OutPlayerCtrls;   // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeModifier_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox) == 0x000008, "Wrong alignment on Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox");
static_assert(sizeof(Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox) == 0x000060, "Wrong size on Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox");
static_assert(offsetof(Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox, EntryPoint) == 0x000000, "Member 'Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox, ___int_Loop_Counter_Variable) == 0x000004, "Member 'Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox, ___int_Array_Index_Variable) == 0x00000C, "Member 'Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox, CallFunc_GetPlayerControllerList_OutPlayerCtrls) == 0x000010, "Member 'Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox::CallFunc_GetPlayerControllerList_OutPlayerCtrls' has a wrong offset!");
static_assert(offsetof(Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox, CallFunc_Array_Get_Item) == 0x000028, "Member 'Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox, CallFunc_K2_GetPawn_ReturnValue) == 0x000038, "Member 'Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox, K2Node_DynamicCast_AsGame_Player) == 0x000040, "Member 'Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox::K2Node_DynamicCast_AsGame_Player' has a wrong offset!");
static_assert(offsetof(Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00004C, "Member 'Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox, CallFunc_MakeModifier_ReturnValue) == 0x000058, "Member 'Drop_SurgeBox_C_ExecuteUbergraph_Drop_SurgeBox::CallFunc_MakeModifier_ReturnValue' has a wrong offset!");

}

