#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Drop_Client

#include "Basic.hpp"


namespace SDK::Params
{

// Function Drop_Client.Drop_Client_C.PlayVoice
// 0x0048 (0x0048 - 0x0000)
struct Drop_Client_C_PlayVoice final
{
public:
	TDelegate<void(class UWwiseComponent* WwiseComponent)> ___delegate_Variable;                              // 0x0000(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_GetTemplateID_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_Int64ToInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Drop_Client_C_PlayVoice) == 0x000008, "Wrong alignment on Drop_Client_C_PlayVoice");
static_assert(sizeof(Drop_Client_C_PlayVoice) == 0x000048, "Wrong size on Drop_Client_C_PlayVoice");
static_assert(offsetof(Drop_Client_C_PlayVoice, ___delegate_Variable) == 0x000000, "Member 'Drop_Client_C_PlayVoice::___delegate_Variable' has a wrong offset!");
static_assert(offsetof(Drop_Client_C_PlayVoice, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'Drop_Client_C_PlayVoice::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_Client_C_PlayVoice, CallFunc_K2_GetPawn_ReturnValue) == 0x000018, "Member 'Drop_Client_C_PlayVoice::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_Client_C_PlayVoice, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'Drop_Client_C_PlayVoice::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_Client_C_PlayVoice, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'Drop_Client_C_PlayVoice::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drop_Client_C_PlayVoice, K2Node_DynamicCast_AsGame_Player) == 0x000028, "Member 'Drop_Client_C_PlayVoice::K2Node_DynamicCast_AsGame_Player' has a wrong offset!");
static_assert(offsetof(Drop_Client_C_PlayVoice, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Drop_Client_C_PlayVoice::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Drop_Client_C_PlayVoice, CallFunc_GetTemplateID_ReturnValue) == 0x000038, "Member 'Drop_Client_C_PlayVoice::CallFunc_GetTemplateID_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_Client_C_PlayVoice, CallFunc_Conv_Int64ToInt_ReturnValue) == 0x000040, "Member 'Drop_Client_C_PlayVoice::CallFunc_Conv_Int64ToInt_ReturnValue' has a wrong offset!");

// Function Drop_Client.Drop_Client_C.ApplyEffect
// 0x0008 (0x0008 - 0x0000)
struct Drop_Client_C_ApplyEffect final
{
public:
	class AController*                            BelongCtrl;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Drop_Client_C_ApplyEffect) == 0x000008, "Wrong alignment on Drop_Client_C_ApplyEffect");
static_assert(sizeof(Drop_Client_C_ApplyEffect) == 0x000008, "Wrong size on Drop_Client_C_ApplyEffect");
static_assert(offsetof(Drop_Client_C_ApplyEffect, BelongCtrl) == 0x000000, "Member 'Drop_Client_C_ApplyEffect::BelongCtrl' has a wrong offset!");

// Function Drop_Client.Drop_Client_C.ExecuteUbergraph_Drop_Client
// 0x0018 (0x0018 - 0x0000)
struct Drop_Client_C_ExecuteUbergraph_Drop_Client final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_BelongCtrl;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Drop_Client_C_ExecuteUbergraph_Drop_Client) == 0x000008, "Wrong alignment on Drop_Client_C_ExecuteUbergraph_Drop_Client");
static_assert(sizeof(Drop_Client_C_ExecuteUbergraph_Drop_Client) == 0x000018, "Wrong size on Drop_Client_C_ExecuteUbergraph_Drop_Client");
static_assert(offsetof(Drop_Client_C_ExecuteUbergraph_Drop_Client, EntryPoint) == 0x000000, "Member 'Drop_Client_C_ExecuteUbergraph_Drop_Client::EntryPoint' has a wrong offset!");
static_assert(offsetof(Drop_Client_C_ExecuteUbergraph_Drop_Client, K2Node_Event_BelongCtrl) == 0x000008, "Member 'Drop_Client_C_ExecuteUbergraph_Drop_Client::K2Node_Event_BelongCtrl' has a wrong offset!");
static_assert(offsetof(Drop_Client_C_ExecuteUbergraph_Drop_Client, CallFunc_RandomInteger_ReturnValue) == 0x000010, "Member 'Drop_Client_C_ExecuteUbergraph_Drop_Client::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_Client_C_ExecuteUbergraph_Drop_Client, CallFunc_Less_IntInt_ReturnValue) == 0x000014, "Member 'Drop_Client_C_ExecuteUbergraph_Drop_Client::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

