#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Drop_HPBox

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Drop_HPBox.Drop_HPBox_C.ApplyEffect
// 0x0008 (0x0008 - 0x0000)
struct Drop_HPBox_C_ApplyEffect final
{
public:
	class AController*                            BelongCtrl;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Drop_HPBox_C_ApplyEffect) == 0x000008, "Wrong alignment on Drop_HPBox_C_ApplyEffect");
static_assert(sizeof(Drop_HPBox_C_ApplyEffect) == 0x000008, "Wrong size on Drop_HPBox_C_ApplyEffect");
static_assert(offsetof(Drop_HPBox_C_ApplyEffect, BelongCtrl) == 0x000000, "Member 'Drop_HPBox_C_ApplyEffect::BelongCtrl' has a wrong offset!");

// Function Drop_HPBox.Drop_HPBox_C.ExecuteUbergraph_Drop_HPBox
// 0x00B0 (0x00B0 - 0x0000)
struct Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_BelongCtrl;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter_C*                       K2Node_DynamicCast_AsBase_Character;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnGameNiagaraAttached_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_GetTemplateID_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_Int64ToInt_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseComponent*                        CallFunc_PostEventAtLocation_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseComponent*                        CallFunc_PostEventAtLocation_ReturnValue_1;        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWwiseComponent* WwiseComponent)> ___delegate_Variable;                              // 0x00A0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
};
static_assert(alignof(Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox) == 0x000008, "Wrong alignment on Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox");
static_assert(sizeof(Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox) == 0x0000B0, "Wrong size on Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox");
static_assert(offsetof(Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox, EntryPoint) == 0x000000, "Member 'Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox, K2Node_Event_BelongCtrl) == 0x000008, "Member 'Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox::K2Node_Event_BelongCtrl' has a wrong offset!");
static_assert(offsetof(Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox, CallFunc_K2_GetPawn_ReturnValue) == 0x000018, "Member 'Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox, CallFunc_IsValid_ReturnValue_2) == 0x000020, "Member 'Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox, K2Node_DynamicCast_AsBase_Character) == 0x000028, "Member 'Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox::K2Node_DynamicCast_AsBase_Character' has a wrong offset!");
static_assert(offsetof(Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox, K2Node_DynamicCast_AsGame_Player) == 0x000038, "Member 'Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox::K2Node_DynamicCast_AsGame_Player' has a wrong offset!");
static_assert(offsetof(Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox, CallFunc_SpawnGameNiagaraAttached_ReturnValue) == 0x000048, "Member 'Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox::CallFunc_SpawnGameNiagaraAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox, CallFunc_GetTemplateID_ReturnValue) == 0x000050, "Member 'Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox::CallFunc_GetTemplateID_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox, CallFunc_Conv_Int64ToInt_ReturnValue) == 0x000058, "Member 'Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox::CallFunc_Conv_Int64ToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x00005C, "Member 'Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox, CallFunc_K2_GetComponentRotation_ReturnValue_1) == 0x000068, "Member 'Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox::CallFunc_K2_GetComponentRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000074, "Member 'Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000080, "Member 'Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox, CallFunc_PostEventAtLocation_ReturnValue) == 0x000090, "Member 'Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox, CallFunc_PostEventAtLocation_ReturnValue_1) == 0x000098, "Member 'Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox::CallFunc_PostEventAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox, ___delegate_Variable) == 0x0000A0, "Member 'Drop_HPBox_C_ExecuteUbergraph_Drop_HPBox::___delegate_Variable' has a wrong offset!");

}

