#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Drop_CDBox2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Drop_Server_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Drop_CDBox2.Drop_CDBox2_C
// 0x0020 (0x0498 - 0x0478)
class ADrop_CDBox2_C final : public ADrop_Server_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Drop_CDBox2_C;                      // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      E_prop_drop003_a33_p;                              // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Drop_CDBox2(int32 EntryPoint);
	void OnStartPerform();
	void OnInitialize();
	void ApplyEffect(class AController* BelongCtrl);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Drop_CDBox2_C">();
	}
	static class ADrop_CDBox2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADrop_CDBox2_C>();
	}
};
static_assert(alignof(ADrop_CDBox2_C) == 0x000008, "Wrong alignment on ADrop_CDBox2_C");
static_assert(sizeof(ADrop_CDBox2_C) == 0x000498, "Wrong size on ADrop_CDBox2_C");
static_assert(offsetof(ADrop_CDBox2_C, UberGraphFrame_Drop_CDBox2_C) == 0x000478, "Member 'ADrop_CDBox2_C::UberGraphFrame_Drop_CDBox2_C' has a wrong offset!");
static_assert(offsetof(ADrop_CDBox2_C, E_prop_drop003_a33_p) == 0x000480, "Member 'ADrop_CDBox2_C::E_prop_drop003_a33_p' has a wrong offset!");
static_assert(offsetof(ADrop_CDBox2_C, StaticMesh) == 0x000488, "Member 'ADrop_CDBox2_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ADrop_CDBox2_C, Scene) == 0x000490, "Member 'ADrop_CDBox2_C::Scene' has a wrong offset!");

}

