#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Drop_BlueprintBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Drop_BlueprintBase.Drop_BlueprintBase_C
// 0x00A8 (0x04E0 - 0x0438)
class ADrop_BlueprintBase_C : public ALevelDropBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Spawner;                                           // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseDropEffect;                                     // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UseCoreEffect;                                     // 0x0449(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44A[0x2];                                      // 0x044A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Drop_Out_Id;                                       // 0x044C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Drop_Out_Index;                                    // 0x0450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Core_Out_Id;                                       // 0x0454(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Core_Out_Index;                                    // 0x0458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Tail_Out_Id;                                       // 0x045C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Tail_Out_Index;                                    // 0x0460(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseTailEffect;                                     // 0x0464(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UseUpEffect;                                       // 0x0465(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_466[0x2];                                      // 0x0466(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         DropEffect;                                        // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         CoreEffect;                                        // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Absorb_Effect;                                     // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         TailEffect;                                        // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDropOutCleaned;                                   // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         UpEffect;                                          // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Up_Out_Id;                                         // 0x0498(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Up_Out_Index;                                      // 0x049C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUpCleaned;                                        // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A1[0x3];                                      // 0x04A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                UpEffectOffset;                                    // 0x04A4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 DropWwise;                                         // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 PickUpVoiceID;                                     // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         PlayVoiceChance;                                   // 0x04D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalTime;                                         // 0x04D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasCreateUpEffect;                                // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void PlayPickVoice(class AController* Controller);
	void PlayDropWwise();
	void Init_Effects();
	void ClearDropInSpawner();
	void SetSpawner(class AActor* Spawner_0);
	void ApplyEffect(class AController* BelongCtrl);
	void ApplyEffect_Server(class AController* BelongCtrl);
	void PerformEnd();
	void OnInitialize();
	void OnStartPerform();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_Drop_BlueprintBase(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Drop_BlueprintBase_C">();
	}
	static class ADrop_BlueprintBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADrop_BlueprintBase_C>();
	}
};
static_assert(alignof(ADrop_BlueprintBase_C) == 0x000008, "Wrong alignment on ADrop_BlueprintBase_C");
static_assert(sizeof(ADrop_BlueprintBase_C) == 0x0004E0, "Wrong size on ADrop_BlueprintBase_C");
static_assert(offsetof(ADrop_BlueprintBase_C, UberGraphFrame) == 0x000438, "Member 'ADrop_BlueprintBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, Spawner) == 0x000440, "Member 'ADrop_BlueprintBase_C::Spawner' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, UseDropEffect) == 0x000448, "Member 'ADrop_BlueprintBase_C::UseDropEffect' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, UseCoreEffect) == 0x000449, "Member 'ADrop_BlueprintBase_C::UseCoreEffect' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, Drop_Out_Id) == 0x00044C, "Member 'ADrop_BlueprintBase_C::Drop_Out_Id' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, Drop_Out_Index) == 0x000450, "Member 'ADrop_BlueprintBase_C::Drop_Out_Index' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, Core_Out_Id) == 0x000454, "Member 'ADrop_BlueprintBase_C::Core_Out_Id' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, Core_Out_Index) == 0x000458, "Member 'ADrop_BlueprintBase_C::Core_Out_Index' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, Tail_Out_Id) == 0x00045C, "Member 'ADrop_BlueprintBase_C::Tail_Out_Id' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, Tail_Out_Index) == 0x000460, "Member 'ADrop_BlueprintBase_C::Tail_Out_Index' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, UseTailEffect) == 0x000464, "Member 'ADrop_BlueprintBase_C::UseTailEffect' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, UseUpEffect) == 0x000465, "Member 'ADrop_BlueprintBase_C::UseUpEffect' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, DropEffect) == 0x000468, "Member 'ADrop_BlueprintBase_C::DropEffect' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, CoreEffect) == 0x000470, "Member 'ADrop_BlueprintBase_C::CoreEffect' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, Absorb_Effect) == 0x000478, "Member 'ADrop_BlueprintBase_C::Absorb_Effect' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, TailEffect) == 0x000480, "Member 'ADrop_BlueprintBase_C::TailEffect' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, bDropOutCleaned) == 0x000488, "Member 'ADrop_BlueprintBase_C::bDropOutCleaned' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, UpEffect) == 0x000490, "Member 'ADrop_BlueprintBase_C::UpEffect' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, Up_Out_Id) == 0x000498, "Member 'ADrop_BlueprintBase_C::Up_Out_Id' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, Up_Out_Index) == 0x00049C, "Member 'ADrop_BlueprintBase_C::Up_Out_Index' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, bUpCleaned) == 0x0004A0, "Member 'ADrop_BlueprintBase_C::bUpCleaned' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, UpEffectOffset) == 0x0004A4, "Member 'ADrop_BlueprintBase_C::UpEffectOffset' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, DropWwise) == 0x0004B0, "Member 'ADrop_BlueprintBase_C::DropWwise' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, PickUpVoiceID) == 0x0004C0, "Member 'ADrop_BlueprintBase_C::PickUpVoiceID' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, PlayVoiceChance) == 0x0004D0, "Member 'ADrop_BlueprintBase_C::PlayVoiceChance' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, TotalTime) == 0x0004D4, "Member 'ADrop_BlueprintBase_C::TotalTime' has a wrong offset!");
static_assert(offsetof(ADrop_BlueprintBase_C, bHasCreateUpEffect) == 0x0004D8, "Member 'ADrop_BlueprintBase_C::bHasCreateUpEffect' has a wrong offset!");

}

