#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Drop_BlueprintBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Drop_BlueprintBase.Drop_BlueprintBase_C.PlayPickVoice
// 0x0050 (0x0050 - 0x0000)
struct Drop_BlueprintBase_C_PlayPickVoice final
{
public:
	class AController*                            Controller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_GetTemplateID_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_Int64ToInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWwiseComponent* WwiseComponent)> ___delegate_Variable;                              // 0x0038(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Drop_BlueprintBase_C_PlayPickVoice) == 0x000008, "Wrong alignment on Drop_BlueprintBase_C_PlayPickVoice");
static_assert(sizeof(Drop_BlueprintBase_C_PlayPickVoice) == 0x000050, "Wrong size on Drop_BlueprintBase_C_PlayPickVoice");
static_assert(offsetof(Drop_BlueprintBase_C_PlayPickVoice, Controller) == 0x000000, "Member 'Drop_BlueprintBase_C_PlayPickVoice::Controller' has a wrong offset!");
static_assert(offsetof(Drop_BlueprintBase_C_PlayPickVoice, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'Drop_BlueprintBase_C_PlayPickVoice::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_BlueprintBase_C_PlayPickVoice, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'Drop_BlueprintBase_C_PlayPickVoice::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_BlueprintBase_C_PlayPickVoice, K2Node_DynamicCast_AsGame_Player) == 0x000018, "Member 'Drop_BlueprintBase_C_PlayPickVoice::K2Node_DynamicCast_AsGame_Player' has a wrong offset!");
static_assert(offsetof(Drop_BlueprintBase_C_PlayPickVoice, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Drop_BlueprintBase_C_PlayPickVoice::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Drop_BlueprintBase_C_PlayPickVoice, CallFunc_RandomInteger_ReturnValue) == 0x000024, "Member 'Drop_BlueprintBase_C_PlayPickVoice::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_BlueprintBase_C_PlayPickVoice, CallFunc_GetTemplateID_ReturnValue) == 0x000028, "Member 'Drop_BlueprintBase_C_PlayPickVoice::CallFunc_GetTemplateID_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_BlueprintBase_C_PlayPickVoice, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000030, "Member 'Drop_BlueprintBase_C_PlayPickVoice::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_BlueprintBase_C_PlayPickVoice, CallFunc_Conv_Int64ToInt_ReturnValue) == 0x000034, "Member 'Drop_BlueprintBase_C_PlayPickVoice::CallFunc_Conv_Int64ToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_BlueprintBase_C_PlayPickVoice, ___delegate_Variable) == 0x000038, "Member 'Drop_BlueprintBase_C_PlayPickVoice::___delegate_Variable' has a wrong offset!");
static_assert(offsetof(Drop_BlueprintBase_C_PlayPickVoice, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000048, "Member 'Drop_BlueprintBase_C_PlayPickVoice::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");

// Function Drop_BlueprintBase.Drop_BlueprintBase_C.PlayDropWwise
// 0x0028 (0x0028 - 0x0000)
struct Drop_BlueprintBase_C_PlayDropWwise final
{
public:
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseComponent*                        CallFunc_PostEventAtLocation_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Drop_BlueprintBase_C_PlayDropWwise) == 0x000008, "Wrong alignment on Drop_BlueprintBase_C_PlayDropWwise");
static_assert(sizeof(Drop_BlueprintBase_C_PlayDropWwise) == 0x000028, "Wrong size on Drop_BlueprintBase_C_PlayDropWwise");
static_assert(offsetof(Drop_BlueprintBase_C_PlayDropWwise, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000000, "Member 'Drop_BlueprintBase_C_PlayDropWwise::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_BlueprintBase_C_PlayDropWwise, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000004, "Member 'Drop_BlueprintBase_C_PlayDropWwise::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_BlueprintBase_C_PlayDropWwise, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000010, "Member 'Drop_BlueprintBase_C_PlayDropWwise::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_BlueprintBase_C_PlayDropWwise, CallFunc_PostEventAtLocation_ReturnValue) == 0x000020, "Member 'Drop_BlueprintBase_C_PlayDropWwise::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");

// Function Drop_BlueprintBase.Drop_BlueprintBase_C.Init Effects
// 0x0024 (0x0024 - 0x0000)
struct Drop_BlueprintBase_C_Init_Effects final
{
public:
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompositeAttachNewMode_OutId;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompositeAttachNewMode_OutIndex;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompositeAttachNewMode_OutId_1;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompositeAttachNewMode_OutIndex_1;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompositeAttachNewMode_OutId_2;           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompositeAttachNewMode_OutIndex_2;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Drop_BlueprintBase_C_Init_Effects) == 0x000004, "Wrong alignment on Drop_BlueprintBase_C_Init_Effects");
static_assert(sizeof(Drop_BlueprintBase_C_Init_Effects) == 0x000024, "Wrong size on Drop_BlueprintBase_C_Init_Effects");
static_assert(offsetof(Drop_BlueprintBase_C_Init_Effects, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000000, "Member 'Drop_BlueprintBase_C_Init_Effects::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_BlueprintBase_C_Init_Effects, CallFunc_CompositeAttachNewMode_OutId) == 0x00000C, "Member 'Drop_BlueprintBase_C_Init_Effects::CallFunc_CompositeAttachNewMode_OutId' has a wrong offset!");
static_assert(offsetof(Drop_BlueprintBase_C_Init_Effects, CallFunc_CompositeAttachNewMode_OutIndex) == 0x000010, "Member 'Drop_BlueprintBase_C_Init_Effects::CallFunc_CompositeAttachNewMode_OutIndex' has a wrong offset!");
static_assert(offsetof(Drop_BlueprintBase_C_Init_Effects, CallFunc_CompositeAttachNewMode_OutId_1) == 0x000014, "Member 'Drop_BlueprintBase_C_Init_Effects::CallFunc_CompositeAttachNewMode_OutId_1' has a wrong offset!");
static_assert(offsetof(Drop_BlueprintBase_C_Init_Effects, CallFunc_CompositeAttachNewMode_OutIndex_1) == 0x000018, "Member 'Drop_BlueprintBase_C_Init_Effects::CallFunc_CompositeAttachNewMode_OutIndex_1' has a wrong offset!");
static_assert(offsetof(Drop_BlueprintBase_C_Init_Effects, CallFunc_CompositeAttachNewMode_OutId_2) == 0x00001C, "Member 'Drop_BlueprintBase_C_Init_Effects::CallFunc_CompositeAttachNewMode_OutId_2' has a wrong offset!");
static_assert(offsetof(Drop_BlueprintBase_C_Init_Effects, CallFunc_CompositeAttachNewMode_OutIndex_2) == 0x000020, "Member 'Drop_BlueprintBase_C_Init_Effects::CallFunc_CompositeAttachNewMode_OutIndex_2' has a wrong offset!");

// Function Drop_BlueprintBase.Drop_BlueprintBase_C.ClearDropInSpawner
// 0x0010 (0x0010 - 0x0000)
struct Drop_BlueprintBase_C_ClearDropInSpawner final
{
public:
	class ASupplyGenerator_C*                     K2Node_DynamicCast_AsSupply_Generator;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Drop_BlueprintBase_C_ClearDropInSpawner) == 0x000008, "Wrong alignment on Drop_BlueprintBase_C_ClearDropInSpawner");
static_assert(sizeof(Drop_BlueprintBase_C_ClearDropInSpawner) == 0x000010, "Wrong size on Drop_BlueprintBase_C_ClearDropInSpawner");
static_assert(offsetof(Drop_BlueprintBase_C_ClearDropInSpawner, K2Node_DynamicCast_AsSupply_Generator) == 0x000000, "Member 'Drop_BlueprintBase_C_ClearDropInSpawner::K2Node_DynamicCast_AsSupply_Generator' has a wrong offset!");
static_assert(offsetof(Drop_BlueprintBase_C_ClearDropInSpawner, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'Drop_BlueprintBase_C_ClearDropInSpawner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Drop_BlueprintBase_C_ClearDropInSpawner, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'Drop_BlueprintBase_C_ClearDropInSpawner::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Drop_BlueprintBase.Drop_BlueprintBase_C.SetSpawner
// 0x0008 (0x0008 - 0x0000)
struct Drop_BlueprintBase_C_SetSpawner final
{
public:
	class AActor*                                 Spawner_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Drop_BlueprintBase_C_SetSpawner) == 0x000008, "Wrong alignment on Drop_BlueprintBase_C_SetSpawner");
static_assert(sizeof(Drop_BlueprintBase_C_SetSpawner) == 0x000008, "Wrong size on Drop_BlueprintBase_C_SetSpawner");
static_assert(offsetof(Drop_BlueprintBase_C_SetSpawner, Spawner_0) == 0x000000, "Member 'Drop_BlueprintBase_C_SetSpawner::Spawner_0' has a wrong offset!");

// Function Drop_BlueprintBase.Drop_BlueprintBase_C.ApplyEffect
// 0x0008 (0x0008 - 0x0000)
struct Drop_BlueprintBase_C_ApplyEffect final
{
public:
	class AController*                            BelongCtrl;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Drop_BlueprintBase_C_ApplyEffect) == 0x000008, "Wrong alignment on Drop_BlueprintBase_C_ApplyEffect");
static_assert(sizeof(Drop_BlueprintBase_C_ApplyEffect) == 0x000008, "Wrong size on Drop_BlueprintBase_C_ApplyEffect");
static_assert(offsetof(Drop_BlueprintBase_C_ApplyEffect, BelongCtrl) == 0x000000, "Member 'Drop_BlueprintBase_C_ApplyEffect::BelongCtrl' has a wrong offset!");

// Function Drop_BlueprintBase.Drop_BlueprintBase_C.ApplyEffect_Server
// 0x0008 (0x0008 - 0x0000)
struct Drop_BlueprintBase_C_ApplyEffect_Server final
{
public:
	class AController*                            BelongCtrl;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Drop_BlueprintBase_C_ApplyEffect_Server) == 0x000008, "Wrong alignment on Drop_BlueprintBase_C_ApplyEffect_Server");
static_assert(sizeof(Drop_BlueprintBase_C_ApplyEffect_Server) == 0x000008, "Wrong size on Drop_BlueprintBase_C_ApplyEffect_Server");
static_assert(offsetof(Drop_BlueprintBase_C_ApplyEffect_Server, BelongCtrl) == 0x000000, "Member 'Drop_BlueprintBase_C_ApplyEffect_Server::BelongCtrl' has a wrong offset!");

// Function Drop_BlueprintBase.Drop_BlueprintBase_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct Drop_BlueprintBase_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Drop_BlueprintBase_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on Drop_BlueprintBase_C_ReceiveEndPlay");
static_assert(sizeof(Drop_BlueprintBase_C_ReceiveEndPlay) == 0x000001, "Wrong size on Drop_BlueprintBase_C_ReceiveEndPlay");
static_assert(offsetof(Drop_BlueprintBase_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'Drop_BlueprintBase_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function Drop_BlueprintBase.Drop_BlueprintBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Drop_BlueprintBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Drop_BlueprintBase_C_ReceiveTick) == 0x000004, "Wrong alignment on Drop_BlueprintBase_C_ReceiveTick");
static_assert(sizeof(Drop_BlueprintBase_C_ReceiveTick) == 0x000004, "Wrong size on Drop_BlueprintBase_C_ReceiveTick");
static_assert(offsetof(Drop_BlueprintBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Drop_BlueprintBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Drop_BlueprintBase.Drop_BlueprintBase_C.ExecuteUbergraph_Drop_BlueprintBase
// 0x00B8 (0x00B8 - 0x0000)
struct Drop_BlueprintBase_C_ExecuteUbergraph_Drop_BlueprintBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_BelongCtrl_1;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_BelongCtrl;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompositeAttachNewMode_OutId;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompositeAttachNewMode_OutIndex;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompositeAttachNewMode_OutId_1;           // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompositeAttachNewMode_OutIndex_1;        // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelDropsManager*                     CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLastPickTime_ReturnValue;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanInteract_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Drop_BlueprintBase_C_ExecuteUbergraph_Drop_BlueprintBase) == 0x000008, "Wrong alignment on Drop_BlueprintBase_C_ExecuteUbergraph_Drop_BlueprintBase");
static_assert(sizeof(Drop_BlueprintBase_C_ExecuteUbergraph_Drop_BlueprintBase) == 0x0000B8, "Wrong size on Drop_BlueprintBase_C_ExecuteUbergraph_Drop_BlueprintBase");
static_assert(offsetof(Drop_BlueprintBase_C_ExecuteUbergraph_Drop_BlueprintBase, EntryPoint) == 0x000000, "Member 'Drop_BlueprintBase_C_ExecuteUbergraph_Drop_BlueprintBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(Drop_BlueprintBase_C_ExecuteUbergraph_Drop_BlueprintBase, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'Drop_BlueprintBase_C_ExecuteUbergraph_Drop_BlueprintBase::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
