#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DungeonArchitectRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DungeonArchitectRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// Class DungeonArchitectRuntime.FlowExecTask
// 0x0030 (0x0058 - 0x0028)
class UFlowExecTask : public UObject
{
public:
	class FString                                 Description;                                       // 0x0028(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NodeVariableName;                                  // 0x0038(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UFlowExecTaskExtender*>          Extenders;                                         // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FlowExecTask">();
	}
	static class UFlowExecTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlowExecTask>();
	}
};
static_assert(alignof(UFlowExecTask) == 0x000008, "Wrong alignment on UFlowExecTask");
static_assert(sizeof(UFlowExecTask) == 0x000058, "Wrong size on UFlowExecTask");
static_assert(offsetof(UFlowExecTask, Description) == 0x000028, "Member 'UFlowExecTask::Description' has a wrong offset!");
static_assert(offsetof(UFlowExecTask, NodeVariableName) == 0x000038, "Member 'UFlowExecTask::NodeVariableName' has a wrong offset!");
static_assert(offsetof(UFlowExecTask, Extenders) == 0x000048, "Member 'UFlowExecTask::Extenders' has a wrong offset!");

// Class DungeonArchitectRuntime.FlowTaskAbstractBase
// 0x0000 (0x0058 - 0x0058)
class UFlowTaskAbstractBase : public UFlowExecTask
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FlowTaskAbstractBase">();
	}
	static class UFlowTaskAbstractBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlowTaskAbstractBase>();
	}
};
static_assert(alignof(UFlowTaskAbstractBase) == 0x000008, "Wrong alignment on UFlowTaskAbstractBase");
static_assert(sizeof(UFlowTaskAbstractBase) == 0x000058, "Wrong size on UFlowTaskAbstractBase");

// Class DungeonArchitectRuntime.Dungeon
// 0x00F8 (0x0320 - 0x0228)
class ADungeon final : public AActor
{
public:
	struct FGuid                                  Uid;                                               // 0x0228(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UDungeonThemeAsset*>             Themes;                                            // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TSubclassOf<class UDungeonBuilder>            BuilderClass;                                      // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UDungeonMarkerEmitter*>          MarkerEmitters;                                    // 0x0250(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, SimpleDisplay, NativeAccessSpecifierPublic)
	TArray<class UDungeonEventListener*>          EventListeners;                                    // 0x0260(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, SimpleDisplay, NativeAccessSpecifierPublic)
	TArray<struct FClusterThemeInfo>              ClusterThemes;                                     // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bDrawDebugData;                                    // 0x0280(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDungeonBuilder*                        Builder;                                           // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDungeonConfig*                         Config;                                            // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDungeonModel*                          DungeonModel;                                      // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDungeonToolData*                       ToolData;                                          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDungeonQuery*                          Query;                                             // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDungeonLevelStreamingConfig           LevelStreamingConfig;                              // 0x02B0(0x0018)(NoDestructor, NativeAccessSpecifierPublic)
	class UDungeonLevelStreamingModel*            LevelStreamingModel;                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BuildPriorityLocation;                             // 0x02D0(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnDungeonBuildComplete;                            // 0x02E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F0[0x30];                                     // 0x02F0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class ADungeon* GetDungeonActor();
	static int32 GetDungeonLevelNumber(const class UObject* SceneObject);

	void BuildDungeon();
	void DestroyDungeon();
	class UDungeonQuery* GetQuery();
	class UDungeonBuilder* SetBuilderClass(TSubclassOf<class UDungeonBuilder> InBuilderClass);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Dungeon">();
	}
	static class ADungeon* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADungeon>();
	}
};
static_assert(alignof(ADungeon) == 0x000008, "Wrong alignment on ADungeon");
static_assert(sizeof(ADungeon) == 0x000320, "Wrong size on ADungeon");
static_assert(offsetof(ADungeon, Uid) == 0x000228, "Member 'ADungeon::Uid' has a wrong offset!");
static_assert(offsetof(ADungeon, Themes) == 0x000238, "Member 'ADungeon::Themes' has a wrong offset!");
static_assert(offsetof(ADungeon, BuilderClass) == 0x000248, "Member 'ADungeon::BuilderClass' has a wrong offset!");
static_assert(offsetof(ADungeon, MarkerEmitters) == 0x000250, "Member 'ADungeon::MarkerEmitters' has a wrong offset!");
static_assert(offsetof(ADungeon, EventListeners) == 0x000260, "Member 'ADungeon::EventListeners' has a wrong offset!");
static_assert(offsetof(ADungeon, ClusterThemes) == 0x000270, "Member 'ADungeon::ClusterThemes' has a wrong offset!");
static_assert(offsetof(ADungeon, bDrawDebugData) == 0x000280, "Member 'ADungeon::bDrawDebugData' has a wrong offset!");
static_assert(offsetof(ADungeon, Builder) == 0x000288, "Member 'ADungeon::Builder' has a wrong offset!");
static_assert(offsetof(ADungeon, Config) == 0x000290, "Member 'ADungeon::Config' has a wrong offset!");
static_assert(offsetof(ADungeon, DungeonModel) == 0x000298, "Member 'ADungeon::DungeonModel' has a wrong offset!");
static_assert(offsetof(ADungeon, ToolData) == 0x0002A0, "Member 'ADungeon::ToolData' has a wrong offset!");
static_assert(offsetof(ADungeon, Query) == 0x0002A8, "Member 'ADungeon::Query' has a wrong offset!");
static_assert(offsetof(ADungeon, LevelStreamingConfig) == 0x0002B0, "Member 'ADungeon::LevelStreamingConfig' has a wrong offset!");
static_assert(offsetof(ADungeon, LevelStreamingModel) == 0x0002C8, "Member 'ADungeon::LevelStreamingModel' has a wrong offset!");
static_assert(offsetof(ADungeon, BuildPriorityLocation) == 0x0002D0, "Member 'ADungeon::BuildPriorityLocation' has a wrong offset!");
static_assert(offsetof(ADungeon, OnDungeonBuildComplete) == 0x0002E0, "Member 'ADungeon::OnDungeonBuildComplete' has a wrong offset!");

// Class DungeonArchitectRuntime.FlowTaskAbstract_CreateKeyLock
// 0x0040 (0x0098 - 0x0058)
class UFlowTaskAbstract_CreateKeyLock : public UFlowTaskAbstractBase
{
public:
	class FString                                 KeyPath;                                           // 0x0058(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LockPath;                                          // 0x0068(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 KeyMarkerName;                                     // 0x0078(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LockMarkerName;                                    // 0x0088(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FlowTaskAbstract_CreateKeyLock">();
	}
	static class UFlowTaskAbstract_CreateKeyLock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlowTaskAbstract_CreateKeyLock>();
	}
};
static_assert(alignof(UFlowTaskAbstract_CreateKeyLock) == 0x000008, "Wrong alignment on UFlowTaskAbstract_CreateKeyLock");
static_assert(sizeof(UFlowTaskAbstract_CreateKeyLock) == 0x000098, "Wrong size on UFlowTaskAbstract_CreateKeyLock");
static_assert(offsetof(UFlowTaskAbstract_CreateKeyLock, KeyPath) == 0x000058, "Member 'UFlowTaskAbstract_CreateKeyLock::KeyPath' has a wrong offset!");
static_assert(offsetof(UFlowTaskAbstract_CreateKeyLock, LockPath) == 0x000068, "Member 'UFlowTaskAbstract_CreateKeyLock::LockPath' has a wrong offset!");
static_assert(offsetof(UFlowTaskAbstract_CreateKeyLock, KeyMarkerName) == 0x000078, "Member 'UFlowTaskAbstract_CreateKeyLock::KeyMarkerName' has a wrong offset!");
static_assert(offsetof(UFlowTaskAbstract_CreateKeyLock, LockMarkerName) == 0x000088, "Member 'UFlowTaskAbstract_CreateKeyLock::LockMarkerName' has a wrong offset!");

// Class DungeonArchitectRuntime.DungeonActorTemplate
// 0x0010 (0x0038 - 0x0028)
class UDungeonActorTemplate final : public UObject
{
public:
	TSubclassOf<class AActor>                     ClassTemplate;                                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ActorTemplate;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DungeonActorTemplate">();
	}
	static class UDungeonActorTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonActorTemplate>();
	}
};
static_assert(alignof(UDungeonActorTemplate) == 0x000008, "Wrong alignment on UDungeonActorTemplate");
static_assert(sizeof(UDungeonActorTemplate) == 0x000038, "Wrong size on UDungeonActorTemplate");
static_assert(offsetof(UDungeonActorTemplate, ClassTemplate) == 0x000028, "Member 'UDungeonActorTemplate::ClassTemplate' has a wrong offset!");
static_assert(offsetof(UDungeonActorTemplate, ActorTemplate) == 0x000030, "Member 'UDungeonActorTemplate::ActorTemplate' has a wrong offset!");

// Class DungeonArchitectRuntime.FlowTaskAbstract_PathBuilderBase
// 0x0000 (0x0058 - 0x0058)
class UFlowTaskAbstract_PathBuilderBase : public UFlowTaskAbstractBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FlowTaskAbstract_PathBuilderBase">();
	}
	static class UFlowTaskAbstract_PathBuilderBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlowTaskAbstract_PathBuilderBase>();
	}
};
static_assert(alignof(UFlowTaskAbstract_PathBuilderBase) == 0x000008, "Wrong alignment on UFlowTaskAbstract_PathBuilderBase");
static_assert(sizeof(UFlowTaskAbstract_PathBuilderBase) == 0x000058, "Wrong size on UFlowTaskAbstract_PathBuilderBase");

// Class DungeonArchitectRuntime.DungeonBPFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UDungeonBPFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool ActorBelongsToDungeon(class ADungeon* Dungeon, class AActor* ActorToCheck);
	static bool DungeonObjectHasAuthority(class UObject* Object);
	static class AActor* SpawnDungeonOwnedActor(class ADungeon* Dungeon, TSubclassOf<class AActor> ActorClass, const struct FTransform& Transform);
	static class ULevelStreamingDynamic* StreamDungeonModuleLevel(class UObject* WorldContextObject, TSoftObjectPtr<class UWorld> Level, int32 InstanceId, const struct FVector& Location, const struct FRotator& Rotation, bool* bOutSuccess);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DungeonBPFunctionLibrary">();
	}
	static class UDungeonBPFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonBPFunctionLibrary>();
	}
};
static_assert(alignof(UDungeonBPFunctionLibrary) == 0x000008, "Wrong alignment on UDungeonBPFunctionLibrary");
static_assert(sizeof(UDungeonBPFunctionLibrary) == 0x000028, "Wrong size on UDungeonBPFunctionLibrary");

// Class DungeonArchitectRuntime.FlowTaskAbstract_CreateMainPath
// 0x0078 (0x00D0 - 0x0058)
class UFlowTaskAbstract_CreateMainPath : public UFlowTaskAbstract_PathBuilderBase
{
public:
	int32                                         PathSize;                                          // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PathName;                                          // 0x0060(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           NodeColor;                                         // 0x0070(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StartMarkerName;                                   // 0x0080(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GoalMarkerName;                                    // 0x0090(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StartNodePathName;                                 // 0x00A0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GoalNodePathName;                                  // 0x00B0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumParallelSearches;                               // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         MaxFramesToProcess;                                // 0x00C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FlowTaskAbstract_CreateMainPath">();
	}
	static class UFlowTaskAbstract_CreateMainPath* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlowTaskAbstract_CreateMainPath>();
	}
};
static_assert(alignof(UFlowTaskAbstract_CreateMainPath) == 0x000008, "Wrong alignment on UFlowTaskAbstract_CreateMainPath");
static_assert(sizeof(UFlowTaskAbstract_CreateMainPath) == 0x0000D0, "Wrong size on UFlowTaskAbstract_CreateMainPath");
static_assert(offsetof(UFlowTaskAbstract_CreateMainPath, PathSize) == 0x000058, "Member 'UFlowTaskAbstract_CreateMainPath::PathSize' has a wrong offset!");
static_assert(offsetof(UFlowTaskAbstract_CreateMainPath, PathName) == 0x000060, "Member 'UFlowTaskAbstract_CreateMainPath::PathName' has a wrong offset!");
static_assert(offsetof(UFlowTaskAbstract_CreateMainPath, NodeColor) == 0x000070, "Member 'UFlowTaskAbstract_CreateMainPath::NodeColor' has a wrong offset!");
static_assert(offsetof(UFlowTaskAbstract_CreateMainPath, StartMarkerName) == 0x000080, "Member 'UFlowTaskAbstract_CreateMainPath::StartMarkerName' has a wrong offset!");
static_assert(offsetof(UFlowTaskAbstract_CreateMainPath, GoalMarkerName) == 0x000090, "Member 'UFlowTaskAbstract_CreateMainPath::GoalMarkerName' has a wrong offset!");
static_assert(offsetof(UFlowTaskAbstract_CreateMainPath, StartNodePathName) == 0x0000A0, "Member 'UFlowTaskAbstract_CreateMainPath::StartNodePathName' has a wrong offset!");
static_assert(offsetof(UFlowTaskAbstract_CreateMainPath, GoalNodePathName) == 0x0000B0, "Member 'UFlowTaskAbstract_CreateMainPath::GoalNodePathName' has a wrong offset!");
static_assert(offsetof(UFlowTaskAbstract_CreateMainPath, NumParallelSearches) == 0x0000C0, "Member 'UFlowTaskAbstract_CreateMainPath::NumParallelSearches' has a wrong offset!");
static_assert(offsetof(UFlowTaskAbstract_CreateMainPath, MaxFramesToProcess) == 0x0000C8, "Member 'UFlowTaskAbstract_CreateMainPath::MaxFramesToProcess' has a wrong offset!");

// Class DungeonArchitectRuntime.DungeonBuilder
// 0x0048 (0x0070 - 0x0028)
class UDungeonBuilder : public UObject
{
public:
	class UDungeonConfig*                         Config;                                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class ADungeon*                               Dungeon;                                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDungeonModel*                          Model;                                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDungeonQuery*                          Query;                                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_58[0x18];                                      // 0x0058(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EmitDungeonMarkers();
	void EmitMarker(const class FString& SocketType, const struct FTransform& Transform);

	TArray<struct FPropSocket> GetMarkers() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DungeonBuilder">();
	}
	static class UDungeonBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonBuilder>();
	}
};
static_assert(alignof(UDungeonBuilder) == 0x000008, "Wrong alignment on UDungeonBuilder");
static_assert(sizeof(UDungeonBuilder) == 0x000070, "Wrong size on UDungeonBuilder");
static_assert(offsetof(UDungeonBuilder, Config) == 0x000028, "Member 'UDungeonBuilder::Config' has a wrong offset!");
static_assert(offsetof(UDungeonBuilder, Dungeon) == 0x000040, "Member 'UDungeonBuilder::Dungeon' has a wrong offset!");
static_assert(offsetof(UDungeonBuilder, Model) == 0x000048, "Member 'UDungeonBuilder::Model' has a wrong offset!");
static_assert(offsetof(UDungeonBuilder, Query) == 0x000050, "Member 'UDungeonBuilder::Query' has a wrong offset!");

// Class DungeonArchitectRuntime.DungeonConfig
// 0x0020 (0x0048 - 0x0028)
class UDungeonConfig : public UObject
{
public:
	class FString                                 OrderCategory;                                     // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Seed;                                              // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Instanced;                                         // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxBuildTimePerFrameMs;                            // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DungeonConfig">();
	}
	static class UDungeonConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonConfig>();
	}
};
static_assert(alignof(UDungeonConfig) == 0x000008, "Wrong alignment on UDungeonConfig");
static_assert(sizeof(UDungeonConfig) == 0x000048, "Wrong size on UDungeonConfig");
static_assert(offsetof(UDungeonConfig, OrderCategory) == 0x000028, "Member 'UDungeonConfig::OrderCategory' has a wrong offset!");
static_assert(offsetof(UDungeonConfig, Seed) == 0x000038, "Member 'UDungeonConfig::Seed' has a wrong offset!");
static_assert(offsetof(UDungeonConfig, Instanced) == 0x00003C, "Member 'UDungeonConfig::Instanced' has a wrong offset!");
static_assert(offsetof(UDungeonConfig, MaxBuildTimePerFrameMs) == 0x000040, "Member 'UDungeonConfig::MaxBuildTimePerFrameMs' has a wrong offset!");

// Class DungeonArchitectRuntime.DungeonDebug
// 0x0008 (0x0230 - 0x0228)
class ADungeonDebug final : public AActor
{
public:
	class AActor*                                 CloneTemplate;                                     // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DungeonDebug">();
	}
	static class ADungeonDebug* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADungeonDebug>();
	}
};
static_assert(alignof(ADungeonDebug) == 0x000008, "Wrong alignment on ADungeonDebug");
static_assert(sizeof(ADungeonDebug) == 0x000230, "Wrong size on ADungeonDebug");
static_assert(offsetof(ADungeonDebug, CloneTemplate) == 0x000228, "Member 'ADungeonDebug::CloneTemplate' has a wrong offset!");

// Class DungeonArchitectRuntime.DungeonEditorViewportProperties
// 0x0030 (0x0058 - 0x0028)
class UDungeonEditorViewportProperties final : public UObject
{
public:
	class UDungeonConfig*                         DungeonConfig;                                     // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UDungeonMarkerEmitter*>          MarkerEmitters;                                    // 0x0030(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, SimpleDisplay, NativeAccessSpecifierPublic)
	TSubclassOf<class UDungeonBuilder>            BuilderClass;                                      // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DungeonEditorViewportProperties">();
	}
	static class UDungeonEditorViewportProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonEditorViewportProperties>();
	}
};
static_assert(alignof(UDungeonEditorViewportProperties) == 0x000008, "Wrong alignment on UDungeonEditorViewportProperties");
static_assert(sizeof(UDungeonEditorViewportProperties) == 0x000058, "Wrong size on UDungeonEditorViewportProperties");
static_assert(offsetof(UDungeonEditorViewportProperties, DungeonConfig) == 0x000028, "Member 'UDungeonEditorViewportProperties::DungeonConfig' has a wrong offset!");
static_assert(offsetof(UDungeonEditorViewportProperties, MarkerEmitters) == 0x000030, "Member 'UDungeonEditorViewportProperties::MarkerEmitters' has a wrong offset!");
static_assert(offsetof(UDungeonEditorViewportProperties, BuilderClass) == 0x000040, "Member 'UDungeonEditorViewportProperties::BuilderClass' has a wrong offset!");

// Class DungeonArchitectRuntime.DungeonEventListener
// 0x0000 (0x0028 - 0x0028)
class UDungeonEventListener : public UObject
{
public:
	void OnDungeonDestroyed(class ADungeon* Dungeon);
	void OnDungeonLayoutBuilt(class ADungeon* Dungeon);
	void OnMarkersEmitted(class ADungeon* Dungeon, TArray<struct FDungeonMarkerInfo>& MarkerList, TArray<struct FDungeonMarkerInfo>* MarkerListRef);
	void OnPostDungeonBuild(class ADungeon* Dungeon);
	void OnPreDungeonBuild(class ADungeon* Dungeon);
	void OnPreDungeonDestroy(class ADungeon* Dungeon);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DungeonEventListener">();
	}
	static class UDungeonEventListener* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonEventListener>();
	}
};
static_assert(alignof(UDungeonEventListener) == 0x000008, "Wrong alignment on UDungeonEventListener");
static_assert(sizeof(UDungeonEventListener) == 0x000028, "Wrong size on UDungeonEventListener");

// Class DungeonArchitectRuntime.DungeonInstancedMeshActor
// 0x0050 (0x0278 - 0x0228)
class ADungeonInstancedMeshActor final : public AActor
{
public:
	uint8                                         Pad_228[0x50];                                     // 0x0228(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DungeonInstancedMeshActor">();
	}
	static class ADungeonInstancedMeshActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADungeonInstancedMeshActor>();
	}
};
static_assert(alignof(ADungeonInstancedMeshActor) == 0x000008, "Wrong alignment on ADungeonInstancedMeshActor");
static_assert(sizeof(ADungeonInstancedMeshActor) == 0x000278, "Wrong size on ADungeonInstancedMeshActor");

// Class DungeonArchitectRuntime.DungeonLandscapeModifier
// 0x0040 (0x0068 - 0x0028)
class UDungeonLandscapeModifier final : public UDungeonEventListener
{
public:
	class ALandscape*                             Landscape;                                         // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeightBlurRadius;                                  // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HeightBlurIterations;                              // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeightBlurWeight;                                  // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PaintBlurRadius;                                   // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PaintBlurIterations;                               // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PaintBlurWeight;                                   // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            PaintBlurWeightCurve;                              // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseHeight;                                        // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULandscapeLayerInfoObject*>      Layers;                                            // 0x0058(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DungeonLandscapeModifier">();
	}
	static class UDungeonLandscapeModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonLandscapeModifier>();
	}
};
static_assert(alignof(UDungeonLandscapeModifier) == 0x000008, "Wrong alignment on UDungeonLandscapeModifier");
static_assert(sizeof(UDungeonLandscapeModifier) == 0x000068, "Wrong size on UDungeonLandscapeModifier");
static_assert(offsetof(UDungeonLandscapeModifier, Landscape) == 0x000028, "Member 'UDungeonLandscapeModifier::Landscape' has a wrong offset!");
static_assert(offsetof(UDungeonLandscapeModifier, HeightBlurRadius) == 0x000030, "Member 'UDungeonLandscapeModifier::HeightBlurRadius' has a wrong offset!");
static_assert(offsetof(UDungeonLandscapeModifier, HeightBlurIterations) == 0x000034, "Member 'UDungeonLandscapeModifier::HeightBlurIterations' has a wrong offset!");
static_assert(offsetof(UDungeonLandscapeModifier, HeightBlurWeight) == 0x000038, "Member 'UDungeonLandscapeModifier::HeightBlurWeight' has a wrong offset!");
static_assert(offsetof(UDungeonLandscapeModifier, PaintBlurRadius) == 0x00003C, "Member 'UDungeonLandscapeModifier::PaintBlurRadius' has a wrong offset!");
static_assert(offsetof(UDungeonLandscapeModifier, PaintBlurIterations) == 0x000040, "Member 'UDungeonLandscapeModifier::PaintBlurIterations' has a wrong offset!");
static_assert(offsetof(UDungeonLandscapeModifier, PaintBlurWeight) == 0x000044, "Member 'UDungeonLandscapeModifier::PaintBlurWeight' has a wrong offset!");
static_assert(offsetof(UDungeonLandscapeModifier, PaintBlurWeightCurve) == 0x000048, "Member 'UDungeonLandscapeModifier::PaintBlurWeightCurve' has a wrong offset!");
static_assert(offsetof(UDungeonLandscapeModifier, BaseHeight) == 0x000050, "Member 'UDungeonLandscapeModifier::BaseHeight' has a wrong offset!");
static_assert(offsetof(UDungeonLandscapeModifier, Layers) == 0x000058, "Member 'UDungeonLandscapeModifier::Layers' has a wrong offset!");

// Class DungeonArchitectRuntime.DungeonStreamingLevel
// 0x0018 (0x0040 - 0x0028)
class UDungeonStreamingLevel : public UObject
{
public:
	class ULevelStreamingDynamic*                 LevelStreaming;                                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPackage*                               LevelPackage;                                      // 0x0030(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleChunkHidden();
	void HandleChunkLoaded();
	void HandleChunkUnloaded();
	void HandleChunkVisible();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DungeonStreamingLevel">();
	}
	static class UDungeonStreamingLevel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonStreamingLevel>();
	}
};
static_assert(alignof(UDungeonStreamingLevel) == 0x000008, "Wrong alignment on UDungeonStreamingLevel");
static_assert(sizeof(UDungeonStreamingLevel) == 0x000040, "Wrong size on UDungeonStreamingLevel");
static_assert(offsetof(UDungeonStreamingLevel, LevelStreaming) == 0x000028, "Member 'UDungeonStreamingLevel::LevelStreaming' has a wrong offset!");
static_assert(offsetof(UDungeonStreamingLevel, LevelPackage) == 0x000030, "Member 'UDungeonStreamingLevel::LevelPackage' has a wrong offset!");

// Class DungeonArchitectRuntime.DungeonLogicStreamingLevel
// 0x0000 (0x0040 - 0x0040)
class UDungeonLogicStreamingLevel final : public UDungeonStreamingLevel
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DungeonLogicStreamingLevel">();
	}
	static class UDungeonLogicStreamingLevel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonLogicStreamingLevel>();
	}
};
static_assert(alignof(UDungeonLogicStreamingLevel) == 0x000008, "Wrong alignment on UDungeonLogicStreamingLevel");
static_assert(sizeof(UDungeonLogicStreamingLevel) == 0x000040, "Wrong size on UDungeonLogicStreamingLevel");

// Class DungeonArchitectRuntime.DungeonStreamingChunk
// 0x00D0 (0x00F8 - 0x0028)
class UDungeonStreamingChunk : public UObject
{
public:
	int32                                         OrderNum;                                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Category;                                          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ID;                                                // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   Bounds;                                            // 0x0050(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class UDungeonStreamingChunk*>           Neighbors;                                         // 0x0070(0x0050)(NativeAccessSpecifierPublic)
	bool                                          bSpawnRoomChunk;                                   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x17];                                      // 0x00C1(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	class UDungeonStreamingLevel*                 ArtLevel;                                          // 0x00D8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDungeonLogicStreamingLevel*            LogicLevel;                                        // 0x00E0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E8[0x10];                                      // 0x00E8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetAllActorsOfClass(class UClass* InClass, TArray<class AActor*>* OutActors);
	void HandleChunkHidden();
	void HandleChunkLoaded();
	void HandleChunkUnloaded();
	void HandleChunkVisible();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DungeonStreamingChunk">();
	}
	static class UDungeonStreamingChunk* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonStreamingChunk>();
	}
};
static_assert(alignof(UDungeonStreamingChunk) == 0x000008, "Wrong alignment on UDungeonStreamingChunk");
static_assert(sizeof(UDungeonStreamingChunk) == 0x0000F8, "Wrong size on UDungeonStreamingChunk");
static_assert(offsetof(UDungeonStreamingChunk, OrderNum) == 0x000028, "Member 'UDungeonStreamingChunk::OrderNum' has a wrong offset!");
static_assert(offsetof(UDungeonStreamingChunk, Category) == 0x000030, "Member 'UDungeonStreamingChunk::Category' has a wrong offset!");
static_assert(offsetof(UDungeonStreamingChunk, ID) == 0x000040, "Member 'UDungeonStreamingChunk::ID' has a wrong offset!");
static_assert(offsetof(UDungeonStreamingChunk, Bounds) == 0x000050, "Member 'UDungeonStreamingChunk::Bounds' has a wrong offset!");
static_assert(offsetof(UDungeonStreamingChunk, Neighbors) == 0x000070, "Member 'UDungeonStreamingChunk::Neighbors' has a wrong offset!");
static_assert(offsetof(UDungeonStreamingChunk, bSpawnRoomChunk) == 0x0000C0, "Member 'UDungeonStreamingChunk::bSpawnRoomChunk' has a wrong offset!");
static_assert(offsetof(UDungeonStreamingChunk, ArtLevel) == 0x0000D8, "Member 'UDungeonStreamingChunk::ArtLevel' has a wrong offset!");
static_assert(offsetof(UDungeonStreamingChunk, LogicLevel) == 0x0000E0, "Member 'UDungeonStreamingChunk::LogicLevel' has a wrong offset!");

// Class DungeonArchitectRuntime.DungeonLevelStreamingModel
// 0x0090 (0x0140 - 0x00B0)
class UDungeonLevelStreamingModel final : public UActorComponent
{
public:
	TArray<class UDungeonStreamingChunk*>         Chunks;                                            // 0x00B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UDungeonLevelStreamingNavigation*       StreamingNavigation;                               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnInitialChunksLoaded;                             // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnChunkVisible;                                    // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnChunkUnload;                                     // 0x00E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnNewCorridor;                                     // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         StartRoomId;                                       // 0x0108(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10C[0x24];                                     // 0x010C(0x0024)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDungeonStreamingChunkParamRep> ChunkParamsToClient;                               // 0x0130(0x0010)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPrivate)

public:
	void OnRep_ChunkParamsToClient();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DungeonLevelStreamingModel">();
	}
	static class UDungeonLevelStreamingModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonLevelStreamingModel>();
	}
};
static_assert(alignof(UDungeonLevelStreamingModel) == 0x000008, "Wrong alignment on UDungeonLevelStreamingModel");
static_assert(sizeof(UDungeonLevelStreamingModel) == 0x000140, "Wrong size on UDungeonLevelStreamingModel");
static_assert(offsetof(UDungeonLevelStreamingModel, Chunks) == 0x0000B0, "Member 'UDungeonLevelStreamingModel::Chunks' has a wrong offset!");
static_assert(offsetof(UDungeonLevelStreamingModel, StreamingNavigation) == 0x0000C0, "Member 'UDungeonLevelStreamingModel::StreamingNavigation' has a wrong offset!");
static_assert(offsetof(UDungeonLevelStreamingModel, OnInitialChunksLoaded) == 0x0000C8, "Member 'UDungeonLevelStreamingModel::OnInitialChunksLoaded' has a wrong offset!");
static_assert(offsetof(UDungeonLevelStreamingModel, OnChunkVisible) == 0x0000D8, "Member 'UDungeonLevelStreamingModel::OnChunkVisible' has a wrong offset!");
static_assert(offsetof(UDungeonLevelStreamingModel, OnChunkUnload) == 0x0000E8, "Member 'UDungeonLevelStreamingModel::OnChunkUnload' has a wrong offset!");
static_assert(offsetof(UDungeonLevelStreamingModel, OnNewCorridor) == 0x0000F8, "Member 'UDungeonLevelStreamingModel::OnNewCorridor' has a wrong offset!");
static_assert(offsetof(UDungeonLevelStreamingModel, StartRoomId) == 0x000108, "Member 'UDungeonLevelStreamingModel::StartRoomId' has a wrong offset!");
static_assert(offsetof(UDungeonLevelStreamingModel, ChunkParamsToClient) == 0x000130, "Member 'UDungeonLevelStreamingModel::ChunkParamsToClient' has a wrong offset!");

// Class DungeonArchitectRuntime.DungeonLevelStreamingNavigation
// 0x0010 (0x0038 - 0x0028)
class UDungeonLevelStreamingNavigation final : public UObject
{
public:
	bool                                          bEnabled;                                          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoResizeNavVolume;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0xE];                                       // 0x002A(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DungeonLevelStreamingNavigation">();
	}
	static class UDungeonLevelStreamingNavigation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonLevelStreamingNavigation>();
	}
};
static_assert(alignof(UDungeonLevelStreamingNavigation) == 0x000008, "Wrong alignment on UDungeonLevelStreamingNavigation");
static_assert(sizeof(UDungeonLevelStreamingNavigation) == 0x000038, "Wrong size on UDungeonLevelStreamingNavigation");
static_assert(offsetof(UDungeonLevelStreamingNavigation, bEnabled) == 0x000028, "Member 'UDungeonLevelStreamingNavigation::bEnabled' has a wrong offset!");
static_assert(offsetof(UDungeonLevelStreamingNavigation, bAutoResizeNavVolume) == 0x000029, "Member 'UDungeonLevelStreamingNavigation::bAutoResizeNavVolume' has a wrong offset!");

// Class DungeonArchitectRuntime.DungeonMarkerEmitter
// 0x0000 (0x0028 - 0x0028)
class UDungeonMarkerEmitter final : public UObject
{
public:
	void EmitMarkers(class UDungeonBuilder* Builder, class UDungeonModel* Model, class UDungeonConfig* Config, class UDungeonQuery* Query);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DungeonMarkerEmitter">();
	}
	static class UDungeonMarkerEmitter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonMarkerEmitter>();
	}
};
static_assert(alignof(UDungeonMarkerEmitter) == 0x000008, "Wrong alignment on UDungeonMarkerEmitter");
static_assert(sizeof(UDungeonMarkerEmitter) == 0x000028, "Wrong size on UDungeonMarkerEmitter");

// Class DungeonArchitectRuntime.DungeonVolume
// 0x0010 (0x0270 - 0x0260)
class ADungeonVolume : public AVolume
{
public:
	class ADungeon*                               Dungeon;                                           // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RealtimeUpdate;                                    // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DungeonVolume">();
	}
	static class ADungeonVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADungeonVolume>();
	}
};
static_assert(alignof(ADungeonVolume) == 0x000008, "Wrong alignment on ADungeonVolume");
static_assert(sizeof(ADungeonVolume) == 0x000270, "Wrong size on ADungeonVolume");
static_assert(offsetof(ADungeonVolume, Dungeon) == 0x000260, "Member 'ADungeonVolume::Dungeon' has a wrong offset!");
static_assert(offsetof(ADungeonVolume, RealtimeUpdate) == 0x000268, "Member 'ADungeonVolume::RealtimeUpdate' has a wrong offset!");

// Class DungeonArchitectRuntime.DungeonMarkerReplaceVolume
// 0x0010 (0x0280 - 0x0270)
class ADungeonMarkerReplaceVolume final : public ADungeonVolume
{
public:
	TArray<struct FMarkerReplaceEntry>            Replacements;                                      // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DungeonMarkerReplaceVolume">();
	}
	static class ADungeonMarkerReplaceVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADungeonMarkerReplaceVolume>();
	}
};
static_assert(alignof(ADungeonMarkerReplaceVolume) == 0x000008, "Wrong alignment on ADungeonMarkerReplaceVolume");
static_assert(sizeof(ADungeonMarkerReplaceVolume) == 0x000280, "Wrong size on ADungeonMarkerReplaceVolume");
static_assert(offsetof(ADungeonMarkerReplaceVolume, Replacements) == 0x000270, "Member 'ADungeonMarkerReplaceVolume::Replacements' has a wrong offset!");

// Class DungeonArchitectRuntime.DungeonMesh
// 0x0028 (0x0050 - 0x0028)
class UDungeonMesh final : public UObject
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMaterialOverride>              MaterialOverrides;                                 // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint32                                        HashCode;                                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   Template;                                          // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DungeonMesh">();
	}
	static class UDungeonMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonMesh>();
	}
};
static_assert(alignof(UDungeonMesh) == 0x000008, "Wrong alignment on UDungeonMesh");
static_assert(sizeof(UDungeonMesh) == 0x000050, "Wrong size on UDungeonMesh");
static_assert(offsetof(UDungeonMesh, StaticMesh) == 0x000028, "Member 'UDungeonMesh::StaticMesh' has a wrong offset!");
static_assert(offsetof(UDungeonMesh, MaterialOverrides) == 0x000030, "Member 'UDungeonMesh::MaterialOverrides' has a wrong offset!");
static_assert(offsetof(UDungeonMesh, HashCode) == 0x000040, "Member 'UDungeonMesh::HashCode' has a wrong offset!");
static_assert(offsetof(UDungeonMesh, Template) == 0x000048, "Member 'UDungeonMesh::Template' has a wrong offset!");

// Class DungeonArchitectRuntime.DungeonMiniMap
// 0x00B8 (0x02E0 - 0x0228)
class ADungeonMiniMap : public AActor
{
public:
	int32                                         TextureSize;                                       // 0x0228(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutlineThickness;                                  // 0x022C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DoorThickness;                                     // 0x0230(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDungeonMiniMapOverlayIcon>     OverlayIcons;                                      // 0x0238(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     MaterialTemplate;                                  // 0x0248(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDungeonMiniMapOverlayTracking> DynamicTracking;                                   // 0x0250(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         BlurRadius;                                        // 0x0260(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BlurIterations;                                    // 0x0264(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableFogOfWar;                                   // 0x0268(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FogOfWarTextureScale;                              // 0x026C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FogOfWarTrackingItem;                              // 0x0270(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             FogOfWarExploreTexture;                            // 0x0278(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogOfWarVisiblityDistance;                         // 0x0280(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               MaskTexture;                                       // 0x0288(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 StaticOverlayTexture;                              // 0x0290(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 DynamicOverlayTexture;                             // 0x0298(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 FogOfWarTexture;                                   // 0x02A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             WorldToScreen;                                     // 0x02B0(0x0030)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	void BuildLayout(class UDungeonModel* DungeonModel, class UDungeonConfig* DungeonConfig);
	class UMaterialInterface* CreateMaterialInstance();
	class UMaterialInterface* CreateMaterialInstanceFromTemplate(class UMaterialInterface* InMaterialTemplate);
	void UpdateMaterial(class UMaterialInterface* InMaterial);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DungeonMiniMap">();
	}
	static class ADungeonMiniMap* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADungeonMiniMap>();
	}
};
static_assert(alignof(ADungeonMiniMap) == 0x000010, "Wrong alignment on ADungeonMiniMap");
static_assert(sizeof(ADungeonMiniMap) == 0x0002E0, "Wrong size on ADungeonMiniMap");
static_assert(offsetof(ADungeonMiniMap, TextureSize) == 0x000228, "Member 'ADungeonMiniMap::TextureSize' has a wrong offset!");
static_assert(offsetof(ADungeonMiniMap, OutlineThickness) == 0x00022C, "Member 'ADungeonMiniMap::OutlineThickness' has a wrong offset!");
static_assert(offsetof(ADungeonMiniMap, DoorThickness) == 0x000230, "Member 'ADungeonMiniMap::DoorThickness' has a wrong offset!");
static_assert(offsetof(ADungeonMiniMap, OverlayIcons) == 0x000238, "Member 'ADungeonMiniMap::OverlayIcons' has a wrong offset!");
static_assert(offsetof(ADungeonMiniMap, MaterialTemplate) == 0x000248, "Member 'ADungeonMiniMap::MaterialTemplate' has a wrong offset!");
static_assert(offsetof(ADungeonMiniMap, DynamicTracking) == 0x000250, "Member 'ADungeonMiniMap::DynamicTracking' has a wrong offset!");
static_assert(offsetof(ADungeonMiniMap, BlurRadius) == 0x000260, "Member 'ADungeonMiniMap::BlurRadius' has a wrong offset!");
static_assert(offsetof(ADungeonMiniMap, BlurIterations) == 0x000264, "Member 'ADungeonMiniMap::BlurIterations' has a wrong offset!");
static_assert(offsetof(ADungeonMiniMap, bEnableFogOfWar) == 0x000268, "Member 'ADungeonMiniMap::bEnableFogOfWar' has a wrong offset!");
static_assert(offsetof(ADungeonMiniMap, FogOfWarTextureScale) == 0x00026C, "Member 'ADungeonMiniMap::FogOfWarTextureScale' has a wrong offset!");
static_assert(offsetof(ADungeonMiniMap, FogOfWarTrackingItem) == 0x000270, "Member 'ADungeonMiniMap::FogOfWarTrackingItem' has a wrong offset!");
static_assert(offsetof(ADungeonMiniMap, FogOfWarExploreTexture) == 0x000278, "Member 'ADungeonMiniMap::FogOfWarExploreTexture' has a wrong offset!");
static_assert(offsetof(ADungeonMiniMap, FogOfWarVisiblityDistance) == 0x000280, "Member 'ADungeonMiniMap::FogOfWarVisiblityDistance' has a wrong offset!");
static_assert(offsetof(ADungeonMiniMap, MaskTexture) == 0x000288, "Member 'ADungeonMiniMap::MaskTexture' has a wrong offset!");
static_assert(offsetof(ADungeonMiniMap, StaticOverlayTexture) == 0x000290, "Member 'ADungeonMiniMap::StaticOverlayTexture' has a wrong offset!");
static_assert(offsetof(ADungeonMiniMap, DynamicOverlayTexture) == 0x000298, "Member 'ADungeonMiniMap::DynamicOverlayTexture' has a wrong offset!");
static_assert(offsetof(ADungeonMiniMap, FogOfWarTexture) == 0x0002A0, "Member 'ADungeonMiniMap::FogOfWarTexture' has a wrong offset!");
static_assert(offsetof(ADungeonMiniMap, WorldToScreen) == 0x0002B0, "Member 'ADungeonMiniMap::WorldToScreen' has a wrong offset!");

// Class DungeonArchitectRuntime.DungeonMiniMapTrackedObject
// 0x0018 (0x00C8 - 0x00B0)
class UDungeonMiniMapTrackedObject final : public UActorComponent
{
public:
	class FName                                   ID;                                                // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   IconName;                                          // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOrientToRotation;                                 // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DungeonMiniMapTrackedObject">();
	}
	static class UDungeonMiniMapTrackedObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonMiniMapTrackedObject>();
	}
};
static_assert(alignof(UDungeonMiniMapTrackedObject) == 0x000008, "Wrong alignment on UDungeonMiniMapTrackedObject");
static_assert(sizeof(UDungeonMiniMapTrackedObject) == 0x0000C8, "Wrong size on UDungeonMiniMapTrackedObject");
static_assert(offsetof(UDungeonMiniMapTrackedObject, ID) == 0x0000B0, "Member 'UDungeonMiniMapTrackedObject::ID' has a wrong offset!");
static_assert(offsetof(UDungeonMiniMapTrackedObject, IconName) == 0x0000B8, "Member 'UDungeonMiniMapTrackedObject::IconName' has a wrong offset!");
static_assert(offsetof(UDungeonMiniMapTrackedObject, bOrientToRotation) == 0x0000C0, "Member 'UDungeonMiniMapTrackedObject::bOrientToRotation' has a wrong offset!");

// Class DungeonArchitectRuntime.DungeonMirrorVolume
// 0x0000 (0x0270 - 0x0270)
class ADungeonMirrorVolume final : public ADungeonVolume
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DungeonMirrorVolume">();
	}
	static class ADungeonMirrorVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADungeonMirrorVolume>();
	}
};
static_assert(alignof(ADungeonMirrorVolume) == 0x000008, "Wrong alignment on ADungeonMirrorVolume");
static_assert(sizeof(ADungeonMirrorVolume) == 0x000270, "Wrong size on ADungeonMirrorVolume");

// Class DungeonArchitectRuntime.DungeonModel
// 0x0000 (0x0028 - 0x0028)
class UDungeonModel : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DungeonModel">();
	}
	static class UDungeonModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonModel>();
	}
};
static_assert(alignof(UDungeonModel) == 0x000008, "Wrong alignment on UDungeonModel");
static_assert(sizeof(UDungeonModel) == 0x000028, "Wrong size on UDungeonModel");

// Class DungeonArchitectRuntime.DungeonModelHelper
// 0x0000 (0x0028 - 0x0028)
class UDungeonModelHelper : public UObject
{
public:
	static void ExpandBounds(const struct FRectangle& Bounds, int32 Size, struct FRectangle* Result);
