#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DungeonArchitectRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum DungeonArchitectRuntime.EDungeonLevelStreamChunkSelection
// NumValues: 0x0003
enum class EDungeonLevelStreamChunkSelection : uint8
{
	PlayerLocations                          = 0,
	SpawnRoomLocations                       = 1,
	EDungeonLevelStreamChunkSelection_MAX    = 2,
};

// Enum DungeonArchitectRuntime.EDungeonLevelStreamUnloadMethod
// NumValues: 0x0003
enum class EDungeonLevelStreamUnloadMethod : uint8
{
	KeepHiddenChunksInMemory                 = 0,
	UnloadHiddenChunks                       = 1,
	EDungeonLevelStreamUnloadMethod_MAX      = 2,
};

// Enum DungeonArchitectRuntime.EDungeonLevelStreamLoadMethod
// NumValues: 0x0003
enum class EDungeonLevelStreamLoadMethod : uint8
{
	LoadOnDemand                             = 0,
	LoadEverythingInMemory                   = 1,
	EDungeonLevelStreamLoadMethod_MAX        = 2,
};

// Enum DungeonArchitectRuntime.EDungeonLevelStreamingStrategy
// NumValues: 0x0003
enum class EDungeonLevelStreamingStrategy : uint8
{
	LayoutDepth                              = 0,
	Distance                                 = 1,
	EDungeonLevelStreamingStrategy_MAX       = 2,
};

// Enum DungeonArchitectRuntime.EDungeonLevelStreamingLoadingStrategy
// NumValues: 0x0004
enum class EDungeonLevelStreamingLoadingStrategy : uint8
{
	PreloadEverything                        = 0,
	LoadOnDemand                             = 1,
	OnlyVisibleLoaded                        = 2,
	EDungeonLevelStreamingLoadingStrategy_MAX = 3,
};

// Enum DungeonArchitectRuntime.EDungeonMiniMapIconCoordinateSystem
// NumValues: 0x0003
enum class EDungeonMiniMapIconCoordinateSystem : uint8
{
	Pixels                                   = 0,
	WorldCoordinates                         = 1,
	EDungeonMiniMapIconCoordinateSystem_MAX  = 2,
};

// Enum DungeonArchitectRuntime.EFlowGraphItemType
// NumValues: 0x0009
enum class EFlowGraphItemType : uint8
{
	Enemy                                    = 0,
	Entrance                                 = 1,
	Exit                                     = 2,
	Treasure                                 = 3,
	Key                                      = 4,
	Lock                                     = 5,
	Teleporter                               = 6,
	Custom                                   = 7,
	EFlowGraphItemType_MAX                   = 8,
};

// Enum DungeonArchitectRuntime.EFlowAbstractLinkType
// NumValues: 0x0004
enum class EFlowAbstractLinkType : uint8
{
	Unconnected                              = 0,
	Connected                                = 1,
	OneWay                                   = 2,
	EFlowAbstractLinkType_MAX                = 3,
};

// Enum DungeonArchitectRuntime.EridFlowTask_SpawnItemsMethod
// NumValues: 0x0003
enum class EridFlowTask_SpawnItemsMethod : uint8
{
	RandomRange                              = 0,
	LinearDifficulty                         = 1,
	EridFlowTask_MAX                         = 2,
};

// Enum DungeonArchitectRuntime.ERuleNodeExecutionMode
// NumValues: 0x0005
enum class ERuleNodeExecutionMode : uint8
{
	RunOnce                                  = 0,
	RunWithProbability                       = 1,
	Iterate                                  = 2,
	IterateRange                             = 3,
	ERuleNodeExecutionMode_MAX               = 4,
};

// Enum DungeonArchitectRuntime.EGridDungeonWallType
// NumValues: 0x0003
enum class EGridDungeonWallType : uint8
{
	WallsAsEdges                             = 0,
	WallsAsTileBlocks                        = 1,
	EGridDungeonWallType_MAX                 = 2,
};

// Enum DungeonArchitectRuntime.FCellType
// NumValues: 0x0005
enum class EFCellType : uint8
{
	Room                                     = 0,
	Corridor                                 = 1,
	CorridorPadding                          = 2,
	Unknown                                  = 3,
	FCellType_MAX                            = 4,
};

// Enum DungeonArchitectRuntime.DungeonModelBuildState
// NumValues: 0x0007
enum class EDungeonModelBuildState : uint8
{
	Initial                                  = 0,
	Separation                               = 1,
	Triangulation                            = 2,
	SpanningTree                             = 3,
	Corridors                                = 4,
	Complete                                 = 5,
	DungeonModelBuildState_MAX               = 6,
};

// Enum DungeonArchitectRuntime.EGridPaintToolCellType
// NumValues: 0x0003
enum class EGridPaintToolCellType : uint8
{
	Corridor                                 = 0,
	Room                                     = 1,
	EGridPaintToolCellType_MAX               = 2,
};

// Enum DungeonArchitectRuntime.EGridFlowTilemapWallGenerationMethod
// NumValues: 0x0003
enum class EGridFlowTilemapWallGenerationMethod : uint8
{
	WallAsTiles                              = 0,
	WallAsEdges                              = 1,
	EGridFlowTilemapWallGenerationMethod_MAX = 2,
};

// Enum DungeonArchitectRuntime.EGridFlowAbstractNodeRoomType
// NumValues: 0x0005
enum class EGridFlowAbstractNodeRoomType : uint8
{
	Unknown                                  = 0,
	Room                                     = 1,
	Corridor                                 = 2,
	Cave                                     = 3,
	EGridFlowAbstractNodeRoomType_MAX        = 4,
};

// Enum DungeonArchitectRuntime.EGridFlowTilemapCellOverlayMergeWallOverlayRule
// NumValues: 0x0004
enum class EGridFlowTilemapCellOverlayMergeWallOverlayRule : uint8
{
	KeepWallAndOverlay                       = 0,
	KeepWallRemoveOverlay                    = 1,
	KeepOverlayRemoveWall                    = 2,
	EGridFlowTilemapCellOverlayMergeWallOverlayRule_MAX = 3,
};

// Enum DungeonArchitectRuntime.EGridFlowTilemapCellCategory
// NumValues: 0x0004
enum class EGridFlowTilemapCellCategory : uint8
{
	Layout                                   = 0,
	Biome                                    = 1,
	Elevation                                = 2,
	EGridFlowTilemapCellCategory_MAX         = 3,
};

// Enum DungeonArchitectRuntime.EGridFlowTilemapEdgeType
// NumValues: 0x0005
enum class EGridFlowTilemapEdgeType : uint8
{
	Empty                                    = 0,
	Wall                                     = 1,
	Fence                                    = 2,
	Door                                     = 3,
	EGridFlowTilemapEdgeType_MAX             = 4,
};

// Enum DungeonArchitectRuntime.EGridFlowTilemapCellType
// NumValues: 0x0006
enum class EGridFlowTilemapCellType : uint8
{
	Empty                                    = 0,
	Floor                                    = 1,
	Wall                                     = 2,
	Door                                     = 3,
	Custom                                   = 4,
	EGridFlowTilemapCellType_MAX             = 5,
};

// Enum DungeonArchitectRuntime.EGridSpatialCellOccupation
// NumValues: 0x0004
enum class EGridSpatialCellOccupation : uint8
{
	DontCare                                 = 0,
	Occupied                                 = 1,
	Empty                                    = 2,
	EGridSpatialCellOccupation_MAX           = 3,
};

// Enum DungeonArchitectRuntime.EIsaacRoomTileType
// NumValues: 0x0004
enum class EIsaacRoomTileType : uint8
{
	Floor                                    = 0,
	Door                                     = 1,
	Empty                                    = 2,
	EIsaacRoomTileType_MAX                   = 3,
};

// Enum DungeonArchitectRuntime.EIsaacRoomType
// NumValues: 0x0006
enum class EIsaacRoomType : uint8
{
	Normal                                   = 0,
	Spawn                                    = 1,
	Treasure                                 = 2,
	Boss                                     = 4,
	Exit                                     = 8,
	EIsaacRoomType_MAX                       = 9,
};

// Enum DungeonArchitectRuntime.ESimpleCityCellType
// NumValues: 0x0006
enum class ESimpleCityCellType : uint8
{
	Road                                     = 0,
	House                                    = 1,
	Park                                     = 2,
	UserDefined                              = 3,
	Empty                                    = 4,
	ESimpleCityCellType_MAX                  = 5,
};

// Enum DungeonArchitectRuntime.ESimpleCitySpatialCellOccupation
// NumValues: 0x0006
enum class ESimpleCitySpatialCellOccupation : uint8
{
	Ignore                                   = 0,
	Road                                     = 1,
	House                                    = 2,
	Park                                     = 3,
	Outskirts                                = 4,
	ESimpleCitySpatialCellOccupation_MAX     = 5,
};

// Enum DungeonArchitectRuntime.ESnapConnectionConstraint
// NumValues: 0x0004
enum class ESnapConnectionConstraint : uint8
{
	Magnet                                   = 0,
	PlugMale                                 = 1,
	PlugFemale                               = 2,
	ESnapConnectionConstraint_MAX            = 3,
};

// Enum DungeonArchitectRuntime.ESnapConnectionDoorType
// NumValues: 0x0008
enum class ESnapConnectionDoorType : uint8
{
	NotApplicable                            = 0,
	NormalDoor                               = 1,
	OneWayDoor                               = 2,
	OneWayDoorUp                             = 3,
	OneWayDoorDown                           = 4,
	LockedDoor                               = 5,
	CustomDoor                               = 6,
	ESnapConnectionDoorType_MAX              = 7,
};

// Enum DungeonArchitectRuntime.ESnapConnectionState
// NumValues: 0x0004
enum class ESnapConnectionState : uint8
{
	Unknown                                  = 0,
	Door                                     = 1,
	Wall                                     = 2,
	ESnapConnectionState_MAX                 = 3,
};

// Enum DungeonArchitectRuntime.ESnapFlowAGTaskModuleCategoryOverrideMethod
// NumValues: 0x0004
enum class ESnapFlowAGTaskModuleCategoryOverrideMethod : uint8
{
	None                                     = 0,
	StartEnd                                 = 1,
	Blueprint                                = 2,
	ESnapFlowAGTaskModuleCategoryOverrideMethod_MAX = 3,
};

// ScriptStruct DungeonArchitectRuntime.DungeonMiniMapOverlayIcon
// 0x0030 (0x0030 - 0x0000)
struct FDungeonMiniMapOverlayIcon final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             Icon;                                              // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScreenSize;                                        // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDungeonMiniMapIconCoordinateSystem           ScreenSizeType;                                    // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Tint;                                              // 0x0018(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Rotation;                                          // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDungeonMiniMapOverlayIcon) == 0x000008, "Wrong alignment on FDungeonMiniMapOverlayIcon");
static_assert(sizeof(FDungeonMiniMapOverlayIcon) == 0x000030, "Wrong size on FDungeonMiniMapOverlayIcon");
static_assert(offsetof(FDungeonMiniMapOverlayIcon, Name) == 0x000000, "Member 'FDungeonMiniMapOverlayIcon::Name' has a wrong offset!");
static_assert(offsetof(FDungeonMiniMapOverlayIcon, Icon) == 0x000008, "Member 'FDungeonMiniMapOverlayIcon::Icon' has a wrong offset!");
static_assert(offsetof(FDungeonMiniMapOverlayIcon, ScreenSize) == 0x000010, "Member 'FDungeonMiniMapOverlayIcon::ScreenSize' has a wrong offset!");
static_assert(offsetof(FDungeonMiniMapOverlayIcon, ScreenSizeType) == 0x000014, "Member 'FDungeonMiniMapOverlayIcon::ScreenSizeType' has a wrong offset!");
static_assert(offsetof(FDungeonMiniMapOverlayIcon, Tint) == 0x000018, "Member 'FDungeonMiniMapOverlayIcon::Tint' has a wrong offset!");
static_assert(offsetof(FDungeonMiniMapOverlayIcon, Rotation) == 0x000028, "Member 'FDungeonMiniMapOverlayIcon::Rotation' has a wrong offset!");

// ScriptStruct DungeonArchitectRuntime.SnapConnectionInstance
// 0x0090 (0x0090 - 0x0000)
struct FSnapConnectionInstance final
{
public:
	struct FGuid                                  ModuleA;                                           // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  DoorA;                                             // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ModuleB;                                           // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  DoorB;                                             // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             WorldTransform;                                    // 0x0040(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bHasSpawnedDoorActor;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReverse;                                          // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class AActor>>          SpawnedDoorActors;                                 // 0x0078(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSnapConnectionInstance) == 0x000010, "Wrong alignment on FSnapConnectionInstance");
static_assert(sizeof(FSnapConnectionInstance) == 0x000090, "Wrong size on FSnapConnectionInstance");
static_assert(offsetof(FSnapConnectionInstance, ModuleA) == 0x000000, "Member 'FSnapConnectionInstance::ModuleA' has a wrong offset!");
static_assert(offsetof(FSnapConnectionInstance, DoorA) == 0x000010, "Member 'FSnapConnectionInstance::DoorA' has a wrong offset!");
static_assert(offsetof(FSnapConnectionInstance, ModuleB) == 0x000020, "Member 'FSnapConnectionInstance::ModuleB' has a wrong offset!");
static_assert(offsetof(FSnapConnectionInstance, DoorB) == 0x000030, "Member 'FSnapConnectionInstance::DoorB' has a wrong offset!");
static_assert(offsetof(FSnapConnectionInstance, WorldTransform) == 0x000040, "Member 'FSnapConnectionInstance::WorldTransform' has a wrong offset!");
static_assert(offsetof(FSnapConnectionInstance, bHasSpawnedDoorActor) == 0x000070, "Member 'FSnapConnectionInstance::bHasSpawnedDoorActor' has a wrong offset!");
static_assert(offsetof(FSnapConnectionInstance, bReverse) == 0x000071, "Member 'FSnapConnectionInstance::bReverse' has a wrong offset!");
static_assert(offsetof(FSnapConnectionInstance, SpawnedDoorActors) == 0x000078, "Member 'FSnapConnectionInstance::SpawnedDoorActors' has a wrong offset!");

// ScriptStruct DungeonArchitectRuntime.DungeonSchemaAction_NewNode
// 0x0008 (0x0108 - 0x0100)
struct FDungeonSchemaAction_NewNode final : public FEdGraphSchemaAction
{
public:
	class UEdGraphNode*                           NodeTemplate;                                      // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDungeonSchemaAction_NewNode) == 0x000008, "Wrong alignment on FDungeonSchemaAction_NewNode");
static_assert(sizeof(FDungeonSchemaAction_NewNode) == 0x000108, "Wrong size on FDungeonSchemaAction_NewNode");
static_assert(offsetof(FDungeonSchemaAction_NewNode, NodeTemplate) == 0x000100, "Member 'FDungeonSchemaAction_NewNode::NodeTemplate' has a wrong offset!");

// ScriptStruct DungeonArchitectRuntime.DungeonLevelStreamingConfig
// 0x0018 (0x0018 - 0x0000)
struct FDungeonLevelStreamingConfig final
{
public:
	bool                                          bEnabledLevelStreaming;                            // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDungeonLevelStreamChunkSelection             InitialLoadLocation;                               // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDungeonLevelStreamingStrategy                StreamingStrategy;                                 // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VisibilityRoomDepth;                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                VisibilityDistance;                                // 0x0008(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDungeonLevelStreamLoadMethod                 LoadMethod;                                        // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDungeonLevelStreamUnloadMethod               UnloadMethod;                                      // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProcessStreamingNavigation;                       // 0x0016(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDungeonLevelStreamingConfig) == 0x000004, "Wrong alignment on FDungeonLevelStreamingConfig");
static_assert(sizeof(FDungeonLevelStreamingConfig) == 0x000018, "Wrong size on FDungeonLevelStreamingConfig");
static_assert(offsetof(FDungeonLevelStreamingConfig, bEnabledLevelStreaming) == 0x000000, "Member 'FDungeonLevelStreamingConfig::bEnabledLevelStreaming' has a wrong offset!");
static_assert(offsetof(FDungeonLevelStreamingConfig, InitialLoadLocation) == 0x000001, "Member 'FDungeonLevelStreamingConfig::InitialLoadLocation' has a wrong offset!");
static_assert(offsetof(FDungeonLevelStreamingConfig, StreamingStrategy) == 0x000002, "Member 'FDungeonLevelStreamingConfig::StreamingStrategy' has a wrong offset!");
static_assert(offsetof(FDungeonLevelStreamingConfig, VisibilityRoomDepth) == 0x000004, "Member 'FDungeonLevelStreamingConfig::VisibilityRoomDepth' has a wrong offset!");
static_assert(offsetof(FDungeonLevelStreamingConfig, VisibilityDistance) == 0x000008, "Member 'FDungeonLevelStreamingConfig::VisibilityDistance' has a wrong offset!");
static_assert(offsetof(FDungeonLevelStreamingConfig, LoadMethod) == 0x000014, "Member 'FDungeonLevelStreamingConfig::LoadMethod' has a wrong offset!");
static_assert(offsetof(FDungeonLevelStreamingConfig, UnloadMethod) == 0x000015, "Member 'FDungeonLevelStreamingConfig::UnloadMethod' has a wrong offset!");
static_assert(offsetof(FDungeonLevelStreamingConfig, bProcessStreamingNavigation) == 0x000016, "Member 'FDungeonLevelStreamingConfig::bProcessStreamingNavigation' has a wrong offset!");

// ScriptStruct DungeonArchitectRuntime.DungeonStreamingChunkParamRep
// 0x0098 (0x0098 - 0x0000)
struct FDungeonStreamingChunkParamRep final
{
public:
	class FString                                 LevelLongPackageName;                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LogicLevelLongPackageName;                         // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        InstanceId;                                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         OrderNum;                                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Category;                                          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ID;                                                // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   Bounds;                                            // 0x0060(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGuid>                          Neighbors;                                         // 0x0080(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bSpawnRoomChunk;                                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDungeonStreamingChunkParamRep) == 0x000008, "Wrong alignment on FDungeonStreamingChunkParamRep");
static_assert(sizeof(FDungeonStreamingChunkParamRep) == 0x000098, "Wrong size on FDungeonStreamingChunkParamRep");
static_assert(offsetof(FDungeonStreamingChunkParamRep, LevelLongPackageName) == 0x000000, "Member 'FDungeonStreamingChunkParamRep::LevelLongPackageName' has a wrong offset!");
static_assert(offsetof(FDungeonStreamingChunkParamRep, LogicLevelLongPackageName) == 0x000010, "Member 'FDungeonStreamingChunkParamRep::LogicLevelLongPackageName' has a wrong offset!");
static_assert(offsetof(FDungeonStreamingChunkParamRep, InstanceId) == 0x000020, "Member 'FDungeonStreamingChunkParamRep::InstanceId' has a wrong offset!");
static_assert(offsetof(FDungeonStreamingChunkParamRep, Location) == 0x000024, "Member 'FDungeonStreamingChunkParamRep::Location' has a wrong offset!");
static_assert(offsetof(FDungeonStreamingChunkParamRep, Rotation) == 0x000030, "Member 'FDungeonStreamingChunkParamRep::Rotation' has a wrong offset!");
static_assert(offsetof(FDungeonStreamingChunkParamRep, OrderNum) == 0x00003C, "Member 'FDungeonStreamingChunkParamRep::OrderNum' has a wrong offset!");
static_assert(offsetof(FDungeonStreamingChunkParamRep, Category) == 0x000040, "Member 'FDungeonStreamingChunkParamRep::Category' has a wrong offset!");
static_assert(offsetof(FDungeonStreamingChunkParamRep, ID) == 0x000050, "Member 'FDungeonStreamingChunkParamRep::ID' has a wrong offset!");
static_assert(offsetof(FDungeonStreamingChunkParamRep, Bounds) == 0x000060, "Member 'FDungeonStreamingChunkParamRep::Bounds' has a wrong offset!");
static_assert(offsetof(FDungeonStreamingChunkParamRep, Neighbors) == 0x000080, "Member 'FDungeonStreamingChunkParamRep::Neighbors' has a wrong offset!");
static_assert(offsetof(FDungeonStreamingChunkParamRep, bSpawnRoomChunk) == 0x000090, "Member 'FDungeonStreamingChunkParamRep::bSpawnRoomChunk' has a wrong offset!");

// ScriptStruct DungeonArchitectRuntime.MarkerReplaceEntry
// 0x0020 (0x0020 - 0x0000)
struct FMarkerReplaceEntry final
{
public:
	class FString                                 MarkerName;                                        // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReplacementName;                                   // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMarkerReplaceEntry) == 0x000008, "Wrong alignment on FMarkerReplaceEntry");
static_assert(sizeof(FMarkerReplaceEntry) == 0x000020, "Wrong size on FMarkerReplaceEntry");
static_assert(offsetof(FMarkerReplaceEntry, MarkerName) == 0x000000, "Member 'FMarkerReplaceEntry::MarkerName' has a wrong offset!");
static_assert(offsetof(FMarkerReplaceEntry, ReplacementName) == 0x000010, "Member 'FMarkerReplaceEntry::ReplacementName' has a wrong offset!");

// ScriptStruct DungeonArchitectRuntime.MaterialOverride
// 0x0010 (0x0010 - 0x0000)
struct FMaterialOverride final
{
public:
	int32                                         Index;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMaterialOverride) == 0x000008, "Wrong alignment on FMaterialOverride");
static_assert(sizeof(FMaterialOverride) == 0x000010, "Wrong size on FMaterialOverride");
static_assert(offsetof(FMaterialOverride, Index) == 0x000000, "Member 'FMaterialOverride::Index' has a wrong offset!");
static_assert(offsetof(FMaterialOverride, Material) == 0x000008, "Member 'FMaterialOverride::Material' has a wrong offset!");

// ScriptStruct DungeonArchitectRuntime.DungeonMiniMapOverlayTracking
// 0x001C (0x001C - 0x0000)
struct FDungeonMiniMapOverlayTracking final
{
public:
	TWeakObjectPtr<class AActor>                  TrackedActor;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ID;                                                // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   IconName;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOrientToRotation;                                 // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDungeonMiniMapOverlayTracking) == 0x000004, "Wrong alignment on FDungeonMiniMapOverlayTracking");
static_assert(sizeof(FDungeonMiniMapOverlayTracking) == 0x00001C, "Wrong size on FDungeonMiniMapOverlayTracking");
static_assert(offsetof(FDungeonMiniMapOverlayTracking, TrackedActor) == 0x000000, "Member 'FDungeonMiniMapOverlayTracking::TrackedActor' has a wrong offset!");
static_assert(offsetof(FDungeonMiniMapOverlayTracking, ID) == 0x000008, "Member 'FDungeonMiniMapOverlayTracking::ID' has a wrong offset!");
static_assert(offsetof(FDungeonMiniMapOverlayTracking, IconName) == 0x000010, "Member 'FDungeonMiniMapOverlayTracking::IconName' has a wrong offset!");
static_assert(offsetof(FDungeonMiniMapOverlayTracking, bOrientToRotation) == 0x000018, "Member 'FDungeonMiniMapOverlayTracking::bOrientToRotation' has a wrong offset!");

// ScriptStruct DungeonArchitectRuntime.DungeonMarkerInfo
// 0x0060 (0x0060 - 0x0000)
struct FDungeonMarkerInfo final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   NodeId;                                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UDungeonSpawnLogic*>             SpawnLogics;                                       // 0x0038(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UObject*                                TemplateObject;                                    // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDungeonMarkerInfo) == 0x000010, "Wrong alignment on FDungeonMarkerInfo");
static_assert(sizeof(FDungeonMarkerInfo) == 0x000060, "Wrong size on FDungeonMarkerInfo");
static_assert(offsetof(FDungeonMarkerInfo, Transform) == 0x000000, "Member 'FDungeonMarkerInfo::Transform' has a wrong offset!");
static_assert(offsetof(FDungeonMarkerInfo, NodeId) == 0x000030, "Member 'FDungeonMarkerInfo::NodeId' has a wrong offset!");
static_assert(offsetof(FDungeonMarkerInfo, SpawnLogics) == 0x000038, "Member 'FDungeonMarkerInfo::SpawnLogics' has a wrong offset!");
static_assert(offsetof(FDungeonMarkerInfo, TemplateObject) == 0x000048, "Member 'FDungeonMarkerInfo::TemplateObject' has a wrong offset!");

// ScriptStruct DungeonArchitectRuntime.PropChildSocketData
// 0x0040 (0x0040 - 0x0000)
struct FPropChildSocketData final
{
public:
	class FString                                 SocketType;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             Offset;                                            // 0x0010(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPropChildSocketData) == 0x000010, "Wrong alignment on FPropChildSocketData");
static_assert(sizeof(FPropChildSocketData) == 0x000040, "Wrong size on FPropChildSocketData");
static_assert(offsetof(FPropChildSocketData, SocketType) == 0x000000, "Member 'FPropChildSocketData::SocketType' has a wrong offset!");
static_assert(offsetof(FPropChildSocketData, Offset) == 0x000010, "Member 'FPropChildSocketData::Offset' has a wrong offset!");

// ScriptStruct DungeonArchitectRuntime.PropTypeData
// 0x00C0 (0x00C0 - 0x0000)
struct FPropTypeData final
{
public:
	class FName                                   NodeId;                                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                AssetObject;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AttachToSocket;                                    // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Probability;                                       // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSelectionLogic;                                // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLogicOverridesAffinity;                           // 0x0025(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDungeonSelectorLogic*>          SelectionLogics;                                   // 0x0028(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bUseTransformLogic;                                // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDungeonTransformLogic*>         TransformLogics;                                   // 0x0040(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bUseSpawnLogic;                                    // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDungeonSpawnLogic*>             SpawnLogics;                                       // 0x0058(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ConsumeOnAttach;                                   // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Offset;                                            // 0x0070(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseSpatialConstraint;                             // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDungeonSpatialConstraint*              SpatialConstraint;                                 // 0x00A8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPropChildSocketData>           ChildSockets;                                      // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPropTypeData) == 0x000010, "Wrong alignment on FPropTypeData");
static_assert(sizeof(FPropTypeData) == 0x0000C0, "Wrong size on FPropTypeData");
static_assert(offsetof(FPropTypeData, NodeId) == 0x000000, "Member 'FPropTypeData::NodeId' has a wrong offset!");
static_assert(offsetof(FPropTypeData, AssetObject) == 0x000008, "Member 'FPropTypeData::AssetObject' has a wrong offset!");
static_assert(offsetof(FPropTypeData, AttachToSocket) == 0x000010, "Member 'FPropTypeData::AttachToSocket' has a wrong offset!");
static_assert(offsetof(FPropTypeData, Probability) == 0x000020, "Member 'FPropTypeData::Probability' has a wrong offset!");
static_assert(offsetof(FPropTypeData, bUseSelectionLogic) == 0x000024, "Member 'FPropTypeData::bUseSelectionLogic' has a wrong offset!");
static_assert(offsetof(FPropTypeData, bLogicOverridesAffinity) == 0x000025, "Member 'FPropTypeData::bLogicOverridesAffinity' has a wrong offset!");
static_assert(offsetof(FPropTypeData, SelectionLogics) == 0x000028, "Member 'FPropTypeData::SelectionLogics' has a wrong offset!");
static_assert(offsetof(FPropTypeData, bUseTransformLogic) == 0x000038, "Member 'FPropTypeData::bUseTransformLogic' has a wrong offset!");
static_assert(offsetof(FPropTypeData, TransformLogics) == 0x000040, "Member 'FPropTypeData::TransformLogics' has a wrong offset!");
static_assert(offsetof(FPropTypeData, bUseSpawnLogic) == 0x000050, "Member 'FPropTypeData::bUseSpawnLogic' has a wrong offset!");
static_assert(offsetof(FPropTypeData, SpawnLogics) == 0x000058, "Member 'FPropTypeData::SpawnLogics' has a wrong offset!");
static_assert(offsetof(FPropTypeData, ConsumeOnAttach) == 0x000068, "Member 'FPropTypeData::ConsumeOnAttach' has a wrong offset!");
static_assert(offsetof(FPropTypeData, Offset) == 0x000070, "Member 'FPropTypeData::Offset' has a wrong offset!");
static_assert(offsetof(FPropTypeData, bUseSpatialConstraint) == 0x0000A0, "Member 'FPropTypeData::bUseSpatialConstraint' has a wrong offset!");
static_assert(offsetof(FPropTypeData, SpatialConstraint) == 0x0000A8, "Member 'FPropTypeData::SpatialConstraint' has a wrong offset!");
static_assert(offsetof(FPropTypeData, ChildSockets) == 0x0000B0, "Member 'FPropTypeData::ChildSockets' has a wrong offset!");

// ScriptStruct DungeonArchitectRuntime.PropSocket
// 0x0080 (0x0080 - 0x0000)
struct FPropSocket final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SocketType;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClusterThemeOverride;                              // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0030(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          IsConsumed;                                        // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x1F];                                      // 0x0061(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPropSocket) == 0x000010, "Wrong alignment on FPropSocket");
static_assert(sizeof(FPropSocket) == 0x000080, "Wrong size on FPropSocket");
static_assert(offsetof(FPropSocket, ID) == 0x000000, "Member 'FPropSocket::ID' has a wrong offset!");
static_assert(offsetof(FPropSocket, SocketType) == 0x000008, "Member 'FPropSocket::SocketType' has a wrong offset!");
static_assert(offsetof(FPropSocket, ClusterThemeOverride) == 0x000018, "Member 'FPropSocket::ClusterThemeOverride' has a wrong offset!");
static_assert(offsetof(FPropSocket, Transform) == 0x000030, "Member 'FPropSocket::Transform' has a wrong offset!");
static_assert(offsetof(FPropSocket, IsConsumed) == 0x000060, "Member 'FPropSocket::IsConsumed' has a wrong offset!");

// ScriptStruct DungeonArchitectRuntime.ClusterThemeInfo
// 0x0020 (0x0020 - 0x0000)
struct FClusterThemeInfo final
{
public:
	class FString                                 ClusterThemeName;                                  // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UDungeonThemeAsset*>             Themes;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FClusterThemeInfo) == 0x000008, "Wrong alignment on FClusterThemeInfo");
static_assert(sizeof(FClusterThemeInfo) == 0x000020, "Wrong size on FClusterThemeInfo");
static_assert(offsetof(FClusterThemeInfo, ClusterThemeName) == 0x000000, "Member 'FClusterThemeInfo::ClusterThemeName' has a wrong offset!");
static_assert(offsetof(FClusterThemeInfo, Themes) == 0x000010, "Member 'FClusterThemeInfo::Themes' has a wrong offset!");

// ScriptStruct DungeonArchitectRuntime.GridFlowItemCustomInfo
// 0x0038 (0x0038 - 0x0000)
struct FGridFlowItemCustomInfo final
{
public:
	class FString                                 PreviewText;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           PreviewTextColor;                                  // 0x0010(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           PreviewBackgroundColor;                            // 0x0020(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FontScale;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGridFlowItemCustomInfo) == 0x000008, "Wrong alignment on FGridFlowItemCustomInfo");
static_assert(sizeof(FGridFlowItemCustomInfo) == 0x000038, "Wrong size on FGridFlowItemCustomInfo");
static_assert(offsetof(FGridFlowItemCustomInfo, PreviewText) == 0x000000, "Member 'FGridFlowItemCustomInfo::PreviewText' has a wrong offset!");
static_assert(offsetof(FGridFlowItemCustomInfo, PreviewTextColor) == 0x000010, "Member 'FGridFlowItemCustomInfo::PreviewTextColor' has a wrong offset!");
static_assert(offsetof(FGridFlowItemCustomInfo, PreviewBackgroundColor) == 0x000020, "Member 'FGridFlowItemCustomInfo::PreviewBackgroundColor' has a wrong offset!");
static_assert(offsetof(FGridFlowItemCustomInfo, FontScale) == 0x000030, "Member 'FGridFlowItemCustomInfo::FontScale' has a wrong offset!");

// ScriptStruct DungeonArchitectRuntime.FlowAbstractNodeGroup
// 0x0020 (0x0020 - 0x0000)
struct FFlowAbstractNodeGroup final
{
public:
	struct FGuid                                  GroupId;                                           // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                          GroupNodes;                                        // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFlowAbstractNodeGroup) == 0x000008, "Wrong alignment on FFlowAbstractNodeGroup");
static_assert(sizeof(FFlowAbstractNodeGroup) == 0x000020, "Wrong size on FFlowAbstractNodeGroup");
static_assert(offsetof(FFlowAbstractNodeGroup, GroupId) == 0x000000, "Member 'FFlowAbstractNodeGroup::GroupId' has a wrong offset!");
static_assert(offsetof(FFlowAbstractNodeGroup, GroupNodes) == 0x000010, "Member 'FFlowAbstractNodeGroup::GroupNodes' has a wrong offset!");

// ScriptStruct DungeonArchitectRuntime.RuleNodeExecutionModeConfig
// 0x0010 (0x0010 - 0x0000)
struct FRuleNodeExecutionModeConfig final
{
public:
	float                                         RunProbability;                                    // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IterationCount;                                    // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IterationCountMin;                                 // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IterationCountMax;                                 // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRuleNodeExecutionModeConfig) == 0x000004, "Wrong alignment on FRuleNodeExecutionModeConfig");
static_assert(sizeof(FRuleNodeExecutionModeConfig) == 0x000010, "Wrong size on FRuleNodeExecutionModeConfig");
static_assert(offsetof(FRuleNodeExecutionModeConfig, RunProbability) == 0x000000, "Member 'FRuleNodeExecutionModeConfig::RunProbability' has a wrong offset!");
static_assert(offsetof(FRuleNodeExecutionModeConfig, IterationCount) == 0x000004, "Member 'FRuleNodeExecutionModeConfig::IterationCount' has a wrong offset!");
static_assert(offsetof(FRuleNodeExecutionModeConfig, IterationCountMin) == 0x000008, "Member 'FRuleNodeExecutionModeConfig::IterationCountMin' has a wrong offset!");
static_assert(offsetof(FRuleNodeExecutionModeConfig, IterationCountMax) == 0x00000C, "Member 'FRuleNodeExecutionModeConfig::IterationCountMax' has a wrong offset!");

// ScriptStruct DungeonArchitectRuntime.StairInfo
// 0x0040 (0x0040 - 0x0000)
struct FStairInfo final
{
public:
	int32                                         OwnerCell;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ConnectedToCell;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  Rotation;                                          // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FIntVector                             IPosition;                                         // 0x0030(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FStairInfo) == 0x000010, "Wrong alignment on FStairInfo");
static_assert(sizeof(FStairInfo) == 0x000040, "Wrong size on FStairInfo");
static_assert(offsetof(FStairInfo, OwnerCell) == 0x000000, "Member 'FStairInfo::OwnerCell' has a wrong offset!");
static_assert(offsetof(FStairInfo, ConnectedToCell) == 0x000004, "Member 'FStairInfo::ConnectedToCell' has a wrong offset!");
static_assert(offsetof(FStairInfo, Position) == 0x000008, "Member 'FStairInfo::Position' has a wrong offset!");
static_assert(offsetof(FStairInfo, Rotation) == 0x000020, "Member 'FStairInfo::Rotation' has a wrong offset!");
static_assert(offsetof(FStairInfo, IPosition) == 0x000030, "Member 'FStairInfo::IPosition' has a wrong offset!");

// ScriptStruct DungeonArchitectRuntime.GridCellInfo
// 0x0008 (0x0008 - 0x0000)
struct FGridCellInfo final
{
public:
	int32                                         CellId;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFCellType                                    CellType;                                          // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ContainsDoor;                                      // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGridCellInfo) == 0x000004, "Wrong alignment on FGridCellInfo");
static_assert(sizeof(FGridCellInfo) == 0x000008, "Wrong size on FGridCellInfo");
static_assert(offsetof(FGridCellInfo, CellId) == 0x000000, "Member 'FGridCellInfo::CellId' has a wrong offset!");
static_assert(offsetof(FGridCellInfo, CellType) == 0x000004, "Member 'FGridCellInfo::CellType' has a wrong offset!");
static_assert(offsetof(FGridCellInfo, ContainsDoor) == 0x000005, "Member 'FGridCellInfo::ContainsDoor' has a wrong offset!");

// ScriptStruct DungeonArchitectRuntime.CellDoor
// 0x0024 (0x0024 - 0x0000)
struct alignas(0x04) FCellDoor final
{
public:
	uint8                                         Pad_0[0x24];                                       // 0x0000(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCellDoor) == 0x000004, "Wrong alignment on FCellDoor");
static_assert(sizeof(FCellDoor) == 0x000024, "Wrong size on FCellDoor");

// ScriptStruct DungeonArchitectRuntime.Rectangle
// 0x0018 (0x0018 - 0x0000)
struct FRectangle final
{
public:
	struct FIntVector                             Location;                                          // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             Size;                                              // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRectangle) == 0x000004, "Wrong alignment on FRectangle");
static_assert(sizeof(FRectangle) == 0x000018, "Wrong size on FRectangle");
static_assert(offsetof(FRectangle, Location) == 0x000000, "Member 'FRectangle::Location' has a wrong offset!");
static_assert(offsetof(FRectangle, Size) == 0x00000C, "Member 'FRectangle::Size' has a wrong offset!");

// ScriptStruct DungeonArchitectRuntime.Cell
// 0x0058 (0x0058 - 0x0000)
struct FCell final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRectangle                             Bounds;                                            // 0x0004(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	EFCellType                                    CellType;                                          // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UserDefined;                                       // 0x001D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ClusterId;                                         // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 ConnectedRooms;                                    // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 FixedRoomConnections;                              // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 AdjacentCells;                                     // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCell) == 0x000008, "Wrong alignment on FCell");
static_assert(sizeof(FCell) == 0x000058, "Wrong size on FCell");
static_assert(offsetof(FCell, ID) == 0x000000, "Member 'FCell::ID' has a wrong offset!");
static_assert(offsetof(FCell, Bounds) == 0x000004, "Member 'FCell::Bounds' has a wrong offset!");
static_assert(offsetof(FCell, CellType) == 0x00001C, "Member 'FCell::CellType' has a wrong offset!");
static_assert(offsetof(FCell, UserDefined) == 0x00001D, "Member 'FCell::UserDefined' has a wrong offset!");
static_assert(offsetof(FCell, ClusterId) == 0x000020, "Member 'FCell::ClusterId' has a wrong offset!");
static_assert(offsetof(FCell, ConnectedRooms) == 0x000028, "Member 'FCell::ConnectedRooms' has a wrong offset!");
static_assert(offsetof(FCell, FixedRoomConnections) == 0x000038, "Member 'FCell::FixedRoomConnections' has a wrong offset!");
static_assert(offsetof(FCell, AdjacentCells) == 0x000048, "Member 'FCell::AdjacentCells' has a wrong offset!");

// ScriptStruct DungeonArchitectRuntime.GridToolRectStrokeData
// 0x001C (0x001C - 0x0000)
struct FGridToolRectStrokeData final
{
public:
	struct FRectangle                             Rectangle;                                         // 0x0000(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	EGridPaintToolCellType                        CellType;                                          // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGridToolRectStrokeData) == 0x000004, "Wrong alignment on FGridToolRectStrokeData");
static_assert(sizeof(FGridToolRectStrokeData) == 0x00001C, "Wrong size on FGridToolRectStrokeData");
static_assert(offsetof(FGridToolRectStrokeData, Rectangle) == 0x000000, "Member 'FGridToolRectStrokeData::Rectangle' has a wrong offset!");
static_assert(offsetof(FGridToolRectStrokeData, CellType) == 0x000018, "Member 'FGridToolRectStrokeData::CellType' has a wrong offset!");

// ScriptStruct DungeonArchitectRuntime.GridToolPaintStrokeData
// 0x0010 (0x0010 - 0x0000)
struct FGridToolPaintStrokeData final
{
public:
	struct FIntVector                             Location;                                          // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGridPaintToolCellType                        CellType;                                          // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGridToolPaintStrokeData) == 0x000004, "Wrong alignment on FGridToolPaintStrokeData");
static_assert(sizeof(FGridToolPaintStrokeData) == 0x000010, "Wrong size on FGridToolPaintStrokeData");
static_assert(offsetof(FGridToolPaintStrokeData, Location) == 0x000000, "Member 'FGridToolPaintStrokeData::Location' has a wrong offset!");
static_assert(offsetof(FGridToolPaintStrokeData, CellType) == 0x00000C, "Member 'FGridToolPaintStrokeData::CellType' has a wrong offset!");

// ScriptStruct DungeonArchitectRuntime.GridFlowChunkQueryResult
// 0x0038 (0x0038 - 0x0000)
struct FGridFlowChunkQueryResult final
{
public:
	struct FIntPoint                              LayoutNodeCoord;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TilemapCoordStart;                                 // 0x0008(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
