#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DungeonArchitectRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DungeonArchitectRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DungeonArchitectRuntime.Dungeon.GetDungeonActor
// 0x0008 (0x0008 - 0x0000)
struct Dungeon_GetDungeonActor final
{
public:
	class ADungeon*                               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Dungeon_GetDungeonActor) == 0x000008, "Wrong alignment on Dungeon_GetDungeonActor");
static_assert(sizeof(Dungeon_GetDungeonActor) == 0x000008, "Wrong size on Dungeon_GetDungeonActor");
static_assert(offsetof(Dungeon_GetDungeonActor, ReturnValue) == 0x000000, "Member 'Dungeon_GetDungeonActor::ReturnValue' has a wrong offset!");

// Function DungeonArchitectRuntime.Dungeon.GetDungeonLevelNumber
// 0x0010 (0x0010 - 0x0000)
struct Dungeon_GetDungeonLevelNumber final
{
public:
	const class UObject*                          SceneObject;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Dungeon_GetDungeonLevelNumber) == 0x000008, "Wrong alignment on Dungeon_GetDungeonLevelNumber");
static_assert(sizeof(Dungeon_GetDungeonLevelNumber) == 0x000010, "Wrong size on Dungeon_GetDungeonLevelNumber");
static_assert(offsetof(Dungeon_GetDungeonLevelNumber, SceneObject) == 0x000000, "Member 'Dungeon_GetDungeonLevelNumber::SceneObject' has a wrong offset!");
static_assert(offsetof(Dungeon_GetDungeonLevelNumber, ReturnValue) == 0x000008, "Member 'Dungeon_GetDungeonLevelNumber::ReturnValue' has a wrong offset!");

// Function DungeonArchitectRuntime.Dungeon.GetQuery
// 0x0008 (0x0008 - 0x0000)
struct Dungeon_GetQuery final
{
public:
	class UDungeonQuery*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Dungeon_GetQuery) == 0x000008, "Wrong alignment on Dungeon_GetQuery");
static_assert(sizeof(Dungeon_GetQuery) == 0x000008, "Wrong size on Dungeon_GetQuery");
static_assert(offsetof(Dungeon_GetQuery, ReturnValue) == 0x000000, "Member 'Dungeon_GetQuery::ReturnValue' has a wrong offset!");

// Function DungeonArchitectRuntime.Dungeon.SetBuilderClass
// 0x0010 (0x0010 - 0x0000)
struct Dungeon_SetBuilderClass final
{
public:
	TSubclassOf<class UDungeonBuilder>            InBuilderClass;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDungeonBuilder*                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Dungeon_SetBuilderClass) == 0x000008, "Wrong alignment on Dungeon_SetBuilderClass");
static_assert(sizeof(Dungeon_SetBuilderClass) == 0x000010, "Wrong size on Dungeon_SetBuilderClass");
static_assert(offsetof(Dungeon_SetBuilderClass, InBuilderClass) == 0x000000, "Member 'Dungeon_SetBuilderClass::InBuilderClass' has a wrong offset!");
static_assert(offsetof(Dungeon_SetBuilderClass, ReturnValue) == 0x000008, "Member 'Dungeon_SetBuilderClass::ReturnValue' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonBPFunctionLibrary.ActorBelongsToDungeon
// 0x0018 (0x0018 - 0x0000)
struct DungeonBPFunctionLibrary_ActorBelongsToDungeon final
{
public:
	class ADungeon*                               Dungeon;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ActorToCheck;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DungeonBPFunctionLibrary_ActorBelongsToDungeon) == 0x000008, "Wrong alignment on DungeonBPFunctionLibrary_ActorBelongsToDungeon");
static_assert(sizeof(DungeonBPFunctionLibrary_ActorBelongsToDungeon) == 0x000018, "Wrong size on DungeonBPFunctionLibrary_ActorBelongsToDungeon");
static_assert(offsetof(DungeonBPFunctionLibrary_ActorBelongsToDungeon, Dungeon) == 0x000000, "Member 'DungeonBPFunctionLibrary_ActorBelongsToDungeon::Dungeon' has a wrong offset!");
static_assert(offsetof(DungeonBPFunctionLibrary_ActorBelongsToDungeon, ActorToCheck) == 0x000008, "Member 'DungeonBPFunctionLibrary_ActorBelongsToDungeon::ActorToCheck' has a wrong offset!");
static_assert(offsetof(DungeonBPFunctionLibrary_ActorBelongsToDungeon, ReturnValue) == 0x000010, "Member 'DungeonBPFunctionLibrary_ActorBelongsToDungeon::ReturnValue' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonBPFunctionLibrary.DungeonObjectHasAuthority
// 0x0010 (0x0010 - 0x0000)
struct DungeonBPFunctionLibrary_DungeonObjectHasAuthority final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DungeonBPFunctionLibrary_DungeonObjectHasAuthority) == 0x000008, "Wrong alignment on DungeonBPFunctionLibrary_DungeonObjectHasAuthority");
static_assert(sizeof(DungeonBPFunctionLibrary_DungeonObjectHasAuthority) == 0x000010, "Wrong size on DungeonBPFunctionLibrary_DungeonObjectHasAuthority");
static_assert(offsetof(DungeonBPFunctionLibrary_DungeonObjectHasAuthority, Object) == 0x000000, "Member 'DungeonBPFunctionLibrary_DungeonObjectHasAuthority::Object' has a wrong offset!");
static_assert(offsetof(DungeonBPFunctionLibrary_DungeonObjectHasAuthority, ReturnValue) == 0x000008, "Member 'DungeonBPFunctionLibrary_DungeonObjectHasAuthority::ReturnValue' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonBPFunctionLibrary.SpawnDungeonOwnedActor
// 0x0050 (0x0050 - 0x0000)
struct DungeonBPFunctionLibrary_SpawnDungeonOwnedActor final
{
public:
	class ADungeon*                               Dungeon;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             Transform;                                         // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DungeonBPFunctionLibrary_SpawnDungeonOwnedActor) == 0x000010, "Wrong alignment on DungeonBPFunctionLibrary_SpawnDungeonOwnedActor");
static_assert(sizeof(DungeonBPFunctionLibrary_SpawnDungeonOwnedActor) == 0x000050, "Wrong size on DungeonBPFunctionLibrary_SpawnDungeonOwnedActor");
static_assert(offsetof(DungeonBPFunctionLibrary_SpawnDungeonOwnedActor, Dungeon) == 0x000000, "Member 'DungeonBPFunctionLibrary_SpawnDungeonOwnedActor::Dungeon' has a wrong offset!");
static_assert(offsetof(DungeonBPFunctionLibrary_SpawnDungeonOwnedActor, ActorClass) == 0x000008, "Member 'DungeonBPFunctionLibrary_SpawnDungeonOwnedActor::ActorClass' has a wrong offset!");
static_assert(offsetof(DungeonBPFunctionLibrary_SpawnDungeonOwnedActor, Transform) == 0x000010, "Member 'DungeonBPFunctionLibrary_SpawnDungeonOwnedActor::Transform' has a wrong offset!");
static_assert(offsetof(DungeonBPFunctionLibrary_SpawnDungeonOwnedActor, ReturnValue) == 0x000040, "Member 'DungeonBPFunctionLibrary_SpawnDungeonOwnedActor::ReturnValue' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonBPFunctionLibrary.StreamDungeonModuleLevel
// 0x0058 (0x0058 - 0x0000)
struct DungeonBPFunctionLibrary_StreamDungeonModuleLevel final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UWorld>                  Level;                                             // 0x0008(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InstanceId;                                        // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0034(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0040(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOutSuccess;                                       // 0x004C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreamingDynamic*                 ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonBPFunctionLibrary_StreamDungeonModuleLevel) == 0x000008, "Wrong alignment on DungeonBPFunctionLibrary_StreamDungeonModuleLevel");
static_assert(sizeof(DungeonBPFunctionLibrary_StreamDungeonModuleLevel) == 0x000058, "Wrong size on DungeonBPFunctionLibrary_StreamDungeonModuleLevel");
static_assert(offsetof(DungeonBPFunctionLibrary_StreamDungeonModuleLevel, WorldContextObject) == 0x000000, "Member 'DungeonBPFunctionLibrary_StreamDungeonModuleLevel::WorldContextObject' has a wrong offset!");
static_assert(offsetof(DungeonBPFunctionLibrary_StreamDungeonModuleLevel, Level) == 0x000008, "Member 'DungeonBPFunctionLibrary_StreamDungeonModuleLevel::Level' has a wrong offset!");
static_assert(offsetof(DungeonBPFunctionLibrary_StreamDungeonModuleLevel, InstanceId) == 0x000030, "Member 'DungeonBPFunctionLibrary_StreamDungeonModuleLevel::InstanceId' has a wrong offset!");
static_assert(offsetof(DungeonBPFunctionLibrary_StreamDungeonModuleLevel, Location) == 0x000034, "Member 'DungeonBPFunctionLibrary_StreamDungeonModuleLevel::Location' has a wrong offset!");
static_assert(offsetof(DungeonBPFunctionLibrary_StreamDungeonModuleLevel, Rotation) == 0x000040, "Member 'DungeonBPFunctionLibrary_StreamDungeonModuleLevel::Rotation' has a wrong offset!");
static_assert(offsetof(DungeonBPFunctionLibrary_StreamDungeonModuleLevel, bOutSuccess) == 0x00004C, "Member 'DungeonBPFunctionLibrary_StreamDungeonModuleLevel::bOutSuccess' has a wrong offset!");
static_assert(offsetof(DungeonBPFunctionLibrary_StreamDungeonModuleLevel, ReturnValue) == 0x000050, "Member 'DungeonBPFunctionLibrary_StreamDungeonModuleLevel::ReturnValue' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonBuilder.EmitMarker
// 0x0040 (0x0040 - 0x0000)
struct DungeonBuilder_EmitMarker final
{
public:
	class FString                                 SocketType;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             Transform;                                         // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonBuilder_EmitMarker) == 0x000010, "Wrong alignment on DungeonBuilder_EmitMarker");
static_assert(sizeof(DungeonBuilder_EmitMarker) == 0x000040, "Wrong size on DungeonBuilder_EmitMarker");
static_assert(offsetof(DungeonBuilder_EmitMarker, SocketType) == 0x000000, "Member 'DungeonBuilder_EmitMarker::SocketType' has a wrong offset!");
static_assert(offsetof(DungeonBuilder_EmitMarker, Transform) == 0x000010, "Member 'DungeonBuilder_EmitMarker::Transform' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonBuilder.GetMarkers
// 0x0010 (0x0010 - 0x0000)
struct DungeonBuilder_GetMarkers final
{
public:
	TArray<struct FPropSocket>                    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonBuilder_GetMarkers) == 0x000008, "Wrong alignment on DungeonBuilder_GetMarkers");
static_assert(sizeof(DungeonBuilder_GetMarkers) == 0x000010, "Wrong size on DungeonBuilder_GetMarkers");
static_assert(offsetof(DungeonBuilder_GetMarkers, ReturnValue) == 0x000000, "Member 'DungeonBuilder_GetMarkers::ReturnValue' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonEventListener.OnDungeonDestroyed
// 0x0008 (0x0008 - 0x0000)
struct DungeonEventListener_OnDungeonDestroyed final
{
public:
	class ADungeon*                               Dungeon;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonEventListener_OnDungeonDestroyed) == 0x000008, "Wrong alignment on DungeonEventListener_OnDungeonDestroyed");
static_assert(sizeof(DungeonEventListener_OnDungeonDestroyed) == 0x000008, "Wrong size on DungeonEventListener_OnDungeonDestroyed");
static_assert(offsetof(DungeonEventListener_OnDungeonDestroyed, Dungeon) == 0x000000, "Member 'DungeonEventListener_OnDungeonDestroyed::Dungeon' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonEventListener.OnDungeonLayoutBuilt
// 0x0008 (0x0008 - 0x0000)
struct DungeonEventListener_OnDungeonLayoutBuilt final
{
public:
	class ADungeon*                               Dungeon;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonEventListener_OnDungeonLayoutBuilt) == 0x000008, "Wrong alignment on DungeonEventListener_OnDungeonLayoutBuilt");
static_assert(sizeof(DungeonEventListener_OnDungeonLayoutBuilt) == 0x000008, "Wrong size on DungeonEventListener_OnDungeonLayoutBuilt");
static_assert(offsetof(DungeonEventListener_OnDungeonLayoutBuilt, Dungeon) == 0x000000, "Member 'DungeonEventListener_OnDungeonLayoutBuilt::Dungeon' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonEventListener.OnMarkersEmitted
// 0x0028 (0x0028 - 0x0000)
struct DungeonEventListener_OnMarkersEmitted final
{
public:
	class ADungeon*                               Dungeon;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDungeonMarkerInfo>             MarkerList;                                        // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FDungeonMarkerInfo>             MarkerListRef;                                     // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonEventListener_OnMarkersEmitted) == 0x000008, "Wrong alignment on DungeonEventListener_OnMarkersEmitted");
static_assert(sizeof(DungeonEventListener_OnMarkersEmitted) == 0x000028, "Wrong size on DungeonEventListener_OnMarkersEmitted");
static_assert(offsetof(DungeonEventListener_OnMarkersEmitted, Dungeon) == 0x000000, "Member 'DungeonEventListener_OnMarkersEmitted::Dungeon' has a wrong offset!");
static_assert(offsetof(DungeonEventListener_OnMarkersEmitted, MarkerList) == 0x000008, "Member 'DungeonEventListener_OnMarkersEmitted::MarkerList' has a wrong offset!");
static_assert(offsetof(DungeonEventListener_OnMarkersEmitted, MarkerListRef) == 0x000018, "Member 'DungeonEventListener_OnMarkersEmitted::MarkerListRef' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonEventListener.OnPostDungeonBuild
// 0x0008 (0x0008 - 0x0000)
struct DungeonEventListener_OnPostDungeonBuild final
{
public:
	class ADungeon*                               Dungeon;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonEventListener_OnPostDungeonBuild) == 0x000008, "Wrong alignment on DungeonEventListener_OnPostDungeonBuild");
static_assert(sizeof(DungeonEventListener_OnPostDungeonBuild) == 0x000008, "Wrong size on DungeonEventListener_OnPostDungeonBuild");
static_assert(offsetof(DungeonEventListener_OnPostDungeonBuild, Dungeon) == 0x000000, "Member 'DungeonEventListener_OnPostDungeonBuild::Dungeon' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonEventListener.OnPreDungeonBuild
// 0x0008 (0x0008 - 0x0000)
struct DungeonEventListener_OnPreDungeonBuild final
{
public:
	class ADungeon*                               Dungeon;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonEventListener_OnPreDungeonBuild) == 0x000008, "Wrong alignment on DungeonEventListener_OnPreDungeonBuild");
static_assert(sizeof(DungeonEventListener_OnPreDungeonBuild) == 0x000008, "Wrong size on DungeonEventListener_OnPreDungeonBuild");
static_assert(offsetof(DungeonEventListener_OnPreDungeonBuild, Dungeon) == 0x000000, "Member 'DungeonEventListener_OnPreDungeonBuild::Dungeon' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonEventListener.OnPreDungeonDestroy
// 0x0008 (0x0008 - 0x0000)
struct DungeonEventListener_OnPreDungeonDestroy final
{
public:
	class ADungeon*                               Dungeon;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonEventListener_OnPreDungeonDestroy) == 0x000008, "Wrong alignment on DungeonEventListener_OnPreDungeonDestroy");
static_assert(sizeof(DungeonEventListener_OnPreDungeonDestroy) == 0x000008, "Wrong size on DungeonEventListener_OnPreDungeonDestroy");
static_assert(offsetof(DungeonEventListener_OnPreDungeonDestroy, Dungeon) == 0x000000, "Member 'DungeonEventListener_OnPreDungeonDestroy::Dungeon' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonStreamingChunk.GetAllActorsOfClass
// 0x0018 (0x0018 - 0x0000)
struct DungeonStreamingChunk_GetAllActorsOfClass final
{
public:
	class UClass*                                 InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         OutActors;                                         // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonStreamingChunk_GetAllActorsOfClass) == 0x000008, "Wrong alignment on DungeonStreamingChunk_GetAllActorsOfClass");
static_assert(sizeof(DungeonStreamingChunk_GetAllActorsOfClass) == 0x000018, "Wrong size on DungeonStreamingChunk_GetAllActorsOfClass");
static_assert(offsetof(DungeonStreamingChunk_GetAllActorsOfClass, InClass) == 0x000000, "Member 'DungeonStreamingChunk_GetAllActorsOfClass::InClass' has a wrong offset!");
static_assert(offsetof(DungeonStreamingChunk_GetAllActorsOfClass, OutActors) == 0x000008, "Member 'DungeonStreamingChunk_GetAllActorsOfClass::OutActors' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonMarkerEmitter.EmitMarkers
// 0x0020 (0x0020 - 0x0000)
struct DungeonMarkerEmitter_EmitMarkers final
{
public:
	class UDungeonBuilder*                        Builder;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDungeonModel*                          Model;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDungeonConfig*                         Config;                                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDungeonQuery*                          Query;                                             // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonMarkerEmitter_EmitMarkers) == 0x000008, "Wrong alignment on DungeonMarkerEmitter_EmitMarkers");
static_assert(sizeof(DungeonMarkerEmitter_EmitMarkers) == 0x000020, "Wrong size on DungeonMarkerEmitter_EmitMarkers");
static_assert(offsetof(DungeonMarkerEmitter_EmitMarkers, Builder) == 0x000000, "Member 'DungeonMarkerEmitter_EmitMarkers::Builder' has a wrong offset!");
static_assert(offsetof(DungeonMarkerEmitter_EmitMarkers, Model) == 0x000008, "Member 'DungeonMarkerEmitter_EmitMarkers::Model' has a wrong offset!");
static_assert(offsetof(DungeonMarkerEmitter_EmitMarkers, Config) == 0x000010, "Member 'DungeonMarkerEmitter_EmitMarkers::Config' has a wrong offset!");
static_assert(offsetof(DungeonMarkerEmitter_EmitMarkers, Query) == 0x000018, "Member 'DungeonMarkerEmitter_EmitMarkers::Query' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonMiniMap.BuildLayout
// 0x0010 (0x0010 - 0x0000)
struct DungeonMiniMap_BuildLayout final
{
public:
	class UDungeonModel*                          DungeonModel;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDungeonConfig*                         DungeonConfig;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonMiniMap_BuildLayout) == 0x000008, "Wrong alignment on DungeonMiniMap_BuildLayout");
static_assert(sizeof(DungeonMiniMap_BuildLayout) == 0x000010, "Wrong size on DungeonMiniMap_BuildLayout");
static_assert(offsetof(DungeonMiniMap_BuildLayout, DungeonModel) == 0x000000, "Member 'DungeonMiniMap_BuildLayout::DungeonModel' has a wrong offset!");
static_assert(offsetof(DungeonMiniMap_BuildLayout, DungeonConfig) == 0x000008, "Member 'DungeonMiniMap_BuildLayout::DungeonConfig' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonMiniMap.CreateMaterialInstance
// 0x0008 (0x0008 - 0x0000)
struct DungeonMiniMap_CreateMaterialInstance final
{
public:
	class UMaterialInterface*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonMiniMap_CreateMaterialInstance) == 0x000008, "Wrong alignment on DungeonMiniMap_CreateMaterialInstance");
static_assert(sizeof(DungeonMiniMap_CreateMaterialInstance) == 0x000008, "Wrong size on DungeonMiniMap_CreateMaterialInstance");
static_assert(offsetof(DungeonMiniMap_CreateMaterialInstance, ReturnValue) == 0x000000, "Member 'DungeonMiniMap_CreateMaterialInstance::ReturnValue' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonMiniMap.CreateMaterialInstanceFromTemplate
// 0x0010 (0x0010 - 0x0000)
struct DungeonMiniMap_CreateMaterialInstanceFromTemplate final
{
public:
	class UMaterialInterface*                     InMaterialTemplate;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonMiniMap_CreateMaterialInstanceFromTemplate) == 0x000008, "Wrong alignment on DungeonMiniMap_CreateMaterialInstanceFromTemplate");
static_assert(sizeof(DungeonMiniMap_CreateMaterialInstanceFromTemplate) == 0x000010, "Wrong size on DungeonMiniMap_CreateMaterialInstanceFromTemplate");
static_assert(offsetof(DungeonMiniMap_CreateMaterialInstanceFromTemplate, InMaterialTemplate) == 0x000000, "Member 'DungeonMiniMap_CreateMaterialInstanceFromTemplate::InMaterialTemplate' has a wrong offset!");
static_assert(offsetof(DungeonMiniMap_CreateMaterialInstanceFromTemplate, ReturnValue) == 0x000008, "Member 'DungeonMiniMap_CreateMaterialInstanceFromTemplate::ReturnValue' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonMiniMap.UpdateMaterial
// 0x0008 (0x0008 - 0x0000)
struct DungeonMiniMap_UpdateMaterial final
{
public:
	class UMaterialInterface*                     InMaterial;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonMiniMap_UpdateMaterial) == 0x000008, "Wrong alignment on DungeonMiniMap_UpdateMaterial");
static_assert(sizeof(DungeonMiniMap_UpdateMaterial) == 0x000008, "Wrong size on DungeonMiniMap_UpdateMaterial");
static_assert(offsetof(DungeonMiniMap_UpdateMaterial, InMaterial) == 0x000000, "Member 'DungeonMiniMap_UpdateMaterial::InMaterial' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonModelHelper.ExpandBounds
// 0x0034 (0x0034 - 0x0000)
struct DungeonModelHelper_ExpandBounds final
{
public:
	struct FRectangle                             Bounds;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Size;                                              // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRectangle                             Result;                                            // 0x001C(0x0018)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonModelHelper_ExpandBounds) == 0x000004, "Wrong alignment on DungeonModelHelper_ExpandBounds");
static_assert(sizeof(DungeonModelHelper_ExpandBounds) == 0x000034, "Wrong size on DungeonModelHelper_ExpandBounds");
static_assert(offsetof(DungeonModelHelper_ExpandBounds, Bounds) == 0x000000, "Member 'DungeonModelHelper_ExpandBounds::Bounds' has a wrong offset!");
static_assert(offsetof(DungeonModelHelper_ExpandBounds, Size) == 0x000018, "Member 'DungeonModelHelper_ExpandBounds::Size' has a wrong offset!");
static_assert(offsetof(DungeonModelHelper_ExpandBounds, Result) == 0x00001C, "Member 'DungeonModelHelper_ExpandBounds::Result' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonModelHelper.GetCenterExtent
// 0x0030 (0x0030 - 0x0000)
struct DungeonModelHelper_GetCenterExtent final
{
public:
	struct FRectangle                             Rectangle;                                         // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Center;                                            // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Extent;                                            // 0x0024(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonModelHelper_GetCenterExtent) == 0x000004, "Wrong alignment on DungeonModelHelper_GetCenterExtent");
static_assert(sizeof(DungeonModelHelper_GetCenterExtent) == 0x000030, "Wrong size on DungeonModelHelper_GetCenterExtent");
static_assert(offsetof(DungeonModelHelper_GetCenterExtent, Rectangle) == 0x000000, "Member 'DungeonModelHelper_GetCenterExtent::Rectangle' has a wrong offset!");
static_assert(offsetof(DungeonModelHelper_GetCenterExtent, Center) == 0x000018, "Member 'DungeonModelHelper_GetCenterExtent::Center' has a wrong offset!");
static_assert(offsetof(DungeonModelHelper_GetCenterExtent, Extent) == 0x000024, "Member 'DungeonModelHelper_GetCenterExtent::Extent' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonModelHelper.GetRectAreaPoints
// 0x0028 (0x0028 - 0x0000)
struct DungeonModelHelper_GetRectAreaPoints final
{
public:
	struct FRectangle                             Rectangle;                                         // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FIntVector>                     BorderPoints;                                      // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonModelHelper_GetRectAreaPoints) == 0x000008, "Wrong alignment on DungeonModelHelper_GetRectAreaPoints");
static_assert(sizeof(DungeonModelHelper_GetRectAreaPoints) == 0x000028, "Wrong size on DungeonModelHelper_GetRectAreaPoints");
static_assert(offsetof(DungeonModelHelper_GetRectAreaPoints, Rectangle) == 0x000000, "Member 'DungeonModelHelper_GetRectAreaPoints::Rectangle' has a wrong offset!");
static_assert(offsetof(DungeonModelHelper_GetRectAreaPoints, BorderPoints) == 0x000018, "Member 'DungeonModelHelper_GetRectAreaPoints::BorderPoints' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonModelHelper.GetRectBorderPoints
// 0x0028 (0x0028 - 0x0000)
struct DungeonModelHelper_GetRectBorderPoints final
{
public:
	struct FRectangle                             Rectangle;                                         // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FIntVector>                     BorderPoints;                                      // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonModelHelper_GetRectBorderPoints) == 0x000008, "Wrong alignment on DungeonModelHelper_GetRectBorderPoints");
static_assert(sizeof(DungeonModelHelper_GetRectBorderPoints) == 0x000028, "Wrong size on DungeonModelHelper_GetRectBorderPoints");
static_assert(offsetof(DungeonModelHelper_GetRectBorderPoints, Rectangle) == 0x000000, "Member 'DungeonModelHelper_GetRectBorderPoints::Rectangle' has a wrong offset!");
static_assert(offsetof(DungeonModelHelper_GetRectBorderPoints, BorderPoints) == 0x000018, "Member 'DungeonModelHelper_GetRectBorderPoints::BorderPoints' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonModelHelper.MakeIntVector
// 0x0018 (0x0018 - 0x0000)
struct DungeonModelHelper_MakeIntVector final
{
public:
	struct FVector                                In;                                                // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             ReturnValue;                                       // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonModelHelper_MakeIntVector) == 0x000004, "Wrong alignment on DungeonModelHelper_MakeIntVector");
static_assert(sizeof(DungeonModelHelper_MakeIntVector) == 0x000018, "Wrong size on DungeonModelHelper_MakeIntVector");
static_assert(offsetof(DungeonModelHelper_MakeIntVector, In) == 0x000000, "Member 'DungeonModelHelper_MakeIntVector::In' has a wrong offset!");
static_assert(offsetof(DungeonModelHelper_MakeIntVector, ReturnValue) == 0x00000C, "Member 'DungeonModelHelper_MakeIntVector::ReturnValue' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonModelHelper.MakeVector
// 0x001C (0x001C - 0x0000)
struct DungeonModelHelper_MakeVector final
{
public:
	struct FIntVector                             In;                                                // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonModelHelper_MakeVector) == 0x000004, "Wrong alignment on DungeonModelHelper_MakeVector");
static_assert(sizeof(DungeonModelHelper_MakeVector) == 0x00001C, "Wrong size on DungeonModelHelper_MakeVector");
static_assert(offsetof(DungeonModelHelper_MakeVector, In) == 0x000000, "Member 'DungeonModelHelper_MakeVector::In' has a wrong offset!");
static_assert(offsetof(DungeonModelHelper_MakeVector, Scale) == 0x00000C, "Member 'DungeonModelHelper_MakeVector::Scale' has a wrong offset!");
static_assert(offsetof(DungeonModelHelper_MakeVector, ReturnValue) == 0x000010, "Member 'DungeonModelHelper_MakeVector::ReturnValue' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonNavLinkProxy.SetupSmartLinkData
// 0x001C (0x001C - 0x0000)
struct DungeonNavLinkProxy_SetupSmartLinkData final
{
public:
	struct FVector                                Start;                                             // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                End;                                               // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENavLinkDirection                             Direction;                                         // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DungeonNavLinkProxy_SetupSmartLinkData) == 0x000004, "Wrong alignment on DungeonNavLinkProxy_SetupSmartLinkData");
static_assert(sizeof(DungeonNavLinkProxy_SetupSmartLinkData) == 0x00001C, "Wrong size on DungeonNavLinkProxy_SetupSmartLinkData");
static_assert(offsetof(DungeonNavLinkProxy_SetupSmartLinkData, Start) == 0x000000, "Member 'DungeonNavLinkProxy_SetupSmartLinkData::Start' has a wrong offset!");
static_assert(offsetof(DungeonNavLinkProxy_SetupSmartLinkData, End) == 0x00000C, "Member 'DungeonNavLinkProxy_SetupSmartLinkData::End' has a wrong offset!");
static_assert(offsetof(DungeonNavLinkProxy_SetupSmartLinkData, Direction) == 0x000018, "Member 'DungeonNavLinkProxy_SetupSmartLinkData::Direction' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonQueryUserState.GetBool
// 0x000C (0x000C - 0x0000)
struct DungeonQueryUserState_GetBool final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DungeonQueryUserState_GetBool) == 0x000004, "Wrong alignment on DungeonQueryUserState_GetBool");
static_assert(sizeof(DungeonQueryUserState_GetBool) == 0x00000C, "Wrong size on DungeonQueryUserState_GetBool");
static_assert(offsetof(DungeonQueryUserState_GetBool, Name_0) == 0x000000, "Member 'DungeonQueryUserState_GetBool::Name_0' has a wrong offset!");
static_assert(offsetof(DungeonQueryUserState_GetBool, ReturnValue) == 0x000008, "Member 'DungeonQueryUserState_GetBool::ReturnValue' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonQueryUserState.GetFloat
// 0x000C (0x000C - 0x0000)
struct DungeonQueryUserState_GetFloat final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonQueryUserState_GetFloat) == 0x000004, "Wrong alignment on DungeonQueryUserState_GetFloat");
static_assert(sizeof(DungeonQueryUserState_GetFloat) == 0x00000C, "Wrong size on DungeonQueryUserState_GetFloat");
static_assert(offsetof(DungeonQueryUserState_GetFloat, Name_0) == 0x000000, "Member 'DungeonQueryUserState_GetFloat::Name_0' has a wrong offset!");
static_assert(offsetof(DungeonQueryUserState_GetFloat, ReturnValue) == 0x000008, "Member 'DungeonQueryUserState_GetFloat::ReturnValue' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonQueryUserState.GetInt
// 0x000C (0x000C - 0x0000)
struct DungeonQueryUserState_GetInt final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonQueryUserState_GetInt) == 0x000004, "Wrong alignment on DungeonQueryUserState_GetInt");
static_assert(sizeof(DungeonQueryUserState_GetInt) == 0x00000C, "Wrong size on DungeonQueryUserState_GetInt");
static_assert(offsetof(DungeonQueryUserState_GetInt, Name_0) == 0x000000, "Member 'DungeonQueryUserState_GetInt::Name_0' has a wrong offset!");
static_assert(offsetof(DungeonQueryUserState_GetInt, ReturnValue) == 0x000008, "Member 'DungeonQueryUserState_GetInt::ReturnValue' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonQueryUserState.GetString
// 0x0018 (0x0018 - 0x0000)
struct DungeonQueryUserState_GetString final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonQueryUserState_GetString) == 0x000008, "Wrong alignment on DungeonQueryUserState_GetString");
static_assert(sizeof(DungeonQueryUserState_GetString) == 0x000018, "Wrong size on DungeonQueryUserState_GetString");
static_assert(offsetof(DungeonQueryUserState_GetString, Name_0) == 0x000000, "Member 'DungeonQueryUserState_GetString::Name_0' has a wrong offset!");
static_assert(offsetof(DungeonQueryUserState_GetString, ReturnValue) == 0x000008, "Member 'DungeonQueryUserState_GetString::ReturnValue' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonQueryUserState.GetVector
// 0x0014 (0x0014 - 0x0000)
struct DungeonQueryUserState_GetVector final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonQueryUserState_GetVector) == 0x000004, "Wrong alignment on DungeonQueryUserState_GetVector");
static_assert(sizeof(DungeonQueryUserState_GetVector) == 0x000014, "Wrong size on DungeonQueryUserState_GetVector");
static_assert(offsetof(DungeonQueryUserState_GetVector, Name_0) == 0x000000, "Member 'DungeonQueryUserState_GetVector::Name_0' has a wrong offset!");
static_assert(offsetof(DungeonQueryUserState_GetVector, ReturnValue) == 0x000008, "Member 'DungeonQueryUserState_GetVector::ReturnValue' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonQueryUserState.SetBool
// 0x000C (0x000C - 0x0000)
struct DungeonQueryUserState_SetBool final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DungeonQueryUserState_SetBool) == 0x000004, "Wrong alignment on DungeonQueryUserState_SetBool");
static_assert(sizeof(DungeonQueryUserState_SetBool) == 0x00000C, "Wrong size on DungeonQueryUserState_SetBool");
static_assert(offsetof(DungeonQueryUserState_SetBool, Name_0) == 0x000000, "Member 'DungeonQueryUserState_SetBool::Name_0' has a wrong offset!");
static_assert(offsetof(DungeonQueryUserState_SetBool, Value) == 0x000008, "Member 'DungeonQueryUserState_SetBool::Value' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonQueryUserState.SetFloat
// 0x000C (0x000C - 0x0000)
struct DungeonQueryUserState_SetFloat final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonQueryUserState_SetFloat) == 0x000004, "Wrong alignment on DungeonQueryUserState_SetFloat");
static_assert(sizeof(DungeonQueryUserState_SetFloat) == 0x00000C, "Wrong size on DungeonQueryUserState_SetFloat");
static_assert(offsetof(DungeonQueryUserState_SetFloat, Name_0) == 0x000000, "Member 'DungeonQueryUserState_SetFloat::Name_0' has a wrong offset!");
static_assert(offsetof(DungeonQueryUserState_SetFloat, Value) == 0x000008, "Member 'DungeonQueryUserState_SetFloat::Value' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonQueryUserState.SetInt
// 0x000C (0x000C - 0x0000)
struct DungeonQueryUserState_SetInt final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonQueryUserState_SetInt) == 0x000004, "Wrong alignment on DungeonQueryUserState_SetInt");
static_assert(sizeof(DungeonQueryUserState_SetInt) == 0x00000C, "Wrong size on DungeonQueryUserState_SetInt");
static_assert(offsetof(DungeonQueryUserState_SetInt, Name_0) == 0x000000, "Member 'DungeonQueryUserState_SetInt::Name_0' has a wrong offset!");
static_assert(offsetof(DungeonQueryUserState_SetInt, Value) == 0x000008, "Member 'DungeonQueryUserState_SetInt::Value' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonQueryUserState.SetString
// 0x0018 (0x0018 - 0x0000)
struct DungeonQueryUserState_SetString final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonQueryUserState_SetString) == 0x000008, "Wrong alignment on DungeonQueryUserState_SetString");
static_assert(sizeof(DungeonQueryUserState_SetString) == 0x000018, "Wrong size on DungeonQueryUserState_SetString");
static_assert(offsetof(DungeonQueryUserState_SetString, Name_0) == 0x000000, "Member 'DungeonQueryUserState_SetString::Name_0' has a wrong offset!");
static_assert(offsetof(DungeonQueryUserState_SetString, Value) == 0x000008, "Member 'DungeonQueryUserState_SetString::Value' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonQueryUserState.SetVector
// 0x0014 (0x0014 - 0x0000)
struct DungeonQueryUserState_SetVector final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Value;                                             // 0x0008(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonQueryUserState_SetVector) == 0x000004, "Wrong alignment on DungeonQueryUserState_SetVector");
static_assert(sizeof(DungeonQueryUserState_SetVector) == 0x000014, "Wrong size on DungeonQueryUserState_SetVector");
static_assert(offsetof(DungeonQueryUserState_SetVector, Name_0) == 0x000000, "Member 'DungeonQueryUserState_SetVector::Name_0' has a wrong offset!");
static_assert(offsetof(DungeonQueryUserState_SetVector, Value) == 0x000008, "Member 'DungeonQueryUserState_SetVector::Value' has a wrong offset!");

// Function DungeonArchitectRuntime.SnapMapDungeonTransformLogic.GetNodeOffset
// 0x0040 (0x0040 - 0x0000)
struct SnapMapDungeonTransformLogic_GetNodeOffset final
{
public:
	class USnapMapDungeonModel*                   Model;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Offset;                                            // 0x0010(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapMapDungeonTransformLogic_GetNodeOffset) == 0x000010, "Wrong alignment on SnapMapDungeonTransformLogic_GetNodeOffset");
static_assert(sizeof(SnapMapDungeonTransformLogic_GetNodeOffset) == 0x000040, "Wrong size on SnapMapDungeonTransformLogic_GetNodeOffset");
static_assert(offsetof(SnapMapDungeonTransformLogic_GetNodeOffset, Model) == 0x000000, "Member 'SnapMapDungeonTransformLogic_GetNodeOffset::Model' has a wrong offset!");
static_assert(offsetof(SnapMapDungeonTransformLogic_GetNodeOffset, Offset) == 0x000010, "Member 'SnapMapDungeonTransformLogic_GetNodeOffset::Offset' has a wrong offset!");

// Function DungeonArchitectRuntime.DungeonSpawnLogic.OnItemSpawn
// 0x0010 (0x0010 - 0x0000)
struct DungeonSpawnLogic_OnItemSpawn final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ADungeon*                               Dungeon;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DungeonSpawnLogic_OnItemSpawn) == 0x000008, "Wrong alignment on DungeonSpawnLogic_OnItemSpawn");
static_assert(sizeof(DungeonSpawnLogic_OnItemSpawn) == 0x000010, "Wrong size on DungeonSpawnLogic_OnItemSpawn");
static_assert(offsetof(DungeonSpawnLogic_OnItemSpawn, Actor) == 0x000000, "Member 'DungeonSpawnLogic_OnItemSpawn::Actor' has a wrong offset!");
static_assert(offsetof(DungeonSpawnLogic_OnItemSpawn, Dungeon) == 0x000008, "Member 'DungeonSpawnLogic_OnItemSpawn::Dungeon' has a wrong offset!");

// Function DungeonArchitectRuntime.FloorPlanSelectorLogic.SelectNode
// 0x0028 (0x0028 - 0x0000)
struct FloorPlanSelectorLogic_SelectNode final
{
public:
	class UFloorPlanModel*                        Model;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFloorPlanConfig*                       Config;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRandomStream                          RandomStream;                                      // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         GridX;                                             // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GridY;                                             // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GridZ;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FloorPlanSelectorLogic_SelectNode) == 0x000008, "Wrong alignment on FloorPlanSelectorLogic_SelectNode");
static_assert(sizeof(FloorPlanSelectorLogic_SelectNode) == 0x000028, "Wrong size on FloorPlanSelectorLogic_SelectNode");
static_assert(offsetof(FloorPlanSelectorLogic_SelectNode, Model) == 0x000000, "Member 'FloorPlanSelectorLogic_SelectNode::Model' has a wrong offset!");
static_assert(offsetof(FloorPlanSelectorLogic_SelectNode, Config) == 0x000008, "Member 'FloorPlanSelectorLogic_SelectNode::Config' has a wrong offset!");
static_assert(offsetof(FloorPlanSelectorLogic_SelectNode, RandomStream) == 0x000010, "Member 'FloorPlanSelectorLogic_SelectNode::RandomStream' has a wrong offset!");
static_assert(offsetof(FloorPlanSelectorLogic_SelectNode, GridX) == 0x000018, "Member 'FloorPlanSelectorLogic_SelectNode::GridX' has a wrong offset!");
static_assert(offsetof(FloorPlanSelectorLogic_SelectNode, GridY) == 0x00001C, "Member 'FloorPlanSelectorLogic_SelectNode::GridY' has a wrong offset!");
static_assert(offsetof(FloorPlanSelectorLogic_SelectNode, GridZ) == 0x000020, "Member 'FloorPlanSelectorLogic_SelectNode::GridZ' has a wrong offset!");
static_assert(offsetof(FloorPlanSelectorLogic_SelectNode, ReturnValue) == 0x000024, "Member 'FloorPlanSelectorLogic_SelectNode::ReturnValue' has a wrong offset!");

// Function DungeonArchitectRuntime.FloorPlanTransformLogic.GetNodeOffset
// 0x0050 (0x0050 - 0x0000)
struct FloorPlanTransformLogic_GetNodeOffset final
{
public:
	class UFloorPlanModel*                        Model;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFloorPlanConfig*                       Config;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRandomStream                          RandomStream;                                      // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         GridX;                                             // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GridY;                                             // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             Offset;                                            // 0x0020(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FloorPlanTransformLogic_GetNodeOffset) == 0x000010, "Wrong alignment on FloorPlanTransformLogic_GetNodeOffset");
static_assert(sizeof(FloorPlanTransformLogic_GetNodeOffset) == 0x000050, "Wrong size on FloorPlanTransformLogic_GetNodeOffset");
static_assert(offsetof(FloorPlanTransformLogic_GetNodeOffset, Model) == 0x000000, "Member 'FloorPlanTransformLogic_GetNodeOffset::Model' has a wrong offset!");
static_assert(offsetof(FloorPlanTransformLogic_GetNodeOffset, Config) == 0x000008, "Member 'FloorPlanTransformLogic_GetNodeOffset::Config' has a wrong offset!");
static_assert(offsetof(FloorPlanTransformLogic_GetNodeOffset, RandomStream) == 0x000010, "Member 'FloorPlanTransformLogic_GetNodeOffset::RandomStream' has a wrong offset!");
static_assert(offsetof(FloorPlanTransformLogic_GetNodeOffset, GridX) == 0x000018, "Member 'FloorPlanTransformLogic_GetNodeOffset::GridX' has a wrong offset!");
static_assert(offsetof(FloorPlanTransformLogic_GetNodeOffset, GridY) == 0x00001C, "Member 'FloorPlanTransformLogic_GetNodeOffset::GridY' has a wrong offset!");
static_assert(offsetof(FloorPlanTransformLogic_GetNodeOffset, Offset) == 0x000020, "Member 'FloorPlanTransformLogic_GetNodeOffset::Offset' has a wrong offset!");

// Function DungeonArchitectRuntime.FlowAbstractNode.ContainsItem
// 0x000C (0x000C - 0x0000)
struct FlowAbstractNode_ContainsItem final
{
public:
	EFlowGraphItemType                            ItemType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count;                                             // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FlowAbstractNode_ContainsItem) == 0x000004, "Wrong alignment on FlowAbstractNode_ContainsItem");
static_assert(sizeof(FlowAbstractNode_ContainsItem) == 0x00000C, "Wrong size on FlowAbstractNode_ContainsItem");
static_assert(offsetof(FlowAbstractNode_ContainsItem, ItemType) == 0x000000, "Member 'FlowAbstractNode_ContainsItem::ItemType' has a wrong offset!");
