#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicObject

#include "Basic.hpp"


namespace SDK::Params
{

// Function DynamicObject.DynamicObject_C.SetupInShadow
// 0x0048 (0x0048 - 0x0000)
struct DynamicObject_C_SetupInShadow final
{
public:
	int32                                         ___int_Array_Index_Variable;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0010(0x0010)(ReferenceParm)
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      K2Node_DynamicCast_As____;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DynamicObject_C_SetupInShadow) == 0x000008, "Wrong alignment on DynamicObject_C_SetupInShadow");
static_assert(sizeof(DynamicObject_C_SetupInShadow) == 0x000048, "Wrong size on DynamicObject_C_SetupInShadow");
static_assert(offsetof(DynamicObject_C_SetupInShadow, ___int_Array_Index_Variable) == 0x000000, "Member 'DynamicObject_C_SetupInShadow::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DynamicObject_C_SetupInShadow, ___int_Loop_Counter_Variable) == 0x000004, "Member 'DynamicObject_C_SetupInShadow::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DynamicObject_C_SetupInShadow, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'DynamicObject_C_SetupInShadow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DynamicObject_C_SetupInShadow, CallFunc_GetMaterials_ReturnValue) == 0x000010, "Member 'DynamicObject_C_SetupInShadow::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(DynamicObject_C_SetupInShadow, CallFunc_Array_Get_Item) == 0x000020, "Member 'DynamicObject_C_SetupInShadow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DynamicObject_C_SetupInShadow, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'DynamicObject_C_SetupInShadow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DynamicObject_C_SetupInShadow, K2Node_DynamicCast_As____) == 0x000030, "Member 'DynamicObject_C_SetupInShadow::K2Node_DynamicCast_As____' has a wrong offset!");
static_assert(offsetof(DynamicObject_C_SetupInShadow, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'DynamicObject_C_SetupInShadow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DynamicObject_C_SetupInShadow, CallFunc_Less_IntInt_ReturnValue) == 0x000039, "Member 'DynamicObject_C_SetupInShadow::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DynamicObject_C_SetupInShadow, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000040, "Member 'DynamicObject_C_SetupInShadow::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function DynamicObject.DynamicObject_C.¾n!‹
// 0x0018 (0x0018 - 0x0000)
struct DynamicObject_C__n__ final
{
public:
	class UInstancedStaticMeshComponent*          _e__;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InputInstanced;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_CollisionType_TypeName;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DynamicObject_C__n__) == 0x000008, "Wrong alignment on DynamicObject_C__n__");
static_assert(sizeof(DynamicObject_C__n__) == 0x000018, "Wrong size on DynamicObject_C__n__");
static_assert(offsetof(DynamicObject_C__n__, _e__) == 0x000000, "Member 'DynamicObject_C__n__::_e__' has a wrong offset!");
static_assert(offsetof(DynamicObject_C__n__, InputInstanced) == 0x000008, "Member 'DynamicObject_C__n__::InputInstanced' has a wrong offset!");
static_assert(offsetof(DynamicObject_C__n__, CallFunc_CollisionType_TypeName) == 0x000010, "Member 'DynamicObject_C__n__::CallFunc_CollisionType_TypeName' has a wrong offset!");

// Function DynamicObject.DynamicObject_C.SetupInstanceLOD
// 0x0004 (0x0004 - 0x0000)
struct DynamicObject_C_SetupInstanceLOD final
{
public:
	float                                         NewCullDistance;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DynamicObject_C_SetupInstanceLOD) == 0x000004, "Wrong alignment on DynamicObject_C_SetupInstanceLOD");
static_assert(sizeof(DynamicObject_C_SetupInstanceLOD) == 0x000004, "Wrong size on DynamicObject_C_SetupInstanceLOD");
static_assert(offsetof(DynamicObject_C_SetupInstanceLOD, NewCullDistance) == 0x000000, "Member 'DynamicObject_C_SetupInstanceLOD::NewCullDistance' has a wrong offset!");

// Function DynamicObject.DynamicObject_C.ConstructInstance
// 0x0060 (0x0060 - 0x0000)
struct DynamicObject_C_ConstructInstance final
{
public:
	int32                                         ___int_Array_Index_Variable;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_AddInstances_ReturnValue;                 // 0x0010(0x0010)(ReferenceParm)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0020(0x0010)(ReferenceParm)
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_DynamicCast_As____;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DynamicObject_C_ConstructInstance) == 0x000008, "Wrong alignment on DynamicObject_C_ConstructInstance");
static_assert(sizeof(DynamicObject_C_ConstructInstance) == 0x000060, "Wrong size on DynamicObject_C_ConstructInstance");
static_assert(offsetof(DynamicObject_C_ConstructInstance, ___int_Array_Index_Variable) == 0x000000, "Member 'DynamicObject_C_ConstructInstance::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DynamicObject_C_ConstructInstance, ___int_Loop_Counter_Variable) == 0x000004, "Member 'DynamicObject_C_ConstructInstance::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DynamicObject_C_ConstructInstance, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'DynamicObject_C_ConstructInstance::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DynamicObject_C_ConstructInstance, CallFunc_AddInstances_ReturnValue) == 0x000010, "Member 'DynamicObject_C_ConstructInstance::CallFunc_AddInstances_ReturnValue' has a wrong offset!");
static_assert(offsetof(DynamicObject_C_ConstructInstance, CallFunc_GetMaterials_ReturnValue) == 0x000020, "Member 'DynamicObject_C_ConstructInstance::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(DynamicObject_C_ConstructInstance, CallFunc_Array_Get_Item) == 0x000030, "Member 'DynamicObject_C_ConstructInstance::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DynamicObject_C_ConstructInstance, K2Node_DynamicCast_As____) == 0x000038, "Member 'DynamicObject_C_ConstructInstance::K2Node_DynamicCast_As____' has a wrong offset!");
static_assert(offsetof(DynamicObject_C_ConstructInstance, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'DynamicObject_C_ConstructInstance::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DynamicObject_C_ConstructInstance, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'DynamicObject_C_ConstructInstance::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DynamicObject_C_ConstructInstance, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'DynamicObject_C_ConstructInstance::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DynamicObject_C_ConstructInstance, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000050, "Member 'DynamicObject_C_ConstructInstance::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(DynamicObject_C_ConstructInstance, CallFunc_SetStaticMesh_ReturnValue) == 0x000058, "Member 'DynamicObject_C_ConstructInstance::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function DynamicObject.DynamicObject_C.ExecuteUbergraph_DynamicObject
// 0x0004 (0x0004 - 0x0000)
struct DynamicObject_C_ExecuteUbergraph_DynamicObject final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DynamicObject_C_ExecuteUbergraph_DynamicObject) == 0x000004, "Wrong alignment on DynamicObject_C_ExecuteUbergraph_DynamicObject");
static_assert(sizeof(DynamicObject_C_ExecuteUbergraph_DynamicObject) == 0x000004, "Wrong size on DynamicObject_C_ExecuteUbergraph_DynamicObject");
static_assert(offsetof(DynamicObject_C_ExecuteUbergraph_DynamicObject, EntryPoint) == 0x000000, "Member 'DynamicObject_C_ExecuteUbergraph_DynamicObject::EntryPoint' has a wrong offset!");

}

