#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicObject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CollisionType_Enum_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass DynamicObject.DynamicObject_C
// 0x0050 (0x0278 - 0x0228)
class ADynamicObject_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    BillBoard;                                         // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorShadowMapMask*                    ActorShadowMapMask;                                // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh;                               // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Mesh;                                              // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Material;                                          // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CullDistance;                                      // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InShadow;                                          // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTransform>                     MeshPosition;                                      // 0x0260(0x0010)(Edit, BlueprintVisible)
	bool                                          CastShadow;                                        // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          _9__;                                              // 0x0271(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionType_Enum                           ____;                                              // 0x0272(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetupInShadow();
	void _n__(class UInstancedStaticMeshComponent* _e__);
	void SetupInstanceLOD(float NewCullDistance);
	void ConstructInstance();
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_DynamicObject(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DynamicObject_C">();
	}
	static class ADynamicObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADynamicObject_C>();
	}
};
static_assert(alignof(ADynamicObject_C) == 0x000008, "Wrong alignment on ADynamicObject_C");
static_assert(sizeof(ADynamicObject_C) == 0x000278, "Wrong size on ADynamicObject_C");
static_assert(offsetof(ADynamicObject_C, UberGraphFrame) == 0x000228, "Member 'ADynamicObject_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADynamicObject_C, BillBoard) == 0x000230, "Member 'ADynamicObject_C::BillBoard' has a wrong offset!");
static_assert(offsetof(ADynamicObject_C, ActorShadowMapMask) == 0x000238, "Member 'ADynamicObject_C::ActorShadowMapMask' has a wrong offset!");
static_assert(offsetof(ADynamicObject_C, InstancedStaticMesh) == 0x000240, "Member 'ADynamicObject_C::InstancedStaticMesh' has a wrong offset!");
static_assert(offsetof(ADynamicObject_C, Mesh) == 0x000248, "Member 'ADynamicObject_C::Mesh' has a wrong offset!");
static_assert(offsetof(ADynamicObject_C, Material) == 0x000250, "Member 'ADynamicObject_C::Material' has a wrong offset!");
static_assert(offsetof(ADynamicObject_C, CullDistance) == 0x000258, "Member 'ADynamicObject_C::CullDistance' has a wrong offset!");
static_assert(offsetof(ADynamicObject_C, InShadow) == 0x00025C, "Member 'ADynamicObject_C::InShadow' has a wrong offset!");
static_assert(offsetof(ADynamicObject_C, MeshPosition) == 0x000260, "Member 'ADynamicObject_C::MeshPosition' has a wrong offset!");
static_assert(offsetof(ADynamicObject_C, CastShadow) == 0x000270, "Member 'ADynamicObject_C::CastShadow' has a wrong offset!");
static_assert(offsetof(ADynamicObject_C, _9__) == 0x000271, "Member 'ADynamicObject_C::_9__' has a wrong offset!");
static_assert(offsetof(ADynamicObject_C, ____) == 0x000272, "Member 'ADynamicObject_C::____' has a wrong offset!");

}

