#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EasyAR

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EasyAR.EasyARCamera.AddShowActor
// 0x0008 (0x0008 - 0x0000)
struct EasyARCamera_AddShowActor final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EasyARCamera_AddShowActor) == 0x000008, "Wrong alignment on EasyARCamera_AddShowActor");
static_assert(sizeof(EasyARCamera_AddShowActor) == 0x000008, "Wrong size on EasyARCamera_AddShowActor");
static_assert(offsetof(EasyARCamera_AddShowActor, InActor) == 0x000000, "Member 'EasyARCamera_AddShowActor::InActor' has a wrong offset!");

// Function EasyAR.EasyARCamera.DelShowActor
// 0x0008 (0x0008 - 0x0000)
struct EasyARCamera_DelShowActor final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EasyARCamera_DelShowActor) == 0x000008, "Wrong alignment on EasyARCamera_DelShowActor");
static_assert(sizeof(EasyARCamera_DelShowActor) == 0x000008, "Wrong size on EasyARCamera_DelShowActor");
static_assert(offsetof(EasyARCamera_DelShowActor, InActor) == 0x000000, "Member 'EasyARCamera_DelShowActor::InActor' has a wrong offset!");

// Function EasyAR.EasyARCamera.GetFov
// 0x0004 (0x0004 - 0x0000)
struct EasyARCamera_GetFov final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EasyARCamera_GetFov) == 0x000004, "Wrong alignment on EasyARCamera_GetFov");
static_assert(sizeof(EasyARCamera_GetFov) == 0x000004, "Wrong size on EasyARCamera_GetFov");
static_assert(offsetof(EasyARCamera_GetFov, ReturnValue) == 0x000000, "Member 'EasyARCamera_GetFov::ReturnValue' has a wrong offset!");

// Function EasyAR.EasyARCamera.GetSceneCapture
// 0x0008 (0x0008 - 0x0000)
struct EasyARCamera_GetSceneCapture final
{
public:
	class USceneCaptureComponent2D*               ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EasyARCamera_GetSceneCapture) == 0x000008, "Wrong alignment on EasyARCamera_GetSceneCapture");
static_assert(sizeof(EasyARCamera_GetSceneCapture) == 0x000008, "Wrong size on EasyARCamera_GetSceneCapture");
static_assert(offsetof(EasyARCamera_GetSceneCapture, ReturnValue) == 0x000000, "Member 'EasyARCamera_GetSceneCapture::ReturnValue' has a wrong offset!");

// Function EasyAR.EasyARCamera.HitTest
// 0x0008 (0x0008 - 0x0000)
struct EasyARCamera_HitTest final
{
public:
	struct FVector2D                              InHitPixelPosition;                                // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EasyARCamera_HitTest) == 0x000004, "Wrong alignment on EasyARCamera_HitTest");
static_assert(sizeof(EasyARCamera_HitTest) == 0x000008, "Wrong size on EasyARCamera_HitTest");
static_assert(offsetof(EasyARCamera_HitTest, InHitPixelPosition) == 0x000000, "Member 'EasyARCamera_HitTest::InHitPixelPosition' has a wrong offset!");

// Function EasyAR.EasyARCamera.SetAutoModeDis
// 0x0004 (0x0004 - 0x0000)
struct EasyARCamera_SetAutoModeDis final
{
public:
	int32                                         NAutoModeDis;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EasyARCamera_SetAutoModeDis) == 0x000004, "Wrong alignment on EasyARCamera_SetAutoModeDis");
static_assert(sizeof(EasyARCamera_SetAutoModeDis) == 0x000004, "Wrong size on EasyARCamera_SetAutoModeDis");
static_assert(offsetof(EasyARCamera_SetAutoModeDis, NAutoModeDis) == 0x000000, "Member 'EasyARCamera_SetAutoModeDis::NAutoModeDis' has a wrong offset!");

// Function EasyAR.EasyARCamera.SetFov
// 0x0004 (0x0004 - 0x0000)
struct EasyARCamera_SetFov final
{
public:
	float                                         FFov;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EasyARCamera_SetFov) == 0x000004, "Wrong alignment on EasyARCamera_SetFov");
static_assert(sizeof(EasyARCamera_SetFov) == 0x000004, "Wrong size on EasyARCamera_SetFov");
static_assert(offsetof(EasyARCamera_SetFov, FFov) == 0x000000, "Member 'EasyARCamera_SetFov::FFov' has a wrong offset!");

// Function EasyAR.EasyARCamera.SetLevelRenderIsOpen
// 0x0001 (0x0001 - 0x0000)
struct EasyARCamera_SetLevelRenderIsOpen final
{
public:
	bool                                          bIsOpen;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EasyARCamera_SetLevelRenderIsOpen) == 0x000001, "Wrong alignment on EasyARCamera_SetLevelRenderIsOpen");
static_assert(sizeof(EasyARCamera_SetLevelRenderIsOpen) == 0x000001, "Wrong size on EasyARCamera_SetLevelRenderIsOpen");
static_assert(offsetof(EasyARCamera_SetLevelRenderIsOpen, bIsOpen) == 0x000000, "Member 'EasyARCamera_SetLevelRenderIsOpen::bIsOpen' has a wrong offset!");

// Function EasyAR.EasyARCamera.SetPreview
// 0x0010 (0x0010 - 0x0000)
struct EasyARCamera_SetPreview final
{
public:
	class AActor*                                 ShellActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ShowActor;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EasyARCamera_SetPreview) == 0x000008, "Wrong alignment on EasyARCamera_SetPreview");
static_assert(sizeof(EasyARCamera_SetPreview) == 0x000010, "Wrong size on EasyARCamera_SetPreview");
static_assert(offsetof(EasyARCamera_SetPreview, ShellActor) == 0x000000, "Member 'EasyARCamera_SetPreview::ShellActor' has a wrong offset!");
static_assert(offsetof(EasyARCamera_SetPreview, ShowActor) == 0x000008, "Member 'EasyARCamera_SetPreview::ShowActor' has a wrong offset!");

// Function EasyAR.EasyARCamera.Start
// 0x0010 (0x0010 - 0x0000)
struct EasyARCamera_Start final
{
public:
	int32                                         NAutoModeDis;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyCheckSupportAr;                               // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NBuffCap;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLowQuality;                                       // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRenderClose;                                      // 0x000D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EasyARCamera_Start) == 0x000004, "Wrong alignment on EasyARCamera_Start");
static_assert(sizeof(EasyARCamera_Start) == 0x000010, "Wrong size on EasyARCamera_Start");
static_assert(offsetof(EasyARCamera_Start, NAutoModeDis) == 0x000000, "Member 'EasyARCamera_Start::NAutoModeDis' has a wrong offset!");
static_assert(offsetof(EasyARCamera_Start, bOnlyCheckSupportAr) == 0x000004, "Member 'EasyARCamera_Start::bOnlyCheckSupportAr' has a wrong offset!");
static_assert(offsetof(EasyARCamera_Start, NBuffCap) == 0x000008, "Member 'EasyARCamera_Start::NBuffCap' has a wrong offset!");
static_assert(offsetof(EasyARCamera_Start, bLowQuality) == 0x00000C, "Member 'EasyARCamera_Start::bLowQuality' has a wrong offset!");
static_assert(offsetof(EasyARCamera_Start, bRenderClose) == 0x00000D, "Member 'EasyARCamera_Start::bRenderClose' has a wrong offset!");

// Function EasyAR.EasyARCamera.GetPreviewActor
// 0x0008 (0x0008 - 0x0000)
struct EasyARCamera_GetPreviewActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EasyARCamera_GetPreviewActor) == 0x000008, "Wrong alignment on EasyARCamera_GetPreviewActor");
static_assert(sizeof(EasyARCamera_GetPreviewActor) == 0x000008, "Wrong size on EasyARCamera_GetPreviewActor");
static_assert(offsetof(EasyARCamera_GetPreviewActor, ReturnValue) == 0x000000, "Member 'EasyARCamera_GetPreviewActor::ReturnValue' has a wrong offset!");

}

