#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EasyAR

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class EasyAR.EasyARCamera
// 0x00A0 (0x02E0 - 0x0240)
class AEasyARCamera : public ASceneCapture2D
{
public:
	class UTextureRenderTarget2D*                 CameraImageRenderTarget;                           // 0x0240(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         PlaneIndicatorClassPath;                           // 0x0248(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPortrait;                                         // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ARWorldOrigin;                                     // 0x0264(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnInitializeResult;                                // 0x0270(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnSpawnPreviewActor;                               // 0x0280(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnHitPreviewActor;                                 // 0x0290(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnStateChanged;                                    // 0x02A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnPlaneChanged;                                    // 0x02B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AEasyARPlaneIndicator*                  PlaneIndicatorActor;                               // 0x02C0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C8[0x18];                                     // 0x02C8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddShowActor(class AActor* InActor);
	void ClearPreviewActor();
	void DelShowActor(class AActor* InActor);
	float GetFov();
	class USceneCaptureComponent2D* GetSceneCapture();
	void HitTest(const struct FVector2D& InHitPixelPosition);
	void ResetHideActors2Visible();
	void SetAutoModeDis(int32 NAutoModeDis);
	void SetFov(float FFov);
	void SetLevelRenderIsOpen(bool bIsOpen);
	void SetPreview(class AActor* ShellActor, class AActor* ShowActor);
	void Start(int32 NAutoModeDis, bool bOnlyCheckSupportAr, int32 NBuffCap, bool bLowQuality, bool bRenderClose);

	class AActor* GetPreviewActor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EasyARCamera">();
	}
	static class AEasyARCamera* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEasyARCamera>();
	}
};
static_assert(alignof(AEasyARCamera) == 0x000008, "Wrong alignment on AEasyARCamera");
static_assert(sizeof(AEasyARCamera) == 0x0002E0, "Wrong size on AEasyARCamera");
static_assert(offsetof(AEasyARCamera, CameraImageRenderTarget) == 0x000240, "Member 'AEasyARCamera::CameraImageRenderTarget' has a wrong offset!");
static_assert(offsetof(AEasyARCamera, PlaneIndicatorClassPath) == 0x000248, "Member 'AEasyARCamera::PlaneIndicatorClassPath' has a wrong offset!");
static_assert(offsetof(AEasyARCamera, bPortrait) == 0x000260, "Member 'AEasyARCamera::bPortrait' has a wrong offset!");
static_assert(offsetof(AEasyARCamera, ARWorldOrigin) == 0x000264, "Member 'AEasyARCamera::ARWorldOrigin' has a wrong offset!");
static_assert(offsetof(AEasyARCamera, OnInitializeResult) == 0x000270, "Member 'AEasyARCamera::OnInitializeResult' has a wrong offset!");
static_assert(offsetof(AEasyARCamera, OnSpawnPreviewActor) == 0x000280, "Member 'AEasyARCamera::OnSpawnPreviewActor' has a wrong offset!");
static_assert(offsetof(AEasyARCamera, OnHitPreviewActor) == 0x000290, "Member 'AEasyARCamera::OnHitPreviewActor' has a wrong offset!");
static_assert(offsetof(AEasyARCamera, OnStateChanged) == 0x0002A0, "Member 'AEasyARCamera::OnStateChanged' has a wrong offset!");
static_assert(offsetof(AEasyARCamera, OnPlaneChanged) == 0x0002B0, "Member 'AEasyARCamera::OnPlaneChanged' has a wrong offset!");
static_assert(offsetof(AEasyARCamera, PlaneIndicatorActor) == 0x0002C0, "Member 'AEasyARCamera::PlaneIndicatorActor' has a wrong offset!");

// Class EasyAR.EasyARPlaneIndicator
// 0x0010 (0x0238 - 0x0228)
class AEasyARPlaneIndicator final : public AActor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHierarchicalInstancedStaticMeshComponent* HISMComponent;                                     // 0x0230(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EasyARPlaneIndicator">();
	}
	static class AEasyARPlaneIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEasyARPlaneIndicator>();
	}
};
static_assert(alignof(AEasyARPlaneIndicator) == 0x000008, "Wrong alignment on AEasyARPlaneIndicator");
static_assert(sizeof(AEasyARPlaneIndicator) == 0x000238, "Wrong size on AEasyARPlaneIndicator");
static_assert(offsetof(AEasyARPlaneIndicator, DefaultSceneRoot) == 0x000228, "Member 'AEasyARPlaneIndicator::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AEasyARPlaneIndicator, HISMComponent) == 0x000230, "Member 'AEasyARPlaneIndicator::HISMComponent' has a wrong offset!");

// Class EasyAR.EasyARSettings
// 0x0010 (0x0038 - 0x0028)
class UEasyARSettings final : public UObject
{
public:
	TArray<class FString>                         AppKeys;                                           // 0x0028(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EasyARSettings">();
	}
	static class UEasyARSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyARSettings>();
	}
};
static_assert(alignof(UEasyARSettings) == 0x000008, "Wrong alignment on UEasyARSettings");
static_assert(sizeof(UEasyARSettings) == 0x000038, "Wrong size on UEasyARSettings");
static_assert(offsetof(UEasyARSettings, AppKeys) == 0x000028, "Member 'UEasyARSettings::AppKeys' has a wrong offset!");

}

