#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Effect_girl_004b_Shield

#include "Basic.hpp"


namespace SDK::Params
{

// Function Effect_girl_004b_Shield.Effect_girl_004b_Shield_C.K2_OnOwnerModifierOverlaidChange
// 0x0008 (0x0008 - 0x0000)
struct Effect_girl_004b_Shield_C_K2_OnOwnerModifierOverlaidChange final
{
public:
	int32                                         PreModifierOverliadNum;                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurModifierOverlaidNum;                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_girl_004b_Shield_C_K2_OnOwnerModifierOverlaidChange) == 0x000004, "Wrong alignment on Effect_girl_004b_Shield_C_K2_OnOwnerModifierOverlaidChange");
static_assert(sizeof(Effect_girl_004b_Shield_C_K2_OnOwnerModifierOverlaidChange) == 0x000008, "Wrong size on Effect_girl_004b_Shield_C_K2_OnOwnerModifierOverlaidChange");
static_assert(offsetof(Effect_girl_004b_Shield_C_K2_OnOwnerModifierOverlaidChange, PreModifierOverliadNum) == 0x000000, "Member 'Effect_girl_004b_Shield_C_K2_OnOwnerModifierOverlaidChange::PreModifierOverliadNum' has a wrong offset!");
static_assert(offsetof(Effect_girl_004b_Shield_C_K2_OnOwnerModifierOverlaidChange, CurModifierOverlaidNum) == 0x000004, "Member 'Effect_girl_004b_Shield_C_K2_OnOwnerModifierOverlaidChange::CurModifierOverlaidNum' has a wrong offset!");

// Function Effect_girl_004b_Shield.Effect_girl_004b_Shield_C.ModifierOverliadChange
// 0x0004 (0x0004 - 0x0000)
struct Effect_girl_004b_Shield_C_ModifierOverliadChange final
{
public:
	int32                                         CurrentOverlaid;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_girl_004b_Shield_C_ModifierOverliadChange) == 0x000004, "Wrong alignment on Effect_girl_004b_Shield_C_ModifierOverliadChange");
static_assert(sizeof(Effect_girl_004b_Shield_C_ModifierOverliadChange) == 0x000004, "Wrong size on Effect_girl_004b_Shield_C_ModifierOverliadChange");
static_assert(offsetof(Effect_girl_004b_Shield_C_ModifierOverliadChange, CurrentOverlaid) == 0x000000, "Member 'Effect_girl_004b_Shield_C_ModifierOverliadChange::CurrentOverlaid' has a wrong offset!");

// Function Effect_girl_004b_Shield.Effect_girl_004b_Shield_C.ExecuteUbergraph_Effect_girl_004b_Shield
// 0x0050 (0x0050 - 0x0000)
struct Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PreModifierOverliadNum;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_CurModifierOverlaidNum;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_CurrentOverlaid;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnGameNiagaraAttached_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStandalone_ReturnValue;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStandalone_ReturnValue_1;               // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnGameNiagaraAttached_ReturnValue_1;   // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield) == 0x000008, "Wrong alignment on Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield");
static_assert(sizeof(Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield) == 0x000050, "Wrong size on Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield");
static_assert(offsetof(Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield, EntryPoint) == 0x000000, "Member 'Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield::EntryPoint' has a wrong offset!");
static_assert(offsetof(Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield, K2Node_Event_PreModifierOverliadNum) == 0x000010, "Member 'Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield::K2Node_Event_PreModifierOverliadNum' has a wrong offset!");
static_assert(offsetof(Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield, K2Node_Event_CurModifierOverlaidNum) == 0x000014, "Member 'Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield::K2Node_Event_CurModifierOverlaidNum' has a wrong offset!");
static_assert(offsetof(Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield, K2Node_CustomEvent_CurrentOverlaid) == 0x000018, "Member 'Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield::K2Node_CustomEvent_CurrentOverlaid' has a wrong offset!");
static_assert(offsetof(Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000020, "Member 'Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000028, "Member 'Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield, CallFunc_SpawnGameNiagaraAttached_ReturnValue) == 0x000030, "Member 'Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield::CallFunc_SpawnGameNiagaraAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield, CallFunc_IsStandalone_ReturnValue) == 0x000038, "Member 'Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield::CallFunc_IsStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield, CallFunc_HasAuthority_ReturnValue) == 0x00003A, "Member 'Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield, CallFunc_IsStandalone_ReturnValue_1) == 0x00003B, "Member 'Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield::CallFunc_IsStandalone_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield, CallFunc_BooleanAND_ReturnValue) == 0x00003C, "Member 'Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield, CallFunc_Not_PreBool_ReturnValue_1) == 0x00003D, "Member 'Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield, CallFunc_HasAuthority_ReturnValue_1) == 0x00003E, "Member 'Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield, CallFunc_BooleanAND_ReturnValue_1) == 0x00003F, "Member 'Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield, CallFunc_GetOwner_ReturnValue_1) == 0x000040, "Member 'Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield, CallFunc_SpawnGameNiagaraAttached_ReturnValue_1) == 0x000048, "Member 'Effect_girl_004b_Shield_C_ExecuteUbergraph_Effect_girl_004b_Shield::CallFunc_SpawnGameNiagaraAttached_ReturnValue_1' has a wrong offset!");

}

