#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Effect_girl006a_skill01_Buff_KnifeAnim

#include "Basic.hpp"


namespace SDK::Params
{

// Function Effect_girl006a_skill01_Buff_KnifeAnim.Effect_girl006a_skill01_Buff_KnifeAnim_C.OnNotifyEnd_D3BD0A294D38A1FAD1E5F9BD4E438272
// 0x0008 (0x0008 - 0x0000)
struct Effect_girl006a_skill01_Buff_KnifeAnim_C_OnNotifyEnd_D3BD0A294D38A1FAD1E5F9BD4E438272 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_girl006a_skill01_Buff_KnifeAnim_C_OnNotifyEnd_D3BD0A294D38A1FAD1E5F9BD4E438272) == 0x000004, "Wrong alignment on Effect_girl006a_skill01_Buff_KnifeAnim_C_OnNotifyEnd_D3BD0A294D38A1FAD1E5F9BD4E438272");
static_assert(sizeof(Effect_girl006a_skill01_Buff_KnifeAnim_C_OnNotifyEnd_D3BD0A294D38A1FAD1E5F9BD4E438272) == 0x000008, "Wrong size on Effect_girl006a_skill01_Buff_KnifeAnim_C_OnNotifyEnd_D3BD0A294D38A1FAD1E5F9BD4E438272");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_OnNotifyEnd_D3BD0A294D38A1FAD1E5F9BD4E438272, NotifyName) == 0x000000, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_OnNotifyEnd_D3BD0A294D38A1FAD1E5F9BD4E438272::NotifyName' has a wrong offset!");

// Function Effect_girl006a_skill01_Buff_KnifeAnim.Effect_girl006a_skill01_Buff_KnifeAnim_C.OnNotifyBegin_D3BD0A294D38A1FAD1E5F9BD4E438272
// 0x0008 (0x0008 - 0x0000)
struct Effect_girl006a_skill01_Buff_KnifeAnim_C_OnNotifyBegin_D3BD0A294D38A1FAD1E5F9BD4E438272 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_girl006a_skill01_Buff_KnifeAnim_C_OnNotifyBegin_D3BD0A294D38A1FAD1E5F9BD4E438272) == 0x000004, "Wrong alignment on Effect_girl006a_skill01_Buff_KnifeAnim_C_OnNotifyBegin_D3BD0A294D38A1FAD1E5F9BD4E438272");
static_assert(sizeof(Effect_girl006a_skill01_Buff_KnifeAnim_C_OnNotifyBegin_D3BD0A294D38A1FAD1E5F9BD4E438272) == 0x000008, "Wrong size on Effect_girl006a_skill01_Buff_KnifeAnim_C_OnNotifyBegin_D3BD0A294D38A1FAD1E5F9BD4E438272");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_OnNotifyBegin_D3BD0A294D38A1FAD1E5F9BD4E438272, NotifyName) == 0x000000, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_OnNotifyBegin_D3BD0A294D38A1FAD1E5F9BD4E438272::NotifyName' has a wrong offset!");

// Function Effect_girl006a_skill01_Buff_KnifeAnim.Effect_girl006a_skill01_Buff_KnifeAnim_C.OnInterrupted_D3BD0A294D38A1FAD1E5F9BD4E438272
// 0x0008 (0x0008 - 0x0000)
struct Effect_girl006a_skill01_Buff_KnifeAnim_C_OnInterrupted_D3BD0A294D38A1FAD1E5F9BD4E438272 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_girl006a_skill01_Buff_KnifeAnim_C_OnInterrupted_D3BD0A294D38A1FAD1E5F9BD4E438272) == 0x000004, "Wrong alignment on Effect_girl006a_skill01_Buff_KnifeAnim_C_OnInterrupted_D3BD0A294D38A1FAD1E5F9BD4E438272");
static_assert(sizeof(Effect_girl006a_skill01_Buff_KnifeAnim_C_OnInterrupted_D3BD0A294D38A1FAD1E5F9BD4E438272) == 0x000008, "Wrong size on Effect_girl006a_skill01_Buff_KnifeAnim_C_OnInterrupted_D3BD0A294D38A1FAD1E5F9BD4E438272");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_OnInterrupted_D3BD0A294D38A1FAD1E5F9BD4E438272, NotifyName) == 0x000000, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_OnInterrupted_D3BD0A294D38A1FAD1E5F9BD4E438272::NotifyName' has a wrong offset!");

// Function Effect_girl006a_skill01_Buff_KnifeAnim.Effect_girl006a_skill01_Buff_KnifeAnim_C.OnBlendOut_D3BD0A294D38A1FAD1E5F9BD4E438272
// 0x0008 (0x0008 - 0x0000)
struct Effect_girl006a_skill01_Buff_KnifeAnim_C_OnBlendOut_D3BD0A294D38A1FAD1E5F9BD4E438272 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_girl006a_skill01_Buff_KnifeAnim_C_OnBlendOut_D3BD0A294D38A1FAD1E5F9BD4E438272) == 0x000004, "Wrong alignment on Effect_girl006a_skill01_Buff_KnifeAnim_C_OnBlendOut_D3BD0A294D38A1FAD1E5F9BD4E438272");
static_assert(sizeof(Effect_girl006a_skill01_Buff_KnifeAnim_C_OnBlendOut_D3BD0A294D38A1FAD1E5F9BD4E438272) == 0x000008, "Wrong size on Effect_girl006a_skill01_Buff_KnifeAnim_C_OnBlendOut_D3BD0A294D38A1FAD1E5F9BD4E438272");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_OnBlendOut_D3BD0A294D38A1FAD1E5F9BD4E438272, NotifyName) == 0x000000, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_OnBlendOut_D3BD0A294D38A1FAD1E5F9BD4E438272::NotifyName' has a wrong offset!");

// Function Effect_girl006a_skill01_Buff_KnifeAnim.Effect_girl006a_skill01_Buff_KnifeAnim_C.OnCompleted_D3BD0A294D38A1FAD1E5F9BD4E438272
// 0x0008 (0x0008 - 0x0000)
struct Effect_girl006a_skill01_Buff_KnifeAnim_C_OnCompleted_D3BD0A294D38A1FAD1E5F9BD4E438272 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_girl006a_skill01_Buff_KnifeAnim_C_OnCompleted_D3BD0A294D38A1FAD1E5F9BD4E438272) == 0x000004, "Wrong alignment on Effect_girl006a_skill01_Buff_KnifeAnim_C_OnCompleted_D3BD0A294D38A1FAD1E5F9BD4E438272");
static_assert(sizeof(Effect_girl006a_skill01_Buff_KnifeAnim_C_OnCompleted_D3BD0A294D38A1FAD1E5F9BD4E438272) == 0x000008, "Wrong size on Effect_girl006a_skill01_Buff_KnifeAnim_C_OnCompleted_D3BD0A294D38A1FAD1E5F9BD4E438272");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_OnCompleted_D3BD0A294D38A1FAD1E5F9BD4E438272, NotifyName) == 0x000000, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_OnCompleted_D3BD0A294D38A1FAD1E5F9BD4E438272::NotifyName' has a wrong offset!");

// Function Effect_girl006a_skill01_Buff_KnifeAnim.Effect_girl006a_skill01_Buff_KnifeAnim_C.ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim
// 0x00D0 (0x00D0 - 0x0000)
struct Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterAccessory*                    CallFunc_GetAccessoryByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCastingSkillIDInAnim_ReturnValue;      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMesh_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   ___name_Variable;                                  // 0x00A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim) == 0x000008, "Wrong alignment on Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim");
static_assert(sizeof(Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim) == 0x0000D0, "Wrong size on Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim, EntryPoint) == 0x000000, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim::EntryPoint' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim, K2Node_CustomEvent_NotifyName_4) == 0x000010, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim, K2Node_DynamicCast_AsGame_Character) == 0x000018, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim, CallFunc_GetAccessoryByClass_ReturnValue) == 0x000038, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim::CallFunc_GetAccessoryByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim, CallFunc_GetCastingSkillIDInAnim_ReturnValue) == 0x000040, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim::CallFunc_GetCastingSkillIDInAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim, CallFunc_GetSkeletalMesh_ReturnValue) == 0x000048, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim::CallFunc_GetSkeletalMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000050, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim, K2Node_CustomEvent_NotifyName_3) == 0x000054, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim, K2Node_CustomEvent_NotifyName_2) == 0x00005C, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim, K2Node_CreateDelegate_OutputDelegate_1) == 0x000064, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim, K2Node_CustomEvent_NotifyName_1) == 0x000074, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim, K2Node_CreateDelegate_OutputDelegate_2) == 0x00007C, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim, K2Node_CustomEvent_NotifyName) == 0x00008C, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim, K2Node_CreateDelegate_OutputDelegate_3) == 0x000094, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim, ___name_Variable) == 0x0000A4, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim::___name_Variable' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x0000B0, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim, CallFunc_IsValid_ReturnValue_1) == 0x0000B8, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000BC, "Member 'Effect_girl006a_skill01_Buff_KnifeAnim_C_ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

}

