#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Effect_girl006a_skill01_Buff3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Effect_girl006a_skill01_Buff3.Effect_girl006a_skill01_Buff3_C
// 0x00A0 (0x03B8 - 0x0318)
class AEffect_girl006a_skill01_Buff3_C final : public ACustomEffectActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Curve1______0_4EC57D294BB99A52A28FEC86A5741358; // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_Curve1__Direction_4EC57D294BB99A52A28FEC86A5741358; // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_Curve1;                                   // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ID;                                                // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DissolveEdgeColor;                                 // 0x0340(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DissolveLevel;                                     // 0x0358(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCharacterRenderComponent*              RC;                                                // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   DissolveWidth;                                     // 0x0378(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMeshComponent*                         MC;                                                // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   EffectTexture;                                     // 0x0398(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Time;                                              // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline_Curve1__FinishedFunc();
	void Timeline_Curve1__UpdateFunc();
	void K2_ReceiveDeActive();
	void K2_ReceiveActive();
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_Effect_girl006a_skill01_Buff3(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Effect_girl006a_skill01_Buff3_C">();
	}
	static class AEffect_girl006a_skill01_Buff3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEffect_girl006a_skill01_Buff3_C>();
	}
};
static_assert(alignof(AEffect_girl006a_skill01_Buff3_C) == 0x000008, "Wrong alignment on AEffect_girl006a_skill01_Buff3_C");
static_assert(sizeof(AEffect_girl006a_skill01_Buff3_C) == 0x0003B8, "Wrong size on AEffect_girl006a_skill01_Buff3_C");
static_assert(offsetof(AEffect_girl006a_skill01_Buff3_C, UberGraphFrame) == 0x000318, "Member 'AEffect_girl006a_skill01_Buff3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AEffect_girl006a_skill01_Buff3_C, DefaultSceneRoot) == 0x000320, "Member 'AEffect_girl006a_skill01_Buff3_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AEffect_girl006a_skill01_Buff3_C, Timeline_Curve1______0_4EC57D294BB99A52A28FEC86A5741358) == 0x000328, "Member 'AEffect_girl006a_skill01_Buff3_C::Timeline_Curve1______0_4EC57D294BB99A52A28FEC86A5741358' has a wrong offset!");
static_assert(offsetof(AEffect_girl006a_skill01_Buff3_C, Timeline_Curve1__Direction_4EC57D294BB99A52A28FEC86A5741358) == 0x00032C, "Member 'AEffect_girl006a_skill01_Buff3_C::Timeline_Curve1__Direction_4EC57D294BB99A52A28FEC86A5741358' has a wrong offset!");
static_assert(offsetof(AEffect_girl006a_skill01_Buff3_C, Timeline_Curve1) == 0x000330, "Member 'AEffect_girl006a_skill01_Buff3_C::Timeline_Curve1' has a wrong offset!");
static_assert(offsetof(AEffect_girl006a_skill01_Buff3_C, ID) == 0x000338, "Member 'AEffect_girl006a_skill01_Buff3_C::ID' has a wrong offset!");
static_assert(offsetof(AEffect_girl006a_skill01_Buff3_C, DissolveEdgeColor) == 0x000340, "Member 'AEffect_girl006a_skill01_Buff3_C::DissolveEdgeColor' has a wrong offset!");
static_assert(offsetof(AEffect_girl006a_skill01_Buff3_C, DissolveLevel) == 0x000358, "Member 'AEffect_girl006a_skill01_Buff3_C::DissolveLevel' has a wrong offset!");
static_assert(offsetof(AEffect_girl006a_skill01_Buff3_C, RC) == 0x000370, "Member 'AEffect_girl006a_skill01_Buff3_C::RC' has a wrong offset!");
static_assert(offsetof(AEffect_girl006a_skill01_Buff3_C, DissolveWidth) == 0x000378, "Member 'AEffect_girl006a_skill01_Buff3_C::DissolveWidth' has a wrong offset!");
static_assert(offsetof(AEffect_girl006a_skill01_Buff3_C, MC) == 0x000390, "Member 'AEffect_girl006a_skill01_Buff3_C::MC' has a wrong offset!");
static_assert(offsetof(AEffect_girl006a_skill01_Buff3_C, EffectTexture) == 0x000398, "Member 'AEffect_girl006a_skill01_Buff3_C::EffectTexture' has a wrong offset!");
static_assert(offsetof(AEffect_girl006a_skill01_Buff3_C, Time) == 0x0003B0, "Member 'AEffect_girl006a_skill01_Buff3_C::Time' has a wrong offset!");

}

