#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Effect_girl014b_skill01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Effect_girl014b_skill01.Effect_girl014b_skill01_C
// 0x0078 (0x0398 - 0x0320)
class AEffect_girl014b_skill01_C final : public ACustomEffectActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGameNiagaraComponent*                  GameNiagara11;                                     // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGameNiagaraComponent*                  GameNiagara10;                                     // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGameNiagaraComponent*                  GameNiagara9;                                      // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGameNiagaraComponent*                  GameNiagara8;                                      // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGameNiagaraComponent*                  GameNiagara7;                                      // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGameNiagaraComponent*                  GameNiagara6;                                      // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGameNiagaraComponent*                  GameNiagara5;                                      // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGameNiagaraComponent*                  GameNiagara4;                                      // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGameNiagaraComponent*                  GameNiagara3;                                      // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGameNiagaraComponent*                  GameNiagara2;                                      // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGameNiagaraComponent*                  GameNiagara1;                                      // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGameNiagaraComponent*                  GameNiagara;                                       // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         SequenceIndexR;                                    // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SequenceIndexL;                                    // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void K2_ReceiveTick(float DeltaSeconds);
	void K2_ReceiveActive();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_Effect_girl014b_skill01(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Effect_girl014b_skill01_C">();
	}
	static class AEffect_girl014b_skill01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEffect_girl014b_skill01_C>();
	}
};
static_assert(alignof(AEffect_girl014b_skill01_C) == 0x000008, "Wrong alignment on AEffect_girl014b_skill01_C");
static_assert(sizeof(AEffect_girl014b_skill01_C) == 0x000398, "Wrong size on AEffect_girl014b_skill01_C");
static_assert(offsetof(AEffect_girl014b_skill01_C, UberGraphFrame) == 0x000320, "Member 'AEffect_girl014b_skill01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AEffect_girl014b_skill01_C, GameNiagara11) == 0x000328, "Member 'AEffect_girl014b_skill01_C::GameNiagara11' has a wrong offset!");
static_assert(offsetof(AEffect_girl014b_skill01_C, GameNiagara10) == 0x000330, "Member 'AEffect_girl014b_skill01_C::GameNiagara10' has a wrong offset!");
static_assert(offsetof(AEffect_girl014b_skill01_C, GameNiagara9) == 0x000338, "Member 'AEffect_girl014b_skill01_C::GameNiagara9' has a wrong offset!");
static_assert(offsetof(AEffect_girl014b_skill01_C, GameNiagara8) == 0x000340, "Member 'AEffect_girl014b_skill01_C::GameNiagara8' has a wrong offset!");
static_assert(offsetof(AEffect_girl014b_skill01_C, GameNiagara7) == 0x000348, "Member 'AEffect_girl014b_skill01_C::GameNiagara7' has a wrong offset!");
static_assert(offsetof(AEffect_girl014b_skill01_C, GameNiagara6) == 0x000350, "Member 'AEffect_girl014b_skill01_C::GameNiagara6' has a wrong offset!");
static_assert(offsetof(AEffect_girl014b_skill01_C, GameNiagara5) == 0x000358, "Member 'AEffect_girl014b_skill01_C::GameNiagara5' has a wrong offset!");
static_assert(offsetof(AEffect_girl014b_skill01_C, GameNiagara4) == 0x000360, "Member 'AEffect_girl014b_skill01_C::GameNiagara4' has a wrong offset!");
static_assert(offsetof(AEffect_girl014b_skill01_C, GameNiagara3) == 0x000368, "Member 'AEffect_girl014b_skill01_C::GameNiagara3' has a wrong offset!");
static_assert(offsetof(AEffect_girl014b_skill01_C, GameNiagara2) == 0x000370, "Member 'AEffect_girl014b_skill01_C::GameNiagara2' has a wrong offset!");
static_assert(offsetof(AEffect_girl014b_skill01_C, GameNiagara1) == 0x000378, "Member 'AEffect_girl014b_skill01_C::GameNiagara1' has a wrong offset!");
static_assert(offsetof(AEffect_girl014b_skill01_C, GameNiagara) == 0x000380, "Member 'AEffect_girl014b_skill01_C::GameNiagara' has a wrong offset!");
static_assert(offsetof(AEffect_girl014b_skill01_C, DefaultSceneRoot) == 0x000388, "Member 'AEffect_girl014b_skill01_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AEffect_girl014b_skill01_C, SequenceIndexR) == 0x000390, "Member 'AEffect_girl014b_skill01_C::SequenceIndexR' has a wrong offset!");
static_assert(offsetof(AEffect_girl014b_skill01_C, SequenceIndexL) == 0x000394, "Member 'AEffect_girl014b_skill01_C::SequenceIndexL' has a wrong offset!");

}

