#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Effect_girl006a_skill03_HideBuff

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Effect_girl006a_skill03_HideBuff.Effect_girl006a_skill03_HideBuff_C
// 0x0090 (0x03A8 - 0x0318)
class AEffect_girl006a_skill03_HideBuff_C final : public ACustomEffectActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         ID;                                                // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DissolveEdgeColor;                                 // 0x0330(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DissolveLevel;                                     // 0x0348(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCharacterRenderComponent*              Target_0;                                          // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   DissolveWidth;                                     // 0x0368(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMeshComponent*                         MC;                                                // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   EffectTexture;                                     // 0x0388(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Time;                                              // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void K2_ReceiveActive();
	void K2_ReceiveDeActive();
	void ExecuteUbergraph_Effect_girl006a_skill03_HideBuff(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Effect_girl006a_skill03_HideBuff_C">();
	}
	static class AEffect_girl006a_skill03_HideBuff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEffect_girl006a_skill03_HideBuff_C>();
	}
};
static_assert(alignof(AEffect_girl006a_skill03_HideBuff_C) == 0x000008, "Wrong alignment on AEffect_girl006a_skill03_HideBuff_C");
static_assert(sizeof(AEffect_girl006a_skill03_HideBuff_C) == 0x0003A8, "Wrong size on AEffect_girl006a_skill03_HideBuff_C");
static_assert(offsetof(AEffect_girl006a_skill03_HideBuff_C, UberGraphFrame) == 0x000318, "Member 'AEffect_girl006a_skill03_HideBuff_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AEffect_girl006a_skill03_HideBuff_C, DefaultSceneRoot) == 0x000320, "Member 'AEffect_girl006a_skill03_HideBuff_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AEffect_girl006a_skill03_HideBuff_C, ID) == 0x000328, "Member 'AEffect_girl006a_skill03_HideBuff_C::ID' has a wrong offset!");
static_assert(offsetof(AEffect_girl006a_skill03_HideBuff_C, DissolveEdgeColor) == 0x000330, "Member 'AEffect_girl006a_skill03_HideBuff_C::DissolveEdgeColor' has a wrong offset!");
static_assert(offsetof(AEffect_girl006a_skill03_HideBuff_C, DissolveLevel) == 0x000348, "Member 'AEffect_girl006a_skill03_HideBuff_C::DissolveLevel' has a wrong offset!");
static_assert(offsetof(AEffect_girl006a_skill03_HideBuff_C, Target_0) == 0x000360, "Member 'AEffect_girl006a_skill03_HideBuff_C::Target_0' has a wrong offset!");
static_assert(offsetof(AEffect_girl006a_skill03_HideBuff_C, DissolveWidth) == 0x000368, "Member 'AEffect_girl006a_skill03_HideBuff_C::DissolveWidth' has a wrong offset!");
static_assert(offsetof(AEffect_girl006a_skill03_HideBuff_C, MC) == 0x000380, "Member 'AEffect_girl006a_skill03_HideBuff_C::MC' has a wrong offset!");
static_assert(offsetof(AEffect_girl006a_skill03_HideBuff_C, EffectTexture) == 0x000388, "Member 'AEffect_girl006a_skill03_HideBuff_C::EffectTexture' has a wrong offset!");
static_assert(offsetof(AEffect_girl006a_skill03_HideBuff_C, Time) == 0x0003A0, "Member 'AEffect_girl006a_skill03_HideBuff_C::Time' has a wrong offset!");

}

