#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Effect_girl006a_skill03_HideBuff

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function Effect_girl006a_skill03_HideBuff.Effect_girl006a_skill03_HideBuff_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Effect_girl006a_skill03_HideBuff_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_girl006a_skill03_HideBuff_C_ReceiveTick) == 0x000004, "Wrong alignment on Effect_girl006a_skill03_HideBuff_C_ReceiveTick");
static_assert(sizeof(Effect_girl006a_skill03_HideBuff_C_ReceiveTick) == 0x000004, "Wrong size on Effect_girl006a_skill03_HideBuff_C_ReceiveTick");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Effect_girl006a_skill03_HideBuff_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Effect_girl006a_skill03_HideBuff.Effect_girl006a_skill03_HideBuff_C.ExecuteUbergraph_Effect_girl006a_skill03_HideBuff
// 0x0160 (0x0160 - 0x0000)
struct Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeRenderStatePriority_ReturnValue;      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
	struct FCharacterStateStartParam              K2Node_MakeStruct_CharacterStateStartParam;        // 0x0060(0x00A0)(ContainsInstancedReference)
	int32                                         CallFunc_GetCastingSkillIDInAnim_ReturnValue;      // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_StartCharacterStateParam_ReturnValue;     // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Girl006a_C*                         K2Node_DynamicCast_AsBP_Girl_006a;                 // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeRenderStatePriority_ReturnValue_1;    // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseComponent*                        CallFunc_PostEventAttachedActor_ReturnValue;       // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_StartCharacterStateParam_ReturnValue_1;   // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff) == 0x000008, "Wrong alignment on Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff");
static_assert(sizeof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff) == 0x000160, "Wrong size on Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, EntryPoint) == 0x000000, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::EntryPoint' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, CallFunc_MakeRenderStatePriority_ReturnValue) == 0x000004, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::CallFunc_MakeRenderStatePriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, K2Node_MakeStruct_LinearColor) == 0x000008, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, CallFunc_Conv_TextToString_ReturnValue) == 0x000018, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000030, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, K2Node_DynamicCast_AsGame_Character) == 0x000040, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, CallFunc_IsValid_ReturnValue_1) == 0x00004A, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, K2Node_MakeArray_Array) == 0x000050, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, K2Node_MakeStruct_CharacterStateStartParam) == 0x000060, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::K2Node_MakeStruct_CharacterStateStartParam' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, CallFunc_GetCastingSkillIDInAnim_ReturnValue) == 0x000100, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::CallFunc_GetCastingSkillIDInAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, CallFunc_StartCharacterStateParam_ReturnValue) == 0x000104, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::CallFunc_StartCharacterStateParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000108, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, K2Node_Event_DeltaSeconds) == 0x00010C, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, CallFunc_Add_FloatFloat_ReturnValue) == 0x000110, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, CallFunc_IsValid_ReturnValue_2) == 0x000114, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000118, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, CallFunc_GetOwner_ReturnValue_1) == 0x000128, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, K2Node_DynamicCast_AsBP_Girl_006a) == 0x000130, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::K2Node_DynamicCast_AsBP_Girl_006a' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, K2Node_DynamicCast_bSuccess_1) == 0x000138, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, CallFunc_GetOwner_ReturnValue_2) == 0x000140, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, CallFunc_MakeRenderStatePriority_ReturnValue_1) == 0x000148, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::CallFunc_MakeRenderStatePriority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, CallFunc_PostEventAttachedActor_ReturnValue) == 0x000150, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::CallFunc_PostEventAttachedActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff, CallFunc_StartCharacterStateParam_ReturnValue_1) == 0x000158, "Member 'Effect_girl006a_skill03_HideBuff_C_ExecuteUbergraph_Effect_girl006a_skill03_HideBuff::CallFunc_StartCharacterStateParam_ReturnValue_1' has a wrong offset!");

}

