#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Effect_girl_004b_Shield

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Effect_girl_004b_Shield.Effect_girl_004b_Shield_C
// 0x0018 (0x0338 - 0x0320)
class AEffect_girl_004b_Shield_C final : public ACustomEffectActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      ShieldParticle;                                    // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void K2_OnOwnerModifierOverlaidChange(int32 PreModifierOverliadNum, int32 CurModifierOverlaidNum);
	void ModifierOverliadChange(int32 CurrentOverlaid);
	void K2_ReceiveActive();
	void K2_ReceiveDeActive();
	void ExecuteUbergraph_Effect_girl_004b_Shield(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Effect_girl_004b_Shield_C">();
	}
	static class AEffect_girl_004b_Shield_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEffect_girl_004b_Shield_C>();
	}
};
static_assert(alignof(AEffect_girl_004b_Shield_C) == 0x000008, "Wrong alignment on AEffect_girl_004b_Shield_C");
static_assert(sizeof(AEffect_girl_004b_Shield_C) == 0x000338, "Wrong size on AEffect_girl_004b_Shield_C");
static_assert(offsetof(AEffect_girl_004b_Shield_C, UberGraphFrame) == 0x000320, "Member 'AEffect_girl_004b_Shield_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AEffect_girl_004b_Shield_C, DefaultSceneRoot) == 0x000328, "Member 'AEffect_girl_004b_Shield_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AEffect_girl_004b_Shield_C, ShieldParticle) == 0x000330, "Member 'AEffect_girl_004b_Shield_C::ShieldParticle' has a wrong offset!");

}

