#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Effect_girl006a_skill01_Buff_KnifeAnim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Effect_girl006a_skill01_Buff_KnifeAnim.Effect_girl006a_skill01_Buff_KnifeAnim_C
// 0x0018 (0x0330 - 0x0318)
class AEffect_girl006a_skill01_Buff_KnifeAnim_C final : public ACustomEffectActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 MC;                                                // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnNotifyEnd_D3BD0A294D38A1FAD1E5F9BD4E438272(class FName NotifyName);
	void OnNotifyBegin_D3BD0A294D38A1FAD1E5F9BD4E438272(class FName NotifyName);
	void OnInterrupted_D3BD0A294D38A1FAD1E5F9BD4E438272(class FName NotifyName);
	void OnBlendOut_D3BD0A294D38A1FAD1E5F9BD4E438272(class FName NotifyName);
	void OnCompleted_D3BD0A294D38A1FAD1E5F9BD4E438272(class FName NotifyName);
	void K2_ReceiveActive();
	void ExecuteUbergraph_Effect_girl006a_skill01_Buff_KnifeAnim(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Effect_girl006a_skill01_Buff_KnifeAnim_C">();
	}
	static class AEffect_girl006a_skill01_Buff_KnifeAnim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEffect_girl006a_skill01_Buff_KnifeAnim_C>();
	}
};
static_assert(alignof(AEffect_girl006a_skill01_Buff_KnifeAnim_C) == 0x000008, "Wrong alignment on AEffect_girl006a_skill01_Buff_KnifeAnim_C");
static_assert(sizeof(AEffect_girl006a_skill01_Buff_KnifeAnim_C) == 0x000330, "Wrong size on AEffect_girl006a_skill01_Buff_KnifeAnim_C");
static_assert(offsetof(AEffect_girl006a_skill01_Buff_KnifeAnim_C, UberGraphFrame) == 0x000318, "Member 'AEffect_girl006a_skill01_Buff_KnifeAnim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AEffect_girl006a_skill01_Buff_KnifeAnim_C, DefaultSceneRoot) == 0x000320, "Member 'AEffect_girl006a_skill01_Buff_KnifeAnim_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AEffect_girl006a_skill01_Buff_KnifeAnim_C, MC) == 0x000328, "Member 'AEffect_girl006a_skill01_Buff_KnifeAnim_C::MC' has a wrong offset!");

}

