#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Effect_girl014b_skill01

#include "Basic.hpp"


namespace SDK::Params
{

// Function Effect_girl014b_skill01.Effect_girl014b_skill01_C.K2_ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Effect_girl014b_skill01_C_K2_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_girl014b_skill01_C_K2_ReceiveTick) == 0x000004, "Wrong alignment on Effect_girl014b_skill01_C_K2_ReceiveTick");
static_assert(sizeof(Effect_girl014b_skill01_C_K2_ReceiveTick) == 0x000004, "Wrong size on Effect_girl014b_skill01_C_K2_ReceiveTick");
static_assert(offsetof(Effect_girl014b_skill01_C_K2_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Effect_girl014b_skill01_C_K2_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Effect_girl014b_skill01.Effect_girl014b_skill01_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct Effect_girl014b_skill01_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_girl014b_skill01_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on Effect_girl014b_skill01_C_ReceiveActorBeginOverlap");
static_assert(sizeof(Effect_girl014b_skill01_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on Effect_girl014b_skill01_C_ReceiveActorBeginOverlap");
static_assert(offsetof(Effect_girl014b_skill01_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'Effect_girl014b_skill01_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function Effect_girl014b_skill01.Effect_girl014b_skill01_C.ExecuteUbergraph_Effect_girl014b_skill01
// 0x0070 (0x0070 - 0x0000)
struct Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UGameNiagaraComponent*>          K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UGameNiagaraComponent*>          K2Node_MakeArray_Array_1;                          // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              K2Node_MakeArray_Array_2;                          // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_1;       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameNiagaraComponent*                  CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_2;       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameNiagaraComponent*                  CallFunc_Array_Get_Item_2;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01) == 0x000008, "Wrong alignment on Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01");
static_assert(sizeof(Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01) == 0x000070, "Wrong size on Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01");
static_assert(offsetof(Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01, EntryPoint) == 0x000000, "Member 'Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01::EntryPoint' has a wrong offset!");
static_assert(offsetof(Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01, K2Node_MakeArray_Array) == 0x000008, "Member 'Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01, K2Node_MakeArray_Array_1) == 0x000018, "Member 'Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01, K2Node_MakeArray_Array_2) == 0x000028, "Member 'Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01, K2Node_Event_OtherActor) == 0x000038, "Member 'Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000040, "Member 'Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01, CallFunc_RandomIntegerInRange_ReturnValue_1) == 0x000044, "Member 'Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01::CallFunc_RandomIntegerInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01, CallFunc_Array_Get_Item) == 0x000048, "Member 'Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01, CallFunc_RandomIntegerInRange_ReturnValue_2) == 0x000058, "Member 'Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01::CallFunc_RandomIntegerInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01, CallFunc_RandomFloatInRange_ReturnValue) == 0x00005C, "Member 'Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01, CallFunc_Array_Get_Item_2) == 0x000060, "Member 'Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000068, "Member 'Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x00006C, "Member 'Effect_girl014b_skill01_C_ExecuteUbergraph_Effect_girl014b_skill01::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");

}

