#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Effect_girl006a_skill01_Buff2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Effect_girl006a_skill01_Buff2.Effect_girl006a_skill01_Buff2_C
// 0x00A0 (0x03C0 - 0x0320)
class AEffect_girl006a_skill01_Buff2_C final : public ACustomEffectActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Curve1______0_40817C5B4A58D7F2834978996336AF95; // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_Curve1__Direction_40817C5B4A58D7F2834978996336AF95; // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_335[0x3];                                      // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_Curve1;                                   // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ID;                                                // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DissolveEdgeColor;                                 // 0x0348(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DissolveLevel;                                     // 0x0360(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCharacterRenderComponent*              Target_0;                                          // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   DissolveWidth;                                     // 0x0380(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMeshComponent*                         MC;                                                // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   EffectTexture;                                     // 0x03A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Time;                                              // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline_Curve1__UpdateFunc();
	void ReceiveTick(float DeltaSeconds);
	void K2_ReceiveActive();
	void K2_ReceiveDeActive();
	void ExecuteUbergraph_Effect_girl006a_skill01_Buff2(int32 EntryPoint);
	void Timeline_Curve1__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Effect_girl006a_skill01_Buff2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Effect_girl006a_skill01_Buff2_C")
	}
	static class AEffect_girl006a_skill01_Buff2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEffect_girl006a_skill01_Buff2_C>();
	}
};
DUMPER7_ASSERTS_AEffect_girl006a_skill01_Buff2_C;

}

