#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Effect_girl023_Skill03

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Effect_girl023_Skill03.Effect_girl023_Skill03_C
// 0x0750 (0x0A70 - 0x0320)
class AEffect_girl023_Skill03_C final : public ACustomEffectActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Skin_ID;                                           // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, class UNiagaraSystem*>            FX_Ear_L;                                          // 0x0338(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class UNiagaraSystem*>            FX_Ear_R;                                          // 0x0388(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class UNiagaraSystem*>            FX_Spine;                                          // 0x03D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class UNiagaraSystem*>            FX_Foot_L;                                         // 0x0428(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class UNiagaraSystem*>            FX_Foot_R;                                         // 0x0478(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class UNiagaraSystem*>            FX_Chest_L;                                        // 0x04C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class UNiagaraSystem*>            FX_Chest_R;                                        // 0x0518(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class UNiagaraSystem*>            FX_Hand_L;                                         // 0x0568(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class UNiagaraSystem*>            FX_Hand_R;                                         // 0x05B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class UNiagaraSystem*>            FX_Chest;                                          // 0x0608(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class UNiagaraSystem*>            FX_Tail;                                           // 0x0658(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNiagaraComponent*                      Obj_Ear_L_FX;                                      // 0x06A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, class FName>                      Socket_Ear_L;                                      // 0x06B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class FName>                      Socket_Ear_R;                                      // 0x0700(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class FName>                      Socket_Spine;                                      // 0x0750(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNiagaraComponent*                      Obj_Ear_R_FX;                                      // 0x07A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Obj_Spine_FX;                                      // 0x07A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, class FName>                      Socket_Foot_L;                                     // 0x07B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNiagaraComponent*                      Obj_Foot_L_FX;                                     // 0x0800(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, class FName>                      Socket_Foot_R;                                     // 0x0808(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNiagaraComponent*                      Obj_Foot_R_FX;                                     // 0x0858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, class FName>                      Socket_Chest_L;                                    // 0x0860(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNiagaraComponent*                      Obj_Chest_L_FX;                                    // 0x08B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, class FName>                      Socket_Chest_R;                                    // 0x08B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNiagaraComponent*                      Obj_Chest_R_FX;                                    // 0x0908(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, class FName>                      Socket_Hand_L;                                     // 0x0910(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class FName>                      Socket_Hand_R;                                     // 0x0960(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNiagaraComponent*                      Obj_Hand_L_FX;                                     // 0x09B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Obj_Hand_R_FX;                                     // 0x09B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, class FName>                      Socket_Chest;                                      // 0x09C0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNiagaraComponent*                      Obj_Chest_FX;                                      // 0x0A10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, class FName>                      Socket_Tail;                                       // 0x0A18(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNiagaraComponent*                      Obj_Tail_FX;                                       // 0x0A68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void K2_ReceiveActive();
	void K2_ReceiveDeActive();
	void ExecuteUbergraph_Effect_girl023_Skill03(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Effect_girl023_Skill03_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Effect_girl023_Skill03_C")
	}
	static class AEffect_girl023_Skill03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEffect_girl023_Skill03_C>();
	}
};
DUMPER7_ASSERTS_AEffect_girl023_Skill03_C;

}

