#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Emitter_SkillMove_SkillNormalMove

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// LuaFunction Emitter_SkillMove_SkillNormalMove.Emitter_SkillMove_SkillNormalMove_C.OnEmitTick
// 0x0004 (0x0004 - 0x0000)
struct Emitter_SkillMove_SkillNormalMove_C_OnEmitTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Emitter_SkillMove_SkillNormalMove_C_OnEmitTick;

// Function Emitter_SkillMove_SkillNormalMove.Emitter_SkillMove_SkillNormalMove_C.GetDefaultParamsValue
// 0x0050 (0x0050 - 0x0000)
struct Emitter_SkillMove_SkillNormalMove_C_GetDefaultParamsValue final
{
public:
	TArray<struct FParamInfo>                     Values;                                            // 0x0000(0x0010)(Parm, OutParm)
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo;                       // 0x0010(0x0010)()
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo_1;                     // 0x0020(0x0010)()
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo_2;                     // 0x0030(0x0010)()
	TArray<struct FParamInfo>                     K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm)
};
DUMPER7_ASSERTS_Emitter_SkillMove_SkillNormalMove_C_GetDefaultParamsValue;

}

