#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Emitter_Trap

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// LuaFunction Emitter_Trap.Emitter_Trap_C.OnEmit
// 0x0001 (0x0001 - 0x0000)
struct Emitter_Trap_C_OnEmit final
{
public:
	EEmitterResult                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Emitter_Trap_C_OnEmit) == 0x000001, "Wrong alignment on Emitter_Trap_C_OnEmit");
static_assert(sizeof(Emitter_Trap_C_OnEmit) == 0x000001, "Wrong size on Emitter_Trap_C_OnEmit");
static_assert(offsetof(Emitter_Trap_C_OnEmit, ReturnValue) == 0x000000, "Member 'Emitter_Trap_C_OnEmit::ReturnValue' has a wrong offset!");

// Function Emitter_Trap.Emitter_Trap_C.OnGetAssetPath
// 0x01A0 (0x01A0 - 0x0000)
struct Emitter_Trap_C_OnGetAssetPath final
{
public:
	TArray<struct FParamInfo>                     Values;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 CharacterIDs;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 SkillIDs;                                          // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 ModifierIDs;                                       // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 EmitterIDs;                                        // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FSoftObjectPath>                ReturnValue;                                       // 0x0050(0x0010)(Parm, OutParm, ReturnParm)
	TArray<int32>                                 OuTrapIDs;                                         // 0x0060(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSoftObjectPath>                OutPaths;                                          // 0x0070(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00A0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00B8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00F8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0138(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0148(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        CallFunc_MakeSoftObjectPath_ReturnValue;           // 0x0170(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FSoftObjectPath>                CallFunc_GetTrapTemplateAssetPath_OutPaths;        // 0x0188(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Emitter_Trap_C_OnGetAssetPath) == 0x000008, "Wrong alignment on Emitter_Trap_C_OnGetAssetPath");
static_assert(sizeof(Emitter_Trap_C_OnGetAssetPath) == 0x0001A0, "Wrong size on Emitter_Trap_C_OnGetAssetPath");
static_assert(offsetof(Emitter_Trap_C_OnGetAssetPath, Values) == 0x000000, "Member 'Emitter_Trap_C_OnGetAssetPath::Values' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_OnGetAssetPath, CharacterIDs) == 0x000010, "Member 'Emitter_Trap_C_OnGetAssetPath::CharacterIDs' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_OnGetAssetPath, SkillIDs) == 0x000020, "Member 'Emitter_Trap_C_OnGetAssetPath::SkillIDs' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_OnGetAssetPath, ModifierIDs) == 0x000030, "Member 'Emitter_Trap_C_OnGetAssetPath::ModifierIDs' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_OnGetAssetPath, EmitterIDs) == 0x000040, "Member 'Emitter_Trap_C_OnGetAssetPath::EmitterIDs' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_OnGetAssetPath, ReturnValue) == 0x000050, "Member 'Emitter_Trap_C_OnGetAssetPath::ReturnValue' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_OnGetAssetPath, OuTrapIDs) == 0x000060, "Member 'Emitter_Trap_C_OnGetAssetPath::OuTrapIDs' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_OnGetAssetPath, OutPaths) == 0x000070, "Member 'Emitter_Trap_C_OnGetAssetPath::OutPaths' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_OnGetAssetPath, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'Emitter_Trap_C_OnGetAssetPath::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_OnGetAssetPath, CallFunc_Greater_IntInt_ReturnValue) == 0x000084, "Member 'Emitter_Trap_C_OnGetAssetPath::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_OnGetAssetPath, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'Emitter_Trap_C_OnGetAssetPath::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_OnGetAssetPath, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000A0, "Member 'Emitter_Trap_C_OnGetAssetPath::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_OnGetAssetPath, K2Node_MakeStruct_FormatArgumentData) == 0x0000B8, "Member 'Emitter_Trap_C_OnGetAssetPath::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_OnGetAssetPath, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000F8, "Member 'Emitter_Trap_C_OnGetAssetPath::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_OnGetAssetPath, K2Node_MakeArray_Array) == 0x000138, "Member 'Emitter_Trap_C_OnGetAssetPath::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_OnGetAssetPath, CallFunc_Format_ReturnValue) == 0x000148, "Member 'Emitter_Trap_C_OnGetAssetPath::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_OnGetAssetPath, CallFunc_Conv_TextToString_ReturnValue) == 0x000160, "Member 'Emitter_Trap_C_OnGetAssetPath::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_OnGetAssetPath, CallFunc_MakeSoftObjectPath_ReturnValue) == 0x000170, "Member 'Emitter_Trap_C_OnGetAssetPath::CallFunc_MakeSoftObjectPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_OnGetAssetPath, CallFunc_GetTrapTemplateAssetPath_OutPaths) == 0x000188, "Member 'Emitter_Trap_C_OnGetAssetPath::CallFunc_GetTrapTemplateAssetPath_OutPaths' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_OnGetAssetPath, CallFunc_Array_AddUnique_ReturnValue) == 0x000198, "Member 'Emitter_Trap_C_OnGetAssetPath::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function Emitter_Trap.Emitter_Trap_C.GetDefaultParamsValue
// 0x0090 (0x0090 - 0x0000)
struct Emitter_Trap_C_GetDefaultParamsValue final
{
public:
	TArray<struct FParamInfo>                     Values;                                            // 0x0000(0x0010)(Parm, OutParm)
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo;                       // 0x0010(0x0010)()
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo_1;                     // 0x0020(0x0010)()
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo_2;                     // 0x0030(0x0010)()
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo_3;                     // 0x0040(0x0010)()
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo_4;                     // 0x0050(0x0010)()
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo_5;                     // 0x0060(0x0010)()
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo_6;                     // 0x0070(0x0010)()
	TArray<struct FParamInfo>                     K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
};
static_assert(alignof(Emitter_Trap_C_GetDefaultParamsValue) == 0x000008, "Wrong alignment on Emitter_Trap_C_GetDefaultParamsValue");
static_assert(sizeof(Emitter_Trap_C_GetDefaultParamsValue) == 0x000090, "Wrong size on Emitter_Trap_C_GetDefaultParamsValue");
static_assert(offsetof(Emitter_Trap_C_GetDefaultParamsValue, Values) == 0x000000, "Member 'Emitter_Trap_C_GetDefaultParamsValue::Values' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_GetDefaultParamsValue, K2Node_MakeStruct_ParamInfo) == 0x000010, "Member 'Emitter_Trap_C_GetDefaultParamsValue::K2Node_MakeStruct_ParamInfo' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_GetDefaultParamsValue, K2Node_MakeStruct_ParamInfo_1) == 0x000020, "Member 'Emitter_Trap_C_GetDefaultParamsValue::K2Node_MakeStruct_ParamInfo_1' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_GetDefaultParamsValue, K2Node_MakeStruct_ParamInfo_2) == 0x000030, "Member 'Emitter_Trap_C_GetDefaultParamsValue::K2Node_MakeStruct_ParamInfo_2' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_GetDefaultParamsValue, K2Node_MakeStruct_ParamInfo_3) == 0x000040, "Member 'Emitter_Trap_C_GetDefaultParamsValue::K2Node_MakeStruct_ParamInfo_3' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_GetDefaultParamsValue, K2Node_MakeStruct_ParamInfo_4) == 0x000050, "Member 'Emitter_Trap_C_GetDefaultParamsValue::K2Node_MakeStruct_ParamInfo_4' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_GetDefaultParamsValue, K2Node_MakeStruct_ParamInfo_5) == 0x000060, "Member 'Emitter_Trap_C_GetDefaultParamsValue::K2Node_MakeStruct_ParamInfo_5' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_GetDefaultParamsValue, K2Node_MakeStruct_ParamInfo_6) == 0x000070, "Member 'Emitter_Trap_C_GetDefaultParamsValue::K2Node_MakeStruct_ParamInfo_6' has a wrong offset!");
static_assert(offsetof(Emitter_Trap_C_GetDefaultParamsValue, K2Node_MakeArray_Array) == 0x000080, "Member 'Emitter_Trap_C_GetDefaultParamsValue::K2Node_MakeArray_Array' has a wrong offset!");

// Function Emitter_Trap.Emitter_Trap_C.ExecuteUbergraph_Emitter_Trap
// 0x0004 (0x0004 - 0x0000)
struct Emitter_Trap_C_ExecuteUbergraph_Emitter_Trap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Emitter_Trap_C_ExecuteUbergraph_Emitter_Trap) == 0x000004, "Wrong alignment on Emitter_Trap_C_ExecuteUbergraph_Emitter_Trap");
static_assert(sizeof(Emitter_Trap_C_ExecuteUbergraph_Emitter_Trap) == 0x000004, "Wrong size on Emitter_Trap_C_ExecuteUbergraph_Emitter_Trap");
static_assert(offsetof(Emitter_Trap_C_ExecuteUbergraph_Emitter_Trap, EntryPoint) == 0x000000, "Member 'Emitter_Trap_C_ExecuteUbergraph_Emitter_Trap::EntryPoint' has a wrong offset!");

// Function Emitter_Trap.Emitter_Trap_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Emitter_Trap_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Emitter_Trap_C_GetModuleName) == 0x000008, "Wrong alignment on Emitter_Trap_C_GetModuleName");
static_assert(sizeof(Emitter_Trap_C_GetModuleName) == 0x000010, "Wrong size on Emitter_Trap_C_GetModuleName");
static_assert(offsetof(Emitter_Trap_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Emitter_Trap_C_GetModuleName::ReturnValue' has a wrong offset!");

}

