#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Emitter_RevivePlayer

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function Emitter_RevivePlayer.Emitter_RevivePlayer_C.GetDefaultParamsValue
// 0x0080 (0x0080 - 0x0000)
struct Emitter_RevivePlayer_C_GetDefaultParamsValue final
{
public:
	TArray<struct FParamInfo>                     Values;                                            // 0x0000(0x0010)(Parm, OutParm)
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo;                       // 0x0010(0x0010)()
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo_1;                     // 0x0020(0x0010)()
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo_2;                     // 0x0030(0x0010)()
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo_3;                     // 0x0040(0x0010)()
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo_4;                     // 0x0050(0x0010)()
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo_5;                     // 0x0060(0x0010)()
	TArray<struct FParamInfo>                     K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
};
DUMPER7_ASSERTS_Emitter_RevivePlayer_C_GetDefaultParamsValue;

// LuaFunction Emitter_RevivePlayer.Emitter_RevivePlayer_C.OnEmit
// 0x0001 (0x0001 - 0x0000)
struct Emitter_RevivePlayer_C_OnEmit final
{
public:
	EEmitterResult                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Emitter_RevivePlayer_C_OnEmit;

// Function Emitter_RevivePlayer.Emitter_RevivePlayer_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Emitter_RevivePlayer_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Emitter_RevivePlayer_C_GetModuleName;

}

