#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Emitter_RayBullet

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// LuaFunction Emitter_RayBullet.Emitter_RayBullet_C.OnEmit
// 0x0001 (0x0001 - 0x0000)
struct Emitter_RayBullet_C_OnEmit final
{
public:
	EEmitterResult                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Emitter_RayBullet_C_OnEmit) == 0x000001, "Wrong alignment on Emitter_RayBullet_C_OnEmit");
static_assert(sizeof(Emitter_RayBullet_C_OnEmit) == 0x000001, "Wrong size on Emitter_RayBullet_C_OnEmit");
static_assert(offsetof(Emitter_RayBullet_C_OnEmit, ReturnValue) == 0x000000, "Member 'Emitter_RayBullet_C_OnEmit::ReturnValue' has a wrong offset!");

// Function Emitter_RayBullet.Emitter_RayBullet_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Emitter_RayBullet_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Emitter_RayBullet_C_GetModuleName) == 0x000008, "Wrong alignment on Emitter_RayBullet_C_GetModuleName");
static_assert(sizeof(Emitter_RayBullet_C_GetModuleName) == 0x000010, "Wrong size on Emitter_RayBullet_C_GetModuleName");
static_assert(offsetof(Emitter_RayBullet_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Emitter_RayBullet_C_GetModuleName::ReturnValue' has a wrong offset!");

}

