#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Emitter_SkillMove

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Emitter_SkillMove.Emitter_SkillMove_C.OnGetAssetPath
// 0x0178 (0x0178 - 0x0000)
struct Emitter_SkillMove_C_OnGetAssetPath final
{
public:
	TArray<struct FParamInfo>                     Values;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 CharacterIDs;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 SkillIDs;                                          // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 ModifierIDs;                                       // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 EmitterIDs;                                        // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FSoftObjectPath>                ReturnValue;                                       // 0x0050(0x0010)(Parm, OutParm, ReturnParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0080(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00C0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0118(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0128(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSoftClassPath                         CallFunc_MakeSoftClassPath_ReturnValue;            // 0x0150(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FSoftObjectPath>                CallFunc_GetSkillMoveAseetPath_ReturnValue;        // 0x0168(0x0010)(ReferenceParm)
};
DUMPER7_ASSERTS_Emitter_SkillMove_C_OnGetAssetPath;

// LuaFunction Emitter_SkillMove.Emitter_SkillMove_C.OnEmitTick
// 0x0004 (0x0004 - 0x0000)
struct Emitter_SkillMove_C_OnEmitTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Emitter_SkillMove_C_OnEmitTick;

// Function Emitter_SkillMove.Emitter_SkillMove_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Emitter_SkillMove_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Emitter_SkillMove_C_GetModuleName;

}

