#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Emitter_SkillMove_RushToLocationByCurve

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Emitter_SkillMove_RushToLocationByCurve.Emitter_SkillMove_RushToLocationByCurve_C.GetDefaultParamsValue
// 0x0080 (0x0080 - 0x0000)
struct Emitter_SkillMove_RushToLocationByCurve_C_GetDefaultParamsValue final
{
public:
	TArray<struct FParamInfo>                     Values;                                            // 0x0000(0x0010)(Parm, OutParm)
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo;                       // 0x0010(0x0010)()
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo_1;                     // 0x0020(0x0010)()
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo_2;                     // 0x0030(0x0010)()
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo_3;                     // 0x0040(0x0010)()
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo_4;                     // 0x0050(0x0010)()
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo_5;                     // 0x0060(0x0010)()
	TArray<struct FParamInfo>                     K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
};
static_assert(alignof(Emitter_SkillMove_RushToLocationByCurve_C_GetDefaultParamsValue) == 0x000008, "Wrong alignment on Emitter_SkillMove_RushToLocationByCurve_C_GetDefaultParamsValue");
static_assert(sizeof(Emitter_SkillMove_RushToLocationByCurve_C_GetDefaultParamsValue) == 0x000080, "Wrong size on Emitter_SkillMove_RushToLocationByCurve_C_GetDefaultParamsValue");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_GetDefaultParamsValue, Values) == 0x000000, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_GetDefaultParamsValue::Values' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_GetDefaultParamsValue, K2Node_MakeStruct_ParamInfo) == 0x000010, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_GetDefaultParamsValue::K2Node_MakeStruct_ParamInfo' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_GetDefaultParamsValue, K2Node_MakeStruct_ParamInfo_1) == 0x000020, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_GetDefaultParamsValue::K2Node_MakeStruct_ParamInfo_1' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_GetDefaultParamsValue, K2Node_MakeStruct_ParamInfo_2) == 0x000030, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_GetDefaultParamsValue::K2Node_MakeStruct_ParamInfo_2' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_GetDefaultParamsValue, K2Node_MakeStruct_ParamInfo_3) == 0x000040, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_GetDefaultParamsValue::K2Node_MakeStruct_ParamInfo_3' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_GetDefaultParamsValue, K2Node_MakeStruct_ParamInfo_4) == 0x000050, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_GetDefaultParamsValue::K2Node_MakeStruct_ParamInfo_4' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_GetDefaultParamsValue, K2Node_MakeStruct_ParamInfo_5) == 0x000060, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_GetDefaultParamsValue::K2Node_MakeStruct_ParamInfo_5' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_GetDefaultParamsValue, K2Node_MakeArray_Array) == 0x000070, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_GetDefaultParamsValue::K2Node_MakeArray_Array' has a wrong offset!");

// Function Emitter_SkillMove_RushToLocationByCurve.Emitter_SkillMove_RushToLocationByCurve_C.OnGetAssetPath
// 0x01C8 (0x01C8 - 0x0000)
struct Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath final
{
public:
	TArray<struct FParamInfo>                     Values;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 CharacterIDs;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 SkillIDs;                                          // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 ModifierIDs;                                       // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 EmitterIDs;                                        // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FSoftObjectPath>                ReturnValue;                                       // 0x0050(0x0010)(Parm, OutParm, ReturnParm)
	TArray<struct FSoftObjectPath>                OutPaths;                                          // 0x0060(0x0010)(Edit, BlueprintVisible)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0018)()
	struct FSoftObjectPath                        CallFunc_MakeSoftObjectPath_ReturnValue;           // 0x0088(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00A0(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00E0(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0100(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0148(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0158(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        CallFunc_MakeSoftObjectPath_ReturnValue_1;         // 0x0180(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        CallFunc_MakeSoftObjectPath_ReturnValue_2;         // 0x0198(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath) == 0x000008, "Wrong alignment on Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath");
static_assert(sizeof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath) == 0x0001C8, "Wrong size on Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath, Values) == 0x000000, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath::Values' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath, CharacterIDs) == 0x000010, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath::CharacterIDs' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath, SkillIDs) == 0x000020, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath::SkillIDs' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath, ModifierIDs) == 0x000030, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath::ModifierIDs' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath, EmitterIDs) == 0x000040, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath::EmitterIDs' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath, ReturnValue) == 0x000050, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath::ReturnValue' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath, OutPaths) == 0x000060, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath::OutPaths' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath, CallFunc_MakeSoftObjectPath_ReturnValue) == 0x000088, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath::CallFunc_MakeSoftObjectPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath, K2Node_MakeStruct_FormatArgumentData) == 0x0000A0, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000E0, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath, CallFunc_Array_Length_ReturnValue) == 0x0000F8, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath, K2Node_MakeStruct_FormatArgumentData_1) == 0x000100, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath, CallFunc_Greater_IntInt_ReturnValue) == 0x000140, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath, K2Node_MakeArray_Array) == 0x000148, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath, CallFunc_Format_ReturnValue) == 0x000158, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath, CallFunc_Conv_TextToString_ReturnValue) == 0x000170, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath, CallFunc_MakeSoftObjectPath_ReturnValue_1) == 0x000180, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath::CallFunc_MakeSoftObjectPath_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath, CallFunc_MakeSoftObjectPath_ReturnValue_2) == 0x000198, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath::CallFunc_MakeSoftObjectPath_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath, CallFunc_Array_Add_ReturnValue) == 0x0001B0, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath, CallFunc_Array_Length_ReturnValue_1) == 0x0001B4, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0001B8, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath, CallFunc_Array_Add_ReturnValue_1) == 0x0001BC, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath, CallFunc_Array_Add_ReturnValue_2) == 0x0001C0, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_OnGetAssetPath::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");

// LuaFunction Emitter_SkillMove_RushToLocationByCurve.Emitter_SkillMove_RushToLocationByCurve_C.OnEmitTick
// 0x0004 (0x0004 - 0x0000)
struct Emitter_SkillMove_RushToLocationByCurve_C_OnEmitTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Emitter_SkillMove_RushToLocationByCurve_C_OnEmitTick) == 0x000004, "Wrong alignment on Emitter_SkillMove_RushToLocationByCurve_C_OnEmitTick");
static_assert(sizeof(Emitter_SkillMove_RushToLocationByCurve_C_OnEmitTick) == 0x000004, "Wrong size on Emitter_SkillMove_RushToLocationByCurve_C_OnEmitTick");
static_assert(offsetof(Emitter_SkillMove_RushToLocationByCurve_C_OnEmitTick, DeltaTime) == 0x000000, "Member 'Emitter_SkillMove_RushToLocationByCurve_C_OnEmitTick::DeltaTime' has a wrong offset!");

}

