#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Emitter_SkillMove_SkillNormalMove

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// LuaFunction Emitter_SkillMove_SkillNormalMove.Emitter_SkillMove_SkillNormalMove_C.OnEmitTick
// 0x0004 (0x0004 - 0x0000)
struct Emitter_SkillMove_SkillNormalMove_C_OnEmitTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Emitter_SkillMove_SkillNormalMove_C_OnEmitTick) == 0x000004, "Wrong alignment on Emitter_SkillMove_SkillNormalMove_C_OnEmitTick");
static_assert(sizeof(Emitter_SkillMove_SkillNormalMove_C_OnEmitTick) == 0x000004, "Wrong size on Emitter_SkillMove_SkillNormalMove_C_OnEmitTick");
static_assert(offsetof(Emitter_SkillMove_SkillNormalMove_C_OnEmitTick, DeltaTime) == 0x000000, "Member 'Emitter_SkillMove_SkillNormalMove_C_OnEmitTick::DeltaTime' has a wrong offset!");

// Function Emitter_SkillMove_SkillNormalMove.Emitter_SkillMove_SkillNormalMove_C.GetDefaultParamsValue
// 0x0050 (0x0050 - 0x0000)
struct Emitter_SkillMove_SkillNormalMove_C_GetDefaultParamsValue final
{
public:
	TArray<struct FParamInfo>                     Values;                                            // 0x0000(0x0010)(Parm, OutParm)
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo;                       // 0x0010(0x0010)()
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo_1;                     // 0x0020(0x0010)()
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo_2;                     // 0x0030(0x0010)()
	TArray<struct FParamInfo>                     K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm)
};
static_assert(alignof(Emitter_SkillMove_SkillNormalMove_C_GetDefaultParamsValue) == 0x000008, "Wrong alignment on Emitter_SkillMove_SkillNormalMove_C_GetDefaultParamsValue");
static_assert(sizeof(Emitter_SkillMove_SkillNormalMove_C_GetDefaultParamsValue) == 0x000050, "Wrong size on Emitter_SkillMove_SkillNormalMove_C_GetDefaultParamsValue");
static_assert(offsetof(Emitter_SkillMove_SkillNormalMove_C_GetDefaultParamsValue, Values) == 0x000000, "Member 'Emitter_SkillMove_SkillNormalMove_C_GetDefaultParamsValue::Values' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_SkillNormalMove_C_GetDefaultParamsValue, K2Node_MakeStruct_ParamInfo) == 0x000010, "Member 'Emitter_SkillMove_SkillNormalMove_C_GetDefaultParamsValue::K2Node_MakeStruct_ParamInfo' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_SkillNormalMove_C_GetDefaultParamsValue, K2Node_MakeStruct_ParamInfo_1) == 0x000020, "Member 'Emitter_SkillMove_SkillNormalMove_C_GetDefaultParamsValue::K2Node_MakeStruct_ParamInfo_1' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_SkillNormalMove_C_GetDefaultParamsValue, K2Node_MakeStruct_ParamInfo_2) == 0x000030, "Member 'Emitter_SkillMove_SkillNormalMove_C_GetDefaultParamsValue::K2Node_MakeStruct_ParamInfo_2' has a wrong offset!");
static_assert(offsetof(Emitter_SkillMove_SkillNormalMove_C_GetDefaultParamsValue, K2Node_MakeArray_Array) == 0x000040, "Member 'Emitter_SkillMove_SkillNormalMove_C_GetDefaultParamsValue::K2Node_MakeArray_Array' has a wrong offset!");

}

