#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Emitter_CastNewSkill

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Emitter_CastNewSkill.Emitter_CastNewSkill_C.OnGetAssetPath
// 0x0090 (0x0090 - 0x0000)
struct Emitter_CastNewSkill_C_OnGetAssetPath final
{
public:
	TArray<struct FParamInfo>                     Values;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 CharacterIDs;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 SkillIDs;                                          // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 ModifierIDs;                                       // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 EmitterIDs;                                        // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FSoftObjectPath>                ReturnValue;                                       // 0x0050(0x0010)(Parm, OutParm, ReturnParm)
	TArray<int32>                                 TrapIDs;                                           // 0x0060(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetParamintValue_ReturnValue;             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSoftObjectPath>                CallFunc_GetSkillAssetPath_Paths;                  // 0x0080(0x0010)(ReferenceParm)
};
static_assert(alignof(Emitter_CastNewSkill_C_OnGetAssetPath) == 0x000008, "Wrong alignment on Emitter_CastNewSkill_C_OnGetAssetPath");
static_assert(sizeof(Emitter_CastNewSkill_C_OnGetAssetPath) == 0x000090, "Wrong size on Emitter_CastNewSkill_C_OnGetAssetPath");
static_assert(offsetof(Emitter_CastNewSkill_C_OnGetAssetPath, Values) == 0x000000, "Member 'Emitter_CastNewSkill_C_OnGetAssetPath::Values' has a wrong offset!");
static_assert(offsetof(Emitter_CastNewSkill_C_OnGetAssetPath, CharacterIDs) == 0x000010, "Member 'Emitter_CastNewSkill_C_OnGetAssetPath::CharacterIDs' has a wrong offset!");
static_assert(offsetof(Emitter_CastNewSkill_C_OnGetAssetPath, SkillIDs) == 0x000020, "Member 'Emitter_CastNewSkill_C_OnGetAssetPath::SkillIDs' has a wrong offset!");
static_assert(offsetof(Emitter_CastNewSkill_C_OnGetAssetPath, ModifierIDs) == 0x000030, "Member 'Emitter_CastNewSkill_C_OnGetAssetPath::ModifierIDs' has a wrong offset!");
static_assert(offsetof(Emitter_CastNewSkill_C_OnGetAssetPath, EmitterIDs) == 0x000040, "Member 'Emitter_CastNewSkill_C_OnGetAssetPath::EmitterIDs' has a wrong offset!");
static_assert(offsetof(Emitter_CastNewSkill_C_OnGetAssetPath, ReturnValue) == 0x000050, "Member 'Emitter_CastNewSkill_C_OnGetAssetPath::ReturnValue' has a wrong offset!");
static_assert(offsetof(Emitter_CastNewSkill_C_OnGetAssetPath, TrapIDs) == 0x000060, "Member 'Emitter_CastNewSkill_C_OnGetAssetPath::TrapIDs' has a wrong offset!");
static_assert(offsetof(Emitter_CastNewSkill_C_OnGetAssetPath, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'Emitter_CastNewSkill_C_OnGetAssetPath::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Emitter_CastNewSkill_C_OnGetAssetPath, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000074, "Member 'Emitter_CastNewSkill_C_OnGetAssetPath::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Emitter_CastNewSkill_C_OnGetAssetPath, CallFunc_GetParamintValue_ReturnValue) == 0x000078, "Member 'Emitter_CastNewSkill_C_OnGetAssetPath::CallFunc_GetParamintValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Emitter_CastNewSkill_C_OnGetAssetPath, CallFunc_GetSkillAssetPath_Paths) == 0x000080, "Member 'Emitter_CastNewSkill_C_OnGetAssetPath::CallFunc_GetSkillAssetPath_Paths' has a wrong offset!");

// LuaFunction Emitter_CastNewSkill.Emitter_CastNewSkill_C.OnEmit
// 0x0001 (0x0001 - 0x0000)
struct Emitter_CastNewSkill_C_OnEmit final
{
public:
	EEmitterResult                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Emitter_CastNewSkill_C_OnEmit) == 0x000001, "Wrong alignment on Emitter_CastNewSkill_C_OnEmit");
static_assert(sizeof(Emitter_CastNewSkill_C_OnEmit) == 0x000001, "Wrong size on Emitter_CastNewSkill_C_OnEmit");
static_assert(offsetof(Emitter_CastNewSkill_C_OnEmit, ReturnValue) == 0x000000, "Member 'Emitter_CastNewSkill_C_OnEmit::ReturnValue' has a wrong offset!");

// Function Emitter_CastNewSkill.Emitter_CastNewSkill_C.GetDefaultParamsValue
// 0x0050 (0x0050 - 0x0000)
struct Emitter_CastNewSkill_C_GetDefaultParamsValue final
{
public:
	TArray<struct FParamInfo>                     Values;                                            // 0x0000(0x0010)(Parm, OutParm)
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo;                       // 0x0010(0x0010)()
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo_1;                     // 0x0020(0x0010)()
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo_2;                     // 0x0030(0x0010)()
	TArray<struct FParamInfo>                     K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm)
};
static_assert(alignof(Emitter_CastNewSkill_C_GetDefaultParamsValue) == 0x000008, "Wrong alignment on Emitter_CastNewSkill_C_GetDefaultParamsValue");
static_assert(sizeof(Emitter_CastNewSkill_C_GetDefaultParamsValue) == 0x000050, "Wrong size on Emitter_CastNewSkill_C_GetDefaultParamsValue");
static_assert(offsetof(Emitter_CastNewSkill_C_GetDefaultParamsValue, Values) == 0x000000, "Member 'Emitter_CastNewSkill_C_GetDefaultParamsValue::Values' has a wrong offset!");
static_assert(offsetof(Emitter_CastNewSkill_C_GetDefaultParamsValue, K2Node_MakeStruct_ParamInfo) == 0x000010, "Member 'Emitter_CastNewSkill_C_GetDefaultParamsValue::K2Node_MakeStruct_ParamInfo' has a wrong offset!");
static_assert(offsetof(Emitter_CastNewSkill_C_GetDefaultParamsValue, K2Node_MakeStruct_ParamInfo_1) == 0x000020, "Member 'Emitter_CastNewSkill_C_GetDefaultParamsValue::K2Node_MakeStruct_ParamInfo_1' has a wrong offset!");
static_assert(offsetof(Emitter_CastNewSkill_C_GetDefaultParamsValue, K2Node_MakeStruct_ParamInfo_2) == 0x000030, "Member 'Emitter_CastNewSkill_C_GetDefaultParamsValue::K2Node_MakeStruct_ParamInfo_2' has a wrong offset!");
static_assert(offsetof(Emitter_CastNewSkill_C_GetDefaultParamsValue, K2Node_MakeArray_Array) == 0x000040, "Member 'Emitter_CastNewSkill_C_GetDefaultParamsValue::K2Node_MakeArray_Array' has a wrong offset!");

// Function Emitter_CastNewSkill.Emitter_CastNewSkill_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Emitter_CastNewSkill_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Emitter_CastNewSkill_C_GetModuleName) == 0x000008, "Wrong alignment on Emitter_CastNewSkill_C_GetModuleName");
static_assert(sizeof(Emitter_CastNewSkill_C_GetModuleName) == 0x000010, "Wrong size on Emitter_CastNewSkill_C_GetModuleName");
static_assert(offsetof(Emitter_CastNewSkill_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Emitter_CastNewSkill_C_GetModuleName::ReturnValue' has a wrong offset!");

}

