#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Emitter_SummonApplied

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// LuaFunction Emitter_SummonApplied.Emitter_SummonApplied_C.OnEmit
// 0x0001 (0x0001 - 0x0000)
struct Emitter_SummonApplied_C_OnEmit final
{
public:
	EEmitterResult                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Emitter_SummonApplied_C_OnEmit) == 0x000001, "Wrong alignment on Emitter_SummonApplied_C_OnEmit");
static_assert(sizeof(Emitter_SummonApplied_C_OnEmit) == 0x000001, "Wrong size on Emitter_SummonApplied_C_OnEmit");
static_assert(offsetof(Emitter_SummonApplied_C_OnEmit, ReturnValue) == 0x000000, "Member 'Emitter_SummonApplied_C_OnEmit::ReturnValue' has a wrong offset!");

// Function Emitter_SummonApplied.Emitter_SummonApplied_C.GetDefaultParamsValue
// 0x0030 (0x0030 - 0x0000)
struct Emitter_SummonApplied_C_GetDefaultParamsValue final
{
public:
	TArray<struct FParamInfo>                     Values;                                            // 0x0000(0x0010)(Parm, OutParm)
	struct FParamInfo                             K2Node_MakeStruct_ParamInfo;                       // 0x0010(0x0010)()
	TArray<struct FParamInfo>                     K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
};
static_assert(alignof(Emitter_SummonApplied_C_GetDefaultParamsValue) == 0x000008, "Wrong alignment on Emitter_SummonApplied_C_GetDefaultParamsValue");
static_assert(sizeof(Emitter_SummonApplied_C_GetDefaultParamsValue) == 0x000030, "Wrong size on Emitter_SummonApplied_C_GetDefaultParamsValue");
static_assert(offsetof(Emitter_SummonApplied_C_GetDefaultParamsValue, Values) == 0x000000, "Member 'Emitter_SummonApplied_C_GetDefaultParamsValue::Values' has a wrong offset!");
static_assert(offsetof(Emitter_SummonApplied_C_GetDefaultParamsValue, K2Node_MakeStruct_ParamInfo) == 0x000010, "Member 'Emitter_SummonApplied_C_GetDefaultParamsValue::K2Node_MakeStruct_ParamInfo' has a wrong offset!");
static_assert(offsetof(Emitter_SummonApplied_C_GetDefaultParamsValue, K2Node_MakeArray_Array) == 0x000020, "Member 'Emitter_SummonApplied_C_GetDefaultParamsValue::K2Node_MakeArray_Array' has a wrong offset!");

// Function Emitter_SummonApplied.Emitter_SummonApplied_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Emitter_SummonApplied_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Emitter_SummonApplied_C_GetModuleName) == 0x000008, "Wrong alignment on Emitter_SummonApplied_C_GetModuleName");
static_assert(sizeof(Emitter_SummonApplied_C_GetModuleName) == 0x000010, "Wrong size on Emitter_SummonApplied_C_GetModuleName");
static_assert(offsetof(Emitter_SummonApplied_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Emitter_SummonApplied_C_GetModuleName::ReturnValue' has a wrong offset!");

}

