#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Emitter_RayBullet

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Emitter_RayBullet.Emitter_RayBullet_C
// 0x04A0 (0x1130 - 0x0C90)
class UEmitter_RayBullet_C final : public USkill_Emitter
{
public:
	class UParticleSystemComponent*               PaticleRef;                                        // 0x0C90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioRef;                                          // 0x0C98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBulletInfo                            RayInfo;                                           // 0x0CA0(0x0490)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void EmitterDestroyLua();
	void OnEmitEnd();
	void OnEmitBegin();
	EEmitterResult OnEmit();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Emitter_RayBullet_C">();
	}
	static class UEmitter_RayBullet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmitter_RayBullet_C>();
	}
};
static_assert(alignof(UEmitter_RayBullet_C) == 0x000010, "Wrong alignment on UEmitter_RayBullet_C");
static_assert(sizeof(UEmitter_RayBullet_C) == 0x001130, "Wrong size on UEmitter_RayBullet_C");
static_assert(offsetof(UEmitter_RayBullet_C, PaticleRef) == 0x000C90, "Member 'UEmitter_RayBullet_C::PaticleRef' has a wrong offset!");
static_assert(offsetof(UEmitter_RayBullet_C, AudioRef) == 0x000C98, "Member 'UEmitter_RayBullet_C::AudioRef' has a wrong offset!");
static_assert(offsetof(UEmitter_RayBullet_C, RayInfo) == 0x000CA0, "Member 'UEmitter_RayBullet_C::RayInfo' has a wrong offset!");

}

