#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Emitter_TickSearchTargets

#include "Basic.hpp"


namespace SDK::Params
{

// LuaFunction Emitter_TickSearchTargets.Emitter_TickSearchTargets_C.OnEmitTick
// 0x0004 (0x0004 - 0x0000)
struct Emitter_TickSearchTargets_C_OnEmitTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Emitter_TickSearchTargets_C_OnEmitTick) == 0x000004, "Wrong alignment on Emitter_TickSearchTargets_C_OnEmitTick");
static_assert(sizeof(Emitter_TickSearchTargets_C_OnEmitTick) == 0x000004, "Wrong size on Emitter_TickSearchTargets_C_OnEmitTick");
static_assert(offsetof(Emitter_TickSearchTargets_C_OnEmitTick, DeltaTime) == 0x000000, "Member 'Emitter_TickSearchTargets_C_OnEmitTick::DeltaTime' has a wrong offset!");

// Function Emitter_TickSearchTargets.Emitter_TickSearchTargets_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Emitter_TickSearchTargets_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Emitter_TickSearchTargets_C_GetModuleName) == 0x000008, "Wrong alignment on Emitter_TickSearchTargets_C_GetModuleName");
static_assert(sizeof(Emitter_TickSearchTargets_C_GetModuleName) == 0x000010, "Wrong size on Emitter_TickSearchTargets_C_GetModuleName");
static_assert(offsetof(Emitter_TickSearchTargets_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Emitter_TickSearchTargets_C_GetModuleName::ReturnValue' has a wrong offset!");

}

