#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Emitter_Summon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Emitter_Summon.Emitter_Summon_C
// 0x0020 (0x0CA0 - 0x0C80)
class UEmitter_Summon_C final : public USkill_Emitter
{
public:
	int32                                         MaxIteratorCount;                                  // 0x0C80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MaxQueryExtent;                                    // 0x0C84(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 NavQueryFilter;                                    // 0x0C90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void TracePointToNav(const struct FVector& Location, bool bCheckNavPath, struct FVector* NewParam, bool* HasPoint);
	void OnEmitEnd();
	void EmitterDestroyLua();
	EEmitterResult OnEmit();
	TArray<struct FSoftObjectPath> OnGetAssetPath(const TArray<struct FParamInfo>& Values, TArray<int32>& CharacterIDs, TArray<int32>& SkillIDs, TArray<int32>& ModifierIDs, TArray<int32>& EmitterIDs);
	void GetDefaultParamsValue(TArray<struct FParamInfo>* Values);
	void TracePointToNav__Overridden(const struct FVector& Location, bool bCheckNavPath, struct FVector* NewParam, bool* HasPoint);
	void FindOwnerTeam(class AGameCharacter* OwnerCharacter, class FString* Team);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Emitter_Summon_C">();
	}
	static class UEmitter_Summon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmitter_Summon_C>();
	}
};
static_assert(alignof(UEmitter_Summon_C) == 0x000010, "Wrong alignment on UEmitter_Summon_C");
static_assert(sizeof(UEmitter_Summon_C) == 0x000CA0, "Wrong size on UEmitter_Summon_C");
static_assert(offsetof(UEmitter_Summon_C, MaxIteratorCount) == 0x000C80, "Member 'UEmitter_Summon_C::MaxIteratorCount' has a wrong offset!");
static_assert(offsetof(UEmitter_Summon_C, MaxQueryExtent) == 0x000C84, "Member 'UEmitter_Summon_C::MaxQueryExtent' has a wrong offset!");
static_assert(offsetof(UEmitter_Summon_C, NavQueryFilter) == 0x000C90, "Member 'UEmitter_Summon_C::NavQueryFilter' has a wrong offset!");

}

