#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Emitter_Ray

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Emitter_Ray.Emitter_Ray_C
// 0x0490 (0x1590 - 0x1100)
class UEmitter_Ray_C final : public USkill_Emitter_Ray
{
public:
	class UParticleSystemComponent*               PaticleRef;                                        // 0x1100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioRef;                                          // 0x1108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBulletInfo                            RayInfo_0;                                         // 0x1110(0x0480)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Emitter_Ray_C">();
	}
	static class UEmitter_Ray_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmitter_Ray_C>();
	}
};
static_assert(alignof(UEmitter_Ray_C) == 0x000010, "Wrong alignment on UEmitter_Ray_C");
static_assert(sizeof(UEmitter_Ray_C) == 0x001590, "Wrong size on UEmitter_Ray_C");
static_assert(offsetof(UEmitter_Ray_C, PaticleRef) == 0x001100, "Member 'UEmitter_Ray_C::PaticleRef' has a wrong offset!");
static_assert(offsetof(UEmitter_Ray_C, AudioRef) == 0x001108, "Member 'UEmitter_Ray_C::AudioRef' has a wrong offset!");
static_assert(offsetof(UEmitter_Ray_C, RayInfo_0) == 0x001110, "Member 'UEmitter_Ray_C::RayInfo_0' has a wrong offset!");

}

