#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: En000_01_bp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass en000_01_bp.en000_01_bp_C
// 0x0078 (0x02A0 - 0x0228)
class AEn000_01_bp_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     _P_;                                               // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _Starp;                                            // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _b_D__;                                            // 0x0244(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          _____;                                             // 0x0245(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_246[0x2];                                      // 0x0246(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRandomStream                          ____P;                                             // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor)
	float                                         __c__;                                             // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ______0;                                           // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           __r;                                               // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___;                                               // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____;                                              // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____j__;                                           // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _UV;                                               // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _____X;                                            // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _____Y;                                            // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______;                                           // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __PD__;                                            // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _Td__;                                             // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               __P_;                                              // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DetailMode;                                        // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDetailMode                                   Detail_Mode;                                       // 0x029C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetDetailMode(class USceneComponent* Self2);
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_en000_01_bp(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"en000_01_bp_C">();
	}
	static class AEn000_01_bp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEn000_01_bp_C>();
	}
};
static_assert(alignof(AEn000_01_bp_C) == 0x000008, "Wrong alignment on AEn000_01_bp_C");
static_assert(sizeof(AEn000_01_bp_C) == 0x0002A0, "Wrong size on AEn000_01_bp_C");
static_assert(offsetof(AEn000_01_bp_C, UberGraphFrame) == 0x000228, "Member 'AEn000_01_bp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AEn000_01_bp_C, DefaultSceneRoot) == 0x000230, "Member 'AEn000_01_bp_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AEn000_01_bp_C, _P_) == 0x000238, "Member 'AEn000_01_bp_C::_P_' has a wrong offset!");
static_assert(offsetof(AEn000_01_bp_C, _Starp) == 0x000240, "Member 'AEn000_01_bp_C::_Starp' has a wrong offset!");
static_assert(offsetof(AEn000_01_bp_C, _b_D__) == 0x000244, "Member 'AEn000_01_bp_C::_b_D__' has a wrong offset!");
static_assert(offsetof(AEn000_01_bp_C, _____) == 0x000245, "Member 'AEn000_01_bp_C::_____' has a wrong offset!");
static_assert(offsetof(AEn000_01_bp_C, ____P) == 0x000248, "Member 'AEn000_01_bp_C::____P' has a wrong offset!");
static_assert(offsetof(AEn000_01_bp_C, __c__) == 0x000250, "Member 'AEn000_01_bp_C::__c__' has a wrong offset!");
static_assert(offsetof(AEn000_01_bp_C, ______0) == 0x000254, "Member 'AEn000_01_bp_C::______0' has a wrong offset!");
static_assert(offsetof(AEn000_01_bp_C, __r) == 0x000258, "Member 'AEn000_01_bp_C::__r' has a wrong offset!");
static_assert(offsetof(AEn000_01_bp_C, ___) == 0x000268, "Member 'AEn000_01_bp_C::___' has a wrong offset!");
static_assert(offsetof(AEn000_01_bp_C, ____) == 0x00026C, "Member 'AEn000_01_bp_C::____' has a wrong offset!");
static_assert(offsetof(AEn000_01_bp_C, ____j__) == 0x000270, "Member 'AEn000_01_bp_C::____j__' has a wrong offset!");
static_assert(offsetof(AEn000_01_bp_C, _UV) == 0x000274, "Member 'AEn000_01_bp_C::_UV' has a wrong offset!");
static_assert(offsetof(AEn000_01_bp_C, _____X) == 0x000278, "Member 'AEn000_01_bp_C::_____X' has a wrong offset!");
static_assert(offsetof(AEn000_01_bp_C, _____Y) == 0x00027C, "Member 'AEn000_01_bp_C::_____Y' has a wrong offset!");
static_assert(offsetof(AEn000_01_bp_C, _______) == 0x000280, "Member 'AEn000_01_bp_C::_______' has a wrong offset!");
static_assert(offsetof(AEn000_01_bp_C, __PD__) == 0x000284, "Member 'AEn000_01_bp_C::__PD__' has a wrong offset!");
static_assert(offsetof(AEn000_01_bp_C, _Td__) == 0x000288, "Member 'AEn000_01_bp_C::_Td__' has a wrong offset!");
static_assert(offsetof(AEn000_01_bp_C, __P_) == 0x000290, "Member 'AEn000_01_bp_C::__P_' has a wrong offset!");
static_assert(offsetof(AEn000_01_bp_C, DetailMode) == 0x000298, "Member 'AEn000_01_bp_C::DetailMode' has a wrong offset!");
static_assert(offsetof(AEn000_01_bp_C, Detail_Mode) == 0x00029C, "Member 'AEn000_01_bp_C::Detail_Mode' has a wrong offset!");

}

