#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: En000_01_bp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function en000_01_bp.en000_01_bp_C.SetDetailMode
// 0x0010 (0x0010 - 0x0000)
struct En000_01_bp_C_SetDetailMode final
{
public:
	class USceneComponent*                        Self2;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_GetRenderingDetailMode_ReturnValue;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(En000_01_bp_C_SetDetailMode) == 0x000008, "Wrong alignment on En000_01_bp_C_SetDetailMode");
static_assert(sizeof(En000_01_bp_C_SetDetailMode) == 0x000010, "Wrong size on En000_01_bp_C_SetDetailMode");
static_assert(offsetof(En000_01_bp_C_SetDetailMode, Self2) == 0x000000, "Member 'En000_01_bp_C_SetDetailMode::Self2' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_SetDetailMode, CallFunc_GetRenderingDetailMode_ReturnValue) == 0x000008, "Member 'En000_01_bp_C_SetDetailMode::CallFunc_GetRenderingDetailMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_SetDetailMode, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000C, "Member 'En000_01_bp_C_SetDetailMode::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function en000_01_bp.en000_01_bp_C.UserConstructionScript
// 0x00F0 (0x00F0 - 0x0000)
struct En000_01_bp_C_UserConstructionScript final
{
public:
	struct FTransform                             ___struct_Variable;                                // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         ___int_Variable;                                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_1; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_2; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable;                                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable;                                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ___struct_Variable_1;                              // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable_1;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_1;                           // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(En000_01_bp_C_UserConstructionScript) == 0x000010, "Wrong alignment on En000_01_bp_C_UserConstructionScript");
static_assert(sizeof(En000_01_bp_C_UserConstructionScript) == 0x0000F0, "Wrong size on En000_01_bp_C_UserConstructionScript");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, ___struct_Variable) == 0x000000, "Member 'En000_01_bp_C_UserConstructionScript::___struct_Variable' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, ___int_Variable) == 0x000030, "Member 'En000_01_bp_C_UserConstructionScript::___int_Variable' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, CallFunc_Greater_IntInt_ReturnValue) == 0x000034, "Member 'En000_01_bp_C_UserConstructionScript::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000038, "Member 'En000_01_bp_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000040, "Member 'En000_01_bp_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'En000_01_bp_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00004C, "Member 'En000_01_bp_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000050, "Member 'En000_01_bp_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, CallFunc_SelectFloat_ReturnValue) == 0x000054, "Member 'En000_01_bp_C_UserConstructionScript::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x000058, "Member 'En000_01_bp_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x00005C, "Member 'En000_01_bp_C_UserConstructionScript::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000060, "Member 'En000_01_bp_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, CallFunc_RandomFloatInRangeFromStream_ReturnValue_1) == 0x000064, "Member 'En000_01_bp_C_UserConstructionScript::CallFunc_RandomFloatInRangeFromStream_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, CallFunc_RandomFloatInRangeFromStream_ReturnValue_2) == 0x000068, "Member 'En000_01_bp_C_UserConstructionScript::CallFunc_RandomFloatInRangeFromStream_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, ___float_Variable) == 0x00006C, "Member 'En000_01_bp_C_UserConstructionScript::___float_Variable' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, ___bool_Variable) == 0x000070, "Member 'En000_01_bp_C_UserConstructionScript::___bool_Variable' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, ___struct_Variable_1) == 0x000074, "Member 'En000_01_bp_C_UserConstructionScript::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, K2Node_Select_Default) == 0x000080, "Member 'En000_01_bp_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000084, "Member 'En000_01_bp_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, ___bool_Variable_1) == 0x000090, "Member 'En000_01_bp_C_UserConstructionScript::___bool_Variable_1' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue) == 0x000094, "Member 'En000_01_bp_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, K2Node_Select_Default_1) == 0x0000A0, "Member 'En000_01_bp_C_UserConstructionScript::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000AC, "Member 'En000_01_bp_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x0000B0, "Member 'En000_01_bp_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, CallFunc_AddInstance_ReturnValue) == 0x0000E0, "Member 'En000_01_bp_C_UserConstructionScript::CallFunc_AddInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(En000_01_bp_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0000E4, "Member 'En000_01_bp_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function en000_01_bp.en000_01_bp_C.ExecuteUbergraph_en000_01_bp
// 0x0004 (0x0004 - 0x0000)
struct En000_01_bp_C_ExecuteUbergraph_en000_01_bp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(En000_01_bp_C_ExecuteUbergraph_en000_01_bp) == 0x000004, "Wrong alignment on En000_01_bp_C_ExecuteUbergraph_en000_01_bp");
static_assert(sizeof(En000_01_bp_C_ExecuteUbergraph_en000_01_bp) == 0x000004, "Wrong size on En000_01_bp_C_ExecuteUbergraph_en000_01_bp");
static_assert(offsetof(En000_01_bp_C_ExecuteUbergraph_en000_01_bp, EntryPoint) == 0x000000, "Member 'En000_01_bp_C_ExecuteUbergraph_en000_01_bp::EntryPoint' has a wrong offset!");

}

