#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EQSContext_girl002_Prop02_Skill1Event_Captain

#include "Basic.hpp"


namespace SDK::Params
{

// Function EQSContext_girl002_Prop02_Skill1Event_Captain.EQSContext_girl002_Prop02_Skill1Event_Captain_C.ProvideSingleActor
// 0x0028 (0x0028 - 0x0000)
struct EQSContext_girl002_Prop02_Skill1Event_Captain_C_ProvideSingleActor final
{
public:
	class UObject*                                QuerierObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuerierActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ResultingActor;                                    // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAIEvent_Girl002_prop01_Skill1MoveToTarget_C* K2Node_DynamicCast_AsAIEvent_Girl_002_Prop_01_Skill_1Move_to_Target; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EQSContext_girl002_Prop02_Skill1Event_Captain_C_ProvideSingleActor) == 0x000008, "Wrong alignment on EQSContext_girl002_Prop02_Skill1Event_Captain_C_ProvideSingleActor");
static_assert(sizeof(EQSContext_girl002_Prop02_Skill1Event_Captain_C_ProvideSingleActor) == 0x000028, "Wrong size on EQSContext_girl002_Prop02_Skill1Event_Captain_C_ProvideSingleActor");
static_assert(offsetof(EQSContext_girl002_Prop02_Skill1Event_Captain_C_ProvideSingleActor, QuerierObject) == 0x000000, "Member 'EQSContext_girl002_Prop02_Skill1Event_Captain_C_ProvideSingleActor::QuerierObject' has a wrong offset!");
static_assert(offsetof(EQSContext_girl002_Prop02_Skill1Event_Captain_C_ProvideSingleActor, QuerierActor) == 0x000008, "Member 'EQSContext_girl002_Prop02_Skill1Event_Captain_C_ProvideSingleActor::QuerierActor' has a wrong offset!");
static_assert(offsetof(EQSContext_girl002_Prop02_Skill1Event_Captain_C_ProvideSingleActor, ResultingActor) == 0x000010, "Member 'EQSContext_girl002_Prop02_Skill1Event_Captain_C_ProvideSingleActor::ResultingActor' has a wrong offset!");
static_assert(offsetof(EQSContext_girl002_Prop02_Skill1Event_Captain_C_ProvideSingleActor, K2Node_DynamicCast_AsAIEvent_Girl_002_Prop_01_Skill_1Move_to_Target) == 0x000018, "Member 'EQSContext_girl002_Prop02_Skill1Event_Captain_C_ProvideSingleActor::K2Node_DynamicCast_AsAIEvent_Girl_002_Prop_01_Skill_1Move_to_Target' has a wrong offset!");
static_assert(offsetof(EQSContext_girl002_Prop02_Skill1Event_Captain_C_ProvideSingleActor, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'EQSContext_girl002_Prop02_Skill1Event_Captain_C_ProvideSingleActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

