#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventCounterExecute

#include "Basic.hpp"


namespace SDK::Params
{

// LuaFunction EventCounterExecute.EventCounterExecute_C.OnUpdate_Client
// 0x0014 (0x0014 - 0x0000)
struct EventCounterExecute_C_OnUpdate_Client final
{
public:
	int32                                         Param1;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param2;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param3;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param4;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param5;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EventCounterExecute_C_OnUpdate_Client) == 0x000004, "Wrong alignment on EventCounterExecute_C_OnUpdate_Client");
static_assert(sizeof(EventCounterExecute_C_OnUpdate_Client) == 0x000014, "Wrong size on EventCounterExecute_C_OnUpdate_Client");
static_assert(offsetof(EventCounterExecute_C_OnUpdate_Client, Param1) == 0x000000, "Member 'EventCounterExecute_C_OnUpdate_Client::Param1' has a wrong offset!");
static_assert(offsetof(EventCounterExecute_C_OnUpdate_Client, Param2) == 0x000004, "Member 'EventCounterExecute_C_OnUpdate_Client::Param2' has a wrong offset!");
static_assert(offsetof(EventCounterExecute_C_OnUpdate_Client, Param3) == 0x000008, "Member 'EventCounterExecute_C_OnUpdate_Client::Param3' has a wrong offset!");
static_assert(offsetof(EventCounterExecute_C_OnUpdate_Client, Param4) == 0x00000C, "Member 'EventCounterExecute_C_OnUpdate_Client::Param4' has a wrong offset!");
static_assert(offsetof(EventCounterExecute_C_OnUpdate_Client, Param5) == 0x000010, "Member 'EventCounterExecute_C_OnUpdate_Client::Param5' has a wrong offset!");

// LuaFunction EventCounterExecute.EventCounterExecute_C.GetDescription
// 0x0010 (0x0010 - 0x0000)
struct EventCounterExecute_C_GetDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EventCounterExecute_C_GetDescription) == 0x000008, "Wrong alignment on EventCounterExecute_C_GetDescription");
static_assert(sizeof(EventCounterExecute_C_GetDescription) == 0x000010, "Wrong size on EventCounterExecute_C_GetDescription");
static_assert(offsetof(EventCounterExecute_C_GetDescription, ReturnValue) == 0x000000, "Member 'EventCounterExecute_C_GetDescription::ReturnValue' has a wrong offset!");

// Function EventCounterExecute.EventCounterExecute_C.GetSpecialStaticDescription
// 0x0050 (0x0050 - 0x0000)
struct EventCounterExecute_C_GetSpecialStaticDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(EventCounterExecute_C_GetSpecialStaticDescription) == 0x000008, "Wrong alignment on EventCounterExecute_C_GetSpecialStaticDescription");
static_assert(sizeof(EventCounterExecute_C_GetSpecialStaticDescription) == 0x000050, "Wrong size on EventCounterExecute_C_GetSpecialStaticDescription");
static_assert(offsetof(EventCounterExecute_C_GetSpecialStaticDescription, ReturnValue) == 0x000000, "Member 'EventCounterExecute_C_GetSpecialStaticDescription::ReturnValue' has a wrong offset!");
static_assert(offsetof(EventCounterExecute_C_GetSpecialStaticDescription, CallFunc_Conv_IntToString_ReturnValue) == 0x000010, "Member 'EventCounterExecute_C_GetSpecialStaticDescription::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventCounterExecute_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'EventCounterExecute_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventCounterExecute_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000030, "Member 'EventCounterExecute_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventCounterExecute_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000040, "Member 'EventCounterExecute_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");

// Function EventCounterExecute.EventCounterExecute_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct EventCounterExecute_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(EventCounterExecute_C_GetModuleName) == 0x000008, "Wrong alignment on EventCounterExecute_C_GetModuleName");
static_assert(sizeof(EventCounterExecute_C_GetModuleName) == 0x000010, "Wrong size on EventCounterExecute_C_GetModuleName");
static_assert(offsetof(EventCounterExecute_C_GetModuleName, ReturnValue) == 0x000000, "Member 'EventCounterExecute_C_GetModuleName::ReturnValue' has a wrong offset!");

}

