#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExecuteFunctionEvent

#include "Basic.hpp"

#include "GameTask_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ExecuteFunctionEvent.ExecuteFunctionEvent_C
// 0x0038 (0x0190 - 0x0158)
class UExecuteFunctionEvent_C final : public UGameTaskEvent
{
public:
	class FString                                 ActorName;                                         // 0x0158(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 FunctionName;                                      // 0x0168(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	float                                         Delay;                                             // 0x0178(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MultType;                                          // 0x017C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Names;                                             // 0x0180(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteEvent(const class FString& Name_0, bool* Result);
	bool Activated();
	void Execute(bool* Result);
	bool OnTrigger();

	class FString GetSpecialStaticDescription() const;
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ExecuteFunctionEvent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExecuteFunctionEvent_C")
	}
	static class UExecuteFunctionEvent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExecuteFunctionEvent_C>();
	}
};
DUMPER7_ASSERTS_UExecuteFunctionEvent_C;

}

