#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExecuteFunctionEvent

#include "Basic.hpp"


namespace SDK::Params
{

// Function ExecuteFunctionEvent.ExecuteFunctionEvent_C.ExecuteEvent
// 0x0028 (0x0028 - 0x0000)
struct ExecuteFunctionEvent_C_ExecuteEvent final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetActorByName_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExecuteFunctionEvent_C_ExecuteEvent) == 0x000008, "Wrong alignment on ExecuteFunctionEvent_C_ExecuteEvent");
static_assert(sizeof(ExecuteFunctionEvent_C_ExecuteEvent) == 0x000028, "Wrong size on ExecuteFunctionEvent_C_ExecuteEvent");
static_assert(offsetof(ExecuteFunctionEvent_C_ExecuteEvent, Name_0) == 0x000000, "Member 'ExecuteFunctionEvent_C_ExecuteEvent::Name_0' has a wrong offset!");
static_assert(offsetof(ExecuteFunctionEvent_C_ExecuteEvent, Result) == 0x000010, "Member 'ExecuteFunctionEvent_C_ExecuteEvent::Result' has a wrong offset!");
static_assert(offsetof(ExecuteFunctionEvent_C_ExecuteEvent, CallFunc_GetActorByName_ReturnValue) == 0x000018, "Member 'ExecuteFunctionEvent_C_ExecuteEvent::CallFunc_GetActorByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExecuteFunctionEvent_C_ExecuteEvent, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'ExecuteFunctionEvent_C_ExecuteEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ExecuteFunctionEvent.ExecuteFunctionEvent_C.Activated
// 0x0002 (0x0002 - 0x0000)
struct ExecuteFunctionEvent_C_Activated final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Execute_Result;                           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExecuteFunctionEvent_C_Activated) == 0x000001, "Wrong alignment on ExecuteFunctionEvent_C_Activated");
static_assert(sizeof(ExecuteFunctionEvent_C_Activated) == 0x000002, "Wrong size on ExecuteFunctionEvent_C_Activated");
static_assert(offsetof(ExecuteFunctionEvent_C_Activated, ReturnValue) == 0x000000, "Member 'ExecuteFunctionEvent_C_Activated::ReturnValue' has a wrong offset!");
static_assert(offsetof(ExecuteFunctionEvent_C_Activated, CallFunc_Execute_Result) == 0x000001, "Member 'ExecuteFunctionEvent_C_Activated::CallFunc_Execute_Result' has a wrong offset!");

// Function ExecuteFunctionEvent.ExecuteFunctionEvent_C.Execute
// 0x0038 (0x0038 - 0x0000)
struct ExecuteFunctionEvent_C_Execute final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          RunResult;                                         // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ExecuteEvent_Result;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ExecuteEvent_Result_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExecuteFunctionEvent_C_Execute) == 0x000008, "Wrong alignment on ExecuteFunctionEvent_C_Execute");
static_assert(sizeof(ExecuteFunctionEvent_C_Execute) == 0x000038, "Wrong size on ExecuteFunctionEvent_C_Execute");
static_assert(offsetof(ExecuteFunctionEvent_C_Execute, Result) == 0x000000, "Member 'ExecuteFunctionEvent_C_Execute::Result' has a wrong offset!");
static_assert(offsetof(ExecuteFunctionEvent_C_Execute, RunResult) == 0x000001, "Member 'ExecuteFunctionEvent_C_Execute::RunResult' has a wrong offset!");
static_assert(offsetof(ExecuteFunctionEvent_C_Execute, ___int_Array_Index_Variable) == 0x000004, "Member 'ExecuteFunctionEvent_C_Execute::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ExecuteFunctionEvent_C_Execute, ___int_Loop_Counter_Variable) == 0x000008, "Member 'ExecuteFunctionEvent_C_Execute::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ExecuteFunctionEvent_C_Execute, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'ExecuteFunctionEvent_C_Execute::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExecuteFunctionEvent_C_Execute, CallFunc_ExecuteEvent_Result) == 0x000010, "Member 'ExecuteFunctionEvent_C_Execute::CallFunc_ExecuteEvent_Result' has a wrong offset!");
static_assert(offsetof(ExecuteFunctionEvent_C_Execute, CallFunc_Array_Get_Item) == 0x000018, "Member 'ExecuteFunctionEvent_C_Execute::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ExecuteFunctionEvent_C_Execute, CallFunc_ExecuteEvent_Result_1) == 0x000028, "Member 'ExecuteFunctionEvent_C_Execute::CallFunc_ExecuteEvent_Result_1' has a wrong offset!");
static_assert(offsetof(ExecuteFunctionEvent_C_Execute, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'ExecuteFunctionEvent_C_Execute::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExecuteFunctionEvent_C_Execute, CallFunc_BooleanAND_ReturnValue) == 0x000030, "Member 'ExecuteFunctionEvent_C_Execute::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExecuteFunctionEvent_C_Execute, CallFunc_Less_IntInt_ReturnValue) == 0x000031, "Member 'ExecuteFunctionEvent_C_Execute::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// LuaFunction ExecuteFunctionEvent.ExecuteFunctionEvent_C.OnTrigger
// 0x0001 (0x0001 - 0x0000)
struct ExecuteFunctionEvent_C_OnTrigger final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExecuteFunctionEvent_C_OnTrigger) == 0x000001, "Wrong alignment on ExecuteFunctionEvent_C_OnTrigger");
static_assert(sizeof(ExecuteFunctionEvent_C_OnTrigger) == 0x000001, "Wrong size on ExecuteFunctionEvent_C_OnTrigger");
static_assert(offsetof(ExecuteFunctionEvent_C_OnTrigger, ReturnValue) == 0x000000, "Member 'ExecuteFunctionEvent_C_OnTrigger::ReturnValue' has a wrong offset!");

// Function ExecuteFunctionEvent.ExecuteFunctionEvent_C.GetSpecialStaticDescription
// 0x0070 (0x0070 - 0x0000)
struct ExecuteFunctionEvent_C_GetSpecialStaticDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(ExecuteFunctionEvent_C_GetSpecialStaticDescription) == 0x000008, "Wrong alignment on ExecuteFunctionEvent_C_GetSpecialStaticDescription");
static_assert(sizeof(ExecuteFunctionEvent_C_GetSpecialStaticDescription) == 0x000070, "Wrong size on ExecuteFunctionEvent_C_GetSpecialStaticDescription");
static_assert(offsetof(ExecuteFunctionEvent_C_GetSpecialStaticDescription, ReturnValue) == 0x000000, "Member 'ExecuteFunctionEvent_C_GetSpecialStaticDescription::ReturnValue' has a wrong offset!");
static_assert(offsetof(ExecuteFunctionEvent_C_GetSpecialStaticDescription, CallFunc_Conv_FloatToString_ReturnValue) == 0x000010, "Member 'ExecuteFunctionEvent_C_GetSpecialStaticDescription::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExecuteFunctionEvent_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'ExecuteFunctionEvent_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExecuteFunctionEvent_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000030, "Member 'ExecuteFunctionEvent_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExecuteFunctionEvent_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000040, "Member 'ExecuteFunctionEvent_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ExecuteFunctionEvent_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000050, "Member 'ExecuteFunctionEvent_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ExecuteFunctionEvent_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000060, "Member 'ExecuteFunctionEvent_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");

// Function ExecuteFunctionEvent.ExecuteFunctionEvent_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct ExecuteFunctionEvent_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ExecuteFunctionEvent_C_GetModuleName) == 0x000008, "Wrong alignment on ExecuteFunctionEvent_C_GetModuleName");
static_assert(sizeof(ExecuteFunctionEvent_C_GetModuleName) == 0x000010, "Wrong size on ExecuteFunctionEvent_C_GetModuleName");
static_assert(offsetof(ExecuteFunctionEvent_C_GetModuleName, ReturnValue) == 0x000000, "Member 'ExecuteFunctionEvent_C_GetModuleName::ReturnValue' has a wrong offset!");

}

