#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExpFog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ExpFog.ExpFog_C
// 0x0148 (0x0400 - 0x02B8)
class AExpFog_C final : public AFogActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableExpFog;                                     // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     FogMat;                                            // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               FogDynamicMat;                                     // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnablePost;                                       // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           TwostFogColor;                                     // 0x02EC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TwostFogColor_Child;                               // 0x02FC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogDensity;                                   // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogDensity_Child;                             // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogHeightMax;                                 // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogHeightMax_Child;                           // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogHeightMin;                                 // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogHeightMin_Child;                           // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogHeightFade;                                // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogHeightFade_Child;                          // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogHeightOffset;                              // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogHeightOffset_Child;                        // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogForWardFallOff;                            // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogHeightFadeExp;                             // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UseHighOcclusionFog;                               // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogNoiseIntensity;                            // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogNoiseSize;                                 // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogNoiseSpeed;                                // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogNoiseClampXOffset;                         // 0x034C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogNoiseClampZOffset;                         // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TwostFogNoiseOffsetVector;                         // 0x0354(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UExponentialHeightFogComponent*         VolumetricFog;                                     // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VFogDensity;                                       // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VFogHeightFalloff;                                 // 0x037C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           VFogInscatteringColor;                             // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VFogMaxOpacity;                                    // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VFogStartDistance;                                 // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VFogCutoffDistance;                                // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VFogDirectionalInscatteringExponent;               // 0x039C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VFogDirectionalInscatteringStartDistance;          // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           VFogDirectionalInscatteringColor;                  // 0x03A4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VFogExtinctionScale;                               // 0x03B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VFogLowQualityExtinctionScale;                     // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AExponentialHeightFog*                  SpawnFogActor;                                     // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableSceneDepth;                                 // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x3];                                      // 0x03C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SceneDepthScale;                                   // 0x03CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             SpawnFogTransform;                                 // 0x03D0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	bool IsFogEnabled();
	void Get_Initialization_Fog_Var(class FName FogDataName);
	void UseSceneDepthCull();
	void RevertVolumetricFogParam(class UExponentialHeightFogComponent* FogComponent);
	void InitVolumetricFogParam(class UExponentialHeightFogComponent* FogComponent);
	void Set_Vertex_Fog_Param(class UExponentialHeightFogComponent* VertexCom);
	void Enable_Post_Fog_Control_Param();
	void UpdateFromOldFog(float Fog_Density, const struct FLinearColor& Fog_Inscattering_Color, float Fog_Max_Opacity, float Fog_Height_Falloff, float Start_Distance, float Fog_Cutoff_Distance, float Directional_Inscattering_Exponent, float Directional_Inscattering_Start_Distance, const struct FLinearColor& Directional_Inscattering_Color, bool bEnabled);
	void Set_Fog_Parameter(const struct FLinearColor& Fog_Inscattering_Color, float Fog_Density, float Fog_Height_Falloff, float Fog_Max_Opaciy, float Start_Distance, float TwostFogHeightMax_Child_0, float TwostFogHeightMin_Child_0, const struct FLinearColor& TwostFogColor_Child_0, float TwostFogHeightFade_Child_0, float TwostFogDensity_Child_0, float TwostFogHeightOffsetVector_Child, float FogCustomHeight);
	void Set_Fog_Var(class UMaterialInstanceDynamic* Mat);
	void Update2stFog();
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void SetPPEnable(bool Value);
	void OnVolumetricFogChanged();
	void CreateVertexFog();
	void Entry06();
	void CloseFog();
	void OpenFog();
	void DisableFog(class FName FogName);
	void ExecuteUbergraph_ExpFog(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ExpFog_C">();
	}
	static class AExpFog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AExpFog_C>();
	}
};
static_assert(alignof(AExpFog_C) == 0x000010, "Wrong alignment on AExpFog_C");
static_assert(sizeof(AExpFog_C) == 0x000400, "Wrong size on AExpFog_C");
static_assert(offsetof(AExpFog_C, UberGraphFrame) == 0x0002B8, "Member 'AExpFog_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AExpFog_C, PostProcess) == 0x0002C0, "Member 'AExpFog_C::PostProcess' has a wrong offset!");
static_assert(offsetof(AExpFog_C, DefaultSceneRoot) == 0x0002C8, "Member 'AExpFog_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AExpFog_C, bEnableExpFog) == 0x0002D0, "Member 'AExpFog_C::bEnableExpFog' has a wrong offset!");
static_assert(offsetof(AExpFog_C, FogMat) == 0x0002D8, "Member 'AExpFog_C::FogMat' has a wrong offset!");
static_assert(offsetof(AExpFog_C, FogDynamicMat) == 0x0002E0, "Member 'AExpFog_C::FogDynamicMat' has a wrong offset!");
static_assert(offsetof(AExpFog_C, bEnablePost) == 0x0002E8, "Member 'AExpFog_C::bEnablePost' has a wrong offset!");
static_assert(offsetof(AExpFog_C, TwostFogColor) == 0x0002EC, "Member 'AExpFog_C::TwostFogColor' has a wrong offset!");
static_assert(offsetof(AExpFog_C, TwostFogColor_Child) == 0x0002FC, "Member 'AExpFog_C::TwostFogColor_Child' has a wrong offset!");
static_assert(offsetof(AExpFog_C, TwostFogDensity) == 0x00030C, "Member 'AExpFog_C::TwostFogDensity' has a wrong offset!");
static_assert(offsetof(AExpFog_C, TwostFogDensity_Child) == 0x000310, "Member 'AExpFog_C::TwostFogDensity_Child' has a wrong offset!");
static_assert(offsetof(AExpFog_C, TwostFogHeightMax) == 0x000314, "Member 'AExpFog_C::TwostFogHeightMax' has a wrong offset!");
static_assert(offsetof(AExpFog_C, TwostFogHeightMax_Child) == 0x000318, "Member 'AExpFog_C::TwostFogHeightMax_Child' has a wrong offset!");
static_assert(offsetof(AExpFog_C, TwostFogHeightMin) == 0x00031C, "Member 'AExpFog_C::TwostFogHeightMin' has a wrong offset!");
static_assert(offsetof(AExpFog_C, TwostFogHeightMin_Child) == 0x000320, "Member 'AExpFog_C::TwostFogHeightMin_Child' has a wrong offset!");
static_assert(offsetof(AExpFog_C, TwostFogHeightFade) == 0x000324, "Member 'AExpFog_C::TwostFogHeightFade' has a wrong offset!");
static_assert(offsetof(AExpFog_C, TwostFogHeightFade_Child) == 0x000328, "Member 'AExpFog_C::TwostFogHeightFade_Child' has a wrong offset!");
static_assert(offsetof(AExpFog_C, TwostFogHeightOffset) == 0x00032C, "Member 'AExpFog_C::TwostFogHeightOffset' has a wrong offset!");
static_assert(offsetof(AExpFog_C, TwostFogHeightOffset_Child) == 0x000330, "Member 'AExpFog_C::TwostFogHeightOffset_Child' has a wrong offset!");
static_assert(offsetof(AExpFog_C, TwostFogForWardFallOff) == 0x000334, "Member 'AExpFog_C::TwostFogForWardFallOff' has a wrong offset!");
static_assert(offsetof(AExpFog_C, TwostFogHeightFadeExp) == 0x000338, "Member 'AExpFog_C::TwostFogHeightFadeExp' has a wrong offset!");
static_assert(offsetof(AExpFog_C, UseHighOcclusionFog) == 0x00033C, "Member 'AExpFog_C::UseHighOcclusionFog' has a wrong offset!");
static_assert(offsetof(AExpFog_C, TwostFogNoiseIntensity) == 0x000340, "Member 'AExpFog_C::TwostFogNoiseIntensity' has a wrong offset!");
static_assert(offsetof(AExpFog_C, TwostFogNoiseSize) == 0x000344, "Member 'AExpFog_C::TwostFogNoiseSize' has a wrong offset!");
static_assert(offsetof(AExpFog_C, TwostFogNoiseSpeed) == 0x000348, "Member 'AExpFog_C::TwostFogNoiseSpeed' has a wrong offset!");
static_assert(offsetof(AExpFog_C, TwostFogNoiseClampXOffset) == 0x00034C, "Member 'AExpFog_C::TwostFogNoiseClampXOffset' has a wrong offset!");
static_assert(offsetof(AExpFog_C, TwostFogNoiseClampZOffset) == 0x000350, "Member 'AExpFog_C::TwostFogNoiseClampZOffset' has a wrong offset!");
static_assert(offsetof(AExpFog_C, TwostFogNoiseOffsetVector) == 0x000354, "Member 'AExpFog_C::TwostFogNoiseOffsetVector' has a wrong offset!");
static_assert(offsetof(AExpFog_C, Color) == 0x000360, "Member 'AExpFog_C::Color' has a wrong offset!");
static_assert(offsetof(AExpFog_C, VolumetricFog) == 0x000370, "Member 'AExpFog_C::VolumetricFog' has a wrong offset!");
static_assert(offsetof(AExpFog_C, VFogDensity) == 0x000378, "Member 'AExpFog_C::VFogDensity' has a wrong offset!");
static_assert(offsetof(AExpFog_C, VFogHeightFalloff) == 0x00037C, "Member 'AExpFog_C::VFogHeightFalloff' has a wrong offset!");
static_assert(offsetof(AExpFog_C, VFogInscatteringColor) == 0x000380, "Member 'AExpFog_C::VFogInscatteringColor' has a wrong offset!");
static_assert(offsetof(AExpFog_C, VFogMaxOpacity) == 0x000390, "Member 'AExpFog_C::VFogMaxOpacity' has a wrong offset!");
static_assert(offsetof(AExpFog_C, VFogStartDistance) == 0x000394, "Member 'AExpFog_C::VFogStartDistance' has a wrong offset!");
static_assert(offsetof(AExpFog_C, VFogCutoffDistance) == 0x000398, "Member 'AExpFog_C::VFogCutoffDistance' has a wrong offset!");
static_assert(offsetof(AExpFog_C, VFogDirectionalInscatteringExponent) == 0x00039C, "Member 'AExpFog_C::VFogDirectionalInscatteringExponent' has a wrong offset!");
static_assert(offsetof(AExpFog_C, VFogDirectionalInscatteringStartDistance) == 0x0003A0, "Member 'AExpFog_C::VFogDirectionalInscatteringStartDistance' has a wrong offset!");
static_assert(offsetof(AExpFog_C, VFogDirectionalInscatteringColor) == 0x0003A4, "Member 'AExpFog_C::VFogDirectionalInscatteringColor' has a wrong offset!");
static_assert(offsetof(AExpFog_C, VFogExtinctionScale) == 0x0003B4, "Member 'AExpFog_C::VFogExtinctionScale' has a wrong offset!");
static_assert(offsetof(AExpFog_C, VFogLowQualityExtinctionScale) == 0x0003B8, "Member 'AExpFog_C::VFogLowQualityExtinctionScale' has a wrong offset!");
static_assert(offsetof(AExpFog_C, SpawnFogActor) == 0x0003C0, "Member 'AExpFog_C::SpawnFogActor' has a wrong offset!");
static_assert(offsetof(AExpFog_C, bEnableSceneDepth) == 0x0003C8, "Member 'AExpFog_C::bEnableSceneDepth' has a wrong offset!");
static_assert(offsetof(AExpFog_C, SceneDepthScale) == 0x0003CC, "Member 'AExpFog_C::SceneDepthScale' has a wrong offset!");
static_assert(offsetof(AExpFog_C, SpawnFogTransform) == 0x0003D0, "Member 'AExpFog_C::SpawnFogTransform' has a wrong offset!");

}

