#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExplosiveBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ExplosiveBase.ExplosiveBase_C
// 0x00F0 (0x1560 - 0x1470)
class AExplosiveBase_C : public AExplosiveActorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        WarningPoint;                                      // 0x1478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBulletBoxComponent*                    WarningBoxLocation;                                // 0x1480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNavModifierComponent*                  NavModifier;                                       // 0x1488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ReplaceMesh;                                       // 0x1490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   After;                                             // 0x1498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Before;                                            // 0x14A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x14A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        FxLocation;                                        // 0x14B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         DieSkillID;                                        // 0x14B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WarningTime;                                       // 0x14BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 WwisseDie;                                         // 0x14C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WwiseTrap;                                         // 0x14D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FTransform                             FxScale;                                           // 0x14E0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UFXSystemComponent*                     WarningParicle;                                    // 0x1510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CastShadow;                                        // 0x1518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Outline;                                           // 0x1519(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151A[0x6];                                     // 0x151A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AWarningTipActor_C*                     TipActor;                                          // 0x1520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Aimed;                                             // 0x1528(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bSetHpShowDistance;                                // 0x1529(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCull;                                             // 0x152A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShowWarningCircle;                                // 0x152B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bInitShadow;                                       // 0x152C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_152D[0x3];                                     // 0x152D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       MaterialInstanceTemp;                              // 0x1530(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                OriginSence;                                       // 0x1540(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isAttach;                                          // 0x154C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_154D[0x3];                                     // 0x154D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              ExplosiveMessage;                                  // 0x1550(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void CheckCull();
	void SetHpShowDistance();
	void ChangeTickInteral();
	void Detach();
	void TryAttach();
	void RecordScenePos();
	void ResetSence();
	void UpdateMaterils();
	void SetShadow();
	void SetCullDistance();
	void SetupInShadow();
	void CheckCull__Overridden();
	void SetHpShowDistance__Overridden();
	int32 GetDieSkillId();
	void SpawnWarningParicle(bool bActive);
	void UpdateSecondaryMaterils(class UMeshComponent* Mesh_0);
	void UserConstructionScript();
	void NotifyAim(bool bAim);
	void OnDie(class AGameCharacter* Who, class AGameCharacter* Killer, const struct FHealthChangeValue& HealthChangeValue);
	void RPC_Explosive(bool ShowCollision, bool OldMesh, bool NewMesh);
	void OnSwitchWarn(bool InWarn);
	void OnSpawn();
	void UpdateData();
	void DealFunOnSpawn();
	void DealFuncOnEnd();
	void OnRecycle();
	void ExecuteUbergraph_ExplosiveBase(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ExplosiveBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExplosiveBase_C")
	}
	static class AExplosiveBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AExplosiveBase_C>();
	}
};
DUMPER7_ASSERTS_AExplosiveBase_C;

}

