#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Explosive_Die

#include "Basic.hpp"

#include "Game_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Explosive_Die.Explosive_Die_C
// 0x0018 (0x0040 - 0x0028)
class UExplosive_Die_C final : public UCanInteractActor_Event
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          HideMesh;                                          // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShowCollision;                                     // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WarningScale;                                      // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewMesh;                                           // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OldMesh;                                           // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void Execute_Client(class AActor* InteractPlayer);
	void Execute_Server(class AActor* InteractPlayer, class AActor* InteractActor);
	void Explosive();
	void ExecuteUbergraph_Explosive_Die(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Explosive_Die_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Explosive_Die_C")
	}
	static class UExplosive_Die_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExplosive_Die_C>();
	}
};
DUMPER7_ASSERTS_UExplosive_Die_C;

}

