#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExplosiveBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function ExplosiveBase.ExplosiveBase_C.ChangeTickInteral
// 0x000C (0x000C - 0x0000)
struct ExplosiveBase_C_ChangeTickInteral final
{
public:
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ExplosiveBase_C_ChangeTickInteral) == 0x000004, "Wrong alignment on ExplosiveBase_C_ChangeTickInteral");
static_assert(sizeof(ExplosiveBase_C_ChangeTickInteral) == 0x00000C, "Wrong size on ExplosiveBase_C_ChangeTickInteral");
static_assert(offsetof(ExplosiveBase_C_ChangeTickInteral, CallFunc_RandomFloat_ReturnValue) == 0x000000, "Member 'ExplosiveBase_C_ChangeTickInteral::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_ChangeTickInteral, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'ExplosiveBase_C_ChangeTickInteral::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_ChangeTickInteral, CallFunc_Add_FloatFloat_ReturnValue) == 0x000008, "Member 'ExplosiveBase_C_ChangeTickInteral::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function ExplosiveBase.ExplosiveBase_C.TryAttach
// 0x0070 (0x0070 - 0x0000)
struct ExplosiveBase_C_TryAttach final
{
public:
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATransporterBase*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ReferenceParm)
	class ATransporterBase*                       CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	class FString                                 CallFunc_GetStringData_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExplosiveBase_C_TryAttach) == 0x000008, "Wrong alignment on ExplosiveBase_C_TryAttach");
static_assert(sizeof(ExplosiveBase_C_TryAttach) == 0x000070, "Wrong size on ExplosiveBase_C_TryAttach");
static_assert(offsetof(ExplosiveBase_C_TryAttach, ___int_Loop_Counter_Variable) == 0x000000, "Member 'ExplosiveBase_C_TryAttach::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_TryAttach, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'ExplosiveBase_C_TryAttach::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_TryAttach, ___int_Array_Index_Variable) == 0x000008, "Member 'ExplosiveBase_C_TryAttach::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_TryAttach, ___int_Array_Index_Variable_1) == 0x00000C, "Member 'ExplosiveBase_C_TryAttach::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_TryAttach, ___int_Loop_Counter_Variable_1) == 0x000010, "Member 'ExplosiveBase_C_TryAttach::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_TryAttach, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'ExplosiveBase_C_TryAttach::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_TryAttach, CallFunc_GetAllActorsOfClass_OutActors) == 0x000018, "Member 'ExplosiveBase_C_TryAttach::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_TryAttach, CallFunc_Array_Get_Item) == 0x000028, "Member 'ExplosiveBase_C_TryAttach::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_TryAttach, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'ExplosiveBase_C_TryAttach::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_TryAttach, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'ExplosiveBase_C_TryAttach::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_TryAttach, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000038, "Member 'ExplosiveBase_C_TryAttach::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_TryAttach, CallFunc_GetStringData_ReturnValue) == 0x000048, "Member 'ExplosiveBase_C_TryAttach::CallFunc_GetStringData_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_TryAttach, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'ExplosiveBase_C_TryAttach::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_TryAttach, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000060, "Member 'ExplosiveBase_C_TryAttach::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_TryAttach, CallFunc_IsEmpty_ReturnValue) == 0x000061, "Member 'ExplosiveBase_C_TryAttach::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_TryAttach, CallFunc_Array_Length_ReturnValue_1) == 0x000064, "Member 'ExplosiveBase_C_TryAttach::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_TryAttach, CallFunc_Less_IntInt_ReturnValue_1) == 0x000068, "Member 'ExplosiveBase_C_TryAttach::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function ExplosiveBase.ExplosiveBase_C.SetShadow
// 0x0001 (0x0001 - 0x0000)
struct ExplosiveBase_C_SetShadow final
{
public:
	EComponentMobility                            NewMobility;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ExplosiveBase_C_SetShadow) == 0x000001, "Wrong alignment on ExplosiveBase_C_SetShadow");
static_assert(sizeof(ExplosiveBase_C_SetShadow) == 0x000001, "Wrong size on ExplosiveBase_C_SetShadow");
static_assert(offsetof(ExplosiveBase_C_SetShadow, NewMobility) == 0x000000, "Member 'ExplosiveBase_C_SetShadow::NewMobility' has a wrong offset!");

// Function ExplosiveBase.ExplosiveBase_C.SetupInShadow
// 0x00B8 (0x00B8 - 0x0000)
struct ExplosiveBase_C_SetupInShadow final
{
public:
	int32                                         ___int_Array_Index_Variable;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_2;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0038(0x0010)(ReferenceParm)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue_1;               // 0x0048(0x0010)(ReferenceParm)
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Array_Get_Item_2;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_DynamicCast_As____;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      K2Node_DynamicCast_As_____1;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable_2;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ExplosiveBase_C_SetupInShadow) == 0x000008, "Wrong alignment on ExplosiveBase_C_SetupInShadow");
static_assert(sizeof(ExplosiveBase_C_SetupInShadow) == 0x0000B8, "Wrong size on ExplosiveBase_C_SetupInShadow");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, ___int_Array_Index_Variable) == 0x000000, "Member 'ExplosiveBase_C_SetupInShadow::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, ___int_Array_Index_Variable_1) == 0x000004, "Member 'ExplosiveBase_C_SetupInShadow::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, ___int_Loop_Counter_Variable) == 0x000008, "Member 'ExplosiveBase_C_SetupInShadow::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'ExplosiveBase_C_SetupInShadow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, ___int_Array_Index_Variable_2) == 0x000010, "Member 'ExplosiveBase_C_SetupInShadow::___int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, CallFunc_Array_Get_Item) == 0x000018, "Member 'ExplosiveBase_C_SetupInShadow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'ExplosiveBase_C_SetupInShadow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, CallFunc_Array_Length_ReturnValue_1) == 0x000024, "Member 'ExplosiveBase_C_SetupInShadow::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'ExplosiveBase_C_SetupInShadow::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, ___int_Loop_Counter_Variable_1) == 0x00002C, "Member 'ExplosiveBase_C_SetupInShadow::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'ExplosiveBase_C_SetupInShadow::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'ExplosiveBase_C_SetupInShadow::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, CallFunc_GetMaterials_ReturnValue) == 0x000038, "Member 'ExplosiveBase_C_SetupInShadow::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, CallFunc_GetMaterials_ReturnValue_1) == 0x000048, "Member 'ExplosiveBase_C_SetupInShadow::CallFunc_GetMaterials_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'ExplosiveBase_C_SetupInShadow::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, CallFunc_Array_Get_Item_2) == 0x000060, "Member 'ExplosiveBase_C_SetupInShadow::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, K2Node_DynamicCast_As____) == 0x000068, "Member 'ExplosiveBase_C_SetupInShadow::K2Node_DynamicCast_As____' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'ExplosiveBase_C_SetupInShadow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, K2Node_DynamicCast_As_____1) == 0x000078, "Member 'ExplosiveBase_C_SetupInShadow::K2Node_DynamicCast_As_____1' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'ExplosiveBase_C_SetupInShadow::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000088, "Member 'ExplosiveBase_C_SetupInShadow::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000090, "Member 'ExplosiveBase_C_SetupInShadow::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, CallFunc_Array_Add_ReturnValue) == 0x000098, "Member 'ExplosiveBase_C_SetupInShadow::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, CallFunc_Array_Add_ReturnValue_1) == 0x00009C, "Member 'ExplosiveBase_C_SetupInShadow::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, CallFunc_Array_Length_ReturnValue_2) == 0x0000A0, "Member 'ExplosiveBase_C_SetupInShadow::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, CallFunc_Array_Length_ReturnValue_3) == 0x0000A4, "Member 'ExplosiveBase_C_SetupInShadow::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A8, "Member 'ExplosiveBase_C_SetupInShadow::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, ___int_Loop_Counter_Variable_2) == 0x0000AC, "Member 'ExplosiveBase_C_SetupInShadow::___int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000B0, "Member 'ExplosiveBase_C_SetupInShadow::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetupInShadow, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000B4, "Member 'ExplosiveBase_C_SetupInShadow::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function ExplosiveBase.ExplosiveBase_C.CheckCull__Overridden
// 0x0009 (0x0009 - 0x0000)
struct ExplosiveBase_C_CheckCull__Overridden final
{
public:
	bool                                          TempCull;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckDistanceCull_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetBoomWarn_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExplosiveBase_C_CheckCull__Overridden) == 0x000001, "Wrong alignment on ExplosiveBase_C_CheckCull__Overridden");
static_assert(sizeof(ExplosiveBase_C_CheckCull__Overridden) == 0x000009, "Wrong size on ExplosiveBase_C_CheckCull__Overridden");
static_assert(offsetof(ExplosiveBase_C_CheckCull__Overridden, TempCull) == 0x000000, "Member 'ExplosiveBase_C_CheckCull__Overridden::TempCull' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_CheckCull__Overridden, CallFunc_CheckDistanceCull_ReturnValue) == 0x000001, "Member 'ExplosiveBase_C_CheckCull__Overridden::CallFunc_CheckDistanceCull_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_CheckCull__Overridden, CallFunc_IsDedicatedServer_ReturnValue) == 0x000002, "Member 'ExplosiveBase_C_CheckCull__Overridden::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_CheckCull__Overridden, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'ExplosiveBase_C_CheckCull__Overridden::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_CheckCull__Overridden, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000004, "Member 'ExplosiveBase_C_CheckCull__Overridden::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_CheckCull__Overridden, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'ExplosiveBase_C_CheckCull__Overridden::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_CheckCull__Overridden, CallFunc_GetBoomWarn_ReturnValue) == 0x000006, "Member 'ExplosiveBase_C_CheckCull__Overridden::CallFunc_GetBoomWarn_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_CheckCull__Overridden, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'ExplosiveBase_C_CheckCull__Overridden::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_CheckCull__Overridden, CallFunc_BooleanAND_ReturnValue_1) == 0x000008, "Member 'ExplosiveBase_C_CheckCull__Overridden::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function ExplosiveBase.ExplosiveBase_C.SetHpShowDistance__Overridden
// 0x0003 (0x0003 - 0x0000)
struct ExplosiveBase_C_SetHpShowDistance__Overridden final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetShowDistance_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExplosiveBase_C_SetHpShowDistance__Overridden) == 0x000001, "Wrong alignment on ExplosiveBase_C_SetHpShowDistance__Overridden");
static_assert(sizeof(ExplosiveBase_C_SetHpShowDistance__Overridden) == 0x000003, "Wrong size on ExplosiveBase_C_SetHpShowDistance__Overridden");
static_assert(offsetof(ExplosiveBase_C_SetHpShowDistance__Overridden, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'ExplosiveBase_C_SetHpShowDistance__Overridden::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetHpShowDistance__Overridden, CallFunc_SetShowDistance_ReturnValue) == 0x000001, "Member 'ExplosiveBase_C_SetHpShowDistance__Overridden::CallFunc_SetShowDistance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetHpShowDistance__Overridden, CallFunc_BooleanOR_ReturnValue) == 0x000002, "Member 'ExplosiveBase_C_SetHpShowDistance__Overridden::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function ExplosiveBase.ExplosiveBase_C.GetDieSkillId
// 0x0004 (0x0004 - 0x0000)
struct ExplosiveBase_C_GetDieSkillId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ExplosiveBase_C_GetDieSkillId) == 0x000004, "Wrong alignment on ExplosiveBase_C_GetDieSkillId");
static_assert(sizeof(ExplosiveBase_C_GetDieSkillId) == 0x000004, "Wrong size on ExplosiveBase_C_GetDieSkillId");
static_assert(offsetof(ExplosiveBase_C_GetDieSkillId, ReturnValue) == 0x000000, "Member 'ExplosiveBase_C_GetDieSkillId::ReturnValue' has a wrong offset!");

// Function ExplosiveBase.ExplosiveBase_C.SpawnWarningParicle
// 0x00C0 (0x00C0 - 0x0000)
struct ExplosiveBase_C_SpawnWarningParicle final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetBoomWarn_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_SpawnActorFromClass_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWarningTipActor_C*                     K2Node_DynamicCast_AsWarning_Tip_Actor;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExplosiveBase_C_SpawnWarningParicle) == 0x000010, "Wrong alignment on ExplosiveBase_C_SpawnWarningParicle");
static_assert(sizeof(ExplosiveBase_C_SpawnWarningParicle) == 0x0000C0, "Wrong size on ExplosiveBase_C_SpawnWarningParicle");
static_assert(offsetof(ExplosiveBase_C_SpawnWarningParicle, bActive) == 0x000000, "Member 'ExplosiveBase_C_SpawnWarningParicle::bActive' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SpawnWarningParicle, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000004, "Member 'ExplosiveBase_C_SpawnWarningParicle::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SpawnWarningParicle, CallFunc_BreakVector_X) == 0x000010, "Member 'ExplosiveBase_C_SpawnWarningParicle::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SpawnWarningParicle, CallFunc_BreakVector_Y) == 0x000014, "Member 'ExplosiveBase_C_SpawnWarningParicle::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SpawnWarningParicle, CallFunc_BreakVector_Z) == 0x000018, "Member 'ExplosiveBase_C_SpawnWarningParicle::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SpawnWarningParicle, CallFunc_Not_PreBool_ReturnValue) == 0x00001C, "Member 'ExplosiveBase_C_SpawnWarningParicle::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SpawnWarningParicle, CallFunc_GetBoomWarn_ReturnValue) == 0x00001D, "Member 'ExplosiveBase_C_SpawnWarningParicle::CallFunc_GetBoomWarn_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SpawnWarningParicle, CallFunc_BooleanAND_ReturnValue) == 0x00001E, "Member 'ExplosiveBase_C_SpawnWarningParicle::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SpawnWarningParicle, CallFunc_BreakTransform_Location) == 0x000020, "Member 'ExplosiveBase_C_SpawnWarningParicle::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SpawnWarningParicle, CallFunc_BreakTransform_Rotation) == 0x00002C, "Member 'ExplosiveBase_C_SpawnWarningParicle::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SpawnWarningParicle, CallFunc_BreakTransform_Scale) == 0x000038, "Member 'ExplosiveBase_C_SpawnWarningParicle::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SpawnWarningParicle, CallFunc_BooleanAND_ReturnValue_1) == 0x000044, "Member 'ExplosiveBase_C_SpawnWarningParicle::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SpawnWarningParicle, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000048, "Member 'ExplosiveBase_C_SpawnWarningParicle::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SpawnWarningParicle, CallFunc_MakeVector_ReturnValue) == 0x00004C, "Member 'ExplosiveBase_C_SpawnWarningParicle::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SpawnWarningParicle, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'ExplosiveBase_C_SpawnWarningParicle::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SpawnWarningParicle, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'ExplosiveBase_C_SpawnWarningParicle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SpawnWarningParicle, CallFunc_SpawnActorFromClass_ReturnValue) == 0x000098, "Member 'ExplosiveBase_C_SpawnWarningParicle::CallFunc_SpawnActorFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SpawnWarningParicle, CallFunc_IsValid_ReturnValue_1) == 0x0000A0, "Member 'ExplosiveBase_C_SpawnWarningParicle::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SpawnWarningParicle, K2Node_DynamicCast_AsWarning_Tip_Actor) == 0x0000A8, "Member 'ExplosiveBase_C_SpawnWarningParicle::K2Node_DynamicCast_AsWarning_Tip_Actor' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SpawnWarningParicle, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'ExplosiveBase_C_SpawnWarningParicle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SpawnWarningParicle, CallFunc_IsValid_ReturnValue_2) == 0x0000B1, "Member 'ExplosiveBase_C_SpawnWarningParicle::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function ExplosiveBase.ExplosiveBase_C.UpdateSecondaryMaterils
// 0x0028 (0x0028 - 0x0000)
struct ExplosiveBase_C_UpdateSecondaryMaterils final
{
public:
	class UMeshComponent*                         Mesh_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UMaterialInterface*               ___object_Variable;                                // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ExplosiveBase_C_UpdateSecondaryMaterils) == 0x000008, "Wrong alignment on ExplosiveBase_C_UpdateSecondaryMaterils");
static_assert(sizeof(ExplosiveBase_C_UpdateSecondaryMaterils) == 0x000028, "Wrong size on ExplosiveBase_C_UpdateSecondaryMaterils");
static_assert(offsetof(ExplosiveBase_C_UpdateSecondaryMaterils, Mesh_0) == 0x000000, "Member 'ExplosiveBase_C_UpdateSecondaryMaterils::Mesh_0' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_UpdateSecondaryMaterils, ___object_Variable) == 0x000008, "Member 'ExplosiveBase_C_UpdateSecondaryMaterils::___object_Variable' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_UpdateSecondaryMaterils, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'ExplosiveBase_C_UpdateSecondaryMaterils::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_UpdateSecondaryMaterils, CallFunc_GetNumMaterials_ReturnValue) == 0x000014, "Member 'ExplosiveBase_C_UpdateSecondaryMaterils::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_UpdateSecondaryMaterils, ___int_Array_Index_Variable) == 0x000018, "Member 'ExplosiveBase_C_UpdateSecondaryMaterils::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_UpdateSecondaryMaterils, ___int_Loop_Counter_Variable) == 0x00001C, "Member 'ExplosiveBase_C_UpdateSecondaryMaterils::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_UpdateSecondaryMaterils, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'ExplosiveBase_C_UpdateSecondaryMaterils::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_UpdateSecondaryMaterils, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'ExplosiveBase_C_UpdateSecondaryMaterils::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function ExplosiveBase.ExplosiveBase_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct ExplosiveBase_C_UserConstructionScript final
{
public:
	EComponentMobility                            NewMobility;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExplosiveBase_C_UserConstructionScript) == 0x000008, "Wrong alignment on ExplosiveBase_C_UserConstructionScript");
static_assert(sizeof(ExplosiveBase_C_UserConstructionScript) == 0x000020, "Wrong size on ExplosiveBase_C_UserConstructionScript");
static_assert(offsetof(ExplosiveBase_C_UserConstructionScript, NewMobility) == 0x000000, "Member 'ExplosiveBase_C_UserConstructionScript::NewMobility' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_UserConstructionScript, CallFunc_GetObjectName_ReturnValue) == 0x000008, "Member 'ExplosiveBase_C_UserConstructionScript::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_UserConstructionScript, CallFunc_Contains_ReturnValue) == 0x000018, "Member 'ExplosiveBase_C_UserConstructionScript::CallFunc_Contains_ReturnValue' has a wrong offset!");

// Function ExplosiveBase.ExplosiveBase_C.NotifyAim
// 0x0001 (0x0001 - 0x0000)
struct ExplosiveBase_C_NotifyAim final
{
public:
	bool                                          bAim;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExplosiveBase_C_NotifyAim) == 0x000001, "Wrong alignment on ExplosiveBase_C_NotifyAim");
static_assert(sizeof(ExplosiveBase_C_NotifyAim) == 0x000001, "Wrong size on ExplosiveBase_C_NotifyAim");
static_assert(offsetof(ExplosiveBase_C_NotifyAim, bAim) == 0x000000, "Member 'ExplosiveBase_C_NotifyAim::bAim' has a wrong offset!");

// Function ExplosiveBase.ExplosiveBase_C.OnDie
// 0x01C0 (0x01C0 - 0x0000)
struct ExplosiveBase_C_OnDie final
{
public:
	class AGameCharacter*                         Who;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         Killer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     HealthChangeValue;                                 // 0x0010(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(ExplosiveBase_C_OnDie) == 0x000008, "Wrong alignment on ExplosiveBase_C_OnDie");
static_assert(sizeof(ExplosiveBase_C_OnDie) == 0x0001C0, "Wrong size on ExplosiveBase_C_OnDie");
static_assert(offsetof(ExplosiveBase_C_OnDie, Who) == 0x000000, "Member 'ExplosiveBase_C_OnDie::Who' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_OnDie, Killer) == 0x000008, "Member 'ExplosiveBase_C_OnDie::Killer' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_OnDie, HealthChangeValue) == 0x000010, "Member 'ExplosiveBase_C_OnDie::HealthChangeValue' has a wrong offset!");

// Function ExplosiveBase.ExplosiveBase_C.OnSwitchWarn
// 0x0001 (0x0001 - 0x0000)
struct ExplosiveBase_C_OnSwitchWarn final
{
public:
	bool                                          InWarn;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExplosiveBase_C_OnSwitchWarn) == 0x000001, "Wrong alignment on ExplosiveBase_C_OnSwitchWarn");
static_assert(sizeof(ExplosiveBase_C_OnSwitchWarn) == 0x000001, "Wrong size on ExplosiveBase_C_OnSwitchWarn");
static_assert(offsetof(ExplosiveBase_C_OnSwitchWarn, InWarn) == 0x000000, "Member 'ExplosiveBase_C_OnSwitchWarn::InWarn' has a wrong offset!");

// LuaFunction ExplosiveBase.ExplosiveBase_C.CheckCull
// 0x0009 (0x0009 - 0x0000)
struct ExplosiveBase_C_CheckCull final
{
public:
	bool                                          TempCull;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckDistanceCull_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetBoomWarn_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExplosiveBase_C_CheckCull) == 0x000001, "Wrong alignment on ExplosiveBase_C_CheckCull");
static_assert(sizeof(ExplosiveBase_C_CheckCull) == 0x000009, "Wrong size on ExplosiveBase_C_CheckCull");
static_assert(offsetof(ExplosiveBase_C_CheckCull, TempCull) == 0x000000, "Member 'ExplosiveBase_C_CheckCull::TempCull' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_CheckCull, CallFunc_CheckDistanceCull_ReturnValue) == 0x000001, "Member 'ExplosiveBase_C_CheckCull::CallFunc_CheckDistanceCull_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_CheckCull, CallFunc_IsDedicatedServer_ReturnValue) == 0x000002, "Member 'ExplosiveBase_C_CheckCull::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_CheckCull, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'ExplosiveBase_C_CheckCull::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_CheckCull, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000004, "Member 'ExplosiveBase_C_CheckCull::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_CheckCull, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'ExplosiveBase_C_CheckCull::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_CheckCull, CallFunc_GetBoomWarn_ReturnValue) == 0x000006, "Member 'ExplosiveBase_C_CheckCull::CallFunc_GetBoomWarn_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_CheckCull, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'ExplosiveBase_C_CheckCull::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_CheckCull, CallFunc_BooleanAND_ReturnValue_1) == 0x000008, "Member 'ExplosiveBase_C_CheckCull::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// LuaFunction ExplosiveBase.ExplosiveBase_C.SetHpShowDistance
// 0x0003 (0x0003 - 0x0000)
struct ExplosiveBase_C_SetHpShowDistance final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetShowDistance_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExplosiveBase_C_SetHpShowDistance) == 0x000001, "Wrong alignment on ExplosiveBase_C_SetHpShowDistance");
static_assert(sizeof(ExplosiveBase_C_SetHpShowDistance) == 0x000003, "Wrong size on ExplosiveBase_C_SetHpShowDistance");
static_assert(offsetof(ExplosiveBase_C_SetHpShowDistance, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'ExplosiveBase_C_SetHpShowDistance::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetHpShowDistance, CallFunc_SetShowDistance_ReturnValue) == 0x000001, "Member 'ExplosiveBase_C_SetHpShowDistance::CallFunc_SetShowDistance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_SetHpShowDistance, CallFunc_BooleanOR_ReturnValue) == 0x000002, "Member 'ExplosiveBase_C_SetHpShowDistance::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function ExplosiveBase.ExplosiveBase_C.RPC_Explosive
// 0x0003 (0x0003 - 0x0000)
struct ExplosiveBase_C_RPC_Explosive final
{
public:
	bool                                          ShowCollision;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OldMesh;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NewMesh;                                           // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExplosiveBase_C_RPC_Explosive) == 0x000001, "Wrong alignment on ExplosiveBase_C_RPC_Explosive");
static_assert(sizeof(ExplosiveBase_C_RPC_Explosive) == 0x000003, "Wrong size on ExplosiveBase_C_RPC_Explosive");
static_assert(offsetof(ExplosiveBase_C_RPC_Explosive, ShowCollision) == 0x000000, "Member 'ExplosiveBase_C_RPC_Explosive::ShowCollision' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_RPC_Explosive, OldMesh) == 0x000001, "Member 'ExplosiveBase_C_RPC_Explosive::OldMesh' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_RPC_Explosive, NewMesh) == 0x000002, "Member 'ExplosiveBase_C_RPC_Explosive::NewMesh' has a wrong offset!");

// Function ExplosiveBase.ExplosiveBase_C.ExecuteUbergraph_ExplosiveBase
// 0x01E8 (0x01E8 - 0x0000)
struct ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bAim;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_Event_Who;                                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_Killer;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_Event_HealthChangeValue;                    // 0x0018(0x01B0)(ConstParm, ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_ShowCollision;                  // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_OldMesh;                        // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_NewMesh;                        // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InWarn;                               // 0x01CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CF[0x1];                                      // 0x01CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bAim)>                    K2Node_CreateDelegate_OutputDelegate;              // 0x01D0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x01E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase) == 0x000008, "Wrong alignment on ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase");
static_assert(sizeof(ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase) == 0x0001E8, "Wrong size on ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase");
static_assert(offsetof(ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase, EntryPoint) == 0x000000, "Member 'ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase, K2Node_CustomEvent_bAim) == 0x000004, "Member 'ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase::K2Node_CustomEvent_bAim' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase, K2Node_Event_Who) == 0x000008, "Member 'ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase::K2Node_Event_Who' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase, K2Node_Event_Killer) == 0x000010, "Member 'ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase::K2Node_Event_Killer' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase, K2Node_Event_HealthChangeValue) == 0x000018, "Member 'ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase::K2Node_Event_HealthChangeValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase, K2Node_CustomEvent_ShowCollision) == 0x0001C8, "Member 'ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase::K2Node_CustomEvent_ShowCollision' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase, K2Node_CustomEvent_OldMesh) == 0x0001C9, "Member 'ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase::K2Node_CustomEvent_OldMesh' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase, K2Node_CustomEvent_NewMesh) == 0x0001CA, "Member 'ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase::K2Node_CustomEvent_NewMesh' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase, K2Node_Event_InWarn) == 0x0001CB, "Member 'ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase::K2Node_Event_InWarn' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase, CallFunc_IsValid_ReturnValue) == 0x0001CC, "Member 'ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase, CallFunc_IsValid_ReturnValue_1) == 0x0001CD, "Member 'ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase, CallFunc_IsValid_ReturnValue_2) == 0x0001CE, "Member 'ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase, K2Node_CreateDelegate_OutputDelegate) == 0x0001D0, "Member 'ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase, CallFunc_IsValid_ReturnValue_3) == 0x0001E0, "Member 'ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase, CallFunc_IsValid_ReturnValue_4) == 0x0001E1, "Member 'ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase, CallFunc_IsValid_ReturnValue_5) == 0x0001E2, "Member 'ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase, CallFunc_IsValid_ReturnValue_6) == 0x0001E3, "Member 'ExplosiveBase_C_ExecuteUbergraph_ExplosiveBase::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");

