#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExplosiveBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ExplosiveBase.ExplosiveBase_C
// 0x00E0 (0x14B0 - 0x13D0)
class AExplosiveBase_C : public AExplosiveActorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x13D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        WarningPoint;                                      // 0x13D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBulletBoxComponent*                    WarningBoxLocation;                                // 0x13E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNavModifierComponent*                  NavModifier;                                       // 0x13E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ReplaceMesh;                                       // 0x13F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   After;                                             // 0x13F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Before;                                            // 0x1400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x1408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        FxLocation;                                        // 0x1410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         DieSkillID;                                        // 0x1418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WarningTime;                                       // 0x141C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 WwisseDie;                                         // 0x1420(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WwiseTrap;                                         // 0x1430(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FTransform                             FxScale;                                           // 0x1440(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UFXSystemComponent*                     WarningParicle;                                    // 0x1470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CastShadow;                                        // 0x1478(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Outline;                                           // 0x1479(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_147A[0x6];                                     // 0x147A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AWarningTipActor_C*                     TipActor;                                          // 0x1480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Aimed;                                             // 0x1488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bSetHpShowDistance;                                // 0x1489(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCull;                                             // 0x148A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShowWarningCircle;                                // 0x148B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bInitShadow;                                       // 0x148C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_148D[0x3];                                     // 0x148D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       MaterialInstanceTemp;                              // 0x1490(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                OriginSence;                                       // 0x14A0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAttach;                                          // 0x14AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ChangeTickInteral();
	void Detach();
	void TryAttach();
	void RecordScenePos();
	void ResetSence();
	void UpdateMaterils();
	void SetShadow();
	void SetCullDistance();
	void SetupInShadow();
	void CheckCull__Overridden();
	void SetHpShowDistance__Overridden();
	int32 GetDieSkillId();
	void SpawnWarningParicle(bool bActive);
	void UpdateSecondaryMaterils(class UMeshComponent* Mesh_0);
	void UserConstructionScript();
	void NotifyAim(bool bAim);
	void OnDie(class AGameCharacter* Who, class AGameCharacter* Killer, const struct FHealthChangeValue& HealthChangeValue);
	void OnSwitchWarn(bool InWarn);
	void DealFunOnSpawn();
	void OnRecycle();
	void CheckCull();
	void SetHpShowDistance();
	void RPC_Explosive(bool ShowCollision, bool OldMesh, bool NewMesh);
	void OnSpawn();
	void UpdateData();
	void DealFuncOnEnd();
	void ExecuteUbergraph_ExplosiveBase(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ExplosiveBase_C">();
	}
	static class AExplosiveBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AExplosiveBase_C>();
	}
};
static_assert(alignof(AExplosiveBase_C) == 0x000010, "Wrong alignment on AExplosiveBase_C");
static_assert(sizeof(AExplosiveBase_C) == 0x0014B0, "Wrong size on AExplosiveBase_C");
static_assert(offsetof(AExplosiveBase_C, UberGraphFrame) == 0x0013D0, "Member 'AExplosiveBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AExplosiveBase_C, WarningPoint) == 0x0013D8, "Member 'AExplosiveBase_C::WarningPoint' has a wrong offset!");
static_assert(offsetof(AExplosiveBase_C, WarningBoxLocation) == 0x0013E0, "Member 'AExplosiveBase_C::WarningBoxLocation' has a wrong offset!");
static_assert(offsetof(AExplosiveBase_C, NavModifier) == 0x0013E8, "Member 'AExplosiveBase_C::NavModifier' has a wrong offset!");
static_assert(offsetof(AExplosiveBase_C, ReplaceMesh) == 0x0013F0, "Member 'AExplosiveBase_C::ReplaceMesh' has a wrong offset!");
static_assert(offsetof(AExplosiveBase_C, After) == 0x0013F8, "Member 'AExplosiveBase_C::After' has a wrong offset!");
static_assert(offsetof(AExplosiveBase_C, Before) == 0x001400, "Member 'AExplosiveBase_C::Before' has a wrong offset!");
static_assert(offsetof(AExplosiveBase_C, Scene) == 0x001408, "Member 'AExplosiveBase_C::Scene' has a wrong offset!");
static_assert(offsetof(AExplosiveBase_C, FxLocation) == 0x001410, "Member 'AExplosiveBase_C::FxLocation' has a wrong offset!");
static_assert(offsetof(AExplosiveBase_C, DieSkillID) == 0x001418, "Member 'AExplosiveBase_C::DieSkillID' has a wrong offset!");
static_assert(offsetof(AExplosiveBase_C, WarningTime) == 0x00141C, "Member 'AExplosiveBase_C::WarningTime' has a wrong offset!");
static_assert(offsetof(AExplosiveBase_C, WwisseDie) == 0x001420, "Member 'AExplosiveBase_C::WwisseDie' has a wrong offset!");
static_assert(offsetof(AExplosiveBase_C, WwiseTrap) == 0x001430, "Member 'AExplosiveBase_C::WwiseTrap' has a wrong offset!");
static_assert(offsetof(AExplosiveBase_C, FxScale) == 0x001440, "Member 'AExplosiveBase_C::FxScale' has a wrong offset!");
static_assert(offsetof(AExplosiveBase_C, WarningParicle) == 0x001470, "Member 'AExplosiveBase_C::WarningParicle' has a wrong offset!");
static_assert(offsetof(AExplosiveBase_C, CastShadow) == 0x001478, "Member 'AExplosiveBase_C::CastShadow' has a wrong offset!");
static_assert(offsetof(AExplosiveBase_C, Outline) == 0x001479, "Member 'AExplosiveBase_C::Outline' has a wrong offset!");
static_assert(offsetof(AExplosiveBase_C, TipActor) == 0x001480, "Member 'AExplosiveBase_C::TipActor' has a wrong offset!");
static_assert(offsetof(AExplosiveBase_C, Aimed) == 0x001488, "Member 'AExplosiveBase_C::Aimed' has a wrong offset!");
static_assert(offsetof(AExplosiveBase_C, bSetHpShowDistance) == 0x001489, "Member 'AExplosiveBase_C::bSetHpShowDistance' has a wrong offset!");
static_assert(offsetof(AExplosiveBase_C, bCull) == 0x00148A, "Member 'AExplosiveBase_C::bCull' has a wrong offset!");
static_assert(offsetof(AExplosiveBase_C, bShowWarningCircle) == 0x00148B, "Member 'AExplosiveBase_C::bShowWarningCircle' has a wrong offset!");
static_assert(offsetof(AExplosiveBase_C, bInitShadow) == 0x00148C, "Member 'AExplosiveBase_C::bInitShadow' has a wrong offset!");
static_assert(offsetof(AExplosiveBase_C, MaterialInstanceTemp) == 0x001490, "Member 'AExplosiveBase_C::MaterialInstanceTemp' has a wrong offset!");
static_assert(offsetof(AExplosiveBase_C, OriginSence) == 0x0014A0, "Member 'AExplosiveBase_C::OriginSence' has a wrong offset!");
static_assert(offsetof(AExplosiveBase_C, IsAttach) == 0x0014AC, "Member 'AExplosiveBase_C::IsAttach' has a wrong offset!");

}

