#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Explosive_Magnet

#include "Basic.hpp"


namespace SDK::Params
{

// Function Explosive_Magnet.Explosive_Magnet_C.IsStillValid
// 0x0002 (0x0002 - 0x0000)
struct Explosive_Magnet_C_IsStillValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Explosive_Magnet_C_IsStillValid) == 0x000001, "Wrong alignment on Explosive_Magnet_C_IsStillValid");
static_assert(sizeof(Explosive_Magnet_C_IsStillValid) == 0x000002, "Wrong size on Explosive_Magnet_C_IsStillValid");
static_assert(offsetof(Explosive_Magnet_C_IsStillValid, ReturnValue) == 0x000000, "Member 'Explosive_Magnet_C_IsStillValid::ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosive_Magnet_C_IsStillValid, CallFunc_IsVisible_ReturnValue) == 0x000001, "Member 'Explosive_Magnet_C_IsStillValid::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function Explosive_Magnet.Explosive_Magnet_C.ReSpawn
// 0x0001 (0x0001 - 0x0000)
struct Explosive_Magnet_C_ReSpawn final
{
public:
	bool                                          IsValid;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Explosive_Magnet_C_ReSpawn) == 0x000001, "Wrong alignment on Explosive_Magnet_C_ReSpawn");
static_assert(sizeof(Explosive_Magnet_C_ReSpawn) == 0x000001, "Wrong size on Explosive_Magnet_C_ReSpawn");
static_assert(offsetof(Explosive_Magnet_C_ReSpawn, IsValid) == 0x000000, "Member 'Explosive_Magnet_C_ReSpawn::IsValid' has a wrong offset!");

// Function Explosive_Magnet.Explosive_Magnet_C.ExecuteUbergraph_Explosive_Magnet
// 0x0008 (0x0008 - 0x0000)
struct Explosive_Magnet_C_ExecuteUbergraph_Explosive_Magnet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsValid;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Explosive_Magnet_C_ExecuteUbergraph_Explosive_Magnet) == 0x000004, "Wrong alignment on Explosive_Magnet_C_ExecuteUbergraph_Explosive_Magnet");
static_assert(sizeof(Explosive_Magnet_C_ExecuteUbergraph_Explosive_Magnet) == 0x000008, "Wrong size on Explosive_Magnet_C_ExecuteUbergraph_Explosive_Magnet");
static_assert(offsetof(Explosive_Magnet_C_ExecuteUbergraph_Explosive_Magnet, EntryPoint) == 0x000000, "Member 'Explosive_Magnet_C_ExecuteUbergraph_Explosive_Magnet::EntryPoint' has a wrong offset!");
static_assert(offsetof(Explosive_Magnet_C_ExecuteUbergraph_Explosive_Magnet, K2Node_Event_IsValid) == 0x000004, "Member 'Explosive_Magnet_C_ExecuteUbergraph_Explosive_Magnet::K2Node_Event_IsValid' has a wrong offset!");

// LuaFunction Explosive_Magnet.Explosive_Magnet_C.CheckCull
// 0x0009 (0x0009 - 0x0000)
struct Explosive_Magnet_C_CheckCull final
{
public:
	bool                                          TempCull;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckDistanceCull_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetBoomWarn_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Explosive_Magnet_C_CheckCull) == 0x000001, "Wrong alignment on Explosive_Magnet_C_CheckCull");
static_assert(sizeof(Explosive_Magnet_C_CheckCull) == 0x000009, "Wrong size on Explosive_Magnet_C_CheckCull");
static_assert(offsetof(Explosive_Magnet_C_CheckCull, TempCull) == 0x000000, "Member 'Explosive_Magnet_C_CheckCull::TempCull' has a wrong offset!");
static_assert(offsetof(Explosive_Magnet_C_CheckCull, CallFunc_CheckDistanceCull_ReturnValue) == 0x000001, "Member 'Explosive_Magnet_C_CheckCull::CallFunc_CheckDistanceCull_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosive_Magnet_C_CheckCull, CallFunc_IsDedicatedServer_ReturnValue) == 0x000002, "Member 'Explosive_Magnet_C_CheckCull::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosive_Magnet_C_CheckCull, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'Explosive_Magnet_C_CheckCull::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosive_Magnet_C_CheckCull, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000004, "Member 'Explosive_Magnet_C_CheckCull::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosive_Magnet_C_CheckCull, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'Explosive_Magnet_C_CheckCull::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosive_Magnet_C_CheckCull, CallFunc_GetBoomWarn_ReturnValue) == 0x000006, "Member 'Explosive_Magnet_C_CheckCull::CallFunc_GetBoomWarn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosive_Magnet_C_CheckCull, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'Explosive_Magnet_C_CheckCull::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosive_Magnet_C_CheckCull, CallFunc_BooleanAND_ReturnValue_1) == 0x000008, "Member 'Explosive_Magnet_C_CheckCull::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// LuaFunction Explosive_Magnet.Explosive_Magnet_C.SetHpShowDistance
// 0x0003 (0x0003 - 0x0000)
struct Explosive_Magnet_C_SetHpShowDistance final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetShowDistance_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Explosive_Magnet_C_SetHpShowDistance) == 0x000001, "Wrong alignment on Explosive_Magnet_C_SetHpShowDistance");
static_assert(sizeof(Explosive_Magnet_C_SetHpShowDistance) == 0x000003, "Wrong size on Explosive_Magnet_C_SetHpShowDistance");
static_assert(offsetof(Explosive_Magnet_C_SetHpShowDistance, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'Explosive_Magnet_C_SetHpShowDistance::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosive_Magnet_C_SetHpShowDistance, CallFunc_SetShowDistance_ReturnValue) == 0x000001, "Member 'Explosive_Magnet_C_SetHpShowDistance::CallFunc_SetShowDistance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosive_Magnet_C_SetHpShowDistance, CallFunc_BooleanOR_ReturnValue) == 0x000002, "Member 'Explosive_Magnet_C_SetHpShowDistance::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

