#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Explosive_Die

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Explosive_Die.Explosive_Die_C
// 0x0018 (0x0040 - 0x0028)
class UExplosive_Die_C final : public UCanInteractActor_Event
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          HideMesh;                                          // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShowCollision;                                     // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WarningScale;                                      // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewMesh;                                           // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OldMesh;                                           // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void Explosive();
	void ExecuteUbergraph_Explosive_Die(int32 EntryPoint);
	void Execute_Client(class AActor* InteractPlayer);
	void Execute_Server(class AActor* InteractPlayer, class AActor* InteractActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Explosive_Die_C">();
	}
	static class UExplosive_Die_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExplosive_Die_C>();
	}
};
static_assert(alignof(UExplosive_Die_C) == 0x000008, "Wrong alignment on UExplosive_Die_C");
static_assert(sizeof(UExplosive_Die_C) == 0x000040, "Wrong size on UExplosive_Die_C");
static_assert(offsetof(UExplosive_Die_C, UberGraphFrame) == 0x000028, "Member 'UExplosive_Die_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UExplosive_Die_C, HideMesh) == 0x000030, "Member 'UExplosive_Die_C::HideMesh' has a wrong offset!");
static_assert(offsetof(UExplosive_Die_C, ShowCollision) == 0x000031, "Member 'UExplosive_Die_C::ShowCollision' has a wrong offset!");
static_assert(offsetof(UExplosive_Die_C, WarningScale) == 0x000034, "Member 'UExplosive_Die_C::WarningScale' has a wrong offset!");
static_assert(offsetof(UExplosive_Die_C, NewMesh) == 0x000038, "Member 'UExplosive_Die_C::NewMesh' has a wrong offset!");
static_assert(offsetof(UExplosive_Die_C, OldMesh) == 0x000039, "Member 'UExplosive_Die_C::OldMesh' has a wrong offset!");

}

