#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FireBullet_FixNetReload

#include "Basic.hpp"


namespace SDK::Params
{

// Function FireBullet_FixNetReload.FireBullet_FixNetReload_C.ExecuteUbergraph_FireBullet_FixNetReload
// 0x0008 (0x0008 - 0x0000)
struct FireBullet_FixNetReload_C_ExecuteUbergraph_FireBullet_FixNetReload final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStandalone_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FireBullet_FixNetReload_C_ExecuteUbergraph_FireBullet_FixNetReload) == 0x000004, "Wrong alignment on FireBullet_FixNetReload_C_ExecuteUbergraph_FireBullet_FixNetReload");
static_assert(sizeof(FireBullet_FixNetReload_C_ExecuteUbergraph_FireBullet_FixNetReload) == 0x000008, "Wrong size on FireBullet_FixNetReload_C_ExecuteUbergraph_FireBullet_FixNetReload");
static_assert(offsetof(FireBullet_FixNetReload_C_ExecuteUbergraph_FireBullet_FixNetReload, EntryPoint) == 0x000000, "Member 'FireBullet_FixNetReload_C_ExecuteUbergraph_FireBullet_FixNetReload::EntryPoint' has a wrong offset!");
static_assert(offsetof(FireBullet_FixNetReload_C_ExecuteUbergraph_FireBullet_FixNetReload, CallFunc_IsStandalone_ReturnValue) == 0x000004, "Member 'FireBullet_FixNetReload_C_ExecuteUbergraph_FireBullet_FixNetReload::CallFunc_IsStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(FireBullet_FixNetReload_C_ExecuteUbergraph_FireBullet_FixNetReload, CallFunc_HasAuthority_ReturnValue) == 0x000005, "Member 'FireBullet_FixNetReload_C_ExecuteUbergraph_FireBullet_FixNetReload::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function FireBullet_FixNetReload.FireBullet_FixNetReload_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct FireBullet_FixNetReload_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(FireBullet_FixNetReload_C_GetModuleName) == 0x000008, "Wrong alignment on FireBullet_FixNetReload_C_GetModuleName");
static_assert(sizeof(FireBullet_FixNetReload_C_GetModuleName) == 0x000010, "Wrong size on FireBullet_FixNetReload_C_GetModuleName");
static_assert(offsetof(FireBullet_FixNetReload_C_GetModuleName, ReturnValue) == 0x000000, "Member 'FireBullet_FixNetReload_C_GetModuleName::ReturnValue' has a wrong offset!");

}

