#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FireStateMachine

#include "Basic.hpp"

#include "SMSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "BasePlayerStateMachine_classes.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass FireStateMachine.FireStateMachine_C
// 0x2050 (0x26B0 - 0x0660)
class UFireStateMachine_C final : public UBasePlayerStateMachine_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_FireStateMachine_C;                 // 0x0660(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          FireStateMachine_FireStateMachine_C;               // 0x0668(0x01A8)()
	struct FSMTransition                          FireStateMachine_FireStateMachine_C_0;             // 0x0810(0x01A8)()
	struct FSMTransition                          FireStateMachine_FireStateMachine_C_1;             // 0x09B8(0x01A8)()
	struct FSMTransition                          FireStateMachine_FireStateMachine_C_2;             // 0x0B60(0x01A8)()
	struct FSMTransition                          FireStateMachine_FireStateMachine_C_3;             // 0x0D08(0x01A8)()
	struct FSMTransition                          FireStateMachine_FireStateMachine_C_4;             // 0x0EB0(0x01A8)()
	struct FSMTransition                          FireStateMachine_FireStateMachine_C_5;             // 0x1058(0x01A8)()
	struct FSMTransition                          FireStateMachine_FireStateMachine_C_6;             // 0x1200(0x01A8)()
	struct FSMTransition                          FireStateMachine_FireStateMachine_C_7;             // 0x13A8(0x01A8)()
	struct FSMTransition                          FireStateMachine_FireStateMachine_C_8;             // 0x1550(0x01A8)()
	struct FSMTransition                          FireStateMachine_FireStateMachine_C_9;             // 0x16F8(0x01A8)()
	struct FSMTransition                          FireStateMachine_FireStateMachine_C_10;            // 0x18A0(0x01A8)()
	struct FSMState                               FireStateMachine_FireStateMachine_C_11;            // 0x1A48(0x01C8)()
	struct FSMState                               FireStateMachine_FireStateMachine_C_12;            // 0x1C10(0x01C8)()
	struct FSMConduit                             FireStateMachine_FireStateMachine_C_13;            // 0x1DD8(0x01B8)()
	struct FSMState                               FireStateMachine_FireStateMachine_C_14;            // 0x1F90(0x01C8)()
	struct FSMState                               FireStateMachine_FireStateMachine_C_15;            // 0x2158(0x01C8)()
	struct FSMState                               FireStateMachine_FireStateMachine_C_16;            // 0x2320(0x01C8)()
	struct FSMState                               FireStateMachine_FireStateMachine_C_17;            // 0x24E8(0x01C8)()

public:
	void Func_FireStateMachine_FireStateMachine_C_0();
	void Func_FireStateMachine_FireStateMachine_C_1();
	void Func_FireStateMachine_FireStateMachine_C_2();
	void Func_FireStateMachine_FireStateMachine_C_3();
	void Func_FireStateMachine_FireStateMachine_C_4();
	void Func_FireStateMachine_FireStateMachine_C_5();
	void Func_FireStateMachine_FireStateMachine_C_6();
	void Func_FireStateMachine_FireStateMachine_C_7();
	void Func_FireStateMachine_FireStateMachine_C_8();
	void Func_FireStateMachine_FireStateMachine_C_9();
	void Func_FireStateMachine_FireStateMachine_C_10();
	void Func_FireStateMachine_FireStateMachine_C_11();
	void Func_FireStateMachine_FireStateMachine_C_12();
	void Func_FireStateMachine_FireStateMachine_C_13();
	void Func_FireStateMachine_FireStateMachine_C_14();
	void Func_FireStateMachine_FireStateMachine_C_15();
	void Func_FireStateMachine_FireStateMachine_C_16();
	void Func_FireStateMachine_FireStateMachine_C_17();
	void Func_FireStateMachine_FireStateMachine_C_18(float DeltaSeconds);
	void Func_FireStateMachine_FireStateMachine_C_19();
	void Func_FireStateMachine_FireStateMachine_C_20();
	void Func_FireStateMachine_FireStateMachine_C_21();
	void Func_FireStateMachine_FireStateMachine_C_22();
	void Func_FireStateMachine_FireStateMachine_C_23();
	void ExecuteUbergraph_FireStateMachine(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("FireStateMachine_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FireStateMachine_C")
	}
	static class UFireStateMachine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFireStateMachine_C>();
	}
};
DUMPER7_ASSERTS_UFireStateMachine_C;

}

