#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Five11000

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function 511000.511000_C.ExecuteUbergraph_511000
// 0x01B0 (0x01B0 - 0x0000)
struct Five11000_C_ExecuteUbergraph_511000 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_VelocityDirection_1;            // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_MoveSpeed_1;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_RotateTime;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_SpiralCenter;                   // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_ForwardVector;                  // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_SpiralSpeed;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0xC];                                       // 0x0034(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBulletCircle                          K2Node_MakeStruct_BulletCircle;                    // 0x0040(0x00C0)(NoDestructor)
	float                                         K2Node_CustomEvent_Speed_2;                        // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Acceleration_2;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Speed_1;                        // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_GravityScale;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_VelocityDirection;              // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_MoveSpeed;                      // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Acceleration_1;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_AngularSpeed;                   // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Target_1;                       // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_StopHomingDelay;                // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_VelocityDuration;               // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Delay;                          // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Speed;                          // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Acceleration;                   // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Section1Speed;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Section1Acceleration;           // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DelayTime;                      // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Section2Acceleration;           // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Target;                         // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Five11000_C_ExecuteUbergraph_511000) == 0x000010, "Wrong alignment on Five11000_C_ExecuteUbergraph_511000");
static_assert(sizeof(Five11000_C_ExecuteUbergraph_511000) == 0x0001B0, "Wrong size on Five11000_C_ExecuteUbergraph_511000");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, EntryPoint) == 0x000000, "Member 'Five11000_C_ExecuteUbergraph_511000::EntryPoint' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_CustomEvent_VelocityDirection_1) == 0x000004, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_CustomEvent_VelocityDirection_1' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_CustomEvent_MoveSpeed_1) == 0x000010, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_CustomEvent_MoveSpeed_1' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_CustomEvent_RotateTime) == 0x000014, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_CustomEvent_RotateTime' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_CustomEvent_SpiralCenter) == 0x000018, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_CustomEvent_SpiralCenter' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_CustomEvent_ForwardVector) == 0x000024, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_CustomEvent_ForwardVector' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_CustomEvent_SpiralSpeed) == 0x000030, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_CustomEvent_SpiralSpeed' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_MakeStruct_BulletCircle) == 0x000040, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_MakeStruct_BulletCircle' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_CustomEvent_Speed_2) == 0x000100, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_CustomEvent_Speed_2' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_CustomEvent_Acceleration_2) == 0x000104, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_CustomEvent_Acceleration_2' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_CustomEvent_Speed_1) == 0x000108, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_CustomEvent_Speed_1' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_CustomEvent_GravityScale) == 0x00010C, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_CustomEvent_GravityScale' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_CustomEvent_VelocityDirection) == 0x000110, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_CustomEvent_VelocityDirection' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_CustomEvent_MoveSpeed) == 0x00011C, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_CustomEvent_MoveSpeed' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_CustomEvent_Acceleration_1) == 0x000120, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_CustomEvent_Acceleration_1' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_CustomEvent_AngularSpeed) == 0x000124, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_CustomEvent_AngularSpeed' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_CustomEvent_Target_1) == 0x000128, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_CustomEvent_Target_1' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_CustomEvent_StopHomingDelay) == 0x000130, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_CustomEvent_StopHomingDelay' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_CustomEvent_VelocityDuration) == 0x000134, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_CustomEvent_VelocityDuration' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000138, "Member 'Five11000_C_ExecuteUbergraph_511000::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_CustomEvent_Delay) == 0x000144, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_CustomEvent_Delay' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_CustomEvent_Speed) == 0x000148, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_CustomEvent_Speed' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_CustomEvent_Acceleration) == 0x00014C, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_CustomEvent_Acceleration' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_CustomEvent_Section1Speed) == 0x000150, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_CustomEvent_Section1Speed' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_CustomEvent_Section1Acceleration) == 0x000154, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_CustomEvent_Section1Acceleration' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_CustomEvent_DelayTime) == 0x000158, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_CustomEvent_DelayTime' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_CustomEvent_Section2Acceleration) == 0x00015C, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_CustomEvent_Section2Acceleration' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, K2Node_CustomEvent_Target) == 0x000160, "Member 'Five11000_C_ExecuteUbergraph_511000::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000168, "Member 'Five11000_C_ExecuteUbergraph_511000::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000174, "Member 'Five11000_C_ExecuteUbergraph_511000::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, CallFunc_FindLookAtRotation_ReturnValue) == 0x000180, "Member 'Five11000_C_ExecuteUbergraph_511000::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00018C, "Member 'Five11000_C_ExecuteUbergraph_511000::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, CallFunc_RLerp_ReturnValue) == 0x000198, "Member 'Five11000_C_ExecuteUbergraph_511000::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Five11000_C_ExecuteUbergraph_511000, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0001A4, "Member 'Five11000_C_ExecuteUbergraph_511000::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");

// Function 511000.511000_C.UseRevolveNaturallyMove
// 0x0018 (0x0018 - 0x0000)
struct Five11000_C_UseRevolveNaturallyMove final
{
public:
	float                                         Section1Speed;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Section1Acceleration;                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayTime;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Section2Acceleration;                              // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Target;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Five11000_C_UseRevolveNaturallyMove) == 0x000008, "Wrong alignment on Five11000_C_UseRevolveNaturallyMove");
static_assert(sizeof(Five11000_C_UseRevolveNaturallyMove) == 0x000018, "Wrong size on Five11000_C_UseRevolveNaturallyMove");
static_assert(offsetof(Five11000_C_UseRevolveNaturallyMove, Section1Speed) == 0x000000, "Member 'Five11000_C_UseRevolveNaturallyMove::Section1Speed' has a wrong offset!");
static_assert(offsetof(Five11000_C_UseRevolveNaturallyMove, Section1Acceleration) == 0x000004, "Member 'Five11000_C_UseRevolveNaturallyMove::Section1Acceleration' has a wrong offset!");
static_assert(offsetof(Five11000_C_UseRevolveNaturallyMove, DelayTime) == 0x000008, "Member 'Five11000_C_UseRevolveNaturallyMove::DelayTime' has a wrong offset!");
static_assert(offsetof(Five11000_C_UseRevolveNaturallyMove, Section2Acceleration) == 0x00000C, "Member 'Five11000_C_UseRevolveNaturallyMove::Section2Acceleration' has a wrong offset!");
static_assert(offsetof(Five11000_C_UseRevolveNaturallyMove, Target) == 0x000010, "Member 'Five11000_C_UseRevolveNaturallyMove::Target' has a wrong offset!");

// Function 511000.511000_C.UseDelayNaturallyMove
// 0x000C (0x000C - 0x0000)
struct Five11000_C_UseDelayNaturallyMove final
{
public:
	float                                         Delay;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Acceleration;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Five11000_C_UseDelayNaturallyMove) == 0x000004, "Wrong alignment on Five11000_C_UseDelayNaturallyMove");
static_assert(sizeof(Five11000_C_UseDelayNaturallyMove) == 0x00000C, "Wrong size on Five11000_C_UseDelayNaturallyMove");
static_assert(offsetof(Five11000_C_UseDelayNaturallyMove, Delay) == 0x000000, "Member 'Five11000_C_UseDelayNaturallyMove::Delay' has a wrong offset!");
static_assert(offsetof(Five11000_C_UseDelayNaturallyMove, Speed) == 0x000004, "Member 'Five11000_C_UseDelayNaturallyMove::Speed' has a wrong offset!");
static_assert(offsetof(Five11000_C_UseDelayNaturallyMove, Acceleration) == 0x000008, "Member 'Five11000_C_UseDelayNaturallyMove::Acceleration' has a wrong offset!");

// Function 511000.511000_C.UseHomingMove
// 0x0028 (0x0028 - 0x0000)
struct Five11000_C_UseHomingMove final
{
public:
	struct FVector                                VelocityDirection;                                 // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MoveSpeed;                                         // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Acceleration;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AngularSpeed;                                      // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Target;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StopHomingDelay;                                   // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VelocityDuration;                                  // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Five11000_C_UseHomingMove) == 0x000008, "Wrong alignment on Five11000_C_UseHomingMove");
static_assert(sizeof(Five11000_C_UseHomingMove) == 0x000028, "Wrong size on Five11000_C_UseHomingMove");
static_assert(offsetof(Five11000_C_UseHomingMove, VelocityDirection) == 0x000000, "Member 'Five11000_C_UseHomingMove::VelocityDirection' has a wrong offset!");
static_assert(offsetof(Five11000_C_UseHomingMove, MoveSpeed) == 0x00000C, "Member 'Five11000_C_UseHomingMove::MoveSpeed' has a wrong offset!");
static_assert(offsetof(Five11000_C_UseHomingMove, Acceleration) == 0x000010, "Member 'Five11000_C_UseHomingMove::Acceleration' has a wrong offset!");
static_assert(offsetof(Five11000_C_UseHomingMove, AngularSpeed) == 0x000014, "Member 'Five11000_C_UseHomingMove::AngularSpeed' has a wrong offset!");
static_assert(offsetof(Five11000_C_UseHomingMove, Target) == 0x000018, "Member 'Five11000_C_UseHomingMove::Target' has a wrong offset!");
static_assert(offsetof(Five11000_C_UseHomingMove, StopHomingDelay) == 0x000020, "Member 'Five11000_C_UseHomingMove::StopHomingDelay' has a wrong offset!");
static_assert(offsetof(Five11000_C_UseHomingMove, VelocityDuration) == 0x000024, "Member 'Five11000_C_UseHomingMove::VelocityDuration' has a wrong offset!");

// Function 511000.511000_C.UseNaturallyMoveWithGravity
// 0x0008 (0x0008 - 0x0000)
struct Five11000_C_UseNaturallyMoveWithGravity final
{
public:
	float                                         Speed;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GravityScale;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Five11000_C_UseNaturallyMoveWithGravity) == 0x000004, "Wrong alignment on Five11000_C_UseNaturallyMoveWithGravity");
static_assert(sizeof(Five11000_C_UseNaturallyMoveWithGravity) == 0x000008, "Wrong size on Five11000_C_UseNaturallyMoveWithGravity");
static_assert(offsetof(Five11000_C_UseNaturallyMoveWithGravity, Speed) == 0x000000, "Member 'Five11000_C_UseNaturallyMoveWithGravity::Speed' has a wrong offset!");
static_assert(offsetof(Five11000_C_UseNaturallyMoveWithGravity, GravityScale) == 0x000004, "Member 'Five11000_C_UseNaturallyMoveWithGravity::GravityScale' has a wrong offset!");

// Function 511000.511000_C.UseNaturallyMove
// 0x0008 (0x0008 - 0x0000)
struct Five11000_C_UseNaturallyMove final
{
public:
	float                                         Speed;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Acceleration;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Five11000_C_UseNaturallyMove) == 0x000004, "Wrong alignment on Five11000_C_UseNaturallyMove");
static_assert(sizeof(Five11000_C_UseNaturallyMove) == 0x000008, "Wrong size on Five11000_C_UseNaturallyMove");
static_assert(offsetof(Five11000_C_UseNaturallyMove, Speed) == 0x000000, "Member 'Five11000_C_UseNaturallyMove::Speed' has a wrong offset!");
static_assert(offsetof(Five11000_C_UseNaturallyMove, Acceleration) == 0x000004, "Member 'Five11000_C_UseNaturallyMove::Acceleration' has a wrong offset!");

// Function 511000.511000_C.UseSpiralMove
// 0x0030 (0x0030 - 0x0000)
struct Five11000_C_UseSpiralMove final
{
public:
	struct FVector                                VelocityDirection;                                 // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MoveSpeed;                                         // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotateTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpiralCenter;                                      // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ForwardVector;                                     // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpiralSpeed;                                       // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Five11000_C_UseSpiralMove) == 0x000004, "Wrong alignment on Five11000_C_UseSpiralMove");
static_assert(sizeof(Five11000_C_UseSpiralMove) == 0x000030, "Wrong size on Five11000_C_UseSpiralMove");
static_assert(offsetof(Five11000_C_UseSpiralMove, VelocityDirection) == 0x000000, "Member 'Five11000_C_UseSpiralMove::VelocityDirection' has a wrong offset!");
static_assert(offsetof(Five11000_C_UseSpiralMove, MoveSpeed) == 0x00000C, "Member 'Five11000_C_UseSpiralMove::MoveSpeed' has a wrong offset!");
static_assert(offsetof(Five11000_C_UseSpiralMove, RotateTime) == 0x000010, "Member 'Five11000_C_UseSpiralMove::RotateTime' has a wrong offset!");
static_assert(offsetof(Five11000_C_UseSpiralMove, SpiralCenter) == 0x000014, "Member 'Five11000_C_UseSpiralMove::SpiralCenter' has a wrong offset!");
static_assert(offsetof(Five11000_C_UseSpiralMove, ForwardVector) == 0x000020, "Member 'Five11000_C_UseSpiralMove::ForwardVector' has a wrong offset!");
static_assert(offsetof(Five11000_C_UseSpiralMove, SpiralSpeed) == 0x00002C, "Member 'Five11000_C_UseSpiralMove::SpiralSpeed' has a wrong offset!");

// Function 511000.511000_C.GetRot
// 0x00C0 (0x00C0 - 0x0000)
struct Five11000_C_GetRot final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Min;                                               // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max;                                               // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Rot;                                               // 0x0020(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FQuat                                  CallFunc_SequenceRotationYZX_ReturnValue;          // 0x0070(0x0010)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Quat_Rotator_ReturnValue;                 // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(Five11000_C_GetRot) == 0x000010, "Wrong alignment on Five11000_C_GetRot");
static_assert(sizeof(Five11000_C_GetRot) == 0x0000C0, "Wrong size on Five11000_C_GetRot");
static_assert(offsetof(Five11000_C_GetRot, Location) == 0x000000, "Member 'Five11000_C_GetRot::Location' has a wrong offset!");
static_assert(offsetof(Five11000_C_GetRot, Min) == 0x00000C, "Member 'Five11000_C_GetRot::Min' has a wrong offset!");
static_assert(offsetof(Five11000_C_GetRot, Max) == 0x000010, "Member 'Five11000_C_GetRot::Max' has a wrong offset!");
static_assert(offsetof(Five11000_C_GetRot, Rot) == 0x000020, "Member 'Five11000_C_GetRot::Rot' has a wrong offset!");
static_assert(offsetof(Five11000_C_GetRot, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000050, "Member 'Five11000_C_GetRot::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Five11000_C_GetRot, CallFunc_RandomIntegerInRange_ReturnValue) == 0x00005C, "Member 'Five11000_C_GetRot::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Five11000_C_GetRot, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000060, "Member 'Five11000_C_GetRot::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Five11000_C_GetRot, CallFunc_MakeRotator_ReturnValue) == 0x000064, "Member 'Five11000_C_GetRot::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Five11000_C_GetRot, CallFunc_SequenceRotationYZX_ReturnValue) == 0x000070, "Member 'Five11000_C_GetRot::CallFunc_SequenceRotationYZX_ReturnValue' has a wrong offset!");
static_assert(offsetof(Five11000_C_GetRot, CallFunc_Quat_Rotator_ReturnValue) == 0x000080, "Member 'Five11000_C_GetRot::CallFunc_Quat_Rotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Five11000_C_GetRot, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'Five11000_C_GetRot::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

// Function 511000.511000_C.GetTarget
// 0x0090 (0x0090 - 0x0000)
struct Five11000_C_GetTarget final
{
public:
	int32                                         ___int_Array_Index_Variable;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECampRelation>                         K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	struct FSearchShape_Circle                    K2Node_MakeStruct_SearchShape_Circle;              // 0x0020(0x0010)(NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_QueryCharacterAndAccessoryWithCircleInfo_ReturnValue; // 0x0048(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Five11000_C_GetTarget) == 0x000008, "Wrong alignment on Five11000_C_GetTarget");
static_assert(sizeof(Five11000_C_GetTarget) == 0x000090, "Wrong size on Five11000_C_GetTarget");
static_assert(offsetof(Five11000_C_GetTarget, ___int_Array_Index_Variable) == 0x000000, "Member 'Five11000_C_GetTarget::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Five11000_C_GetTarget, ___int_Loop_Counter_Variable) == 0x000004, "Member 'Five11000_C_GetTarget::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Five11000_C_GetTarget, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Five11000_C_GetTarget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Five11000_C_GetTarget, K2Node_MakeArray_Array) == 0x000010, "Member 'Five11000_C_GetTarget::K2Node_MakeArray_Array' has a wrong offset!");
