#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Five11801

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass 511801.511801_C
// 0x0010 (0x09E0 - 0x09D0)
class AFive11801_C final : public ABullet
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         TotalTime;                                         // 0x09D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectGravity;                                     // 0x09DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBulletFire();
	void ExecuteUbergraph_511801(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"511801_C">();
	}
	static class AFive11801_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFive11801_C>();
	}
};
static_assert(alignof(AFive11801_C) == 0x000010, "Wrong alignment on AFive11801_C");
static_assert(sizeof(AFive11801_C) == 0x0009E0, "Wrong size on AFive11801_C");
static_assert(offsetof(AFive11801_C, UberGraphFrame) == 0x0009D0, "Member 'AFive11801_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFive11801_C, TotalTime) == 0x0009D8, "Member 'AFive11801_C::TotalTime' has a wrong offset!");
static_assert(offsetof(AFive11801_C, SelectGravity) == 0x0009DC, "Member 'AFive11801_C::SelectGravity' has a wrong offset!");

}

