#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Floating_Formula

#include "Basic.hpp"


namespace SDK::Params
{

// Function Floating_Formula.Floating_Formula_C.RestartFloating
// 0x0004 (0x0004 - 0x0000)
struct Floating_Formula_C_RestartFloating final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Floating_Formula_C_RestartFloating) == 0x000004, "Wrong alignment on Floating_Formula_C_RestartFloating");
static_assert(sizeof(Floating_Formula_C_RestartFloating) == 0x000004, "Wrong size on Floating_Formula_C_RestartFloating");
static_assert(offsetof(Floating_Formula_C_RestartFloating, ReturnValue) == 0x000000, "Member 'Floating_Formula_C_RestartFloating::ReturnValue' has a wrong offset!");

// Function Floating_Formula.Floating_Formula_C.MoveTickCalcVelocity
// 0x001C (0x001C - 0x0000)
struct Floating_Formula_C_MoveTickCalcVelocity final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Floating_Formula_C_MoveTickCalcVelocity) == 0x000004, "Wrong alignment on Floating_Formula_C_MoveTickCalcVelocity");
static_assert(sizeof(Floating_Formula_C_MoveTickCalcVelocity) == 0x00001C, "Wrong size on Floating_Formula_C_MoveTickCalcVelocity");
static_assert(offsetof(Floating_Formula_C_MoveTickCalcVelocity, DeltaTime) == 0x000000, "Member 'Floating_Formula_C_MoveTickCalcVelocity::DeltaTime' has a wrong offset!");
static_assert(offsetof(Floating_Formula_C_MoveTickCalcVelocity, ReturnValue) == 0x000004, "Member 'Floating_Formula_C_MoveTickCalcVelocity::ReturnValue' has a wrong offset!");
static_assert(offsetof(Floating_Formula_C_MoveTickCalcVelocity, CallFunc_FMax_ReturnValue) == 0x000008, "Member 'Floating_Formula_C_MoveTickCalcVelocity::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(Floating_Formula_C_MoveTickCalcVelocity, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'Floating_Formula_C_MoveTickCalcVelocity::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Floating_Formula_C_MoveTickCalcVelocity, CallFunc_Add_FloatFloat_ReturnValue) == 0x000010, "Member 'Floating_Formula_C_MoveTickCalcVelocity::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Floating_Formula_C_MoveTickCalcVelocity, CallFunc_FMax_ReturnValue_1) == 0x000014, "Member 'Floating_Formula_C_MoveTickCalcVelocity::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Floating_Formula_C_MoveTickCalcVelocity, K2Node_MathExpression_ReturnValue) == 0x000018, "Member 'Floating_Formula_C_MoveTickCalcVelocity::K2Node_MathExpression_ReturnValue' has a wrong offset!");

// Function Floating_Formula.Floating_Formula_C.FloatingRisingVelocity
// 0x0040 (0x0040 - 0x0000)
struct Floating_Formula_C_FloatingRisingVelocity final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable;                                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SafeDivide_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SafeDivide_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Floating_Formula_C_FloatingRisingVelocity) == 0x000004, "Wrong alignment on Floating_Formula_C_FloatingRisingVelocity");
static_assert(sizeof(Floating_Formula_C_FloatingRisingVelocity) == 0x000040, "Wrong size on Floating_Formula_C_FloatingRisingVelocity");
static_assert(offsetof(Floating_Formula_C_FloatingRisingVelocity, DeltaTime) == 0x000000, "Member 'Floating_Formula_C_FloatingRisingVelocity::DeltaTime' has a wrong offset!");
static_assert(offsetof(Floating_Formula_C_FloatingRisingVelocity, ReturnValue) == 0x000004, "Member 'Floating_Formula_C_FloatingRisingVelocity::ReturnValue' has a wrong offset!");
static_assert(offsetof(Floating_Formula_C_FloatingRisingVelocity, CallFunc_Add_FloatFloat_ReturnValue) == 0x000008, "Member 'Floating_Formula_C_FloatingRisingVelocity::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Floating_Formula_C_FloatingRisingVelocity, ___int_Variable) == 0x00000C, "Member 'Floating_Formula_C_FloatingRisingVelocity::___int_Variable' has a wrong offset!");
static_assert(offsetof(Floating_Formula_C_FloatingRisingVelocity, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000010, "Member 'Floating_Formula_C_FloatingRisingVelocity::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Floating_Formula_C_FloatingRisingVelocity, CallFunc_SafeDivide_ReturnValue) == 0x000014, "Member 'Floating_Formula_C_FloatingRisingVelocity::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(Floating_Formula_C_FloatingRisingVelocity, CallFunc_Min_ReturnValue) == 0x000018, "Member 'Floating_Formula_C_FloatingRisingVelocity::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(Floating_Formula_C_FloatingRisingVelocity, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00001C, "Member 'Floating_Formula_C_FloatingRisingVelocity::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Floating_Formula_C_FloatingRisingVelocity, K2Node_Select_Default) == 0x000020, "Member 'Floating_Formula_C_FloatingRisingVelocity::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Floating_Formula_C_FloatingRisingVelocity, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000024, "Member 'Floating_Formula_C_FloatingRisingVelocity::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Floating_Formula_C_FloatingRisingVelocity, CallFunc_FMax_ReturnValue) == 0x000028, "Member 'Floating_Formula_C_FloatingRisingVelocity::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(Floating_Formula_C_FloatingRisingVelocity, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x00002C, "Member 'Floating_Formula_C_FloatingRisingVelocity::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Floating_Formula_C_FloatingRisingVelocity, CallFunc_SafeDivide_ReturnValue_1) == 0x000030, "Member 'Floating_Formula_C_FloatingRisingVelocity::CallFunc_SafeDivide_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Floating_Formula_C_FloatingRisingVelocity, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000034, "Member 'Floating_Formula_C_FloatingRisingVelocity::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Floating_Formula_C_FloatingRisingVelocity, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000038, "Member 'Floating_Formula_C_FloatingRisingVelocity::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Floating_Formula_C_FloatingRisingVelocity, CallFunc_FMax_ReturnValue_1) == 0x00003C, "Member 'Floating_Formula_C_FloatingRisingVelocity::CallFunc_FMax_ReturnValue_1' has a wrong offset!");

}

