#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FogDataLibrary

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FogDataLibrary.FogDataLibrary_C.Get Fog Data Value
// 0x00F0 (0x00F0 - 0x0000)
struct FogDataLibrary_C_Get_Fog_Data_Value final
{
public:
	class FName                                   FogDataName;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFogConfig1st                          Fog_Data_1st;                                      // 0x0010(0x0024)(Parm, OutParm, NoDestructor)
	struct FFogConfig2st                          Fog_Data_2st;                                      // 0x0034(0x0024)(Parm, OutParm, NoDestructor)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        CallFunc_MakeSoftObjectPath_ReturnValue;           // 0x0098(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue; // 0x00B0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFogData*                               K2Node_DynamicCast_AsFog_Data;                     // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FogDataLibrary_C_Get_Fog_Data_Value) == 0x000008, "Wrong alignment on FogDataLibrary_C_Get_Fog_Data_Value");
static_assert(sizeof(FogDataLibrary_C_Get_Fog_Data_Value) == 0x0000F0, "Wrong size on FogDataLibrary_C_Get_Fog_Data_Value");
static_assert(offsetof(FogDataLibrary_C_Get_Fog_Data_Value, FogDataName) == 0x000000, "Member 'FogDataLibrary_C_Get_Fog_Data_Value::FogDataName' has a wrong offset!");
static_assert(offsetof(FogDataLibrary_C_Get_Fog_Data_Value, __WorldContext) == 0x000008, "Member 'FogDataLibrary_C_Get_Fog_Data_Value::__WorldContext' has a wrong offset!");
static_assert(offsetof(FogDataLibrary_C_Get_Fog_Data_Value, Fog_Data_1st) == 0x000010, "Member 'FogDataLibrary_C_Get_Fog_Data_Value::Fog_Data_1st' has a wrong offset!");
static_assert(offsetof(FogDataLibrary_C_Get_Fog_Data_Value, Fog_Data_2st) == 0x000034, "Member 'FogDataLibrary_C_Get_Fog_Data_Value::Fog_Data_2st' has a wrong offset!");
static_assert(offsetof(FogDataLibrary_C_Get_Fog_Data_Value, CallFunc_Conv_NameToString_ReturnValue) == 0x000058, "Member 'FogDataLibrary_C_Get_Fog_Data_Value::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(FogDataLibrary_C_Get_Fog_Data_Value, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'FogDataLibrary_C_Get_Fog_Data_Value::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(FogDataLibrary_C_Get_Fog_Data_Value, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000078, "Member 'FogDataLibrary_C_Get_Fog_Data_Value::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FogDataLibrary_C_Get_Fog_Data_Value, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000088, "Member 'FogDataLibrary_C_Get_Fog_Data_Value::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FogDataLibrary_C_Get_Fog_Data_Value, CallFunc_MakeSoftObjectPath_ReturnValue) == 0x000098, "Member 'FogDataLibrary_C_Get_Fog_Data_Value::CallFunc_MakeSoftObjectPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(FogDataLibrary_C_Get_Fog_Data_Value, CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue) == 0x0000B0, "Member 'FogDataLibrary_C_Get_Fog_Data_Value::CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue' has a wrong offset!");
static_assert(offsetof(FogDataLibrary_C_Get_Fog_Data_Value, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0000D8, "Member 'FogDataLibrary_C_Get_Fog_Data_Value::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(FogDataLibrary_C_Get_Fog_Data_Value, K2Node_DynamicCast_AsFog_Data) == 0x0000E0, "Member 'FogDataLibrary_C_Get_Fog_Data_Value::K2Node_DynamicCast_AsFog_Data' has a wrong offset!");
static_assert(offsetof(FogDataLibrary_C_Get_Fog_Data_Value, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'FogDataLibrary_C_Get_Fog_Data_Value::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

