#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FogMangaer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function FogMangaer.FogMangaer_C.Update Origin Parameter
// 0x009C (0x009C - 0x0000)
struct FogMangaer_C_Update_Origin_Parameter final
{
public:
	float                                         Alpha;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           OnestFogColor;                                     // 0x0004(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OnestFogDensity;                                   // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OnestFogHeightFallOff;                             // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OnestFogOpacity;                                   // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OnestFogStartDistance;                             // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TwostFogColor;                                     // 0x0024(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogDensity;                                   // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogHeightMax;                                 // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogHeightMin;                                 // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogHeightFade;                                // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogHeightOffset;                              // 0x0044(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OnestFogCustomHeight;                              // 0x0048(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_4;                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue_5;                       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_6;                       // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_7;                       // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_8;                       // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_9;                       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_1;            // 0x008C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FogMangaer_C_Update_Origin_Parameter) == 0x000004, "Wrong alignment on FogMangaer_C_Update_Origin_Parameter");
static_assert(sizeof(FogMangaer_C_Update_Origin_Parameter) == 0x00009C, "Wrong size on FogMangaer_C_Update_Origin_Parameter");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, Alpha) == 0x000000, "Member 'FogMangaer_C_Update_Origin_Parameter::Alpha' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, OnestFogColor) == 0x000004, "Member 'FogMangaer_C_Update_Origin_Parameter::OnestFogColor' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, OnestFogDensity) == 0x000014, "Member 'FogMangaer_C_Update_Origin_Parameter::OnestFogDensity' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, OnestFogHeightFallOff) == 0x000018, "Member 'FogMangaer_C_Update_Origin_Parameter::OnestFogHeightFallOff' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, OnestFogOpacity) == 0x00001C, "Member 'FogMangaer_C_Update_Origin_Parameter::OnestFogOpacity' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, OnestFogStartDistance) == 0x000020, "Member 'FogMangaer_C_Update_Origin_Parameter::OnestFogStartDistance' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, TwostFogColor) == 0x000024, "Member 'FogMangaer_C_Update_Origin_Parameter::TwostFogColor' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, TwostFogDensity) == 0x000034, "Member 'FogMangaer_C_Update_Origin_Parameter::TwostFogDensity' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, TwostFogHeightMax) == 0x000038, "Member 'FogMangaer_C_Update_Origin_Parameter::TwostFogHeightMax' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, TwostFogHeightMin) == 0x00003C, "Member 'FogMangaer_C_Update_Origin_Parameter::TwostFogHeightMin' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, TwostFogHeightFade) == 0x000040, "Member 'FogMangaer_C_Update_Origin_Parameter::TwostFogHeightFade' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, TwostFogHeightOffset) == 0x000044, "Member 'FogMangaer_C_Update_Origin_Parameter::TwostFogHeightOffset' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, OnestFogCustomHeight) == 0x000048, "Member 'FogMangaer_C_Update_Origin_Parameter::OnestFogCustomHeight' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, CallFunc_IsValid_ReturnValue) == 0x00004C, "Member 'FogMangaer_C_Update_Origin_Parameter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, CallFunc_Lerp_ReturnValue) == 0x000050, "Member 'FogMangaer_C_Update_Origin_Parameter::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, CallFunc_Lerp_ReturnValue_1) == 0x000054, "Member 'FogMangaer_C_Update_Origin_Parameter::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, CallFunc_Lerp_ReturnValue_2) == 0x000058, "Member 'FogMangaer_C_Update_Origin_Parameter::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, CallFunc_Lerp_ReturnValue_3) == 0x00005C, "Member 'FogMangaer_C_Update_Origin_Parameter::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, CallFunc_Lerp_ReturnValue_4) == 0x000060, "Member 'FogMangaer_C_Update_Origin_Parameter::CallFunc_Lerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, CallFunc_LinearColorLerp_ReturnValue) == 0x000064, "Member 'FogMangaer_C_Update_Origin_Parameter::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, CallFunc_IsValid_ReturnValue_1) == 0x000074, "Member 'FogMangaer_C_Update_Origin_Parameter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, CallFunc_Lerp_ReturnValue_5) == 0x000078, "Member 'FogMangaer_C_Update_Origin_Parameter::CallFunc_Lerp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, CallFunc_Lerp_ReturnValue_6) == 0x00007C, "Member 'FogMangaer_C_Update_Origin_Parameter::CallFunc_Lerp_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, CallFunc_Lerp_ReturnValue_7) == 0x000080, "Member 'FogMangaer_C_Update_Origin_Parameter::CallFunc_Lerp_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, CallFunc_Lerp_ReturnValue_8) == 0x000084, "Member 'FogMangaer_C_Update_Origin_Parameter::CallFunc_Lerp_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, CallFunc_Lerp_ReturnValue_9) == 0x000088, "Member 'FogMangaer_C_Update_Origin_Parameter::CallFunc_Lerp_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_Origin_Parameter, CallFunc_LinearColorLerp_ReturnValue_1) == 0x00008C, "Member 'FogMangaer_C_Update_Origin_Parameter::CallFunc_LinearColorLerp_ReturnValue_1' has a wrong offset!");

// Function FogMangaer.FogMangaer_C.Update High Parameter
// 0x00C0 (0x00C0 - 0x0000)
struct FogMangaer_C_Update_High_Parameter final
{
public:
	float                                         Alpha;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           OnestFogColor;                                     // 0x0004(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OnestFogDensity;                                   // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OnestFogHeightFallOff;                             // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OnestFogOpacity;                                   // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OnestFogStartDistance;                             // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TwostFogColor;                                     // 0x0024(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogDensity;                                   // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogHeightMax;                                 // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogHeightMin;                                 // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogHeightFade;                                // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogHeightOffset;                              // 0x0044(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CurrentFog;                                        // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MoveFog;                                           // 0x0058(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	float                                         Dist1stFogCustomHeight;                            // 0x0068(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_4;                       // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0084(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue_5;                       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_6;                       // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_7;                       // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_8;                       // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_9;                       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_1;            // 0x00AC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FogMangaer_C_Update_High_Parameter) == 0x000008, "Wrong alignment on FogMangaer_C_Update_High_Parameter");
static_assert(sizeof(FogMangaer_C_Update_High_Parameter) == 0x0000C0, "Wrong size on FogMangaer_C_Update_High_Parameter");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, Alpha) == 0x000000, "Member 'FogMangaer_C_Update_High_Parameter::Alpha' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, OnestFogColor) == 0x000004, "Member 'FogMangaer_C_Update_High_Parameter::OnestFogColor' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, OnestFogDensity) == 0x000014, "Member 'FogMangaer_C_Update_High_Parameter::OnestFogDensity' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, OnestFogHeightFallOff) == 0x000018, "Member 'FogMangaer_C_Update_High_Parameter::OnestFogHeightFallOff' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, OnestFogOpacity) == 0x00001C, "Member 'FogMangaer_C_Update_High_Parameter::OnestFogOpacity' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, OnestFogStartDistance) == 0x000020, "Member 'FogMangaer_C_Update_High_Parameter::OnestFogStartDistance' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, TwostFogColor) == 0x000024, "Member 'FogMangaer_C_Update_High_Parameter::TwostFogColor' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, TwostFogDensity) == 0x000034, "Member 'FogMangaer_C_Update_High_Parameter::TwostFogDensity' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, TwostFogHeightMax) == 0x000038, "Member 'FogMangaer_C_Update_High_Parameter::TwostFogHeightMax' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, TwostFogHeightMin) == 0x00003C, "Member 'FogMangaer_C_Update_High_Parameter::TwostFogHeightMin' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, TwostFogHeightFade) == 0x000040, "Member 'FogMangaer_C_Update_High_Parameter::TwostFogHeightFade' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, TwostFogHeightOffset) == 0x000044, "Member 'FogMangaer_C_Update_High_Parameter::TwostFogHeightOffset' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, CurrentFog) == 0x000048, "Member 'FogMangaer_C_Update_High_Parameter::CurrentFog' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, MoveFog) == 0x000058, "Member 'FogMangaer_C_Update_High_Parameter::MoveFog' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, Dist1stFogCustomHeight) == 0x000068, "Member 'FogMangaer_C_Update_High_Parameter::Dist1stFogCustomHeight' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, CallFunc_IsValid_ReturnValue) == 0x00006C, "Member 'FogMangaer_C_Update_High_Parameter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, CallFunc_Lerp_ReturnValue) == 0x000070, "Member 'FogMangaer_C_Update_High_Parameter::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, CallFunc_Lerp_ReturnValue_1) == 0x000074, "Member 'FogMangaer_C_Update_High_Parameter::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, CallFunc_Lerp_ReturnValue_2) == 0x000078, "Member 'FogMangaer_C_Update_High_Parameter::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, CallFunc_Lerp_ReturnValue_3) == 0x00007C, "Member 'FogMangaer_C_Update_High_Parameter::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, CallFunc_Lerp_ReturnValue_4) == 0x000080, "Member 'FogMangaer_C_Update_High_Parameter::CallFunc_Lerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, CallFunc_LinearColorLerp_ReturnValue) == 0x000084, "Member 'FogMangaer_C_Update_High_Parameter::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, CallFunc_IsValid_ReturnValue_1) == 0x000094, "Member 'FogMangaer_C_Update_High_Parameter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, CallFunc_Lerp_ReturnValue_5) == 0x000098, "Member 'FogMangaer_C_Update_High_Parameter::CallFunc_Lerp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, CallFunc_Lerp_ReturnValue_6) == 0x00009C, "Member 'FogMangaer_C_Update_High_Parameter::CallFunc_Lerp_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, CallFunc_Lerp_ReturnValue_7) == 0x0000A0, "Member 'FogMangaer_C_Update_High_Parameter::CallFunc_Lerp_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, CallFunc_Lerp_ReturnValue_8) == 0x0000A4, "Member 'FogMangaer_C_Update_High_Parameter::CallFunc_Lerp_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, CallFunc_Lerp_ReturnValue_9) == 0x0000A8, "Member 'FogMangaer_C_Update_High_Parameter::CallFunc_Lerp_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_Update_High_Parameter, CallFunc_LinearColorLerp_ReturnValue_1) == 0x0000AC, "Member 'FogMangaer_C_Update_High_Parameter::CallFunc_LinearColorLerp_ReturnValue_1' has a wrong offset!");

// Function FogMangaer.FogMangaer_C.LerpColorUpdate
// 0x0070 (0x0070 - 0x0000)
struct FogMangaer_C_LerpColorUpdate final
{
public:
	struct FLinearColor                           Dist1stFogColor;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dist1stFogDensity;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DIst1stFogHeightFallOff;                           // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DIst1stFogOpacity;                                 // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DIst1stFogStartDistance;                           // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Dist2stFogColor;                                   // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dist2stFogDensity;                                 // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DIst2stFogHeightMax;                               // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dist2stFogHeightMin;                               // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dist2stFogHeightFade;                              // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dist2stFogHeightOffset;                            // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CurrentFog;                                        // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MoveFog;                                           // 0x0058(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	float                                         Dist1stFogCustomHeight;                            // 0x0068(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FogMangaer_C_LerpColorUpdate) == 0x000008, "Wrong alignment on FogMangaer_C_LerpColorUpdate");
static_assert(sizeof(FogMangaer_C_LerpColorUpdate) == 0x000070, "Wrong size on FogMangaer_C_LerpColorUpdate");
static_assert(offsetof(FogMangaer_C_LerpColorUpdate, Dist1stFogColor) == 0x000000, "Member 'FogMangaer_C_LerpColorUpdate::Dist1stFogColor' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_LerpColorUpdate, Dist1stFogDensity) == 0x000010, "Member 'FogMangaer_C_LerpColorUpdate::Dist1stFogDensity' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_LerpColorUpdate, DIst1stFogHeightFallOff) == 0x000014, "Member 'FogMangaer_C_LerpColorUpdate::DIst1stFogHeightFallOff' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_LerpColorUpdate, DIst1stFogOpacity) == 0x000018, "Member 'FogMangaer_C_LerpColorUpdate::DIst1stFogOpacity' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_LerpColorUpdate, DIst1stFogStartDistance) == 0x00001C, "Member 'FogMangaer_C_LerpColorUpdate::DIst1stFogStartDistance' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_LerpColorUpdate, Dist2stFogColor) == 0x000020, "Member 'FogMangaer_C_LerpColorUpdate::Dist2stFogColor' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_LerpColorUpdate, Dist2stFogDensity) == 0x000030, "Member 'FogMangaer_C_LerpColorUpdate::Dist2stFogDensity' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_LerpColorUpdate, DIst2stFogHeightMax) == 0x000034, "Member 'FogMangaer_C_LerpColorUpdate::DIst2stFogHeightMax' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_LerpColorUpdate, Dist2stFogHeightMin) == 0x000038, "Member 'FogMangaer_C_LerpColorUpdate::Dist2stFogHeightMin' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_LerpColorUpdate, Dist2stFogHeightFade) == 0x00003C, "Member 'FogMangaer_C_LerpColorUpdate::Dist2stFogHeightFade' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_LerpColorUpdate, Dist2stFogHeightOffset) == 0x000040, "Member 'FogMangaer_C_LerpColorUpdate::Dist2stFogHeightOffset' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_LerpColorUpdate, CurrentFog) == 0x000048, "Member 'FogMangaer_C_LerpColorUpdate::CurrentFog' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_LerpColorUpdate, MoveFog) == 0x000058, "Member 'FogMangaer_C_LerpColorUpdate::MoveFog' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_LerpColorUpdate, Dist1stFogCustomHeight) == 0x000068, "Member 'FogMangaer_C_LerpColorUpdate::Dist1stFogCustomHeight' has a wrong offset!");

// Function FogMangaer.FogMangaer_C.1stLerpColor
// 0x0048 (0x0048 - 0x0000)
struct FogMangaer_C_OnestLerpColor final
{
public:
	struct FLinearColor                           Dist1stFogColor;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dist1stFogDensity;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DIst1stFogHeightFallOff;                           // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DIst1stFogOpacity;                                 // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DIst1stFogStartDistance;                           // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Dist2stFogColor;                                   // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dist2stFogDensity;                                 // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DIst2stFogHeightMax;                               // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dist2stFogHeightMin;                               // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dist2stFogHeightFade;                              // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dist2stFogHeightOffset;                            // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dist1stFogCustomHeight;                            // 0x0044(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FogMangaer_C_OnestLerpColor) == 0x000004, "Wrong alignment on FogMangaer_C_OnestLerpColor");
static_assert(sizeof(FogMangaer_C_OnestLerpColor) == 0x000048, "Wrong size on FogMangaer_C_OnestLerpColor");
static_assert(offsetof(FogMangaer_C_OnestLerpColor, Dist1stFogColor) == 0x000000, "Member 'FogMangaer_C_OnestLerpColor::Dist1stFogColor' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_OnestLerpColor, Dist1stFogDensity) == 0x000010, "Member 'FogMangaer_C_OnestLerpColor::Dist1stFogDensity' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_OnestLerpColor, DIst1stFogHeightFallOff) == 0x000014, "Member 'FogMangaer_C_OnestLerpColor::DIst1stFogHeightFallOff' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_OnestLerpColor, DIst1stFogOpacity) == 0x000018, "Member 'FogMangaer_C_OnestLerpColor::DIst1stFogOpacity' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_OnestLerpColor, DIst1stFogStartDistance) == 0x00001C, "Member 'FogMangaer_C_OnestLerpColor::DIst1stFogStartDistance' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_OnestLerpColor, Dist2stFogColor) == 0x000020, "Member 'FogMangaer_C_OnestLerpColor::Dist2stFogColor' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_OnestLerpColor, Dist2stFogDensity) == 0x000030, "Member 'FogMangaer_C_OnestLerpColor::Dist2stFogDensity' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_OnestLerpColor, DIst2stFogHeightMax) == 0x000034, "Member 'FogMangaer_C_OnestLerpColor::DIst2stFogHeightMax' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_OnestLerpColor, Dist2stFogHeightMin) == 0x000038, "Member 'FogMangaer_C_OnestLerpColor::Dist2stFogHeightMin' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_OnestLerpColor, Dist2stFogHeightFade) == 0x00003C, "Member 'FogMangaer_C_OnestLerpColor::Dist2stFogHeightFade' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_OnestLerpColor, Dist2stFogHeightOffset) == 0x000040, "Member 'FogMangaer_C_OnestLerpColor::Dist2stFogHeightOffset' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_OnestLerpColor, Dist1stFogCustomHeight) == 0x000044, "Member 'FogMangaer_C_OnestLerpColor::Dist1stFogCustomHeight' has a wrong offset!");

// Function FogMangaer.FogMangaer_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct FogMangaer_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FogMangaer_C_ReceiveTick) == 0x000004, "Wrong alignment on FogMangaer_C_ReceiveTick");
static_assert(sizeof(FogMangaer_C_ReceiveTick) == 0x000004, "Wrong size on FogMangaer_C_ReceiveTick");
static_assert(offsetof(FogMangaer_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'FogMangaer_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function FogMangaer.FogMangaer_C.SwitchFogColor
// 0x0070 (0x0070 - 0x0000)
struct FogMangaer_C_SwitchFogColor final
{
public:
	struct FLinearColor                           Dist1stFogColor;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dist1stFogDensity;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DIst1stFogHeightFallOff;                           // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DIst1stFogOpacity;                                 // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DIst1stFogStartDistance;                           // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Dist2stFogColor;                                   // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dist2stFogDensity;                                 // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DIst2stFogHeightMax;                               // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dist2stFogHeightMin;                               // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dist2stFogHeightFade;                              // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dist2stFogHeightOffset;                            // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CurrentFog;                                        // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MoveFog;                                           // 0x0058(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	float                                         Dist1stFogCustomHeight;                            // 0x0068(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FogMangaer_C_SwitchFogColor) == 0x000008, "Wrong alignment on FogMangaer_C_SwitchFogColor");
static_assert(sizeof(FogMangaer_C_SwitchFogColor) == 0x000070, "Wrong size on FogMangaer_C_SwitchFogColor");
static_assert(offsetof(FogMangaer_C_SwitchFogColor, Dist1stFogColor) == 0x000000, "Member 'FogMangaer_C_SwitchFogColor::Dist1stFogColor' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_SwitchFogColor, Dist1stFogDensity) == 0x000010, "Member 'FogMangaer_C_SwitchFogColor::Dist1stFogDensity' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_SwitchFogColor, DIst1stFogHeightFallOff) == 0x000014, "Member 'FogMangaer_C_SwitchFogColor::DIst1stFogHeightFallOff' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_SwitchFogColor, DIst1stFogOpacity) == 0x000018, "Member 'FogMangaer_C_SwitchFogColor::DIst1stFogOpacity' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_SwitchFogColor, DIst1stFogStartDistance) == 0x00001C, "Member 'FogMangaer_C_SwitchFogColor::DIst1stFogStartDistance' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_SwitchFogColor, Dist2stFogColor) == 0x000020, "Member 'FogMangaer_C_SwitchFogColor::Dist2stFogColor' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_SwitchFogColor, Dist2stFogDensity) == 0x000030, "Member 'FogMangaer_C_SwitchFogColor::Dist2stFogDensity' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_SwitchFogColor, DIst2stFogHeightMax) == 0x000034, "Member 'FogMangaer_C_SwitchFogColor::DIst2stFogHeightMax' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_SwitchFogColor, Dist2stFogHeightMin) == 0x000038, "Member 'FogMangaer_C_SwitchFogColor::Dist2stFogHeightMin' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_SwitchFogColor, Dist2stFogHeightFade) == 0x00003C, "Member 'FogMangaer_C_SwitchFogColor::Dist2stFogHeightFade' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_SwitchFogColor, Dist2stFogHeightOffset) == 0x000040, "Member 'FogMangaer_C_SwitchFogColor::Dist2stFogHeightOffset' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_SwitchFogColor, CurrentFog) == 0x000048, "Member 'FogMangaer_C_SwitchFogColor::CurrentFog' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_SwitchFogColor, MoveFog) == 0x000058, "Member 'FogMangaer_C_SwitchFogColor::MoveFog' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_SwitchFogColor, Dist1stFogCustomHeight) == 0x000068, "Member 'FogMangaer_C_SwitchFogColor::Dist1stFogCustomHeight' has a wrong offset!");

// Function FogMangaer.FogMangaer_C.ExecuteUbergraph_FogMangaer
// 0x01B8 (0x01B8 - 0x0000)
struct FogMangaer_C_ExecuteUbergraph_FogMangaer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APostFog_Under_BP_C*>            CallFunc_GetAllActorsOfClass_OutActors;            // 0x0038(0x0010)(ReferenceParm)
	struct FLinearColor                           K2Node_CustomEvent_Dist1stFogColor_2;              // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Dist1stFogDensity_2;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DIst1stFogHeightFallOff_2;      // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DIst1stFogOpacity_2;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DIst1stFogStartDistance_2;      // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_Dist2stFogColor_2;              // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Dist2stFogDensity_2;            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DIst2stFogHeightMax_2;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Dist2stFogHeightMin_2;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Dist2stFogHeightFade_2;         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Dist2stFogHeightOffset_2;       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_CurrentFog_1;                   // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_MoveFog_1;                      // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Dist1stFogCustomHeight_2;       // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_Dist1stFogColor_1;              // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Dist1stFogDensity_1;            // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DIst1stFogHeightFallOff_1;      // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DIst1stFogOpacity_1;            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DIst1stFogStartDistance_1;      // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_Dist2stFogColor_1;              // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Dist2stFogDensity_1;            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DIst2stFogHeightMax_1;          // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Dist2stFogHeightMin_1;          // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Dist2stFogHeightFade_1;         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Dist2stFogHeightOffset_1;       // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Dist1stFogCustomHeight_1;       // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AExpFog_C*>                      CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0100(0x0010)(ReferenceParm)
	class AExpFog_C*                              CallFunc_Array_Get_Item;                           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APostFog_Under_BP_C*                    CallFunc_Array_Get_Item_1;                         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_Dist1stFogColor;                // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Dist1stFogDensity;              // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DIst1stFogHeightFallOff;        // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DIst1stFogOpacity;              // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DIst1stFogStartDistance;        // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_Dist2stFogColor;                // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Dist2stFogDensity;              // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DIst2stFogHeightMax;            // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Dist2stFogHeightMin;            // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Dist2stFogHeightFade;           // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Dist2stFogHeightOffset;         // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_CurrentFog;                     // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_MoveFog;                        // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Dist1stFogCustomHeight;         // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FogMangaer_C_ExecuteUbergraph_FogMangaer) == 0x000008, "Wrong alignment on FogMangaer_C_ExecuteUbergraph_FogMangaer");
static_assert(sizeof(FogMangaer_C_ExecuteUbergraph_FogMangaer) == 0x0001B8, "Wrong size on FogMangaer_C_ExecuteUbergraph_FogMangaer");
static_assert(offsetof(FogMangaer_C_ExecuteUbergraph_FogMangaer, EntryPoint) == 0x000000, "Member 'FogMangaer_C_ExecuteUbergraph_FogMangaer::EntryPoint' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_ExecuteUbergraph_FogMangaer, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'FogMangaer_C_ExecuteUbergraph_FogMangaer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FogMangaer_C_ExecuteUbergraph_FogMangaer, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'FogMangaer_C_ExecuteUbergraph_FogMangaer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
