#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FogMangaer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass FogMangaer.FogMangaer_C
// 0x0078 (0x02A0 - 0x0228)
class AFogMangaer_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_DelatTime_05CD92B84E0890E2CE913783B4A2DAF5; // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_05CD92B84E0890E2CE913783B4A2DAF5; // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_DelatTime_841D507944112188EE8FEBB7C55B5AB0; // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_841D507944112188EE8FEBB7C55B5AB0; // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable;                                            // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APostFog_Under_BP_C*                    High;                                              // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APostFog_Under_BP_C*                    Low;                                               // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APostFog_Under_BP_C*                    FogVolume;                                         // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AExpFog_C*                              ExpFog;                                            // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaTime;                                         // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Handle;                                            // 0x0288(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer2;                                            // 0x0290(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          TimeLineEnd;                                       // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void Update_Origin_Parameter(float Alpha, const struct FLinearColor& OnestFogColor, float OnestFogDensity, float OnestFogHeightFallOff, float OnestFogOpacity, float OnestFogStartDistance, const struct FLinearColor& TwostFogColor, float TwostFogDensity, float TwostFogHeightMax, float TwostFogHeightMin, float TwostFogHeightFade, float TwostFogHeightOffset, float OnestFogCustomHeight);
	void Update_High_Parameter(float Alpha, const struct FLinearColor& OnestFogColor, float OnestFogDensity, float OnestFogHeightFallOff, float OnestFogOpacity, float OnestFogStartDistance, const struct FLinearColor& TwostFogColor, float TwostFogDensity, float TwostFogHeightMax, float TwostFogHeightMin, float TwostFogHeightFade, float TwostFogHeightOffset, const class FString& CurrentFog, const class FString& MoveFog, float Dist1stFogCustomHeight);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void ReceiveBeginPlay();
	void LerpColorUpdate(const struct FLinearColor& Dist1stFogColor, float Dist1stFogDensity, float DIst1stFogHeightFallOff, float DIst1stFogOpacity, float DIst1stFogStartDistance, const struct FLinearColor& Dist2stFogColor, float Dist2stFogDensity, float DIst2stFogHeightMax, float Dist2stFogHeightMin, float Dist2stFogHeightFade, float Dist2stFogHeightOffset, const class FString& CurrentFog, const class FString& MoveFog, float Dist1stFogCustomHeight);
	void OnestLerpColor(const struct FLinearColor& Dist1stFogColor, float Dist1stFogDensity, float DIst1stFogHeightFallOff, float DIst1stFogOpacity, float DIst1stFogStartDistance, const struct FLinearColor& Dist2stFogColor, float Dist2stFogDensity, float DIst2stFogHeightMax, float Dist2stFogHeightMin, float Dist2stFogHeightFade, float Dist2stFogHeightOffset, float Dist1stFogCustomHeight);
	void bPawnActive();
	void ReceiveTick(float DeltaSeconds);
	void SwitchFogColor(const struct FLinearColor& Dist1stFogColor, float Dist1stFogDensity, float DIst1stFogHeightFallOff, float DIst1stFogOpacity, float DIst1stFogStartDistance, const struct FLinearColor& Dist2stFogColor, float Dist2stFogDensity, float DIst2stFogHeightMax, float Dist2stFogHeightMin, float Dist2stFogHeightFade, float Dist2stFogHeightOffset, const class FString& CurrentFog, const class FString& MoveFog, float Dist1stFogCustomHeight);
	void NewTime();
	void ExecuteUbergraph_FogMangaer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FogMangaer_C">();
	}
	static class AFogMangaer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFogMangaer_C>();
	}
};
static_assert(alignof(AFogMangaer_C) == 0x000008, "Wrong alignment on AFogMangaer_C");
static_assert(sizeof(AFogMangaer_C) == 0x0002A0, "Wrong size on AFogMangaer_C");
static_assert(offsetof(AFogMangaer_C, UberGraphFrame) == 0x000228, "Member 'AFogMangaer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFogMangaer_C, DefaultSceneRoot) == 0x000230, "Member 'AFogMangaer_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AFogMangaer_C, Timeline_1_DelatTime_05CD92B84E0890E2CE913783B4A2DAF5) == 0x000238, "Member 'AFogMangaer_C::Timeline_1_DelatTime_05CD92B84E0890E2CE913783B4A2DAF5' has a wrong offset!");
static_assert(offsetof(AFogMangaer_C, Timeline_1__Direction_05CD92B84E0890E2CE913783B4A2DAF5) == 0x00023C, "Member 'AFogMangaer_C::Timeline_1__Direction_05CD92B84E0890E2CE913783B4A2DAF5' has a wrong offset!");
static_assert(offsetof(AFogMangaer_C, Timeline_1) == 0x000240, "Member 'AFogMangaer_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(AFogMangaer_C, Timeline_0_DelatTime_841D507944112188EE8FEBB7C55B5AB0) == 0x000248, "Member 'AFogMangaer_C::Timeline_0_DelatTime_841D507944112188EE8FEBB7C55B5AB0' has a wrong offset!");
static_assert(offsetof(AFogMangaer_C, Timeline_0__Direction_841D507944112188EE8FEBB7C55B5AB0) == 0x00024C, "Member 'AFogMangaer_C::Timeline_0__Direction_841D507944112188EE8FEBB7C55B5AB0' has a wrong offset!");
static_assert(offsetof(AFogMangaer_C, Timeline_0) == 0x000250, "Member 'AFogMangaer_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AFogMangaer_C, Enable) == 0x000258, "Member 'AFogMangaer_C::Enable' has a wrong offset!");
static_assert(offsetof(AFogMangaer_C, High) == 0x000260, "Member 'AFogMangaer_C::High' has a wrong offset!");
static_assert(offsetof(AFogMangaer_C, Low) == 0x000268, "Member 'AFogMangaer_C::Low' has a wrong offset!");
static_assert(offsetof(AFogMangaer_C, FogVolume) == 0x000270, "Member 'AFogMangaer_C::FogVolume' has a wrong offset!");
static_assert(offsetof(AFogMangaer_C, ExpFog) == 0x000278, "Member 'AFogMangaer_C::ExpFog' has a wrong offset!");
static_assert(offsetof(AFogMangaer_C, DeltaTime) == 0x000280, "Member 'AFogMangaer_C::DeltaTime' has a wrong offset!");
static_assert(offsetof(AFogMangaer_C, Handle) == 0x000288, "Member 'AFogMangaer_C::Handle' has a wrong offset!");
static_assert(offsetof(AFogMangaer_C, Timer2) == 0x000290, "Member 'AFogMangaer_C::Timer2' has a wrong offset!");
static_assert(offsetof(AFogMangaer_C, TimeLineEnd) == 0x000298, "Member 'AFogMangaer_C::TimeLineEnd' has a wrong offset!");

}

