#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Four11400

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass 411400.411400_C
// 0x0030 (0x0A00 - 0x09D0)
class AFour11400_C final : public ABullet
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_NewTrack_0_AEC552C54696396405C5A8A99AE27FD4; // 0x09D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_AEC552C54696396405C5A8A99AE27FD4; // 0x09DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9DD[0x3];                                      // 0x09DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x09E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SumYaw;                                            // 0x09E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Num;                                               // 0x09EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CalYaw;                                            // 0x09F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LoopCount;                                         // 0x09F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_411400(int32 EntryPoint);
	void UseNaturallyMoveWithPoweDecay(float Speed, float Acceleration, float DecayTime, int32 DecayEmitterID);
	void UseRevolveNaturallyMove(float Section1Speed, float Section1Acceleration, float DelayTime, float Section2Acceleration, class AActor* Target);
	void UseDelayNaturallyMove(float Delay, float Speed, float Acceleration);
	void UseHomingMove(const struct FVector& VelocityDirection, float MoveSpeed, float Acceleration, float AngularSpeed, class AActor* Target, float StopHomingDelay, float VelocityDuration);
	void UseNaturallyMoveWithGravity(float Speed, float GravityScale);
	void UseNaturallyMove(float Speed, float Acceleration);
	void UseSpiralMove(const struct FVector& VelocityDirection, float MoveSpeed, float RotateTime, const struct FVector& SpiralCenter, const struct FVector& ForwardVector, float SpiralSpeed);
	void ReceiveBulletFire();
	void Timeline__UpdateFunc();
	void Timeline__FinishedFunc();
	void GetRot(const struct FVector& Location, int32 Min, int32 Max, struct FTransform* Rot);
	void GetTarget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"411400_C">();
	}
	static class AFour11400_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFour11400_C>();
	}
};
static_assert(alignof(AFour11400_C) == 0x000010, "Wrong alignment on AFour11400_C");
static_assert(sizeof(AFour11400_C) == 0x000A00, "Wrong size on AFour11400_C");
static_assert(offsetof(AFour11400_C, UberGraphFrame) == 0x0009D0, "Member 'AFour11400_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFour11400_C, Timeline_NewTrack_0_AEC552C54696396405C5A8A99AE27FD4) == 0x0009D8, "Member 'AFour11400_C::Timeline_NewTrack_0_AEC552C54696396405C5A8A99AE27FD4' has a wrong offset!");
static_assert(offsetof(AFour11400_C, Timeline__Direction_AEC552C54696396405C5A8A99AE27FD4) == 0x0009DC, "Member 'AFour11400_C::Timeline__Direction_AEC552C54696396405C5A8A99AE27FD4' has a wrong offset!");
static_assert(offsetof(AFour11400_C, Timeline) == 0x0009E0, "Member 'AFour11400_C::Timeline' has a wrong offset!");
static_assert(offsetof(AFour11400_C, SumYaw) == 0x0009E8, "Member 'AFour11400_C::SumYaw' has a wrong offset!");
static_assert(offsetof(AFour11400_C, Num) == 0x0009EC, "Member 'AFour11400_C::Num' has a wrong offset!");
static_assert(offsetof(AFour11400_C, CalYaw) == 0x0009F0, "Member 'AFour11400_C::CalYaw' has a wrong offset!");
static_assert(offsetof(AFour11400_C, LoopCount) == 0x0009F4, "Member 'AFour11400_C::LoopCount' has a wrong offset!");

}

