#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Four00502_Parabola

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function 400502_Parabola.400502_Parabola_C.ExecuteUbergraph_400502_Parabola
// 0x0108 (0x0108 - 0x0000)
struct Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable;                                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_2;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_3;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_4;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCacheTarget_OutTargetLoc;              // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCacheTarget_OutHomingSocket;           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetCacheTarget_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Vector_Distance2D_ReturnValue;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_2;       // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_3;       // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGravityZ_ReturnValue;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola) == 0x000008, "Wrong alignment on Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola");
static_assert(sizeof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola) == 0x000108, "Wrong size on Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, EntryPoint) == 0x000000, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::EntryPoint' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, ___int_Variable) == 0x000004, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::___int_Variable' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, ___float_Variable) == 0x000008, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::___float_Variable' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, ___float_Variable_1) == 0x00000C, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::___float_Variable_1' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, ___float_Variable_2) == 0x000010, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::___float_Variable_2' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, ___float_Variable_3) == 0x000014, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::___float_Variable_3' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, ___float_Variable_4) == 0x000018, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::___float_Variable_4' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_GetCacheTarget_OutTargetLoc) == 0x00001C, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_GetCacheTarget_OutTargetLoc' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_GetCacheTarget_OutHomingSocket) == 0x000028, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_GetCacheTarget_OutHomingSocket' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_GetCacheTarget_ReturnValue) == 0x000038, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_GetCacheTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_FindLookAtRotation_ReturnValue) == 0x00004C, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_Vector_Distance2D_ReturnValue) == 0x000058, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_Vector_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_GetUpVector_ReturnValue) == 0x00005C, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000068, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_Normal_ReturnValue) == 0x00006C, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000078, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_LessEqual_FloatFloat_ReturnValue_2) == 0x000079, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_LessEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_LessEqual_FloatFloat_ReturnValue_3) == 0x00007A, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_LessEqual_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_GetForwardVector_ReturnValue) == 0x00007C, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_Normal_ReturnValue_1) == 0x000088, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000094, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_MakeVector_ReturnValue) == 0x000098, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000A4, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, K2Node_Select_Default) == 0x0000B0, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000B4, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_GetGravityZ_ReturnValue) == 0x0000B8, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_GetGravityZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_Abs_ReturnValue) == 0x0000BC, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000C0, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000C4, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_Add_VectorVector_ReturnValue) == 0x0000D0, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_FindLookAtRotation_ReturnValue_1) == 0x0000DC, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_FindLookAtRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_VSize_ReturnValue) == 0x0000E8, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_BreakRotator_Roll) == 0x0000EC, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_BreakRotator_Pitch) == 0x0000F0, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_BreakRotator_Yaw) == 0x0000F4, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola, CallFunc_MakeRotator_ReturnValue) == 0x0000F8, "Member 'Four00502_Parabola_C_ExecuteUbergraph_400502_Parabola::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");

}

