#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameTask

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameTask_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GameTask.CustomTriggerComponent.OnEnter
// 0x00B0 (0x00B0 - 0x0000)
struct CustomTriggerComponent_OnEnter final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CustomTriggerComponent_OnEnter) == 0x000008, "Wrong alignment on CustomTriggerComponent_OnEnter");
static_assert(sizeof(CustomTriggerComponent_OnEnter) == 0x0000B0, "Wrong size on CustomTriggerComponent_OnEnter");
static_assert(offsetof(CustomTriggerComponent_OnEnter, OverlappedComponent) == 0x000000, "Member 'CustomTriggerComponent_OnEnter::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(CustomTriggerComponent_OnEnter, OtherActor) == 0x000008, "Member 'CustomTriggerComponent_OnEnter::OtherActor' has a wrong offset!");
static_assert(offsetof(CustomTriggerComponent_OnEnter, OtherComp) == 0x000010, "Member 'CustomTriggerComponent_OnEnter::OtherComp' has a wrong offset!");
static_assert(offsetof(CustomTriggerComponent_OnEnter, OtherBodyIndex) == 0x000018, "Member 'CustomTriggerComponent_OnEnter::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(CustomTriggerComponent_OnEnter, bFromSweep) == 0x00001C, "Member 'CustomTriggerComponent_OnEnter::bFromSweep' has a wrong offset!");
static_assert(offsetof(CustomTriggerComponent_OnEnter, SweepResult) == 0x000020, "Member 'CustomTriggerComponent_OnEnter::SweepResult' has a wrong offset!");

// Function GameTask.CustomTriggerComponent.OnLeave
// 0x0020 (0x0020 - 0x0000)
struct CustomTriggerComponent_OnLeave final
{
public:
	class UPrimitiveComponent*                    InComponent;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 InOther;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    InOtherComponent;                                  // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InBody;                                            // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CustomTriggerComponent_OnLeave) == 0x000008, "Wrong alignment on CustomTriggerComponent_OnLeave");
static_assert(sizeof(CustomTriggerComponent_OnLeave) == 0x000020, "Wrong size on CustomTriggerComponent_OnLeave");
static_assert(offsetof(CustomTriggerComponent_OnLeave, InComponent) == 0x000000, "Member 'CustomTriggerComponent_OnLeave::InComponent' has a wrong offset!");
static_assert(offsetof(CustomTriggerComponent_OnLeave, InOther) == 0x000008, "Member 'CustomTriggerComponent_OnLeave::InOther' has a wrong offset!");
static_assert(offsetof(CustomTriggerComponent_OnLeave, InOtherComponent) == 0x000010, "Member 'CustomTriggerComponent_OnLeave::InOtherComponent' has a wrong offset!");
static_assert(offsetof(CustomTriggerComponent_OnLeave, InBody) == 0x000018, "Member 'CustomTriggerComponent_OnLeave::InBody' has a wrong offset!");

// Function GameTask.GameTask.GetPlotList
// 0x0018 (0x0018 - 0x0000)
struct GameTask_GetPlotList final
{
public:
	class UGameTask*                              InTask;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_GetPlotList) == 0x000008, "Wrong alignment on GameTask_GetPlotList");
static_assert(sizeof(GameTask_GetPlotList) == 0x000018, "Wrong size on GameTask_GetPlotList");
static_assert(offsetof(GameTask_GetPlotList, InTask) == 0x000000, "Member 'GameTask_GetPlotList::InTask' has a wrong offset!");
static_assert(offsetof(GameTask_GetPlotList, ReturnValue) == 0x000008, "Member 'GameTask_GetPlotList::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask.End
// 0x0008 (0x0008 - 0x0000)
struct GameTask_End final
{
public:
	class AGameTaskActor*                         InOwner;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_End) == 0x000008, "Wrong alignment on GameTask_End");
static_assert(sizeof(GameTask_End) == 0x000008, "Wrong size on GameTask_End");
static_assert(offsetof(GameTask_End, InOwner) == 0x000000, "Member 'GameTask_End::InOwner' has a wrong offset!");

// Function GameTask.GameTask.EndSubRootNode
// 0x0018 (0x0018 - 0x0000)
struct GameTask_EndSubRootNode final
{
public:
	class FString                                 SubRootNodeName;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameTask_EndSubRootNode) == 0x000008, "Wrong alignment on GameTask_EndSubRootNode");
static_assert(sizeof(GameTask_EndSubRootNode) == 0x000018, "Wrong size on GameTask_EndSubRootNode");
static_assert(offsetof(GameTask_EndSubRootNode, SubRootNodeName) == 0x000000, "Member 'GameTask_EndSubRootNode::SubRootNodeName' has a wrong offset!");
static_assert(offsetof(GameTask_EndSubRootNode, ReturnValue) == 0x000010, "Member 'GameTask_EndSubRootNode::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask.FindAllTaskNode
// 0x0010 (0x0010 - 0x0000)
struct GameTask_FindAllTaskNode final
{
public:
	TArray<class UGameTaskNode*>                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_FindAllTaskNode) == 0x000008, "Wrong alignment on GameTask_FindAllTaskNode");
static_assert(sizeof(GameTask_FindAllTaskNode) == 0x000010, "Wrong size on GameTask_FindAllTaskNode");
static_assert(offsetof(GameTask_FindAllTaskNode, ReturnValue) == 0x000000, "Member 'GameTask_FindAllTaskNode::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask.FlowIsRoot
// 0x0010 (0x0010 - 0x0000)
struct GameTask_FlowIsRoot final
{
public:
	class UGameTaskComposite_Flow*                Flow;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameTask_FlowIsRoot) == 0x000008, "Wrong alignment on GameTask_FlowIsRoot");
static_assert(sizeof(GameTask_FlowIsRoot) == 0x000010, "Wrong size on GameTask_FlowIsRoot");
static_assert(offsetof(GameTask_FlowIsRoot, Flow) == 0x000000, "Member 'GameTask_FlowIsRoot::Flow' has a wrong offset!");
static_assert(offsetof(GameTask_FlowIsRoot, ReturnValue) == 0x000008, "Member 'GameTask_FlowIsRoot::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask.FlowIsRootOrSubRoot
// 0x0010 (0x0010 - 0x0000)
struct GameTask_FlowIsRootOrSubRoot final
{
public:
	class UGameTaskComposite_Flow*                Flow;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameTask_FlowIsRootOrSubRoot) == 0x000008, "Wrong alignment on GameTask_FlowIsRootOrSubRoot");
static_assert(sizeof(GameTask_FlowIsRootOrSubRoot) == 0x000010, "Wrong size on GameTask_FlowIsRootOrSubRoot");
static_assert(offsetof(GameTask_FlowIsRootOrSubRoot, Flow) == 0x000000, "Member 'GameTask_FlowIsRootOrSubRoot::Flow' has a wrong offset!");
static_assert(offsetof(GameTask_FlowIsRootOrSubRoot, ReturnValue) == 0x000008, "Member 'GameTask_FlowIsRootOrSubRoot::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask.FlowIsSubRoot
// 0x0010 (0x0010 - 0x0000)
struct GameTask_FlowIsSubRoot final
{
public:
	class UGameTaskComposite_Flow*                Flow;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameTask_FlowIsSubRoot) == 0x000008, "Wrong alignment on GameTask_FlowIsSubRoot");
static_assert(sizeof(GameTask_FlowIsSubRoot) == 0x000010, "Wrong size on GameTask_FlowIsSubRoot");
static_assert(offsetof(GameTask_FlowIsSubRoot, Flow) == 0x000000, "Member 'GameTask_FlowIsSubRoot::Flow' has a wrong offset!");
static_assert(offsetof(GameTask_FlowIsSubRoot, ReturnValue) == 0x000008, "Member 'GameTask_FlowIsSubRoot::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask.ForceFinishSubRootNode
// 0x0018 (0x0018 - 0x0000)
struct GameTask_ForceFinishSubRootNode final
{
public:
	class FString                                 SubRootNodeName;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameTask_ForceFinishSubRootNode) == 0x000008, "Wrong alignment on GameTask_ForceFinishSubRootNode");
static_assert(sizeof(GameTask_ForceFinishSubRootNode) == 0x000018, "Wrong size on GameTask_ForceFinishSubRootNode");
static_assert(offsetof(GameTask_ForceFinishSubRootNode, SubRootNodeName) == 0x000000, "Member 'GameTask_ForceFinishSubRootNode::SubRootNodeName' has a wrong offset!");
static_assert(offsetof(GameTask_ForceFinishSubRootNode, ReturnValue) == 0x000010, "Member 'GameTask_ForceFinishSubRootNode::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask.GameTaskEventDeferFinish
// 0x0008 (0x0008 - 0x0000)
struct GameTask_GameTaskEventDeferFinish final
{
public:
	class UGameTaskEvent*                         InGameTaskEvent;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_GameTaskEventDeferFinish) == 0x000008, "Wrong alignment on GameTask_GameTaskEventDeferFinish");
static_assert(sizeof(GameTask_GameTaskEventDeferFinish) == 0x000008, "Wrong size on GameTask_GameTaskEventDeferFinish");
static_assert(offsetof(GameTask_GameTaskEventDeferFinish, InGameTaskEvent) == 0x000000, "Member 'GameTask_GameTaskEventDeferFinish::InGameTaskEvent' has a wrong offset!");

// Function GameTask.GameTask.GameTaskExecuteChange
// 0x0008 (0x0008 - 0x0000)
struct GameTask_GameTaskExecuteChange final
{
public:
	class UGameTask_Execute*                      InGameTaskExecuteNode;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_GameTaskExecuteChange) == 0x000008, "Wrong alignment on GameTask_GameTaskExecuteChange");
static_assert(sizeof(GameTask_GameTaskExecuteChange) == 0x000008, "Wrong size on GameTask_GameTaskExecuteChange");
static_assert(offsetof(GameTask_GameTaskExecuteChange, InGameTaskExecuteNode) == 0x000000, "Member 'GameTask_GameTaskExecuteChange::InGameTaskExecuteNode' has a wrong offset!");

// Function GameTask.GameTask.GameTaskFlowChange
// 0x0008 (0x0008 - 0x0000)
struct GameTask_GameTaskFlowChange final
{
public:
	class UGameTaskComposite_Flow*                InGameTaskFlowNode;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_GameTaskFlowChange) == 0x000008, "Wrong alignment on GameTask_GameTaskFlowChange");
static_assert(sizeof(GameTask_GameTaskFlowChange) == 0x000008, "Wrong size on GameTask_GameTaskFlowChange");
static_assert(offsetof(GameTask_GameTaskFlowChange, InGameTaskFlowNode) == 0x000000, "Member 'GameTask_GameTaskFlowChange::InGameTaskFlowNode' has a wrong offset!");

// Function GameTask.GameTask.GameTaskNodeStateChange
// 0x0010 (0x0010 - 0x0000)
struct GameTask_GameTaskNodeStateChange final
{
public:
	class UGameTaskNode*                          InGameTaskNode;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENodeState                                    InNodeState;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameTask_GameTaskNodeStateChange) == 0x000008, "Wrong alignment on GameTask_GameTaskNodeStateChange");
static_assert(sizeof(GameTask_GameTaskNodeStateChange) == 0x000010, "Wrong size on GameTask_GameTaskNodeStateChange");
static_assert(offsetof(GameTask_GameTaskNodeStateChange, InGameTaskNode) == 0x000000, "Member 'GameTask_GameTaskNodeStateChange::InGameTaskNode' has a wrong offset!");
static_assert(offsetof(GameTask_GameTaskNodeStateChange, InNodeState) == 0x000008, "Member 'GameTask_GameTaskNodeStateChange::InNodeState' has a wrong offset!");

// Function GameTask.GameTask.GameTaskSuddenChange
// 0x0008 (0x0008 - 0x0000)
struct GameTask_GameTaskSuddenChange final
{
public:
	class UGameTask_Execute*                      InGameTaskExecuteNode;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_GameTaskSuddenChange) == 0x000008, "Wrong alignment on GameTask_GameTaskSuddenChange");
static_assert(sizeof(GameTask_GameTaskSuddenChange) == 0x000008, "Wrong size on GameTask_GameTaskSuddenChange");
static_assert(offsetof(GameTask_GameTaskSuddenChange, InGameTaskExecuteNode) == 0x000000, "Member 'GameTask_GameTaskSuddenChange::InGameTaskExecuteNode' has a wrong offset!");

// Function GameTask.GameTask.GetAllChildrenNodes
// 0x0018 (0x0018 - 0x0000)
struct GameTask_GetAllChildrenNodes final
{
public:
	class UGameTaskComposite_Flow*                FlowRootNode;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UGameTaskNode*>                  ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_GetAllChildrenNodes) == 0x000008, "Wrong alignment on GameTask_GetAllChildrenNodes");
static_assert(sizeof(GameTask_GetAllChildrenNodes) == 0x000018, "Wrong size on GameTask_GetAllChildrenNodes");
static_assert(offsetof(GameTask_GetAllChildrenNodes, FlowRootNode) == 0x000000, "Member 'GameTask_GetAllChildrenNodes::FlowRootNode' has a wrong offset!");
static_assert(offsetof(GameTask_GetAllChildrenNodes, ReturnValue) == 0x000008, "Member 'GameTask_GetAllChildrenNodes::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask.GetAllExecuteNodes
// 0x0010 (0x0010 - 0x0000)
struct GameTask_GetAllExecuteNodes final
{
public:
	TArray<class UGameTask_Execute*>              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_GetAllExecuteNodes) == 0x000008, "Wrong alignment on GameTask_GetAllExecuteNodes");
static_assert(sizeof(GameTask_GetAllExecuteNodes) == 0x000010, "Wrong size on GameTask_GetAllExecuteNodes");
static_assert(offsetof(GameTask_GetAllExecuteNodes, ReturnValue) == 0x000000, "Member 'GameTask_GetAllExecuteNodes::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask.GetAllInProgressExecuteNodes
// 0x0010 (0x0010 - 0x0000)
struct GameTask_GetAllInProgressExecuteNodes final
{
public:
	TArray<class UGameTask_Execute*>              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_GetAllInProgressExecuteNodes) == 0x000008, "Wrong alignment on GameTask_GetAllInProgressExecuteNodes");
static_assert(sizeof(GameTask_GetAllInProgressExecuteNodes) == 0x000010, "Wrong size on GameTask_GetAllInProgressExecuteNodes");
static_assert(offsetof(GameTask_GetAllInProgressExecuteNodes, ReturnValue) == 0x000000, "Member 'GameTask_GetAllInProgressExecuteNodes::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask.GetAllTaskNodes
// 0x0018 (0x0018 - 0x0000)
struct GameTask_GetAllTaskNodes final
{
public:
	bool                                          bContainEvents;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGameTaskNode*>                  ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_GetAllTaskNodes) == 0x000008, "Wrong alignment on GameTask_GetAllTaskNodes");
static_assert(sizeof(GameTask_GetAllTaskNodes) == 0x000018, "Wrong size on GameTask_GetAllTaskNodes");
static_assert(offsetof(GameTask_GetAllTaskNodes, bContainEvents) == 0x000000, "Member 'GameTask_GetAllTaskNodes::bContainEvents' has a wrong offset!");
static_assert(offsetof(GameTask_GetAllTaskNodes, ReturnValue) == 0x000008, "Member 'GameTask_GetAllTaskNodes::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask.GetCurrentExecuteNode
// 0x0010 (0x0010 - 0x0000)
struct GameTask_GetCurrentExecuteNode final
{
public:
	TArray<class UGameTask_Execute*>              OutNodes;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_GetCurrentExecuteNode) == 0x000008, "Wrong alignment on GameTask_GetCurrentExecuteNode");
static_assert(sizeof(GameTask_GetCurrentExecuteNode) == 0x000010, "Wrong size on GameTask_GetCurrentExecuteNode");
static_assert(offsetof(GameTask_GetCurrentExecuteNode, OutNodes) == 0x000000, "Member 'GameTask_GetCurrentExecuteNode::OutNodes' has a wrong offset!");

// Function GameTask.GameTask.GetTaskNode
// 0x0010 (0x0010 - 0x0000)
struct GameTask_GetTaskNode final
{
public:
	int32                                         InnerID;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameTaskNode*                          ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_GetTaskNode) == 0x000008, "Wrong alignment on GameTask_GetTaskNode");
static_assert(sizeof(GameTask_GetTaskNode) == 0x000010, "Wrong size on GameTask_GetTaskNode");
static_assert(offsetof(GameTask_GetTaskNode, InnerID) == 0x000000, "Member 'GameTask_GetTaskNode::InnerID' has a wrong offset!");
static_assert(offsetof(GameTask_GetTaskNode, ReturnValue) == 0x000008, "Member 'GameTask_GetTaskNode::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask.GetTaskTag
// 0x0008 (0x0008 - 0x0000)
struct GameTask_GetTaskTag final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_GetTaskTag) == 0x000004, "Wrong alignment on GameTask_GetTaskTag");
static_assert(sizeof(GameTask_GetTaskTag) == 0x000008, "Wrong size on GameTask_GetTaskTag");
static_assert(offsetof(GameTask_GetTaskTag, ReturnValue) == 0x000000, "Member 'GameTask_GetTaskTag::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask.Init
// 0x0010 (0x0010 - 0x0000)
struct GameTask_Init final
{
public:
	class AGameTaskActor*                         InOwner;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Restore;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameTask_Init) == 0x000008, "Wrong alignment on GameTask_Init");
static_assert(sizeof(GameTask_Init) == 0x000010, "Wrong size on GameTask_Init");
static_assert(offsetof(GameTask_Init, InOwner) == 0x000000, "Member 'GameTask_Init::InOwner' has a wrong offset!");
static_assert(offsetof(GameTask_Init, Restore) == 0x000008, "Member 'GameTask_Init::Restore' has a wrong offset!");

// Function GameTask.GameTask.InitNodeInnerID
// 0x0001 (0x0001 - 0x0000)
struct GameTask_InitNodeInnerID final
{
public:
	bool                                          Restore;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_InitNodeInnerID) == 0x000001, "Wrong alignment on GameTask_InitNodeInnerID");
static_assert(sizeof(GameTask_InitNodeInnerID) == 0x000001, "Wrong size on GameTask_InitNodeInnerID");
static_assert(offsetof(GameTask_InitNodeInnerID, Restore) == 0x000000, "Member 'GameTask_InitNodeInnerID::Restore' has a wrong offset!");

// Function GameTask.GameTask.IsInitialized
// 0x0001 (0x0001 - 0x0000)
struct GameTask_IsInitialized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_IsInitialized) == 0x000001, "Wrong alignment on GameTask_IsInitialized");
static_assert(sizeof(GameTask_IsInitialized) == 0x000001, "Wrong size on GameTask_IsInitialized");
static_assert(offsetof(GameTask_IsInitialized, ReturnValue) == 0x000000, "Member 'GameTask_IsInitialized::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask.Start
// 0x0010 (0x0010 - 0x0000)
struct GameTask_Start final
{
public:
	class AGameTaskActor*                         InOwner;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDontSetTime;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameTask_Start) == 0x000008, "Wrong alignment on GameTask_Start");
static_assert(sizeof(GameTask_Start) == 0x000010, "Wrong size on GameTask_Start");
static_assert(offsetof(GameTask_Start, InOwner) == 0x000000, "Member 'GameTask_Start::InOwner' has a wrong offset!");
static_assert(offsetof(GameTask_Start, bDontSetTime) == 0x000008, "Member 'GameTask_Start::bDontSetTime' has a wrong offset!");

// Function GameTask.GameTask.StartSubRootNode
// 0x0018 (0x0018 - 0x0000)
struct GameTask_StartSubRootNode final
{
public:
	class FString                                 SubRootNodeName;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InLoop;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameTask_StartSubRootNode) == 0x000008, "Wrong alignment on GameTask_StartSubRootNode");
static_assert(sizeof(GameTask_StartSubRootNode) == 0x000018, "Wrong size on GameTask_StartSubRootNode");
static_assert(offsetof(GameTask_StartSubRootNode, SubRootNodeName) == 0x000000, "Member 'GameTask_StartSubRootNode::SubRootNodeName' has a wrong offset!");
static_assert(offsetof(GameTask_StartSubRootNode, InLoop) == 0x000010, "Member 'GameTask_StartSubRootNode::InLoop' has a wrong offset!");
static_assert(offsetof(GameTask_StartSubRootNode, ReturnValue) == 0x000014, "Member 'GameTask_StartSubRootNode::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask.GetCurrentFlowNode
// 0x0008 (0x0008 - 0x0000)
struct GameTask_GetCurrentFlowNode final
{
public:
	class UGameTaskComposite_Flow*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_GetCurrentFlowNode) == 0x000008, "Wrong alignment on GameTask_GetCurrentFlowNode");
static_assert(sizeof(GameTask_GetCurrentFlowNode) == 0x000008, "Wrong size on GameTask_GetCurrentFlowNode");
static_assert(offsetof(GameTask_GetCurrentFlowNode, ReturnValue) == 0x000000, "Member 'GameTask_GetCurrentFlowNode::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask.GetTaskActor
// 0x0008 (0x0008 - 0x0000)
struct GameTask_GetTaskActor final
{
public:
	class AGameTaskActor*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_GetTaskActor) == 0x000008, "Wrong alignment on GameTask_GetTaskActor");
static_assert(sizeof(GameTask_GetTaskActor) == 0x000008, "Wrong size on GameTask_GetTaskActor");
static_assert(offsetof(GameTask_GetTaskActor, ReturnValue) == 0x000000, "Member 'GameTask_GetTaskActor::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask.GetWorld
// 0x0008 (0x0008 - 0x0000)
struct GameTask_GetWorld final
{
public:
	class UWorld*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_GetWorld) == 0x000008, "Wrong alignment on GameTask_GetWorld");
static_assert(sizeof(GameTask_GetWorld) == 0x000008, "Wrong size on GameTask_GetWorld");
static_assert(offsetof(GameTask_GetWorld, ReturnValue) == 0x000000, "Member 'GameTask_GetWorld::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask.InEnd
// 0x0001 (0x0001 - 0x0000)
struct GameTask_InEnd final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_InEnd) == 0x000001, "Wrong alignment on GameTask_InEnd");
static_assert(sizeof(GameTask_InEnd) == 0x000001, "Wrong size on GameTask_InEnd");
static_assert(offsetof(GameTask_InEnd, ReturnValue) == 0x000000, "Member 'GameTask_InEnd::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask.IsActive
// 0x0001 (0x0001 - 0x0000)
struct GameTask_IsActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_IsActive) == 0x000001, "Wrong alignment on GameTask_IsActive");
static_assert(sizeof(GameTask_IsActive) == 0x000001, "Wrong size on GameTask_IsActive");
static_assert(offsetof(GameTask_IsActive, ReturnValue) == 0x000000, "Member 'GameTask_IsActive::ReturnValue' has a wrong offset!");

// Function GameTask.GameTaskNode.GetAllRecursiveChildren
// 0x0010 (0x0010 - 0x0000)
struct GameTaskNode_GetAllRecursiveChildren final
{
public:
	TArray<class UGameTaskNode*>                  InArray;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTaskNode_GetAllRecursiveChildren) == 0x000008, "Wrong alignment on GameTaskNode_GetAllRecursiveChildren");
static_assert(sizeof(GameTaskNode_GetAllRecursiveChildren) == 0x000010, "Wrong size on GameTaskNode_GetAllRecursiveChildren");
static_assert(offsetof(GameTaskNode_GetAllRecursiveChildren, InArray) == 0x000000, "Member 'GameTaskNode_GetAllRecursiveChildren::InArray' has a wrong offset!");

// Function GameTask.GameTaskNode.GetExecutionIndex
// 0x0004 (0x0004 - 0x0000)
struct GameTaskNode_GetExecutionIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTaskNode_GetExecutionIndex) == 0x000004, "Wrong alignment on GameTaskNode_GetExecutionIndex");
static_assert(sizeof(GameTaskNode_GetExecutionIndex) == 0x000004, "Wrong size on GameTaskNode_GetExecutionIndex");
static_assert(offsetof(GameTaskNode_GetExecutionIndex, ReturnValue) == 0x000000, "Member 'GameTaskNode_GetExecutionIndex::ReturnValue' has a wrong offset!");

// Function GameTask.GameTaskNode.GetRootFlowNode
// 0x0008 (0x0008 - 0x0000)
struct GameTaskNode_GetRootFlowNode final
{
public:
	class UGameTaskComposite_Flow*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTaskNode_GetRootFlowNode) == 0x000008, "Wrong alignment on GameTaskNode_GetRootFlowNode");
static_assert(sizeof(GameTaskNode_GetRootFlowNode) == 0x000008, "Wrong size on GameTaskNode_GetRootFlowNode");
static_assert(offsetof(GameTaskNode_GetRootFlowNode, ReturnValue) == 0x000000, "Member 'GameTaskNode_GetRootFlowNode::ReturnValue' has a wrong offset!");

// Function GameTask.GameTaskNode.GetUIDescription
// 0x0010 (0x0010 - 0x0000)
struct GameTaskNode_GetUIDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTaskNode_GetUIDescription) == 0x000008, "Wrong alignment on GameTaskNode_GetUIDescription");
static_assert(sizeof(GameTaskNode_GetUIDescription) == 0x000010, "Wrong size on GameTaskNode_GetUIDescription");
static_assert(offsetof(GameTaskNode_GetUIDescription, ReturnValue) == 0x000000, "Member 'GameTaskNode_GetUIDescription::ReturnValue' has a wrong offset!");

// Function GameTask.GameTaskNode.HasPreCondition
// 0x0001 (0x0001 - 0x0000)
struct GameTaskNode_HasPreCondition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTaskNode_HasPreCondition) == 0x000001, "Wrong alignment on GameTaskNode_HasPreCondition");
static_assert(sizeof(GameTaskNode_HasPreCondition) == 0x000001, "Wrong size on GameTaskNode_HasPreCondition");
static_assert(offsetof(GameTaskNode_HasPreCondition, ReturnValue) == 0x000000, "Member 'GameTaskNode_HasPreCondition::ReturnValue' has a wrong offset!");

// Function GameTask.GameTaskNode.IsPreConditionTrigger
// 0x0001 (0x0001 - 0x0000)
struct GameTaskNode_IsPreConditionTrigger final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTaskNode_IsPreConditionTrigger) == 0x000001, "Wrong alignment on GameTaskNode_IsPreConditionTrigger");
static_assert(sizeof(GameTaskNode_IsPreConditionTrigger) == 0x000001, "Wrong size on GameTaskNode_IsPreConditionTrigger");
static_assert(offsetof(GameTaskNode_IsPreConditionTrigger, ReturnValue) == 0x000000, "Member 'GameTaskNode_IsPreConditionTrigger::ReturnValue' has a wrong offset!");

// Function GameTask.GameTaskNode.NeedIgnored
// 0x0001 (0x0001 - 0x0000)
struct GameTaskNode_NeedIgnored final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTaskNode_NeedIgnored) == 0x000001, "Wrong alignment on GameTaskNode_NeedIgnored");
static_assert(sizeof(GameTaskNode_NeedIgnored) == 0x000001, "Wrong size on GameTaskNode_NeedIgnored");
static_assert(offsetof(GameTaskNode_NeedIgnored, ReturnValue) == 0x000000, "Member 'GameTaskNode_NeedIgnored::ReturnValue' has a wrong offset!");

// Function GameTask.GameTaskNode.OnUpdate_Client
// 0x0014 (0x0014 - 0x0000)
struct GameTaskNode_OnUpdate_Client final
{
public:
	int32                                         Param1;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param2;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param3;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param4;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param5;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTaskNode_OnUpdate_Client) == 0x000004, "Wrong alignment on GameTaskNode_OnUpdate_Client");
static_assert(sizeof(GameTaskNode_OnUpdate_Client) == 0x000014, "Wrong size on GameTaskNode_OnUpdate_Client");
static_assert(offsetof(GameTaskNode_OnUpdate_Client, Param1) == 0x000000, "Member 'GameTaskNode_OnUpdate_Client::Param1' has a wrong offset!");
static_assert(offsetof(GameTaskNode_OnUpdate_Client, Param2) == 0x000004, "Member 'GameTaskNode_OnUpdate_Client::Param2' has a wrong offset!");
static_assert(offsetof(GameTaskNode_OnUpdate_Client, Param3) == 0x000008, "Member 'GameTaskNode_OnUpdate_Client::Param3' has a wrong offset!");
static_assert(offsetof(GameTaskNode_OnUpdate_Client, Param4) == 0x00000C, "Member 'GameTaskNode_OnUpdate_Client::Param4' has a wrong offset!");
static_assert(offsetof(GameTaskNode_OnUpdate_Client, Param5) == 0x000010, "Member 'GameTaskNode_OnUpdate_Client::Param5' has a wrong offset!");

// Function GameTask.GameTaskNode.TipToClient
// 0x0018 (0x0018 - 0x0000)
struct GameTaskNode_TipToClient final
{
public:
	class FString                                 InKey;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InType;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameTaskNode_TipToClient) == 0x000008, "Wrong alignment on GameTaskNode_TipToClient");
static_assert(sizeof(GameTaskNode_TipToClient) == 0x000018, "Wrong size on GameTaskNode_TipToClient");
static_assert(offsetof(GameTaskNode_TipToClient, InKey) == 0x000000, "Member 'GameTaskNode_TipToClient::InKey' has a wrong offset!");
static_assert(offsetof(GameTaskNode_TipToClient, InType) == 0x000010, "Member 'GameTaskNode_TipToClient::InType' has a wrong offset!");

// Function GameTask.GameTaskNode.UpdateDataToClient
// 0x0014 (0x0014 - 0x0000)
struct GameTaskNode_UpdateDataToClient final
{
public:
	int32                                         Param1;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param2;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param3;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param4;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param5;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTaskNode_UpdateDataToClient) == 0x000004, "Wrong alignment on GameTaskNode_UpdateDataToClient");
static_assert(sizeof(GameTaskNode_UpdateDataToClient) == 0x000014, "Wrong size on GameTaskNode_UpdateDataToClient");
static_assert(offsetof(GameTaskNode_UpdateDataToClient, Param1) == 0x000000, "Member 'GameTaskNode_UpdateDataToClient::Param1' has a wrong offset!");
static_assert(offsetof(GameTaskNode_UpdateDataToClient, Param2) == 0x000004, "Member 'GameTaskNode_UpdateDataToClient::Param2' has a wrong offset!");
static_assert(offsetof(GameTaskNode_UpdateDataToClient, Param3) == 0x000008, "Member 'GameTaskNode_UpdateDataToClient::Param3' has a wrong offset!");
static_assert(offsetof(GameTaskNode_UpdateDataToClient, Param4) == 0x00000C, "Member 'GameTaskNode_UpdateDataToClient::Param4' has a wrong offset!");
static_assert(offsetof(GameTaskNode_UpdateDataToClient, Param5) == 0x000010, "Member 'GameTaskNode_UpdateDataToClient::Param5' has a wrong offset!");

// Function GameTask.GameTaskNode.GetGameTaskActor
// 0x0008 (0x0008 - 0x0000)
struct GameTaskNode_GetGameTaskActor final
{
public:
	class AGameTaskActor*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTaskNode_GetGameTaskActor) == 0x000008, "Wrong alignment on GameTaskNode_GetGameTaskActor");
static_assert(sizeof(GameTaskNode_GetGameTaskActor) == 0x000008, "Wrong size on GameTaskNode_GetGameTaskActor");
static_assert(offsetof(GameTaskNode_GetGameTaskActor, ReturnValue) == 0x000000, "Member 'GameTaskNode_GetGameTaskActor::ReturnValue' has a wrong offset!");

// Function GameTask.GameTaskNode.GetGameTaskAsset
// 0x0008 (0x0008 - 0x0000)
struct GameTaskNode_GetGameTaskAsset final
{
public:
	class UGameTask*                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTaskNode_GetGameTaskAsset) == 0x000008, "Wrong alignment on GameTaskNode_GetGameTaskAsset");
static_assert(sizeof(GameTaskNode_GetGameTaskAsset) == 0x000008, "Wrong size on GameTaskNode_GetGameTaskAsset");
static_assert(offsetof(GameTaskNode_GetGameTaskAsset, ReturnValue) == 0x000000, "Member 'GameTaskNode_GetGameTaskAsset::ReturnValue' has a wrong offset!");

// Function GameTask.GameTaskNode.GetLevelType
// 0x0001 (0x0001 - 0x0000)
struct GameTaskNode_GetLevelType final
{
public:
	ELevelType                                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTaskNode_GetLevelType) == 0x000001, "Wrong alignment on GameTaskNode_GetLevelType");
static_assert(sizeof(GameTaskNode_GetLevelType) == 0x000001, "Wrong size on GameTaskNode_GetLevelType");
static_assert(offsetof(GameTaskNode_GetLevelType, ReturnValue) == 0x000000, "Member 'GameTaskNode_GetLevelType::ReturnValue' has a wrong offset!");

// Function GameTask.GameTaskNode.GetNodeState
// 0x0001 (0x0001 - 0x0000)
struct GameTaskNode_GetNodeState final
{
public:
	ENodeState                                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTaskNode_GetNodeState) == 0x000001, "Wrong alignment on GameTaskNode_GetNodeState");
static_assert(sizeof(GameTaskNode_GetNodeState) == 0x000001, "Wrong size on GameTaskNode_GetNodeState");
static_assert(offsetof(GameTaskNode_GetNodeState, ReturnValue) == 0x000000, "Member 'GameTaskNode_GetNodeState::ReturnValue' has a wrong offset!");

// Function GameTask.GameTaskNode.GetSpecialStaticDescription
// 0x0010 (0x0010 - 0x0000)
struct GameTaskNode_GetSpecialStaticDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTaskNode_GetSpecialStaticDescription) == 0x000008, "Wrong alignment on GameTaskNode_GetSpecialStaticDescription");
static_assert(sizeof(GameTaskNode_GetSpecialStaticDescription) == 0x000010, "Wrong size on GameTaskNode_GetSpecialStaticDescription");
static_assert(offsetof(GameTaskNode_GetSpecialStaticDescription, ReturnValue) == 0x000000, "Member 'GameTaskNode_GetSpecialStaticDescription::ReturnValue' has a wrong offset!");

// Function GameTask.GameTaskNode.GetStaticDescription
// 0x0010 (0x0010 - 0x0000)
struct GameTaskNode_GetStaticDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTaskNode_GetStaticDescription) == 0x000008, "Wrong alignment on GameTaskNode_GetStaticDescription");
static_assert(sizeof(GameTaskNode_GetStaticDescription) == 0x000010, "Wrong size on GameTaskNode_GetStaticDescription");
static_assert(offsetof(GameTaskNode_GetStaticDescription, ReturnValue) == 0x000000, "Member 'GameTaskNode_GetStaticDescription::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask_Execute.GetCountDown
// 0x0004 (0x0004 - 0x0000)
struct GameTask_Execute_GetCountDown final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_Execute_GetCountDown) == 0x000004, "Wrong alignment on GameTask_Execute_GetCountDown");
static_assert(sizeof(GameTask_Execute_GetCountDown) == 0x000004, "Wrong size on GameTask_Execute_GetCountDown");
static_assert(offsetof(GameTask_Execute_GetCountDown, ReturnValue) == 0x000000, "Member 'GameTask_Execute_GetCountDown::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask_Execute.GetDescription
// 0x0010 (0x0010 - 0x0000)
struct GameTask_Execute_GetDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_Execute_GetDescription) == 0x000008, "Wrong alignment on GameTask_Execute_GetDescription");
static_assert(sizeof(GameTask_Execute_GetDescription) == 0x000010, "Wrong size on GameTask_Execute_GetDescription");
static_assert(offsetof(GameTask_Execute_GetDescription, ReturnValue) == 0x000000, "Member 'GameTask_Execute_GetDescription::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask_Execute.GetExecuteDescription
// 0x0018 (0x0018 - 0x0000)
struct GameTask_Execute_GetExecuteDescription final
{
public:
	bool                                          bIgnoreRichText;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_Execute_GetExecuteDescription) == 0x000008, "Wrong alignment on GameTask_Execute_GetExecuteDescription");
static_assert(sizeof(GameTask_Execute_GetExecuteDescription) == 0x000018, "Wrong size on GameTask_Execute_GetExecuteDescription");
static_assert(offsetof(GameTask_Execute_GetExecuteDescription, bIgnoreRichText) == 0x000000, "Member 'GameTask_Execute_GetExecuteDescription::bIgnoreRichText' has a wrong offset!");
static_assert(offsetof(GameTask_Execute_GetExecuteDescription, ReturnValue) == 0x000008, "Member 'GameTask_Execute_GetExecuteDescription::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask_Execute.GetFormatTitle
// 0x0010 (0x0010 - 0x0000)
struct GameTask_Execute_GetFormatTitle final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_Execute_GetFormatTitle) == 0x000008, "Wrong alignment on GameTask_Execute_GetFormatTitle");
static_assert(sizeof(GameTask_Execute_GetFormatTitle) == 0x000010, "Wrong size on GameTask_Execute_GetFormatTitle");
static_assert(offsetof(GameTask_Execute_GetFormatTitle, ReturnValue) == 0x000000, "Member 'GameTask_Execute_GetFormatTitle::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask_Execute.GetTitleDescription
// 0x0010 (0x0010 - 0x0000)
struct GameTask_Execute_GetTitleDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_Execute_GetTitleDescription) == 0x000008, "Wrong alignment on GameTask_Execute_GetTitleDescription");
static_assert(sizeof(GameTask_Execute_GetTitleDescription) == 0x000010, "Wrong size on GameTask_Execute_GetTitleDescription");
static_assert(offsetof(GameTask_Execute_GetTitleDescription, ReturnValue) == 0x000000, "Member 'GameTask_Execute_GetTitleDescription::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask_Execute.IsClient
// 0x0001 (0x0001 - 0x0000)
struct GameTask_Execute_IsClient final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_Execute_IsClient) == 0x000001, "Wrong alignment on GameTask_Execute_IsClient");
static_assert(sizeof(GameTask_Execute_IsClient) == 0x000001, "Wrong size on GameTask_Execute_IsClient");
static_assert(offsetof(GameTask_Execute_IsClient, ReturnValue) == 0x000000, "Member 'GameTask_Execute_IsClient::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask_Execute.IsPauseExecute
// 0x0001 (0x0001 - 0x0000)
struct GameTask_Execute_IsPauseExecute final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_Execute_IsPauseExecute) == 0x000001, "Wrong alignment on GameTask_Execute_IsPauseExecute");
static_assert(sizeof(GameTask_Execute_IsPauseExecute) == 0x000001, "Wrong size on GameTask_Execute_IsPauseExecute");
static_assert(offsetof(GameTask_Execute_IsPauseExecute, ReturnValue) == 0x000000, "Member 'GameTask_Execute_IsPauseExecute::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask_Execute.IsServer
// 0x0001 (0x0001 - 0x0000)
struct GameTask_Execute_IsServer final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_Execute_IsServer) == 0x000001, "Wrong alignment on GameTask_Execute_IsServer");
static_assert(sizeof(GameTask_Execute_IsServer) == 0x000001, "Wrong size on GameTask_Execute_IsServer");
static_assert(offsetof(GameTask_Execute_IsServer, ReturnValue) == 0x000000, "Member 'GameTask_Execute_IsServer::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask_Execute.IsTaskFinishExecute
// 0x0001 (0x0001 - 0x0000)
struct GameTask_Execute_IsTaskFinishExecute final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_Execute_IsTaskFinishExecute) == 0x000001, "Wrong alignment on GameTask_Execute_IsTaskFinishExecute");
static_assert(sizeof(GameTask_Execute_IsTaskFinishExecute) == 0x000001, "Wrong size on GameTask_Execute_IsTaskFinishExecute");
static_assert(offsetof(GameTask_Execute_IsTaskFinishExecute, ReturnValue) == 0x000000, "Member 'GameTask_Execute_IsTaskFinishExecute::ReturnValue' has a wrong offset!");

// Function GameTask.GameTask_Execute.OnTick
// 0x0004 (0x0004 - 0x0000)
struct GameTask_Execute_OnTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_Execute_OnTick) == 0x000004, "Wrong alignment on GameTask_Execute_OnTick");
static_assert(sizeof(GameTask_Execute_OnTick) == 0x000004, "Wrong size on GameTask_Execute_OnTick");
static_assert(offsetof(GameTask_Execute_OnTick, DeltaTime) == 0x000000, "Member 'GameTask_Execute_OnTick::DeltaTime' has a wrong offset!");

// Function GameTask.GameTask_Execute.SetCountDown
// 0x0004 (0x0004 - 0x0000)
struct GameTask_Execute_SetCountDown final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_Execute_SetCountDown) == 0x000004, "Wrong alignment on GameTask_Execute_SetCountDown");
static_assert(sizeof(GameTask_Execute_SetCountDown) == 0x000004, "Wrong size on GameTask_Execute_SetCountDown");
static_assert(offsetof(GameTask_Execute_SetCountDown, Count) == 0x000000, "Member 'GameTask_Execute_SetCountDown::Count' has a wrong offset!");

// Function GameTask.GameTask_Execute.SetExecuteDescription
// 0x0001 (0x0001 - 0x0000)
struct GameTask_Execute_SetExecuteDescription final
{
public:
	bool                                          NotAppend;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTask_Execute_SetExecuteDescription) == 0x000001, "Wrong alignment on GameTask_Execute_SetExecuteDescription");
static_assert(sizeof(GameTask_Execute_SetExecuteDescription) == 0x000001, "Wrong size on GameTask_Execute_SetExecuteDescription");
static_assert(offsetof(GameTask_Execute_SetExecuteDescription, NotAppend) == 0x000000, "Member 'GameTask_Execute_SetExecuteDescription::NotAppend' has a wrong offset!");

// Function GameTask.GameTaskActor.GetGameTaskActor
// 0x0010 (0x0010 - 0x0000)
struct GameTaskActor_GetGameTaskActor final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGameTaskActor*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameTaskActor_GetGameTaskActor) == 0x000008, "Wrong alignment on GameTaskActor_GetGameTaskActor");
static_assert(sizeof(GameTaskActor_GetGameTaskActor) == 0x000010, "Wrong size on GameTaskActor_GetGameTaskActor");
static_assert(offsetof(GameTaskActor_GetGameTaskActor, WorldContext) == 0x000000, "Member 'GameTaskActor_GetGameTaskActor::WorldContext' has a wrong offset!");
static_assert(offsetof(GameTaskActor_GetGameTaskActor, ReturnValue) == 0x000008, "Member 'GameTaskActor_GetGameTaskActor::ReturnValue' has a wrong offset!");

// Function GameTask.GameTaskActor.ApplyMoveCamera
// 0x0020 (0x0020 - 0x0000)
struct GameTaskActor_ApplyMoveCamera final
{
public:
