#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameTask

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum GameTask.ELevelFailedReason
// NumValues: 0x0006
enum class ELevelFailedReason : uint8
{
	Dead                                     = 0,
	OverTime                                 = 1,
	ManualExit                               = 2,
	OffLine                                  = 3,
	Success                                  = 4,
	ELevelFailedReason_MAX                   = 5,
};

// Enum GameTask.ELevelFinishResult
// NumValues: 0x0003
enum class ELevelFinishResult : uint8
{
	Failed                                   = 0,
	Success                                  = 1,
	MAX                                      = 2,
};

// Enum GameTask.EBoxType
// NumValues: 0x0004
enum class EBoxType : uint8
{
	Active                                   = 0,
	Entry                                    = 1,
	Exit                                     = 2,
	Max                                      = 3,
};

// Enum GameTask.EMonsterResetType
// NumValues: 0x0003
enum class EMonsterResetType : uint8
{
	FarFromSpawnPoint                        = 0,
	FarFromPlayer                            = 1,
	EMonsterResetType_MAX                    = 2,
};

// Enum GameTask.EMonsterResetLocationType
// NumValues: 0x0003
enum class EMonsterResetLocationType : uint8
{
	AtSpawnPoint                             = 0,
	AroundPlayer                             = 1,
	EMonsterResetLocationType_MAX            = 2,
};

// Enum GameTask.EExecuteUIAnimType
// NumValues: 0x0004
enum class EExecuteUIAnimType : uint8
{
	Disable                                  = 0,
	Little                                   = 1,
	Big                                      = 2,
	EExecuteUIAnimType_MAX                   = 3,
};

// Enum GameTask.ESubGameTaskType
// NumValues: 0x0004
enum class ESubGameTaskType : uint8
{
	Normal                                   = 0,
	GirlRush                                 = 1,
	LevelType_MAX                            = 2,
	ESubGameTaskType_MAX                     = 3,
};

// Enum GameTask.ELevelType
// NumValues: 0x0024
enum class ELevelType : uint8
{
	Normal                                   = 0,
	Daily                                    = 1,
	Tower                                    = 2,
	Fragments                                = 3,
	BossChallenge                            = 4,
	Multi                                    = 5,
	OpenWorld                                = 6,
	Defend                                   = 7,
	Chess                                    = 8,
	DLC1                                     = 9,
	DLC1_ROGUE                               = 10,
	Multi_Defend                             = 11,
	Multi_Defend_Easy                        = 12,
	Multi_CoopBoss                           = 13,
	Rogue                                    = 14,
	Multi_TD_Base                            = 15,
	Multi_TD_Base_Hard                       = 16,
	Pal                                      = 17,
	PalChapter                               = 18,
	Multi_NightMare                          = 19,
	ForbidZone_Easy                          = 20,
	ForbidZone_Hard                          = 21,
	CoopBoss                                 = 22,
	BagRogue                                 = 23,
	MassWaves                                = 24,
	GirlRush                                 = 25,
	TowerRush_Easy                           = 26,
	TowerRush_Hard                           = 27,
	FarmWar                                  = 28,
	OnlineSea_Easy                           = 29,
	OnlineSea_Hard                           = 30,
	OnlineSea_Challenge                      = 31,
	OnlineSea_Tutorial                       = 32,
	HellDivers                               = 200,
	LevelType_MAX                            = 201,
	ELevelType_MAX                           = 202,
};

// Enum GameTask.ELevelPauseReason
// NumValues: 0x0005
enum class ELevelPauseReason : uint8
{
	None                                     = 0,
	Default                                  = 1,
	LevelTask                                = 2,
	Skill                                    = 3,
	ELevelPauseReason_MAX                    = 4,
};

// Enum GameTask.EEventNetMode
// NumValues: 0x0003
enum class EEventNetMode : uint8
{
	Client                                   = 0,
	Server                                   = 1,
	EEventNetMode_MAX                        = 2,
};

// Enum GameTask.ENodeState
// NumValues: 0x0005
enum class ENodeState : uint8
{
	Normal                                   = 0,
	InProgress                               = 1,
	Succeeded                                = 2,
	Failed                                   = 3,
	ENodeState_MAX                           = 4,
};

// Enum GameTask.EChallengeBuffType
// NumValues: 0x0004
enum class EChallengeBuffType : uint8
{
	Monster                                  = 0,
	Player                                   = 1,
	Max_Type                                 = 2,
	EChallengeBuffType_MAX                   = 3,
};

// Enum GameTask.EChallangeType
// NumValues: 0x000A
enum class EChallangeType : uint8
{
	InvalidType                              = 0,
	TimeLimited                              = 1,
	Kill1                                    = 2,
	Kill2                                    = 3,
	Blood                                    = 4,
	Death                                    = 5,
	Partial                                  = 6,
	Negative                                 = 7,
	Max_State                                = 8,
	EChallangeType_MAX                       = 9,
};

// Enum GameTask.ETaskType
// NumValues: 0x0007
enum class ETaskType : uint8
{
	InvalidType                              = 0,
	Annihilate                               = 1,
	Defend                                   = 2,
	Destory                                  = 3,
	Boss                                     = 4,
	Max_State                                = 5,
	ETaskType_MAX                            = 6,
};

// ScriptStruct GameTask.MonsterResetSpecialConfig
// 0x0010 (0x0010 - 0x0000)
struct FMonsterResetSpecialConfig final
{
public:
	EMonsterResetLocationType                     ResetLocationType;                                 // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ResetRadius;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CheckTime;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EffectId;                                          // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMonsterResetSpecialConfig) == 0x000004, "Wrong alignment on FMonsterResetSpecialConfig");
static_assert(sizeof(FMonsterResetSpecialConfig) == 0x000010, "Wrong size on FMonsterResetSpecialConfig");
static_assert(offsetof(FMonsterResetSpecialConfig, ResetLocationType) == 0x000000, "Member 'FMonsterResetSpecialConfig::ResetLocationType' has a wrong offset!");
static_assert(offsetof(FMonsterResetSpecialConfig, ResetRadius) == 0x000004, "Member 'FMonsterResetSpecialConfig::ResetRadius' has a wrong offset!");
static_assert(offsetof(FMonsterResetSpecialConfig, CheckTime) == 0x000008, "Member 'FMonsterResetSpecialConfig::CheckTime' has a wrong offset!");
static_assert(offsetof(FMonsterResetSpecialConfig, EffectId) == 0x00000C, "Member 'FMonsterResetSpecialConfig::EffectId' has a wrong offset!");

// ScriptStruct GameTask.MonsterResetConfig
// 0x002C (0x002C - 0x0000)
struct FMonsterResetConfig final
{
public:
	struct FMonsterResetSpecialConfig             MonsterResetSpecialConfig;                         // 0x0000(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	EMonsterResetType                             ResetType;                                         // 0x0010(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MinPlayerHDistance;                                // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinPlayerVDistance;                                // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinMonsterSpawnHDistance;                          // 0x001C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinMonsterSpawnVDistance;                          // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HDistanceFromNavMesh;                              // 0x0024(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VDistanceFromNavMesh;                              // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMonsterResetConfig) == 0x000004, "Wrong alignment on FMonsterResetConfig");
static_assert(sizeof(FMonsterResetConfig) == 0x00002C, "Wrong size on FMonsterResetConfig");
static_assert(offsetof(FMonsterResetConfig, MonsterResetSpecialConfig) == 0x000000, "Member 'FMonsterResetConfig::MonsterResetSpecialConfig' has a wrong offset!");
static_assert(offsetof(FMonsterResetConfig, ResetType) == 0x000010, "Member 'FMonsterResetConfig::ResetType' has a wrong offset!");
static_assert(offsetof(FMonsterResetConfig, MinPlayerHDistance) == 0x000014, "Member 'FMonsterResetConfig::MinPlayerHDistance' has a wrong offset!");
static_assert(offsetof(FMonsterResetConfig, MinPlayerVDistance) == 0x000018, "Member 'FMonsterResetConfig::MinPlayerVDistance' has a wrong offset!");
static_assert(offsetof(FMonsterResetConfig, MinMonsterSpawnHDistance) == 0x00001C, "Member 'FMonsterResetConfig::MinMonsterSpawnHDistance' has a wrong offset!");
static_assert(offsetof(FMonsterResetConfig, MinMonsterSpawnVDistance) == 0x000020, "Member 'FMonsterResetConfig::MinMonsterSpawnVDistance' has a wrong offset!");
static_assert(offsetof(FMonsterResetConfig, HDistanceFromNavMesh) == 0x000024, "Member 'FMonsterResetConfig::HDistanceFromNavMesh' has a wrong offset!");
static_assert(offsetof(FMonsterResetConfig, VDistanceFromNavMesh) == 0x000028, "Member 'FMonsterResetConfig::VDistanceFromNavMesh' has a wrong offset!");

// ScriptStruct GameTask.RepExecuteDes
// 0x0018 (0x0018 - 0x0000)
struct FRepExecuteDes final
{
public:
	int32                                         ExecuteNodeInnerID;                                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 DescArgs;                                          // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRepExecuteDes) == 0x000008, "Wrong alignment on FRepExecuteDes");
static_assert(sizeof(FRepExecuteDes) == 0x000018, "Wrong size on FRepExecuteDes");
static_assert(offsetof(FRepExecuteDes, ExecuteNodeInnerID) == 0x000000, "Member 'FRepExecuteDes::ExecuteNodeInnerID' has a wrong offset!");
static_assert(offsetof(FRepExecuteDes, DescArgs) == 0x000008, "Member 'FRepExecuteDes::DescArgs' has a wrong offset!");

// ScriptStruct GameTask.ItemDropByTag
// 0x0018 (0x0018 - 0x0000)
struct FItemDropByTag final
{
public:
	class FName                                   Tag;                                               // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DropItems;                                         // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FItemDropByTag) == 0x000008, "Wrong alignment on FItemDropByTag");
static_assert(sizeof(FItemDropByTag) == 0x000018, "Wrong size on FItemDropByTag");
static_assert(offsetof(FItemDropByTag, Tag) == 0x000000, "Member 'FItemDropByTag::Tag' has a wrong offset!");
static_assert(offsetof(FItemDropByTag, DropItems) == 0x000008, "Member 'FItemDropByTag::DropItems' has a wrong offset!");

// ScriptStruct GameTask.TriggerCondition
// 0x0018 (0x0018 - 0x0000)
struct FTriggerCondition final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ActivityLogic;                                     // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTriggerCondition) == 0x000008, "Wrong alignment on FTriggerCondition");
static_assert(sizeof(FTriggerCondition) == 0x000018, "Wrong size on FTriggerCondition");
static_assert(offsetof(FTriggerCondition, ID) == 0x000000, "Member 'FTriggerCondition::ID' has a wrong offset!");
static_assert(offsetof(FTriggerCondition, ActivityLogic) == 0x000008, "Member 'FTriggerCondition::ActivityLogic' has a wrong offset!");

// ScriptStruct GameTask.MultiSubTask
// 0x0038 (0x0040 - 0x0008)
struct FMultiSubTask final : public FTableRowBase
{
public:
	int32                                         ID;                                                // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Score;                                             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         BlockManagerNames;                                 // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           Tags;                                              // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   Desc;                                              // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMultiSubTask) == 0x000008, "Wrong alignment on FMultiSubTask");
static_assert(sizeof(FMultiSubTask) == 0x000040, "Wrong size on FMultiSubTask");
static_assert(offsetof(FMultiSubTask, ID) == 0x000008, "Member 'FMultiSubTask::ID' has a wrong offset!");
static_assert(offsetof(FMultiSubTask, Count) == 0x00000C, "Member 'FMultiSubTask::Count' has a wrong offset!");
static_assert(offsetof(FMultiSubTask, Score) == 0x000010, "Member 'FMultiSubTask::Score' has a wrong offset!");
static_assert(offsetof(FMultiSubTask, BlockManagerNames) == 0x000018, "Member 'FMultiSubTask::BlockManagerNames' has a wrong offset!");
static_assert(offsetof(FMultiSubTask, Tags) == 0x000028, "Member 'FMultiSubTask::Tags' has a wrong offset!");
static_assert(offsetof(FMultiSubTask, Desc) == 0x000038, "Member 'FMultiSubTask::Desc' has a wrong offset!");

// ScriptStruct GameTask.TriggerConditionConfig
// 0x0008 (0x0008 - 0x0000)
struct FTriggerConditionConfig final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOpenWhenLevelFinish;                              // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTemporarily;                                      // 0x0005(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTriggerConditionConfig) == 0x000004, "Wrong alignment on FTriggerConditionConfig");
static_assert(sizeof(FTriggerConditionConfig) == 0x000008, "Wrong size on FTriggerConditionConfig");
static_assert(offsetof(FTriggerConditionConfig, ID) == 0x000000, "Member 'FTriggerConditionConfig::ID' has a wrong offset!");
static_assert(offsetof(FTriggerConditionConfig, bOpenWhenLevelFinish) == 0x000004, "Member 'FTriggerConditionConfig::bOpenWhenLevelFinish' has a wrong offset!");
static_assert(offsetof(FTriggerConditionConfig, bTemporarily) == 0x000005, "Member 'FTriggerConditionConfig::bTemporarily' has a wrong offset!");

// ScriptStruct GameTask.RandomMonster
// 0x0048 (0x0050 - 0x0008)
struct FRandomMonster final : public FTableRowBase
{
public:
	int32                                         RandomMonsterId;                                   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Desc;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BufferName;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BufferDesc;                                        // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MonsterId;                                         // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KillTime;                                          // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BufferId;                                          // 0x0048(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChallengeBuffType                            BufferType;                                        // 0x004C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRandomMonster) == 0x000008, "Wrong alignment on FRandomMonster");
static_assert(sizeof(FRandomMonster) == 0x000050, "Wrong size on FRandomMonster");
static_assert(offsetof(FRandomMonster, RandomMonsterId) == 0x000008, "Member 'FRandomMonster::RandomMonsterId' has a wrong offset!");
static_assert(offsetof(FRandomMonster, Desc) == 0x000010, "Member 'FRandomMonster::Desc' has a wrong offset!");
static_assert(offsetof(FRandomMonster, BufferName) == 0x000020, "Member 'FRandomMonster::BufferName' has a wrong offset!");
static_assert(offsetof(FRandomMonster, BufferDesc) == 0x000030, "Member 'FRandomMonster::BufferDesc' has a wrong offset!");
static_assert(offsetof(FRandomMonster, MonsterId) == 0x000040, "Member 'FRandomMonster::MonsterId' has a wrong offset!");
static_assert(offsetof(FRandomMonster, KillTime) == 0x000044, "Member 'FRandomMonster::KillTime' has a wrong offset!");
static_assert(offsetof(FRandomMonster, BufferId) == 0x000048, "Member 'FRandomMonster::BufferId' has a wrong offset!");
static_assert(offsetof(FRandomMonster, BufferType) == 0x00004C, "Member 'FRandomMonster::BufferType' has a wrong offset!");

// ScriptStruct GameTask.TaskChallange
// 0x0058 (0x0060 - 0x0008)
struct FTaskChallange final : public FTableRowBase
{
public:
	int32                                         ChallangeId;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChallangeType                                TaskType;                                          // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Icon;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Desc;                                              // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Reward;                                            // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Time;                                              // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TimeKill;                                          // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Health;                                            // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DeathCount;                                        // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PartialCount;                                      // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BufferId;                                          // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChallengeBuffType                            BufferType;                                        // 0x005C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTaskChallange) == 0x000008, "Wrong alignment on FTaskChallange");
static_assert(sizeof(FTaskChallange) == 0x000060, "Wrong size on FTaskChallange");
static_assert(offsetof(FTaskChallange, ChallangeId) == 0x000008, "Member 'FTaskChallange::ChallangeId' has a wrong offset!");
static_assert(offsetof(FTaskChallange, TaskType) == 0x00000C, "Member 'FTaskChallange::TaskType' has a wrong offset!");
static_assert(offsetof(FTaskChallange, Icon) == 0x000010, "Member 'FTaskChallange::Icon' has a wrong offset!");
static_assert(offsetof(FTaskChallange, Name) == 0x000020, "Member 'FTaskChallange::Name' has a wrong offset!");
static_assert(offsetof(FTaskChallange, Desc) == 0x000030, "Member 'FTaskChallange::Desc' has a wrong offset!");
static_assert(offsetof(FTaskChallange, Reward) == 0x000040, "Member 'FTaskChallange::Reward' has a wrong offset!");
static_assert(offsetof(FTaskChallange, Time) == 0x000044, "Member 'FTaskChallange::Time' has a wrong offset!");
static_assert(offsetof(FTaskChallange, TimeKill) == 0x000048, "Member 'FTaskChallange::TimeKill' has a wrong offset!");
static_assert(offsetof(FTaskChallange, Health) == 0x00004C, "Member 'FTaskChallange::Health' has a wrong offset!");
static_assert(offsetof(FTaskChallange, DeathCount) == 0x000050, "Member 'FTaskChallange::DeathCount' has a wrong offset!");
static_assert(offsetof(FTaskChallange, PartialCount) == 0x000054, "Member 'FTaskChallange::PartialCount' has a wrong offset!");
static_assert(offsetof(FTaskChallange, BufferId) == 0x000058, "Member 'FTaskChallange::BufferId' has a wrong offset!");
static_assert(offsetof(FTaskChallange, BufferType) == 0x00005C, "Member 'FTaskChallange::BufferType' has a wrong offset!");

// ScriptStruct GameTask.TrapSetting
// 0x0018 (0x0018 - 0x0000)
struct FTrapSetting final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Position;                                          // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTrapSetting) == 0x000008, "Wrong alignment on FTrapSetting");
static_assert(sizeof(FTrapSetting) == 0x000018, "Wrong size on FTrapSetting");
static_assert(offsetof(FTrapSetting, ID) == 0x000000, "Member 'FTrapSetting::ID' has a wrong offset!");
static_assert(offsetof(FTrapSetting, Position) == 0x000008, "Member 'FTrapSetting::Position' has a wrong offset!");

// ScriptStruct GameTask.TaskSetting
// 0x0058 (0x0060 - 0x0008)
struct FTaskSetting final : public FTableRowBase
{
public:
	int32                                         TaskId;                                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Desc;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        SubTask;                                           // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETaskType                                     TaskType;                                          // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 BattleMonsteres;                                   // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTrapSetting>                   Trapes;                                            // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTaskSetting) == 0x000008, "Wrong alignment on FTaskSetting");
static_assert(sizeof(FTaskSetting) == 0x000060, "Wrong size on FTaskSetting");
static_assert(offsetof(FTaskSetting, TaskId) == 0x000008, "Member 'FTaskSetting::TaskId' has a wrong offset!");
static_assert(offsetof(FTaskSetting, Desc) == 0x000010, "Member 'FTaskSetting::Desc' has a wrong offset!");
static_assert(offsetof(FTaskSetting, SubTask) == 0x000020, "Member 'FTaskSetting::SubTask' has a wrong offset!");
static_assert(offsetof(FTaskSetting, TaskType) == 0x000038, "Member 'FTaskSetting::TaskType' has a wrong offset!");
static_assert(offsetof(FTaskSetting, BattleMonsteres) == 0x000040, "Member 'FTaskSetting::BattleMonsteres' has a wrong offset!");
static_assert(offsetof(FTaskSetting, Trapes) == 0x000050, "Member 'FTaskSetting::Trapes' has a wrong offset!");

// ScriptStruct GameTask.RandomSetting
// 0x0008 (0x0008 - 0x0000)
struct FRandomSetting final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TaskRatio;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRandomSetting) == 0x000004, "Wrong alignment on FRandomSetting");
static_assert(sizeof(FRandomSetting) == 0x000008, "Wrong size on FRandomSetting");
static_assert(offsetof(FRandomSetting, ID) == 0x000000, "Member 'FRandomSetting::ID' has a wrong offset!");
static_assert(offsetof(FRandomSetting, TaskRatio) == 0x000004, "Member 'FRandomSetting::TaskRatio' has a wrong offset!");

// ScriptStruct GameTask.RandomTask
// 0x0048 (0x0050 - 0x0008)
struct FRandomTask final : public FTableRowBase
{
public:
	int32                                         TaskId;                                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Desc;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRandomSetting>                 RandomTasks;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRandomSetting>                 RandomChallenges;                                  // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRandomSetting>                 SpecialMonsteres;                                  // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRandomTask) == 0x000008, "Wrong alignment on FRandomTask");
static_assert(sizeof(FRandomTask) == 0x000050, "Wrong size on FRandomTask");
static_assert(offsetof(FRandomTask, TaskId) == 0x000008, "Member 'FRandomTask::TaskId' has a wrong offset!");
static_assert(offsetof(FRandomTask, Desc) == 0x000010, "Member 'FRandomTask::Desc' has a wrong offset!");
static_assert(offsetof(FRandomTask, RandomTasks) == 0x000020, "Member 'FRandomTask::RandomTasks' has a wrong offset!");
static_assert(offsetof(FRandomTask, RandomChallenges) == 0x000030, "Member 'FRandomTask::RandomChallenges' has a wrong offset!");
static_assert(offsetof(FRandomTask, SpecialMonsteres) == 0x000040, "Member 'FRandomTask::SpecialMonsteres' has a wrong offset!");

// ScriptStruct GameTask.RandomTaskGroup
// 0x0018 (0x0018 - 0x0000)
struct FRandomTaskGroup final
{
public:
	int32                                         TaskCount;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 RandomTask;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRandomTaskGroup) == 0x000008, "Wrong alignment on FRandomTaskGroup");
static_assert(sizeof(FRandomTaskGroup) == 0x000018, "Wrong size on FRandomTaskGroup");
static_assert(offsetof(FRandomTaskGroup, TaskCount) == 0x000000, "Member 'FRandomTaskGroup::TaskCount' has a wrong offset!");
static_assert(offsetof(FRandomTaskGroup, RandomTask) == 0x000008, "Member 'FRandomTaskGroup::RandomTask' has a wrong offset!");

// ScriptStruct GameTask.LevelAreaTask
// 0x0060 (0x0068 - 0x0008)
struct FLevelAreaTask final : public FTableRowBase
{
public:
	int32                                         LevelID;                                           // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Desc;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 AreaTaskIdes;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRandomTaskGroup>               ChallengeGroup;                                    // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRandomTaskGroup>               SpecialMonsterGroup;                               // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 SpecialMonsterSkilles;                             // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         SubTaskId;                                         // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLevelAreaTask) == 0x000008, "Wrong alignment on FLevelAreaTask");
static_assert(sizeof(FLevelAreaTask) == 0x000068, "Wrong size on FLevelAreaTask");
static_assert(offsetof(FLevelAreaTask, LevelID) == 0x000008, "Member 'FLevelAreaTask::LevelID' has a wrong offset!");
static_assert(offsetof(FLevelAreaTask, Desc) == 0x000010, "Member 'FLevelAreaTask::Desc' has a wrong offset!");
static_assert(offsetof(FLevelAreaTask, AreaTaskIdes) == 0x000020, "Member 'FLevelAreaTask::AreaTaskIdes' has a wrong offset!");
static_assert(offsetof(FLevelAreaTask, ChallengeGroup) == 0x000030, "Member 'FLevelAreaTask::ChallengeGroup' has a wrong offset!");
static_assert(offsetof(FLevelAreaTask, SpecialMonsterGroup) == 0x000040, "Member 'FLevelAreaTask::SpecialMonsterGroup' has a wrong offset!");
