#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameEx

#include "Basic.hpp"

#include "GameCore_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "GameEx_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameLogicTree_structs.hpp"
#include "GameLogicTree_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class GameEx.GEDrop
// 0x0008 (0x0230 - 0x0228)
class AGEDrop : public AActor
{
public:
	int32                                         DropId;                                            // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void MgrNotifyChangeMat();
	void MgrNotifyDestroy();
	void MgrNotifyReset();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GEDrop">();
	}
	static class AGEDrop* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGEDrop>();
	}
};
static_assert(alignof(AGEDrop) == 0x000008, "Wrong alignment on AGEDrop");
static_assert(sizeof(AGEDrop) == 0x000230, "Wrong size on AGEDrop");
static_assert(offsetof(AGEDrop, DropId) == 0x000228, "Member 'AGEDrop::DropId' has a wrong offset!");

// Class GameEx.GERotateBrick
// 0x0060 (0x0290 - 0x0230)
class AGERotateBrick final : public AGEDrop
{
public:
	int32                                         SmoothMaxCount;                                    // 0x0230(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGERotateBrickState                           BrickState;                                        // 0x0234(0x0001)(Edit, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              NormalStateDurRange;                               // 0x0238(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              CurNormalStateDurRange;                            // 0x0240(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Timer;                                             // 0x0248(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NextActionTime;                                    // 0x024C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotateSpeed;                                       // 0x0250(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotateAngle;                                       // 0x0254(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CumuRotateAngle;                                   // 0x0258(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChangeMatTime;                                     // 0x025C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGEBrickRotateType                            RotateType;                                        // 0x0260(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsRepByMgr;                                        // 0x0261(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_262[0x2];                                      // 0x0262(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SyncCurveTimeToClientDur;                          // 0x0264(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Client_TargetRot;                                  // 0x0268(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AGERotateBrickManager>   Mgr;                                               // 0x0274(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsClientFinishRotate;                              // 0x027C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27D[0x13];                                     // 0x027D(0x0013)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_BrickState();
	void SetBrickState(EGERotateBrickState InState);
	void SetEffectMat(int32 EffectType);
	void SyncRotateFinish(float CurAngle);
	void SyncStartRotateTime(float CurTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GERotateBrick">();
	}
	static class AGERotateBrick* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGERotateBrick>();
	}
};
static_assert(alignof(AGERotateBrick) == 0x000008, "Wrong alignment on AGERotateBrick");
static_assert(sizeof(AGERotateBrick) == 0x000290, "Wrong size on AGERotateBrick");
static_assert(offsetof(AGERotateBrick, SmoothMaxCount) == 0x000230, "Member 'AGERotateBrick::SmoothMaxCount' has a wrong offset!");
static_assert(offsetof(AGERotateBrick, BrickState) == 0x000234, "Member 'AGERotateBrick::BrickState' has a wrong offset!");
static_assert(offsetof(AGERotateBrick, NormalStateDurRange) == 0x000238, "Member 'AGERotateBrick::NormalStateDurRange' has a wrong offset!");
static_assert(offsetof(AGERotateBrick, CurNormalStateDurRange) == 0x000240, "Member 'AGERotateBrick::CurNormalStateDurRange' has a wrong offset!");
static_assert(offsetof(AGERotateBrick, Timer) == 0x000248, "Member 'AGERotateBrick::Timer' has a wrong offset!");
static_assert(offsetof(AGERotateBrick, NextActionTime) == 0x00024C, "Member 'AGERotateBrick::NextActionTime' has a wrong offset!");
static_assert(offsetof(AGERotateBrick, RotateSpeed) == 0x000250, "Member 'AGERotateBrick::RotateSpeed' has a wrong offset!");
static_assert(offsetof(AGERotateBrick, RotateAngle) == 0x000254, "Member 'AGERotateBrick::RotateAngle' has a wrong offset!");
static_assert(offsetof(AGERotateBrick, CumuRotateAngle) == 0x000258, "Member 'AGERotateBrick::CumuRotateAngle' has a wrong offset!");
static_assert(offsetof(AGERotateBrick, ChangeMatTime) == 0x00025C, "Member 'AGERotateBrick::ChangeMatTime' has a wrong offset!");
static_assert(offsetof(AGERotateBrick, RotateType) == 0x000260, "Member 'AGERotateBrick::RotateType' has a wrong offset!");
static_assert(offsetof(AGERotateBrick, IsRepByMgr) == 0x000261, "Member 'AGERotateBrick::IsRepByMgr' has a wrong offset!");
static_assert(offsetof(AGERotateBrick, SyncCurveTimeToClientDur) == 0x000264, "Member 'AGERotateBrick::SyncCurveTimeToClientDur' has a wrong offset!");
static_assert(offsetof(AGERotateBrick, Client_TargetRot) == 0x000268, "Member 'AGERotateBrick::Client_TargetRot' has a wrong offset!");
static_assert(offsetof(AGERotateBrick, Mgr) == 0x000274, "Member 'AGERotateBrick::Mgr' has a wrong offset!");
static_assert(offsetof(AGERotateBrick, IsClientFinishRotate) == 0x00027C, "Member 'AGERotateBrick::IsClientFinishRotate' has a wrong offset!");

// Class GameEx.AnimNtf_GECharTiming
// 0x0008 (0x0040 - 0x0038)
class UAnimNtf_GECharTiming final : public UAnimNotify
{
public:
	int32                                         TimingId;                                          // 0x0038(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNtf_GECharTiming">();
	}
	static class UAnimNtf_GECharTiming* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNtf_GECharTiming>();
	}
};
static_assert(alignof(UAnimNtf_GECharTiming) == 0x000008, "Wrong alignment on UAnimNtf_GECharTiming");
static_assert(sizeof(UAnimNtf_GECharTiming) == 0x000040, "Wrong size on UAnimNtf_GECharTiming");
static_assert(offsetof(UAnimNtf_GECharTiming, TimingId) == 0x000038, "Member 'UAnimNtf_GECharTiming::TimingId' has a wrong offset!");

// Class GameEx.GEScripteEventMgr
// 0x01E8 (0x0210 - 0x0028)
class UGEScripteEventMgr final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TickTSDur;                                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x88];                                      // 0x0034(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWorld* InWorld, ETravelFailure FailureType, const class FString& ErrorString)> TravelFailureMessagesDelegate;                     // 0x00BC(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(class UWorld* InWorld, ENetworkFailure FailureType, const class FString& ErrorString)> NetworkFailureMessagesDelegate;                    // 0x00CC(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(class UWorld* InWorld, class UNetDriver* NetDriver)> HandleDisconnectDelegate;                          // 0x00DC(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             EngineTickDelegate;                                // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             GameTickDelegate;                                  // 0x0100(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             GameShutDownDelegate;                              // 0x0110(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& A)>       MapLoadBeginDelegate;                              // 0x0120(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(class UWorld* A)>              MapLoadCompleteDelegate;                           // 0x0130(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(float LoadTime, const class FString& MapName)> GameInstanceLoadCompleteDelegate;                  // 0x0140(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             EventToTsDelegate;                                 // 0x0150(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        TempArr;                                           // 0x0160(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        TempVectorArray;                                   // 0x0170(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         TempActorArray;                                    // 0x0180(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnActorBeginPlayToTsDelegate;                      // 0x0190(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnActorEndPlayToTsDelegate;                        // 0x01A0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TDelegate<void(class AGEGameModeBase* GameModeBase, const class FString& MapName, const class FString& Options, class FString* ErrorMessage)> InitGameDelegate;                                  // 0x01B0(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TMap<int32, class AActor*>                    GEActorExComActors;                                // 0x01C0(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static void DelInstance();
	static class FString GetActorExComLuaTableName();
	static class FString GetGameModeLuaTableName();
	static class UGEScripteEventMgr* GetInstance();
	static class FString GetScripMgrLuaTableName();
	static void SetScripMgrLuaTableName(const class FString& Name_0);

	void ActorBeginPlayToTSDeleagte__DelegateSignature(const class AActor* Actor);
	void ActorEndPlayToTSDeleagte__DelegateSignature(const class AActor* Actor, const EEndPlayReason EndPlayReason);
	void AddGEActor(int32 ServerID, class AActor* Actor);
	void EventToTSDeleagte__DelegateSignature(const class FString& EventCmd, const class FString& Params_0);
	void GameInstanceLoadCompleteDelegate__DelegateSignature(float LoadTime, const class FString& MapName);
	class UGameInstance* GetGameInstance();
	class AActor* GetGEActorByServerID(int32 ServerID, class UWorld* World);
	void HandleDisconnect__DelegateSignature(class UWorld* InWorld, class UNetDriver* NetDriver);
	void InitGameDelegate__DelegateSignature(class AGEGameModeBase* GameModeBase, const class FString& MapName, const class FString& Options, class FString* ErrorMessage);
	void LevelLoadBeginDelgate__DelegateSignature(const class FString& A);
	void LevelLoadEndDelgate__DelegateSignature(class UWorld* A);
	void NotifyToTSEvent(const class FString& Cmd, const class FString& Param);
	void NotifyWithFloat__DelegateSignature(float Deatl);
	void NotifyWithNothing__DelegateSignature();
	void OnActorBeginPlay(class AActor* Actor);
	void OnActorEndPlay(class AActor* Actor, const EEndPlayReason EndPlayReason);
	void OnStart(class UGameInstance* Ins);
	void PeekNetworkFailureMessagesDelegate__DelegateSignature(class UWorld* InWorld, ENetworkFailure FailureType, const class FString& ErrorString);
	void PeekTravelFailureMessagesDelegate__DelegateSignature(class UWorld* InWorld, ETravelFailure FailureType, const class FString& ErrorString);
	void RemoveGEActor(int32 ServerID, class UWorld* World);
	void RemoveLuaTable(const class FString& TableName);
	void SetDebugWaiting();
	void SetLuaTable(const class FString& TableName, const class FString& GetFunName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GEScripteEventMgr">();
	}
	static class UGEScripteEventMgr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGEScripteEventMgr>();
	}
};
static_assert(alignof(UGEScripteEventMgr) == 0x000008, "Wrong alignment on UGEScripteEventMgr");
static_assert(sizeof(UGEScripteEventMgr) == 0x000210, "Wrong size on UGEScripteEventMgr");
static_assert(offsetof(UGEScripteEventMgr, TickTSDur) == 0x000030, "Member 'UGEScripteEventMgr::TickTSDur' has a wrong offset!");
static_assert(offsetof(UGEScripteEventMgr, TravelFailureMessagesDelegate) == 0x0000BC, "Member 'UGEScripteEventMgr::TravelFailureMessagesDelegate' has a wrong offset!");
static_assert(offsetof(UGEScripteEventMgr, NetworkFailureMessagesDelegate) == 0x0000CC, "Member 'UGEScripteEventMgr::NetworkFailureMessagesDelegate' has a wrong offset!");
static_assert(offsetof(UGEScripteEventMgr, HandleDisconnectDelegate) == 0x0000DC, "Member 'UGEScripteEventMgr::HandleDisconnectDelegate' has a wrong offset!");
static_assert(offsetof(UGEScripteEventMgr, EngineTickDelegate) == 0x0000F0, "Member 'UGEScripteEventMgr::EngineTickDelegate' has a wrong offset!");
static_assert(offsetof(UGEScripteEventMgr, GameTickDelegate) == 0x000100, "Member 'UGEScripteEventMgr::GameTickDelegate' has a wrong offset!");
static_assert(offsetof(UGEScripteEventMgr, GameShutDownDelegate) == 0x000110, "Member 'UGEScripteEventMgr::GameShutDownDelegate' has a wrong offset!");
static_assert(offsetof(UGEScripteEventMgr, MapLoadBeginDelegate) == 0x000120, "Member 'UGEScripteEventMgr::MapLoadBeginDelegate' has a wrong offset!");
static_assert(offsetof(UGEScripteEventMgr, MapLoadCompleteDelegate) == 0x000130, "Member 'UGEScripteEventMgr::MapLoadCompleteDelegate' has a wrong offset!");
static_assert(offsetof(UGEScripteEventMgr, GameInstanceLoadCompleteDelegate) == 0x000140, "Member 'UGEScripteEventMgr::GameInstanceLoadCompleteDelegate' has a wrong offset!");
static_assert(offsetof(UGEScripteEventMgr, EventToTsDelegate) == 0x000150, "Member 'UGEScripteEventMgr::EventToTsDelegate' has a wrong offset!");
static_assert(offsetof(UGEScripteEventMgr, TempArr) == 0x000160, "Member 'UGEScripteEventMgr::TempArr' has a wrong offset!");
static_assert(offsetof(UGEScripteEventMgr, TempVectorArray) == 0x000170, "Member 'UGEScripteEventMgr::TempVectorArray' has a wrong offset!");
static_assert(offsetof(UGEScripteEventMgr, TempActorArray) == 0x000180, "Member 'UGEScripteEventMgr::TempActorArray' has a wrong offset!");
static_assert(offsetof(UGEScripteEventMgr, OnActorBeginPlayToTsDelegate) == 0x000190, "Member 'UGEScripteEventMgr::OnActorBeginPlayToTsDelegate' has a wrong offset!");
static_assert(offsetof(UGEScripteEventMgr, OnActorEndPlayToTsDelegate) == 0x0001A0, "Member 'UGEScripteEventMgr::OnActorEndPlayToTsDelegate' has a wrong offset!");
static_assert(offsetof(UGEScripteEventMgr, InitGameDelegate) == 0x0001B0, "Member 'UGEScripteEventMgr::InitGameDelegate' has a wrong offset!");
static_assert(offsetof(UGEScripteEventMgr, GEActorExComActors) == 0x0001C0, "Member 'UGEScripteEventMgr::GEActorExComActors' has a wrong offset!");

// Class GameEx.GEAbilityAttributeSettings
// 0x0198 (0x01C0 - 0x0028)
class UGEAbilityAttributeSettings final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FGEAbilityAttribute> DefaultAbilityAttributes;                          // 0x0030(0x0050)(Edit, DisableEditOnTemplate, Transient, EditConst, AdvancedDisplay, NativeAccessSpecifierPrivate)
	TMap<struct FGECharLevelAttributeTemplateKey, struct FGECharLevelAttributeTemplate> CharLevelAttributesTemplates;                      // 0x0080(0x0050)(Edit, DisableEditOnTemplate, Transient, EditConst, AdvancedDisplay, NativeAccessSpecifierPrivate)
	TMap<int32, struct FGEWeaponAttributeTemplate> WeaponAttributesTemplates;                         // 0x00D0(0x0050)(Edit, DisableEditOnTemplate, Transient, EditConst, AdvancedDisplay, NativeAccessSpecifierPrivate)
	uint8                                         Pad_120[0xA0];                                     // 0x0120(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GEAbilityAttributeSettings">();
	}
	static class UGEAbilityAttributeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGEAbilityAttributeSettings>();
	}
};
static_assert(alignof(UGEAbilityAttributeSettings) == 0x000008, "Wrong alignment on UGEAbilityAttributeSettings");
static_assert(sizeof(UGEAbilityAttributeSettings) == 0x0001C0, "Wrong size on UGEAbilityAttributeSettings");
static_assert(offsetof(UGEAbilityAttributeSettings, DefaultAbilityAttributes) == 0x000030, "Member 'UGEAbilityAttributeSettings::DefaultAbilityAttributes' has a wrong offset!");
static_assert(offsetof(UGEAbilityAttributeSettings, CharLevelAttributesTemplates) == 0x000080, "Member 'UGEAbilityAttributeSettings::CharLevelAttributesTemplates' has a wrong offset!");
static_assert(offsetof(UGEAbilityAttributeSettings, WeaponAttributesTemplates) == 0x0000D0, "Member 'UGEAbilityAttributeSettings::WeaponAttributesTemplates' has a wrong offset!");

// Class GameEx.GESideBySideActor
// 0x0028 (0x0250 - 0x0228)
class AGESideBySideActor final : public AActor
{
public:
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActorTag;                                          // 0x0230(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 CustomDataArr;                                     // 0x0238(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	EGESideBySideType                             ActionType;                                        // 0x0248(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void LuaImpl_DoSideBySideAction();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GESideBySideActor">();
	}
	static class AGESideBySideActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGESideBySideActor>();
	}
};
static_assert(alignof(AGESideBySideActor) == 0x000008, "Wrong alignment on AGESideBySideActor");
static_assert(sizeof(AGESideBySideActor) == 0x000250, "Wrong size on AGESideBySideActor");
static_assert(offsetof(AGESideBySideActor, ActorTag) == 0x000230, "Member 'AGESideBySideActor::ActorTag' has a wrong offset!");
static_assert(offsetof(AGESideBySideActor, CustomDataArr) == 0x000238, "Member 'AGESideBySideActor::CustomDataArr' has a wrong offset!");
static_assert(offsetof(AGESideBySideActor, ActionType) == 0x000248, "Member 'AGESideBySideActor::ActionType' has a wrong offset!");

// Class GameEx.GETrapBase
// 0x0020 (0x0248 - 0x0228)
class AGETrapBase : public AActor
{
public:
	uint8                                         Pad_228[0x10];                                     // 0x0228(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          IsActivate;                                        // 0x0238(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  SpawnedBy;                                         // 0x023C(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void LuaImpl_Activate();
	void LuaImpl_DeActive();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GETrapBase">();
	}
	static class AGETrapBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGETrapBase>();
	}
};
static_assert(alignof(AGETrapBase) == 0x000008, "Wrong alignment on AGETrapBase");
static_assert(sizeof(AGETrapBase) == 0x000248, "Wrong size on AGETrapBase");
static_assert(offsetof(AGETrapBase, IsActivate) == 0x000238, "Member 'AGETrapBase::IsActivate' has a wrong offset!");
static_assert(offsetof(AGETrapBase, SpawnedBy) == 0x00023C, "Member 'AGETrapBase::SpawnedBy' has a wrong offset!");

// Class GameEx.GESkillLibrary
// 0x0000 (0x0028 - 0x0028)
class UGESkillLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool CanAddStoreCount(class AController* InController, int32 InIndex);
	static TArray<int32> GetAllBuffIdByCharTeam(class APawn* InPawn);
	static void GetAllSkillInfo(TArray<struct FGESkillInfo>* InArr);
	static TArray<float> GetBuffDesParam(int32 BuffId, int32 Level);
	static TArray<int32> GetBuffFromCount(int32 Count, class APawn* InPawn, bool IsHero);
	static struct FGEBuffInfo GetBuffInfoByID(int32 InId);
	static TArray<int32> GetBuffLevelParam(int32 BuffId, int32 Level);
	static struct FSoftObjectPath GetBuffPath(int32 InId);
	static int32 GetOwnBuffLevel(int32 InBuffId, class APawn* InPawn);
	static struct FGESkillEquipInfo GetSkillEquipData(class AController* InController, int32 InIndex);
	static struct FGESkillInfo GetSkillInfo(int32 InId);
	static struct FSoftObjectPath GetSkillPath(int32 InId);
	static bool IsUseable(class AController* InController, int32 InIndex);
	static void ModifySkillReduceCD(class AGEPlayerState* Ps, int32 InIndex, float InReduceValue);
	static void ModifySkillStoreCount(class AGEGameCharacter* Char, int32 InIndex, int32 InAddCount);
	static void SetIsUsed(class AController* InController, int32 InIndex);
	static void SetSkillEquipData(class AController* InController, int32 InIndex, const struct FGESkillEquipInfo& Info);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GESkillLibrary">();
	}
	static class UGESkillLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGESkillLibrary>();
	}
};
static_assert(alignof(UGESkillLibrary) == 0x000008, "Wrong alignment on UGESkillLibrary");
static_assert(sizeof(UGESkillLibrary) == 0x000028, "Wrong size on UGESkillLibrary");

// Class GameEx.GEAccelerateTrap
// 0x0008 (0x0250 - 0x0248)
class AGEAccelerateTrap final : public AGETrapBase
{
public:
	float                                         AcceleRate;                                        // 0x0248(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GEAccelerateTrap">();
	}
	static class AGEAccelerateTrap* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGEAccelerateTrap>();
	}
};
static_assert(alignof(AGEAccelerateTrap) == 0x000008, "Wrong alignment on AGEAccelerateTrap");
static_assert(sizeof(AGEAccelerateTrap) == 0x000250, "Wrong size on AGEAccelerateTrap");
static_assert(offsetof(AGEAccelerateTrap, AcceleRate) == 0x000248, "Member 'AGEAccelerateTrap::AcceleRate' has a wrong offset!");

// Class GameEx.GESplineConveyorComponent
// 0x0180 (0x0230 - 0x00B0)
class UGESplineConveyorComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B0[0x18];                                      // 0x00B0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bShowLog;                                          // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineComponent*                       SplineComponent;                                   // 0x00D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        SceneComponent;                                    // 0x00D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SplineLength;                                      // 0x00E0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x00E4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartMoveCD;                                       // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveCompleteTime;                                  // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VisibleDes;                                        // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSmooth;                                        // 0x00F4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SmoothMaxCount;                                    // 0x00F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSweep;                                            // 0x00FC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTeleport;                                         // 0x00FD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SplineComponentName;                               // 0x0100(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SceneComponentName;                                // 0x0110(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SyncCurveTimeToClientDur;                          // 0x0120(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurTime;                                           // 0x0124(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalTime;                                         // 0x0128(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CanMove;                                           // 0x012C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class AActor*, float>                    MoveActors;                                        // 0x0130(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         AttachedActors;                                    // 0x0180(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_190[0x8C];                                     // 0x0190(0x008C)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* Actor)>          StartmoveDelegate;                                 // 0x021C(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddMoveActor(class AActor* Actor, float StartLen, bool bCheckRepeat);
	void SetMoveValue(float Time, int64 ServertimeMilli);
	void StartmoveDelegate__DelegateSignature(class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GESplineConveyorComponent">();
	}
	static class UGESplineConveyorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGESplineConveyorComponent>();
	}
};
static_assert(alignof(UGESplineConveyorComponent) == 0x000008, "Wrong alignment on UGESplineConveyorComponent");
static_assert(sizeof(UGESplineConveyorComponent) == 0x000230, "Wrong size on UGESplineConveyorComponent");
static_assert(offsetof(UGESplineConveyorComponent, bShowLog) == 0x0000C8, "Member 'UGESplineConveyorComponent::bShowLog' has a wrong offset!");
static_assert(offsetof(UGESplineConveyorComponent, SplineComponent) == 0x0000D0, "Member 'UGESplineConveyorComponent::SplineComponent' has a wrong offset!");
static_assert(offsetof(UGESplineConveyorComponent, SceneComponent) == 0x0000D8, "Member 'UGESplineConveyorComponent::SceneComponent' has a wrong offset!");
static_assert(offsetof(UGESplineConveyorComponent, SplineLength) == 0x0000E0, "Member 'UGESplineConveyorComponent::SplineLength' has a wrong offset!");
static_assert(offsetof(UGESplineConveyorComponent, bEnable) == 0x0000E4, "Member 'UGESplineConveyorComponent::bEnable' has a wrong offset!");
static_assert(offsetof(UGESplineConveyorComponent, StartMoveCD) == 0x0000E8, "Member 'UGESplineConveyorComponent::StartMoveCD' has a wrong offset!");
static_assert(offsetof(UGESplineConveyorComponent, MoveCompleteTime) == 0x0000EC, "Member 'UGESplineConveyorComponent::MoveCompleteTime' has a wrong offset!");
static_assert(offsetof(UGESplineConveyorComponent, VisibleDes) == 0x0000F0, "Member 'UGESplineConveyorComponent::VisibleDes' has a wrong offset!");
static_assert(offsetof(UGESplineConveyorComponent, bUseSmooth) == 0x0000F4, "Member 'UGESplineConveyorComponent::bUseSmooth' has a wrong offset!");
static_assert(offsetof(UGESplineConveyorComponent, SmoothMaxCount) == 0x0000F8, "Member 'UGESplineConveyorComponent::SmoothMaxCount' has a wrong offset!");
static_assert(offsetof(UGESplineConveyorComponent, bSweep) == 0x0000FC, "Member 'UGESplineConveyorComponent::bSweep' has a wrong offset!");
static_assert(offsetof(UGESplineConveyorComponent, bTeleport) == 0x0000FD, "Member 'UGESplineConveyorComponent::bTeleport' has a wrong offset!");
static_assert(offsetof(UGESplineConveyorComponent, SplineComponentName) == 0x000100, "Member 'UGESplineConveyorComponent::SplineComponentName' has a wrong offset!");
static_assert(offsetof(UGESplineConveyorComponent, SceneComponentName) == 0x000110, "Member 'UGESplineConveyorComponent::SceneComponentName' has a wrong offset!");
static_assert(offsetof(UGESplineConveyorComponent, SyncCurveTimeToClientDur) == 0x000120, "Member 'UGESplineConveyorComponent::SyncCurveTimeToClientDur' has a wrong offset!");
static_assert(offsetof(UGESplineConveyorComponent, CurTime) == 0x000124, "Member 'UGESplineConveyorComponent::CurTime' has a wrong offset!");
static_assert(offsetof(UGESplineConveyorComponent, TotalTime) == 0x000128, "Member 'UGESplineConveyorComponent::TotalTime' has a wrong offset!");
static_assert(offsetof(UGESplineConveyorComponent, CanMove) == 0x00012C, "Member 'UGESplineConveyorComponent::CanMove' has a wrong offset!");
static_assert(offsetof(UGESplineConveyorComponent, MoveActors) == 0x000130, "Member 'UGESplineConveyorComponent::MoveActors' has a wrong offset!");
static_assert(offsetof(UGESplineConveyorComponent, AttachedActors) == 0x000180, "Member 'UGESplineConveyorComponent::AttachedActors' has a wrong offset!");
static_assert(offsetof(UGESplineConveyorComponent, StartmoveDelegate) == 0x00021C, "Member 'UGESplineConveyorComponent::StartmoveDelegate' has a wrong offset!");

// Class GameEx.GEActorExComponent
// 0x0168 (0x0218 - 0x00B0)
class UGEActorExComponent final : public UActorComponent
{
public:
	TDelegate<void()>                             BeginPlayDelegate;                                 // 0x00B0(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(EEndPlayReason Reason)>        EndPlayDelegate;                                   // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(float Dt)>                     TickDelegate;                                      // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& FunName, const class FString& Param)> OnCallTSFunDelegate;                               // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ServerID;                                          // 0x00F0(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            CustomDataString;                                  // 0x00F8(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FString, int32>                    CustomDataNumber;                                  // 0x0148(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                         UserID;                                            // 0x0198(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             UserIDChangeDelegate;                              // 0x019C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         CharID;                                            // 0x01AC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             CharIDChangeDelegate;                              // 0x01B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         EntityType;                                        // 0x01C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ConfID;                                            // 0x01C4(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             ConfIDChangeDelegate;                              // 0x01C8(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 MainID, int32 SubId, const class FString& Data)> FNotifyMsgDelegate;                                // 0x01D8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 TypeId, int32 SubId)>    FNotifyActorMsgDelegate;                           // 0x01E8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 DataIndex, int32 DataValue)> FNotifyActorCustomDataDelegate;                    // 0x01F8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         CustomRepData1;                                    // 0x0208(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CustomRepData2;                                    // 0x020C(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CustomRepData3;                                    // 0x0210(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void SetAllServerID(int32 ID);

	void CallLuaFun(const class FString& FucName, const class FString& FunParam);
	void CallLuaFunByDelegate(const class FString& FunName, const class FString& Param);
	void CharIDChangeDelegate__DelegateSignature();
	void ConfIDChangeDelegate__DelegateSignature();
	int32 GetCharID();
	int32 GetConfID();
	int32 GetDataInt(const class FString& Key);
	class FString GetDataString(const class FString& Key);
	int32 GetEntityType();
	int32 GetServerID();
	int32 GetUserID();
	void NotifyActorCustomData__DelegateSignature(int32 DataIndex, int32 DataValue);
	void NotifyActorMsg__DelegateSignature(int32 TypeId, int32 SubId);
	void NotifyActorMsg_Client(int32 TypeId, int32 SubId);
	void NotifyActorMsg_Client_Unreliable(int32 TypeId, int32 SubId);
	void NotifyActorMsg_NetMulticast(int32 TypeId, int32 SubId);
	void NotifyActorMsg_NetMulticast_Unreliable(int32 TypeId, int32 SubId);
	void NotifyActorMsg_Server(int32 TypeId, int32 SubId);
	void NotifyActorMsg_Server_Unreliable(int32 TypeId, int32 SubId);
	void NotifyMsg__DelegateSignature(int32 MainID, int32 SubId, const class FString& Data);
	void NotifyMsg_Client(int32 MainID, int32 SubId, const class FString& Data);
	void NotifyMsg_Client_Unreliable(int32 MainID, int32 SubId, const class FString& Data);
	void NotifyMsg_NetMulticast(int32 MainID, int32 SubId, const class FString& Value);
	void NotifyMsg_NetMulticast_Unreliable(int32 MainID, int32 SubId, const class FString& Value);
	void NotifyMsg_Server(int32 MainID, int32 SubId, const class FString& Data);
	void NotifyMsg_Server_Unreliable(int32 MainID, int32 SubId, const class FString& Data);
	void OnCustomChanged1();
	void OnCustomChanged2();
	void OnCustomChanged3();
	void OnRep_CharID();
	void OnRep_ConfID();
	void OnRep_ServerID();
	void OnRep_UserID();
	void PrintID(class FString* Tag);
	void SetCharID(int32 ICharid);
	void SetConfID(int32 IConfID);
	void SetCustomRepData(int32 DataIndex, int32 DataValue);
	void SetDataInt(const class FString& Key, int32 Value);
	void SetDataString(const class FString& Key, const class FString& Value);
	void SetEntityType(int32 IentityType);
	void SetUserID(int32 IUserid);
	void UserIDChangeDelegate__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GEActorExComponent">();
	}
	static class UGEActorExComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGEActorExComponent>();
	}
};
static_assert(alignof(UGEActorExComponent) == 0x000008, "Wrong alignment on UGEActorExComponent");
static_assert(sizeof(UGEActorExComponent) == 0x000218, "Wrong size on UGEActorExComponent");
static_assert(offsetof(UGEActorExComponent, BeginPlayDelegate) == 0x0000B0, "Member 'UGEActorExComponent::BeginPlayDelegate' has a wrong offset!");
static_assert(offsetof(UGEActorExComponent, EndPlayDelegate) == 0x0000C0, "Member 'UGEActorExComponent::EndPlayDelegate' has a wrong offset!");
static_assert(offsetof(UGEActorExComponent, TickDelegate) == 0x0000D0, "Member 'UGEActorExComponent::TickDelegate' has a wrong offset!");
static_assert(offsetof(UGEActorExComponent, OnCallTSFunDelegate) == 0x0000E0, "Member 'UGEActorExComponent::OnCallTSFunDelegate' has a wrong offset!");
static_assert(offsetof(UGEActorExComponent, ServerID) == 0x0000F0, "Member 'UGEActorExComponent::ServerID' has a wrong offset!");
static_assert(offsetof(UGEActorExComponent, CustomDataString) == 0x0000F8, "Member 'UGEActorExComponent::CustomDataString' has a wrong offset!");
static_assert(offsetof(UGEActorExComponent, CustomDataNumber) == 0x000148, "Member 'UGEActorExComponent::CustomDataNumber' has a wrong offset!");
static_assert(offsetof(UGEActorExComponent, UserID) == 0x000198, "Member 'UGEActorExComponent::UserID' has a wrong offset!");
static_assert(offsetof(UGEActorExComponent, UserIDChangeDelegate) == 0x00019C, "Member 'UGEActorExComponent::UserIDChangeDelegate' has a wrong offset!");
static_assert(offsetof(UGEActorExComponent, CharID) == 0x0001AC, "Member 'UGEActorExComponent::CharID' has a wrong offset!");
static_assert(offsetof(UGEActorExComponent, CharIDChangeDelegate) == 0x0001B0, "Member 'UGEActorExComponent::CharIDChangeDelegate' has a wrong offset!");
static_assert(offsetof(UGEActorExComponent, EntityType) == 0x0001C0, "Member 'UGEActorExComponent::EntityType' has a wrong offset!");
static_assert(offsetof(UGEActorExComponent, ConfID) == 0x0001C4, "Member 'UGEActorExComponent::ConfID' has a wrong offset!");
static_assert(offsetof(UGEActorExComponent, ConfIDChangeDelegate) == 0x0001C8, "Member 'UGEActorExComponent::ConfIDChangeDelegate' has a wrong offset!");
static_assert(offsetof(UGEActorExComponent, FNotifyMsgDelegate) == 0x0001D8, "Member 'UGEActorExComponent::FNotifyMsgDelegate' has a wrong offset!");
static_assert(offsetof(UGEActorExComponent, FNotifyActorMsgDelegate) == 0x0001E8, "Member 'UGEActorExComponent::FNotifyActorMsgDelegate' has a wrong offset!");
static_assert(offsetof(UGEActorExComponent, FNotifyActorCustomDataDelegate) == 0x0001F8, "Member 'UGEActorExComponent::FNotifyActorCustomDataDelegate' has a wrong offset!");
static_assert(offsetof(UGEActorExComponent, CustomRepData1) == 0x000208, "Member 'UGEActorExComponent::CustomRepData1' has a wrong offset!");
static_assert(offsetof(UGEActorExComponent, CustomRepData2) == 0x00020C, "Member 'UGEActorExComponent::CustomRepData2' has a wrong offset!");
static_assert(offsetof(UGEActorExComponent, CustomRepData3) == 0x000210, "Member 'UGEActorExComponent::CustomRepData3' has a wrong offset!");

// Class GameEx.GESplineMoveComponent
// 0x01A0 (0x0250 - 0x00B0)
class UGESplineMoveComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B0[0x4];                                       // 0x00B0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bShowLog;                                          // 0x00B4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineComponent*                       SplineComponent;                                   // 0x00B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USplineComponent*>               SplineComponents;                                  // 0x00C0(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class USceneComponent*                        Mesh;                                              // 0x00D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 FocusActor;                                        // 0x00D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SplineLength;                                      // 0x00E0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class AActor* Actor)>          MoveCompleteDelegate;                              // 0x00E4(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void()>                             SelfMoveCompleteDelegate;                          // 0x00F4(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	float                                         MoveSpeed;                                         // 0x0104(0x0004)(Edit, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LoopMove;                                          // 0x0108(0x0001)(Edit, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsSelfMove;                                        // 0x0109(0x0001)(Edit, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LoopDelay;                                         // 0x010C(0x0004)(Edit, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SynThreshold;                                      // 0x0110(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UpdateRotate;                                      // 0x0114(0x0001)(Edit, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               ForceRotation;                                     // 0x0118(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         NetWokrDelayOptimize;                              // 0x0124(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseScale;                                          // 0x0128(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSweep;                                            // 0x0129(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTeleport;                                         // 0x012A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SplineComponentName;                               // 0x0130(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         SplineComponentNames;                              // 0x0140(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 MoveComponentName;                                 // 0x0150(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SyncCurveTimeToClientDur;                          // 0x0160(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsForward;                                         // 0x0164(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LoopDelayTimer;                                    // 0x0168(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveValue;                                         // 0x016C(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class AActor*, float>                    MoveActors;                                        // 0x0170(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C0[0x90];                                     // 0x01C0(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddMoveActor(class AActor* Actor, float StartLen, bool bCheckRepeat);
	void MoveCompleteDelegate__DelegateSignature(class AActor* Actor);
	void OnRep_MoveValue();
	void SelfMoveComplete__DelegateSignature();
	void SetisSelfMove(bool Selfmove);
	void SetMoveValue(float Time, int64 ServertimeMilli);
	void UpdateSelfMeshLocation();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GESplineMoveComponent">();
	}
	static class UGESplineMoveComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGESplineMoveComponent>();
	}
};
static_assert(alignof(UGESplineMoveComponent) == 0x000008, "Wrong alignment on UGESplineMoveComponent");
static_assert(sizeof(UGESplineMoveComponent) == 0x000250, "Wrong size on UGESplineMoveComponent");
static_assert(offsetof(UGESplineMoveComponent, bShowLog) == 0x0000B4, "Member 'UGESplineMoveComponent::bShowLog' has a wrong offset!");
static_assert(offsetof(UGESplineMoveComponent, SplineComponent) == 0x0000B8, "Member 'UGESplineMoveComponent::SplineComponent' has a wrong offset!");
static_assert(offsetof(UGESplineMoveComponent, SplineComponents) == 0x0000C0, "Member 'UGESplineMoveComponent::SplineComponents' has a wrong offset!");
static_assert(offsetof(UGESplineMoveComponent, Mesh) == 0x0000D0, "Member 'UGESplineMoveComponent::Mesh' has a wrong offset!");
static_assert(offsetof(UGESplineMoveComponent, FocusActor) == 0x0000D8, "Member 'UGESplineMoveComponent::FocusActor' has a wrong offset!");
static_assert(offsetof(UGESplineMoveComponent, SplineLength) == 0x0000E0, "Member 'UGESplineMoveComponent::SplineLength' has a wrong offset!");
static_assert(offsetof(UGESplineMoveComponent, MoveCompleteDelegate) == 0x0000E4, "Member 'UGESplineMoveComponent::MoveCompleteDelegate' has a wrong offset!");
static_assert(offsetof(UGESplineMoveComponent, SelfMoveCompleteDelegate) == 0x0000F4, "Member 'UGESplineMoveComponent::SelfMoveCompleteDelegate' has a wrong offset!");
static_assert(offsetof(UGESplineMoveComponent, MoveSpeed) == 0x000104, "Member 'UGESplineMoveComponent::MoveSpeed' has a wrong offset!");
static_assert(offsetof(UGESplineMoveComponent, LoopMove) == 0x000108, "Member 'UGESplineMoveComponent::LoopMove' has a wrong offset!");
static_assert(offsetof(UGESplineMoveComponent, IsSelfMove) == 0x000109, "Member 'UGESplineMoveComponent::IsSelfMove' has a wrong offset!");
static_assert(offsetof(UGESplineMoveComponent, LoopDelay) == 0x00010C, "Member 'UGESplineMoveComponent::LoopDelay' has a wrong offset!");
static_assert(offsetof(UGESplineMoveComponent, SynThreshold) == 0x000110, "Member 'UGESplineMoveComponent::SynThreshold' has a wrong offset!");
static_assert(offsetof(UGESplineMoveComponent, UpdateRotate) == 0x000114, "Member 'UGESplineMoveComponent::UpdateRotate' has a wrong offset!");
static_assert(offsetof(UGESplineMoveComponent, ForceRotation) == 0x000118, "Member 'UGESplineMoveComponent::ForceRotation' has a wrong offset!");
static_assert(offsetof(UGESplineMoveComponent, NetWokrDelayOptimize) == 0x000124, "Member 'UGESplineMoveComponent::NetWokrDelayOptimize' has a wrong offset!");
static_assert(offsetof(UGESplineMoveComponent, UseScale) == 0x000128, "Member 'UGESplineMoveComponent::UseScale' has a wrong offset!");
static_assert(offsetof(UGESplineMoveComponent, bSweep) == 0x000129, "Member 'UGESplineMoveComponent::bSweep' has a wrong offset!");
static_assert(offsetof(UGESplineMoveComponent, bTeleport) == 0x00012A, "Member 'UGESplineMoveComponent::bTeleport' has a wrong offset!");
static_assert(offsetof(UGESplineMoveComponent, SplineComponentName) == 0x000130, "Member 'UGESplineMoveComponent::SplineComponentName' has a wrong offset!");
static_assert(offsetof(UGESplineMoveComponent, SplineComponentNames) == 0x000140, "Member 'UGESplineMoveComponent::SplineComponentNames' has a wrong offset!");
static_assert(offsetof(UGESplineMoveComponent, MoveComponentName) == 0x000150, "Member 'UGESplineMoveComponent::MoveComponentName' has a wrong offset!");
static_assert(offsetof(UGESplineMoveComponent, SyncCurveTimeToClientDur) == 0x000160, "Member 'UGESplineMoveComponent::SyncCurveTimeToClientDur' has a wrong offset!");
static_assert(offsetof(UGESplineMoveComponent, IsForward) == 0x000164, "Member 'UGESplineMoveComponent::IsForward' has a wrong offset!");
