#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GamePlayerCameraManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EnumInitSnow_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GamePlayerCameraManager.GamePlayerCameraManager_C
// 0x0040 (0x2E20 - 0x2DE0)
class AGamePlayerCameraManager_C final : public AThirdPersonPlayerCameraManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2DE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      SnowEffect;                                        // 0x2DE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset;                                            // 0x2DF0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rate;                                              // 0x2DFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size;                                              // 0x2E00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Velocity;                                          // 0x2E04(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        SnowEffectNiagaraSystem;                           // 0x2E08(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GamePlayerCameraManager(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Set_Snow(float Rate_0, float Size_0, float Velocity_0, const struct FVector& VelocityMax, const struct FVector& VelocityMin);
	void ActiveSnow(bool Active, EnumInitSnow Snow);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GamePlayerCameraManager_C">();
	}
	static class AGamePlayerCameraManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGamePlayerCameraManager_C>();
	}
};
static_assert(alignof(AGamePlayerCameraManager_C) == 0x000010, "Wrong alignment on AGamePlayerCameraManager_C");
static_assert(sizeof(AGamePlayerCameraManager_C) == 0x002E20, "Wrong size on AGamePlayerCameraManager_C");
static_assert(offsetof(AGamePlayerCameraManager_C, UberGraphFrame) == 0x002DE0, "Member 'AGamePlayerCameraManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGamePlayerCameraManager_C, SnowEffect) == 0x002DE8, "Member 'AGamePlayerCameraManager_C::SnowEffect' has a wrong offset!");
static_assert(offsetof(AGamePlayerCameraManager_C, Offset) == 0x002DF0, "Member 'AGamePlayerCameraManager_C::Offset' has a wrong offset!");
static_assert(offsetof(AGamePlayerCameraManager_C, Rate) == 0x002DFC, "Member 'AGamePlayerCameraManager_C::Rate' has a wrong offset!");
static_assert(offsetof(AGamePlayerCameraManager_C, Size) == 0x002E00, "Member 'AGamePlayerCameraManager_C::Size' has a wrong offset!");
static_assert(offsetof(AGamePlayerCameraManager_C, Velocity) == 0x002E04, "Member 'AGamePlayerCameraManager_C::Velocity' has a wrong offset!");
static_assert(offsetof(AGamePlayerCameraManager_C, SnowEffectNiagaraSystem) == 0x002E08, "Member 'AGamePlayerCameraManager_C::SnowEffectNiagaraSystem' has a wrong offset!");

}

