#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameTable

#include "Basic.hpp"


namespace SDK
{

// Enum GameTable.EGameTableKeyType
// NumValues: 0x0003
enum class EGameTableKeyType : uint8
{
	Int                                      = 0,
	String                                   = 1,
	EGameTableKeyType_MAX                    = 2,
};

// Enum GameTable.EGameTableLoaderType
// NumValues: 0x0003
enum class EGameTableLoaderType : uint8
{
	Helper                                   = 0,
	Loader                                   = 1,
	EGameTableLoaderType_MAX                 = 2,
};

// Enum GameTable.EGameplayType
// NumValues: 0x0008
enum class EGameplayType : uint8
{
	Global                                   = 0,
	FightLevel                               = 1,
	UIMain                                   = 2,
	House                                    = 3,
	WaterPark                                = 11,
	RMOL                                     = 12,
	PlotEditor                               = 13,
	EGameplayType_MAX                        = 14,
};

// Enum GameTable.EGameTableName
// NumValues: 0x008C
enum class EGameTableName : uint8
{
	None                                     = 0,
	AIDirectorConfigs                        = 1,
	AITeamConfigs                            = 2,
	AIGlobalConfigs                          = 3,
	OutDamageValueInfo                       = 4,
	AllAttributeSetting                      = 5,
	SkillInfo                                = 6,
	EmitterInfo                              = 7,
	ModifierInfo                             = 8,
	BulletInfo                               = 9,
	StateBlockType                           = 10,
	StateBlockCommitType                     = 11,
	EnchantInfo                              = 12,
	BulletEnchantInfo                        = 13,
	AbilityForceFeedbackInfo                 = 14,
	AttackShildOrHealthEffect                = 15,
	TriangleAttributeRelative                = 16,
	CampRelation                             = 17,
	HitEffects                               = 18,
	SkillSelector                            = 19,
	CharacterMaterialTemplate                = 20,
	Trap                                     = 21,
	MonsterTemplates                         = 22,
	MonsterDynamicLevel                      = 23,
	CharacterTemplate                        = 24,
	CardGrow                                 = 25,
	WeaponTemplates                          = 26,
	SurfaceHitResultTemplate                 = 27,
	WeaponPartsTemplates                     = 28,
	PostProcessMaterialTemplate              = 29,
	DropEffects                              = 30,
	CameraConfig                             = 31,
	ActiveSpawners                           = 32,
	ActiveSpawners_Daily                     = 33,
	ActiveSpawners_Tower                     = 34,
	ActiveWaves                              = 35,
	Waves                                    = 36,
	AIEvents                                 = 37,
	PlotConfig                               = 38,
	AITemplates                              = 39,
	AIControlParams                          = 40,
	PlotRoleImg                              = 41,
	PlotRole                                 = 42,
	PlotSound                                = 43,
	FightCrossType                           = 44,
	ActiveSpawners_Fragments                 = 45,
	BattleInfo                               = 46,
	FacialAnimation                          = 47,
	CharacterEffectType                      = 48,
	CharacterPerformanceAnim                 = 49,
	CharacterInteractionAnim                 = 50,
	InteractionTypeConfig                    = 51,
	InteractionCustomBreastPhyConfig         = 52,
	PerformanceAnimLoopSequenceConfig        = 53,
	InteractionAnimLoopSequenceConfig        = 54,
	ShowSequenceConfig                       = 55,
	ShowElementConfig                        = 56,
	InteractionStandByConfig                 = 57,
	InteractionOperateConfig                 = 58,
	PerformanceAnimConfig                    = 59,
	InteractionAnimConfig                    = 60,
	FinishAnimConfig                         = 61,
	PerformanceEffectConfig                  = 62,
	PostProcessEffectOrderType               = 63,
	FixSkillInfo                             = 64,
	ActiveSpawners_Multi                     = 65,
	ActiveSpawners_OpenWorld                 = 66,
	CharacterSkinTemplate                    = 67,
	DamageFloat                              = 68,
	DamageFloatDetail                        = 69,
	Keyboard                                 = 70,
	UINiagaraConfig                          = 71,
	SupportKeyboards                         = 72,
	SupportGamepadKeys                       = 73,
	ExploreItemList                          = 74,
	MonsterTemplatesEx                       = 75,
	FontConfig                               = 76,
	ElemExplosionData                        = 77,
	ModifierKeepEffectConfigs                = 78,
	EffectPathReplace                        = 79,
	WwisePathReplace                         = 80,
	ShootOrSkillMasteryCollation             = 81,
	SkinPartTemplates                        = 82,
	LevelAreaTask                            = 83,
	RandomTask                               = 84,
	TaskSetting                              = 85,
	TaskChallange                            = 86,
	RandomMonster                            = 87,
	HouseCharacterTemplate                   = 88,
	HouseFaceAnimNameMapping                 = 89,
	SpawnEffect                              = 90,
	Multi_SubTask                            = 91,
	SceneTranslucentMaterials                = 92,
	AvoidanceConfigs                         = 93,
	ActiveBarricade                          = 94,
	ModelMaterialModify                      = 95,
	PreviewNameMappingTemplate               = 96,
	PreviewNameMappingGreenTemplate          = 97,
	PreviewHeadNameMappingTemplate           = 98,
	PreviewHeadNameMappingGreenTemplate      = 99,
	PreviewUIWidgetTransitionAnimTemplate    = 100,
	OpenWorldDrop                            = 101,
	LevelUMG                                 = 102,
	EffectIgnoreDestroy                      = 103,
	CustomBreastPhy                          = 104,
	CustomHipPhy                             = 105,
	HPBar                                    = 106,
	PreLoadDesc                              = 107,
	MeshReplace                              = 108,
	ActiveSpawners_Rogue                     = 109,
	BaseSkillInfo                            = 110,
	PhysiqueTypeTemplate                     = 111,
	PalWildMonsCfg                           = 112,
	FootPrintCfg                             = 113,
	ExplosiveTemplate                        = 114,
	MassageConfig                            = 115,
	MassagePhyControlInitParam               = 116,
	MonsterCareerEnemySearch                 = 117,
	TeamAbilities                            = 118,
	WaterParkCharTemplate                    = 119,
	ActiveSpawners_PalChapter                = 120,
	WeaponRecoilConfig                       = 121,
	CustomVehicleConfig                      = 122,
	EndlessTDMonsterConfig                   = 123,
	EndlessBattleRandomEventsConfig          = 124,
	GirlRushWeaponInfo                       = 125,
	GirlRushSkillInfo                        = 126,
	GirlRushEmitterInfo                      = 127,
	GirlRushModifierInfo                     = 128,
	ARAnimConfig                             = 129,
	ARSeqConfig                              = 130,
	WPSkillInfo                              = 131,
	WPBuffInfo                               = 132,
	WPWeaponInfo                             = 133,
	WPBulletInfo                             = 134,
	OnlineSeaGameEventsConfig                = 135,
	OnlineSeaModSkillInfo                    = 136,
	OnlineSeaShipInfo                        = 137,
	OnlineSeaExpInfo                         = 138,
	EGameTableName_MAX                       = 139,
};

// ScriptStruct GameTable.DataTableItemConfig
// 0x0040 (0x0040 - 0x0000)
struct FDataTableItemConfig final
{
public:
	EGameTableLoaderType                          Type;                                              // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameTableName                                Name;                                              // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TablePath;                                         // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TablePropertyKey;                                  // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameTableKeyType                             TableKeyType;                                      // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EGameplayType>                         Gameplays;                                         // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bPreload;                                          // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMiniGame;                                         // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWarnIfRowMissing;                                 // 0x003A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataTableItemConfig) == 0x000008, "Wrong alignment on FDataTableItemConfig");
static_assert(sizeof(FDataTableItemConfig) == 0x000040, "Wrong size on FDataTableItemConfig");
static_assert(offsetof(FDataTableItemConfig, Type) == 0x000000, "Member 'FDataTableItemConfig::Type' has a wrong offset!");
static_assert(offsetof(FDataTableItemConfig, Name) == 0x000001, "Member 'FDataTableItemConfig::Name' has a wrong offset!");
static_assert(offsetof(FDataTableItemConfig, TablePath) == 0x000008, "Member 'FDataTableItemConfig::TablePath' has a wrong offset!");
static_assert(offsetof(FDataTableItemConfig, TablePropertyKey) == 0x000018, "Member 'FDataTableItemConfig::TablePropertyKey' has a wrong offset!");
static_assert(offsetof(FDataTableItemConfig, TableKeyType) == 0x000020, "Member 'FDataTableItemConfig::TableKeyType' has a wrong offset!");
static_assert(offsetof(FDataTableItemConfig, Gameplays) == 0x000028, "Member 'FDataTableItemConfig::Gameplays' has a wrong offset!");
static_assert(offsetof(FDataTableItemConfig, bPreload) == 0x000038, "Member 'FDataTableItemConfig::bPreload' has a wrong offset!");
static_assert(offsetof(FDataTableItemConfig, bMiniGame) == 0x000039, "Member 'FDataTableItemConfig::bMiniGame' has a wrong offset!");
static_assert(offsetof(FDataTableItemConfig, bWarnIfRowMissing) == 0x00003A, "Member 'FDataTableItemConfig::bWarnIfRowMissing' has a wrong offset!");

}

