#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameCameraAnimation

#include "Basic.hpp"


namespace SDK::Params
{

// Function GameCameraAnimation.GameCameraAnimMetaDataInfo.GetAnimationPathTotalTime
// 0x000C (0x000C - 0x0000)
struct GameCameraAnimMetaDataInfo_GetAnimationPathTotalTime final
{
public:
	int32                                         InStartCameraIndex;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InEndCameraIndex;                                  // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameCameraAnimMetaDataInfo_GetAnimationPathTotalTime) == 0x000004, "Wrong alignment on GameCameraAnimMetaDataInfo_GetAnimationPathTotalTime");
static_assert(sizeof(GameCameraAnimMetaDataInfo_GetAnimationPathTotalTime) == 0x00000C, "Wrong size on GameCameraAnimMetaDataInfo_GetAnimationPathTotalTime");
static_assert(offsetof(GameCameraAnimMetaDataInfo_GetAnimationPathTotalTime, InStartCameraIndex) == 0x000000, "Member 'GameCameraAnimMetaDataInfo_GetAnimationPathTotalTime::InStartCameraIndex' has a wrong offset!");
static_assert(offsetof(GameCameraAnimMetaDataInfo_GetAnimationPathTotalTime, InEndCameraIndex) == 0x000004, "Member 'GameCameraAnimMetaDataInfo_GetAnimationPathTotalTime::InEndCameraIndex' has a wrong offset!");
static_assert(offsetof(GameCameraAnimMetaDataInfo_GetAnimationPathTotalTime, ReturnValue) == 0x000008, "Member 'GameCameraAnimMetaDataInfo_GetAnimationPathTotalTime::ReturnValue' has a wrong offset!");

}

