#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameWebBrowser

#include "Basic.hpp"


namespace SDK::Params
{

// Function GameWebBrowser.GameWebBrowser.ExecuteJavascript
// 0x0010 (0x0010 - 0x0000)
struct GameWebBrowser_ExecuteJavascript final
{
public:
	class FString                                 ScriptText;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameWebBrowser_ExecuteJavascript) == 0x000008, "Wrong alignment on GameWebBrowser_ExecuteJavascript");
static_assert(sizeof(GameWebBrowser_ExecuteJavascript) == 0x000010, "Wrong size on GameWebBrowser_ExecuteJavascript");
static_assert(offsetof(GameWebBrowser_ExecuteJavascript, ScriptText) == 0x000000, "Member 'GameWebBrowser_ExecuteJavascript::ScriptText' has a wrong offset!");

// Function GameWebBrowser.GameWebBrowser.LoadString
// 0x0020 (0x0020 - 0x0000)
struct GameWebBrowser_LoadString final
{
public:
	class FString                                 Contents;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DummyURL;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameWebBrowser_LoadString) == 0x000008, "Wrong alignment on GameWebBrowser_LoadString");
static_assert(sizeof(GameWebBrowser_LoadString) == 0x000020, "Wrong size on GameWebBrowser_LoadString");
static_assert(offsetof(GameWebBrowser_LoadString, Contents) == 0x000000, "Member 'GameWebBrowser_LoadString::Contents' has a wrong offset!");
static_assert(offsetof(GameWebBrowser_LoadString, DummyURL) == 0x000010, "Member 'GameWebBrowser_LoadString::DummyURL' has a wrong offset!");

// Function GameWebBrowser.GameWebBrowser.LoadURL
// 0x0010 (0x0010 - 0x0000)
struct GameWebBrowser_LoadURL final
{
public:
	class FString                                 NewURL;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameWebBrowser_LoadURL) == 0x000008, "Wrong alignment on GameWebBrowser_LoadURL");
static_assert(sizeof(GameWebBrowser_LoadURL) == 0x000010, "Wrong size on GameWebBrowser_LoadURL");
static_assert(offsetof(GameWebBrowser_LoadURL, NewURL) == 0x000000, "Member 'GameWebBrowser_LoadURL::NewURL' has a wrong offset!");

// DelegateFunction GameWebBrowser.GameWebBrowser.OnBeforePopup__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct GameWebBrowser_OnBeforePopup__DelegateSignature final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Frame;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameWebBrowser_OnBeforePopup__DelegateSignature) == 0x000008, "Wrong alignment on GameWebBrowser_OnBeforePopup__DelegateSignature");
static_assert(sizeof(GameWebBrowser_OnBeforePopup__DelegateSignature) == 0x000020, "Wrong size on GameWebBrowser_OnBeforePopup__DelegateSignature");
static_assert(offsetof(GameWebBrowser_OnBeforePopup__DelegateSignature, URL) == 0x000000, "Member 'GameWebBrowser_OnBeforePopup__DelegateSignature::URL' has a wrong offset!");
static_assert(offsetof(GameWebBrowser_OnBeforePopup__DelegateSignature, Frame) == 0x000010, "Member 'GameWebBrowser_OnBeforePopup__DelegateSignature::Frame' has a wrong offset!");

// DelegateFunction GameWebBrowser.GameWebBrowser.OnCommunicateWithGame__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct GameWebBrowser_OnCommunicateWithGame__DelegateSignature final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameWebBrowser_OnCommunicateWithGame__DelegateSignature) == 0x000008, "Wrong alignment on GameWebBrowser_OnCommunicateWithGame__DelegateSignature");
static_assert(sizeof(GameWebBrowser_OnCommunicateWithGame__DelegateSignature) == 0x000010, "Wrong size on GameWebBrowser_OnCommunicateWithGame__DelegateSignature");
static_assert(offsetof(GameWebBrowser_OnCommunicateWithGame__DelegateSignature, URL) == 0x000000, "Member 'GameWebBrowser_OnCommunicateWithGame__DelegateSignature::URL' has a wrong offset!");

// DelegateFunction GameWebBrowser.GameWebBrowser.OnUrlChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct GameWebBrowser_OnUrlChanged__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameWebBrowser_OnUrlChanged__DelegateSignature) == 0x000008, "Wrong alignment on GameWebBrowser_OnUrlChanged__DelegateSignature");
static_assert(sizeof(GameWebBrowser_OnUrlChanged__DelegateSignature) == 0x000018, "Wrong size on GameWebBrowser_OnUrlChanged__DelegateSignature");
static_assert(offsetof(GameWebBrowser_OnUrlChanged__DelegateSignature, Text) == 0x000000, "Member 'GameWebBrowser_OnUrlChanged__DelegateSignature::Text' has a wrong offset!");

// Function GameWebBrowser.GameWebBrowser.GetTitleText
// 0x0018 (0x0018 - 0x0000)
struct GameWebBrowser_GetTitleText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameWebBrowser_GetTitleText) == 0x000008, "Wrong alignment on GameWebBrowser_GetTitleText");
static_assert(sizeof(GameWebBrowser_GetTitleText) == 0x000018, "Wrong size on GameWebBrowser_GetTitleText");
static_assert(offsetof(GameWebBrowser_GetTitleText, ReturnValue) == 0x000000, "Member 'GameWebBrowser_GetTitleText::ReturnValue' has a wrong offset!");

// Function GameWebBrowser.GameWebBrowser.GetUrl
// 0x0010 (0x0010 - 0x0000)
struct GameWebBrowser_GetUrl final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameWebBrowser_GetUrl) == 0x000008, "Wrong alignment on GameWebBrowser_GetUrl");
static_assert(sizeof(GameWebBrowser_GetUrl) == 0x000010, "Wrong size on GameWebBrowser_GetUrl");
static_assert(offsetof(GameWebBrowser_GetUrl, ReturnValue) == 0x000000, "Member 'GameWebBrowser_GetUrl::ReturnValue' has a wrong offset!");

}

