#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameCore

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function GameCore.DoTweenSystem.Kill
// 0x0008 (0x0008 - 0x0000)
struct DoTweenSystem_Kill final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InComplete;                                        // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DoTweenSystem_Kill) == 0x000004, "Wrong alignment on DoTweenSystem_Kill");
static_assert(sizeof(DoTweenSystem_Kill) == 0x000008, "Wrong size on DoTweenSystem_Kill");
static_assert(offsetof(DoTweenSystem_Kill, InId) == 0x000000, "Member 'DoTweenSystem_Kill::InId' has a wrong offset!");
static_assert(offsetof(DoTweenSystem_Kill, InComplete) == 0x000004, "Member 'DoTweenSystem_Kill::InComplete' has a wrong offset!");

// Function GameCore.DoTweenSystem.Play
// 0x0030 (0x0030 - 0x0000)
struct DoTweenSystem_Play final
{
public:
	EDoTweenType                                  InType;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveBase*                             InCurveId;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                InWidget;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ControlPoint;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InDuration;                                        // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Looptime;                                          // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Multiplier;                                        // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x002C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DoTweenSystem_Play) == 0x000008, "Wrong alignment on DoTweenSystem_Play");
static_assert(sizeof(DoTweenSystem_Play) == 0x000030, "Wrong size on DoTweenSystem_Play");
static_assert(offsetof(DoTweenSystem_Play, InType) == 0x000000, "Member 'DoTweenSystem_Play::InType' has a wrong offset!");
static_assert(offsetof(DoTweenSystem_Play, InCurveId) == 0x000008, "Member 'DoTweenSystem_Play::InCurveId' has a wrong offset!");
static_assert(offsetof(DoTweenSystem_Play, InWidget) == 0x000010, "Member 'DoTweenSystem_Play::InWidget' has a wrong offset!");
static_assert(offsetof(DoTweenSystem_Play, ControlPoint) == 0x000018, "Member 'DoTweenSystem_Play::ControlPoint' has a wrong offset!");
static_assert(offsetof(DoTweenSystem_Play, InDuration) == 0x000020, "Member 'DoTweenSystem_Play::InDuration' has a wrong offset!");
static_assert(offsetof(DoTweenSystem_Play, Looptime) == 0x000024, "Member 'DoTweenSystem_Play::Looptime' has a wrong offset!");
static_assert(offsetof(DoTweenSystem_Play, Multiplier) == 0x000028, "Member 'DoTweenSystem_Play::Multiplier' has a wrong offset!");
static_assert(offsetof(DoTweenSystem_Play, ReturnValue) == 0x00002C, "Member 'DoTweenSystem_Play::ReturnValue' has a wrong offset!");

// Function GameCore.GameCoreLibrary.DuplicateObject
// 0x0018 (0x0018 - 0x0000)
struct GameCoreLibrary_DuplicateObject final
{
public:
	class UObject*                                InSrcObject;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InNewOuter;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameCoreLibrary_DuplicateObject) == 0x000008, "Wrong alignment on GameCoreLibrary_DuplicateObject");
static_assert(sizeof(GameCoreLibrary_DuplicateObject) == 0x000018, "Wrong size on GameCoreLibrary_DuplicateObject");
static_assert(offsetof(GameCoreLibrary_DuplicateObject, InSrcObject) == 0x000000, "Member 'GameCoreLibrary_DuplicateObject::InSrcObject' has a wrong offset!");
static_assert(offsetof(GameCoreLibrary_DuplicateObject, InNewOuter) == 0x000008, "Member 'GameCoreLibrary_DuplicateObject::InNewOuter' has a wrong offset!");
static_assert(offsetof(GameCoreLibrary_DuplicateObject, ReturnValue) == 0x000010, "Member 'GameCoreLibrary_DuplicateObject::ReturnValue' has a wrong offset!");

// Function GameCore.GameCoreLibrary.ExploreFolder
// 0x0010 (0x0010 - 0x0000)
struct GameCoreLibrary_ExploreFolder final
{
public:
	class FString                                 InPath;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameCoreLibrary_ExploreFolder) == 0x000008, "Wrong alignment on GameCoreLibrary_ExploreFolder");
static_assert(sizeof(GameCoreLibrary_ExploreFolder) == 0x000010, "Wrong size on GameCoreLibrary_ExploreFolder");
static_assert(offsetof(GameCoreLibrary_ExploreFolder, InPath) == 0x000000, "Member 'GameCoreLibrary_ExploreFolder::InPath' has a wrong offset!");

// Function GameCore.GameCoreLibrary.GetAbsolutePosition
// 0x0040 (0x0040 - 0x0000)
struct GameCoreLibrary_GetAbsolutePosition final
{
public:
	struct FGeometry                              InGeometry;                                        // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameCoreLibrary_GetAbsolutePosition) == 0x000004, "Wrong alignment on GameCoreLibrary_GetAbsolutePosition");
static_assert(sizeof(GameCoreLibrary_GetAbsolutePosition) == 0x000040, "Wrong size on GameCoreLibrary_GetAbsolutePosition");
static_assert(offsetof(GameCoreLibrary_GetAbsolutePosition, InGeometry) == 0x000000, "Member 'GameCoreLibrary_GetAbsolutePosition::InGeometry' has a wrong offset!");
static_assert(offsetof(GameCoreLibrary_GetAbsolutePosition, ReturnValue) == 0x000038, "Member 'GameCoreLibrary_GetAbsolutePosition::ReturnValue' has a wrong offset!");

// Function GameCore.GameCoreLibrary.GetFixLang
// 0x0020 (0x0020 - 0x0000)
struct GameCoreLibrary_GetFixLang final
{
public:
	class FString                                 InLang;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameCoreLibrary_GetFixLang) == 0x000008, "Wrong alignment on GameCoreLibrary_GetFixLang");
static_assert(sizeof(GameCoreLibrary_GetFixLang) == 0x000020, "Wrong size on GameCoreLibrary_GetFixLang");
static_assert(offsetof(GameCoreLibrary_GetFixLang, InLang) == 0x000000, "Member 'GameCoreLibrary_GetFixLang::InLang' has a wrong offset!");
static_assert(offsetof(GameCoreLibrary_GetFixLang, ReturnValue) == 0x000010, "Member 'GameCoreLibrary_GetFixLang::ReturnValue' has a wrong offset!");

// Function GameCore.GameCoreLibrary.GetGameInstanceIndex
// 0x0004 (0x0004 - 0x0000)
struct GameCoreLibrary_GetGameInstanceIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameCoreLibrary_GetGameInstanceIndex) == 0x000004, "Wrong alignment on GameCoreLibrary_GetGameInstanceIndex");
static_assert(sizeof(GameCoreLibrary_GetGameInstanceIndex) == 0x000004, "Wrong size on GameCoreLibrary_GetGameInstanceIndex");
static_assert(offsetof(GameCoreLibrary_GetGameInstanceIndex, ReturnValue) == 0x000000, "Member 'GameCoreLibrary_GetGameInstanceIndex::ReturnValue' has a wrong offset!");

// Function GameCore.GameCoreLibrary.GetLocalIpAddress
// 0x0010 (0x0010 - 0x0000)
struct GameCoreLibrary_GetLocalIpAddress final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameCoreLibrary_GetLocalIpAddress) == 0x000008, "Wrong alignment on GameCoreLibrary_GetLocalIpAddress");
static_assert(sizeof(GameCoreLibrary_GetLocalIpAddress) == 0x000010, "Wrong size on GameCoreLibrary_GetLocalIpAddress");
static_assert(offsetof(GameCoreLibrary_GetLocalIpAddress, ReturnValue) == 0x000000, "Member 'GameCoreLibrary_GetLocalIpAddress::ReturnValue' has a wrong offset!");

// Function GameCore.GameCoreLibrary.GetRealTimeDelta
// 0x0010 (0x0010 - 0x0000)
struct GameCoreLibrary_GetRealTimeDelta final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InDeltaTime;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameCoreLibrary_GetRealTimeDelta) == 0x000008, "Wrong alignment on GameCoreLibrary_GetRealTimeDelta");
static_assert(sizeof(GameCoreLibrary_GetRealTimeDelta) == 0x000010, "Wrong size on GameCoreLibrary_GetRealTimeDelta");
static_assert(offsetof(GameCoreLibrary_GetRealTimeDelta, WorldContextObject) == 0x000000, "Member 'GameCoreLibrary_GetRealTimeDelta::WorldContextObject' has a wrong offset!");
static_assert(offsetof(GameCoreLibrary_GetRealTimeDelta, InDeltaTime) == 0x000008, "Member 'GameCoreLibrary_GetRealTimeDelta::InDeltaTime' has a wrong offset!");
static_assert(offsetof(GameCoreLibrary_GetRealTimeDelta, ReturnValue) == 0x00000C, "Member 'GameCoreLibrary_GetRealTimeDelta::ReturnValue' has a wrong offset!");

// Function GameCore.GameCoreLibrary.LoadUClass
// 0x0020 (0x0020 - 0x0000)
struct GameCoreLibrary_LoadUClass final
{
public:
	struct FSoftClassPath                         InPath;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameCoreLibrary_LoadUClass) == 0x000008, "Wrong alignment on GameCoreLibrary_LoadUClass");
static_assert(sizeof(GameCoreLibrary_LoadUClass) == 0x000020, "Wrong size on GameCoreLibrary_LoadUClass");
static_assert(offsetof(GameCoreLibrary_LoadUClass, InPath) == 0x000000, "Member 'GameCoreLibrary_LoadUClass::InPath' has a wrong offset!");
static_assert(offsetof(GameCoreLibrary_LoadUClass, ReturnValue) == 0x000018, "Member 'GameCoreLibrary_LoadUClass::ReturnValue' has a wrong offset!");

// Function GameCore.GameCoreLibrary.LoadUClassByPath
// 0x0018 (0x0018 - 0x0000)
struct GameCoreLibrary_LoadUClassByPath final
{
public:
	class FString                                 InPath;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameCoreLibrary_LoadUClassByPath) == 0x000008, "Wrong alignment on GameCoreLibrary_LoadUClassByPath");
static_assert(sizeof(GameCoreLibrary_LoadUClassByPath) == 0x000018, "Wrong size on GameCoreLibrary_LoadUClassByPath");
static_assert(offsetof(GameCoreLibrary_LoadUClassByPath, InPath) == 0x000000, "Member 'GameCoreLibrary_LoadUClassByPath::InPath' has a wrong offset!");
static_assert(offsetof(GameCoreLibrary_LoadUClassByPath, ReturnValue) == 0x000010, "Member 'GameCoreLibrary_LoadUClassByPath::ReturnValue' has a wrong offset!");

// Function GameCore.GameCoreLibrary.LoadUI
// 0x0020 (0x0020 - 0x0000)
struct GameCoreLibrary_LoadUI final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InPath;                                            // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   WidgetName;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            ReturnValue;                                       // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameCoreLibrary_LoadUI) == 0x000008, "Wrong alignment on GameCoreLibrary_LoadUI");
static_assert(sizeof(GameCoreLibrary_LoadUI) == 0x000020, "Wrong size on GameCoreLibrary_LoadUI");
static_assert(offsetof(GameCoreLibrary_LoadUI, WorldContextObject) == 0x000000, "Member 'GameCoreLibrary_LoadUI::WorldContextObject' has a wrong offset!");
static_assert(offsetof(GameCoreLibrary_LoadUI, InPath) == 0x000008, "Member 'GameCoreLibrary_LoadUI::InPath' has a wrong offset!");
static_assert(offsetof(GameCoreLibrary_LoadUI, WidgetName) == 0x000010, "Member 'GameCoreLibrary_LoadUI::WidgetName' has a wrong offset!");
static_assert(offsetof(GameCoreLibrary_LoadUI, ReturnValue) == 0x000018, "Member 'GameCoreLibrary_LoadUI::ReturnValue' has a wrong offset!");

// Function GameCore.GameCoreLibrary.LoadUObject
// 0x0020 (0x0020 - 0x0000)
struct GameCoreLibrary_LoadUObject final
{
public:
	struct FSoftObjectPath                        InPath;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameCoreLibrary_LoadUObject) == 0x000008, "Wrong alignment on GameCoreLibrary_LoadUObject");
static_assert(sizeof(GameCoreLibrary_LoadUObject) == 0x000020, "Wrong size on GameCoreLibrary_LoadUObject");
static_assert(offsetof(GameCoreLibrary_LoadUObject, InPath) == 0x000000, "Member 'GameCoreLibrary_LoadUObject::InPath' has a wrong offset!");
static_assert(offsetof(GameCoreLibrary_LoadUObject, ReturnValue) == 0x000018, "Member 'GameCoreLibrary_LoadUObject::ReturnValue' has a wrong offset!");

// Function GameCore.GameCoreLibrary.LoadUObjectByPath
// 0x0018 (0x0018 - 0x0000)
struct GameCoreLibrary_LoadUObjectByPath final
{
public:
	class FString                                 InPath;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameCoreLibrary_LoadUObjectByPath) == 0x000008, "Wrong alignment on GameCoreLibrary_LoadUObjectByPath");
static_assert(sizeof(GameCoreLibrary_LoadUObjectByPath) == 0x000018, "Wrong size on GameCoreLibrary_LoadUObjectByPath");
static_assert(offsetof(GameCoreLibrary_LoadUObjectByPath, InPath) == 0x000000, "Member 'GameCoreLibrary_LoadUObjectByPath::InPath' has a wrong offset!");
static_assert(offsetof(GameCoreLibrary_LoadUObjectByPath, ReturnValue) == 0x000010, "Member 'GameCoreLibrary_LoadUObjectByPath::ReturnValue' has a wrong offset!");

// Function GameCore.GameCoreLibrary.ProcessLangText
// 0x0030 (0x0030 - 0x0000)
struct GameCoreLibrary_ProcessLangText final
{
public:
	class FString                                 InContent;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InPlayerName;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameCoreLibrary_ProcessLangText) == 0x000008, "Wrong alignment on GameCoreLibrary_ProcessLangText");
static_assert(sizeof(GameCoreLibrary_ProcessLangText) == 0x000030, "Wrong size on GameCoreLibrary_ProcessLangText");
static_assert(offsetof(GameCoreLibrary_ProcessLangText, InContent) == 0x000000, "Member 'GameCoreLibrary_ProcessLangText::InContent' has a wrong offset!");
static_assert(offsetof(GameCoreLibrary_ProcessLangText, InPlayerName) == 0x000010, "Member 'GameCoreLibrary_ProcessLangText::InPlayerName' has a wrong offset!");
static_assert(offsetof(GameCoreLibrary_ProcessLangText, ReturnValue) == 0x000020, "Member 'GameCoreLibrary_ProcessLangText::ReturnValue' has a wrong offset!");

// Function GameCore.GameCoreLibrary.RoleToString
// 0x0018 (0x0018 - 0x0000)
struct GameCoreLibrary_RoleToString final
{
public:
	ENetRole                                      InRole;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameCoreLibrary_RoleToString) == 0x000008, "Wrong alignment on GameCoreLibrary_RoleToString");
static_assert(sizeof(GameCoreLibrary_RoleToString) == 0x000018, "Wrong size on GameCoreLibrary_RoleToString");
static_assert(offsetof(GameCoreLibrary_RoleToString, InRole) == 0x000000, "Member 'GameCoreLibrary_RoleToString::InRole' has a wrong offset!");
static_assert(offsetof(GameCoreLibrary_RoleToString, ReturnValue) == 0x000008, "Member 'GameCoreLibrary_RoleToString::ReturnValue' has a wrong offset!");

// Function GameCore.GameCoreLibrary.String2LinearColor
// 0x0020 (0x0020 - 0x0000)
struct GameCoreLibrary_String2LinearColor final
{
public:
	class FString                                 InColor;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameCoreLibrary_String2LinearColor) == 0x000008, "Wrong alignment on GameCoreLibrary_String2LinearColor");
static_assert(sizeof(GameCoreLibrary_String2LinearColor) == 0x000020, "Wrong size on GameCoreLibrary_String2LinearColor");
static_assert(offsetof(GameCoreLibrary_String2LinearColor, InColor) == 0x000000, "Member 'GameCoreLibrary_String2LinearColor::InColor' has a wrong offset!");
static_assert(offsetof(GameCoreLibrary_String2LinearColor, ReturnValue) == 0x000010, "Member 'GameCoreLibrary_String2LinearColor::ReturnValue' has a wrong offset!");

// Function GameCore.GameCoreSystem.Get
// 0x0010 (0x0010 - 0x0000)
struct GameCoreSystem_Get final
{
public:
	class UObject*                                InWorldContext;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameCoreSystem*                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameCoreSystem_Get) == 0x000008, "Wrong alignment on GameCoreSystem_Get");
static_assert(sizeof(GameCoreSystem_Get) == 0x000010, "Wrong size on GameCoreSystem_Get");
static_assert(offsetof(GameCoreSystem_Get, InWorldContext) == 0x000000, "Member 'GameCoreSystem_Get::InWorldContext' has a wrong offset!");
static_assert(offsetof(GameCoreSystem_Get, ReturnValue) == 0x000008, "Member 'GameCoreSystem_Get::ReturnValue' has a wrong offset!");

// Function GameCore.GameCoreSystem.GetLastInputType
// 0x0001 (0x0001 - 0x0000)
struct GameCoreSystem_GetLastInputType final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameCoreSystem_GetLastInputType) == 0x000001, "Wrong alignment on GameCoreSystem_GetLastInputType");
static_assert(sizeof(GameCoreSystem_GetLastInputType) == 0x000001, "Wrong size on GameCoreSystem_GetLastInputType");
static_assert(offsetof(GameCoreSystem_GetLastInputType, ReturnValue) == 0x000000, "Member 'GameCoreSystem_GetLastInputType::ReturnValue' has a wrong offset!");

// Function GameCore.GameCoreSystem.SwitchDeviceEventNotice
// 0x0001 (0x0001 - 0x0000)
struct GameCoreSystem_SwitchDeviceEventNotice final
{
public:
	bool                                          InOpen;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameCoreSystem_SwitchDeviceEventNotice) == 0x000001, "Wrong alignment on GameCoreSystem_SwitchDeviceEventNotice");
static_assert(sizeof(GameCoreSystem_SwitchDeviceEventNotice) == 0x000001, "Wrong size on GameCoreSystem_SwitchDeviceEventNotice");
static_assert(offsetof(GameCoreSystem_SwitchDeviceEventNotice, InOpen) == 0x000000, "Member 'GameCoreSystem_SwitchDeviceEventNotice::InOpen' has a wrong offset!");

// Function GameCore.GameCoreWidget.ListenForInputActionIgnorePause
// 0x001C (0x001C - 0x0000)
struct GameCoreWidget_ListenForInputActionIgnorePause final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   EventType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConsume;                                          // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             Callback;                                          // 0x000C(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameCoreWidget_ListenForInputActionIgnorePause) == 0x000004, "Wrong alignment on GameCoreWidget_ListenForInputActionIgnorePause");
static_assert(sizeof(GameCoreWidget_ListenForInputActionIgnorePause) == 0x00001C, "Wrong size on GameCoreWidget_ListenForInputActionIgnorePause");
static_assert(offsetof(GameCoreWidget_ListenForInputActionIgnorePause, ActionName) == 0x000000, "Member 'GameCoreWidget_ListenForInputActionIgnorePause::ActionName' has a wrong offset!");
static_assert(offsetof(GameCoreWidget_ListenForInputActionIgnorePause, EventType) == 0x000008, "Member 'GameCoreWidget_ListenForInputActionIgnorePause::EventType' has a wrong offset!");
static_assert(offsetof(GameCoreWidget_ListenForInputActionIgnorePause, bConsume) == 0x000009, "Member 'GameCoreWidget_ListenForInputActionIgnorePause::bConsume' has a wrong offset!");
static_assert(offsetof(GameCoreWidget_ListenForInputActionIgnorePause, Callback) == 0x00000C, "Member 'GameCoreWidget_ListenForInputActionIgnorePause::Callback' has a wrong offset!");

// Function GameCore.GameCoreWidget.PalyAnimByName
// 0x0010 (0x0010 - 0x0000)
struct GameCoreWidget_PalyAnimByName final
{
public:
	class FString                                 InName;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameCoreWidget_PalyAnimByName) == 0x000008, "Wrong alignment on GameCoreWidget_PalyAnimByName");
static_assert(sizeof(GameCoreWidget_PalyAnimByName) == 0x000010, "Wrong size on GameCoreWidget_PalyAnimByName");
static_assert(offsetof(GameCoreWidget_PalyAnimByName, InName) == 0x000000, "Member 'GameCoreWidget_PalyAnimByName::InName' has a wrong offset!");

}

