#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameEx

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum GameEx.GECurveChangeType
// NumValues: 0x000A
enum class EGECurveChangeType : uint8
{
	X                                        = 0,
	Y                                        = 1,
	Z                                        = 2,
	Pitch                                    = 3,
	Yaw                                      = 4,
	Roll                                     = 5,
	ScaleX                                   = 6,
	ScaleY                                   = 7,
	ScaleZ                                   = 8,
	GECurveChangeType_MAX                    = 9,
};

// Enum GameEx.ECheckTraceType
// NumValues: 0x0003
enum class ECheckTraceType : uint8
{
	ObjectChannel                            = 0,
	ObjectType                               = 1,
	ECheckTraceType_MAX                      = 2,
};

// Enum GameEx.EGECampRelation
// NumValues: 0x0005
enum class EGECampRelation : uint8
{
	Self                                     = 0,
	Friendly                                 = 2,
	Enermy                                   = 22,
	None                                     = 50,
	EGECampRelation_MAX                      = 51,
};

// Enum GameEx.EGEAttributeAttachType
// NumValues: 0x0003
enum class EGEAttributeAttachType : uint8
{
	Charater                                 = 0,
	Weapon                                   = 1,
	EGEAttributeAttachType_MAX               = 2,
};

// Enum GameEx.EGEAttributeValueType
// NumValues: 0x0004
enum class EGEAttributeValueType : uint8
{
	Numerical                                = 0,
	Percentage                               = 1,
	Multiply                                 = 2,
	EGEAttributeValueType_MAX                = 3,
};

// Enum GameEx.EGEAbilityForceFeedbackType
// NumValues: 0x0003
enum class EGEAbilityForceFeedbackType : uint8
{
	None                                     = 0,
	Weapon                                   = 1,
	EGEAbilityForceFeedbackType_MAX          = 2,
};

// Enum GameEx.EGEBulletMovementType
// NumValues: 0x0006
enum class EGEBulletMovementType : uint8
{
	Naturally                                = 0,
	Parabola                                 = 1,
	AimLocation                              = 2,
	AimTarget                                = 3,
	Bomb                                     = 4,
	EGEBulletMovementType_MAX                = 5,
};

// Enum GameEx.EGEBulletWorkType
// NumValues: 0x0005
enum class EGEBulletWorkType : uint8
{
	None                                     = 0,
	EntityBullet                             = 1,
	RayBullet                                = 2,
	KeepRayBullet                            = 3,
	EGEBulletWorkType_MAX                    = 4,
};

// Enum GameEx.EGEBulletHitType
// NumValues: 0x0003
enum class EGEBulletHitType : uint8
{
	EntityBullet                             = 0,
	RayBullet                                = 1,
	EGEBulletHitType_MAX                     = 2,
};

// Enum GameEx.EGEWeaponFireMode
// NumValues: 0x0007
enum class EGEWeaponFireMode : uint8
{
	Normal                                   = 0,
	Single                                   = 1,
	Continuity                               = 2,
	AimFire                                  = 3,
	ShootFire                                = 4,
	Max_FireMode                             = 5,
	EGEWeaponFireMode_MAX                    = 6,
};

// Enum GameEx.EGEWeaponType
// NumValues: 0x0006
enum class EGEWeaponType : uint8
{
	None                                     = 0,
	SubmachineGun                            = 1,
	ShotGun                                  = 2,
	Hotwizer                                 = 3,
	ZBugMelle                                = 4,
	EGEWeaponType_MAX                        = 5,
};

// Enum GameEx.EGEWeaponBulletShootType
// NumValues: 0x0004
enum class EGEWeaponBulletShootType : uint8
{
	NotUse                                   = 0,
	UseDistance                              = 1,
	FullUse                                  = 2,
	EGEWeaponBulletShootType_MAX             = 3,
};

// Enum GameEx.EGEBuffAttachType
// NumValues: 0x0003
enum class EGEBuffAttachType : uint8
{
	Char                                     = 0,
	Weapon                                   = 1,
	EGEBuffAttachType_MAX                    = 2,
};

// Enum GameEx.EGEBuffTeamType
// NumValues: 0x0005
enum class EGEBuffTeamType : uint8
{
	Normal                                   = 0,
	ZBug                                     = 1,
	People                                   = 2,
	Hero                                     = 3,
	EGEBuffTeamType_MAX                      = 4,
};

// Enum GameEx.EGEAttributeType
// NumValues: 0x0003
enum class EGEAttributeType : uint8
{
	HealthBase                               = 0,
	AttackBase                               = 1,
	EGEAttributeType_MAX                     = 2,
};

// Enum GameEx.EGEZBugRunBugType
// NumValues: 0x0007
enum class EGEZBugRunBugType : uint8
{
	None                                     = 0,
	Invisible                                = 1,
	Tank                                     = 2,
	Furious                                  = 3,
	Cure                                     = 4,
	Origin                                   = 5,
	EGEZBugRunBugType_MAX                    = 6,
};

// Enum GameEx.EGEZBugRunTeamType
// NumValues: 0x0004
enum class EGEZBugRunTeamType : uint8
{
	None                                     = 0,
	ZBug                                     = 1,
	People                                   = 2,
	EGEZBugRunTeamType_MAX                   = 3,
};

// Enum GameEx.EGEHASTeamType
// NumValues: 0x0004
enum class EGEHASTeamType : uint8
{
	None                                     = 0,
	Catch                                    = 1,
	Hide                                     = 2,
	EGEHASTeamType_MAX                       = 3,
};

// Enum GameEx.EGELevelType
// NumValues: 0x0007
enum class EGELevelType : uint8
{
	None                                     = 0,
	Racing                                   = 1,
	Survive                                  = 2,
	Score                                    = 3,
	HideAndSeek                              = 4,
	ZBugRun                                  = 5,
	EGELevelType_MAX                         = 6,
};

// Enum GameEx.EWaterParkCharState
// NumValues: 0x000F
enum class EWaterParkCharState : uint8
{
	Normal                                   = 0,
	Walk                                     = 1,
	Jump                                     = 2,
	JumpSecond                               = 3,
	JumpEnd                                  = 4,
	HitFly                                   = 5,
	HitFlyEnd                                = 6,
	HitBack                                  = 7,
	Falling                                  = 8,
	Pounce                                   = 9,
	NormalStateCheck                         = 10,
	PounceUp                                 = 11,
	Slide                                    = 12,
	SlideEnd                                 = 13,
	EWaterParkCharState_MAX                  = 14,
};

// Enum GameEx.EGEBombState
// NumValues: 0x0008
enum class EGEBombState : uint8
{
	None                                     = 0,
	InPool                                   = 1,
	InScene                                  = 2,
	Catched                                  = 3,
	Throwed_Spline                           = 4,
	FreeMove                                 = 5,
	Boom                                     = 6,
	EGEBombState_MAX                         = 7,
};

// Enum GameEx.EWPClientGameTimeUpdateMode
// NumValues: 0x0004
enum class EWPClientGameTimeUpdateMode : uint8
{
	UpdatePerValidRTT                        = 0,
	UpdateOnlySmallerRTT                     = 1,
	UpdateOnlyDelay                          = 2,
	EWPClientGameTimeUpdateMode_MAX          = 3,
};

// Enum GameEx.EGEBrickRotateType
// NumValues: 0x0004
enum class EGEBrickRotateType : uint8
{
	Pitch                                    = 0,
	Yaw                                      = 1,
	Roll                                     = 2,
	EGEBrickRotateType_MAX                   = 3,
};

// Enum GameEx.EGERotateBrickState
// NumValues: 0x0004
enum class EGERotateBrickState : uint8
{
	Normal                                   = 0,
	ReadyToRotate                            = 1,
	Rotating                                 = 2,
	EGERotateBrickState_MAX                  = 3,
};

// Enum GameEx.EGESideBySideType
// NumValues: 0x0002
enum class EGESideBySideType : uint8
{
	CurveMoveRandom                          = 0,
	EGESideBySideType_MAX                    = 1,
};

// Enum GameEx.EGEZBug_RecoilState
// NumValues: 0x0005
enum class EGEZBug_RecoilState : uint8
{
	RecoilIdle                               = 0,
	RecoilFire                               = 1,
	RecoilSteady                             = 2,
	RecoilRecovery                           = 3,
	EGEZBug_MAX                              = 4,
};

// Enum GameEx.EAddCharSpeedType
// NumValues: 0x0004
enum class EAddCharSpeedType : uint8
{
	Value                                    = 0,
	Percent                                  = 1,
	UseBBPer                                 = 2,
	EAddCharSpeedType_MAX                    = 3,
};

// Enum GameEx.EWPModifySkillType
// NumValues: 0x0003
enum class EWPModifySkillType : uint8
{
	ReduceCD                                 = 0,
	AddStoreCount                            = 1,
	EWPModifySkillType_MAX                   = 2,
};

// ScriptStruct GameEx.GEWeaponAttributeTemplate
// 0x0034 (0x0034 - 0x0000)
struct FGEWeaponAttributeTemplate final
{
public:
	float                                         WeaponAttack;                                      // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CRTValue;                                          // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CRTDamage;                                         // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShootSpeed;                                        // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MagazineCapacity;                                  // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReloadSpeed;                                       // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WeaponFitRate;                                     // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StandardShootRange;                                // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReduceDmgFactor;                                   // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReduceShootRange;                                  // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtremeDmgFactor;                                  // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtremeShootRange;                                 // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MeleeAtkRange;                                     // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGEWeaponAttributeTemplate) == 0x000004, "Wrong alignment on FGEWeaponAttributeTemplate");
static_assert(sizeof(FGEWeaponAttributeTemplate) == 0x000034, "Wrong size on FGEWeaponAttributeTemplate");
static_assert(offsetof(FGEWeaponAttributeTemplate, WeaponAttack) == 0x000000, "Member 'FGEWeaponAttributeTemplate::WeaponAttack' has a wrong offset!");
static_assert(offsetof(FGEWeaponAttributeTemplate, CRTValue) == 0x000004, "Member 'FGEWeaponAttributeTemplate::CRTValue' has a wrong offset!");
static_assert(offsetof(FGEWeaponAttributeTemplate, CRTDamage) == 0x000008, "Member 'FGEWeaponAttributeTemplate::CRTDamage' has a wrong offset!");
static_assert(offsetof(FGEWeaponAttributeTemplate, ShootSpeed) == 0x00000C, "Member 'FGEWeaponAttributeTemplate::ShootSpeed' has a wrong offset!");
static_assert(offsetof(FGEWeaponAttributeTemplate, MagazineCapacity) == 0x000010, "Member 'FGEWeaponAttributeTemplate::MagazineCapacity' has a wrong offset!");
static_assert(offsetof(FGEWeaponAttributeTemplate, ReloadSpeed) == 0x000014, "Member 'FGEWeaponAttributeTemplate::ReloadSpeed' has a wrong offset!");
static_assert(offsetof(FGEWeaponAttributeTemplate, WeaponFitRate) == 0x000018, "Member 'FGEWeaponAttributeTemplate::WeaponFitRate' has a wrong offset!");
static_assert(offsetof(FGEWeaponAttributeTemplate, StandardShootRange) == 0x00001C, "Member 'FGEWeaponAttributeTemplate::StandardShootRange' has a wrong offset!");
static_assert(offsetof(FGEWeaponAttributeTemplate, ReduceDmgFactor) == 0x000020, "Member 'FGEWeaponAttributeTemplate::ReduceDmgFactor' has a wrong offset!");
static_assert(offsetof(FGEWeaponAttributeTemplate, ReduceShootRange) == 0x000024, "Member 'FGEWeaponAttributeTemplate::ReduceShootRange' has a wrong offset!");
static_assert(offsetof(FGEWeaponAttributeTemplate, ExtremeDmgFactor) == 0x000028, "Member 'FGEWeaponAttributeTemplate::ExtremeDmgFactor' has a wrong offset!");
static_assert(offsetof(FGEWeaponAttributeTemplate, ExtremeShootRange) == 0x00002C, "Member 'FGEWeaponAttributeTemplate::ExtremeShootRange' has a wrong offset!");
static_assert(offsetof(FGEWeaponAttributeTemplate, MeleeAtkRange) == 0x000030, "Member 'FGEWeaponAttributeTemplate::MeleeAtkRange' has a wrong offset!");

// ScriptStruct GameEx.GECharLevelAttributeTemplate
// 0x0024 (0x0024 - 0x0000)
struct FGECharLevelAttributeTemplate final
{
public:
	float                                         Health;                                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Attack;                                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Defence;                                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CRTValue;                                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CRTDamage;                                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NextLevelExp;                                      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxScatterRatio;                                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShootAddScatterRatio;                              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RecoverScatterSpeedRatio;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGECharLevelAttributeTemplate) == 0x000004, "Wrong alignment on FGECharLevelAttributeTemplate");
static_assert(sizeof(FGECharLevelAttributeTemplate) == 0x000024, "Wrong size on FGECharLevelAttributeTemplate");
static_assert(offsetof(FGECharLevelAttributeTemplate, Health) == 0x000000, "Member 'FGECharLevelAttributeTemplate::Health' has a wrong offset!");
static_assert(offsetof(FGECharLevelAttributeTemplate, Attack) == 0x000004, "Member 'FGECharLevelAttributeTemplate::Attack' has a wrong offset!");
static_assert(offsetof(FGECharLevelAttributeTemplate, Defence) == 0x000008, "Member 'FGECharLevelAttributeTemplate::Defence' has a wrong offset!");
static_assert(offsetof(FGECharLevelAttributeTemplate, CRTValue) == 0x00000C, "Member 'FGECharLevelAttributeTemplate::CRTValue' has a wrong offset!");
static_assert(offsetof(FGECharLevelAttributeTemplate, CRTDamage) == 0x000010, "Member 'FGECharLevelAttributeTemplate::CRTDamage' has a wrong offset!");
static_assert(offsetof(FGECharLevelAttributeTemplate, NextLevelExp) == 0x000014, "Member 'FGECharLevelAttributeTemplate::NextLevelExp' has a wrong offset!");
static_assert(offsetof(FGECharLevelAttributeTemplate, MaxScatterRatio) == 0x000018, "Member 'FGECharLevelAttributeTemplate::MaxScatterRatio' has a wrong offset!");
static_assert(offsetof(FGECharLevelAttributeTemplate, ShootAddScatterRatio) == 0x00001C, "Member 'FGECharLevelAttributeTemplate::ShootAddScatterRatio' has a wrong offset!");
static_assert(offsetof(FGECharLevelAttributeTemplate, RecoverScatterSpeedRatio) == 0x000020, "Member 'FGECharLevelAttributeTemplate::RecoverScatterSpeedRatio' has a wrong offset!");

// ScriptStruct GameEx.GECharLevelAttributeTemplateKey
// 0x0008 (0x0008 - 0x0000)
struct FGECharLevelAttributeTemplateKey final
{
public:
	int32                                         TemplateId;                                        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Level;                                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGECharLevelAttributeTemplateKey) == 0x000004, "Wrong alignment on FGECharLevelAttributeTemplateKey");
static_assert(sizeof(FGECharLevelAttributeTemplateKey) == 0x000008, "Wrong size on FGECharLevelAttributeTemplateKey");
static_assert(offsetof(FGECharLevelAttributeTemplateKey, TemplateId) == 0x000000, "Member 'FGECharLevelAttributeTemplateKey::TemplateId' has a wrong offset!");
static_assert(offsetof(FGECharLevelAttributeTemplateKey, Level) == 0x000004, "Member 'FGECharLevelAttributeTemplateKey::Level' has a wrong offset!");

// ScriptStruct GameEx.GEAbilityAttribute
// 0x0030 (0x0030 - 0x0000)
struct FGEAbilityAttribute final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AttrGroup;                                         // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReplicated;                                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LimitMaxValue;                                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGEAttributeAttachType                        AttachType;                                        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGEAttributeValueType                         ValueType;                                         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGEAbilityAttribute) == 0x000008, "Wrong alignment on FGEAbilityAttribute");
static_assert(sizeof(FGEAbilityAttribute) == 0x000030, "Wrong size on FGEAbilityAttribute");
static_assert(offsetof(FGEAbilityAttribute, Name) == 0x000000, "Member 'FGEAbilityAttribute::Name' has a wrong offset!");
static_assert(offsetof(FGEAbilityAttribute, AttrGroup) == 0x000010, "Member 'FGEAbilityAttribute::AttrGroup' has a wrong offset!");
static_assert(offsetof(FGEAbilityAttribute, bReplicated) == 0x000020, "Member 'FGEAbilityAttribute::bReplicated' has a wrong offset!");
static_assert(offsetof(FGEAbilityAttribute, LimitMaxValue) == 0x000024, "Member 'FGEAbilityAttribute::LimitMaxValue' has a wrong offset!");
static_assert(offsetof(FGEAbilityAttribute, AttachType) == 0x000028, "Member 'FGEAbilityAttribute::AttachType' has a wrong offset!");
static_assert(offsetof(FGEAbilityAttribute, ValueType) == 0x000029, "Member 'FGEAbilityAttribute::ValueType' has a wrong offset!");

// ScriptStruct GameEx.WaterParkAIModifyInfo
// 0x0002 (0x0002 - 0x0000)
struct FWaterParkAIModifyInfo final
{
public:
	uint8                                         Pad_0[0x2];                                        // 0x0000(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FWaterParkAIModifyInfo) == 0x000001, "Wrong alignment on FWaterParkAIModifyInfo");
static_assert(sizeof(FWaterParkAIModifyInfo) == 0x000002, "Wrong size on FWaterParkAIModifyInfo");

// ScriptStruct GameEx.GEBulletInfo
// 0x0298 (0x02A0 - 0x0008)
struct FGEBulletInfo final : public FTableRowBase
{
public:
	int32                                         ID;                                                // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         BulletClass;                                       // 0x0010(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EmitterID;                                         // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGEBulletHitType                              HitEffectType;                                     // 0x002C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGEBulletWorkType                             SpawnType;                                         // 0x002D(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Scale;                                             // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SphereCollisionRadius;                             // 0x0034(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BombCollisionRadius;                               // 0x0038(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AbilityCollisionRadius;                            // 0x003C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitialSpeed;                                      // 0x0040(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Acceleration;                                      // 0x0044(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            AccelerationCurve;                                 // 0x0048(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationInterp;                                    // 0x0050(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GravityScale;                                      // 0x0054(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            GravityScaleCurve;                                 // 0x0058(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGEBulletMovementType                         MovementType;                                      // 0x0060(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Frequency;                                         // 0x0064(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FrequencyRange;                                    // 0x0068(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LifeTime;                                          // 0x006C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BulletExtremeRange;                                // 0x0070(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EGELevelType, int32>                     IgnoreCollToTeam;                                  // 0x0078(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          HitDie;                                            // 0x00C8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SameTargetMaxNum;                                  // 0x00CC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxTargetNum;                                      // 0x00D0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          WillBoomWhenDead;                                  // 0x00D4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BombEffectID;                                      // 0x00D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             BulletChannel;                                     // 0x00DC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        BulletRayPath;                                     // 0x00E0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BulletRayParamName;                                // 0x00F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              BulletRayParam;                                    // 0x0100(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              BulletRayPlayPre;                                  // 0x0108(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBulletRayDestroyImmediately;                      // 0x0110(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        StopFireParticlePath;                              // 0x0118(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMultiTrace;                                       // 0x0130(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              TraceShape;                                        // 0x0134(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WidthTraceNum;                                     // 0x013C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WidthHeightNum;                                    // 0x0140(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HitStrength;                                       // 0x0144(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableCurveHitReaction;                           // 0x0148(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHitShakeEffectSelfOnly;                           // 0x0149(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         CameraShakeClassPath;                              // 0x0150(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShakeMaxValidDistance;                             // 0x0168(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttenuation;                                      // 0x016C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         HitAbilityTargetShake_NoAimPath;                   // 0x0170(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         HitAbilityTargetShake_InAimPath;                   // 0x0188(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HitEffectID;                                       // 0x01A0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HitEffectNotPlayInTime;                            // 0x01A4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              HitEffectPlayPre;                                  // 0x01A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HitWeaknessEffectNotPlayInTime;                    // 0x01B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              HitWeaknessEffectPlayPre;                          // 0x01B4(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseHitEffectTable;                                // 0x01BC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHitEffectComposite;                               // 0x01BD(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1BE[0x2];                                      // 0x01BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        HitEffectParticlePath;                             // 0x01C0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHitEffectAttach;                                  // 0x01D8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHitEffectFollowBulletRotation;                    // 0x01D9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1DA[0x2];                                      // 0x01DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxParticleCount;                                  // 0x01DC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FreeTime;                                          // 0x01E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E4[0xC];                                      // 0x01E4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             HitEffectRelativeTransform;                        // 0x01F0(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 HitCharEffectSoundEvent;                           // 0x0220(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HitWorldEffectSoundEvent;                          // 0x0230(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 SubSkillIDs;                                       // 0x0240(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         CastRange;                                         // 0x0250(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETraceTypeQuery                               ActorTraceChannel;                                 // 0x0254(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BombDamageType;                                    // 0x0258(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BombEmitterID;                                     // 0x025C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBulletDirectHitAsBomb;                            // 0x0260(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TailBeamParticleParamName;                         // 0x0264(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              TailBeamParticleParam;                             // 0x026C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        TailParticlePath;                                  // 0x0278(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              TailParticlePlayPre;                               // 0x0290(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ZBug_SlowSpeedDur;                                 // 0x0298(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ZBug_SlowSpeedPer;                                 // 0x029C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGEBulletInfo) == 0x000010, "Wrong alignment on FGEBulletInfo");
static_assert(sizeof(FGEBulletInfo) == 0x0002A0, "Wrong size on FGEBulletInfo");
static_assert(offsetof(FGEBulletInfo, ID) == 0x000008, "Member 'FGEBulletInfo::ID' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, BulletClass) == 0x000010, "Member 'FGEBulletInfo::BulletClass' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, EmitterID) == 0x000028, "Member 'FGEBulletInfo::EmitterID' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, HitEffectType) == 0x00002C, "Member 'FGEBulletInfo::HitEffectType' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, SpawnType) == 0x00002D, "Member 'FGEBulletInfo::SpawnType' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, Scale) == 0x000030, "Member 'FGEBulletInfo::Scale' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, SphereCollisionRadius) == 0x000034, "Member 'FGEBulletInfo::SphereCollisionRadius' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, BombCollisionRadius) == 0x000038, "Member 'FGEBulletInfo::BombCollisionRadius' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, AbilityCollisionRadius) == 0x00003C, "Member 'FGEBulletInfo::AbilityCollisionRadius' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, InitialSpeed) == 0x000040, "Member 'FGEBulletInfo::InitialSpeed' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, Acceleration) == 0x000044, "Member 'FGEBulletInfo::Acceleration' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, AccelerationCurve) == 0x000048, "Member 'FGEBulletInfo::AccelerationCurve' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, RotationInterp) == 0x000050, "Member 'FGEBulletInfo::RotationInterp' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, GravityScale) == 0x000054, "Member 'FGEBulletInfo::GravityScale' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, GravityScaleCurve) == 0x000058, "Member 'FGEBulletInfo::GravityScaleCurve' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, MovementType) == 0x000060, "Member 'FGEBulletInfo::MovementType' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, Frequency) == 0x000064, "Member 'FGEBulletInfo::Frequency' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, FrequencyRange) == 0x000068, "Member 'FGEBulletInfo::FrequencyRange' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, LifeTime) == 0x00006C, "Member 'FGEBulletInfo::LifeTime' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, BulletExtremeRange) == 0x000070, "Member 'FGEBulletInfo::BulletExtremeRange' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, IgnoreCollToTeam) == 0x000078, "Member 'FGEBulletInfo::IgnoreCollToTeam' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, HitDie) == 0x0000C8, "Member 'FGEBulletInfo::HitDie' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, SameTargetMaxNum) == 0x0000CC, "Member 'FGEBulletInfo::SameTargetMaxNum' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, MaxTargetNum) == 0x0000D0, "Member 'FGEBulletInfo::MaxTargetNum' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, WillBoomWhenDead) == 0x0000D4, "Member 'FGEBulletInfo::WillBoomWhenDead' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, BombEffectID) == 0x0000D8, "Member 'FGEBulletInfo::BombEffectID' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, BulletChannel) == 0x0000DC, "Member 'FGEBulletInfo::BulletChannel' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, BulletRayPath) == 0x0000E0, "Member 'FGEBulletInfo::BulletRayPath' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, BulletRayParamName) == 0x0000F8, "Member 'FGEBulletInfo::BulletRayParamName' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, BulletRayParam) == 0x000100, "Member 'FGEBulletInfo::BulletRayParam' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, BulletRayPlayPre) == 0x000108, "Member 'FGEBulletInfo::BulletRayPlayPre' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, bBulletRayDestroyImmediately) == 0x000110, "Member 'FGEBulletInfo::bBulletRayDestroyImmediately' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, StopFireParticlePath) == 0x000118, "Member 'FGEBulletInfo::StopFireParticlePath' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, bMultiTrace) == 0x000130, "Member 'FGEBulletInfo::bMultiTrace' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, TraceShape) == 0x000134, "Member 'FGEBulletInfo::TraceShape' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, WidthTraceNum) == 0x00013C, "Member 'FGEBulletInfo::WidthTraceNum' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, WidthHeightNum) == 0x000140, "Member 'FGEBulletInfo::WidthHeightNum' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, HitStrength) == 0x000144, "Member 'FGEBulletInfo::HitStrength' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, bEnableCurveHitReaction) == 0x000148, "Member 'FGEBulletInfo::bEnableCurveHitReaction' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, bHitShakeEffectSelfOnly) == 0x000149, "Member 'FGEBulletInfo::bHitShakeEffectSelfOnly' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, CameraShakeClassPath) == 0x000150, "Member 'FGEBulletInfo::CameraShakeClassPath' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, ShakeMaxValidDistance) == 0x000168, "Member 'FGEBulletInfo::ShakeMaxValidDistance' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, bAttenuation) == 0x00016C, "Member 'FGEBulletInfo::bAttenuation' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, HitAbilityTargetShake_NoAimPath) == 0x000170, "Member 'FGEBulletInfo::HitAbilityTargetShake_NoAimPath' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, HitAbilityTargetShake_InAimPath) == 0x000188, "Member 'FGEBulletInfo::HitAbilityTargetShake_InAimPath' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, HitEffectID) == 0x0001A0, "Member 'FGEBulletInfo::HitEffectID' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, HitEffectNotPlayInTime) == 0x0001A4, "Member 'FGEBulletInfo::HitEffectNotPlayInTime' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, HitEffectPlayPre) == 0x0001A8, "Member 'FGEBulletInfo::HitEffectPlayPre' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, HitWeaknessEffectNotPlayInTime) == 0x0001B0, "Member 'FGEBulletInfo::HitWeaknessEffectNotPlayInTime' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, HitWeaknessEffectPlayPre) == 0x0001B4, "Member 'FGEBulletInfo::HitWeaknessEffectPlayPre' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, bUseHitEffectTable) == 0x0001BC, "Member 'FGEBulletInfo::bUseHitEffectTable' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, bHitEffectComposite) == 0x0001BD, "Member 'FGEBulletInfo::bHitEffectComposite' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, HitEffectParticlePath) == 0x0001C0, "Member 'FGEBulletInfo::HitEffectParticlePath' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, bHitEffectAttach) == 0x0001D8, "Member 'FGEBulletInfo::bHitEffectAttach' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, bHitEffectFollowBulletRotation) == 0x0001D9, "Member 'FGEBulletInfo::bHitEffectFollowBulletRotation' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, MaxParticleCount) == 0x0001DC, "Member 'FGEBulletInfo::MaxParticleCount' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, FreeTime) == 0x0001E0, "Member 'FGEBulletInfo::FreeTime' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, HitEffectRelativeTransform) == 0x0001F0, "Member 'FGEBulletInfo::HitEffectRelativeTransform' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, HitCharEffectSoundEvent) == 0x000220, "Member 'FGEBulletInfo::HitCharEffectSoundEvent' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, HitWorldEffectSoundEvent) == 0x000230, "Member 'FGEBulletInfo::HitWorldEffectSoundEvent' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, SubSkillIDs) == 0x000240, "Member 'FGEBulletInfo::SubSkillIDs' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, CastRange) == 0x000250, "Member 'FGEBulletInfo::CastRange' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, ActorTraceChannel) == 0x000254, "Member 'FGEBulletInfo::ActorTraceChannel' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, BombDamageType) == 0x000258, "Member 'FGEBulletInfo::BombDamageType' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, BombEmitterID) == 0x00025C, "Member 'FGEBulletInfo::BombEmitterID' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, bBulletDirectHitAsBomb) == 0x000260, "Member 'FGEBulletInfo::bBulletDirectHitAsBomb' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, TailBeamParticleParamName) == 0x000264, "Member 'FGEBulletInfo::TailBeamParticleParamName' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, TailBeamParticleParam) == 0x00026C, "Member 'FGEBulletInfo::TailBeamParticleParam' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, TailParticlePath) == 0x000278, "Member 'FGEBulletInfo::TailParticlePath' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, TailParticlePlayPre) == 0x000290, "Member 'FGEBulletInfo::TailParticlePlayPre' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, ZBug_SlowSpeedDur) == 0x000298, "Member 'FGEBulletInfo::ZBug_SlowSpeedDur' has a wrong offset!");
static_assert(offsetof(FGEBulletInfo, ZBug_SlowSpeedPer) == 0x00029C, "Member 'FGEBulletInfo::ZBug_SlowSpeedPer' has a wrong offset!");

// ScriptStruct GameEx.GEAbilityCommonForceFeedback
// 0x0028 (0x0028 - 0x0000)
struct FGEAbilityCommonForceFeedback final
{
public:
	struct FSoftObjectPath                        ForceFeedbackCurve;                                // 0x0000(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendInTime;                                       // 0x0018(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendOutTime;                                      // 0x001C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ColdDownTime;                                      // 0x0020(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0024(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGEAbilityCommonForceFeedback) == 0x000008, "Wrong alignment on FGEAbilityCommonForceFeedback");
static_assert(sizeof(FGEAbilityCommonForceFeedback) == 0x000028, "Wrong size on FGEAbilityCommonForceFeedback");
static_assert(offsetof(FGEAbilityCommonForceFeedback, ForceFeedbackCurve) == 0x000000, "Member 'FGEAbilityCommonForceFeedback::ForceFeedbackCurve' has a wrong offset!");
static_assert(offsetof(FGEAbilityCommonForceFeedback, BlendInTime) == 0x000018, "Member 'FGEAbilityCommonForceFeedback::BlendInTime' has a wrong offset!");
static_assert(offsetof(FGEAbilityCommonForceFeedback, BlendOutTime) == 0x00001C, "Member 'FGEAbilityCommonForceFeedback::BlendOutTime' has a wrong offset!");
static_assert(offsetof(FGEAbilityCommonForceFeedback, ColdDownTime) == 0x000020, "Member 'FGEAbilityCommonForceFeedback::ColdDownTime' has a wrong offset!");
static_assert(offsetof(FGEAbilityCommonForceFeedback, Priority) == 0x000024, "Member 'FGEAbilityCommonForceFeedback::Priority' has a wrong offset!");

// ScriptStruct GameEx.GEWeaponFireParam
// 0x0158 (0x0158 - 0x0000)
struct FGEWeaponFireParam final
{
public:
	float                                         MoveScatteringArea;                                // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RushScatteringArea;                                // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StandScatteringArea;                               // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimScatteringArea;                                 // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveMaxScatteringArea;                             // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RushMaxScatteringArea;                             // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StandMaxScatteringArea;                            // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimMaxScatteringArea;                              // 0x001C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveShootAddScatter;                               // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StandShootAddScatter;                              // 0x0024(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimShootAddScatter;                                // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StopFireRecoverScatterSpeed;                       // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
