#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GamePlayerCameraManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EnumInitSnow_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function GamePlayerCameraManager.GamePlayerCameraManager_C.ExecuteUbergraph_GamePlayerCameraManager
// 0x0020 (0x0020 - 0x0000)
struct GamePlayerCameraManager_C_ExecuteUbergraph_GamePlayerCameraManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         CallFunc_LoadNiagaraAsset_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GamePlayerCameraManager_C_ExecuteUbergraph_GamePlayerCameraManager) == 0x000008, "Wrong alignment on GamePlayerCameraManager_C_ExecuteUbergraph_GamePlayerCameraManager");
static_assert(sizeof(GamePlayerCameraManager_C_ExecuteUbergraph_GamePlayerCameraManager) == 0x000020, "Wrong size on GamePlayerCameraManager_C_ExecuteUbergraph_GamePlayerCameraManager");
static_assert(offsetof(GamePlayerCameraManager_C_ExecuteUbergraph_GamePlayerCameraManager, EntryPoint) == 0x000000, "Member 'GamePlayerCameraManager_C_ExecuteUbergraph_GamePlayerCameraManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(GamePlayerCameraManager_C_ExecuteUbergraph_GamePlayerCameraManager, CallFunc_LoadNiagaraAsset_ReturnValue) == 0x000008, "Member 'GamePlayerCameraManager_C_ExecuteUbergraph_GamePlayerCameraManager::CallFunc_LoadNiagaraAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamePlayerCameraManager_C_ExecuteUbergraph_GamePlayerCameraManager, CallFunc_IsDedicatedServer_ReturnValue) == 0x000010, "Member 'GamePlayerCameraManager_C_ExecuteUbergraph_GamePlayerCameraManager::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamePlayerCameraManager_C_ExecuteUbergraph_GamePlayerCameraManager, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000018, "Member 'GamePlayerCameraManager_C_ExecuteUbergraph_GamePlayerCameraManager::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

// Function GamePlayerCameraManager.GamePlayerCameraManager_C.Set Snow
// 0x0060 (0x0060 - 0x0000)
struct GamePlayerCameraManager_C_Set_Snow final
{
public:
	float                                         Rate_0;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size_0;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Velocity_0;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VelocityMax;                                       // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VelocityMin;                                       // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSnowEffectParameter                   K2Node_MakeStruct_SnowEffectParameter;             // 0x0024(0x0038)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GamePlayerCameraManager_C_Set_Snow) == 0x000004, "Wrong alignment on GamePlayerCameraManager_C_Set_Snow");
static_assert(sizeof(GamePlayerCameraManager_C_Set_Snow) == 0x000060, "Wrong size on GamePlayerCameraManager_C_Set_Snow");
static_assert(offsetof(GamePlayerCameraManager_C_Set_Snow, Rate_0) == 0x000000, "Member 'GamePlayerCameraManager_C_Set_Snow::Rate_0' has a wrong offset!");
static_assert(offsetof(GamePlayerCameraManager_C_Set_Snow, Size_0) == 0x000004, "Member 'GamePlayerCameraManager_C_Set_Snow::Size_0' has a wrong offset!");
static_assert(offsetof(GamePlayerCameraManager_C_Set_Snow, Velocity_0) == 0x000008, "Member 'GamePlayerCameraManager_C_Set_Snow::Velocity_0' has a wrong offset!");
static_assert(offsetof(GamePlayerCameraManager_C_Set_Snow, VelocityMax) == 0x00000C, "Member 'GamePlayerCameraManager_C_Set_Snow::VelocityMax' has a wrong offset!");
static_assert(offsetof(GamePlayerCameraManager_C_Set_Snow, VelocityMin) == 0x000018, "Member 'GamePlayerCameraManager_C_Set_Snow::VelocityMin' has a wrong offset!");
static_assert(offsetof(GamePlayerCameraManager_C_Set_Snow, K2Node_MakeStruct_SnowEffectParameter) == 0x000024, "Member 'GamePlayerCameraManager_C_Set_Snow::K2Node_MakeStruct_SnowEffectParameter' has a wrong offset!");
static_assert(offsetof(GamePlayerCameraManager_C_Set_Snow, CallFunc_IsValid_ReturnValue) == 0x00005C, "Member 'GamePlayerCameraManager_C_Set_Snow::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GamePlayerCameraManager.GamePlayerCameraManager_C.ActiveSnow
// 0x00B4 (0x00B4 - 0x0000)
struct GamePlayerCameraManager_C_ActiveSnow final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EnumInitSnow                                  Snow;                                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSnowEffectParameter                   K2Node_MakeStruct_SnowEffectParameter;             // 0x0004(0x0038)(NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSnowEffectParameter                   K2Node_MakeStruct_SnowEffectParameter_1;           // 0x0040(0x0038)(NoDestructor)
	struct FSnowEffectParameter                   K2Node_MakeStruct_SnowEffectParameter_2;           // 0x0078(0x0038)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GamePlayerCameraManager_C_ActiveSnow) == 0x000004, "Wrong alignment on GamePlayerCameraManager_C_ActiveSnow");
static_assert(sizeof(GamePlayerCameraManager_C_ActiveSnow) == 0x0000B4, "Wrong size on GamePlayerCameraManager_C_ActiveSnow");
static_assert(offsetof(GamePlayerCameraManager_C_ActiveSnow, Active) == 0x000000, "Member 'GamePlayerCameraManager_C_ActiveSnow::Active' has a wrong offset!");
static_assert(offsetof(GamePlayerCameraManager_C_ActiveSnow, Snow) == 0x000001, "Member 'GamePlayerCameraManager_C_ActiveSnow::Snow' has a wrong offset!");
static_assert(offsetof(GamePlayerCameraManager_C_ActiveSnow, K2Node_MakeStruct_SnowEffectParameter) == 0x000004, "Member 'GamePlayerCameraManager_C_ActiveSnow::K2Node_MakeStruct_SnowEffectParameter' has a wrong offset!");
static_assert(offsetof(GamePlayerCameraManager_C_ActiveSnow, K2Node_SwitchEnum_CmpSuccess) == 0x00003C, "Member 'GamePlayerCameraManager_C_ActiveSnow::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GamePlayerCameraManager_C_ActiveSnow, K2Node_MakeStruct_SnowEffectParameter_1) == 0x000040, "Member 'GamePlayerCameraManager_C_ActiveSnow::K2Node_MakeStruct_SnowEffectParameter_1' has a wrong offset!");
static_assert(offsetof(GamePlayerCameraManager_C_ActiveSnow, K2Node_MakeStruct_SnowEffectParameter_2) == 0x000078, "Member 'GamePlayerCameraManager_C_ActiveSnow::K2Node_MakeStruct_SnowEffectParameter_2' has a wrong offset!");
static_assert(offsetof(GamePlayerCameraManager_C_ActiveSnow, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'GamePlayerCameraManager_C_ActiveSnow::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

