#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GamepadUMGPlugin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class GamepadUMGPlugin.GamepadCursorSettings
// 0x0248 (0x0280 - 0x0038)
class UGamepadCursorSettings final : public UDeveloperSettings
{
public:
	struct FRuntimeFloatCurve                     AnalogCursorAccelerationCurve;                     // 0x0038(0x0088)(Edit, Config, NativeAccessSpecifierPrivate)
	struct FRuntimeFloatCurve                     AnalogCursorSpeedCure;                             // 0x00C0(0x0088)(Edit, Config, NativeAccessSpecifierPrivate)
	struct FRuntimeFloatCurve                     WheelAccelerationCure;                             // 0x0148(0x0088)(Edit, Config, NativeAccessSpecifierPrivate)
	struct FRuntimeFloatCurve                     WheelSpeedCure;                                    // 0x01D0(0x0088)(Edit, Config, NativeAccessSpecifierPrivate)
	float                                         MaxAnalogCursorSpeed;                              // 0x0258(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnalogCursorDeadZone;                              // 0x0260(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AnalogCursorAccelerationMultiplier;                // 0x0264(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AnalogCursorSize;                                  // 0x0268(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         WheelSpeed;                                        // 0x026C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_270[0x10];                                     // 0x0270(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GamepadCursorSettings">();
	}
	static class UGamepadCursorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGamepadCursorSettings>();
	}
};
static_assert(alignof(UGamepadCursorSettings) == 0x000008, "Wrong alignment on UGamepadCursorSettings");
static_assert(sizeof(UGamepadCursorSettings) == 0x000280, "Wrong size on UGamepadCursorSettings");
static_assert(offsetof(UGamepadCursorSettings, AnalogCursorAccelerationCurve) == 0x000038, "Member 'UGamepadCursorSettings::AnalogCursorAccelerationCurve' has a wrong offset!");
static_assert(offsetof(UGamepadCursorSettings, AnalogCursorSpeedCure) == 0x0000C0, "Member 'UGamepadCursorSettings::AnalogCursorSpeedCure' has a wrong offset!");
static_assert(offsetof(UGamepadCursorSettings, WheelAccelerationCure) == 0x000148, "Member 'UGamepadCursorSettings::WheelAccelerationCure' has a wrong offset!");
static_assert(offsetof(UGamepadCursorSettings, WheelSpeedCure) == 0x0001D0, "Member 'UGamepadCursorSettings::WheelSpeedCure' has a wrong offset!");
static_assert(offsetof(UGamepadCursorSettings, MaxAnalogCursorSpeed) == 0x000258, "Member 'UGamepadCursorSettings::MaxAnalogCursorSpeed' has a wrong offset!");
static_assert(offsetof(UGamepadCursorSettings, AnalogCursorDeadZone) == 0x000260, "Member 'UGamepadCursorSettings::AnalogCursorDeadZone' has a wrong offset!");
static_assert(offsetof(UGamepadCursorSettings, AnalogCursorAccelerationMultiplier) == 0x000264, "Member 'UGamepadCursorSettings::AnalogCursorAccelerationMultiplier' has a wrong offset!");
static_assert(offsetof(UGamepadCursorSettings, AnalogCursorSize) == 0x000268, "Member 'UGamepadCursorSettings::AnalogCursorSize' has a wrong offset!");
static_assert(offsetof(UGamepadCursorSettings, WheelSpeed) == 0x00026C, "Member 'UGamepadCursorSettings::WheelSpeed' has a wrong offset!");

}

