#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameEx

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameEx_structs.hpp"
#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"
#include "GameLogicTree_structs.hpp"


namespace SDK::Params
{

// Function GameEx.GERotateBrick.SetBrickState
// 0x0001 (0x0001 - 0x0000)
struct GERotateBrick_SetBrickState final
{
public:
	EGERotateBrickState                           InState;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GERotateBrick_SetBrickState) == 0x000001, "Wrong alignment on GERotateBrick_SetBrickState");
static_assert(sizeof(GERotateBrick_SetBrickState) == 0x000001, "Wrong size on GERotateBrick_SetBrickState");
static_assert(offsetof(GERotateBrick_SetBrickState, InState) == 0x000000, "Member 'GERotateBrick_SetBrickState::InState' has a wrong offset!");

// Function GameEx.GERotateBrick.SetEffectMat
// 0x0004 (0x0004 - 0x0000)
struct GERotateBrick_SetEffectMat final
{
public:
	int32                                         EffectType;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GERotateBrick_SetEffectMat) == 0x000004, "Wrong alignment on GERotateBrick_SetEffectMat");
static_assert(sizeof(GERotateBrick_SetEffectMat) == 0x000004, "Wrong size on GERotateBrick_SetEffectMat");
static_assert(offsetof(GERotateBrick_SetEffectMat, EffectType) == 0x000000, "Member 'GERotateBrick_SetEffectMat::EffectType' has a wrong offset!");

// Function GameEx.GERotateBrick.SyncRotateFinish
// 0x0004 (0x0004 - 0x0000)
struct GERotateBrick_SyncRotateFinish final
{
public:
	float                                         CurAngle;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GERotateBrick_SyncRotateFinish) == 0x000004, "Wrong alignment on GERotateBrick_SyncRotateFinish");
static_assert(sizeof(GERotateBrick_SyncRotateFinish) == 0x000004, "Wrong size on GERotateBrick_SyncRotateFinish");
static_assert(offsetof(GERotateBrick_SyncRotateFinish, CurAngle) == 0x000000, "Member 'GERotateBrick_SyncRotateFinish::CurAngle' has a wrong offset!");

// Function GameEx.GERotateBrick.SyncStartRotateTime
// 0x0004 (0x0004 - 0x0000)
struct GERotateBrick_SyncStartRotateTime final
{
public:
	float                                         CurTime;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GERotateBrick_SyncStartRotateTime) == 0x000004, "Wrong alignment on GERotateBrick_SyncStartRotateTime");
static_assert(sizeof(GERotateBrick_SyncStartRotateTime) == 0x000004, "Wrong size on GERotateBrick_SyncStartRotateTime");
static_assert(offsetof(GERotateBrick_SyncStartRotateTime, CurTime) == 0x000000, "Member 'GERotateBrick_SyncStartRotateTime::CurTime' has a wrong offset!");

// Function GameEx.GEScripteEventMgr.GetActorExComLuaTableName
// 0x0010 (0x0010 - 0x0000)
struct GEScripteEventMgr_GetActorExComLuaTableName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GEScripteEventMgr_GetActorExComLuaTableName) == 0x000008, "Wrong alignment on GEScripteEventMgr_GetActorExComLuaTableName");
static_assert(sizeof(GEScripteEventMgr_GetActorExComLuaTableName) == 0x000010, "Wrong size on GEScripteEventMgr_GetActorExComLuaTableName");
static_assert(offsetof(GEScripteEventMgr_GetActorExComLuaTableName, ReturnValue) == 0x000000, "Member 'GEScripteEventMgr_GetActorExComLuaTableName::ReturnValue' has a wrong offset!");

// Function GameEx.GEScripteEventMgr.GetGameModeLuaTableName
// 0x0010 (0x0010 - 0x0000)
struct GEScripteEventMgr_GetGameModeLuaTableName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GEScripteEventMgr_GetGameModeLuaTableName) == 0x000008, "Wrong alignment on GEScripteEventMgr_GetGameModeLuaTableName");
static_assert(sizeof(GEScripteEventMgr_GetGameModeLuaTableName) == 0x000010, "Wrong size on GEScripteEventMgr_GetGameModeLuaTableName");
static_assert(offsetof(GEScripteEventMgr_GetGameModeLuaTableName, ReturnValue) == 0x000000, "Member 'GEScripteEventMgr_GetGameModeLuaTableName::ReturnValue' has a wrong offset!");

// Function GameEx.GEScripteEventMgr.GetInstance
// 0x0008 (0x0008 - 0x0000)
struct GEScripteEventMgr_GetInstance final
{
public:
	class UGEScripteEventMgr*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GEScripteEventMgr_GetInstance) == 0x000008, "Wrong alignment on GEScripteEventMgr_GetInstance");
static_assert(sizeof(GEScripteEventMgr_GetInstance) == 0x000008, "Wrong size on GEScripteEventMgr_GetInstance");
static_assert(offsetof(GEScripteEventMgr_GetInstance, ReturnValue) == 0x000000, "Member 'GEScripteEventMgr_GetInstance::ReturnValue' has a wrong offset!");

// Function GameEx.GEScripteEventMgr.GetScripMgrLuaTableName
// 0x0010 (0x0010 - 0x0000)
struct GEScripteEventMgr_GetScripMgrLuaTableName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GEScripteEventMgr_GetScripMgrLuaTableName) == 0x000008, "Wrong alignment on GEScripteEventMgr_GetScripMgrLuaTableName");
static_assert(sizeof(GEScripteEventMgr_GetScripMgrLuaTableName) == 0x000010, "Wrong size on GEScripteEventMgr_GetScripMgrLuaTableName");
static_assert(offsetof(GEScripteEventMgr_GetScripMgrLuaTableName, ReturnValue) == 0x000000, "Member 'GEScripteEventMgr_GetScripMgrLuaTableName::ReturnValue' has a wrong offset!");

// Function GameEx.GEScripteEventMgr.SetScripMgrLuaTableName
// 0x0010 (0x0010 - 0x0000)
struct GEScripteEventMgr_SetScripMgrLuaTableName final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GEScripteEventMgr_SetScripMgrLuaTableName) == 0x000008, "Wrong alignment on GEScripteEventMgr_SetScripMgrLuaTableName");
static_assert(sizeof(GEScripteEventMgr_SetScripMgrLuaTableName) == 0x000010, "Wrong size on GEScripteEventMgr_SetScripMgrLuaTableName");
static_assert(offsetof(GEScripteEventMgr_SetScripMgrLuaTableName, Name_0) == 0x000000, "Member 'GEScripteEventMgr_SetScripMgrLuaTableName::Name_0' has a wrong offset!");

// DelegateFunction GameEx.GEScripteEventMgr.ActorBeginPlayToTSDeleagte__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct GEScripteEventMgr_ActorBeginPlayToTSDeleagte__DelegateSignature final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GEScripteEventMgr_ActorBeginPlayToTSDeleagte__DelegateSignature) == 0x000008, "Wrong alignment on GEScripteEventMgr_ActorBeginPlayToTSDeleagte__DelegateSignature");
static_assert(sizeof(GEScripteEventMgr_ActorBeginPlayToTSDeleagte__DelegateSignature) == 0x000008, "Wrong size on GEScripteEventMgr_ActorBeginPlayToTSDeleagte__DelegateSignature");
static_assert(offsetof(GEScripteEventMgr_ActorBeginPlayToTSDeleagte__DelegateSignature, Actor) == 0x000000, "Member 'GEScripteEventMgr_ActorBeginPlayToTSDeleagte__DelegateSignature::Actor' has a wrong offset!");

// DelegateFunction GameEx.GEScripteEventMgr.ActorEndPlayToTSDeleagte__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct GEScripteEventMgr_ActorEndPlayToTSDeleagte__DelegateSignature final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                EndPlayReason;                                     // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GEScripteEventMgr_ActorEndPlayToTSDeleagte__DelegateSignature) == 0x000008, "Wrong alignment on GEScripteEventMgr_ActorEndPlayToTSDeleagte__DelegateSignature");
static_assert(sizeof(GEScripteEventMgr_ActorEndPlayToTSDeleagte__DelegateSignature) == 0x000010, "Wrong size on GEScripteEventMgr_ActorEndPlayToTSDeleagte__DelegateSignature");
static_assert(offsetof(GEScripteEventMgr_ActorEndPlayToTSDeleagte__DelegateSignature, Actor) == 0x000000, "Member 'GEScripteEventMgr_ActorEndPlayToTSDeleagte__DelegateSignature::Actor' has a wrong offset!");
static_assert(offsetof(GEScripteEventMgr_ActorEndPlayToTSDeleagte__DelegateSignature, EndPlayReason) == 0x000008, "Member 'GEScripteEventMgr_ActorEndPlayToTSDeleagte__DelegateSignature::EndPlayReason' has a wrong offset!");

// Function GameEx.GEScripteEventMgr.AddGEActor
// 0x0010 (0x0010 - 0x0000)
struct GEScripteEventMgr_AddGEActor final
{
public:
	int32                                         ServerID;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GEScripteEventMgr_AddGEActor) == 0x000008, "Wrong alignment on GEScripteEventMgr_AddGEActor");
static_assert(sizeof(GEScripteEventMgr_AddGEActor) == 0x000010, "Wrong size on GEScripteEventMgr_AddGEActor");
static_assert(offsetof(GEScripteEventMgr_AddGEActor, ServerID) == 0x000000, "Member 'GEScripteEventMgr_AddGEActor::ServerID' has a wrong offset!");
static_assert(offsetof(GEScripteEventMgr_AddGEActor, Actor) == 0x000008, "Member 'GEScripteEventMgr_AddGEActor::Actor' has a wrong offset!");

// DelegateFunction GameEx.GEScripteEventMgr.EventToTSDeleagte__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct GEScripteEventMgr_EventToTSDeleagte__DelegateSignature final
{
public:
	class FString                                 EventCmd;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Params_0;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GEScripteEventMgr_EventToTSDeleagte__DelegateSignature) == 0x000008, "Wrong alignment on GEScripteEventMgr_EventToTSDeleagte__DelegateSignature");
static_assert(sizeof(GEScripteEventMgr_EventToTSDeleagte__DelegateSignature) == 0x000020, "Wrong size on GEScripteEventMgr_EventToTSDeleagte__DelegateSignature");
static_assert(offsetof(GEScripteEventMgr_EventToTSDeleagte__DelegateSignature, EventCmd) == 0x000000, "Member 'GEScripteEventMgr_EventToTSDeleagte__DelegateSignature::EventCmd' has a wrong offset!");
static_assert(offsetof(GEScripteEventMgr_EventToTSDeleagte__DelegateSignature, Params_0) == 0x000010, "Member 'GEScripteEventMgr_EventToTSDeleagte__DelegateSignature::Params_0' has a wrong offset!");

// DelegateFunction GameEx.GEScripteEventMgr.GameInstanceLoadCompleteDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct GEScripteEventMgr_GameInstanceLoadCompleteDelegate__DelegateSignature final
{
public:
	float                                         LoadTime;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MapName;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GEScripteEventMgr_GameInstanceLoadCompleteDelegate__DelegateSignature) == 0x000008, "Wrong alignment on GEScripteEventMgr_GameInstanceLoadCompleteDelegate__DelegateSignature");
static_assert(sizeof(GEScripteEventMgr_GameInstanceLoadCompleteDelegate__DelegateSignature) == 0x000018, "Wrong size on GEScripteEventMgr_GameInstanceLoadCompleteDelegate__DelegateSignature");
static_assert(offsetof(GEScripteEventMgr_GameInstanceLoadCompleteDelegate__DelegateSignature, LoadTime) == 0x000000, "Member 'GEScripteEventMgr_GameInstanceLoadCompleteDelegate__DelegateSignature::LoadTime' has a wrong offset!");
static_assert(offsetof(GEScripteEventMgr_GameInstanceLoadCompleteDelegate__DelegateSignature, MapName) == 0x000008, "Member 'GEScripteEventMgr_GameInstanceLoadCompleteDelegate__DelegateSignature::MapName' has a wrong offset!");

// Function GameEx.GEScripteEventMgr.GetGameInstance
// 0x0008 (0x0008 - 0x0000)
struct GEScripteEventMgr_GetGameInstance final
{
public:
	class UGameInstance*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GEScripteEventMgr_GetGameInstance) == 0x000008, "Wrong alignment on GEScripteEventMgr_GetGameInstance");
static_assert(sizeof(GEScripteEventMgr_GetGameInstance) == 0x000008, "Wrong size on GEScripteEventMgr_GetGameInstance");
static_assert(offsetof(GEScripteEventMgr_GetGameInstance, ReturnValue) == 0x000000, "Member 'GEScripteEventMgr_GetGameInstance::ReturnValue' has a wrong offset!");

// Function GameEx.GEScripteEventMgr.GetGEActorByServerID
// 0x0018 (0x0018 - 0x0000)
struct GEScripteEventMgr_GetGEActorByServerID final
{
public:
	int32                                         ServerID;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 World;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GEScripteEventMgr_GetGEActorByServerID) == 0x000008, "Wrong alignment on GEScripteEventMgr_GetGEActorByServerID");
static_assert(sizeof(GEScripteEventMgr_GetGEActorByServerID) == 0x000018, "Wrong size on GEScripteEventMgr_GetGEActorByServerID");
static_assert(offsetof(GEScripteEventMgr_GetGEActorByServerID, ServerID) == 0x000000, "Member 'GEScripteEventMgr_GetGEActorByServerID::ServerID' has a wrong offset!");
static_assert(offsetof(GEScripteEventMgr_GetGEActorByServerID, World) == 0x000008, "Member 'GEScripteEventMgr_GetGEActorByServerID::World' has a wrong offset!");
static_assert(offsetof(GEScripteEventMgr_GetGEActorByServerID, ReturnValue) == 0x000010, "Member 'GEScripteEventMgr_GetGEActorByServerID::ReturnValue' has a wrong offset!");

// DelegateFunction GameEx.GEScripteEventMgr.HandleDisconnect__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct GEScripteEventMgr_HandleDisconnect__DelegateSignature final
{
public:
	class UWorld*                                 InWorld;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNetDriver*                             NetDriver;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GEScripteEventMgr_HandleDisconnect__DelegateSignature) == 0x000008, "Wrong alignment on GEScripteEventMgr_HandleDisconnect__DelegateSignature");
static_assert(sizeof(GEScripteEventMgr_HandleDisconnect__DelegateSignature) == 0x000010, "Wrong size on GEScripteEventMgr_HandleDisconnect__DelegateSignature");
static_assert(offsetof(GEScripteEventMgr_HandleDisconnect__DelegateSignature, InWorld) == 0x000000, "Member 'GEScripteEventMgr_HandleDisconnect__DelegateSignature::InWorld' has a wrong offset!");
static_assert(offsetof(GEScripteEventMgr_HandleDisconnect__DelegateSignature, NetDriver) == 0x000008, "Member 'GEScripteEventMgr_HandleDisconnect__DelegateSignature::NetDriver' has a wrong offset!");

// DelegateFunction GameEx.GEScripteEventMgr.InitGameDelegate__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct GEScripteEventMgr_InitGameDelegate__DelegateSignature final
{
public:
	class AGEGameModeBase*                        GameModeBase;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MapName;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Options;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ErrorMessage;                                      // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GEScripteEventMgr_InitGameDelegate__DelegateSignature) == 0x000008, "Wrong alignment on GEScripteEventMgr_InitGameDelegate__DelegateSignature");
static_assert(sizeof(GEScripteEventMgr_InitGameDelegate__DelegateSignature) == 0x000038, "Wrong size on GEScripteEventMgr_InitGameDelegate__DelegateSignature");
static_assert(offsetof(GEScripteEventMgr_InitGameDelegate__DelegateSignature, GameModeBase) == 0x000000, "Member 'GEScripteEventMgr_InitGameDelegate__DelegateSignature::GameModeBase' has a wrong offset!");
static_assert(offsetof(GEScripteEventMgr_InitGameDelegate__DelegateSignature, MapName) == 0x000008, "Member 'GEScripteEventMgr_InitGameDelegate__DelegateSignature::MapName' has a wrong offset!");
static_assert(offsetof(GEScripteEventMgr_InitGameDelegate__DelegateSignature, Options) == 0x000018, "Member 'GEScripteEventMgr_InitGameDelegate__DelegateSignature::Options' has a wrong offset!");
static_assert(offsetof(GEScripteEventMgr_InitGameDelegate__DelegateSignature, ErrorMessage) == 0x000028, "Member 'GEScripteEventMgr_InitGameDelegate__DelegateSignature::ErrorMessage' has a wrong offset!");

// DelegateFunction GameEx.GEScripteEventMgr.LevelLoadBeginDelgate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct GEScripteEventMgr_LevelLoadBeginDelgate__DelegateSignature final
{
public:
	class FString                                 A;                                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GEScripteEventMgr_LevelLoadBeginDelgate__DelegateSignature) == 0x000008, "Wrong alignment on GEScripteEventMgr_LevelLoadBeginDelgate__DelegateSignature");
static_assert(sizeof(GEScripteEventMgr_LevelLoadBeginDelgate__DelegateSignature) == 0x000010, "Wrong size on GEScripteEventMgr_LevelLoadBeginDelgate__DelegateSignature");
static_assert(offsetof(GEScripteEventMgr_LevelLoadBeginDelgate__DelegateSignature, A) == 0x000000, "Member 'GEScripteEventMgr_LevelLoadBeginDelgate__DelegateSignature::A' has a wrong offset!");

// DelegateFunction GameEx.GEScripteEventMgr.LevelLoadEndDelgate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct GEScripteEventMgr_LevelLoadEndDelgate__DelegateSignature final
{
public:
	class UWorld*                                 A;                                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GEScripteEventMgr_LevelLoadEndDelgate__DelegateSignature) == 0x000008, "Wrong alignment on GEScripteEventMgr_LevelLoadEndDelgate__DelegateSignature");
static_assert(sizeof(GEScripteEventMgr_LevelLoadEndDelgate__DelegateSignature) == 0x000008, "Wrong size on GEScripteEventMgr_LevelLoadEndDelgate__DelegateSignature");
static_assert(offsetof(GEScripteEventMgr_LevelLoadEndDelgate__DelegateSignature, A) == 0x000000, "Member 'GEScripteEventMgr_LevelLoadEndDelgate__DelegateSignature::A' has a wrong offset!");

// Function GameEx.GEScripteEventMgr.NotifyToTSEvent
// 0x0020 (0x0020 - 0x0000)
struct GEScripteEventMgr_NotifyToTSEvent final
{
public:
	class FString                                 Cmd;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Param;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GEScripteEventMgr_NotifyToTSEvent) == 0x000008, "Wrong alignment on GEScripteEventMgr_NotifyToTSEvent");
static_assert(sizeof(GEScripteEventMgr_NotifyToTSEvent) == 0x000020, "Wrong size on GEScripteEventMgr_NotifyToTSEvent");
static_assert(offsetof(GEScripteEventMgr_NotifyToTSEvent, Cmd) == 0x000000, "Member 'GEScripteEventMgr_NotifyToTSEvent::Cmd' has a wrong offset!");
static_assert(offsetof(GEScripteEventMgr_NotifyToTSEvent, Param) == 0x000010, "Member 'GEScripteEventMgr_NotifyToTSEvent::Param' has a wrong offset!");

// DelegateFunction GameEx.GEScripteEventMgr.NotifyWithFloat__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct GEScripteEventMgr_NotifyWithFloat__DelegateSignature final
{
public:
	float                                         Deatl;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GEScripteEventMgr_NotifyWithFloat__DelegateSignature) == 0x000004, "Wrong alignment on GEScripteEventMgr_NotifyWithFloat__DelegateSignature");
static_assert(sizeof(GEScripteEventMgr_NotifyWithFloat__DelegateSignature) == 0x000004, "Wrong size on GEScripteEventMgr_NotifyWithFloat__DelegateSignature");
static_assert(offsetof(GEScripteEventMgr_NotifyWithFloat__DelegateSignature, Deatl) == 0x000000, "Member 'GEScripteEventMgr_NotifyWithFloat__DelegateSignature::Deatl' has a wrong offset!");

// Function GameEx.GEScripteEventMgr.OnActorBeginPlay
// 0x0008 (0x0008 - 0x0000)
struct GEScripteEventMgr_OnActorBeginPlay final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GEScripteEventMgr_OnActorBeginPlay) == 0x000008, "Wrong alignment on GEScripteEventMgr_OnActorBeginPlay");
static_assert(sizeof(GEScripteEventMgr_OnActorBeginPlay) == 0x000008, "Wrong size on GEScripteEventMgr_OnActorBeginPlay");
static_assert(offsetof(GEScripteEventMgr_OnActorBeginPlay, Actor) == 0x000000, "Member 'GEScripteEventMgr_OnActorBeginPlay::Actor' has a wrong offset!");

// Function GameEx.GEScripteEventMgr.OnActorEndPlay
// 0x0010 (0x0010 - 0x0000)
struct GEScripteEventMgr_OnActorEndPlay final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                EndPlayReason;                                     // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GEScripteEventMgr_OnActorEndPlay) == 0x000008, "Wrong alignment on GEScripteEventMgr_OnActorEndPlay");
static_assert(sizeof(GEScripteEventMgr_OnActorEndPlay) == 0x000010, "Wrong size on GEScripteEventMgr_OnActorEndPlay");
static_assert(offsetof(GEScripteEventMgr_OnActorEndPlay, Actor) == 0x000000, "Member 'GEScripteEventMgr_OnActorEndPlay::Actor' has a wrong offset!");
static_assert(offsetof(GEScripteEventMgr_OnActorEndPlay, EndPlayReason) == 0x000008, "Member 'GEScripteEventMgr_OnActorEndPlay::EndPlayReason' has a wrong offset!");

// Function GameEx.GEScripteEventMgr.OnStart
// 0x0008 (0x0008 - 0x0000)
struct GEScripteEventMgr_OnStart final
{
public:
	class UGameInstance*                          Ins;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GEScripteEventMgr_OnStart) == 0x000008, "Wrong alignment on GEScripteEventMgr_OnStart");
static_assert(sizeof(GEScripteEventMgr_OnStart) == 0x000008, "Wrong size on GEScripteEventMgr_OnStart");
static_assert(offsetof(GEScripteEventMgr_OnStart, Ins) == 0x000000, "Member 'GEScripteEventMgr_OnStart::Ins' has a wrong offset!");

// DelegateFunction GameEx.GEScripteEventMgr.PeekNetworkFailureMessagesDelegate__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct GEScripteEventMgr_PeekNetworkFailureMessagesDelegate__DelegateSignature final
{
public:
	class UWorld*                                 InWorld;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENetworkFailure                               FailureType;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ErrorString;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GEScripteEventMgr_PeekNetworkFailureMessagesDelegate__DelegateSignature) == 0x000008, "Wrong alignment on GEScripteEventMgr_PeekNetworkFailureMessagesDelegate__DelegateSignature");
static_assert(sizeof(GEScripteEventMgr_PeekNetworkFailureMessagesDelegate__DelegateSignature) == 0x000020, "Wrong size on GEScripteEventMgr_PeekNetworkFailureMessagesDelegate__DelegateSignature");
static_assert(offsetof(GEScripteEventMgr_PeekNetworkFailureMessagesDelegate__DelegateSignature, InWorld) == 0x000000, "Member 'GEScripteEventMgr_PeekNetworkFailureMessagesDelegate__DelegateSignature::InWorld' has a wrong offset!");
static_assert(offsetof(GEScripteEventMgr_PeekNetworkFailureMessagesDelegate__DelegateSignature, FailureType) == 0x000008, "Member 'GEScripteEventMgr_PeekNetworkFailureMessagesDelegate__DelegateSignature::FailureType' has a wrong offset!");
static_assert(offsetof(GEScripteEventMgr_PeekNetworkFailureMessagesDelegate__DelegateSignature, ErrorString) == 0x000010, "Member 'GEScripteEventMgr_PeekNetworkFailureMessagesDelegate__DelegateSignature::ErrorString' has a wrong offset!");

// DelegateFunction GameEx.GEScripteEventMgr.PeekTravelFailureMessagesDelegate__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct GEScripteEventMgr_PeekTravelFailureMessagesDelegate__DelegateSignature final
{
public:
	class UWorld*                                 InWorld;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETravelFailure                                FailureType;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ErrorString;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GEScripteEventMgr_PeekTravelFailureMessagesDelegate__DelegateSignature) == 0x000008, "Wrong alignment on GEScripteEventMgr_PeekTravelFailureMessagesDelegate__DelegateSignature");
static_assert(sizeof(GEScripteEventMgr_PeekTravelFailureMessagesDelegate__DelegateSignature) == 0x000020, "Wrong size on GEScripteEventMgr_PeekTravelFailureMessagesDelegate__DelegateSignature");
static_assert(offsetof(GEScripteEventMgr_PeekTravelFailureMessagesDelegate__DelegateSignature, InWorld) == 0x000000, "Member 'GEScripteEventMgr_PeekTravelFailureMessagesDelegate__DelegateSignature::InWorld' has a wrong offset!");
static_assert(offsetof(GEScripteEventMgr_PeekTravelFailureMessagesDelegate__DelegateSignature, FailureType) == 0x000008, "Member 'GEScripteEventMgr_PeekTravelFailureMessagesDelegate__DelegateSignature::FailureType' has a wrong offset!");
static_assert(offsetof(GEScripteEventMgr_PeekTravelFailureMessagesDelegate__DelegateSignature, ErrorString) == 0x000010, "Member 'GEScripteEventMgr_PeekTravelFailureMessagesDelegate__DelegateSignature::ErrorString' has a wrong offset!");

// Function GameEx.GEScripteEventMgr.RemoveGEActor
// 0x0010 (0x0010 - 0x0000)
struct GEScripteEventMgr_RemoveGEActor final
{
public:
	int32                                         ServerID;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 World;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GEScripteEventMgr_RemoveGEActor) == 0x000008, "Wrong alignment on GEScripteEventMgr_RemoveGEActor");
static_assert(sizeof(GEScripteEventMgr_RemoveGEActor) == 0x000010, "Wrong size on GEScripteEventMgr_RemoveGEActor");
static_assert(offsetof(GEScripteEventMgr_RemoveGEActor, ServerID) == 0x000000, "Member 'GEScripteEventMgr_RemoveGEActor::ServerID' has a wrong offset!");
static_assert(offsetof(GEScripteEventMgr_RemoveGEActor, World) == 0x000008, "Member 'GEScripteEventMgr_RemoveGEActor::World' has a wrong offset!");

// Function GameEx.GEScripteEventMgr.RemoveLuaTable
// 0x0010 (0x0010 - 0x0000)
struct GEScripteEventMgr_RemoveLuaTable final
{
public:
	class FString                                 TableName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GEScripteEventMgr_RemoveLuaTable) == 0x000008, "Wrong alignment on GEScripteEventMgr_RemoveLuaTable");
static_assert(sizeof(GEScripteEventMgr_RemoveLuaTable) == 0x000010, "Wrong size on GEScripteEventMgr_RemoveLuaTable");
static_assert(offsetof(GEScripteEventMgr_RemoveLuaTable, TableName) == 0x000000, "Member 'GEScripteEventMgr_RemoveLuaTable::TableName' has a wrong offset!");

// Function GameEx.GEScripteEventMgr.SetLuaTable
// 0x0020 (0x0020 - 0x0000)
struct GEScripteEventMgr_SetLuaTable final
{
public:
	class FString                                 TableName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GetFunName;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GEScripteEventMgr_SetLuaTable) == 0x000008, "Wrong alignment on GEScripteEventMgr_SetLuaTable");
static_assert(sizeof(GEScripteEventMgr_SetLuaTable) == 0x000020, "Wrong size on GEScripteEventMgr_SetLuaTable");
static_assert(offsetof(GEScripteEventMgr_SetLuaTable, TableName) == 0x000000, "Member 'GEScripteEventMgr_SetLuaTable::TableName' has a wrong offset!");
static_assert(offsetof(GEScripteEventMgr_SetLuaTable, GetFunName) == 0x000010, "Member 'GEScripteEventMgr_SetLuaTable::GetFunName' has a wrong offset!");

// Function GameEx.GESkillLibrary.CanAddStoreCount
// 0x0010 (0x0010 - 0x0000)
struct GESkillLibrary_CanAddStoreCount final
{
public:
	class AController*                            InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InIndex;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GESkillLibrary_CanAddStoreCount) == 0x000008, "Wrong alignment on GESkillLibrary_CanAddStoreCount");
static_assert(sizeof(GESkillLibrary_CanAddStoreCount) == 0x000010, "Wrong size on GESkillLibrary_CanAddStoreCount");
static_assert(offsetof(GESkillLibrary_CanAddStoreCount, InController) == 0x000000, "Member 'GESkillLibrary_CanAddStoreCount::InController' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_CanAddStoreCount, InIndex) == 0x000008, "Member 'GESkillLibrary_CanAddStoreCount::InIndex' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_CanAddStoreCount, ReturnValue) == 0x00000C, "Member 'GESkillLibrary_CanAddStoreCount::ReturnValue' has a wrong offset!");

// Function GameEx.GESkillLibrary.GetAllBuffIdByCharTeam
// 0x0018 (0x0018 - 0x0000)
struct GESkillLibrary_GetAllBuffIdByCharTeam final
{
public:
	class APawn*                                  InPawn;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GESkillLibrary_GetAllBuffIdByCharTeam) == 0x000008, "Wrong alignment on GESkillLibrary_GetAllBuffIdByCharTeam");
static_assert(sizeof(GESkillLibrary_GetAllBuffIdByCharTeam) == 0x000018, "Wrong size on GESkillLibrary_GetAllBuffIdByCharTeam");
static_assert(offsetof(GESkillLibrary_GetAllBuffIdByCharTeam, InPawn) == 0x000000, "Member 'GESkillLibrary_GetAllBuffIdByCharTeam::InPawn' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_GetAllBuffIdByCharTeam, ReturnValue) == 0x000008, "Member 'GESkillLibrary_GetAllBuffIdByCharTeam::ReturnValue' has a wrong offset!");

// Function GameEx.GESkillLibrary.GetAllSkillInfo
// 0x0010 (0x0010 - 0x0000)
struct GESkillLibrary_GetAllSkillInfo final
{
public:
	TArray<struct FGESkillInfo>                   InArr;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(GESkillLibrary_GetAllSkillInfo) == 0x000008, "Wrong alignment on GESkillLibrary_GetAllSkillInfo");
static_assert(sizeof(GESkillLibrary_GetAllSkillInfo) == 0x000010, "Wrong size on GESkillLibrary_GetAllSkillInfo");
static_assert(offsetof(GESkillLibrary_GetAllSkillInfo, InArr) == 0x000000, "Member 'GESkillLibrary_GetAllSkillInfo::InArr' has a wrong offset!");

// Function GameEx.GESkillLibrary.GetBuffDesParam
// 0x0018 (0x0018 - 0x0000)
struct GESkillLibrary_GetBuffDesParam final
{
public:
	int32                                         BuffId;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Level;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GESkillLibrary_GetBuffDesParam) == 0x000008, "Wrong alignment on GESkillLibrary_GetBuffDesParam");
static_assert(sizeof(GESkillLibrary_GetBuffDesParam) == 0x000018, "Wrong size on GESkillLibrary_GetBuffDesParam");
static_assert(offsetof(GESkillLibrary_GetBuffDesParam, BuffId) == 0x000000, "Member 'GESkillLibrary_GetBuffDesParam::BuffId' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_GetBuffDesParam, Level) == 0x000004, "Member 'GESkillLibrary_GetBuffDesParam::Level' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_GetBuffDesParam, ReturnValue) == 0x000008, "Member 'GESkillLibrary_GetBuffDesParam::ReturnValue' has a wrong offset!");

// Function GameEx.GESkillLibrary.GetBuffFromCount
// 0x0028 (0x0028 - 0x0000)
struct GESkillLibrary_GetBuffFromCount final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  InPawn;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsHero;                                            // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GESkillLibrary_GetBuffFromCount) == 0x000008, "Wrong alignment on GESkillLibrary_GetBuffFromCount");
static_assert(sizeof(GESkillLibrary_GetBuffFromCount) == 0x000028, "Wrong size on GESkillLibrary_GetBuffFromCount");
static_assert(offsetof(GESkillLibrary_GetBuffFromCount, Count) == 0x000000, "Member 'GESkillLibrary_GetBuffFromCount::Count' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_GetBuffFromCount, InPawn) == 0x000008, "Member 'GESkillLibrary_GetBuffFromCount::InPawn' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_GetBuffFromCount, IsHero) == 0x000010, "Member 'GESkillLibrary_GetBuffFromCount::IsHero' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_GetBuffFromCount, ReturnValue) == 0x000018, "Member 'GESkillLibrary_GetBuffFromCount::ReturnValue' has a wrong offset!");

// Function GameEx.GESkillLibrary.GetBuffInfoByID
// 0x0120 (0x0120 - 0x0000)
struct GESkillLibrary_GetBuffInfoByID final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGEBuffInfo                            ReturnValue;                                       // 0x0008(0x0118)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GESkillLibrary_GetBuffInfoByID) == 0x000008, "Wrong alignment on GESkillLibrary_GetBuffInfoByID");
static_assert(sizeof(GESkillLibrary_GetBuffInfoByID) == 0x000120, "Wrong size on GESkillLibrary_GetBuffInfoByID");
static_assert(offsetof(GESkillLibrary_GetBuffInfoByID, InId) == 0x000000, "Member 'GESkillLibrary_GetBuffInfoByID::InId' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_GetBuffInfoByID, ReturnValue) == 0x000008, "Member 'GESkillLibrary_GetBuffInfoByID::ReturnValue' has a wrong offset!");

// Function GameEx.GESkillLibrary.GetBuffLevelParam
// 0x0018 (0x0018 - 0x0000)
struct GESkillLibrary_GetBuffLevelParam final
{
public:
	int32                                         BuffId;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Level;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GESkillLibrary_GetBuffLevelParam) == 0x000008, "Wrong alignment on GESkillLibrary_GetBuffLevelParam");
static_assert(sizeof(GESkillLibrary_GetBuffLevelParam) == 0x000018, "Wrong size on GESkillLibrary_GetBuffLevelParam");
static_assert(offsetof(GESkillLibrary_GetBuffLevelParam, BuffId) == 0x000000, "Member 'GESkillLibrary_GetBuffLevelParam::BuffId' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_GetBuffLevelParam, Level) == 0x000004, "Member 'GESkillLibrary_GetBuffLevelParam::Level' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_GetBuffLevelParam, ReturnValue) == 0x000008, "Member 'GESkillLibrary_GetBuffLevelParam::ReturnValue' has a wrong offset!");

// Function GameEx.GESkillLibrary.GetBuffPath
// 0x0020 (0x0020 - 0x0000)
struct GESkillLibrary_GetBuffPath final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GESkillLibrary_GetBuffPath) == 0x000008, "Wrong alignment on GESkillLibrary_GetBuffPath");
static_assert(sizeof(GESkillLibrary_GetBuffPath) == 0x000020, "Wrong size on GESkillLibrary_GetBuffPath");
static_assert(offsetof(GESkillLibrary_GetBuffPath, InId) == 0x000000, "Member 'GESkillLibrary_GetBuffPath::InId' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_GetBuffPath, ReturnValue) == 0x000008, "Member 'GESkillLibrary_GetBuffPath::ReturnValue' has a wrong offset!");

// Function GameEx.GESkillLibrary.GetOwnBuffLevel
// 0x0018 (0x0018 - 0x0000)
struct GESkillLibrary_GetOwnBuffLevel final
{
public:
	int32                                         InBuffId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  InPawn;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GESkillLibrary_GetOwnBuffLevel) == 0x000008, "Wrong alignment on GESkillLibrary_GetOwnBuffLevel");
static_assert(sizeof(GESkillLibrary_GetOwnBuffLevel) == 0x000018, "Wrong size on GESkillLibrary_GetOwnBuffLevel");
static_assert(offsetof(GESkillLibrary_GetOwnBuffLevel, InBuffId) == 0x000000, "Member 'GESkillLibrary_GetOwnBuffLevel::InBuffId' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_GetOwnBuffLevel, InPawn) == 0x000008, "Member 'GESkillLibrary_GetOwnBuffLevel::InPawn' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_GetOwnBuffLevel, ReturnValue) == 0x000010, "Member 'GESkillLibrary_GetOwnBuffLevel::ReturnValue' has a wrong offset!");

// Function GameEx.GESkillLibrary.GetSkillEquipData
// 0x0040 (0x0040 - 0x0000)
struct GESkillLibrary_GetSkillEquipData final
{
public:
	class AController*                            InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InIndex;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGESkillEquipInfo                      ReturnValue;                                       // 0x000C(0x0034)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(GESkillLibrary_GetSkillEquipData) == 0x000008, "Wrong alignment on GESkillLibrary_GetSkillEquipData");
static_assert(sizeof(GESkillLibrary_GetSkillEquipData) == 0x000040, "Wrong size on GESkillLibrary_GetSkillEquipData");
static_assert(offsetof(GESkillLibrary_GetSkillEquipData, InController) == 0x000000, "Member 'GESkillLibrary_GetSkillEquipData::InController' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_GetSkillEquipData, InIndex) == 0x000008, "Member 'GESkillLibrary_GetSkillEquipData::InIndex' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_GetSkillEquipData, ReturnValue) == 0x00000C, "Member 'GESkillLibrary_GetSkillEquipData::ReturnValue' has a wrong offset!");

// Function GameEx.GESkillLibrary.GetSkillInfo
// 0x00B0 (0x00B0 - 0x0000)
struct GESkillLibrary_GetSkillInfo final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGESkillInfo                           ReturnValue;                                       // 0x0008(0x00A8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GESkillLibrary_GetSkillInfo) == 0x000008, "Wrong alignment on GESkillLibrary_GetSkillInfo");
static_assert(sizeof(GESkillLibrary_GetSkillInfo) == 0x0000B0, "Wrong size on GESkillLibrary_GetSkillInfo");
static_assert(offsetof(GESkillLibrary_GetSkillInfo, InId) == 0x000000, "Member 'GESkillLibrary_GetSkillInfo::InId' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_GetSkillInfo, ReturnValue) == 0x000008, "Member 'GESkillLibrary_GetSkillInfo::ReturnValue' has a wrong offset!");

// Function GameEx.GESkillLibrary.GetSkillPath
// 0x0020 (0x0020 - 0x0000)
struct GESkillLibrary_GetSkillPath final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GESkillLibrary_GetSkillPath) == 0x000008, "Wrong alignment on GESkillLibrary_GetSkillPath");
static_assert(sizeof(GESkillLibrary_GetSkillPath) == 0x000020, "Wrong size on GESkillLibrary_GetSkillPath");
static_assert(offsetof(GESkillLibrary_GetSkillPath, InId) == 0x000000, "Member 'GESkillLibrary_GetSkillPath::InId' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_GetSkillPath, ReturnValue) == 0x000008, "Member 'GESkillLibrary_GetSkillPath::ReturnValue' has a wrong offset!");

// Function GameEx.GESkillLibrary.IsUseable
// 0x0010 (0x0010 - 0x0000)
struct GESkillLibrary_IsUseable final
{
public:
	class AController*                            InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InIndex;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GESkillLibrary_IsUseable) == 0x000008, "Wrong alignment on GESkillLibrary_IsUseable");
static_assert(sizeof(GESkillLibrary_IsUseable) == 0x000010, "Wrong size on GESkillLibrary_IsUseable");
static_assert(offsetof(GESkillLibrary_IsUseable, InController) == 0x000000, "Member 'GESkillLibrary_IsUseable::InController' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_IsUseable, InIndex) == 0x000008, "Member 'GESkillLibrary_IsUseable::InIndex' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_IsUseable, ReturnValue) == 0x00000C, "Member 'GESkillLibrary_IsUseable::ReturnValue' has a wrong offset!");

// Function GameEx.GESkillLibrary.ModifySkillReduceCD
// 0x0010 (0x0010 - 0x0000)
struct GESkillLibrary_ModifySkillReduceCD final
{
public:
	class AGEPlayerState*                         Ps;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InIndex;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InReduceValue;                                     // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GESkillLibrary_ModifySkillReduceCD) == 0x000008, "Wrong alignment on GESkillLibrary_ModifySkillReduceCD");
static_assert(sizeof(GESkillLibrary_ModifySkillReduceCD) == 0x000010, "Wrong size on GESkillLibrary_ModifySkillReduceCD");
static_assert(offsetof(GESkillLibrary_ModifySkillReduceCD, Ps) == 0x000000, "Member 'GESkillLibrary_ModifySkillReduceCD::Ps' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_ModifySkillReduceCD, InIndex) == 0x000008, "Member 'GESkillLibrary_ModifySkillReduceCD::InIndex' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_ModifySkillReduceCD, InReduceValue) == 0x00000C, "Member 'GESkillLibrary_ModifySkillReduceCD::InReduceValue' has a wrong offset!");

// Function GameEx.GESkillLibrary.ModifySkillStoreCount
// 0x0010 (0x0010 - 0x0000)
struct GESkillLibrary_ModifySkillStoreCount final
{
public:
	class AGEGameCharacter*                       Char;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InIndex;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InAddCount;                                        // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GESkillLibrary_ModifySkillStoreCount) == 0x000008, "Wrong alignment on GESkillLibrary_ModifySkillStoreCount");
static_assert(sizeof(GESkillLibrary_ModifySkillStoreCount) == 0x000010, "Wrong size on GESkillLibrary_ModifySkillStoreCount");
static_assert(offsetof(GESkillLibrary_ModifySkillStoreCount, Char) == 0x000000, "Member 'GESkillLibrary_ModifySkillStoreCount::Char' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_ModifySkillStoreCount, InIndex) == 0x000008, "Member 'GESkillLibrary_ModifySkillStoreCount::InIndex' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_ModifySkillStoreCount, InAddCount) == 0x00000C, "Member 'GESkillLibrary_ModifySkillStoreCount::InAddCount' has a wrong offset!");

// Function GameEx.GESkillLibrary.SetIsUsed
// 0x0010 (0x0010 - 0x0000)
struct GESkillLibrary_SetIsUsed final
{
public:
	class AController*                            InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InIndex;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GESkillLibrary_SetIsUsed) == 0x000008, "Wrong alignment on GESkillLibrary_SetIsUsed");
static_assert(sizeof(GESkillLibrary_SetIsUsed) == 0x000010, "Wrong size on GESkillLibrary_SetIsUsed");
static_assert(offsetof(GESkillLibrary_SetIsUsed, InController) == 0x000000, "Member 'GESkillLibrary_SetIsUsed::InController' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_SetIsUsed, InIndex) == 0x000008, "Member 'GESkillLibrary_SetIsUsed::InIndex' has a wrong offset!");

// Function GameEx.GESkillLibrary.SetSkillEquipData
// 0x0040 (0x0040 - 0x0000)
struct GESkillLibrary_SetSkillEquipData final
{
public:
	class AController*                            InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InIndex;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGESkillEquipInfo                      Info;                                              // 0x000C(0x0034)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(GESkillLibrary_SetSkillEquipData) == 0x000008, "Wrong alignment on GESkillLibrary_SetSkillEquipData");
static_assert(sizeof(GESkillLibrary_SetSkillEquipData) == 0x000040, "Wrong size on GESkillLibrary_SetSkillEquipData");
static_assert(offsetof(GESkillLibrary_SetSkillEquipData, InController) == 0x000000, "Member 'GESkillLibrary_SetSkillEquipData::InController' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_SetSkillEquipData, InIndex) == 0x000008, "Member 'GESkillLibrary_SetSkillEquipData::InIndex' has a wrong offset!");
static_assert(offsetof(GESkillLibrary_SetSkillEquipData, Info) == 0x00000C, "Member 'GESkillLibrary_SetSkillEquipData::Info' has a wrong offset!");

// Function GameEx.GESplineConveyorComponent.AddMoveActor
// 0x0010 (0x0010 - 0x0000)
struct GESplineConveyorComponent_AddMoveActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartLen;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCheckRepeat;                                      // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GESplineConveyorComponent_AddMoveActor) == 0x000008, "Wrong alignment on GESplineConveyorComponent_AddMoveActor");
static_assert(sizeof(GESplineConveyorComponent_AddMoveActor) == 0x000010, "Wrong size on GESplineConveyorComponent_AddMoveActor");
static_assert(offsetof(GESplineConveyorComponent_AddMoveActor, Actor) == 0x000000, "Member 'GESplineConveyorComponent_AddMoveActor::Actor' has a wrong offset!");
