#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Gear003_01_bp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GearBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass gear003_01_bp.gear003_01_bp_C
// 0x0178 (0x03B0 - 0x0238)
class AGear003_01_bp_C final : public AGearBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          PlayerControlTrigger;                              // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Collisions;                                        // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          LeftWall;                                          // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TopRoof;                                           // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BackWall;                                          // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ForwardWall;                                       // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RightWall;                                         // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TargetPlane;                                       // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Base;                                              // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DT01;                                              // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentTime;                                       // 0x0290(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartLocation;                                     // 0x0294(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EndLocation;                                       // 0x02A0(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InitialPosition;                                   // 0x02AC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RunningTime;                                       // 0x02B8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            _5___;                                             // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Td__;                                              // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____l__;                                           // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ______;                                            // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___X___;                                           // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___Y__;                                            // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __L__;                                             // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __M_;                                              // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ____;                                              // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          _____0;                                            // 0x02E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          _____1;                                            // 0x02E3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Zero_M_;                                           // 0x02E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Zero___;                                           // 0x02E5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Zero____0;                                         // 0x02E6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Zero____1;                                         // 0x02E7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         InShadow;                                          // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartWaitingTime;                                  // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Wwise_L_H;                                         // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Wwiset_b_H;                                        // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UWwiseComponent*                        WwiseRunningEffectComponent;                       // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___;                                               // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGameCharacter*>                 Characters;                                        // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          _____;                                             // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Zero____;                                          // 0x0331(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_332[0x6];                                      // 0x0332(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             Zero____2;                                         // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class AActor*>                         Passengers;                                        // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	float                                         Delta_Seconds;                                     // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 __Mn_ID;                                           // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Zero_Mn_ID;                                        // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class AGear001_02_bp_C*                       OriginGear;                                        // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGear001_02_bp_C*                       DestinationGear;                                   // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            ChannelResponse;                                   // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CollisionProfile;                                  // 0x0394(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  WallStates;                                        // 0x03A0(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify)

public:
	void OnRep_WallStates();
	void UpdateClientWall();
	void UpdateWallState(bool Forward, bool Back, bool Left, bool Right, bool Top);
	void DoMove(float DeltaTime, bool* bFinish);
	void IsClientArrived(bool* bIsArrived);
	void CancelSkill(class ACharacter* Char);
	void OnSwitch(bool Runing);
	void OnArrivedTarget();
	void OnRunning();
	void MoveToOrigin();
	void MoveToTarget();
	void Set_All_Walls_Collision(class FName InCollisionProfileName);
	void ____0();
	void Setup_in_Shadow();
	void _n0___();
	void _n____();
	void Set_Running_Time(float SpdScale);
	void Set_Target_Plane(bool* Return);
	void Open_Walls_from_Direction(bool IsStartState);
	void UserConstructionScript();
	void Off(float SpdScale);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Pause();
	void OnSwitchToOff(class UObject* Switch);
	void OnSwitchToOpen(class UObject* Switch);
	void Off_0(const struct FVector& StartPos, const struct FVector& EndPos, float RunningTime_0);
	void NotifyChangeStateTo(int32 InNewState);
	void NotifyInitState(int32 InValue);
	void NotifyPlayOpenOrClose();
	void EventOnArrived();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ExecuteUbergraph_gear003_01_bp(int32 EntryPoint);
	void Zero_____DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"gear003_01_bp_C">();
	}
	static class AGear003_01_bp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGear003_01_bp_C>();
	}
};
static_assert(alignof(AGear003_01_bp_C) == 0x000008, "Wrong alignment on AGear003_01_bp_C");
static_assert(sizeof(AGear003_01_bp_C) == 0x0003B0, "Wrong size on AGear003_01_bp_C");
static_assert(offsetof(AGear003_01_bp_C, UberGraphFrame) == 0x000238, "Member 'AGear003_01_bp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, PlayerControlTrigger) == 0x000240, "Member 'AGear003_01_bp_C::PlayerControlTrigger' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, Collisions) == 0x000248, "Member 'AGear003_01_bp_C::Collisions' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, LeftWall) == 0x000250, "Member 'AGear003_01_bp_C::LeftWall' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, TopRoof) == 0x000258, "Member 'AGear003_01_bp_C::TopRoof' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, BackWall) == 0x000260, "Member 'AGear003_01_bp_C::BackWall' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, ForwardWall) == 0x000268, "Member 'AGear003_01_bp_C::ForwardWall' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, RightWall) == 0x000270, "Member 'AGear003_01_bp_C::RightWall' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, TargetPlane) == 0x000278, "Member 'AGear003_01_bp_C::TargetPlane' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, Base) == 0x000280, "Member 'AGear003_01_bp_C::Base' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, DT01) == 0x000288, "Member 'AGear003_01_bp_C::DT01' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, CurrentTime) == 0x000290, "Member 'AGear003_01_bp_C::CurrentTime' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, StartLocation) == 0x000294, "Member 'AGear003_01_bp_C::StartLocation' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, EndLocation) == 0x0002A0, "Member 'AGear003_01_bp_C::EndLocation' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, InitialPosition) == 0x0002AC, "Member 'AGear003_01_bp_C::InitialPosition' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, RunningTime) == 0x0002B8, "Member 'AGear003_01_bp_C::RunningTime' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, _5___) == 0x0002C0, "Member 'AGear003_01_bp_C::_5___' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, Td__) == 0x0002C8, "Member 'AGear003_01_bp_C::Td__' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, ____l__) == 0x0002CC, "Member 'AGear003_01_bp_C::____l__' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, ______) == 0x0002D0, "Member 'AGear003_01_bp_C::______' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, ___X___) == 0x0002D4, "Member 'AGear003_01_bp_C::___X___' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, ___Y__) == 0x0002D8, "Member 'AGear003_01_bp_C::___Y__' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, __L__) == 0x0002DC, "Member 'AGear003_01_bp_C::__L__' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, __M_) == 0x0002E0, "Member 'AGear003_01_bp_C::__M_' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, ____) == 0x0002E1, "Member 'AGear003_01_bp_C::____' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, _____0) == 0x0002E2, "Member 'AGear003_01_bp_C::_____0' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, _____1) == 0x0002E3, "Member 'AGear003_01_bp_C::_____1' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, Zero_M_) == 0x0002E4, "Member 'AGear003_01_bp_C::Zero_M_' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, Zero___) == 0x0002E5, "Member 'AGear003_01_bp_C::Zero___' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, Zero____0) == 0x0002E6, "Member 'AGear003_01_bp_C::Zero____0' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, Zero____1) == 0x0002E7, "Member 'AGear003_01_bp_C::Zero____1' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, InShadow) == 0x0002E8, "Member 'AGear003_01_bp_C::InShadow' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, StartWaitingTime) == 0x0002EC, "Member 'AGear003_01_bp_C::StartWaitingTime' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, Wwise_L_H) == 0x0002F0, "Member 'AGear003_01_bp_C::Wwise_L_H' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, Wwiset_b_H) == 0x000300, "Member 'AGear003_01_bp_C::Wwiset_b_H' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, WwiseRunningEffectComponent) == 0x000310, "Member 'AGear003_01_bp_C::WwiseRunningEffectComponent' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, ___) == 0x000318, "Member 'AGear003_01_bp_C::___' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, Characters) == 0x000320, "Member 'AGear003_01_bp_C::Characters' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, _____) == 0x000330, "Member 'AGear003_01_bp_C::_____' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, Zero____) == 0x000331, "Member 'AGear003_01_bp_C::Zero____' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, Zero____2) == 0x000338, "Member 'AGear003_01_bp_C::Zero____2' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, Passengers) == 0x000348, "Member 'AGear003_01_bp_C::Passengers' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, Delta_Seconds) == 0x000358, "Member 'AGear003_01_bp_C::Delta_Seconds' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, __Mn_ID) == 0x000360, "Member 'AGear003_01_bp_C::__Mn_ID' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, Zero_Mn_ID) == 0x000370, "Member 'AGear003_01_bp_C::Zero_Mn_ID' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, OriginGear) == 0x000380, "Member 'AGear003_01_bp_C::OriginGear' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, DestinationGear) == 0x000388, "Member 'AGear003_01_bp_C::DestinationGear' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, ChannelResponse) == 0x000390, "Member 'AGear003_01_bp_C::ChannelResponse' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, CollisionProfile) == 0x000394, "Member 'AGear003_01_bp_C::CollisionProfile' has a wrong offset!");
static_assert(offsetof(AGear003_01_bp_C, WallStates) == 0x0003A0, "Member 'AGear003_01_bp_C::WallStates' has a wrong offset!");

}

