#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Gear001_03_bp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function gear001_03_bp.gear001_03_bp_C.UserConstructionScript
// 0x0180 (0x0180 - 0x0000)
struct Gear001_03_bp_C_UserConstructionScript final
{
public:
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_CollisionType_TypeName;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0054(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x00EC(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Gear001_03_bp_C_UserConstructionScript) == 0x000010, "Wrong alignment on Gear001_03_bp_C_UserConstructionScript");
static_assert(sizeof(Gear001_03_bp_C_UserConstructionScript) == 0x000180, "Wrong size on Gear001_03_bp_C_UserConstructionScript");
static_assert(offsetof(Gear001_03_bp_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000000, "Member 'Gear001_03_bp_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear001_03_bp_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000030, "Member 'Gear001_03_bp_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear001_03_bp_C_UserConstructionScript, CallFunc_CollisionType_TypeName) == 0x000038, "Member 'Gear001_03_bp_C_UserConstructionScript::CallFunc_CollisionType_TypeName' has a wrong offset!");
static_assert(offsetof(Gear001_03_bp_C_UserConstructionScript, CallFunc_SelectFloat_ReturnValue) == 0x000040, "Member 'Gear001_03_bp_C_UserConstructionScript::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear001_03_bp_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x000044, "Member 'Gear001_03_bp_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear001_03_bp_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000050, "Member 'Gear001_03_bp_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear001_03_bp_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000054, "Member 'Gear001_03_bp_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Gear001_03_bp_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x0000E0, "Member 'Gear001_03_bp_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear001_03_bp_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0000EC, "Member 'Gear001_03_bp_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

// Function gear001_03_bp.gear001_03_bp_C.NotifyInitDoor
// 0x0001 (0x0001 - 0x0000)
struct Gear001_03_bp_C_NotifyInitDoor final
{
public:
	bool                                          IsOn_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Gear001_03_bp_C_NotifyInitDoor) == 0x000001, "Wrong alignment on Gear001_03_bp_C_NotifyInitDoor");
static_assert(sizeof(Gear001_03_bp_C_NotifyInitDoor) == 0x000001, "Wrong size on Gear001_03_bp_C_NotifyInitDoor");
static_assert(offsetof(Gear001_03_bp_C_NotifyInitDoor, IsOn_0) == 0x000000, "Member 'Gear001_03_bp_C_NotifyInitDoor::IsOn_0' has a wrong offset!");

// Function gear001_03_bp.gear001_03_bp_C.ExecuteUbergraph_gear001_03_bp
// 0x0168 (0x0168 - 0x0000)
struct Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0014(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x00BC(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsOn;                                 // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseComponent*                        CallFunc_PostEventAtLocation_ReturnValue;          // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp) == 0x000008, "Wrong alignment on Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp");
static_assert(sizeof(Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp) == 0x000168, "Wrong size on Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp");
static_assert(offsetof(Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp, EntryPoint) == 0x000000, "Member 'Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp::EntryPoint' has a wrong offset!");
static_assert(offsetof(Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000014, "Member 'Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp, CallFunc_Lerp_ReturnValue_1) == 0x0000A0, "Member 'Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp, CallFunc_MakeVector_ReturnValue_1) == 0x0000A4, "Member 'Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000B0, "Member 'Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x0000BC, "Member 'Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000148, "Member 'Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp, K2Node_Event_IsOn) == 0x000154, "Member 'Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp::K2Node_Event_IsOn' has a wrong offset!");
static_assert(offsetof(Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp, CallFunc_PostEventAtLocation_ReturnValue) == 0x000158, "Member 'Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp, CallFunc_Not_PreBool_ReturnValue) == 0x000160, "Member 'Gear001_03_bp_C_ExecuteUbergraph_gear001_03_bp::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

