#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Gear003_01_bp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function gear003_01_bp.gear003_01_bp_C.UpdateWallState
// 0x001C (0x001C - 0x0000)
struct Gear003_01_bp_C_UpdateWallState final
{
public:
	bool                                          Forward;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Back;                                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Left;                                              // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Right;                                             // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Top;                                               // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Gear003_01_bp_C_UpdateWallState) == 0x000004, "Wrong alignment on Gear003_01_bp_C_UpdateWallState");
static_assert(sizeof(Gear003_01_bp_C_UpdateWallState) == 0x00001C, "Wrong size on Gear003_01_bp_C_UpdateWallState");
static_assert(offsetof(Gear003_01_bp_C_UpdateWallState, Forward) == 0x000000, "Member 'Gear003_01_bp_C_UpdateWallState::Forward' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_UpdateWallState, Back) == 0x000001, "Member 'Gear003_01_bp_C_UpdateWallState::Back' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_UpdateWallState, Left) == 0x000002, "Member 'Gear003_01_bp_C_UpdateWallState::Left' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_UpdateWallState, Right) == 0x000003, "Member 'Gear003_01_bp_C_UpdateWallState::Right' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_UpdateWallState, Top) == 0x000004, "Member 'Gear003_01_bp_C_UpdateWallState::Top' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_UpdateWallState, CallFunc_Array_Add_ReturnValue) == 0x000008, "Member 'Gear003_01_bp_C_UpdateWallState::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_UpdateWallState, CallFunc_Array_Add_ReturnValue_1) == 0x00000C, "Member 'Gear003_01_bp_C_UpdateWallState::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_UpdateWallState, CallFunc_Array_Add_ReturnValue_2) == 0x000010, "Member 'Gear003_01_bp_C_UpdateWallState::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_UpdateWallState, CallFunc_Array_Add_ReturnValue_3) == 0x000014, "Member 'Gear003_01_bp_C_UpdateWallState::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_UpdateWallState, CallFunc_Array_Add_ReturnValue_4) == 0x000018, "Member 'Gear003_01_bp_C_UpdateWallState::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");

// Function gear003_01_bp.gear003_01_bp_C.DoMove
// 0x00B8 (0x00B8 - 0x0000)
struct Gear003_01_bp_C_DoMove final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFinish;                                           // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SafeDivide_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0028(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Gear003_01_bp_C_DoMove) == 0x000004, "Wrong alignment on Gear003_01_bp_C_DoMove");
static_assert(sizeof(Gear003_01_bp_C_DoMove) == 0x0000B8, "Wrong size on Gear003_01_bp_C_DoMove");
static_assert(offsetof(Gear003_01_bp_C_DoMove, DeltaTime) == 0x000000, "Member 'Gear003_01_bp_C_DoMove::DeltaTime' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_DoMove, bFinish) == 0x000004, "Member 'Gear003_01_bp_C_DoMove::bFinish' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_DoMove, CallFunc_SafeDivide_ReturnValue) == 0x000008, "Member 'Gear003_01_bp_C_DoMove::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_DoMove, CallFunc_Add_FloatFloat_ReturnValue) == 0x00000C, "Member 'Gear003_01_bp_C_DoMove::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_DoMove, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'Gear003_01_bp_C_DoMove::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_DoMove, CallFunc_SelectFloat_ReturnValue) == 0x000014, "Member 'Gear003_01_bp_C_DoMove::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_DoMove, CallFunc_VLerp_ReturnValue) == 0x000018, "Member 'Gear003_01_bp_C_DoMove::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_DoMove, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000024, "Member 'Gear003_01_bp_C_DoMove::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_DoMove, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000028, "Member 'Gear003_01_bp_C_DoMove::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_DoMove, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0000B4, "Member 'Gear003_01_bp_C_DoMove::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

// Function gear003_01_bp.gear003_01_bp_C.IsClientArrived
// 0x0014 (0x0014 - 0x0000)
struct Gear003_01_bp_C_IsClientArrived final
{
public:
	bool                                          bIsArrived;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqualExactly_VectorVector_ReturnValue; // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Gear003_01_bp_C_IsClientArrived) == 0x000004, "Wrong alignment on Gear003_01_bp_C_IsClientArrived");
static_assert(sizeof(Gear003_01_bp_C_IsClientArrived) == 0x000014, "Wrong size on Gear003_01_bp_C_IsClientArrived");
static_assert(offsetof(Gear003_01_bp_C_IsClientArrived, bIsArrived) == 0x000000, "Member 'Gear003_01_bp_C_IsClientArrived::bIsArrived' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_IsClientArrived, CallFunc_HasAuthority_ReturnValue) == 0x000001, "Member 'Gear003_01_bp_C_IsClientArrived::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_IsClientArrived, CallFunc_NotEqualExactly_VectorVector_ReturnValue) == 0x000002, "Member 'Gear003_01_bp_C_IsClientArrived::CallFunc_NotEqualExactly_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_IsClientArrived, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'Gear003_01_bp_C_IsClientArrived::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_IsClientArrived, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x000010, "Member 'Gear003_01_bp_C_IsClientArrived::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");

// Function gear003_01_bp.gear003_01_bp_C.CancelSkill
// 0x0038 (0x0038 - 0x0000)
struct Gear003_01_bp_C_CancelSkill final
{
public:
	class ACharacter*                             Char;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponentBase*                  ___object_Variable;                                // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAbilityCharacterInterface> K2Node_DynamicCast_AsAbility_Character_Interface;  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  CallFunc_GetAbilityComponent_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CancleAllSkill_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Gear003_01_bp_C_CancelSkill) == 0x000008, "Wrong alignment on Gear003_01_bp_C_CancelSkill");
static_assert(sizeof(Gear003_01_bp_C_CancelSkill) == 0x000038, "Wrong size on Gear003_01_bp_C_CancelSkill");
static_assert(offsetof(Gear003_01_bp_C_CancelSkill, Char) == 0x000000, "Member 'Gear003_01_bp_C_CancelSkill::Char' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_CancelSkill, ___object_Variable) == 0x000008, "Member 'Gear003_01_bp_C_CancelSkill::___object_Variable' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_CancelSkill, K2Node_DynamicCast_AsAbility_Character_Interface) == 0x000010, "Member 'Gear003_01_bp_C_CancelSkill::K2Node_DynamicCast_AsAbility_Character_Interface' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_CancelSkill, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Gear003_01_bp_C_CancelSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_CancelSkill, CallFunc_GetAbilityComponent_ReturnValue) == 0x000028, "Member 'Gear003_01_bp_C_CancelSkill::CallFunc_GetAbilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_CancelSkill, CallFunc_CancleAllSkill_ReturnValue) == 0x000030, "Member 'Gear003_01_bp_C_CancelSkill::CallFunc_CancleAllSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_CancelSkill, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'Gear003_01_bp_C_CancelSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function gear003_01_bp.gear003_01_bp_C.OnSwitch
// 0x0080 (0x0080 - 0x0000)
struct Gear003_01_bp_C_OnSwitch final
{
public:
	bool                                          Runing;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_As__;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayerController*                  K2Node_DynamicCast_AsGame_Player_Controller;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0058(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Gear003_01_bp_C_OnSwitch) == 0x000008, "Wrong alignment on Gear003_01_bp_C_OnSwitch");
static_assert(sizeof(Gear003_01_bp_C_OnSwitch) == 0x000080, "Wrong size on Gear003_01_bp_C_OnSwitch");
static_assert(offsetof(Gear003_01_bp_C_OnSwitch, Runing) == 0x000000, "Member 'Gear003_01_bp_C_OnSwitch::Runing' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnSwitch, ___int_Array_Index_Variable) == 0x000004, "Member 'Gear003_01_bp_C_OnSwitch::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnSwitch, ___int_Loop_Counter_Variable) == 0x000008, "Member 'Gear003_01_bp_C_OnSwitch::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnSwitch, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Gear003_01_bp_C_OnSwitch::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnSwitch, ___int_Array_Index_Variable_1) == 0x000010, "Member 'Gear003_01_bp_C_OnSwitch::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnSwitch, ___int_Loop_Counter_Variable_1) == 0x000014, "Member 'Gear003_01_bp_C_OnSwitch::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnSwitch, CallFunc_Array_Get_Item) == 0x000018, "Member 'Gear003_01_bp_C_OnSwitch::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnSwitch, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'Gear003_01_bp_C_OnSwitch::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnSwitch, K2Node_DynamicCast_As__) == 0x000028, "Member 'Gear003_01_bp_C_OnSwitch::K2Node_DynamicCast_As__' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnSwitch, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Gear003_01_bp_C_OnSwitch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnSwitch, CallFunc_Less_IntInt_ReturnValue) == 0x000031, "Member 'Gear003_01_bp_C_OnSwitch::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnSwitch, CallFunc_GetController_ReturnValue) == 0x000038, "Member 'Gear003_01_bp_C_OnSwitch::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnSwitch, CallFunc_Add_IntInt_ReturnValue_1) == 0x000040, "Member 'Gear003_01_bp_C_OnSwitch::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnSwitch, K2Node_DynamicCast_AsGame_Player_Controller) == 0x000048, "Member 'Gear003_01_bp_C_OnSwitch::K2Node_DynamicCast_AsGame_Player_Controller' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnSwitch, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'Gear003_01_bp_C_OnSwitch::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnSwitch, CallFunc_HasAuthority_ReturnValue) == 0x000051, "Member 'Gear003_01_bp_C_OnSwitch::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnSwitch, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000058, "Member 'Gear003_01_bp_C_OnSwitch::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnSwitch, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'Gear003_01_bp_C_OnSwitch::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnSwitch, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'Gear003_01_bp_C_OnSwitch::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnSwitch, CallFunc_Array_Contains_ReturnValue) == 0x000074, "Member 'Gear003_01_bp_C_OnSwitch::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnSwitch, CallFunc_Less_IntInt_ReturnValue_1) == 0x000075, "Member 'Gear003_01_bp_C_OnSwitch::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnSwitch, CallFunc_Array_Add_ReturnValue) == 0x000078, "Member 'Gear003_01_bp_C_OnSwitch::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function gear003_01_bp.gear003_01_bp_C.OnArrivedTarget
// 0x0068 (0x0068 - 0x0000)
struct Gear003_01_bp_C_OnArrivedTarget final
{
public:
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_1;          // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Gear003_01_bp_C_OnArrivedTarget) == 0x000008, "Wrong alignment on Gear003_01_bp_C_OnArrivedTarget");
static_assert(sizeof(Gear003_01_bp_C_OnArrivedTarget) == 0x000068, "Wrong size on Gear003_01_bp_C_OnArrivedTarget");
static_assert(offsetof(Gear003_01_bp_C_OnArrivedTarget, CallFunc_Concat_StrStr_ReturnValue) == 0x000000, "Member 'Gear003_01_bp_C_OnArrivedTarget::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnArrivedTarget, CallFunc_HasAuthority_ReturnValue) == 0x000010, "Member 'Gear003_01_bp_C_OnArrivedTarget::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnArrivedTarget, CallFunc_Conv_BoolToString_ReturnValue) == 0x000018, "Member 'Gear003_01_bp_C_OnArrivedTarget::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnArrivedTarget, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000028, "Member 'Gear003_01_bp_C_OnArrivedTarget::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnArrivedTarget, CallFunc_Conv_BoolToString_ReturnValue_1) == 0x000038, "Member 'Gear003_01_bp_C_OnArrivedTarget::CallFunc_Conv_BoolToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnArrivedTarget, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000048, "Member 'Gear003_01_bp_C_OnArrivedTarget::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnArrivedTarget, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000058, "Member 'Gear003_01_bp_C_OnArrivedTarget::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");

// Function gear003_01_bp.gear003_01_bp_C.OnRunning
// 0x0088 (0x0088 - 0x0000)
struct Gear003_01_bp_C_OnRunning final
{
public:
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseComponent*                        CallFunc_PostEventAtLocation_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseComponent*                        CallFunc_PostEventAtLocation_ReturnValue_1;        // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Gear003_01_bp_C_OnRunning) == 0x000008, "Wrong alignment on Gear003_01_bp_C_OnRunning");
static_assert(sizeof(Gear003_01_bp_C_OnRunning) == 0x000088, "Wrong size on Gear003_01_bp_C_OnRunning");
static_assert(offsetof(Gear003_01_bp_C_OnRunning, CallFunc_MakeRotator_ReturnValue) == 0x000000, "Member 'Gear003_01_bp_C_OnRunning::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnRunning, CallFunc_Concat_StrStr_ReturnValue) == 0x000010, "Member 'Gear003_01_bp_C_OnRunning::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnRunning, CallFunc_HasAuthority_ReturnValue) == 0x000020, "Member 'Gear003_01_bp_C_OnRunning::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnRunning, CallFunc_MakeRotator_ReturnValue_1) == 0x000024, "Member 'Gear003_01_bp_C_OnRunning::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnRunning, CallFunc_Conv_BoolToString_ReturnValue) == 0x000030, "Member 'Gear003_01_bp_C_OnRunning::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnRunning, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'Gear003_01_bp_C_OnRunning::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnRunning, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000048, "Member 'Gear003_01_bp_C_OnRunning::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnRunning, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000058, "Member 'Gear003_01_bp_C_OnRunning::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnRunning, CallFunc_PostEventAtLocation_ReturnValue) == 0x000068, "Member 'Gear003_01_bp_C_OnRunning::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnRunning, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000070, "Member 'Gear003_01_bp_C_OnRunning::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_OnRunning, CallFunc_PostEventAtLocation_ReturnValue_1) == 0x000080, "Member 'Gear003_01_bp_C_OnRunning::CallFunc_PostEventAtLocation_ReturnValue_1' has a wrong offset!");

// Function gear003_01_bp.gear003_01_bp_C.Set All Walls Collision
// 0x000C (0x000C - 0x0000)
struct Gear003_01_bp_C_Set_All_Walls_Collision final
{
public:
	class FName                                   InCollisionProfileName;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Gear003_01_bp_C_Set_All_Walls_Collision) == 0x000004, "Wrong alignment on Gear003_01_bp_C_Set_All_Walls_Collision");
static_assert(sizeof(Gear003_01_bp_C_Set_All_Walls_Collision) == 0x00000C, "Wrong size on Gear003_01_bp_C_Set_All_Walls_Collision");
static_assert(offsetof(Gear003_01_bp_C_Set_All_Walls_Collision, InCollisionProfileName) == 0x000000, "Member 'Gear003_01_bp_C_Set_All_Walls_Collision::InCollisionProfileName' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_Set_All_Walls_Collision, CallFunc_HasAuthority_ReturnValue) == 0x000008, "Member 'Gear003_01_bp_C_Set_All_Walls_Collision::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_Set_All_Walls_Collision, CallFunc_NotEqual_NameName_ReturnValue) == 0x000009, "Member 'Gear003_01_bp_C_Set_All_Walls_Collision::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");

// Function gear003_01_bp.gear003_01_bp_C.(>:
// 0x0028 (0x0028 - 0x0000)
struct Gear003_01_bp_C_____0 final
{
public:
	class FName                                   CallFunc_GetCollisionProfileName_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCollisionProfileName_ReturnValue_1;    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCollisionProfileName_ReturnValue_2;    // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCollisionProfileName_ReturnValue_3;    // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_2;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_3;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Gear003_01_bp_C____) == 0x000004, "Wrong alignment on Gear003_01_bp_C____");
static_assert(sizeof(Gear003_01_bp_C____) == 0x000028, "Wrong size on Gear003_01_bp_C____");
static_assert(offsetof(Gear003_01_bp_C____, CallFunc_GetCollisionProfileName_ReturnValue) == 0x000000, "Member 'Gear003_01_bp_C____::CallFunc_GetCollisionProfileName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C____, CallFunc_GetCollisionProfileName_ReturnValue_1) == 0x000008, "Member 'Gear003_01_bp_C____::CallFunc_GetCollisionProfileName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C____, CallFunc_NotEqual_NameName_ReturnValue) == 0x000010, "Member 'Gear003_01_bp_C____::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C____, CallFunc_NotEqual_NameName_ReturnValue_1) == 0x000011, "Member 'Gear003_01_bp_C____::CallFunc_NotEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C____, CallFunc_GetCollisionProfileName_ReturnValue_2) == 0x000014, "Member 'Gear003_01_bp_C____::CallFunc_GetCollisionProfileName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C____, CallFunc_GetCollisionProfileName_ReturnValue_3) == 0x00001C, "Member 'Gear003_01_bp_C____::CallFunc_GetCollisionProfileName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C____, CallFunc_NotEqual_NameName_ReturnValue_2) == 0x000024, "Member 'Gear003_01_bp_C____::CallFunc_NotEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C____, CallFunc_NotEqual_NameName_ReturnValue_3) == 0x000025, "Member 'Gear003_01_bp_C____::CallFunc_NotEqual_NameName_ReturnValue_3' has a wrong offset!");

// Function gear003_01_bp.gear003_01_bp_C.Setup in Shadow
// 0x0030 (0x0030 - 0x0000)
struct Gear003_01_bp_C_Setup_in_Shadow final
{
public:
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_As______;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Gear003_01_bp_C_Setup_in_Shadow) == 0x000008, "Wrong alignment on Gear003_01_bp_C_Setup_in_Shadow");
static_assert(sizeof(Gear003_01_bp_C_Setup_in_Shadow) == 0x000030, "Wrong size on Gear003_01_bp_C_Setup_in_Shadow");
static_assert(offsetof(Gear003_01_bp_C_Setup_in_Shadow, CallFunc_GetMaterial_ReturnValue) == 0x000000, "Member 'Gear003_01_bp_C_Setup_in_Shadow::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_Setup_in_Shadow, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'Gear003_01_bp_C_Setup_in_Shadow::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_Setup_in_Shadow, K2Node_DynamicCast_As______) == 0x000010, "Member 'Gear003_01_bp_C_Setup_in_Shadow::K2Node_DynamicCast_As______' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_Setup_in_Shadow, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Gear003_01_bp_C_Setup_in_Shadow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_Setup_in_Shadow, CallFunc_GetObjectClass_ReturnValue) == 0x000020, "Member 'Gear003_01_bp_C_Setup_in_Shadow::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_Setup_in_Shadow, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000028, "Member 'Gear003_01_bp_C_Setup_in_Shadow::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");

// Function gear003_01_bp.gear003_01_bp_C.¾n0¾¶
// 0x0001 (0x0001 - 0x0000)
struct Gear003_01_bp_C__n0___ final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Gear003_01_bp_C__n0___) == 0x000001, "Wrong alignment on Gear003_01_bp_C__n0___");
static_assert(sizeof(Gear003_01_bp_C__n0___) == 0x000001, "Wrong size on Gear003_01_bp_C__n0___");
static_assert(offsetof(Gear003_01_bp_C__n0___, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'Gear003_01_bp_C__n0___::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function gear003_01_bp.gear003_01_bp_C.¾nË¶
// 0x0001 (0x0001 - 0x0000)
struct Gear003_01_bp_C__n____ final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Gear003_01_bp_C__n____) == 0x000001, "Wrong alignment on Gear003_01_bp_C__n____");
static_assert(sizeof(Gear003_01_bp_C__n____) == 0x000001, "Wrong size on Gear003_01_bp_C__n____");
static_assert(offsetof(Gear003_01_bp_C__n____, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'Gear003_01_bp_C__n____::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function gear003_01_bp.gear003_01_bp_C.Set Running Time
// 0x0014 (0x0014 - 0x0000)
struct Gear003_01_bp_C_Set_Running_Time final
{
public:
	float                                         SpdScale;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Gear003_01_bp_C_Set_Running_Time) == 0x000004, "Wrong alignment on Gear003_01_bp_C_Set_Running_Time");
static_assert(sizeof(Gear003_01_bp_C_Set_Running_Time) == 0x000014, "Wrong size on Gear003_01_bp_C_Set_Running_Time");
static_assert(offsetof(Gear003_01_bp_C_Set_Running_Time, SpdScale) == 0x000000, "Member 'Gear003_01_bp_C_Set_Running_Time::SpdScale' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_Set_Running_Time, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'Gear003_01_bp_C_Set_Running_Time::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_Set_Running_Time, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000008, "Member 'Gear003_01_bp_C_Set_Running_Time::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_Set_Running_Time, CallFunc_VSize_ReturnValue) == 0x00000C, "Member 'Gear003_01_bp_C_Set_Running_Time::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_Set_Running_Time, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000010, "Member 'Gear003_01_bp_C_Set_Running_Time::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function gear003_01_bp.gear003_01_bp_C.Set Target Plane
// 0x00A8 (0x00A8 - 0x0000)
struct Gear003_01_bp_C_Set_Target_Plane final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Value;                                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0018(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Gear003_01_bp_C_Set_Target_Plane) == 0x000004, "Wrong alignment on Gear003_01_bp_C_Set_Target_Plane");
static_assert(sizeof(Gear003_01_bp_C_Set_Target_Plane) == 0x0000A8, "Wrong size on Gear003_01_bp_C_Set_Target_Plane");
static_assert(offsetof(Gear003_01_bp_C_Set_Target_Plane, Return) == 0x000000, "Member 'Gear003_01_bp_C_Set_Target_Plane::Return' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_Set_Target_Plane, Value) == 0x000001, "Member 'Gear003_01_bp_C_Set_Target_Plane::Value' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_Set_Target_Plane, CallFunc_Add_FloatFloat_ReturnValue) == 0x000004, "Member 'Gear003_01_bp_C_Set_Target_Plane::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_Set_Target_Plane, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'Gear003_01_bp_C_Set_Target_Plane::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_Set_Target_Plane, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000014, "Member 'Gear003_01_bp_C_Set_Target_Plane::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_Set_Target_Plane, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000018, "Member 'Gear003_01_bp_C_Set_Target_Plane::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_Set_Target_Plane, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x0000A4, "Member 'Gear003_01_bp_C_Set_Target_Plane::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function gear003_01_bp.gear003_01_bp_C.Open Walls from Direction
// 0x0001 (0x0001 - 0x0000)
struct Gear003_01_bp_C_Open_Walls_from_Direction final
{
public:
	bool                                          IsStartState;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Gear003_01_bp_C_Open_Walls_from_Direction) == 0x000001, "Wrong alignment on Gear003_01_bp_C_Open_Walls_from_Direction");
static_assert(sizeof(Gear003_01_bp_C_Open_Walls_from_Direction) == 0x000001, "Wrong size on Gear003_01_bp_C_Open_Walls_from_Direction");
static_assert(offsetof(Gear003_01_bp_C_Open_Walls_from_Direction, IsStartState) == 0x000000, "Member 'Gear003_01_bp_C_Open_Walls_from_Direction::IsStartState' has a wrong offset!");

// Function gear003_01_bp.gear003_01_bp_C.UserConstructionScript
// 0x00A0 (0x00A0 - 0x0000)
struct Gear003_01_bp_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_Set_Target_Plane_return;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0010(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Gear003_01_bp_C_UserConstructionScript) == 0x000004, "Wrong alignment on Gear003_01_bp_C_UserConstructionScript");
static_assert(sizeof(Gear003_01_bp_C_UserConstructionScript) == 0x0000A0, "Wrong size on Gear003_01_bp_C_UserConstructionScript");
static_assert(offsetof(Gear003_01_bp_C_UserConstructionScript, CallFunc_Set_Target_Plane_return) == 0x000000, "Member 'Gear003_01_bp_C_UserConstructionScript::CallFunc_Set_Target_Plane_return' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x000004, "Member 'Gear003_01_bp_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000010, "Member 'Gear003_01_bp_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x00009C, "Member 'Gear003_01_bp_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function gear003_01_bp.gear003_01_bp_C.off
// 0x0004 (0x0004 - 0x0000)
struct Gear003_01_bp_C_Off final
{
public:
	float                                         SpdScale;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Gear003_01_bp_C_Off) == 0x000004, "Wrong alignment on Gear003_01_bp_C_Off");
static_assert(sizeof(Gear003_01_bp_C_Off) == 0x000004, "Wrong size on Gear003_01_bp_C_Off");
static_assert(offsetof(Gear003_01_bp_C_Off, SpdScale) == 0x000000, "Member 'Gear003_01_bp_C_Off::SpdScale' has a wrong offset!");

// Function gear003_01_bp.gear003_01_bp_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Gear003_01_bp_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Gear003_01_bp_C_ReceiveTick) == 0x000004, "Wrong alignment on Gear003_01_bp_C_ReceiveTick");
static_assert(sizeof(Gear003_01_bp_C_ReceiveTick) == 0x000004, "Wrong size on Gear003_01_bp_C_ReceiveTick");
static_assert(offsetof(Gear003_01_bp_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Gear003_01_bp_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function gear003_01_bp.gear003_01_bp_C.OnSwitchToOff
// 0x0008 (0x0008 - 0x0000)
struct Gear003_01_bp_C_OnSwitchToOff final
{
public:
	class UObject*                                Switch;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Gear003_01_bp_C_OnSwitchToOff) == 0x000008, "Wrong alignment on Gear003_01_bp_C_OnSwitchToOff");
static_assert(sizeof(Gear003_01_bp_C_OnSwitchToOff) == 0x000008, "Wrong size on Gear003_01_bp_C_OnSwitchToOff");
static_assert(offsetof(Gear003_01_bp_C_OnSwitchToOff, Switch) == 0x000000, "Member 'Gear003_01_bp_C_OnSwitchToOff::Switch' has a wrong offset!");

// Function gear003_01_bp.gear003_01_bp_C.OnSwitchToOpen
// 0x0008 (0x0008 - 0x0000)
struct Gear003_01_bp_C_OnSwitchToOpen final
{
public:
	class UObject*                                Switch;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Gear003_01_bp_C_OnSwitchToOpen) == 0x000008, "Wrong alignment on Gear003_01_bp_C_OnSwitchToOpen");
static_assert(sizeof(Gear003_01_bp_C_OnSwitchToOpen) == 0x000008, "Wrong size on Gear003_01_bp_C_OnSwitchToOpen");
static_assert(offsetof(Gear003_01_bp_C_OnSwitchToOpen, Switch) == 0x000000, "Member 'Gear003_01_bp_C_OnSwitchToOpen::Switch' has a wrong offset!");

// Function gear003_01_bp.gear003_01_bp_C.off
// 0x001C (0x001C - 0x0000)
struct Gear003_01_bp_C_Off_0 final
{
public:
	struct FVector                                StartPos;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EndPos;                                            // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RunningTime_0;                                     // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Gear003_01_bp_C_Off) == 0x000004, "Wrong alignment on Gear003_01_bp_C_Off");
static_assert(sizeof(Gear003_01_bp_C_Off) == 0x00001C, "Wrong size on Gear003_01_bp_C_Off");
static_assert(offsetof(Gear003_01_bp_C_Off, StartPos) == 0x000000, "Member 'Gear003_01_bp_C_Off::StartPos' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_Off, EndPos) == 0x00000C, "Member 'Gear003_01_bp_C_Off::EndPos' has a wrong offset!");
static_assert(offsetof(Gear003_01_bp_C_Off, RunningTime_0) == 0x000018, "Member 'Gear003_01_bp_C_Off::RunningTime_0' has a wrong offset!");

// Function gear003_01_bp.gear003_01_bp_C.NotifyChangeStateTo
// 0x0004 (0x0004 - 0x0000)
struct Gear003_01_bp_C_NotifyChangeStateTo final
{
public:
	int32                                         InNewState;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Gear003_01_bp_C_NotifyChangeStateTo) == 0x000004, "Wrong alignment on Gear003_01_bp_C_NotifyChangeStateTo");
static_assert(sizeof(Gear003_01_bp_C_NotifyChangeStateTo) == 0x000004, "Wrong size on Gear003_01_bp_C_NotifyChangeStateTo");
static_assert(offsetof(Gear003_01_bp_C_NotifyChangeStateTo, InNewState) == 0x000000, "Member 'Gear003_01_bp_C_NotifyChangeStateTo::InNewState' has a wrong offset!");

// Function gear003_01_bp.gear003_01_bp_C.NotifyInitState
// 0x0004 (0x0004 - 0x0000)
struct Gear003_01_bp_C_NotifyInitState final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Gear003_01_bp_C_NotifyInitState) == 0x000004, "Wrong alignment on Gear003_01_bp_C_NotifyInitState");
static_assert(sizeof(Gear003_01_bp_C_NotifyInitState) == 0x000004, "Wrong size on Gear003_01_bp_C_NotifyInitState");
static_assert(offsetof(Gear003_01_bp_C_NotifyInitState, InValue) == 0x000000, "Member 'Gear003_01_bp_C_NotifyInitState::InValue' has a wrong offset!");

// Function gear003_01_bp.gear003_01_bp_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct Gear003_01_bp_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Gear003_01_bp_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on Gear003_01_bp_C_ReceiveActorBeginOverlap");
static_assert(sizeof(Gear003_01_bp_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on Gear003_01_bp_C_ReceiveActorBeginOverlap");
static_assert(offsetof(Gear003_01_bp_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'Gear003_01_bp_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function gear003_01_bp.gear003_01_bp_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct Gear003_01_bp_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Gear003_01_bp_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on Gear003_01_bp_C_ReceiveActorEndOverlap");
static_assert(sizeof(Gear003_01_bp_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on Gear003_01_bp_C_ReceiveActorEndOverlap");
static_assert(offsetof(Gear003_01_bp_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'Gear003_01_bp_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// Function gear003_01_bp.gear003_01_bp_C.ExecuteUbergraph_gear003_01_bp
// 0x02C8 (0x02C8 - 0x0000)
struct Gear003_01_bp_C_ExecuteUbergraph_gear003_01_bp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_SpdScale;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
