#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Gear001_03_bp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CollisionType_Enum_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass gear001_03_bp.gear001_03_bp_C
// 0x00B8 (0x02E0 - 0x0228)
class AGear001_03_bp_C final : public ADarkArchiveDoorActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UActorShadowMapMask*                    ActorShadowMapMask;                                // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube1;                                             // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_off_833AA47F4F777D0D6094AB8BEC89AB12;   // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_open_833AA47F4F777D0D6094AB8BEC89AB12;  // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_833AA47F4F777D0D6094AB8BEC89AB12; // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_open_3E083489481820DEB3EF38997FDE1E2F;  // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_off_3E083489481820DEB3EF38997FDE1E2F;   // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_3E083489481820DEB3EF38997FDE1E2F; // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            _____02;                                           // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             _____;                                             // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __b____;                                           // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          __U_;                                              // 0x0289(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28A[0x2];                                      // 0x028A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ____;                                              // 0x028C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                _U___;                                             // 0x0298(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionType_Enum                           _U____0;                                           // 0x02A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _s_Mn;                                             // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___Mn;                                             // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     __P_;                                              // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InShadow;                                          // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _Td__;                                             // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Wwise_H;                                           // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   __U__0;                                            // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOn;                                              // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void UserConstructionScript();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Off();
	void NotifyInitDoor(bool IsOn_0);
	void NotifyPlayOpenOrClose();
	void EventOn();
	void EventOff();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_gear001_03_bp(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"gear001_03_bp_C">();
	}
	static class AGear001_03_bp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGear001_03_bp_C>();
	}
};
static_assert(alignof(AGear001_03_bp_C) == 0x000008, "Wrong alignment on AGear001_03_bp_C");
static_assert(sizeof(AGear001_03_bp_C) == 0x0002E0, "Wrong size on AGear001_03_bp_C");
static_assert(offsetof(AGear001_03_bp_C, UberGraphFrame) == 0x000228, "Member 'AGear001_03_bp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, ActorShadowMapMask) == 0x000230, "Member 'AGear001_03_bp_C::ActorShadowMapMask' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, Cube1) == 0x000238, "Member 'AGear001_03_bp_C::Cube1' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, DefaultSceneRoot) == 0x000240, "Member 'AGear001_03_bp_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, Timeline_1_off_833AA47F4F777D0D6094AB8BEC89AB12) == 0x000248, "Member 'AGear001_03_bp_C::Timeline_1_off_833AA47F4F777D0D6094AB8BEC89AB12' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, Timeline_1_open_833AA47F4F777D0D6094AB8BEC89AB12) == 0x00024C, "Member 'AGear001_03_bp_C::Timeline_1_open_833AA47F4F777D0D6094AB8BEC89AB12' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, Timeline_1__Direction_833AA47F4F777D0D6094AB8BEC89AB12) == 0x000250, "Member 'AGear001_03_bp_C::Timeline_1__Direction_833AA47F4F777D0D6094AB8BEC89AB12' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, Timeline_1) == 0x000258, "Member 'AGear001_03_bp_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, Timeline_0_open_3E083489481820DEB3EF38997FDE1E2F) == 0x000260, "Member 'AGear001_03_bp_C::Timeline_0_open_3E083489481820DEB3EF38997FDE1E2F' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, Timeline_0_off_3E083489481820DEB3EF38997FDE1E2F) == 0x000264, "Member 'AGear001_03_bp_C::Timeline_0_off_3E083489481820DEB3EF38997FDE1E2F' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, Timeline_0__Direction_3E083489481820DEB3EF38997FDE1E2F) == 0x000268, "Member 'AGear001_03_bp_C::Timeline_0__Direction_3E083489481820DEB3EF38997FDE1E2F' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, Timeline_0) == 0x000270, "Member 'AGear001_03_bp_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, _____02) == 0x000278, "Member 'AGear001_03_bp_C::_____02' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, _____) == 0x000280, "Member 'AGear001_03_bp_C::_____' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, __b____) == 0x000288, "Member 'AGear001_03_bp_C::__b____' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, __U_) == 0x000289, "Member 'AGear001_03_bp_C::__U_' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, ____) == 0x00028C, "Member 'AGear001_03_bp_C::____' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, _U___) == 0x000298, "Member 'AGear001_03_bp_C::_U___' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, _U____0) == 0x0002A4, "Member 'AGear001_03_bp_C::_U____0' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, _s_Mn) == 0x0002A8, "Member 'AGear001_03_bp_C::_s_Mn' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, ___Mn) == 0x0002AC, "Member 'AGear001_03_bp_C::___Mn' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, __P_) == 0x0002B0, "Member 'AGear001_03_bp_C::__P_' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, InShadow) == 0x0002B8, "Member 'AGear001_03_bp_C::InShadow' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, _Td__) == 0x0002BC, "Member 'AGear001_03_bp_C::_Td__' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, Wwise_H) == 0x0002C0, "Member 'AGear001_03_bp_C::Wwise_H' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, __U__0) == 0x0002D0, "Member 'AGear001_03_bp_C::__U__0' has a wrong offset!");
static_assert(offsetof(AGear001_03_bp_C, IsOn) == 0x0002D8, "Member 'AGear001_03_bp_C::IsOn' has a wrong offset!");

}

