#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GearBase

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GearBase.GearBase_C
// 0x0010 (0x0238 - 0x0228)
class AGearBase_C : public ADarkArchiveElevatorActor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsToTarget;                                        // 0x0230(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          IsRunning;                                         // 0x0231(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void OnArrivedTarget();
	void OnRunning();
	void OnRep_IsToTarget();
	void OnRep_IsRunning();
	void JustMove();
	void MoveToTarget();
	void MoveToOrigin();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GearBase_C">();
	}
	static class AGearBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGearBase_C>();
	}
};
static_assert(alignof(AGearBase_C) == 0x000008, "Wrong alignment on AGearBase_C");
static_assert(sizeof(AGearBase_C) == 0x000238, "Wrong size on AGearBase_C");
static_assert(offsetof(AGearBase_C, DefaultSceneRoot) == 0x000228, "Member 'AGearBase_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGearBase_C, IsToTarget) == 0x000230, "Member 'AGearBase_C::IsToTarget' has a wrong offset!");
static_assert(offsetof(AGearBase_C, IsRunning) == 0x000231, "Member 'AGearBase_C::IsRunning' has a wrong offset!");

}

