#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Girl014b_FightView

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function Girl014b_FightView.Girl014b_FightView_C.GetData
// 0x1408 (0x1408 - 0x0000)
struct Girl014b_FightView_C_GetData final
{
public:
	class AGameCharacter*                         InPlayer;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutCount;                                          // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutMaxCount;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        OutIconPath;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         SoundId;                                           // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Level;                                             // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SkillID;                                           // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        IconPath;                                          // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         ModifierID;                                        // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModifierDataInfo                      CallFunc_K2_LoadModifierInfoStatic_ReturnValue;    // 0x0058(0x1300)(ConstParm, ContainsInstancedReference)
	int32                                         CallFunc_GetIntMapValueForLevel_ReturnValue;       // 0x1358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x135C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAvailableSkill*                        CallFunc_K2_GetAvaliableSkillInfo_ReturnValue;     // 0x1360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x1368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1369[0x7];                                     // 0x1369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModifierExhibitionData                CallFunc_FindModifierDataInfo_ReturnValue;         // 0x1370(0x0088)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x13F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13F9[0x3];                                     // 0x13F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x13FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x1400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Girl014b_FightView_C_GetData) == 0x000008, "Wrong alignment on Girl014b_FightView_C_GetData");
static_assert(sizeof(Girl014b_FightView_C_GetData) == 0x001408, "Wrong size on Girl014b_FightView_C_GetData");
static_assert(offsetof(Girl014b_FightView_C_GetData, InPlayer) == 0x000000, "Member 'Girl014b_FightView_C_GetData::InPlayer' has a wrong offset!");
static_assert(offsetof(Girl014b_FightView_C_GetData, OutCount) == 0x000008, "Member 'Girl014b_FightView_C_GetData::OutCount' has a wrong offset!");
static_assert(offsetof(Girl014b_FightView_C_GetData, OutMaxCount) == 0x00000C, "Member 'Girl014b_FightView_C_GetData::OutMaxCount' has a wrong offset!");
static_assert(offsetof(Girl014b_FightView_C_GetData, OutIconPath) == 0x000010, "Member 'Girl014b_FightView_C_GetData::OutIconPath' has a wrong offset!");
static_assert(offsetof(Girl014b_FightView_C_GetData, SoundId) == 0x000028, "Member 'Girl014b_FightView_C_GetData::SoundId' has a wrong offset!");
static_assert(offsetof(Girl014b_FightView_C_GetData, Level) == 0x00002C, "Member 'Girl014b_FightView_C_GetData::Level' has a wrong offset!");
static_assert(offsetof(Girl014b_FightView_C_GetData, SkillID) == 0x000030, "Member 'Girl014b_FightView_C_GetData::SkillID' has a wrong offset!");
static_assert(offsetof(Girl014b_FightView_C_GetData, IconPath) == 0x000038, "Member 'Girl014b_FightView_C_GetData::IconPath' has a wrong offset!");
static_assert(offsetof(Girl014b_FightView_C_GetData, ModifierID) == 0x000050, "Member 'Girl014b_FightView_C_GetData::ModifierID' has a wrong offset!");
static_assert(offsetof(Girl014b_FightView_C_GetData, CallFunc_IsValid_ReturnValue) == 0x000054, "Member 'Girl014b_FightView_C_GetData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl014b_FightView_C_GetData, CallFunc_K2_LoadModifierInfoStatic_ReturnValue) == 0x000058, "Member 'Girl014b_FightView_C_GetData::CallFunc_K2_LoadModifierInfoStatic_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl014b_FightView_C_GetData, CallFunc_GetIntMapValueForLevel_ReturnValue) == 0x001358, "Member 'Girl014b_FightView_C_GetData::CallFunc_GetIntMapValueForLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl014b_FightView_C_GetData, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00135C, "Member 'Girl014b_FightView_C_GetData::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl014b_FightView_C_GetData, CallFunc_K2_GetAvaliableSkillInfo_ReturnValue) == 0x001360, "Member 'Girl014b_FightView_C_GetData::CallFunc_K2_GetAvaliableSkillInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl014b_FightView_C_GetData, CallFunc_IsValid_ReturnValue_1) == 0x001368, "Member 'Girl014b_FightView_C_GetData::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Girl014b_FightView_C_GetData, CallFunc_FindModifierDataInfo_ReturnValue) == 0x001370, "Member 'Girl014b_FightView_C_GetData::CallFunc_FindModifierDataInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl014b_FightView_C_GetData, CallFunc_Greater_IntInt_ReturnValue) == 0x0013F8, "Member 'Girl014b_FightView_C_GetData::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl014b_FightView_C_GetData, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x0013FC, "Member 'Girl014b_FightView_C_GetData::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Girl014b_FightView_C_GetData, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x001400, "Member 'Girl014b_FightView_C_GetData::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");

}

