#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Girl015_SpecialShoot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Girl015_SpecialShoot.Girl015_SpecialShoot_C
// 0x0010 (0x0100 - 0x00F0)
class UGirl015_SpecialShoot_C final : public UGameAbilityBuffer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         BaseShootSpeed;                                    // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AddFactor;                                         // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetOverrideShootSpeed(float InValue);
	void UpdateOverrideShootSpeed();
	void K2_ReceiveActive(const class UObject* Instigator);
	void K2_ReceiveDeActive(const class UGameAbilityComponent* Pawn);
	void K2_ReceiveTick(float DeltaSeconds, const class UGameAbilityComponent* Pawn);
	void K2_ReceiveInitialize(const TArray<struct FParamInfo>& Info, const class UGameAbilityComponent* LpInstigator);
	void ExecuteUbergraph_Girl015_SpecialShoot(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Girl015_SpecialShoot_C">();
	}
	static class UGirl015_SpecialShoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGirl015_SpecialShoot_C>();
	}
};
static_assert(alignof(UGirl015_SpecialShoot_C) == 0x000008, "Wrong alignment on UGirl015_SpecialShoot_C");
static_assert(sizeof(UGirl015_SpecialShoot_C) == 0x000100, "Wrong size on UGirl015_SpecialShoot_C");
static_assert(offsetof(UGirl015_SpecialShoot_C, UberGraphFrame) == 0x0000F0, "Member 'UGirl015_SpecialShoot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGirl015_SpecialShoot_C, BaseShootSpeed) == 0x0000F8, "Member 'UGirl015_SpecialShoot_C::BaseShootSpeed' has a wrong offset!");
static_assert(offsetof(UGirl015_SpecialShoot_C, AddFactor) == 0x0000FC, "Member 'UGirl015_SpecialShoot_C::AddFactor' has a wrong offset!");

}

