#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Girl004a_skill03_self02_bp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function girl004a_skill03_self02_bp.girl004a_skill03_self02_bp_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Girl004a_skill03_self02_bp_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Girl004a_skill03_self02_bp_C_ReceiveTick) == 0x000004, "Wrong alignment on Girl004a_skill03_self02_bp_C_ReceiveTick");
static_assert(sizeof(Girl004a_skill03_self02_bp_C_ReceiveTick) == 0x000004, "Wrong size on Girl004a_skill03_self02_bp_C_ReceiveTick");
static_assert(offsetof(Girl004a_skill03_self02_bp_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Girl004a_skill03_self02_bp_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function girl004a_skill03_self02_bp.girl004a_skill03_self02_bp_C.ExecuteUbergraph_girl004a_skill03_self02_bp
// 0x00B0 (0x00B0 - 0x0000)
struct Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0020(0x0010)(ReferenceParm)
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_As______;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue_1;               // 0x0050(0x0010)(ReferenceParm)
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterial_AsMaterial_Instance_Dynamic; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMaterialParameterInfo                 K2Node_MakeStruct_MaterialParameterInfo;           // 0x008C(0x0010)(NoDestructor, HasGetValueTypeHash)
	struct FMaterialParameterInfo                 K2Node_MakeStruct_MaterialParameterInfo_1;         // 0x009C(0x0010)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp) == 0x000008, "Wrong alignment on Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp");
static_assert(sizeof(Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp) == 0x0000B0, "Wrong size on Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp");
static_assert(offsetof(Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp, EntryPoint) == 0x000000, "Member 'Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp::EntryPoint' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp, ___int_Loop_Counter_Variable) == 0x000004, "Member 'Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp, ___int_Array_Index_Variable) == 0x00000C, "Member 'Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp, ___int_Array_Index_Variable_1) == 0x000010, "Member 'Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp, ___int_Loop_Counter_Variable_1) == 0x000018, "Member 'Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp, CallFunc_GetMaterials_ReturnValue) == 0x000020, "Member 'Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp, CallFunc_Array_Get_Item) == 0x000030, "Member 'Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp, K2Node_DynamicCast_As______) == 0x000040, "Member 'Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp::K2Node_DynamicCast_As______' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp, CallFunc_Add_IntInt_ReturnValue_1) == 0x00004C, "Member 'Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp, CallFunc_GetMaterials_ReturnValue_1) == 0x000050, "Member 'Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp::CallFunc_GetMaterials_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp, CallFunc_CreateDynamicMaterial_AsMaterial_Instance_Dynamic) == 0x000068, "Member 'Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp::CallFunc_CreateDynamicMaterial_AsMaterial_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp, CallFunc_Less_IntInt_ReturnValue_1) == 0x000074, "Member 'Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000078, "Member 'Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp, CallFunc_GetSocketLocation_ReturnValue) == 0x000080, "Member 'Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp, K2Node_MakeStruct_MaterialParameterInfo) == 0x00008C, "Member 'Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp::K2Node_MakeStruct_MaterialParameterInfo' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp, K2Node_MakeStruct_MaterialParameterInfo_1) == 0x00009C, "Member 'Girl004a_skill03_self02_bp_C_ExecuteUbergraph_girl004a_skill03_self02_bp::K2Node_MakeStruct_MaterialParameterInfo_1' has a wrong offset!");

}

