#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Girl002a_skill04_self01_bp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function girl002a_skill04_self01_bp.girl002a_skill04_self01_bp_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Girl002a_skill04_self01_bp_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Girl002a_skill04_self01_bp_C_ReceiveTick) == 0x000004, "Wrong alignment on Girl002a_skill04_self01_bp_C_ReceiveTick");
static_assert(sizeof(Girl002a_skill04_self01_bp_C_ReceiveTick) == 0x000004, "Wrong size on Girl002a_skill04_self01_bp_C_ReceiveTick");
static_assert(offsetof(Girl002a_skill04_self01_bp_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Girl002a_skill04_self01_bp_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function girl002a_skill04_self01_bp.girl002a_skill04_self01_bp_C.ExecuteUbergraph_girl002a_skill04_self01_bp
// 0x0160 (0x0160 - 0x0000)
struct Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0030(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x00D4(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp) == 0x000008, "Wrong alignment on Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp");
static_assert(sizeof(Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp) == 0x000160, "Wrong size on Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp");
static_assert(offsetof(Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp, EntryPoint) == 0x000000, "Member 'Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp::EntryPoint' has a wrong offset!");
static_assert(offsetof(Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp, ___bool_Has_Been_Initd_Variable) == 0x000008, "Member 'Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp, ___bool_IsClosed_Variable) == 0x000009, "Member 'Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp, CallFunc_RandomFloatInRange_ReturnValue) == 0x00000C, "Member 'Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000010, "Member 'Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp, CallFunc_MakeRotator_ReturnValue) == 0x000018, "Member 'Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000024, "Member 'Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000030, "Member 'Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000BC, "Member 'Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000C8, "Member 'Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0000D4, "Member 'Girl002a_skill04_self01_bp_C_ExecuteUbergraph_girl002a_skill04_self01_bp::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");

}

