#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Girl014aQTEEffectBuffer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Girl014aQTEEffectBuffer.Girl014aQTEEffectBuffer_C
// 0x00C0 (0x0208 - 0x0148)
class UGirl014aQTEEffectBuffer_C final : public UGirl014aQTEEffectBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0148(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                Scale;                                             // 0x0150(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        LineEffect;                                        // 0x0160(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FVector                                Offset;                                            // 0x0178(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LineSocketName;                                    // 0x0184(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        InjuryTransmissionEffectPath;                      // 0x0190(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        IntervalHitEffectPath;                             // 0x01A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        EndEffectPath;                                     // 0x01C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        ApplyEffectPath;                                   // 0x01D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        KeepEffectPath;                                    // 0x01F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	TArray<struct FSoftObjectPath> OnGetAssetPath(const TArray<struct FParamInfo>& InParams, TArray<int32>& CharacterIDs, TArray<int32>& SkillIDs, TArray<int32>& ModifierIDs, TArray<int32>& EmitterIDs);
	void K2_ReceiveDeActive(const class UGameAbilityComponent* Pawn);
	void OnNotifyDamage(const struct FPreDamageResultData& PreResultData, const struct FApplyDamageResultData& DamageResultData);
	void K2_DrawLine(class UGirl014aQTEEffectBase* NextBuffer);
	void K2_KillLine(class UGirl014aQTEEffectBase* NextBuffer);
	void K2_ReceiveActive(const class UObject* Instigator);
	void ExecuteUbergraph_Girl014aQTEEffectBuffer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Girl014aQTEEffectBuffer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Girl014aQTEEffectBuffer_C")
	}
	static class UGirl014aQTEEffectBuffer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGirl014aQTEEffectBuffer_C>();
	}
};
DUMPER7_ASSERTS_UGirl014aQTEEffectBuffer_C;

}

