#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Girl004a_skill03_self01_bp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass girl004a_skill03_self01_bp.girl004a_skill03_self01_bp_C
// 0x0048 (0x0270 - 0x0228)
class AGirl004a_skill03_self01_bp_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      E_girl004a_skill03_self01_p;                       // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Girl004a_prop01_skm;                               // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Timeline_1_NewTrack_0_350453DD472322EA152DE583ACD96E56; // 0x0250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_350453DD472322EA152DE583ACD96E56; // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_girl004a_skill03_self01_bp(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"girl004a_skill03_self01_bp_C">();
	}
	static class AGirl004a_skill03_self01_bp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGirl004a_skill03_self01_bp_C>();
	}
};
static_assert(alignof(AGirl004a_skill03_self01_bp_C) == 0x000008, "Wrong alignment on AGirl004a_skill03_self01_bp_C");
static_assert(sizeof(AGirl004a_skill03_self01_bp_C) == 0x000270, "Wrong size on AGirl004a_skill03_self01_bp_C");
static_assert(offsetof(AGirl004a_skill03_self01_bp_C, UberGraphFrame) == 0x000228, "Member 'AGirl004a_skill03_self01_bp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGirl004a_skill03_self01_bp_C, PostProcess) == 0x000230, "Member 'AGirl004a_skill03_self01_bp_C::PostProcess' has a wrong offset!");
static_assert(offsetof(AGirl004a_skill03_self01_bp_C, E_girl004a_skill03_self01_p) == 0x000238, "Member 'AGirl004a_skill03_self01_bp_C::E_girl004a_skill03_self01_p' has a wrong offset!");
static_assert(offsetof(AGirl004a_skill03_self01_bp_C, Girl004a_prop01_skm) == 0x000240, "Member 'AGirl004a_skill03_self01_bp_C::Girl004a_prop01_skm' has a wrong offset!");
static_assert(offsetof(AGirl004a_skill03_self01_bp_C, DefaultSceneRoot) == 0x000248, "Member 'AGirl004a_skill03_self01_bp_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGirl004a_skill03_self01_bp_C, Timeline_1_NewTrack_0_350453DD472322EA152DE583ACD96E56) == 0x000250, "Member 'AGirl004a_skill03_self01_bp_C::Timeline_1_NewTrack_0_350453DD472322EA152DE583ACD96E56' has a wrong offset!");
static_assert(offsetof(AGirl004a_skill03_self01_bp_C, Timeline_1__Direction_350453DD472322EA152DE583ACD96E56) == 0x000260, "Member 'AGirl004a_skill03_self01_bp_C::Timeline_1__Direction_350453DD472322EA152DE583ACD96E56' has a wrong offset!");
static_assert(offsetof(AGirl004a_skill03_self01_bp_C, Timeline_1) == 0x000268, "Member 'AGirl004a_skill03_self01_bp_C::Timeline_1' has a wrong offset!");

}

