#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Girl004a_skill03_self01_bp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function girl004a_skill03_self01_bp.girl004a_skill03_self01_bp_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Girl004a_skill03_self01_bp_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Girl004a_skill03_self01_bp_C_ReceiveTick) == 0x000004, "Wrong alignment on Girl004a_skill03_self01_bp_C_ReceiveTick");
static_assert(sizeof(Girl004a_skill03_self01_bp_C_ReceiveTick) == 0x000004, "Wrong size on Girl004a_skill03_self01_bp_C_ReceiveTick");
static_assert(offsetof(Girl004a_skill03_self01_bp_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Girl004a_skill03_self01_bp_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function girl004a_skill03_self01_bp.girl004a_skill03_self01_bp_C.ExecuteUbergraph_girl004a_skill03_self01_bp
// 0x00B8 (0x00B8 - 0x0000)
struct Girl004a_skill03_self01_bp_C_ExecuteUbergraph_girl004a_skill03_self01_bp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x001C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Girl004a_skill03_self01_bp_C_ExecuteUbergraph_girl004a_skill03_self01_bp) == 0x000008, "Wrong alignment on Girl004a_skill03_self01_bp_C_ExecuteUbergraph_girl004a_skill03_self01_bp");
static_assert(sizeof(Girl004a_skill03_self01_bp_C_ExecuteUbergraph_girl004a_skill03_self01_bp) == 0x0000B8, "Wrong size on Girl004a_skill03_self01_bp_C_ExecuteUbergraph_girl004a_skill03_self01_bp");
static_assert(offsetof(Girl004a_skill03_self01_bp_C_ExecuteUbergraph_girl004a_skill03_self01_bp, EntryPoint) == 0x000000, "Member 'Girl004a_skill03_self01_bp_C_ExecuteUbergraph_girl004a_skill03_self01_bp::EntryPoint' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self01_bp_C_ExecuteUbergraph_girl004a_skill03_self01_bp, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'Girl004a_skill03_self01_bp_C_ExecuteUbergraph_girl004a_skill03_self01_bp::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self01_bp_C_ExecuteUbergraph_girl004a_skill03_self01_bp, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000010, "Member 'Girl004a_skill03_self01_bp_C_ExecuteUbergraph_girl004a_skill03_self01_bp::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self01_bp_C_ExecuteUbergraph_girl004a_skill03_self01_bp, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x00001C, "Member 'Girl004a_skill03_self01_bp_C_ExecuteUbergraph_girl004a_skill03_self01_bp::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self01_bp_C_ExecuteUbergraph_girl004a_skill03_self01_bp, K2Node_Event_DeltaSeconds) == 0x0000A8, "Member 'Girl004a_skill03_self01_bp_C_ExecuteUbergraph_girl004a_skill03_self01_bp::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_self01_bp_C_ExecuteUbergraph_girl004a_skill03_self01_bp, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000B0, "Member 'Girl004a_skill03_self01_bp_C_ExecuteUbergraph_girl004a_skill03_self01_bp::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

