#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Girl004a_skill03_Superlaser

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Girl004a_skill03_Superlaser.Girl004a_skill03_Superlaser_C.GetEmitterAnchorTransform
// 0x0120 (0x0120 - 0x0000)
struct Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform final
{
public:
	const class USkillEmitter*                    EmitterRef;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         Launcher;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CastActor;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InCurPoint;                                        // 0x0018(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0xC];                                       // 0x0024(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0030(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayerController*                  K2Node_DynamicCast_AsGame_Player_Controller;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetShootTargetPosition_ReturnValue;    // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E4[0xC];                                       // 0x00E4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00F0(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform) == 0x000010, "Wrong alignment on Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform");
static_assert(sizeof(Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform) == 0x000120, "Wrong size on Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform");
static_assert(offsetof(Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform, EmitterRef) == 0x000000, "Member 'Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform::EmitterRef' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform, Launcher) == 0x000008, "Member 'Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform::Launcher' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform, CastActor) == 0x000010, "Member 'Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform::CastActor' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform, InCurPoint) == 0x000018, "Member 'Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform::InCurPoint' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform, ReturnValue) == 0x000030, "Member 'Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform::ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform, CallFunc_GetController_ReturnValue) == 0x000060, "Member 'Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform, K2Node_DynamicCast_AsGame_Player_Controller) == 0x000070, "Member 'Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform::K2Node_DynamicCast_AsGame_Player_Controller' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform, CallFunc_K2_GetShootTargetPosition_ReturnValue) == 0x00007C, "Member 'Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform::CallFunc_K2_GetShootTargetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform, CallFunc_GetCameraLocation_ReturnValue) == 0x000088, "Member 'Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000094, "Member 'Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform, CallFunc_Vector_Distance_ReturnValue) == 0x0000A0, "Member 'Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform, CallFunc_Normal_ReturnValue) == 0x0000A4, "Member 'Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000B0, "Member 'Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000B4, "Member 'Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C0, "Member 'Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform, CallFunc_GetSocketLocation_ReturnValue) == 0x0000CC, "Member 'Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000D8, "Member 'Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform, CallFunc_MakeTransform_ReturnValue) == 0x0000F0, "Member 'Girl004a_skill03_Superlaser_C_GetEmitterAnchorTransform::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

}

