#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Girl014b_abpp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass girl014b_abpp.girl014b_abpp_C
// 0x0630 (0x08F0 - 0x02C0)
class UGirl014b_abpp_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_3;                        // 0x02F8(0x0138)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_2;                        // 0x0430(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0568(0x0118)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_1;                        // 0x0680(0x0138)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver;                          // 0x07B8(0x0138)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_girl014b_abpp(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"girl014b_abpp_C">();
	}
	static class UGirl014b_abpp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGirl014b_abpp_C>();
	}
};
static_assert(alignof(UGirl014b_abpp_C) == 0x000010, "Wrong alignment on UGirl014b_abpp_C");
static_assert(sizeof(UGirl014b_abpp_C) == 0x0008F0, "Wrong size on UGirl014b_abpp_C");
static_assert(offsetof(UGirl014b_abpp_C, UberGraphFrame) == 0x0002C0, "Member 'UGirl014b_abpp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGirl014b_abpp_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UGirl014b_abpp_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UGirl014b_abpp_C, AnimGraphNode_PoseDriver_3) == 0x0002F8, "Member 'UGirl014b_abpp_C::AnimGraphNode_PoseDriver_3' has a wrong offset!");
static_assert(offsetof(UGirl014b_abpp_C, AnimGraphNode_PoseDriver_2) == 0x000430, "Member 'UGirl014b_abpp_C::AnimGraphNode_PoseDriver_2' has a wrong offset!");
static_assert(offsetof(UGirl014b_abpp_C, AnimGraphNode_LinkedInputPose) == 0x000568, "Member 'UGirl014b_abpp_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UGirl014b_abpp_C, AnimGraphNode_PoseDriver_1) == 0x000680, "Member 'UGirl014b_abpp_C::AnimGraphNode_PoseDriver_1' has a wrong offset!");
static_assert(offsetof(UGirl014b_abpp_C, AnimGraphNode_PoseDriver) == 0x0007B8, "Member 'UGirl014b_abpp_C::AnimGraphNode_PoseDriver' has a wrong offset!");

}

