#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Girl004a_skill03_self02_bp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass girl004a_skill03_self02_bp.girl004a_skill03_self02_bp_C
// 0x0028 (0x0250 - 0x0228)
class AGirl004a_skill03_self02_bp_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      E_girl004a_skill03_self01_p;                       // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Girl004a_prop01_skm;                               // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_scale_273C052B4D04D6A169B74B9109BC9E57; // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_273C052B4D04D6A169B74B9109BC9E57; // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_girl004a_skill03_self02_bp(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"girl004a_skill03_self02_bp_C">();
	}
	static class AGirl004a_skill03_self02_bp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGirl004a_skill03_self02_bp_C>();
	}
};
static_assert(alignof(AGirl004a_skill03_self02_bp_C) == 0x000008, "Wrong alignment on AGirl004a_skill03_self02_bp_C");
static_assert(sizeof(AGirl004a_skill03_self02_bp_C) == 0x000250, "Wrong size on AGirl004a_skill03_self02_bp_C");
static_assert(offsetof(AGirl004a_skill03_self02_bp_C, UberGraphFrame) == 0x000228, "Member 'AGirl004a_skill03_self02_bp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGirl004a_skill03_self02_bp_C, E_girl004a_skill03_self01_p) == 0x000230, "Member 'AGirl004a_skill03_self02_bp_C::E_girl004a_skill03_self01_p' has a wrong offset!");
static_assert(offsetof(AGirl004a_skill03_self02_bp_C, Girl004a_prop01_skm) == 0x000238, "Member 'AGirl004a_skill03_self02_bp_C::Girl004a_prop01_skm' has a wrong offset!");
static_assert(offsetof(AGirl004a_skill03_self02_bp_C, Timeline_0_scale_273C052B4D04D6A169B74B9109BC9E57) == 0x000240, "Member 'AGirl004a_skill03_self02_bp_C::Timeline_0_scale_273C052B4D04D6A169B74B9109BC9E57' has a wrong offset!");
static_assert(offsetof(AGirl004a_skill03_self02_bp_C, Timeline_0__Direction_273C052B4D04D6A169B74B9109BC9E57) == 0x000244, "Member 'AGirl004a_skill03_self02_bp_C::Timeline_0__Direction_273C052B4D04D6A169B74B9109BC9E57' has a wrong offset!");
static_assert(offsetof(AGirl004a_skill03_self02_bp_C, Timeline_0) == 0x000248, "Member 'AGirl004a_skill03_self02_bp_C::Timeline_0' has a wrong offset!");

}

