#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: girl004b_skill03

#include "Basic.hpp"

#include "Game_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass girl004b_skill03.girl004b_skill03_C
// 0x0060 (0x0368 - 0x0308)
class Agirl004b_skill03_C final : public ACustomEffectActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 PiFuIDs;                                           // 0x0318(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           Sockets;                                           // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UNiagaraSystem*>                 Particles;                                         // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UNiagaraComponent*>              ParticleComponents;                                // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FRotator>                       Rotation;                                          // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_girl004b_skill03(int32 EntryPoint);
	void ReceiveDestroyed();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("girl004b_skill03_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"girl004b_skill03_C")
	}
	static class Agirl004b_skill03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Agirl004b_skill03_C>();
	}
};
DUMPER7_ASSERTS_Agirl004b_skill03_C;

}

