#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Girl015_SpecialShoot

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function Girl015_SpecialShoot.Girl015_SpecialShoot_C.SetOverrideShootSpeed
// 0x0030 (0x0030 - 0x0000)
struct Girl015_SpecialShoot_C_SetOverrideShootSpeed final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAbilityOwnerActor_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Girl015_C*                          K2Node_DynamicCast_AsBP_Girl_015;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerWeapon*                          CallFunc_GetWeapon_ReturnValue;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Girl015_SpecialShoot_C_SetOverrideShootSpeed) == 0x000008, "Wrong alignment on Girl015_SpecialShoot_C_SetOverrideShootSpeed");
static_assert(sizeof(Girl015_SpecialShoot_C_SetOverrideShootSpeed) == 0x000030, "Wrong size on Girl015_SpecialShoot_C_SetOverrideShootSpeed");
static_assert(offsetof(Girl015_SpecialShoot_C_SetOverrideShootSpeed, InValue) == 0x000000, "Member 'Girl015_SpecialShoot_C_SetOverrideShootSpeed::InValue' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_SetOverrideShootSpeed, CallFunc_GetAbilityOwnerActor_ReturnValue) == 0x000008, "Member 'Girl015_SpecialShoot_C_SetOverrideShootSpeed::CallFunc_GetAbilityOwnerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_SetOverrideShootSpeed, K2Node_DynamicCast_AsBP_Girl_015) == 0x000010, "Member 'Girl015_SpecialShoot_C_SetOverrideShootSpeed::K2Node_DynamicCast_AsBP_Girl_015' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_SetOverrideShootSpeed, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Girl015_SpecialShoot_C_SetOverrideShootSpeed::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_SetOverrideShootSpeed, CallFunc_GetWeapon_ReturnValue) == 0x000020, "Member 'Girl015_SpecialShoot_C_SetOverrideShootSpeed::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_SetOverrideShootSpeed, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'Girl015_SpecialShoot_C_SetOverrideShootSpeed::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Girl015_SpecialShoot.Girl015_SpecialShoot_C.UpdateOverrideShootSpeed
// 0x0038 (0x0038 - 0x0000)
struct Girl015_SpecialShoot_C_UpdateOverrideShootSpeed final
{
public:
	float                                         CallFunc_GetAttributeValue_ReturnValue;            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAbilityOwnerActor_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Girl015_C*                          K2Node_DynamicCast_AsBP_Girl_015;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerWeapon*                          CallFunc_GetWeapon_ReturnValue;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Girl015_SpecialShoot_C_UpdateOverrideShootSpeed) == 0x000008, "Wrong alignment on Girl015_SpecialShoot_C_UpdateOverrideShootSpeed");
static_assert(sizeof(Girl015_SpecialShoot_C_UpdateOverrideShootSpeed) == 0x000038, "Wrong size on Girl015_SpecialShoot_C_UpdateOverrideShootSpeed");
static_assert(offsetof(Girl015_SpecialShoot_C_UpdateOverrideShootSpeed, CallFunc_GetAttributeValue_ReturnValue) == 0x000000, "Member 'Girl015_SpecialShoot_C_UpdateOverrideShootSpeed::CallFunc_GetAttributeValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_UpdateOverrideShootSpeed, CallFunc_GetAbilityOwnerActor_ReturnValue) == 0x000008, "Member 'Girl015_SpecialShoot_C_UpdateOverrideShootSpeed::CallFunc_GetAbilityOwnerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_UpdateOverrideShootSpeed, K2Node_MathExpression_ReturnValue) == 0x000010, "Member 'Girl015_SpecialShoot_C_UpdateOverrideShootSpeed::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_UpdateOverrideShootSpeed, K2Node_DynamicCast_AsBP_Girl_015) == 0x000018, "Member 'Girl015_SpecialShoot_C_UpdateOverrideShootSpeed::K2Node_DynamicCast_AsBP_Girl_015' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_UpdateOverrideShootSpeed, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Girl015_SpecialShoot_C_UpdateOverrideShootSpeed::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_UpdateOverrideShootSpeed, CallFunc_GetWeapon_ReturnValue) == 0x000028, "Member 'Girl015_SpecialShoot_C_UpdateOverrideShootSpeed::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_UpdateOverrideShootSpeed, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'Girl015_SpecialShoot_C_UpdateOverrideShootSpeed::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Girl015_SpecialShoot.Girl015_SpecialShoot_C.K2_ReceiveActive
// 0x0008 (0x0008 - 0x0000)
struct Girl015_SpecialShoot_C_K2_ReceiveActive final
{
public:
	const class UObject*                          Instigator;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Girl015_SpecialShoot_C_K2_ReceiveActive) == 0x000008, "Wrong alignment on Girl015_SpecialShoot_C_K2_ReceiveActive");
static_assert(sizeof(Girl015_SpecialShoot_C_K2_ReceiveActive) == 0x000008, "Wrong size on Girl015_SpecialShoot_C_K2_ReceiveActive");
static_assert(offsetof(Girl015_SpecialShoot_C_K2_ReceiveActive, Instigator) == 0x000000, "Member 'Girl015_SpecialShoot_C_K2_ReceiveActive::Instigator' has a wrong offset!");

// Function Girl015_SpecialShoot.Girl015_SpecialShoot_C.K2_ReceiveDeActive
// 0x0008 (0x0008 - 0x0000)
struct Girl015_SpecialShoot_C_K2_ReceiveDeActive final
{
public:
	const class UGameAbilityComponent*            Pawn;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Girl015_SpecialShoot_C_K2_ReceiveDeActive) == 0x000008, "Wrong alignment on Girl015_SpecialShoot_C_K2_ReceiveDeActive");
static_assert(sizeof(Girl015_SpecialShoot_C_K2_ReceiveDeActive) == 0x000008, "Wrong size on Girl015_SpecialShoot_C_K2_ReceiveDeActive");
static_assert(offsetof(Girl015_SpecialShoot_C_K2_ReceiveDeActive, Pawn) == 0x000000, "Member 'Girl015_SpecialShoot_C_K2_ReceiveDeActive::Pawn' has a wrong offset!");

// Function Girl015_SpecialShoot.Girl015_SpecialShoot_C.K2_ReceiveTick
// 0x0010 (0x0010 - 0x0000)
struct Girl015_SpecialShoot_C_K2_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGameAbilityComponent*            Pawn;                                              // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Girl015_SpecialShoot_C_K2_ReceiveTick) == 0x000008, "Wrong alignment on Girl015_SpecialShoot_C_K2_ReceiveTick");
static_assert(sizeof(Girl015_SpecialShoot_C_K2_ReceiveTick) == 0x000010, "Wrong size on Girl015_SpecialShoot_C_K2_ReceiveTick");
static_assert(offsetof(Girl015_SpecialShoot_C_K2_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Girl015_SpecialShoot_C_K2_ReceiveTick::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_K2_ReceiveTick, Pawn) == 0x000008, "Member 'Girl015_SpecialShoot_C_K2_ReceiveTick::Pawn' has a wrong offset!");

// Function Girl015_SpecialShoot.Girl015_SpecialShoot_C.K2_ReceiveInitialize
// 0x0018 (0x0018 - 0x0000)
struct Girl015_SpecialShoot_C_K2_ReceiveInitialize final
{
public:
	TArray<struct FParamInfo>                     Info;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	const class UGameAbilityComponent*            LpInstigator;                                      // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Girl015_SpecialShoot_C_K2_ReceiveInitialize) == 0x000008, "Wrong alignment on Girl015_SpecialShoot_C_K2_ReceiveInitialize");
static_assert(sizeof(Girl015_SpecialShoot_C_K2_ReceiveInitialize) == 0x000018, "Wrong size on Girl015_SpecialShoot_C_K2_ReceiveInitialize");
static_assert(offsetof(Girl015_SpecialShoot_C_K2_ReceiveInitialize, Info) == 0x000000, "Member 'Girl015_SpecialShoot_C_K2_ReceiveInitialize::Info' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_K2_ReceiveInitialize, LpInstigator) == 0x000010, "Member 'Girl015_SpecialShoot_C_K2_ReceiveInitialize::LpInstigator' has a wrong offset!");

// Function Girl015_SpecialShoot.Girl015_SpecialShoot_C.ExecuteUbergraph_Girl015_SpecialShoot
// 0x0088 (0x0088 - 0x0000)
struct Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UObject*                          K2Node_Event_Instigator;                           // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UGameAbilityComponent*            K2Node_Event_Pawn_1;                               // 0x0010(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAbilityOwnerActor_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAbilityOwnerActor_ReturnValue_1;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Girl015_C*                          K2Node_DynamicCast_AsBP_Girl_015;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Girl015_C*                          K2Node_DynamicCast_AsBP_Girl_015_1;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UGameAbilityComponent*            K2Node_Event_Pawn;                                 // 0x0048(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FParamInfo>                     K2Node_Event_Info;                                 // 0x0050(0x0010)(ConstParm, ReferenceParm)
	const class UGameAbilityComponent*            K2Node_Event_lpInstigator;                         // 0x0060(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevel_ReturnValue_1;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValueStringForLevel_ReturnValue;  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValueStringForLevel_ReturnValue_1; // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot) == 0x000008, "Wrong alignment on Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot");
static_assert(sizeof(Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot) == 0x000088, "Wrong size on Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot");
static_assert(offsetof(Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot, EntryPoint) == 0x000000, "Member 'Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot::EntryPoint' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot, K2Node_Event_Instigator) == 0x000008, "Member 'Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot::K2Node_Event_Instigator' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot, K2Node_Event_Pawn_1) == 0x000010, "Member 'Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot::K2Node_Event_Pawn_1' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot, CallFunc_GetAbilityOwnerActor_ReturnValue) == 0x000018, "Member 'Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot::CallFunc_GetAbilityOwnerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot, CallFunc_GetAbilityOwnerActor_ReturnValue_1) == 0x000020, "Member 'Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot::CallFunc_GetAbilityOwnerActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot, K2Node_DynamicCast_AsBP_Girl_015) == 0x000028, "Member 'Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot::K2Node_DynamicCast_AsBP_Girl_015' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot, K2Node_DynamicCast_AsBP_Girl_015_1) == 0x000038, "Member 'Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot::K2Node_DynamicCast_AsBP_Girl_015_1' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot, CallFunc_IsValid_ReturnValue_1) == 0x000042, "Member 'Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot, K2Node_Event_DeltaSeconds) == 0x000044, "Member 'Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot, K2Node_Event_Pawn) == 0x000048, "Member 'Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot::K2Node_Event_Pawn' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot, K2Node_Event_Info) == 0x000050, "Member 'Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot::K2Node_Event_Info' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot, K2Node_Event_lpInstigator) == 0x000060, "Member 'Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot::K2Node_Event_lpInstigator' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot, CallFunc_Greater_IntInt_ReturnValue) == 0x00006C, "Member 'Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot, CallFunc_GetLevel_ReturnValue) == 0x000070, "Member 'Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot::CallFunc_GetLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot, CallFunc_GetLevel_ReturnValue_1) == 0x000074, "Member 'Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot::CallFunc_GetLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot, CallFunc_GetFloatValueStringForLevel_ReturnValue) == 0x000078, "Member 'Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot::CallFunc_GetFloatValueStringForLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot, CallFunc_GetFloatValueStringForLevel_ReturnValue_1) == 0x00007C, "Member 'Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot::CallFunc_GetFloatValueStringForLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000080, "Member 'Girl015_SpecialShoot_C_ExecuteUbergraph_Girl015_SpecialShoot::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

}

