#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Girl002_FightView

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Girl002_FightView.Girl002_FightView_C.GetData
// 0x0060 (0x0060 - 0x0000)
struct Girl002_FightView_C_GetData final
{
public:
	class AGameCharacter*                         InPlayer;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutCount;                                          // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutMaxCount;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        OutIconPath;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         SoundId;                                           // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        IconPath;                                          // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Girl002_C*                          K2Node_DynamicCast_AsBP_Girl_002;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Girl002_FightView_C_GetData) == 0x000008, "Wrong alignment on Girl002_FightView_C_GetData");
static_assert(sizeof(Girl002_FightView_C_GetData) == 0x000060, "Wrong size on Girl002_FightView_C_GetData");
static_assert(offsetof(Girl002_FightView_C_GetData, InPlayer) == 0x000000, "Member 'Girl002_FightView_C_GetData::InPlayer' has a wrong offset!");
static_assert(offsetof(Girl002_FightView_C_GetData, OutCount) == 0x000008, "Member 'Girl002_FightView_C_GetData::OutCount' has a wrong offset!");
static_assert(offsetof(Girl002_FightView_C_GetData, OutMaxCount) == 0x00000C, "Member 'Girl002_FightView_C_GetData::OutMaxCount' has a wrong offset!");
static_assert(offsetof(Girl002_FightView_C_GetData, OutIconPath) == 0x000010, "Member 'Girl002_FightView_C_GetData::OutIconPath' has a wrong offset!");
static_assert(offsetof(Girl002_FightView_C_GetData, SoundId) == 0x000028, "Member 'Girl002_FightView_C_GetData::SoundId' has a wrong offset!");
static_assert(offsetof(Girl002_FightView_C_GetData, IconPath) == 0x000030, "Member 'Girl002_FightView_C_GetData::IconPath' has a wrong offset!");
static_assert(offsetof(Girl002_FightView_C_GetData, Count) == 0x000048, "Member 'Girl002_FightView_C_GetData::Count' has a wrong offset!");
static_assert(offsetof(Girl002_FightView_C_GetData, K2Node_DynamicCast_AsBP_Girl_002) == 0x000050, "Member 'Girl002_FightView_C_GetData::K2Node_DynamicCast_AsBP_Girl_002' has a wrong offset!");
static_assert(offsetof(Girl002_FightView_C_GetData, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'Girl002_FightView_C_GetData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Girl002_FightView_C_GetData, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00005C, "Member 'Girl002_FightView_C_GetData::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");

}

