#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: girl014a_skill01_SMAgent

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Game_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass girl014a_skill01_SMAgent.girl014a_skill01_SMAgent_C
// 0x0050 (0x02B8 - 0x0268)
class Agirl014a_skill01_SMAgent_C final : public ASkillSkeletalMeshAgent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_0_NewTrack_0_E703B1354B308E40D151DBBCD46F2C4D; // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_E703B1354B308E40D151DBBCD46F2C4D; // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_275[0x3];                                      // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SkillMontage;                                      // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_Girl014a_Prop02_C*                 AnimBP;                                            // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayerController*                  PlayerController;                                  // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         OwnerCharacter;                                    // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      IdleAnim;                                          // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      GameNiagara;                                       // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      GameNiagara_1;                                     // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void OnNotifyEnd_EA90ADDA46E4C027EC141D8D5621A07D(class FName NotifyName);
	void OnNotifyBegin_EA90ADDA46E4C027EC141D8D5621A07D(class FName NotifyName);
	void OnInterrupted_EA90ADDA46E4C027EC141D8D5621A07D(class FName NotifyName);
	void OnBlendOut_EA90ADDA46E4C027EC141D8D5621A07D(class FName NotifyName);
	void OnCompleted_EA90ADDA46E4C027EC141D8D5621A07D(class FName NotifyName);
	void ReceiveBeginPlay();
	void OnAbilityCastSkill_Event_0(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void OnSkillCancel_Event_0(int32 SkillID, ESkillInterruptedType InType, int32 InInterruptSkillID);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ExecuteUbergraph_girl014a_skill01_SMAgent(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("girl014a_skill01_SMAgent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"girl014a_skill01_SMAgent_C")
	}
	static class Agirl014a_skill01_SMAgent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Agirl014a_skill01_SMAgent_C>();
	}
};
DUMPER7_ASSERTS_Agirl014a_skill01_SMAgent_C;

}

