#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: girl014a_skill01_self02_bp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass girl014a_skill01_self02_bp.girl014a_skill01_self02_bp_C
// 0x0068 (0x0370 - 0x0308)
class Agirl014a_skill01_self02_bp_C final : public ACustomEffectActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           SocketNames;                                       // 0x0318(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector2D                              OffsetYaw;                                         // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              OffsetPitch;                                       // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFollowRotation;                                   // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         UIPath;                                            // 0x0340(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        PaticalePath;                                      // 0x0358(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	TArray<struct FSoftObjectPath> OnGetAssetPath();
	void GetClosedPoint(class USkeletalMeshComponent* MeshComponent, class FName BoneName, const struct FVector& Point, struct FVector* ClosestPoint);
	void Attach_to_Component(class FName SocketName_0, class USkeletalMeshComponent* ParentComponent_0, const struct FVector& OffsetLoc);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_girl014a_skill01_self02_bp(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("girl014a_skill01_self02_bp_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"girl014a_skill01_self02_bp_C")
	}
	static class Agirl014a_skill01_self02_bp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Agirl014a_skill01_self02_bp_C>();
	}
};
DUMPER7_ASSERTS_Agirl014a_skill01_self02_bp_C;

}

