#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Girl002a_skill04_self01_bp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass girl002a_skill04_self01_bp.girl002a_skill04_self01_bp_C
// 0x0028 (0x0250 - 0x0228)
class AGirl002a_skill04_self01_bp_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      E_girl002a_skill04_self11_p;                       // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewVar_0;                                          // 0x0240(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_girl002a_skill04_self01_bp(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"girl002a_skill04_self01_bp_C">();
	}
	static class AGirl002a_skill04_self01_bp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGirl002a_skill04_self01_bp_C>();
	}
};
static_assert(alignof(AGirl002a_skill04_self01_bp_C) == 0x000008, "Wrong alignment on AGirl002a_skill04_self01_bp_C");
static_assert(sizeof(AGirl002a_skill04_self01_bp_C) == 0x000250, "Wrong size on AGirl002a_skill04_self01_bp_C");
static_assert(offsetof(AGirl002a_skill04_self01_bp_C, UberGraphFrame) == 0x000228, "Member 'AGirl002a_skill04_self01_bp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGirl002a_skill04_self01_bp_C, E_girl002a_skill04_self11_p) == 0x000230, "Member 'AGirl002a_skill04_self01_bp_C::E_girl002a_skill04_self11_p' has a wrong offset!");
static_assert(offsetof(AGirl002a_skill04_self01_bp_C, DefaultSceneRoot) == 0x000238, "Member 'AGirl002a_skill04_self01_bp_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGirl002a_skill04_self01_bp_C, NewVar_0) == 0x000240, "Member 'AGirl002a_skill04_self01_bp_C::NewVar_0' has a wrong offset!");

}

