#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: girl023_abpp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass girl023_abpp.girl023_abpp_C
// 0x0630 (0x08F0 - 0x02C0)
class Ugirl023_abpp_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_3;                        // 0x02C8(0x0138)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_2;                        // 0x0400(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0538(0x0118)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_1;                        // 0x0650(0x0138)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver;                          // 0x0788(0x0138)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x08C0(0x0030)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_girl023_abpp(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("girl023_abpp_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"girl023_abpp_C")
	}
	static class Ugirl023_abpp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ugirl023_abpp_C>();
	}
};
DUMPER7_ASSERTS_Ugirl023_abpp_C;

}

