#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HandleTrackUI

#include "Basic.hpp"


namespace SDK::Params
{

// Function HandleTrackUI.HandleTrackUI_C.OnTrigger
// 0x0018 (0x0018 - 0x0000)
struct HandleTrackUI_C_OnTrigger final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameTaskActor*                         CallFunc_GetGameTaskActor_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelPathPainter*                      CallFunc_GetLevelPathPainter_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HandleTrackUI_C_OnTrigger) == 0x000008, "Wrong alignment on HandleTrackUI_C_OnTrigger");
static_assert(sizeof(HandleTrackUI_C_OnTrigger) == 0x000018, "Wrong size on HandleTrackUI_C_OnTrigger");
static_assert(offsetof(HandleTrackUI_C_OnTrigger, ReturnValue) == 0x000000, "Member 'HandleTrackUI_C_OnTrigger::ReturnValue' has a wrong offset!");
static_assert(offsetof(HandleTrackUI_C_OnTrigger, CallFunc_GetGameTaskActor_ReturnValue) == 0x000008, "Member 'HandleTrackUI_C_OnTrigger::CallFunc_GetGameTaskActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(HandleTrackUI_C_OnTrigger, CallFunc_GetLevelPathPainter_ReturnValue) == 0x000010, "Member 'HandleTrackUI_C_OnTrigger::CallFunc_GetLevelPathPainter_ReturnValue' has a wrong offset!");

// Function HandleTrackUI.HandleTrackUI_C.GetSpecialStaticDescription
// 0x0030 (0x0030 - 0x0000)
struct HandleTrackUI_C_GetSpecialStaticDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(HandleTrackUI_C_GetSpecialStaticDescription) == 0x000008, "Wrong alignment on HandleTrackUI_C_GetSpecialStaticDescription");
static_assert(sizeof(HandleTrackUI_C_GetSpecialStaticDescription) == 0x000030, "Wrong size on HandleTrackUI_C_GetSpecialStaticDescription");
static_assert(offsetof(HandleTrackUI_C_GetSpecialStaticDescription, ReturnValue) == 0x000000, "Member 'HandleTrackUI_C_GetSpecialStaticDescription::ReturnValue' has a wrong offset!");
static_assert(offsetof(HandleTrackUI_C_GetSpecialStaticDescription, CallFunc_Conv_BoolToString_ReturnValue) == 0x000010, "Member 'HandleTrackUI_C_GetSpecialStaticDescription::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(HandleTrackUI_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'HandleTrackUI_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

}

