#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HideAllUIWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function HideAllUIWidget.HideAllUIWidget_C.OnTrigger__Overridden
// 0x0058 (0x0058 - 0x0000)
struct HideAllUIWidget_C_OnTrigger__Overridden final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UUserWidget*, ESlateVisibility>    Widgets;                                           // 0x0008(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
};
static_assert(alignof(HideAllUIWidget_C_OnTrigger__Overridden) == 0x000008, "Wrong alignment on HideAllUIWidget_C_OnTrigger__Overridden");
static_assert(sizeof(HideAllUIWidget_C_OnTrigger__Overridden) == 0x000058, "Wrong size on HideAllUIWidget_C_OnTrigger__Overridden");
static_assert(offsetof(HideAllUIWidget_C_OnTrigger__Overridden, ReturnValue) == 0x000000, "Member 'HideAllUIWidget_C_OnTrigger__Overridden::ReturnValue' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_OnTrigger__Overridden, Widgets) == 0x000008, "Member 'HideAllUIWidget_C_OnTrigger__Overridden::Widgets' has a wrong offset!");

// Function HideAllUIWidget.HideAllUIWidget_C.HideAllUI
// 0x00F8 (0x00F8 - 0x0000)
struct HideAllUIWidget_C_HideAllUI final
{
public:
	TMap<class UUserWidget*, ESlateVisibility>    ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TMap<class UUserWidget*, ESlateVisibility>    Widgets;                                           // 0x0050(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         ___int_Array_Index_Variable;                       // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x00B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_fight_C*                           K2Node_DynamicCast_AsUmg_Fight;                    // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_fight_pc_C*                        K2Node_DynamicCast_AsUmg_Fight_Pc;                 // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HideAllUIWidget_C_HideAllUI) == 0x000008, "Wrong alignment on HideAllUIWidget_C_HideAllUI");
static_assert(sizeof(HideAllUIWidget_C_HideAllUI) == 0x0000F8, "Wrong size on HideAllUIWidget_C_HideAllUI");
static_assert(offsetof(HideAllUIWidget_C_HideAllUI, ReturnValue) == 0x000000, "Member 'HideAllUIWidget_C_HideAllUI::ReturnValue' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_HideAllUI, Widgets) == 0x000050, "Member 'HideAllUIWidget_C_HideAllUI::Widgets' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_HideAllUI, ___int_Array_Index_Variable) == 0x0000A0, "Member 'HideAllUIWidget_C_HideAllUI::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_HideAllUI, ___int_Loop_Counter_Variable) == 0x0000A4, "Member 'HideAllUIWidget_C_HideAllUI::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_HideAllUI, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'HideAllUIWidget_C_HideAllUI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_HideAllUI, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x0000B0, "Member 'HideAllUIWidget_C_HideAllUI::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_HideAllUI, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'HideAllUIWidget_C_HideAllUI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_HideAllUI, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'HideAllUIWidget_C_HideAllUI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_HideAllUI, CallFunc_Less_IntInt_ReturnValue) == 0x0000D0, "Member 'HideAllUIWidget_C_HideAllUI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_HideAllUI, K2Node_DynamicCast_AsUmg_Fight) == 0x0000D8, "Member 'HideAllUIWidget_C_HideAllUI::K2Node_DynamicCast_AsUmg_Fight' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_HideAllUI, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'HideAllUIWidget_C_HideAllUI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_HideAllUI, K2Node_DynamicCast_AsUmg_Fight_Pc) == 0x0000E8, "Member 'HideAllUIWidget_C_HideAllUI::K2Node_DynamicCast_AsUmg_Fight_Pc' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_HideAllUI, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'HideAllUIWidget_C_HideAllUI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_HideAllUI, CallFunc_GetVisibility_ReturnValue) == 0x0000F1, "Member 'HideAllUIWidget_C_HideAllUI::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");

// Function HideAllUIWidget.HideAllUIWidget_C.DealFightUI__Overridden
// 0x0010 (0x0010 - 0x0000)
struct HideAllUIWidget_C_DealFightUI__Overridden final
{
public:
	bool                                          IsHide_0;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            FightWidget;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HideAllUIWidget_C_DealFightUI__Overridden) == 0x000008, "Wrong alignment on HideAllUIWidget_C_DealFightUI__Overridden");
static_assert(sizeof(HideAllUIWidget_C_DealFightUI__Overridden) == 0x000010, "Wrong size on HideAllUIWidget_C_DealFightUI__Overridden");
static_assert(offsetof(HideAllUIWidget_C_DealFightUI__Overridden, IsHide_0) == 0x000000, "Member 'HideAllUIWidget_C_DealFightUI__Overridden::IsHide_0' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_DealFightUI__Overridden, FightWidget) == 0x000008, "Member 'HideAllUIWidget_C_DealFightUI__Overridden::FightWidget' has a wrong offset!");

// Function HideAllUIWidget.HideAllUIWidget_C.ShowAllUI
// 0x00F8 (0x00F8 - 0x0000)
struct HideAllUIWidget_C_ShowAllUI final
{
public:
	TMap<class UUserWidget*, ESlateVisibility>    WidgetsIn;                                         // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	TMap<class UUserWidget*, ESlateVisibility>    Widgets;                                           // 0x0050(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         ___int_Array_Index_Variable;                       // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    CallFunc_Map_Keys_Keys;                            // 0x00B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_fight_C*                           K2Node_DynamicCast_AsUmg_Fight;                    // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_fight_pc_C*                        K2Node_DynamicCast_AsUmg_Fight_Pc;                 // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_Map_Find_Value;                           // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EB[0x1];                                       // 0x00EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HideAllUIWidget_C_ShowAllUI) == 0x000008, "Wrong alignment on HideAllUIWidget_C_ShowAllUI");
static_assert(sizeof(HideAllUIWidget_C_ShowAllUI) == 0x0000F8, "Wrong size on HideAllUIWidget_C_ShowAllUI");
static_assert(offsetof(HideAllUIWidget_C_ShowAllUI, WidgetsIn) == 0x000000, "Member 'HideAllUIWidget_C_ShowAllUI::WidgetsIn' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_ShowAllUI, Widgets) == 0x000050, "Member 'HideAllUIWidget_C_ShowAllUI::Widgets' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_ShowAllUI, ___int_Array_Index_Variable) == 0x0000A0, "Member 'HideAllUIWidget_C_ShowAllUI::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_ShowAllUI, ___int_Loop_Counter_Variable) == 0x0000A4, "Member 'HideAllUIWidget_C_ShowAllUI::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_ShowAllUI, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'HideAllUIWidget_C_ShowAllUI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_ShowAllUI, CallFunc_Map_Length_ReturnValue) == 0x0000AC, "Member 'HideAllUIWidget_C_ShowAllUI::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_ShowAllUI, CallFunc_Map_Keys_Keys) == 0x0000B0, "Member 'HideAllUIWidget_C_ShowAllUI::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_ShowAllUI, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C0, "Member 'HideAllUIWidget_C_ShowAllUI::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_ShowAllUI, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'HideAllUIWidget_C_ShowAllUI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_ShowAllUI, K2Node_DynamicCast_AsUmg_Fight) == 0x0000D0, "Member 'HideAllUIWidget_C_ShowAllUI::K2Node_DynamicCast_AsUmg_Fight' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_ShowAllUI, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'HideAllUIWidget_C_ShowAllUI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_ShowAllUI, K2Node_DynamicCast_AsUmg_Fight_Pc) == 0x0000E0, "Member 'HideAllUIWidget_C_ShowAllUI::K2Node_DynamicCast_AsUmg_Fight_Pc' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_ShowAllUI, K2Node_DynamicCast_bSuccess_1) == 0x0000E8, "Member 'HideAllUIWidget_C_ShowAllUI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_ShowAllUI, CallFunc_Map_Find_Value) == 0x0000E9, "Member 'HideAllUIWidget_C_ShowAllUI::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_ShowAllUI, CallFunc_Map_Find_ReturnValue) == 0x0000EA, "Member 'HideAllUIWidget_C_ShowAllUI::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_ShowAllUI, CallFunc_Array_Length_ReturnValue) == 0x0000EC, "Member 'HideAllUIWidget_C_ShowAllUI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_ShowAllUI, CallFunc_Less_IntInt_ReturnValue) == 0x0000F0, "Member 'HideAllUIWidget_C_ShowAllUI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function HideAllUIWidget.HideAllUIWidget_C.GetFightWidgets
// 0x0060 (0x0060 - 0x0000)
struct HideAllUIWidget_C_GetFightWidgets final
{
public:
	TMap<int32, ESlateVisibility>                 Res;                                               // 0x0000(0x0050)(Parm, OutParm)
	class ABP_TaskActor_C*                        CallFunc_GetActorOfClass_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HideAllUIWidget_C_GetFightWidgets) == 0x000008, "Wrong alignment on HideAllUIWidget_C_GetFightWidgets");
static_assert(sizeof(HideAllUIWidget_C_GetFightWidgets) == 0x000060, "Wrong size on HideAllUIWidget_C_GetFightWidgets");
static_assert(offsetof(HideAllUIWidget_C_GetFightWidgets, Res) == 0x000000, "Member 'HideAllUIWidget_C_GetFightWidgets::Res' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_GetFightWidgets, CallFunc_GetActorOfClass_ReturnValue) == 0x000050, "Member 'HideAllUIWidget_C_GetFightWidgets::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_GetFightWidgets, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'HideAllUIWidget_C_GetFightWidgets::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function HideAllUIWidget.HideAllUIWidget_C.GetUIWidgets
// 0x0060 (0x0060 - 0x0000)
struct HideAllUIWidget_C_GetUIWidgets final
{
public:
	TMap<class UUserWidget*, ESlateVisibility>    Res;                                               // 0x0000(0x0050)(Parm, OutParm, ContainsInstancedReference)
	class ABP_TaskActor_C*                        CallFunc_GetActorOfClass_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HideAllUIWidget_C_GetUIWidgets) == 0x000008, "Wrong alignment on HideAllUIWidget_C_GetUIWidgets");
static_assert(sizeof(HideAllUIWidget_C_GetUIWidgets) == 0x000060, "Wrong size on HideAllUIWidget_C_GetUIWidgets");
static_assert(offsetof(HideAllUIWidget_C_GetUIWidgets, Res) == 0x000000, "Member 'HideAllUIWidget_C_GetUIWidgets::Res' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_GetUIWidgets, CallFunc_GetActorOfClass_ReturnValue) == 0x000050, "Member 'HideAllUIWidget_C_GetUIWidgets::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_GetUIWidgets, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'HideAllUIWidget_C_GetUIWidgets::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function HideAllUIWidget.HideAllUIWidget_C.SetUIWidgets
// 0x0060 (0x0060 - 0x0000)
struct HideAllUIWidget_C_SetUIWidgets final
{
public:
	TMap<class UUserWidget*, ESlateVisibility>    InWidgets;                                         // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	class ABP_TaskActor_C*                        CallFunc_GetActorOfClass_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HideAllUIWidget_C_SetUIWidgets) == 0x000008, "Wrong alignment on HideAllUIWidget_C_SetUIWidgets");
static_assert(sizeof(HideAllUIWidget_C_SetUIWidgets) == 0x000060, "Wrong size on HideAllUIWidget_C_SetUIWidgets");
static_assert(offsetof(HideAllUIWidget_C_SetUIWidgets, InWidgets) == 0x000000, "Member 'HideAllUIWidget_C_SetUIWidgets::InWidgets' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_SetUIWidgets, CallFunc_GetActorOfClass_ReturnValue) == 0x000050, "Member 'HideAllUIWidget_C_SetUIWidgets::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_SetUIWidgets, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'HideAllUIWidget_C_SetUIWidgets::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function HideAllUIWidget.HideAllUIWidget_C.SetFightWidgets
// 0x0060 (0x0060 - 0x0000)
struct HideAllUIWidget_C_SetFightWidgets final
{
public:
	TMap<int32, ESlateVisibility>                 In;                                                // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	class ABP_TaskActor_C*                        CallFunc_GetActorOfClass_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HideAllUIWidget_C_SetFightWidgets) == 0x000008, "Wrong alignment on HideAllUIWidget_C_SetFightWidgets");
static_assert(sizeof(HideAllUIWidget_C_SetFightWidgets) == 0x000060, "Wrong size on HideAllUIWidget_C_SetFightWidgets");
static_assert(offsetof(HideAllUIWidget_C_SetFightWidgets, In) == 0x000000, "Member 'HideAllUIWidget_C_SetFightWidgets::In' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_SetFightWidgets, CallFunc_GetActorOfClass_ReturnValue) == 0x000050, "Member 'HideAllUIWidget_C_SetFightWidgets::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_SetFightWidgets, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'HideAllUIWidget_C_SetFightWidgets::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// LuaFunction HideAllUIWidget.HideAllUIWidget_C.OnTrigger
// 0x0058 (0x0058 - 0x0000)
struct HideAllUIWidget_C_OnTrigger final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UUserWidget*, ESlateVisibility>    Widgets;                                           // 0x0008(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
};
static_assert(alignof(HideAllUIWidget_C_OnTrigger) == 0x000008, "Wrong alignment on HideAllUIWidget_C_OnTrigger");
static_assert(sizeof(HideAllUIWidget_C_OnTrigger) == 0x000058, "Wrong size on HideAllUIWidget_C_OnTrigger");
static_assert(offsetof(HideAllUIWidget_C_OnTrigger, ReturnValue) == 0x000000, "Member 'HideAllUIWidget_C_OnTrigger::ReturnValue' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_OnTrigger, Widgets) == 0x000008, "Member 'HideAllUIWidget_C_OnTrigger::Widgets' has a wrong offset!");

// LuaFunction HideAllUIWidget.HideAllUIWidget_C.DealFightUI
// 0x0010 (0x0010 - 0x0000)
struct HideAllUIWidget_C_DealFightUI final
{
public:
	bool                                          IsHide_0;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            FightWidget;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HideAllUIWidget_C_DealFightUI) == 0x000008, "Wrong alignment on HideAllUIWidget_C_DealFightUI");
static_assert(sizeof(HideAllUIWidget_C_DealFightUI) == 0x000010, "Wrong size on HideAllUIWidget_C_DealFightUI");
static_assert(offsetof(HideAllUIWidget_C_DealFightUI, IsHide_0) == 0x000000, "Member 'HideAllUIWidget_C_DealFightUI::IsHide_0' has a wrong offset!");
static_assert(offsetof(HideAllUIWidget_C_DealFightUI, FightWidget) == 0x000008, "Member 'HideAllUIWidget_C_DealFightUI::FightWidget' has a wrong offset!");

// Function HideAllUIWidget.HideAllUIWidget_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct HideAllUIWidget_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(HideAllUIWidget_C_GetModuleName) == 0x000008, "Wrong alignment on HideAllUIWidget_C_GetModuleName");
static_assert(sizeof(HideAllUIWidget_C_GetModuleName) == 0x000010, "Wrong size on HideAllUIWidget_C_GetModuleName");
static_assert(offsetof(HideAllUIWidget_C_GetModuleName, ReturnValue) == 0x000000, "Member 'HideAllUIWidget_C_GetModuleName::ReturnValue' has a wrong offset!");

}

