#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HotPatch

#include "Basic.hpp"

#include "HotPatch_structs.hpp"


namespace SDK::Params
{

// Function HotPatch.ExtraPatchLibrary.CalcDownloadSize
// 0x0060 (0x0060 - 0x0000)
struct ExtraPatchLibrary_CalcDownloadSize final
{
public:
	TArray<class FString>                         WwiseLanguages;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FString, int64>                    ReturnValue;                                       // 0x0010(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExtraPatchLibrary_CalcDownloadSize) == 0x000008, "Wrong alignment on ExtraPatchLibrary_CalcDownloadSize");
static_assert(sizeof(ExtraPatchLibrary_CalcDownloadSize) == 0x000060, "Wrong size on ExtraPatchLibrary_CalcDownloadSize");
static_assert(offsetof(ExtraPatchLibrary_CalcDownloadSize, WwiseLanguages) == 0x000000, "Member 'ExtraPatchLibrary_CalcDownloadSize::WwiseLanguages' has a wrong offset!");
static_assert(offsetof(ExtraPatchLibrary_CalcDownloadSize, ReturnValue) == 0x000010, "Member 'ExtraPatchLibrary_CalcDownloadSize::ReturnValue' has a wrong offset!");

// Function HotPatch.ExtraPatchLibrary.CheckDiskSpace
// 0x0010 (0x0010 - 0x0000)
struct ExtraPatchLibrary_CheckDiskSpace final
{
public:
	int64                                         InNeeded;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ExtraPatchLibrary_CheckDiskSpace) == 0x000008, "Wrong alignment on ExtraPatchLibrary_CheckDiskSpace");
static_assert(sizeof(ExtraPatchLibrary_CheckDiskSpace) == 0x000010, "Wrong size on ExtraPatchLibrary_CheckDiskSpace");
static_assert(offsetof(ExtraPatchLibrary_CheckDiskSpace, InNeeded) == 0x000000, "Member 'ExtraPatchLibrary_CheckDiskSpace::InNeeded' has a wrong offset!");
static_assert(offsetof(ExtraPatchLibrary_CheckDiskSpace, ReturnValue) == 0x000008, "Member 'ExtraPatchLibrary_CheckDiskSpace::ReturnValue' has a wrong offset!");

// Function HotPatch.ExtraPatchLibrary.GetDiskFreeSpaceSize
// 0x0008 (0x0008 - 0x0000)
struct ExtraPatchLibrary_GetDiskFreeSpaceSize final
{
public:
	int64                                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExtraPatchLibrary_GetDiskFreeSpaceSize) == 0x000008, "Wrong alignment on ExtraPatchLibrary_GetDiskFreeSpaceSize");
static_assert(sizeof(ExtraPatchLibrary_GetDiskFreeSpaceSize) == 0x000008, "Wrong size on ExtraPatchLibrary_GetDiskFreeSpaceSize");
static_assert(offsetof(ExtraPatchLibrary_GetDiskFreeSpaceSize, ReturnValue) == 0x000000, "Member 'ExtraPatchLibrary_GetDiskFreeSpaceSize::ReturnValue' has a wrong offset!");

// Function HotPatch.ExtraPatchLibrary.GetDownloadedBytes
// 0x0008 (0x0008 - 0x0000)
struct ExtraPatchLibrary_GetDownloadedBytes final
{
public:
	int64                                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExtraPatchLibrary_GetDownloadedBytes) == 0x000008, "Wrong alignment on ExtraPatchLibrary_GetDownloadedBytes");
static_assert(sizeof(ExtraPatchLibrary_GetDownloadedBytes) == 0x000008, "Wrong size on ExtraPatchLibrary_GetDownloadedBytes");
static_assert(offsetof(ExtraPatchLibrary_GetDownloadedBytes, ReturnValue) == 0x000000, "Member 'ExtraPatchLibrary_GetDownloadedBytes::ReturnValue' has a wrong offset!");

// Function HotPatch.ExtraPatchLibrary.GetDownloadResult
// 0x0010 (0x0010 - 0x0000)
struct ExtraPatchLibrary_GetDownloadResult final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExtraPatchLibrary_GetDownloadResult) == 0x000008, "Wrong alignment on ExtraPatchLibrary_GetDownloadResult");
static_assert(sizeof(ExtraPatchLibrary_GetDownloadResult) == 0x000010, "Wrong size on ExtraPatchLibrary_GetDownloadResult");
static_assert(offsetof(ExtraPatchLibrary_GetDownloadResult, ReturnValue) == 0x000000, "Member 'ExtraPatchLibrary_GetDownloadResult::ReturnValue' has a wrong offset!");

// Function HotPatch.ExtraPatchLibrary.GetOriginalDownloadSize
// 0x0060 (0x0060 - 0x0000)
struct ExtraPatchLibrary_GetOriginalDownloadSize final
{
public:
	TArray<class FString>                         WwiseLanguages;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FString, int64>                    ReturnValue;                                       // 0x0010(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExtraPatchLibrary_GetOriginalDownloadSize) == 0x000008, "Wrong alignment on ExtraPatchLibrary_GetOriginalDownloadSize");
static_assert(sizeof(ExtraPatchLibrary_GetOriginalDownloadSize) == 0x000060, "Wrong size on ExtraPatchLibrary_GetOriginalDownloadSize");
static_assert(offsetof(ExtraPatchLibrary_GetOriginalDownloadSize, WwiseLanguages) == 0x000000, "Member 'ExtraPatchLibrary_GetOriginalDownloadSize::WwiseLanguages' has a wrong offset!");
static_assert(offsetof(ExtraPatchLibrary_GetOriginalDownloadSize, ReturnValue) == 0x000010, "Member 'ExtraPatchLibrary_GetOriginalDownloadSize::ReturnValue' has a wrong offset!");

// Function HotPatch.ExtraPatchLibrary.GetStage
// 0x0001 (0x0001 - 0x0000)
struct ExtraPatchLibrary_GetStage final
{
public:
	EHotPatchStage                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExtraPatchLibrary_GetStage) == 0x000001, "Wrong alignment on ExtraPatchLibrary_GetStage");
static_assert(sizeof(ExtraPatchLibrary_GetStage) == 0x000001, "Wrong size on ExtraPatchLibrary_GetStage");
static_assert(offsetof(ExtraPatchLibrary_GetStage, ReturnValue) == 0x000000, "Member 'ExtraPatchLibrary_GetStage::ReturnValue' has a wrong offset!");

// Function HotPatch.ExtraPatchLibrary.GetTotalDownloadBytes
// 0x0008 (0x0008 - 0x0000)
struct ExtraPatchLibrary_GetTotalDownloadBytes final
{
public:
	int64                                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExtraPatchLibrary_GetTotalDownloadBytes) == 0x000008, "Wrong alignment on ExtraPatchLibrary_GetTotalDownloadBytes");
static_assert(sizeof(ExtraPatchLibrary_GetTotalDownloadBytes) == 0x000008, "Wrong size on ExtraPatchLibrary_GetTotalDownloadBytes");
static_assert(offsetof(ExtraPatchLibrary_GetTotalDownloadBytes, ReturnValue) == 0x000000, "Member 'ExtraPatchLibrary_GetTotalDownloadBytes::ReturnValue' has a wrong offset!");

// Function HotPatch.ExtraPatchLibrary.IsDownloading
// 0x0001 (0x0001 - 0x0000)
struct ExtraPatchLibrary_IsDownloading final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExtraPatchLibrary_IsDownloading) == 0x000001, "Wrong alignment on ExtraPatchLibrary_IsDownloading");
static_assert(sizeof(ExtraPatchLibrary_IsDownloading) == 0x000001, "Wrong size on ExtraPatchLibrary_IsDownloading");
static_assert(offsetof(ExtraPatchLibrary_IsDownloading, ReturnValue) == 0x000000, "Member 'ExtraPatchLibrary_IsDownloading::ReturnValue' has a wrong offset!");

// Function HotPatch.ExtraPatchLibrary.IsPaused
// 0x0001 (0x0001 - 0x0000)
struct ExtraPatchLibrary_IsPaused final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExtraPatchLibrary_IsPaused) == 0x000001, "Wrong alignment on ExtraPatchLibrary_IsPaused");
static_assert(sizeof(ExtraPatchLibrary_IsPaused) == 0x000001, "Wrong size on ExtraPatchLibrary_IsPaused");
static_assert(offsetof(ExtraPatchLibrary_IsPaused, ReturnValue) == 0x000000, "Member 'ExtraPatchLibrary_IsPaused::ReturnValue' has a wrong offset!");

// Function HotPatch.ExtraPatchLibrary.SetNotification
// 0x0030 (0x0030 - 0x0000)
struct ExtraPatchLibrary_SetNotification final
{
public:
	class FString                                 InUpdating;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InComplete;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InFailed;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExtraPatchLibrary_SetNotification) == 0x000008, "Wrong alignment on ExtraPatchLibrary_SetNotification");
static_assert(sizeof(ExtraPatchLibrary_SetNotification) == 0x000030, "Wrong size on ExtraPatchLibrary_SetNotification");
static_assert(offsetof(ExtraPatchLibrary_SetNotification, InUpdating) == 0x000000, "Member 'ExtraPatchLibrary_SetNotification::InUpdating' has a wrong offset!");
static_assert(offsetof(ExtraPatchLibrary_SetNotification, InComplete) == 0x000010, "Member 'ExtraPatchLibrary_SetNotification::InComplete' has a wrong offset!");
static_assert(offsetof(ExtraPatchLibrary_SetNotification, InFailed) == 0x000020, "Member 'ExtraPatchLibrary_SetNotification::InFailed' has a wrong offset!");

// Function HotPatch.ExtraPatchLibrary.SetStage
// 0x0001 (0x0001 - 0x0000)
struct ExtraPatchLibrary_SetStage final
{
public:
	EHotPatchStage                                InStage;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExtraPatchLibrary_SetStage) == 0x000001, "Wrong alignment on ExtraPatchLibrary_SetStage");
static_assert(sizeof(ExtraPatchLibrary_SetStage) == 0x000001, "Wrong size on ExtraPatchLibrary_SetStage");
static_assert(offsetof(ExtraPatchLibrary_SetStage, InStage) == 0x000000, "Member 'ExtraPatchLibrary_SetStage::InStage' has a wrong offset!");

// Function HotPatch.ExtraPatchLibrary.Start
// 0x0010 (0x0010 - 0x0000)
struct ExtraPatchLibrary_Start final
{
public:
	TArray<class FString>                         WwiseLanguages;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExtraPatchLibrary_Start) == 0x000008, "Wrong alignment on ExtraPatchLibrary_Start");
static_assert(sizeof(ExtraPatchLibrary_Start) == 0x000010, "Wrong size on ExtraPatchLibrary_Start");
static_assert(offsetof(ExtraPatchLibrary_Start, WwiseLanguages) == 0x000000, "Member 'ExtraPatchLibrary_Start::WwiseLanguages' has a wrong offset!");

// Function HotPatch.HotPatchLibrary.GetDownloadedBytes
// 0x0008 (0x0008 - 0x0000)
struct HotPatchLibrary_GetDownloadedBytes final
{
public:
	int64                                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HotPatchLibrary_GetDownloadedBytes) == 0x000008, "Wrong alignment on HotPatchLibrary_GetDownloadedBytes");
static_assert(sizeof(HotPatchLibrary_GetDownloadedBytes) == 0x000008, "Wrong size on HotPatchLibrary_GetDownloadedBytes");
static_assert(offsetof(HotPatchLibrary_GetDownloadedBytes, ReturnValue) == 0x000000, "Member 'HotPatchLibrary_GetDownloadedBytes::ReturnValue' has a wrong offset!");

// Function HotPatch.HotPatchLibrary.GetMountedCount
// 0x0004 (0x0004 - 0x0000)
struct HotPatchLibrary_GetMountedCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HotPatchLibrary_GetMountedCount) == 0x000004, "Wrong alignment on HotPatchLibrary_GetMountedCount");
static_assert(sizeof(HotPatchLibrary_GetMountedCount) == 0x000004, "Wrong size on HotPatchLibrary_GetMountedCount");
static_assert(offsetof(HotPatchLibrary_GetMountedCount, ReturnValue) == 0x000000, "Member 'HotPatchLibrary_GetMountedCount::ReturnValue' has a wrong offset!");

// Function HotPatch.HotPatchLibrary.GetResVersion
// 0x0010 (0x0010 - 0x0000)
struct HotPatchLibrary_GetResVersion final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HotPatchLibrary_GetResVersion) == 0x000008, "Wrong alignment on HotPatchLibrary_GetResVersion");
static_assert(sizeof(HotPatchLibrary_GetResVersion) == 0x000010, "Wrong size on HotPatchLibrary_GetResVersion");
static_assert(offsetof(HotPatchLibrary_GetResVersion, ReturnValue) == 0x000000, "Member 'HotPatchLibrary_GetResVersion::ReturnValue' has a wrong offset!");

// Function HotPatch.HotPatchLibrary.GetStage
// 0x0001 (0x0001 - 0x0000)
struct HotPatchLibrary_GetStage final
{
public:
	EHotPatchStage                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HotPatchLibrary_GetStage) == 0x000001, "Wrong alignment on HotPatchLibrary_GetStage");
static_assert(sizeof(HotPatchLibrary_GetStage) == 0x000001, "Wrong size on HotPatchLibrary_GetStage");
static_assert(offsetof(HotPatchLibrary_GetStage, ReturnValue) == 0x000000, "Member 'HotPatchLibrary_GetStage::ReturnValue' has a wrong offset!");

// Function HotPatch.HotPatchLibrary.GetTotalDownloadBytes
// 0x0008 (0x0008 - 0x0000)
struct HotPatchLibrary_GetTotalDownloadBytes final
{
public:
	int64                                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HotPatchLibrary_GetTotalDownloadBytes) == 0x000008, "Wrong alignment on HotPatchLibrary_GetTotalDownloadBytes");
static_assert(sizeof(HotPatchLibrary_GetTotalDownloadBytes) == 0x000008, "Wrong size on HotPatchLibrary_GetTotalDownloadBytes");
static_assert(offsetof(HotPatchLibrary_GetTotalDownloadBytes, ReturnValue) == 0x000000, "Member 'HotPatchLibrary_GetTotalDownloadBytes::ReturnValue' has a wrong offset!");

// Function HotPatch.HotPatchLibrary.GetTotalMountCount
// 0x0004 (0x0004 - 0x0000)
struct HotPatchLibrary_GetTotalMountCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HotPatchLibrary_GetTotalMountCount) == 0x000004, "Wrong alignment on HotPatchLibrary_GetTotalMountCount");
static_assert(sizeof(HotPatchLibrary_GetTotalMountCount) == 0x000004, "Wrong size on HotPatchLibrary_GetTotalMountCount");
static_assert(offsetof(HotPatchLibrary_GetTotalMountCount, ReturnValue) == 0x000000, "Member 'HotPatchLibrary_GetTotalMountCount::ReturnValue' has a wrong offset!");

// Function HotPatch.HotPatchLibrary.GetTotalPrimaryDownloadBytes
// 0x0008 (0x0008 - 0x0000)
struct HotPatchLibrary_GetTotalPrimaryDownloadBytes final
{
public:
	int64                                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HotPatchLibrary_GetTotalPrimaryDownloadBytes) == 0x000008, "Wrong alignment on HotPatchLibrary_GetTotalPrimaryDownloadBytes");
static_assert(sizeof(HotPatchLibrary_GetTotalPrimaryDownloadBytes) == 0x000008, "Wrong size on HotPatchLibrary_GetTotalPrimaryDownloadBytes");
static_assert(offsetof(HotPatchLibrary_GetTotalPrimaryDownloadBytes, ReturnValue) == 0x000000, "Member 'HotPatchLibrary_GetTotalPrimaryDownloadBytes::ReturnValue' has a wrong offset!");

// Function HotPatch.HotPatchLibrary.GetTotalVerifyCount
// 0x0004 (0x0004 - 0x0000)
struct HotPatchLibrary_GetTotalVerifyCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HotPatchLibrary_GetTotalVerifyCount) == 0x000004, "Wrong alignment on HotPatchLibrary_GetTotalVerifyCount");
static_assert(sizeof(HotPatchLibrary_GetTotalVerifyCount) == 0x000004, "Wrong size on HotPatchLibrary_GetTotalVerifyCount");
static_assert(offsetof(HotPatchLibrary_GetTotalVerifyCount, ReturnValue) == 0x000000, "Member 'HotPatchLibrary_GetTotalVerifyCount::ReturnValue' has a wrong offset!");

// Function HotPatch.HotPatchLibrary.GetVerifiedCount
// 0x0004 (0x0004 - 0x0000)
struct HotPatchLibrary_GetVerifiedCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HotPatchLibrary_GetVerifiedCount) == 0x000004, "Wrong alignment on HotPatchLibrary_GetVerifiedCount");
static_assert(sizeof(HotPatchLibrary_GetVerifiedCount) == 0x000004, "Wrong size on HotPatchLibrary_GetVerifiedCount");
static_assert(offsetof(HotPatchLibrary_GetVerifiedCount, ReturnValue) == 0x000000, "Member 'HotPatchLibrary_GetVerifiedCount::ReturnValue' has a wrong offset!");

// Function HotPatch.HotPatchLibrary.SetNotification
// 0x0030 (0x0030 - 0x0000)
struct HotPatchLibrary_SetNotification final
{
public:
	class FString                                 InUpdating;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InComplete;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InFailed;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HotPatchLibrary_SetNotification) == 0x000008, "Wrong alignment on HotPatchLibrary_SetNotification");
static_assert(sizeof(HotPatchLibrary_SetNotification) == 0x000030, "Wrong size on HotPatchLibrary_SetNotification");
static_assert(offsetof(HotPatchLibrary_SetNotification, InUpdating) == 0x000000, "Member 'HotPatchLibrary_SetNotification::InUpdating' has a wrong offset!");
static_assert(offsetof(HotPatchLibrary_SetNotification, InComplete) == 0x000010, "Member 'HotPatchLibrary_SetNotification::InComplete' has a wrong offset!");
static_assert(offsetof(HotPatchLibrary_SetNotification, InFailed) == 0x000020, "Member 'HotPatchLibrary_SetNotification::InFailed' has a wrong offset!");

// Function HotPatch.HotPatchLibrary.SetStage
// 0x0001 (0x0001 - 0x0000)
struct HotPatchLibrary_SetStage final
{
public:
	EHotPatchStage                                InStage;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HotPatchLibrary_SetStage) == 0x000001, "Wrong alignment on HotPatchLibrary_SetStage");
static_assert(sizeof(HotPatchLibrary_SetStage) == 0x000001, "Wrong size on HotPatchLibrary_SetStage");
static_assert(offsetof(HotPatchLibrary_SetStage, InStage) == 0x000000, "Member 'HotPatchLibrary_SetStage::InStage' has a wrong offset!");

// Function HotPatch.HotPatchLibrary.Start
// 0x0001 (0x0001 - 0x0000)
struct HotPatchLibrary_Start final
{
public:
	bool                                          bVerifyLocalPak;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HotPatchLibrary_Start) == 0x000001, "Wrong alignment on HotPatchLibrary_Start");
static_assert(sizeof(HotPatchLibrary_Start) == 0x000001, "Wrong size on HotPatchLibrary_Start");
static_assert(offsetof(HotPatchLibrary_Start, bVerifyLocalPak) == 0x000000, "Member 'HotPatchLibrary_Start::bVerifyLocalPak' has a wrong offset!");

// Function HotPatch.PreReleaseLibrary.CheckDiskSpace
// 0x0010 (0x0010 - 0x0000)
struct PreReleaseLibrary_CheckDiskSpace final
{
public:
	int64                                         InNeeded;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PreReleaseLibrary_CheckDiskSpace) == 0x000008, "Wrong alignment on PreReleaseLibrary_CheckDiskSpace");
static_assert(sizeof(PreReleaseLibrary_CheckDiskSpace) == 0x000010, "Wrong size on PreReleaseLibrary_CheckDiskSpace");
static_assert(offsetof(PreReleaseLibrary_CheckDiskSpace, InNeeded) == 0x000000, "Member 'PreReleaseLibrary_CheckDiskSpace::InNeeded' has a wrong offset!");
static_assert(offsetof(PreReleaseLibrary_CheckDiskSpace, ReturnValue) == 0x000008, "Member 'PreReleaseLibrary_CheckDiskSpace::ReturnValue' has a wrong offset!");

// Function HotPatch.PreReleaseLibrary.GetDownloadedBytes
// 0x0008 (0x0008 - 0x0000)
struct PreReleaseLibrary_GetDownloadedBytes final
{
public:
	int64                                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PreReleaseLibrary_GetDownloadedBytes) == 0x000008, "Wrong alignment on PreReleaseLibrary_GetDownloadedBytes");
static_assert(sizeof(PreReleaseLibrary_GetDownloadedBytes) == 0x000008, "Wrong size on PreReleaseLibrary_GetDownloadedBytes");
static_assert(offsetof(PreReleaseLibrary_GetDownloadedBytes, ReturnValue) == 0x000000, "Member 'PreReleaseLibrary_GetDownloadedBytes::ReturnValue' has a wrong offset!");

// Function HotPatch.PreReleaseLibrary.GetDownloadResult
// 0x0010 (0x0010 - 0x0000)
struct PreReleaseLibrary_GetDownloadResult final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PreReleaseLibrary_GetDownloadResult) == 0x000008, "Wrong alignment on PreReleaseLibrary_GetDownloadResult");
static_assert(sizeof(PreReleaseLibrary_GetDownloadResult) == 0x000010, "Wrong size on PreReleaseLibrary_GetDownloadResult");
static_assert(offsetof(PreReleaseLibrary_GetDownloadResult, ReturnValue) == 0x000000, "Member 'PreReleaseLibrary_GetDownloadResult::ReturnValue' has a wrong offset!");

// Function HotPatch.PreReleaseLibrary.GetResVersion
// 0x0010 (0x0010 - 0x0000)
struct PreReleaseLibrary_GetResVersion final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PreReleaseLibrary_GetResVersion) == 0x000008, "Wrong alignment on PreReleaseLibrary_GetResVersion");
static_assert(sizeof(PreReleaseLibrary_GetResVersion) == 0x000010, "Wrong size on PreReleaseLibrary_GetResVersion");
static_assert(offsetof(PreReleaseLibrary_GetResVersion, ReturnValue) == 0x000000, "Member 'PreReleaseLibrary_GetResVersion::ReturnValue' has a wrong offset!");

// Function HotPatch.PreReleaseLibrary.GetStage
// 0x0001 (0x0001 - 0x0000)
struct PreReleaseLibrary_GetStage final
{
public:
	EHotPatchStage                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PreReleaseLibrary_GetStage) == 0x000001, "Wrong alignment on PreReleaseLibrary_GetStage");
static_assert(sizeof(PreReleaseLibrary_GetStage) == 0x000001, "Wrong size on PreReleaseLibrary_GetStage");
static_assert(offsetof(PreReleaseLibrary_GetStage, ReturnValue) == 0x000000, "Member 'PreReleaseLibrary_GetStage::ReturnValue' has a wrong offset!");

// Function HotPatch.PreReleaseLibrary.GetTotalDownloadBytes
// 0x0008 (0x0008 - 0x0000)
struct PreReleaseLibrary_GetTotalDownloadBytes final
{
public:
	int64                                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PreReleaseLibrary_GetTotalDownloadBytes) == 0x000008, "Wrong alignment on PreReleaseLibrary_GetTotalDownloadBytes");
static_assert(sizeof(PreReleaseLibrary_GetTotalDownloadBytes) == 0x000008, "Wrong size on PreReleaseLibrary_GetTotalDownloadBytes");
static_assert(offsetof(PreReleaseLibrary_GetTotalDownloadBytes, ReturnValue) == 0x000000, "Member 'PreReleaseLibrary_GetTotalDownloadBytes::ReturnValue' has a wrong offset!");

// Function HotPatch.PreReleaseLibrary.SetNotification
// 0x0030 (0x0030 - 0x0000)
struct PreReleaseLibrary_SetNotification final
{
public:
	class FString                                 InUpdating;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InComplete;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InFailed;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PreReleaseLibrary_SetNotification) == 0x000008, "Wrong alignment on PreReleaseLibrary_SetNotification");
static_assert(sizeof(PreReleaseLibrary_SetNotification) == 0x000030, "Wrong size on PreReleaseLibrary_SetNotification");
static_assert(offsetof(PreReleaseLibrary_SetNotification, InUpdating) == 0x000000, "Member 'PreReleaseLibrary_SetNotification::InUpdating' has a wrong offset!");
static_assert(offsetof(PreReleaseLibrary_SetNotification, InComplete) == 0x000010, "Member 'PreReleaseLibrary_SetNotification::InComplete' has a wrong offset!");
static_assert(offsetof(PreReleaseLibrary_SetNotification, InFailed) == 0x000020, "Member 'PreReleaseLibrary_SetNotification::InFailed' has a wrong offset!");

// Function HotPatch.PreReleaseLibrary.SetStage
// 0x0001 (0x0001 - 0x0000)
struct PreReleaseLibrary_SetStage final
{
public:
	EHotPatchStage                                InStage;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PreReleaseLibrary_SetStage) == 0x000001, "Wrong alignment on PreReleaseLibrary_SetStage");
static_assert(sizeof(PreReleaseLibrary_SetStage) == 0x000001, "Wrong size on PreReleaseLibrary_SetStage");
static_assert(offsetof(PreReleaseLibrary_SetStage, InStage) == 0x000000, "Member 'PreReleaseLibrary_SetStage::InStage' has a wrong offset!");

}

