#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HotPatch

#include "Basic.hpp"


namespace SDK
{

// Enum HotPatch.EResPublishType
// NumValues: 0x000B
enum class EResPublishType : uint8
{
	None                                     = 0,
	Starter                                  = 1,
	Starter_wwise_chinese                    = 2,
	Starter_wwise_english                    = 3,
	Starter_wwise_japanese                   = 4,
	Starter_wwise_korean                     = 5,
	Wwise_chinese                            = 11,
	Wwise_english                            = 12,
	Wwise_japanese                           = 13,
	Wwise_korean                             = 14,
	EResPublishType_MAX                      = 15,
};

// Enum HotPatch.EHotPatchErrCode
// NumValues: 0x000D
enum class EHotPatchErrCode : uint8
{
	None                                     = 0,
	BadConfiguration                         = 1,
	NetworkUnavailable                       = 2,
	DownloadManifestFailed                   = 3,
	NeedUpgrade                              = 4,
	DownloadUpdatesFailed                    = 5,
	SaveFileFailed                           = 6,
	GetDiskFreeSpaceFailed                   = 7,
	DiskFreeSpaceNotEnough                   = 8,
	MergeFileFailed                          = 9,
	VerifyFileFailed                         = 10,
	MoveFileFailed                           = 11,
	EHotPatchErrCode_MAX                     = 12,
};

// Enum HotPatch.EHotPatchStage
// NumValues: 0x0009
enum class EHotPatchStage : uint8
{
	None                                     = 0,
	FetchCDN                                 = 1,
	ReadingManifest                          = 2,
	Calculating                              = 3,
	Verifing                                 = 4,
	FetchingUpdates                          = 5,
	Mounting                                 = 6,
	Done                                     = 7,
	EHotPatchStage_MAX                       = 8,
};

// ScriptStruct HotPatch.HotPatchAsset
// 0x0058 (0x0058 - 0x0000)
struct FHotPatchAsset final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Hash;                                              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         SizeInBytes;                                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bPrimary;                                          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Base;                                              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Diff;                                              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         DiffSizeBytes;                                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHotPatchAsset) == 0x000008, "Wrong alignment on FHotPatchAsset");
static_assert(sizeof(FHotPatchAsset) == 0x000058, "Wrong size on FHotPatchAsset");
static_assert(offsetof(FHotPatchAsset, Name) == 0x000000, "Member 'FHotPatchAsset::Name' has a wrong offset!");
static_assert(offsetof(FHotPatchAsset, Hash) == 0x000010, "Member 'FHotPatchAsset::Hash' has a wrong offset!");
static_assert(offsetof(FHotPatchAsset, SizeInBytes) == 0x000020, "Member 'FHotPatchAsset::SizeInBytes' has a wrong offset!");
static_assert(offsetof(FHotPatchAsset, bPrimary) == 0x000028, "Member 'FHotPatchAsset::bPrimary' has a wrong offset!");
static_assert(offsetof(FHotPatchAsset, Base) == 0x000030, "Member 'FHotPatchAsset::Base' has a wrong offset!");
static_assert(offsetof(FHotPatchAsset, Diff) == 0x000040, "Member 'FHotPatchAsset::Diff' has a wrong offset!");
static_assert(offsetof(FHotPatchAsset, DiffSizeBytes) == 0x000050, "Member 'FHotPatchAsset::DiffSizeBytes' has a wrong offset!");

// ScriptStruct HotPatch.HotPatchAssetManifest
// 0x0048 (0x0048 - 0x0000)
struct FHotPatchAssetManifest final
{
public:
	class FString                                 Version;                                           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProjectVersion;                                    // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PathOffset;                                        // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUserCache;                                        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHotPatchAsset>                 Paks;                                              // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHotPatchAssetManifest) == 0x000008, "Wrong alignment on FHotPatchAssetManifest");
static_assert(sizeof(FHotPatchAssetManifest) == 0x000048, "Wrong size on FHotPatchAssetManifest");
static_assert(offsetof(FHotPatchAssetManifest, Version) == 0x000000, "Member 'FHotPatchAssetManifest::Version' has a wrong offset!");
static_assert(offsetof(FHotPatchAssetManifest, ProjectVersion) == 0x000010, "Member 'FHotPatchAssetManifest::ProjectVersion' has a wrong offset!");
static_assert(offsetof(FHotPatchAssetManifest, PathOffset) == 0x000020, "Member 'FHotPatchAssetManifest::PathOffset' has a wrong offset!");
static_assert(offsetof(FHotPatchAssetManifest, bUserCache) == 0x000030, "Member 'FHotPatchAssetManifest::bUserCache' has a wrong offset!");
static_assert(offsetof(FHotPatchAssetManifest, Paks) == 0x000038, "Member 'FHotPatchAssetManifest::Paks' has a wrong offset!");

// ScriptStruct HotPatch.HotPatchCDNList
// 0x0010 (0x0010 - 0x0000)
struct FHotPatchCDNList final
{
public:
	TArray<class FString>                         Urls;                                              // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHotPatchCDNList) == 0x000008, "Wrong alignment on FHotPatchCDNList");
static_assert(sizeof(FHotPatchCDNList) == 0x000010, "Wrong size on FHotPatchCDNList");
static_assert(offsetof(FHotPatchCDNList, Urls) == 0x000000, "Member 'FHotPatchCDNList::Urls' has a wrong offset!");

// ScriptStruct HotPatch.HotPatchDebug
// 0x0028 (0x0028 - 0x0000)
struct FHotPatchDebug final
{
public:
	bool                                          bDisableHotPatch;                                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreAppVersion;                                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DebugFileServer;                                   // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerListUrl;                                     // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHotPatchDebug) == 0x000008, "Wrong alignment on FHotPatchDebug");
static_assert(sizeof(FHotPatchDebug) == 0x000028, "Wrong size on FHotPatchDebug");
static_assert(offsetof(FHotPatchDebug, bDisableHotPatch) == 0x000000, "Member 'FHotPatchDebug::bDisableHotPatch' has a wrong offset!");
static_assert(offsetof(FHotPatchDebug, bIgnoreAppVersion) == 0x000001, "Member 'FHotPatchDebug::bIgnoreAppVersion' has a wrong offset!");
static_assert(offsetof(FHotPatchDebug, DebugFileServer) == 0x000008, "Member 'FHotPatchDebug::DebugFileServer' has a wrong offset!");
static_assert(offsetof(FHotPatchDebug, ServerListUrl) == 0x000018, "Member 'FHotPatchDebug::ServerListUrl' has a wrong offset!");

}

