#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HotPatch

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "HotPatch_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class HotPatch.ExtraPatchLibrary
// 0x0000 (0x0028 - 0x0028)
class UExtraPatchLibrary final : public UBlueprintFunctionLibrary
{
public:
	static TMap<class FString, int64> CalcDownloadSize(const TArray<class FString>& WwiseLanguages);
	static void Cancel();
	static bool CheckDiskSpace(int64 InNeeded);
	static void Continue();
	static int64 GetDiskFreeSpaceSize();
	static int64 GetDownloadedBytes();
	static class FString GetDownloadResult();
	static TMap<class FString, int64> GetOriginalDownloadSize(const TArray<class FString>& WwiseLanguages);
	static EHotPatchStage GetStage();
	static int64 GetTotalDownloadBytes();
	static bool IsDownloading();
	static bool IsPaused();
	static void Resume();
	static void SetNotification(const class FString& InUpdating, const class FString& InComplete, const class FString& InFailed);
	static void SetStage(const EHotPatchStage InStage);
	static void Start(const TArray<class FString>& WwiseLanguages);
	static void Suspend();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ExtraPatchLibrary">();
	}
	static class UExtraPatchLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExtraPatchLibrary>();
	}
};
static_assert(alignof(UExtraPatchLibrary) == 0x000008, "Wrong alignment on UExtraPatchLibrary");
static_assert(sizeof(UExtraPatchLibrary) == 0x000028, "Wrong size on UExtraPatchLibrary");

// Class HotPatch.HotPatchLibrary
// 0x0000 (0x0028 - 0x0028)
class UHotPatchLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void Continue();
	static int64 GetDownloadedBytes();
	static int32 GetMountedCount();
	static class FString GetResVersion();
	static EHotPatchStage GetStage();
	static int64 GetTotalDownloadBytes();
	static int32 GetTotalMountCount();
	static int64 GetTotalPrimaryDownloadBytes();
	static int32 GetTotalVerifyCount();
	static int32 GetVerifiedCount();
	static void SetNotification(const class FString& InUpdating, const class FString& InComplete, const class FString& InFailed);
	static void SetStage(const EHotPatchStage InStage);
	static void Start(bool bVerifyLocalPak);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HotPatchLibrary">();
	}
	static class UHotPatchLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHotPatchLibrary>();
	}
};
static_assert(alignof(UHotPatchLibrary) == 0x000008, "Wrong alignment on UHotPatchLibrary");
static_assert(sizeof(UHotPatchLibrary) == 0x000028, "Wrong size on UHotPatchLibrary");

// Class HotPatch.HotPatchSettings
// 0x0010 (0x0038 - 0x0028)
class UHotPatchSettings final : public UObject
{
public:
	TArray<class FString>                         FileServer;                                        // 0x0028(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HotPatchSettings">();
	}
	static class UHotPatchSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHotPatchSettings>();
	}
};
static_assert(alignof(UHotPatchSettings) == 0x000008, "Wrong alignment on UHotPatchSettings");
static_assert(sizeof(UHotPatchSettings) == 0x000038, "Wrong size on UHotPatchSettings");
static_assert(offsetof(UHotPatchSettings, FileServer) == 0x000028, "Member 'UHotPatchSettings::FileServer' has a wrong offset!");

// Class HotPatch.PreReleaseLibrary
// 0x0000 (0x0028 - 0x0028)
class UPreReleaseLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void CalcDownloads();
	static bool CheckDiskSpace(int64 InNeeded);
	static void Continue();
	static int64 GetDownloadedBytes();
	static class FString GetDownloadResult();
	static class FString GetResVersion();
	static EHotPatchStage GetStage();
	static int64 GetTotalDownloadBytes();
	static void Resume();
	static void SetNotification(const class FString& InUpdating, const class FString& InComplete, const class FString& InFailed);
	static void SetStage(const EHotPatchStage InStage);
	static void Start();
	static void Suspend();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PreReleaseLibrary">();
	}
	static class UPreReleaseLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPreReleaseLibrary>();
	}
};
static_assert(alignof(UPreReleaseLibrary) == 0x000008, "Wrong alignment on UPreReleaseLibrary");
static_assert(sizeof(UPreReleaseLibrary) == 0x000028, "Wrong size on UPreReleaseLibrary");

}

