#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InjuryTransmissionSimilar

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// LuaFunction InjuryTransmissionSimilar.InjuryTransmissionSimilar_C.K2_InjuryTransmission
// 0x02B8 (0x02B8 - 0x0000)
struct InjuryTransmissionSimilar_C_K2_InjuryTransmission final
{
public:
	class UAbilityComponentBase*                  lpTarget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPreDamageResultData                   PreResultData;                                     // 0x0008(0x01F0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FApplyDamageResultData                 Info;                                              // 0x01F8(0x00C0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InjuryTransmissionSimilar_C_K2_InjuryTransmission;

// LuaFunction InjuryTransmissionSimilar.InjuryTransmissionSimilar_C.K2_ReceiveInitialize
// 0x0018 (0x0018 - 0x0000)
struct InjuryTransmissionSimilar_C_K2_ReceiveInitialize final
{
public:
	TArray<struct FParamInfo>                     Info;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	const class UGameAbilityComponent*            lpInstigator;                                      // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InjuryTransmissionSimilar_C_K2_ReceiveInitialize;

// Function InjuryTransmissionSimilar.InjuryTransmissionSimilar_C.OnGetAssetPath
// 0x0088 (0x0088 - 0x0000)
struct InjuryTransmissionSimilar_C_OnGetAssetPath final
{
public:
	TArray<struct FParamInfo>                     InParams;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 CharacterIDs;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 SkillIDs;                                          // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 ModifierIDs;                                       // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 EmitterIDs;                                        // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FSoftObjectPath>                ReturnValue;                                       // 0x0050(0x0010)(Parm, OutParm, ReturnParm)
	TArray<int32>                                 TrapIDs;                                           // 0x0060(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSoftObjectPath>                OutPahts;                                          // 0x0070(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_GetParamintValue_ReturnValue;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_InjuryTransmissionSimilar_C_OnGetAssetPath;

// Function InjuryTransmissionSimilar.InjuryTransmissionSimilar_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct InjuryTransmissionSimilar_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_InjuryTransmissionSimilar_C_GetModuleName;

}

