#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InputCore

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// Class InputCore.InputCoreTypes
// 0x0000 (0x0028 - 0x0028)
class UInputCoreTypes final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputCoreTypes">();
	}
	static class UInputCoreTypes* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputCoreTypes>();
	}
};
static_assert(alignof(UInputCoreTypes) == 0x000008, "Wrong alignment on UInputCoreTypes");
static_assert(sizeof(UInputCoreTypes) == 0x000028, "Wrong size on UInputCoreTypes");

// Class InputCore.TSFInputProfileSettings
// 0x0010 (0x0038 - 0x0028)
class UTSFInputProfileSettings final : public UObject
{
public:
	TArray<struct FTSFInputProfileInfo>           InputProfileConfig;                                // 0x0028(0x0010)(Edit, EditFixedSize, ZeroConstructor, Config, AdvancedDisplay, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TSFInputProfileSettings">();
	}
	static class UTSFInputProfileSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTSFInputProfileSettings>();
	}
};
static_assert(alignof(UTSFInputProfileSettings) == 0x000008, "Wrong alignment on UTSFInputProfileSettings");
static_assert(sizeof(UTSFInputProfileSettings) == 0x000038, "Wrong size on UTSFInputProfileSettings");
static_assert(offsetof(UTSFInputProfileSettings, InputProfileConfig) == 0x000028, "Member 'UTSFInputProfileSettings::InputProfileConfig' has a wrong offset!");

}

