#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Interaction_progress_component

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass interaction_progress_component.interaction_progress_component_C
// 0x0010 (0x05E0 - 0x05D0)
class UInteraction_progress_component_C final : public UWidgetComponent
{
public:
	uint8                                         Pad_5C8[0x8];                                      // 0x05C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bPerform;                                          // 0x05D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D9[0x3];                                      // 0x05D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AddSpeed;                                          // 0x05DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OpenUI();
	void ReceiveTick(float DeltaSeconds);
	void CloseUI();
	void StartProgress(float PerformTime);
	void ExecuteUbergraph_interaction_progress_component(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"interaction_progress_component_C">();
	}
	static class UInteraction_progress_component_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteraction_progress_component_C>();
	}
};
static_assert(alignof(UInteraction_progress_component_C) == 0x000010, "Wrong alignment on UInteraction_progress_component_C");
static_assert(sizeof(UInteraction_progress_component_C) == 0x0005E0, "Wrong size on UInteraction_progress_component_C");
static_assert(offsetof(UInteraction_progress_component_C, UberGraphFrame) == 0x0005D0, "Member 'UInteraction_progress_component_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInteraction_progress_component_C, bPerform) == 0x0005D8, "Member 'UInteraction_progress_component_C::bPerform' has a wrong offset!");
static_assert(offsetof(UInteraction_progress_component_C, AddSpeed) == 0x0005DC, "Member 'UInteraction_progress_component_C::AddSpeed' has a wrong offset!");

}

