#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Interaction_progress_component

#include "Basic.hpp"


namespace SDK::Params
{

// Function interaction_progress_component.interaction_progress_component_C.OpenUI
// 0x0008 (0x0008 - 0x0000)
struct Interaction_progress_component_C_OpenUI final
{
public:
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Interaction_progress_component_C_OpenUI) == 0x000008, "Wrong alignment on Interaction_progress_component_C_OpenUI");
static_assert(sizeof(Interaction_progress_component_C_OpenUI) == 0x000008, "Wrong size on Interaction_progress_component_C_OpenUI");
static_assert(offsetof(Interaction_progress_component_C_OpenUI, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000000, "Member 'Interaction_progress_component_C_OpenUI::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");

// Function interaction_progress_component.interaction_progress_component_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Interaction_progress_component_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Interaction_progress_component_C_ReceiveTick) == 0x000004, "Wrong alignment on Interaction_progress_component_C_ReceiveTick");
static_assert(sizeof(Interaction_progress_component_C_ReceiveTick) == 0x000004, "Wrong size on Interaction_progress_component_C_ReceiveTick");
static_assert(offsetof(Interaction_progress_component_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Interaction_progress_component_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function interaction_progress_component.interaction_progress_component_C.CloseUI
// 0x0008 (0x0008 - 0x0000)
struct Interaction_progress_component_C_CloseUI final
{
public:
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Interaction_progress_component_C_CloseUI) == 0x000008, "Wrong alignment on Interaction_progress_component_C_CloseUI");
static_assert(sizeof(Interaction_progress_component_C_CloseUI) == 0x000008, "Wrong size on Interaction_progress_component_C_CloseUI");
static_assert(offsetof(Interaction_progress_component_C_CloseUI, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000000, "Member 'Interaction_progress_component_C_CloseUI::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");

// Function interaction_progress_component.interaction_progress_component_C.StartProgress
// 0x0008 (0x0008 - 0x0000)
struct Interaction_progress_component_C_StartProgress final
{
public:
	float                                         PerformTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Interaction_progress_component_C_StartProgress) == 0x000004, "Wrong alignment on Interaction_progress_component_C_StartProgress");
static_assert(sizeof(Interaction_progress_component_C_StartProgress) == 0x000008, "Wrong size on Interaction_progress_component_C_StartProgress");
static_assert(offsetof(Interaction_progress_component_C_StartProgress, PerformTime) == 0x000000, "Member 'Interaction_progress_component_C_StartProgress::PerformTime' has a wrong offset!");
static_assert(offsetof(Interaction_progress_component_C_StartProgress, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000004, "Member 'Interaction_progress_component_C_StartProgress::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function interaction_progress_component.interaction_progress_component_C.ExecuteUbergraph_interaction_progress_component
// 0x0028 (0x0028 - 0x0000)
struct Interaction_progress_component_C_ExecuteUbergraph_interaction_progress_component final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUw_task_interaction_progress_C*        K2Node_DynamicCast_AsUw_Task_Interaction_Progress; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Interaction_progress_component_C_ExecuteUbergraph_interaction_progress_component) == 0x000008, "Wrong alignment on Interaction_progress_component_C_ExecuteUbergraph_interaction_progress_component");
static_assert(sizeof(Interaction_progress_component_C_ExecuteUbergraph_interaction_progress_component) == 0x000028, "Wrong size on Interaction_progress_component_C_ExecuteUbergraph_interaction_progress_component");
static_assert(offsetof(Interaction_progress_component_C_ExecuteUbergraph_interaction_progress_component, EntryPoint) == 0x000000, "Member 'Interaction_progress_component_C_ExecuteUbergraph_interaction_progress_component::EntryPoint' has a wrong offset!");
static_assert(offsetof(Interaction_progress_component_C_ExecuteUbergraph_interaction_progress_component, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Interaction_progress_component_C_ExecuteUbergraph_interaction_progress_component::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Interaction_progress_component_C_ExecuteUbergraph_interaction_progress_component, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000008, "Member 'Interaction_progress_component_C_ExecuteUbergraph_interaction_progress_component::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Interaction_progress_component_C_ExecuteUbergraph_interaction_progress_component, K2Node_DynamicCast_AsUw_Task_Interaction_Progress) == 0x000010, "Member 'Interaction_progress_component_C_ExecuteUbergraph_interaction_progress_component::K2Node_DynamicCast_AsUw_Task_Interaction_Progress' has a wrong offset!");
static_assert(offsetof(Interaction_progress_component_C_ExecuteUbergraph_interaction_progress_component, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Interaction_progress_component_C_ExecuteUbergraph_interaction_progress_component::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Interaction_progress_component_C_ExecuteUbergraph_interaction_progress_component, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00001C, "Member 'Interaction_progress_component_C_ExecuteUbergraph_interaction_progress_component::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Interaction_progress_component_C_ExecuteUbergraph_interaction_progress_component, CallFunc_Add_FloatFloat_ReturnValue) == 0x000020, "Member 'Interaction_progress_component_C_ExecuteUbergraph_interaction_progress_component::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Interaction_progress_component_C_ExecuteUbergraph_interaction_progress_component, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000024, "Member 'Interaction_progress_component_C_ExecuteUbergraph_interaction_progress_component::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

