#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Interaction_LootBox

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// LuaFunction Interaction_LootBox.Interaction_LootBox_C.OnTrigger_Client
// 0x0010 (0x0010 - 0x0000)
struct Interaction_LootBox_C_OnTrigger_Client final
{
public:
	bool                                          bIsBeginOverlap;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Interaction_LootBox_C_OnTrigger_Client) == 0x000008, "Wrong alignment on Interaction_LootBox_C_OnTrigger_Client");
static_assert(sizeof(Interaction_LootBox_C_OnTrigger_Client) == 0x000010, "Wrong size on Interaction_LootBox_C_OnTrigger_Client");
static_assert(offsetof(Interaction_LootBox_C_OnTrigger_Client, bIsBeginOverlap) == 0x000000, "Member 'Interaction_LootBox_C_OnTrigger_Client::bIsBeginOverlap' has a wrong offset!");
static_assert(offsetof(Interaction_LootBox_C_OnTrigger_Client, OtherActor) == 0x000008, "Member 'Interaction_LootBox_C_OnTrigger_Client::OtherActor' has a wrong offset!");

// LuaFunction Interaction_LootBox.Interaction_LootBox_C.GetInteractionWidgetLua
// 0x0008 (0x0008 - 0x0000)
struct Interaction_LootBox_C_GetInteractionWidgetLua final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Interaction_LootBox_C_GetInteractionWidgetLua) == 0x000008, "Wrong alignment on Interaction_LootBox_C_GetInteractionWidgetLua");
static_assert(sizeof(Interaction_LootBox_C_GetInteractionWidgetLua) == 0x000008, "Wrong size on Interaction_LootBox_C_GetInteractionWidgetLua");
static_assert(offsetof(Interaction_LootBox_C_GetInteractionWidgetLua, Widget) == 0x000000, "Member 'Interaction_LootBox_C_GetInteractionWidgetLua::Widget' has a wrong offset!");

// LuaFunction Interaction_LootBox.Interaction_LootBox_C.TriggerHandle
// 0x0010 (0x0010 - 0x0000)
struct Interaction_LootBox_C_TriggerHandle final
{
public:
	bool                                          bIsBeginOverlap;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Interaction_LootBox_C_TriggerHandle) == 0x000008, "Wrong alignment on Interaction_LootBox_C_TriggerHandle");
static_assert(sizeof(Interaction_LootBox_C_TriggerHandle) == 0x000010, "Wrong size on Interaction_LootBox_C_TriggerHandle");
static_assert(offsetof(Interaction_LootBox_C_TriggerHandle, bIsBeginOverlap) == 0x000000, "Member 'Interaction_LootBox_C_TriggerHandle::bIsBeginOverlap' has a wrong offset!");
static_assert(offsetof(Interaction_LootBox_C_TriggerHandle, OtherActor) == 0x000008, "Member 'Interaction_LootBox_C_TriggerHandle::OtherActor' has a wrong offset!");

// LuaFunction Interaction_LootBox.Interaction_LootBox_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct Interaction_LootBox_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Interaction_LootBox_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on Interaction_LootBox_C_ReceiveEndPlay");
static_assert(sizeof(Interaction_LootBox_C_ReceiveEndPlay) == 0x000001, "Wrong size on Interaction_LootBox_C_ReceiveEndPlay");
static_assert(offsetof(Interaction_LootBox_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'Interaction_LootBox_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function Interaction_LootBox.Interaction_LootBox_C.ExecuteUbergraph_Interaction_LootBox
// 0x0004 (0x0004 - 0x0000)
struct Interaction_LootBox_C_ExecuteUbergraph_Interaction_LootBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Interaction_LootBox_C_ExecuteUbergraph_Interaction_LootBox) == 0x000004, "Wrong alignment on Interaction_LootBox_C_ExecuteUbergraph_Interaction_LootBox");
static_assert(sizeof(Interaction_LootBox_C_ExecuteUbergraph_Interaction_LootBox) == 0x000004, "Wrong size on Interaction_LootBox_C_ExecuteUbergraph_Interaction_LootBox");
static_assert(offsetof(Interaction_LootBox_C_ExecuteUbergraph_Interaction_LootBox, EntryPoint) == 0x000000, "Member 'Interaction_LootBox_C_ExecuteUbergraph_Interaction_LootBox::EntryPoint' has a wrong offset!");

}

