#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Interaction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TreasureBoxBase_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Interaction.Interaction_C
// 0x00A0 (0x0418 - 0x0378)
class AInteraction_C : public ATreasureBoxBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Interaction_C;                      // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          TriggerBox;                                        // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CollisionBox;                                      // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               FlashInstance;                                     // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InShadow;                                          // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EmissiveColor;                                     // 0x03AC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           OriginColor;                                       // 0x03BC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsStatcMesh;                                       // 0x03CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CD[0x3];                                      // 0x03CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DropID;                                            // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DropNum;                                           // 0x03D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset;                                            // 0x03D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Wwise;                                             // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UWwiseComponent*                        WwiseRef;                                          // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 VoiceID;                                           // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          UseInitialVelocity;                                // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void BoxOpenFinish();
	void OnTrigger_Client(bool bIsBeginOverlap, class AActor* OtherActor);
	void GetInteractionWidgetLua(class UUserWidget** Widget);
	void OnActiveChange();
	void TriggerHandle(bool bIsBeginOverlap, class AActor* OtherActor);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void Play_Voice();
	void DropSupply(int32 TemplateId, int32 RepresentNum);
	void Active();
	void Stop_Interaction();
	void UserConstructionScript();
	void Client_OnInteracting();
	void Client_OnInteractable();
	void Client_OnFinish();
	void ExecuteUbergraph_Interaction(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Interaction_C">();
	}
	static class AInteraction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInteraction_C>();
	}
};
static_assert(alignof(AInteraction_C) == 0x000008, "Wrong alignment on AInteraction_C");
static_assert(sizeof(AInteraction_C) == 0x000418, "Wrong size on AInteraction_C");
static_assert(offsetof(AInteraction_C, UberGraphFrame_Interaction_C) == 0x000378, "Member 'AInteraction_C::UberGraphFrame_Interaction_C' has a wrong offset!");
static_assert(offsetof(AInteraction_C, TriggerBox) == 0x000380, "Member 'AInteraction_C::TriggerBox' has a wrong offset!");
static_assert(offsetof(AInteraction_C, CollisionBox) == 0x000388, "Member 'AInteraction_C::CollisionBox' has a wrong offset!");
static_assert(offsetof(AInteraction_C, SkeletalMesh) == 0x000390, "Member 'AInteraction_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(AInteraction_C, Mesh) == 0x000398, "Member 'AInteraction_C::Mesh' has a wrong offset!");
static_assert(offsetof(AInteraction_C, FlashInstance) == 0x0003A0, "Member 'AInteraction_C::FlashInstance' has a wrong offset!");
static_assert(offsetof(AInteraction_C, InShadow) == 0x0003A8, "Member 'AInteraction_C::InShadow' has a wrong offset!");
static_assert(offsetof(AInteraction_C, EmissiveColor) == 0x0003AC, "Member 'AInteraction_C::EmissiveColor' has a wrong offset!");
static_assert(offsetof(AInteraction_C, OriginColor) == 0x0003BC, "Member 'AInteraction_C::OriginColor' has a wrong offset!");
static_assert(offsetof(AInteraction_C, IsStatcMesh) == 0x0003CC, "Member 'AInteraction_C::IsStatcMesh' has a wrong offset!");
static_assert(offsetof(AInteraction_C, DropID) == 0x0003D0, "Member 'AInteraction_C::DropID' has a wrong offset!");
static_assert(offsetof(AInteraction_C, DropNum) == 0x0003D4, "Member 'AInteraction_C::DropNum' has a wrong offset!");
static_assert(offsetof(AInteraction_C, Offset) == 0x0003D8, "Member 'AInteraction_C::Offset' has a wrong offset!");
static_assert(offsetof(AInteraction_C, Wwise) == 0x0003E8, "Member 'AInteraction_C::Wwise' has a wrong offset!");
static_assert(offsetof(AInteraction_C, WwiseRef) == 0x0003F8, "Member 'AInteraction_C::WwiseRef' has a wrong offset!");
static_assert(offsetof(AInteraction_C, VoiceID) == 0x000400, "Member 'AInteraction_C::VoiceID' has a wrong offset!");
static_assert(offsetof(AInteraction_C, UseInitialVelocity) == 0x000410, "Member 'AInteraction_C::UseInitialVelocity' has a wrong offset!");

}

