#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: interaction_progress_component

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass interaction_progress_component.interaction_progress_component_C
// 0x0010 (0x05E0 - 0x05D0)
class Uinteraction_progress_component_C final : public UWidgetComponent
{
public:
	uint8                                         Pad_5C8[0x8];                                      // 0x05C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bPerform;                                          // 0x05D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D9[0x3];                                      // 0x05D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AddSpeed;                                          // 0x05DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_interaction_progress_component(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void StartProgress(float PerformTime);
	void CloseUI();
	void OpenUI();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("interaction_progress_component_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"interaction_progress_component_C")
	}
	static class Uinteraction_progress_component_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uinteraction_progress_component_C>();
	}
};
DUMPER7_ASSERTS_Uinteraction_progress_component_C;

}

