#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KaiXiya_ShootEnergyComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass KaiXiya_ShootEnergyComponent.KaiXiya_ShootEnergyComponent_C
// 0x0018 (0x0078 - 0x0060)
class UKaiXiya_ShootEnergyComponent_C final : public UAbilitySpecialAttribute
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0060(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         DecreasePerSecond;                                 // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RefreshLimitSecond;                                // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurSecond;                                         // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetAttribute(class UAbilityComponentBase* InOwner, float ChangeValue);
	void K2_ReceiveTick(float DeltaSeconds, const class UAbilityComponentBase* InOwner);
	void ExecuteUbergraph_KaiXiya_ShootEnergyComponent(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"KaiXiya_ShootEnergyComponent_C">();
	}
	static class UKaiXiya_ShootEnergyComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKaiXiya_ShootEnergyComponent_C>();
	}
};
static_assert(alignof(UKaiXiya_ShootEnergyComponent_C) == 0x000008, "Wrong alignment on UKaiXiya_ShootEnergyComponent_C");
static_assert(sizeof(UKaiXiya_ShootEnergyComponent_C) == 0x000078, "Wrong size on UKaiXiya_ShootEnergyComponent_C");
static_assert(offsetof(UKaiXiya_ShootEnergyComponent_C, UberGraphFrame) == 0x000060, "Member 'UKaiXiya_ShootEnergyComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UKaiXiya_ShootEnergyComponent_C, DecreasePerSecond) == 0x000068, "Member 'UKaiXiya_ShootEnergyComponent_C::DecreasePerSecond' has a wrong offset!");
static_assert(offsetof(UKaiXiya_ShootEnergyComponent_C, RefreshLimitSecond) == 0x00006C, "Member 'UKaiXiya_ShootEnergyComponent_C::RefreshLimitSecond' has a wrong offset!");
static_assert(offsetof(UKaiXiya_ShootEnergyComponent_C, CurSecond) == 0x000070, "Member 'UKaiXiya_ShootEnergyComponent_C::CurSecond' has a wrong offset!");

}

