#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KillMonsterBaseExecute

#include "Basic.hpp"

#include "GameTask_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass KillMonsterBaseExecute.KillMonsterBaseExecute_C
// 0x0020 (0x0220 - 0x0200)
#pragma pack(push, 0x1)
class alignas(0x08) UKillMonsterBaseExecute_C : public UGameTask_Execute
{
public:
	int32                                         Num;                                               // 0x0200(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IngnoreSuicide;                                    // 0x0204(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IgnoreLeave;                                       // 0x0205(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_206[0x2];                                      // 0x0206(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LeaveMonsterTag;                                   // 0x0208(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CheckPlayerKill;                                   // 0x0218(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DoFuncImmediately;                                 // 0x0219(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void OnActive();
	void OnActive_Client();
	void OnEnd();
	class FString GetDescription();
	void OnEnd_Client();
	void OnCountDown_Client();

	class FString GetSpecialStaticDescription() const;
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"KillMonsterBaseExecute_C">();
	}
	static class UKillMonsterBaseExecute_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKillMonsterBaseExecute_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(UKillMonsterBaseExecute_C) == 0x000008, "Wrong alignment on UKillMonsterBaseExecute_C");
static_assert(sizeof(UKillMonsterBaseExecute_C) == 0x000220, "Wrong size on UKillMonsterBaseExecute_C");
static_assert(offsetof(UKillMonsterBaseExecute_C, Num) == 0x000200, "Member 'UKillMonsterBaseExecute_C::Num' has a wrong offset!");
static_assert(offsetof(UKillMonsterBaseExecute_C, IngnoreSuicide) == 0x000204, "Member 'UKillMonsterBaseExecute_C::IngnoreSuicide' has a wrong offset!");
static_assert(offsetof(UKillMonsterBaseExecute_C, IgnoreLeave) == 0x000205, "Member 'UKillMonsterBaseExecute_C::IgnoreLeave' has a wrong offset!");
static_assert(offsetof(UKillMonsterBaseExecute_C, LeaveMonsterTag) == 0x000208, "Member 'UKillMonsterBaseExecute_C::LeaveMonsterTag' has a wrong offset!");
static_assert(offsetof(UKillMonsterBaseExecute_C, CheckPlayerKill) == 0x000218, "Member 'UKillMonsterBaseExecute_C::CheckPlayerKill' has a wrong offset!");
static_assert(offsetof(UKillMonsterBaseExecute_C, DoFuncImmediately) == 0x000219, "Member 'UKillMonsterBaseExecute_C::DoFuncImmediately' has a wrong offset!");

}

