#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KillZone

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function KillZone.KillZone_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct KillZone_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KillZone_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on KillZone_C_ReceiveActorBeginOverlap");
static_assert(sizeof(KillZone_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on KillZone_C_ReceiveActorBeginOverlap");
static_assert(offsetof(KillZone_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'KillZone_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function KillZone.KillZone_C.TryKill
// 0x0008 (0x0008 - 0x0000)
struct KillZone_C_TryKill final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KillZone_C_TryKill) == 0x000008, "Wrong alignment on KillZone_C_TryKill");
static_assert(sizeof(KillZone_C_TryKill) == 0x000008, "Wrong size on KillZone_C_TryKill");
static_assert(offsetof(KillZone_C_TryKill, InActor) == 0x000000, "Member 'KillZone_C_TryKill::InActor' has a wrong offset!");

// Function KillZone.KillZone_C.ExecuteUbergraph_KillZone
// 0x0060 (0x0060 - 0x0000)
struct KillZone_C_ExecuteUbergraph_KillZone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_InActor;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameMassAICharacter*                   K2Node_DynamicCast_AsGame_Mass_AICharacter;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAICharacter*                       K2Node_DynamicCast_AsGame_AICharacter;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeModifier_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeModifier_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KillZone_C_ExecuteUbergraph_KillZone) == 0x000008, "Wrong alignment on KillZone_C_ExecuteUbergraph_KillZone");
static_assert(sizeof(KillZone_C_ExecuteUbergraph_KillZone) == 0x000060, "Wrong size on KillZone_C_ExecuteUbergraph_KillZone");
static_assert(offsetof(KillZone_C_ExecuteUbergraph_KillZone, EntryPoint) == 0x000000, "Member 'KillZone_C_ExecuteUbergraph_KillZone::EntryPoint' has a wrong offset!");
static_assert(offsetof(KillZone_C_ExecuteUbergraph_KillZone, K2Node_Event_InActor) == 0x000008, "Member 'KillZone_C_ExecuteUbergraph_KillZone::K2Node_Event_InActor' has a wrong offset!");
static_assert(offsetof(KillZone_C_ExecuteUbergraph_KillZone, K2Node_DynamicCast_AsGame_Mass_AICharacter) == 0x000010, "Member 'KillZone_C_ExecuteUbergraph_KillZone::K2Node_DynamicCast_AsGame_Mass_AICharacter' has a wrong offset!");
static_assert(offsetof(KillZone_C_ExecuteUbergraph_KillZone, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'KillZone_C_ExecuteUbergraph_KillZone::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KillZone_C_ExecuteUbergraph_KillZone, K2Node_DynamicCast_AsGame_AICharacter) == 0x000020, "Member 'KillZone_C_ExecuteUbergraph_KillZone::K2Node_DynamicCast_AsGame_AICharacter' has a wrong offset!");
static_assert(offsetof(KillZone_C_ExecuteUbergraph_KillZone, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'KillZone_C_ExecuteUbergraph_KillZone::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(KillZone_C_ExecuteUbergraph_KillZone, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00002C, "Member 'KillZone_C_ExecuteUbergraph_KillZone::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillZone_C_ExecuteUbergraph_KillZone, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'KillZone_C_ExecuteUbergraph_KillZone::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillZone_C_ExecuteUbergraph_KillZone, K2Node_Event_OtherActor) == 0x000040, "Member 'KillZone_C_ExecuteUbergraph_KillZone::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(KillZone_C_ExecuteUbergraph_KillZone, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000048, "Member 'KillZone_C_ExecuteUbergraph_KillZone::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KillZone_C_ExecuteUbergraph_KillZone, CallFunc_MakeModifier_ReturnValue) == 0x000054, "Member 'KillZone_C_ExecuteUbergraph_KillZone::CallFunc_MakeModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillZone_C_ExecuteUbergraph_KillZone, CallFunc_MakeModifier_ReturnValue_1) == 0x000058, "Member 'KillZone_C_ExecuteUbergraph_KillZone::CallFunc_MakeModifier_ReturnValue_1' has a wrong offset!");

}

