#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KillMonsterByIDExecute

#include "Basic.hpp"


namespace SDK::Params
{

// LuaFunction KillMonsterByIDExecute.KillMonsterByIdExecute_C.GetDescription
// 0x0010 (0x0010 - 0x0000)
struct KillMonsterByIdExecute_C_GetDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KillMonsterByIdExecute_C_GetDescription;

// Function KillMonsterByIDExecute.KillMonsterByIdExecute_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct KillMonsterByIdExecute_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_KillMonsterByIdExecute_C_GetModuleName;

// Function KillMonsterByIDExecute.KillMonsterByIdExecute_C.GetSpecialStaticDescription
// 0x0060 (0x0060 - 0x0000)
struct KillMonsterByIdExecute_C_GetSpecialStaticDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSpecialStaticDescription_ReturnValue;  // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_KillMonsterByIdExecute_C_GetSpecialStaticDescription;

}

