#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KillMonsterBaseExecute

#include "Basic.hpp"


namespace SDK::Params
{

// LuaFunction KillMonsterBaseExecute.KillMonsterBaseExecute_C.GetDescription
// 0x0010 (0x0010 - 0x0000)
struct KillMonsterBaseExecute_C_GetDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KillMonsterBaseExecute_C_GetDescription) == 0x000008, "Wrong alignment on KillMonsterBaseExecute_C_GetDescription");
static_assert(sizeof(KillMonsterBaseExecute_C_GetDescription) == 0x000010, "Wrong size on KillMonsterBaseExecute_C_GetDescription");
static_assert(offsetof(KillMonsterBaseExecute_C_GetDescription, ReturnValue) == 0x000000, "Member 'KillMonsterBaseExecute_C_GetDescription::ReturnValue' has a wrong offset!");

// Function KillMonsterBaseExecute.KillMonsterBaseExecute_C.GetSpecialStaticDescription
// 0x0090 (0x0090 - 0x0000)
struct KillMonsterBaseExecute_C_GetSpecialStaticDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_1;          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(KillMonsterBaseExecute_C_GetSpecialStaticDescription) == 0x000008, "Wrong alignment on KillMonsterBaseExecute_C_GetSpecialStaticDescription");
static_assert(sizeof(KillMonsterBaseExecute_C_GetSpecialStaticDescription) == 0x000090, "Wrong size on KillMonsterBaseExecute_C_GetSpecialStaticDescription");
static_assert(offsetof(KillMonsterBaseExecute_C_GetSpecialStaticDescription, ReturnValue) == 0x000000, "Member 'KillMonsterBaseExecute_C_GetSpecialStaticDescription::ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMonsterBaseExecute_C_GetSpecialStaticDescription, CallFunc_Conv_BoolToString_ReturnValue) == 0x000010, "Member 'KillMonsterBaseExecute_C_GetSpecialStaticDescription::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMonsterBaseExecute_C_GetSpecialStaticDescription, CallFunc_Conv_BoolToString_ReturnValue_1) == 0x000020, "Member 'KillMonsterBaseExecute_C_GetSpecialStaticDescription::CallFunc_Conv_BoolToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KillMonsterBaseExecute_C_GetSpecialStaticDescription, CallFunc_Conv_IntToString_ReturnValue) == 0x000030, "Member 'KillMonsterBaseExecute_C_GetSpecialStaticDescription::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMonsterBaseExecute_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'KillMonsterBaseExecute_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMonsterBaseExecute_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000050, "Member 'KillMonsterBaseExecute_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KillMonsterBaseExecute_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000060, "Member 'KillMonsterBaseExecute_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KillMonsterBaseExecute_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000070, "Member 'KillMonsterBaseExecute_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(KillMonsterBaseExecute_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000080, "Member 'KillMonsterBaseExecute_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");

// Function KillMonsterBaseExecute.KillMonsterBaseExecute_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct KillMonsterBaseExecute_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(KillMonsterBaseExecute_C_GetModuleName) == 0x000008, "Wrong alignment on KillMonsterBaseExecute_C_GetModuleName");
static_assert(sizeof(KillMonsterBaseExecute_C_GetModuleName) == 0x000010, "Wrong size on KillMonsterBaseExecute_C_GetModuleName");
static_assert(offsetof(KillMonsterBaseExecute_C_GetModuleName, ReturnValue) == 0x000000, "Member 'KillMonsterBaseExecute_C_GetModuleName::ReturnValue' has a wrong offset!");

}

