#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KillMonsterBaseExecute

#include "Basic.hpp"

#include "GameTask_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass KillMonsterBaseExecute.KillMonsterBaseExecute_C
// 0x0020 (0x0220 - 0x0200)
class UKillMonsterBaseExecute_C final : public UGameTask_Execute
{
public:
	int32                                         Num;                                               // 0x0200(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IngnoreSuicide;                                    // 0x0204(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IgnoreLeave;                                       // 0x0205(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_206[0x2];                                      // 0x0206(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LeaveMonsterTag;                                   // 0x0208(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CheckPlayerKill;                                   // 0x0218(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DoFuncImmediately;                                 // 0x0219(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void OnEnd_Client();
	class FString GetDescription();
	void OnActive();
	void OnActive_Client();
	void OnCountDown_Client();
	void OnEnd();

	class FString GetSpecialStaticDescription() const;
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("KillMonsterBaseExecute_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KillMonsterBaseExecute_C")
	}
	static class UKillMonsterBaseExecute_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKillMonsterBaseExecute_C>();
	}
};
DUMPER7_ASSERTS_UKillMonsterBaseExecute_C;

}

