#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LetCharactersLeave

#include "Basic.hpp"


namespace SDK::Params
{

// LuaFunction LetCharactersLeave.LetCharactersLeave_C.OnTrigger
// 0x0001 (0x0001 - 0x0000)
struct LetCharactersLeave_C_OnTrigger final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(LetCharactersLeave_C_OnTrigger) == 0x000001, "Wrong alignment on LetCharactersLeave_C_OnTrigger");
static_assert(sizeof(LetCharactersLeave_C_OnTrigger) == 0x000001, "Wrong size on LetCharactersLeave_C_OnTrigger");
static_assert(offsetof(LetCharactersLeave_C_OnTrigger, ReturnValue) == 0x000000, "Member 'LetCharactersLeave_C_OnTrigger::ReturnValue' has a wrong offset!");

// Function LetCharactersLeave.LetCharactersLeave_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct LetCharactersLeave_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(LetCharactersLeave_C_GetModuleName) == 0x000008, "Wrong alignment on LetCharactersLeave_C_GetModuleName");
static_assert(sizeof(LetCharactersLeave_C_GetModuleName) == 0x000010, "Wrong size on LetCharactersLeave_C_GetModuleName");
static_assert(offsetof(LetCharactersLeave_C_GetModuleName, ReturnValue) == 0x000000, "Member 'LetCharactersLeave_C_GetModuleName::ReturnValue' has a wrong offset!");

}

