#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelStarTask_9

#include "Basic.hpp"


namespace SDK::Params
{

// Function LevelStarTask_9.LevelStarTask_9_C.ExecuteUbergraph_LevelStarTask_9
// 0x0020 (0x0020 - 0x0000)
struct LevelStarTask_9_C_ExecuteUbergraph_LevelStarTask_9 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ___string_Variable;                                // 0x0008(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelStarTask_9_C_ExecuteUbergraph_LevelStarTask_9) == 0x000008, "Wrong alignment on LevelStarTask_9_C_ExecuteUbergraph_LevelStarTask_9");
static_assert(sizeof(LevelStarTask_9_C_ExecuteUbergraph_LevelStarTask_9) == 0x000020, "Wrong size on LevelStarTask_9_C_ExecuteUbergraph_LevelStarTask_9");
static_assert(offsetof(LevelStarTask_9_C_ExecuteUbergraph_LevelStarTask_9, EntryPoint) == 0x000000, "Member 'LevelStarTask_9_C_ExecuteUbergraph_LevelStarTask_9::EntryPoint' has a wrong offset!");
static_assert(offsetof(LevelStarTask_9_C_ExecuteUbergraph_LevelStarTask_9, ___string_Variable) == 0x000008, "Member 'LevelStarTask_9_C_ExecuteUbergraph_LevelStarTask_9::___string_Variable' has a wrong offset!");
static_assert(offsetof(LevelStarTask_9_C_ExecuteUbergraph_LevelStarTask_9, CallFunc_Array_Add_ReturnValue) == 0x000018, "Member 'LevelStarTask_9_C_ExecuteUbergraph_LevelStarTask_9::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function LevelStarTask_9.LevelStarTask_9_C.GetCurrentState
// 0x0010 (0x0010 - 0x0000)
struct LevelStarTask_9_C_GetCurrentState final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(LevelStarTask_9_C_GetCurrentState) == 0x000008, "Wrong alignment on LevelStarTask_9_C_GetCurrentState");
static_assert(sizeof(LevelStarTask_9_C_GetCurrentState) == 0x000010, "Wrong size on LevelStarTask_9_C_GetCurrentState");
static_assert(offsetof(LevelStarTask_9_C_GetCurrentState, ReturnValue) == 0x000000, "Member 'LevelStarTask_9_C_GetCurrentState::ReturnValue' has a wrong offset!");

}

