#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelStarTask_9

#include "Basic.hpp"


namespace SDK::Params
{

// Function LevelStarTask_9.LevelStarTask_9_C.ExecuteUbergraph_LevelStarTask_9
// 0x0020 (0x0020 - 0x0000)
struct LevelStarTask_9_C_ExecuteUbergraph_LevelStarTask_9 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ___string_Variable;                                // 0x0008(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LevelStarTask_9_C_ExecuteUbergraph_LevelStarTask_9;

// Function LevelStarTask_9.LevelStarTask_9_C.GetCurrentState
// 0x0010 (0x0010 - 0x0000)
struct LevelStarTask_9_C_GetCurrentState final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LevelStarTask_9_C_GetCurrentState;

}

