#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelCameraFocus

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameTask_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LevelCameraFocus.LevelCameraFocus_C
// 0x0080 (0x01C8 - 0x0148)
class ULevelCameraFocus_C final : public UGameTaskEvent
{
public:
	float                                         In_Camera_Arm_Length;                              // 0x0148(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                In_Camera_Socket_Offset;                           // 0x014C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                In_Camera_Arm_Position;                            // 0x0158(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         In_Camera_FOV;                                     // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         In_Blend_in_Speed;                                 // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         In_Blend_Out_Speed;                                // 0x016C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         In_Blend_Out_Time;                                 // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         View_Pitch_Min_Additive;                           // 0x0174(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         View_Pitch_Max_Additive;                           // 0x0178(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CameraFocusTag;                                    // 0x017C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     Actor_Class;                                       // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AActor*                                 CameraFocusTarget;                                 // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraFocusRotateSpeed;                            // 0x0198(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ClearDelayTime;                                    // 0x019C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggerDelayTime;                                  // 0x01A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayerController*                  PlayerController;                                  // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AThirdPersonPlayerCameraManager*        CameraManager;                                     // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FragmentStoryId;                                   // 0x01B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFragmentIsGourp;                                  // 0x01BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bUseSpeedAsTimeForSinEase;                         // 0x01BD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          StopTimer;                                         // 0x01BE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IncludeJoystick;                                   // 0x01BF(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHideUI;                                           // 0x01C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	bool OnTrigger();
	void GetActorByTag();
	void CameraFocus();
	void ClearFocus();
	void OnStopTimer(bool StopFlag);
	void OnSkillEndCheck__Overridden(bool* Result);
	void InitCast();
	void StopPlayer();
	void OnRemoveSkillEnd__Overridden();
	TMap<class UUserWidget*, ESlateVisibility> HideAllUI();
	void DealFightUI__Overridden(bool IsHide, class UUserWidget* FightWidget);
	void ShowAllUI(const TMap<class UUserWidget*, ESlateVisibility>& WidgetsIn);
	void GetFightWidgets(TMap<int32, ESlateVisibility>* Res);
	void GetUIWidgets(TMap<class UUserWidget*, ESlateVisibility>* Res);
	void SetUIWidgets(const TMap<class UUserWidget*, ESlateVisibility>& InWidgets);
	void SetFightWidgets(const TMap<int32, ESlateVisibility>& In);
	void DoHideAllUI();
	void DoShowAllUI();
	void OnRemoveSkillEnd();
	void OnSkillEndCheck(bool* Result);
	void DealFightUI(bool IsHide, class UUserWidget* FightWidget);

	class FString GetSpecialStaticDescription() const;
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LevelCameraFocus_C">();
	}
	static class ULevelCameraFocus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelCameraFocus_C>();
	}
};
static_assert(alignof(ULevelCameraFocus_C) == 0x000008, "Wrong alignment on ULevelCameraFocus_C");
static_assert(sizeof(ULevelCameraFocus_C) == 0x0001C8, "Wrong size on ULevelCameraFocus_C");
static_assert(offsetof(ULevelCameraFocus_C, In_Camera_Arm_Length) == 0x000148, "Member 'ULevelCameraFocus_C::In_Camera_Arm_Length' has a wrong offset!");
static_assert(offsetof(ULevelCameraFocus_C, In_Camera_Socket_Offset) == 0x00014C, "Member 'ULevelCameraFocus_C::In_Camera_Socket_Offset' has a wrong offset!");
static_assert(offsetof(ULevelCameraFocus_C, In_Camera_Arm_Position) == 0x000158, "Member 'ULevelCameraFocus_C::In_Camera_Arm_Position' has a wrong offset!");
static_assert(offsetof(ULevelCameraFocus_C, In_Camera_FOV) == 0x000164, "Member 'ULevelCameraFocus_C::In_Camera_FOV' has a wrong offset!");
static_assert(offsetof(ULevelCameraFocus_C, In_Blend_in_Speed) == 0x000168, "Member 'ULevelCameraFocus_C::In_Blend_in_Speed' has a wrong offset!");
static_assert(offsetof(ULevelCameraFocus_C, In_Blend_Out_Speed) == 0x00016C, "Member 'ULevelCameraFocus_C::In_Blend_Out_Speed' has a wrong offset!");
static_assert(offsetof(ULevelCameraFocus_C, In_Blend_Out_Time) == 0x000170, "Member 'ULevelCameraFocus_C::In_Blend_Out_Time' has a wrong offset!");
static_assert(offsetof(ULevelCameraFocus_C, View_Pitch_Min_Additive) == 0x000174, "Member 'ULevelCameraFocus_C::View_Pitch_Min_Additive' has a wrong offset!");
static_assert(offsetof(ULevelCameraFocus_C, View_Pitch_Max_Additive) == 0x000178, "Member 'ULevelCameraFocus_C::View_Pitch_Max_Additive' has a wrong offset!");
static_assert(offsetof(ULevelCameraFocus_C, CameraFocusTag) == 0x00017C, "Member 'ULevelCameraFocus_C::CameraFocusTag' has a wrong offset!");
static_assert(offsetof(ULevelCameraFocus_C, Actor_Class) == 0x000188, "Member 'ULevelCameraFocus_C::Actor_Class' has a wrong offset!");
static_assert(offsetof(ULevelCameraFocus_C, CameraFocusTarget) == 0x000190, "Member 'ULevelCameraFocus_C::CameraFocusTarget' has a wrong offset!");
static_assert(offsetof(ULevelCameraFocus_C, CameraFocusRotateSpeed) == 0x000198, "Member 'ULevelCameraFocus_C::CameraFocusRotateSpeed' has a wrong offset!");
static_assert(offsetof(ULevelCameraFocus_C, ClearDelayTime) == 0x00019C, "Member 'ULevelCameraFocus_C::ClearDelayTime' has a wrong offset!");
static_assert(offsetof(ULevelCameraFocus_C, TriggerDelayTime) == 0x0001A0, "Member 'ULevelCameraFocus_C::TriggerDelayTime' has a wrong offset!");
static_assert(offsetof(ULevelCameraFocus_C, PlayerController) == 0x0001A8, "Member 'ULevelCameraFocus_C::PlayerController' has a wrong offset!");
static_assert(offsetof(ULevelCameraFocus_C, CameraManager) == 0x0001B0, "Member 'ULevelCameraFocus_C::CameraManager' has a wrong offset!");
static_assert(offsetof(ULevelCameraFocus_C, FragmentStoryId) == 0x0001B8, "Member 'ULevelCameraFocus_C::FragmentStoryId' has a wrong offset!");
static_assert(offsetof(ULevelCameraFocus_C, bFragmentIsGourp) == 0x0001BC, "Member 'ULevelCameraFocus_C::bFragmentIsGourp' has a wrong offset!");
static_assert(offsetof(ULevelCameraFocus_C, bUseSpeedAsTimeForSinEase) == 0x0001BD, "Member 'ULevelCameraFocus_C::bUseSpeedAsTimeForSinEase' has a wrong offset!");
static_assert(offsetof(ULevelCameraFocus_C, StopTimer) == 0x0001BE, "Member 'ULevelCameraFocus_C::StopTimer' has a wrong offset!");
static_assert(offsetof(ULevelCameraFocus_C, IncludeJoystick) == 0x0001BF, "Member 'ULevelCameraFocus_C::IncludeJoystick' has a wrong offset!");
static_assert(offsetof(ULevelCameraFocus_C, bHideUI) == 0x0001C0, "Member 'ULevelCameraFocus_C::bHideUI' has a wrong offset!");

}

