#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Level16_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Level16_01.Level16_01_C
// 0x00F0 (0x0320 - 0x0230)
class ALevel16_01_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_0_NewTrack_0_1A4C174E4317869E7B652D9765EE0200; // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_1A4C174E4317869E7B652D9765EE0200; // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_NewTrack_0_C291C24A4CA9CFA8BE73C6980269BAED; // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_C291C24A4CA9CFA8BE73C6980269BAED; // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Loc_1;                                             // 0x0258(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseMonster_C*                         As_Base_Monster_01;                                // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Tag;                                               // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Target_Self_01;                                    // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Jumpheight;                                        // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABaseMonster_C*                         As_Base_Monster_02;                                // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Target_Self_02;                                    // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Loc_2;                                             // 0x0298(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0xC];                                      // 0x02A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Pos;                                               // 0x02B0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AActor*                                 movebody_ExecuteUbergraph_Level16_01_RefProperty;  // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_prop_interact073_C*                 BP_prop_interact073_1_ExecuteUbergraph_Level16_01_RefProperty; // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_prop_interact073_C*                 BP_prop_interact073_2_ExecuteUbergraph_Level16_01_RefProperty; // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_prop_interact073_C*                 BP_prop_interact073_4_ExecuteUbergraph_Level16_01_RefProperty; // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_prop_interact073_C*                 BP_prop_interact073_5_ExecuteUbergraph_Level16_01_RefProperty; // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_prop_interact073_C*                 BP_prop_interact073_6_ExecuteUbergraph_Level16_01_RefProperty; // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANPCSpawnPoint*                         Two0108_ExecuteUbergraph_Level16_01_RefProperty;   // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANPCSpawnPoint*                         Two0109_ExecuteUbergraph_Level16_01_RefProperty;   // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void OnNotifyEnd_C94BC9AE4744FB7EB5182393EAF39FD9(class FName NotifyName);
	void OnNotifyBegin_C94BC9AE4744FB7EB5182393EAF39FD9(class FName NotifyName);
	void OnInterrupted_C94BC9AE4744FB7EB5182393EAF39FD9(class FName NotifyName);
	void OnBlendOut_C94BC9AE4744FB7EB5182393EAF39FD9(class FName NotifyName);
	void OnCompleted_C94BC9AE4744FB7EB5182393EAF39FD9(class FName NotifyName);
	void OnNotifyEnd_4404CF064EFE66DED1D2B0AD88A33628(class FName NotifyName);
	void OnNotifyBegin_4404CF064EFE66DED1D2B0AD88A33628(class FName NotifyName);
	void OnInterrupted_4404CF064EFE66DED1D2B0AD88A33628(class FName NotifyName);
	void OnBlendOut_4404CF064EFE66DED1D2B0AD88A33628(class FName NotifyName);
	void OnCompleted_4404CF064EFE66DED1D2B0AD88A33628(class FName NotifyName);
	void Zero72A_01();
	void xxx_01();
	void BP_prop_interact073_1_up();
	void BP_prop_interact073_2_up();
	void BP_prop_interact073_4_up();
	void BP_prop_interact073_5_up();
	void BP_prop_interact073_6_up();
	void BP_prop_interact073_1_down();
	void BP_prop_interact073_2_down();
	void BP_prop_interact073_4_down();
	void BP_prop_interact073_5_down();
	void BP_prop_interact073_6_down();
	void xxx_02();
	void Zero72A_02();
	void Hide();
	void Unhide();
	void HideCharacter();
	void ShowCharacter();
	void ExecuteUbergraph_Level16_01(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Level16_01_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Level16_01_C")
	}
	static class ALevel16_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALevel16_01_C>();
	}
};
DUMPER7_ASSERTS_ALevel16_01_C;

}

