#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Level13_12

#include "Basic.hpp"


namespace SDK::Params
{

// Function Level13_12.Level13_12_C.ExecuteUbergraph_Level13_12
// 0x00C8 (0x00C8 - 0x0000)
struct Level13_12_C_ExecuteUbergraph_Level13_12 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayerController*                  K2Node_DynamicCast_AsGame_Player_Controller;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayerController*                  K2Node_DynamicCast_AsGame_Player_Controller_1;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter_C*                       K2Node_DynamicCast_AsBase_Character;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter_C*                       K2Node_DynamicCast_AsBase_Character_1;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGameCharacter*>                 CallFunc_GetAllMembersPtr_ReturnValue;             // 0x0088(0x0010)(ReferenceParm)
	class AGameCharacter*                         CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGameCharacter*>                 CallFunc_GetAllMembersPtr_ReturnValue_1;           // 0x00A8(0x0010)(ReferenceParm)
	class AGameCharacter*                         CallFunc_Array_Get_Item_1;                         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Level13_12_C_ExecuteUbergraph_Level13_12) == 0x000008, "Wrong alignment on Level13_12_C_ExecuteUbergraph_Level13_12");
static_assert(sizeof(Level13_12_C_ExecuteUbergraph_Level13_12) == 0x0000C8, "Wrong size on Level13_12_C_ExecuteUbergraph_Level13_12");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, EntryPoint) == 0x000000, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::EntryPoint' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, ___int_Loop_Counter_Variable) == 0x000004, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, ___int_Array_Index_Variable) == 0x000008, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, ___int_Loop_Counter_Variable_1) == 0x000010, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, ___int_Array_Index_Variable_1) == 0x000018, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, CallFunc_GetPlayerController_ReturnValue_1) == 0x000028, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, CallFunc_GetPlayerController_ReturnValue_2) == 0x000030, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, K2Node_DynamicCast_AsGame_Player_Controller) == 0x000038, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::K2Node_DynamicCast_AsGame_Player_Controller' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, K2Node_DynamicCast_AsGame_Player_Controller_1) == 0x000048, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::K2Node_DynamicCast_AsGame_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, CallFunc_GetPlayerPawn_ReturnValue) == 0x000058, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, K2Node_DynamicCast_AsBase_Character) == 0x000060, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::K2Node_DynamicCast_AsBase_Character' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000070, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, K2Node_DynamicCast_AsBase_Character_1) == 0x000078, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::K2Node_DynamicCast_AsBase_Character_1' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, K2Node_DynamicCast_bSuccess_3) == 0x000080, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, CallFunc_IsValid_ReturnValue) == 0x000081, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, CallFunc_IsValid_ReturnValue_1) == 0x000082, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, CallFunc_GetAllMembersPtr_ReturnValue) == 0x000088, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::CallFunc_GetAllMembersPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, CallFunc_Array_Get_Item) == 0x000098, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, CallFunc_Less_IntInt_ReturnValue) == 0x0000A4, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, CallFunc_GetAllMembersPtr_ReturnValue_1) == 0x0000A8, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::CallFunc_GetAllMembersPtr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, CallFunc_Array_Get_Item_1) == 0x0000B8, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, CallFunc_Array_Length_ReturnValue_1) == 0x0000C0, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Level13_12_C_ExecuteUbergraph_Level13_12, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C4, "Member 'Level13_12_C_ExecuteUbergraph_Level13_12::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function Level13_12.Level13_12_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Level13_12_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Level13_12_C_GetModuleName) == 0x000008, "Wrong alignment on Level13_12_C_GetModuleName");
static_assert(sizeof(Level13_12_C_GetModuleName) == 0x000010, "Wrong size on Level13_12_C_GetModuleName");
static_assert(offsetof(Level13_12_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Level13_12_C_GetModuleName::ReturnValue' has a wrong offset!");

}

