#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelPath_Plane

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LevelPath_Plane.LevelPath_Plane_C
// 0x0060 (0x02A8 - 0x0248)
class ALevelPath_Plane_C final : public ALevelPath_Plane
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Plane_Right;                                       // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane_Left;                                        // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Left_BlendSpeed;                                   // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Right_BlendSpeed;                                  // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanBlend;                                         // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Left_DynamicIns;                                   // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Right_DynamicIns;                                  // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Left_NowColor;                                     // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Right_NowColor;                                    // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveTick(float DeltaSeconds);
	void StartPerform(class USplineComponent* SplineComp);
	void StartBlend(float BlendTime);
	void ExecuteUbergraph_LevelPath_Plane(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LevelPath_Plane_C">();
	}
	static class ALevelPath_Plane_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALevelPath_Plane_C>();
	}
};
static_assert(alignof(ALevelPath_Plane_C) == 0x000008, "Wrong alignment on ALevelPath_Plane_C");
static_assert(sizeof(ALevelPath_Plane_C) == 0x0002A8, "Wrong size on ALevelPath_Plane_C");
static_assert(offsetof(ALevelPath_Plane_C, UberGraphFrame) == 0x000248, "Member 'ALevelPath_Plane_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALevelPath_Plane_C, Plane_Right) == 0x000250, "Member 'ALevelPath_Plane_C::Plane_Right' has a wrong offset!");
static_assert(offsetof(ALevelPath_Plane_C, Plane_Left) == 0x000258, "Member 'ALevelPath_Plane_C::Plane_Left' has a wrong offset!");
static_assert(offsetof(ALevelPath_Plane_C, DefaultSceneRoot) == 0x000260, "Member 'ALevelPath_Plane_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ALevelPath_Plane_C, Left_BlendSpeed) == 0x000268, "Member 'ALevelPath_Plane_C::Left_BlendSpeed' has a wrong offset!");
static_assert(offsetof(ALevelPath_Plane_C, Right_BlendSpeed) == 0x00026C, "Member 'ALevelPath_Plane_C::Right_BlendSpeed' has a wrong offset!");
static_assert(offsetof(ALevelPath_Plane_C, bCanBlend) == 0x000270, "Member 'ALevelPath_Plane_C::bCanBlend' has a wrong offset!");
static_assert(offsetof(ALevelPath_Plane_C, Left_DynamicIns) == 0x000278, "Member 'ALevelPath_Plane_C::Left_DynamicIns' has a wrong offset!");
static_assert(offsetof(ALevelPath_Plane_C, Right_DynamicIns) == 0x000280, "Member 'ALevelPath_Plane_C::Right_DynamicIns' has a wrong offset!");
static_assert(offsetof(ALevelPath_Plane_C, Left_NowColor) == 0x000288, "Member 'ALevelPath_Plane_C::Left_NowColor' has a wrong offset!");
static_assert(offsetof(ALevelPath_Plane_C, Right_NowColor) == 0x000298, "Member 'ALevelPath_Plane_C::Right_NowColor' has a wrong offset!");

}

