#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LocomotionAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass LocomotionAnimBP.LocomotionAnimBP_C
// 0x0FC0 (0x1320 - 0x0360)
class ULocomotionAnimBP_C : public UAnimInstance_Locomotion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0368(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x0398(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x03C0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x03E8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0468(0x0030)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0498(0x00A0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x0538(0x00E8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0620(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0708(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x0738(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x07E8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0830(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0858(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0880(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x08A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x08D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x08F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0920(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0948(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_5;                      // 0x0970(0x0018)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_4;                      // 0x0988(0x0018)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x09A0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0A20(0x0080)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2;                   // 0x0AA0(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0B50(0x0030)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_3;                      // 0x0B80(0x0018)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_2;                      // 0x0B98(0x0018)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0BB0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0C30(0x0080)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x0CB0(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0D60(0x0030)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_1;                      // 0x0D90(0x0018)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0DA8(0x0018)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0DC0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0E40(0x0080)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x0EC0(0x00B0)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x0F70(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1038(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1060(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x1090(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x10B8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x10E0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1110(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x11C0(0x0158)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LocomotionAnimBP_AnimGraphNode_TransitionResult_69AA85914E3D9849D70C7FA686CC06D3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LocomotionAnimBP_AnimGraphNode_TransitionResult_E06074A9492128202F424A9194CE0487();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LocomotionAnimBP_AnimGraphNode_TransitionResult_69C8A2474755E01F362480A1EE89B6C1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LocomotionAnimBP_AnimGraphNode_TransitionResult_CBD4CE6E432B2D3628504686D2308C4E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LocomotionAnimBP_AnimGraphNode_TransitionResult_15DB91684859F2258BAF739FE7014C38();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LocomotionAnimBP_AnimGraphNode_TransitionResult_4CD91C524EFF9D1103F633B6008FF365();
	void ExecuteUbergraph_LocomotionAnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LocomotionAnimBP_C">();
	}
	static class ULocomotionAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocomotionAnimBP_C>();
	}
};
static_assert(alignof(ULocomotionAnimBP_C) == 0x000010, "Wrong alignment on ULocomotionAnimBP_C");
static_assert(sizeof(ULocomotionAnimBP_C) == 0x001320, "Wrong size on ULocomotionAnimBP_C");
static_assert(offsetof(ULocomotionAnimBP_C, UberGraphFrame) == 0x000360, "Member 'ULocomotionAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_Root) == 0x000368, "Member 'ULocomotionAnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_TransitionResult_10) == 0x000398, "Member 'ULocomotionAnimBP_C::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_TransitionResult_9) == 0x0003C0, "Member 'ULocomotionAnimBP_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x0003E8, "Member 'ULocomotionAnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_StateResult_5) == 0x000468, "Member 'ULocomotionAnimBP_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_BlendListByBool) == 0x000498, "Member 'ULocomotionAnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_BlendSpacePlayer_1) == 0x000538, "Member 'ULocomotionAnimBP_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x000620, "Member 'ULocomotionAnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_StateResult_4) == 0x000708, "Member 'ULocomotionAnimBP_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_StateMachine_1) == 0x000738, "Member 'ULocomotionAnimBP_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_Slot) == 0x0007E8, "Member 'ULocomotionAnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_TransitionResult_8) == 0x000830, "Member 'ULocomotionAnimBP_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_TransitionResult_7) == 0x000858, "Member 'ULocomotionAnimBP_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_TransitionResult_6) == 0x000880, "Member 'ULocomotionAnimBP_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_TransitionResult_5) == 0x0008A8, "Member 'ULocomotionAnimBP_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_TransitionResult_4) == 0x0008D0, "Member 'ULocomotionAnimBP_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_TransitionResult_3) == 0x0008F8, "Member 'ULocomotionAnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_TransitionResult_2) == 0x000920, "Member 'ULocomotionAnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_TransitionResult_1) == 0x000948, "Member 'ULocomotionAnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_LocalRefPose_5) == 0x000970, "Member 'ULocomotionAnimBP_C::AnimGraphNode_LocalRefPose_5' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_LocalRefPose_4) == 0x000988, "Member 'ULocomotionAnimBP_C::AnimGraphNode_LocalRefPose_4' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x0009A0, "Member 'ULocomotionAnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x000A20, "Member 'ULocomotionAnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_BlendListByEnum_2) == 0x000AA0, "Member 'ULocomotionAnimBP_C::AnimGraphNode_BlendListByEnum_2' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_StateResult_3) == 0x000B50, "Member 'ULocomotionAnimBP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_LocalRefPose_3) == 0x000B80, "Member 'ULocomotionAnimBP_C::AnimGraphNode_LocalRefPose_3' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_LocalRefPose_2) == 0x000B98, "Member 'ULocomotionAnimBP_C::AnimGraphNode_LocalRefPose_2' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x000BB0, "Member 'ULocomotionAnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x000C30, "Member 'ULocomotionAnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_BlendListByEnum_1) == 0x000CB0, "Member 'ULocomotionAnimBP_C::AnimGraphNode_BlendListByEnum_1' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_StateResult_2) == 0x000D60, "Member 'ULocomotionAnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_LocalRefPose_1) == 0x000D90, "Member 'ULocomotionAnimBP_C::AnimGraphNode_LocalRefPose_1' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_LocalRefPose) == 0x000DA8, "Member 'ULocomotionAnimBP_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x000DC0, "Member 'ULocomotionAnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_SequencePlayer) == 0x000E40, "Member 'ULocomotionAnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_BlendListByEnum) == 0x000EC0, "Member 'ULocomotionAnimBP_C::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_TwoWayBlend) == 0x000F70, "Member 'ULocomotionAnimBP_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x001038, "Member 'ULocomotionAnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_StateResult_1) == 0x001060, "Member 'ULocomotionAnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_TransitionResult) == 0x001090, "Member 'ULocomotionAnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_UseCachedPose) == 0x0010B8, "Member 'ULocomotionAnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_StateResult) == 0x0010E0, "Member 'ULocomotionAnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_StateMachine) == 0x001110, "Member 'ULocomotionAnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(ULocomotionAnimBP_C, AnimGraphNode_SaveCachedPose) == 0x0011C0, "Member 'ULocomotionAnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");

}

