#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MiniGame

#include "Basic.hpp"

#include "MiniGame_structs.hpp"


namespace SDK::Params
{

// Function MiniGame.MiniGameHandler.FindPlayerDataByPlayerID
// 0x0028 (0x0028 - 0x0000)
struct MiniGameHandler_FindPlayerDataByPlayerID final
{
public:
	int64                                         InId;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMiniGamePlayerData                    ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MiniGameHandler_FindPlayerDataByPlayerID) == 0x000008, "Wrong alignment on MiniGameHandler_FindPlayerDataByPlayerID");
static_assert(sizeof(MiniGameHandler_FindPlayerDataByPlayerID) == 0x000028, "Wrong size on MiniGameHandler_FindPlayerDataByPlayerID");
static_assert(offsetof(MiniGameHandler_FindPlayerDataByPlayerID, InId) == 0x000000, "Member 'MiniGameHandler_FindPlayerDataByPlayerID::InId' has a wrong offset!");
static_assert(offsetof(MiniGameHandler_FindPlayerDataByPlayerID, ReturnValue) == 0x000008, "Member 'MiniGameHandler_FindPlayerDataByPlayerID::ReturnValue' has a wrong offset!");

// Function MiniGame.MiniGameHandler.GetTaskAttribute
// 0x0020 (0x0020 - 0x0000)
struct MiniGameHandler_GetTaskAttribute final
{
public:
	class FString                                 NetUniqueId;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TaskGroup;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TaskId;                                            // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MiniGameHandler_GetTaskAttribute) == 0x000008, "Wrong alignment on MiniGameHandler_GetTaskAttribute");
static_assert(sizeof(MiniGameHandler_GetTaskAttribute) == 0x000020, "Wrong size on MiniGameHandler_GetTaskAttribute");
static_assert(offsetof(MiniGameHandler_GetTaskAttribute, NetUniqueId) == 0x000000, "Member 'MiniGameHandler_GetTaskAttribute::NetUniqueId' has a wrong offset!");
static_assert(offsetof(MiniGameHandler_GetTaskAttribute, TaskGroup) == 0x000010, "Member 'MiniGameHandler_GetTaskAttribute::TaskGroup' has a wrong offset!");
static_assert(offsetof(MiniGameHandler_GetTaskAttribute, TaskId) == 0x000014, "Member 'MiniGameHandler_GetTaskAttribute::TaskId' has a wrong offset!");
static_assert(offsetof(MiniGameHandler_GetTaskAttribute, ReturnValue) == 0x000018, "Member 'MiniGameHandler_GetTaskAttribute::ReturnValue' has a wrong offset!");

// Function MiniGame.MiniGameHandler.HandleCharacterHasEnded
// 0x0008 (0x0008 - 0x0000)
struct MiniGameHandler_HandleCharacterHasEnded final
{
public:
	class AMiniGamePlayerController*              InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MiniGameHandler_HandleCharacterHasEnded) == 0x000008, "Wrong alignment on MiniGameHandler_HandleCharacterHasEnded");
static_assert(sizeof(MiniGameHandler_HandleCharacterHasEnded) == 0x000008, "Wrong size on MiniGameHandler_HandleCharacterHasEnded");
static_assert(offsetof(MiniGameHandler_HandleCharacterHasEnded, InController) == 0x000000, "Member 'MiniGameHandler_HandleCharacterHasEnded::InController' has a wrong offset!");

// Function MiniGame.MiniGameHandler.NotifyExitRoom
// 0x0010 (0x0010 - 0x0000)
struct MiniGameHandler_NotifyExitRoom final
{
public:
	class FString                                 InReason;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MiniGameHandler_NotifyExitRoom) == 0x000008, "Wrong alignment on MiniGameHandler_NotifyExitRoom");
static_assert(sizeof(MiniGameHandler_NotifyExitRoom) == 0x000010, "Wrong size on MiniGameHandler_NotifyExitRoom");
static_assert(offsetof(MiniGameHandler_NotifyExitRoom, InReason) == 0x000000, "Member 'MiniGameHandler_NotifyExitRoom::InReason' has a wrong offset!");

// Function MiniGame.MiniGameHandler.SetForceCloseRoom
// 0x0010 (0x0010 - 0x0000)
struct MiniGameHandler_SetForceCloseRoom final
{
public:
	class FString                                 InReason;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MiniGameHandler_SetForceCloseRoom) == 0x000008, "Wrong alignment on MiniGameHandler_SetForceCloseRoom");
static_assert(sizeof(MiniGameHandler_SetForceCloseRoom) == 0x000010, "Wrong size on MiniGameHandler_SetForceCloseRoom");
static_assert(offsetof(MiniGameHandler_SetForceCloseRoom, InReason) == 0x000000, "Member 'MiniGameHandler_SetForceCloseRoom::InReason' has a wrong offset!");

// Function MiniGame.MiniGamePlayerController.IsMiniGamePlayerController
// 0x0010 (0x0010 - 0x0000)
struct MiniGamePlayerController_IsMiniGamePlayerController final
{
public:
	class UWorld*                                 InWorld;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MiniGamePlayerController_IsMiniGamePlayerController) == 0x000008, "Wrong alignment on MiniGamePlayerController_IsMiniGamePlayerController");
static_assert(sizeof(MiniGamePlayerController_IsMiniGamePlayerController) == 0x000010, "Wrong size on MiniGamePlayerController_IsMiniGamePlayerController");
static_assert(offsetof(MiniGamePlayerController_IsMiniGamePlayerController, InWorld) == 0x000000, "Member 'MiniGamePlayerController_IsMiniGamePlayerController::InWorld' has a wrong offset!");
static_assert(offsetof(MiniGamePlayerController_IsMiniGamePlayerController, ReturnValue) == 0x000008, "Member 'MiniGamePlayerController_IsMiniGamePlayerController::ReturnValue' has a wrong offset!");

// Function MiniGame.MiniGamePlayerController.ClientShowDSDebugInfo
// 0x0030 (0x0030 - 0x0000)
struct MiniGamePlayerController_ClientShowDSDebugInfo final
{
public:
	struct FMiniGameDSDebugInfo                   DSDebugInfo;                                       // 0x0000(0x0030)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MiniGamePlayerController_ClientShowDSDebugInfo) == 0x000008, "Wrong alignment on MiniGamePlayerController_ClientShowDSDebugInfo");
static_assert(sizeof(MiniGamePlayerController_ClientShowDSDebugInfo) == 0x000030, "Wrong size on MiniGamePlayerController_ClientShowDSDebugInfo");
static_assert(offsetof(MiniGamePlayerController_ClientShowDSDebugInfo, DSDebugInfo) == 0x000000, "Member 'MiniGamePlayerController_ClientShowDSDebugInfo::DSDebugInfo' has a wrong offset!");

}

