#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MiniGame

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct MiniGame.MiniGamePlayerData
// 0x0020 (0x0020 - 0x0000)
struct FMiniGamePlayerData final
{
public:
	class FString                                 UniqueNetId;                                       // 0x0000(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  Character;                                         // 0x0010(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsGiveup;                                          // 0x0018(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsOffline;                                         // 0x0019(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OfflineTime;                                       // 0x001C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMiniGamePlayerData) == 0x000008, "Wrong alignment on FMiniGamePlayerData");
static_assert(sizeof(FMiniGamePlayerData) == 0x000020, "Wrong size on FMiniGamePlayerData");
static_assert(offsetof(FMiniGamePlayerData, UniqueNetId) == 0x000000, "Member 'FMiniGamePlayerData::UniqueNetId' has a wrong offset!");
static_assert(offsetof(FMiniGamePlayerData, Character) == 0x000010, "Member 'FMiniGamePlayerData::Character' has a wrong offset!");
static_assert(offsetof(FMiniGamePlayerData, IsGiveup) == 0x000018, "Member 'FMiniGamePlayerData::IsGiveup' has a wrong offset!");
static_assert(offsetof(FMiniGamePlayerData, IsOffline) == 0x000019, "Member 'FMiniGamePlayerData::IsOffline' has a wrong offset!");
static_assert(offsetof(FMiniGamePlayerData, OfflineTime) == 0x00001C, "Member 'FMiniGamePlayerData::OfflineTime' has a wrong offset!");

// ScriptStruct MiniGame.MiniGameDSDebugInfo
// 0x0030 (0x0030 - 0x0000)
struct FMiniGameDSDebugInfo final
{
public:
	class FString                                 AddressURL;                                        // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        PID;                                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LogName;                                           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        LevelID;                                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMiniGameDSDebugInfo) == 0x000008, "Wrong alignment on FMiniGameDSDebugInfo");
static_assert(sizeof(FMiniGameDSDebugInfo) == 0x000030, "Wrong size on FMiniGameDSDebugInfo");
static_assert(offsetof(FMiniGameDSDebugInfo, AddressURL) == 0x000000, "Member 'FMiniGameDSDebugInfo::AddressURL' has a wrong offset!");
static_assert(offsetof(FMiniGameDSDebugInfo, PID) == 0x000010, "Member 'FMiniGameDSDebugInfo::PID' has a wrong offset!");
static_assert(offsetof(FMiniGameDSDebugInfo, LogName) == 0x000018, "Member 'FMiniGameDSDebugInfo::LogName' has a wrong offset!");
static_assert(offsetof(FMiniGameDSDebugInfo, LevelID) == 0x000028, "Member 'FMiniGameDSDebugInfo::LevelID' has a wrong offset!");

}

