#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModifierLineEndEffectActorBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ModifierLineEndEffectActorBase.ModifierLineEndEffectActorBase_C
// 0x0030 (0x0258 - 0x0228)
class AModifierLineEndEffectActorBase_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_5678461047A7ACC974CD2DAA40F1279E; // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_5678461047A7ACC974CD2DAA40F1279E; // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              DissolveComponents;                                // 0x0248(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void AddDissolveComponent(class UNiagaraComponent* Component);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Start(class AModifierLineEffectActorBase_C* ModifierLineActor);
	void ExecuteUbergraph_ModifierLineEndEffectActorBase(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ModifierLineEndEffectActorBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ModifierLineEndEffectActorBase_C")
	}
	static class AModifierLineEndEffectActorBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AModifierLineEndEffectActorBase_C>();
	}
};
DUMPER7_ASSERTS_AModifierLineEndEffectActorBase_C;

}

