#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MotionTrajectory

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum MotionTrajectory.ETrajectorySampleDomain
// NumValues: 0x0004
enum class ETrajectorySampleDomain : uint8
{
	None                                     = 0,
	Time                                     = 1,
	Distance                                 = 2,
	ETrajectorySampleDomain_MAX              = 3,
};

// ScriptStruct MotionTrajectory.MotionTrajectorySettings
// 0x000C (0x000C - 0x0000)
struct FMotionTrajectorySettings final
{
public:
	int32                                         Domain;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Seconds;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMotionTrajectorySettings) == 0x000004, "Wrong alignment on FMotionTrajectorySettings");
static_assert(sizeof(FMotionTrajectorySettings) == 0x00000C, "Wrong size on FMotionTrajectorySettings");
static_assert(offsetof(FMotionTrajectorySettings, Domain) == 0x000000, "Member 'FMotionTrajectorySettings::Domain' has a wrong offset!");
static_assert(offsetof(FMotionTrajectorySettings, Seconds) == 0x000004, "Member 'FMotionTrajectorySettings::Seconds' has a wrong offset!");
static_assert(offsetof(FMotionTrajectorySettings, Distance) == 0x000008, "Member 'FMotionTrajectorySettings::Distance' has a wrong offset!");

// ScriptStruct MotionTrajectory.TrajectoryDirectionClamp
// 0x0010 (0x0010 - 0x0000)
struct FTrajectoryDirectionClamp final
{
public:
	struct FVector                                Direction;                                         // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleTresholdDegrees;                              // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTrajectoryDirectionClamp) == 0x000004, "Wrong alignment on FTrajectoryDirectionClamp");
static_assert(sizeof(FTrajectoryDirectionClamp) == 0x000010, "Wrong size on FTrajectoryDirectionClamp");
static_assert(offsetof(FTrajectoryDirectionClamp, Direction) == 0x000000, "Member 'FTrajectoryDirectionClamp::Direction' has a wrong offset!");
static_assert(offsetof(FTrajectoryDirectionClamp, AngleTresholdDegrees) == 0x00000C, "Member 'FTrajectoryDirectionClamp::AngleTresholdDegrees' has a wrong offset!");

// ScriptStruct MotionTrajectory.BunkerCollisionPoint
// 0x001C (0x001C - 0x0000)
struct FBunkerCollisionPoint final
{
public:
	struct FVector                                BunkerEnterPos;                                    // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitNormalDirection;                                // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValid;                                            // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLeft;                                           // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsHalfBunker;                                     // 0x001A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FBunkerCollisionPoint) == 0x000004, "Wrong alignment on FBunkerCollisionPoint");
static_assert(sizeof(FBunkerCollisionPoint) == 0x00001C, "Wrong size on FBunkerCollisionPoint");
static_assert(offsetof(FBunkerCollisionPoint, BunkerEnterPos) == 0x000000, "Member 'FBunkerCollisionPoint::BunkerEnterPos' has a wrong offset!");
static_assert(offsetof(FBunkerCollisionPoint, HitNormalDirection) == 0x00000C, "Member 'FBunkerCollisionPoint::HitNormalDirection' has a wrong offset!");
static_assert(offsetof(FBunkerCollisionPoint, bValid) == 0x000018, "Member 'FBunkerCollisionPoint::bValid' has a wrong offset!");
static_assert(offsetof(FBunkerCollisionPoint, bIsLeft) == 0x000019, "Member 'FBunkerCollisionPoint::bIsLeft' has a wrong offset!");
static_assert(offsetof(FBunkerCollisionPoint, bIsHalfBunker) == 0x00001A, "Member 'FBunkerCollisionPoint::bIsHalfBunker' has a wrong offset!");

// ScriptStruct MotionTrajectory.CrossCollisionPoint
// 0x001C (0x001C - 0x0000)
struct FCrossCollisionPoint final
{
public:
	struct FVector                                StartPos;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                EndPos;                                            // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValid;                                            // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLeft;                                           // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCrossCollisionPoint) == 0x000004, "Wrong alignment on FCrossCollisionPoint");
static_assert(sizeof(FCrossCollisionPoint) == 0x00001C, "Wrong size on FCrossCollisionPoint");
static_assert(offsetof(FCrossCollisionPoint, StartPos) == 0x000000, "Member 'FCrossCollisionPoint::StartPos' has a wrong offset!");
static_assert(offsetof(FCrossCollisionPoint, EndPos) == 0x00000C, "Member 'FCrossCollisionPoint::EndPos' has a wrong offset!");
static_assert(offsetof(FCrossCollisionPoint, bValid) == 0x000018, "Member 'FCrossCollisionPoint::bValid' has a wrong offset!");
static_assert(offsetof(FCrossCollisionPoint, bIsLeft) == 0x000019, "Member 'FCrossCollisionPoint::bIsLeft' has a wrong offset!");

// ScriptStruct MotionTrajectory.TrajectorySample
// 0x0050 (0x0050 - 0x0000)
struct FTrajectorySample final
{
public:
	float                                         AccumulatedSeconds;                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AccumulatedDistance;                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                LinearVelocity;                                    // 0x0040(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTrajectorySample) == 0x000010, "Wrong alignment on FTrajectorySample");
static_assert(sizeof(FTrajectorySample) == 0x000050, "Wrong size on FTrajectorySample");
static_assert(offsetof(FTrajectorySample, AccumulatedSeconds) == 0x000000, "Member 'FTrajectorySample::AccumulatedSeconds' has a wrong offset!");
static_assert(offsetof(FTrajectorySample, AccumulatedDistance) == 0x000004, "Member 'FTrajectorySample::AccumulatedDistance' has a wrong offset!");
static_assert(offsetof(FTrajectorySample, Transform) == 0x000010, "Member 'FTrajectorySample::Transform' has a wrong offset!");
static_assert(offsetof(FTrajectorySample, LinearVelocity) == 0x000040, "Member 'FTrajectorySample::LinearVelocity' has a wrong offset!");

// ScriptStruct MotionTrajectory.TrajectorySampleRange
// 0x0018 (0x0018 - 0x0000)
struct FTrajectorySampleRange final
{
public:
	TArray<struct FTrajectorySample>              Samples;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         SampleRate;                                        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTrajectorySampleRange) == 0x000008, "Wrong alignment on FTrajectorySampleRange");
static_assert(sizeof(FTrajectorySampleRange) == 0x000018, "Wrong size on FTrajectorySampleRange");
static_assert(offsetof(FTrajectorySampleRange, Samples) == 0x000000, "Member 'FTrajectorySampleRange::Samples' has a wrong offset!");
static_assert(offsetof(FTrajectorySampleRange, SampleRate) == 0x000010, "Member 'FTrajectorySampleRange::SampleRate' has a wrong offset!");

}

