#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MotionTrajectory

#include "Basic.hpp"

#include "MotionTrajectory_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MotionTrajectory.MotionTrajectoryComponent.SetSampleRate
// 0x0004 (0x0004 - 0x0000)
struct MotionTrajectoryComponent_SetSampleRate final
{
public:
	int32                                         Rate;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionTrajectoryComponent_SetSampleRate) == 0x000004, "Wrong alignment on MotionTrajectoryComponent_SetSampleRate");
static_assert(sizeof(MotionTrajectoryComponent_SetSampleRate) == 0x000004, "Wrong size on MotionTrajectoryComponent_SetSampleRate");
static_assert(offsetof(MotionTrajectoryComponent_SetSampleRate, Rate) == 0x000000, "Member 'MotionTrajectoryComponent_SetSampleRate::Rate' has a wrong offset!");

// Function MotionTrajectory.MotionTrajectoryComponent.GetHistory
// 0x0018 (0x0018 - 0x0000)
struct MotionTrajectoryComponent_GetHistory final
{
public:
	struct FTrajectorySampleRange                 ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionTrajectoryComponent_GetHistory) == 0x000008, "Wrong alignment on MotionTrajectoryComponent_GetHistory");
static_assert(sizeof(MotionTrajectoryComponent_GetHistory) == 0x000018, "Wrong size on MotionTrajectoryComponent_GetHistory");
static_assert(offsetof(MotionTrajectoryComponent_GetHistory, ReturnValue) == 0x000000, "Member 'MotionTrajectoryComponent_GetHistory::ReturnValue' has a wrong offset!");

// Function MotionTrajectory.MotionTrajectoryComponent.GetTrajectory
// 0x0018 (0x0018 - 0x0000)
struct MotionTrajectoryComponent_GetTrajectory final
{
public:
	struct FTrajectorySampleRange                 ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionTrajectoryComponent_GetTrajectory) == 0x000008, "Wrong alignment on MotionTrajectoryComponent_GetTrajectory");
static_assert(sizeof(MotionTrajectoryComponent_GetTrajectory) == 0x000018, "Wrong size on MotionTrajectoryComponent_GetTrajectory");
static_assert(offsetof(MotionTrajectoryComponent_GetTrajectory, ReturnValue) == 0x000000, "Member 'MotionTrajectoryComponent_GetTrajectory::ReturnValue' has a wrong offset!");

// Function MotionTrajectory.MotionTrajectoryComponent.GetTrajectoryWithSettings
// 0x0028 (0x0028 - 0x0000)
struct MotionTrajectoryComponent_GetTrajectoryWithSettings final
{
public:
	struct FMotionTrajectorySettings              Settings;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIncludeHistory;                                   // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTrajectorySampleRange                 ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionTrajectoryComponent_GetTrajectoryWithSettings) == 0x000008, "Wrong alignment on MotionTrajectoryComponent_GetTrajectoryWithSettings");
static_assert(sizeof(MotionTrajectoryComponent_GetTrajectoryWithSettings) == 0x000028, "Wrong size on MotionTrajectoryComponent_GetTrajectoryWithSettings");
static_assert(offsetof(MotionTrajectoryComponent_GetTrajectoryWithSettings, Settings) == 0x000000, "Member 'MotionTrajectoryComponent_GetTrajectoryWithSettings::Settings' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryComponent_GetTrajectoryWithSettings, bIncludeHistory) == 0x00000C, "Member 'MotionTrajectoryComponent_GetTrajectoryWithSettings::bIncludeHistory' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryComponent_GetTrajectoryWithSettings, ReturnValue) == 0x000010, "Member 'MotionTrajectoryComponent_GetTrajectoryWithSettings::ReturnValue' has a wrong offset!");

// Function MotionTrajectory.CharacterMovementTrajectoryComponent.OnMovementUpdated
// 0x001C (0x001C - 0x0000)
struct CharacterMovementTrajectoryComponent_OnMovementUpdated final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OldLocation;                                       // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OldVelocity;                                       // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterMovementTrajectoryComponent_OnMovementUpdated) == 0x000004, "Wrong alignment on CharacterMovementTrajectoryComponent_OnMovementUpdated");
static_assert(sizeof(CharacterMovementTrajectoryComponent_OnMovementUpdated) == 0x00001C, "Wrong size on CharacterMovementTrajectoryComponent_OnMovementUpdated");
static_assert(offsetof(CharacterMovementTrajectoryComponent_OnMovementUpdated, DeltaSeconds) == 0x000000, "Member 'CharacterMovementTrajectoryComponent_OnMovementUpdated::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(CharacterMovementTrajectoryComponent_OnMovementUpdated, OldLocation) == 0x000004, "Member 'CharacterMovementTrajectoryComponent_OnMovementUpdated::OldLocation' has a wrong offset!");
static_assert(offsetof(CharacterMovementTrajectoryComponent_OnMovementUpdated, OldVelocity) == 0x000010, "Member 'CharacterMovementTrajectoryComponent_OnMovementUpdated::OldVelocity' has a wrong offset!");

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.ClampTrajectoryDirection
// 0x0048 (0x0048 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_ClampTrajectoryDirection final
{
public:
	struct FTrajectorySampleRange                 Trajectory;                                        // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	TArray<struct FTrajectoryDirectionClamp>      Directions;                                        // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bPreserveRotation;                                 // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTrajectorySampleRange                 ReturnValue;                                       // 0x0030(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionTrajectoryBlueprintLibrary_ClampTrajectoryDirection) == 0x000008, "Wrong alignment on MotionTrajectoryBlueprintLibrary_ClampTrajectoryDirection");
static_assert(sizeof(MotionTrajectoryBlueprintLibrary_ClampTrajectoryDirection) == 0x000048, "Wrong size on MotionTrajectoryBlueprintLibrary_ClampTrajectoryDirection");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_ClampTrajectoryDirection, Trajectory) == 0x000000, "Member 'MotionTrajectoryBlueprintLibrary_ClampTrajectoryDirection::Trajectory' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_ClampTrajectoryDirection, Directions) == 0x000018, "Member 'MotionTrajectoryBlueprintLibrary_ClampTrajectoryDirection::Directions' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_ClampTrajectoryDirection, bPreserveRotation) == 0x000028, "Member 'MotionTrajectoryBlueprintLibrary_ClampTrajectoryDirection::bPreserveRotation' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_ClampTrajectoryDirection, ReturnValue) == 0x000030, "Member 'MotionTrajectoryBlueprintLibrary_ClampTrajectoryDirection::ReturnValue' has a wrong offset!");

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.DebugDrawTrajectory
// 0x0090 (0x0090 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             WorldTransform;                                    // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTrajectorySampleRange                 Trajectory;                                        // 0x0040(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FLinearColor                           PredictionColor;                                   // 0x0058(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           HistoryColor;                                      // 0x0068(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransformScale;                                    // 0x0078(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransformThickness;                                // 0x007C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ArrowScale;                                        // 0x0080(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ArrowSize;                                         // 0x0084(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ArrowThickness;                                    // 0x0088(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory) == 0x000010, "Wrong alignment on MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory");
static_assert(sizeof(MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory) == 0x000090, "Wrong size on MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory, Actor) == 0x000000, "Member 'MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory::Actor' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory, WorldTransform) == 0x000010, "Member 'MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory::WorldTransform' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory, Trajectory) == 0x000040, "Member 'MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory::Trajectory' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory, PredictionColor) == 0x000058, "Member 'MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory::PredictionColor' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory, HistoryColor) == 0x000068, "Member 'MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory::HistoryColor' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory, TransformScale) == 0x000078, "Member 'MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory::TransformScale' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory, TransformThickness) == 0x00007C, "Member 'MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory::TransformThickness' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory, ArrowScale) == 0x000080, "Member 'MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory::ArrowScale' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory, ArrowSize) == 0x000084, "Member 'MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory::ArrowSize' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory, ArrowThickness) == 0x000088, "Member 'MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory::ArrowThickness' has a wrong offset!");

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.FlattenTrajectory2D
// 0x0038 (0x0038 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_FlattenTrajectory2D final
{
public:
	struct FTrajectorySampleRange                 Trajectory;                                        // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	bool                                          PreserveSpeed;                                     // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTrajectorySampleRange                 ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionTrajectoryBlueprintLibrary_FlattenTrajectory2D) == 0x000008, "Wrong alignment on MotionTrajectoryBlueprintLibrary_FlattenTrajectory2D");
static_assert(sizeof(MotionTrajectoryBlueprintLibrary_FlattenTrajectory2D) == 0x000038, "Wrong size on MotionTrajectoryBlueprintLibrary_FlattenTrajectory2D");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_FlattenTrajectory2D, Trajectory) == 0x000000, "Member 'MotionTrajectoryBlueprintLibrary_FlattenTrajectory2D::Trajectory' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_FlattenTrajectory2D, PreserveSpeed) == 0x000018, "Member 'MotionTrajectoryBlueprintLibrary_FlattenTrajectory2D::PreserveSpeed' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_FlattenTrajectory2D, ReturnValue) == 0x000020, "Member 'MotionTrajectoryBlueprintLibrary_FlattenTrajectory2D::ReturnValue' has a wrong offset!");

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.GetBunkerCollisionPointWithActorFaceDir
// 0x0040 (0x0040 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_GetBunkerCollisionPointWithActorFaceDir final
{
public:
	const class APawn*                            Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceHeight;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceHeightOffset;                                 // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidLengthToStart;                                // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidEdgeWidth;                                    // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleLimit;                                        // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyLeft;                                         // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBunkerCollisionPoint                  ReturnValue;                                       // 0x0020(0x001C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MotionTrajectoryBlueprintLibrary_GetBunkerCollisionPointWithActorFaceDir) == 0x000008, "Wrong alignment on MotionTrajectoryBlueprintLibrary_GetBunkerCollisionPointWithActorFaceDir");
static_assert(sizeof(MotionTrajectoryBlueprintLibrary_GetBunkerCollisionPointWithActorFaceDir) == 0x000040, "Wrong size on MotionTrajectoryBlueprintLibrary_GetBunkerCollisionPointWithActorFaceDir");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerCollisionPointWithActorFaceDir, Actor) == 0x000000, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerCollisionPointWithActorFaceDir::Actor' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerCollisionPointWithActorFaceDir, TraceHeight) == 0x000008, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerCollisionPointWithActorFaceDir::TraceHeight' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerCollisionPointWithActorFaceDir, TraceHeightOffset) == 0x00000C, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerCollisionPointWithActorFaceDir::TraceHeightOffset' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerCollisionPointWithActorFaceDir, ValidLengthToStart) == 0x000010, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerCollisionPointWithActorFaceDir::ValidLengthToStart' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerCollisionPointWithActorFaceDir, ValidEdgeWidth) == 0x000014, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerCollisionPointWithActorFaceDir::ValidEdgeWidth' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerCollisionPointWithActorFaceDir, AngleLimit) == 0x000018, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerCollisionPointWithActorFaceDir::AngleLimit' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerCollisionPointWithActorFaceDir, bOnlyLeft) == 0x00001C, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerCollisionPointWithActorFaceDir::bOnlyLeft' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerCollisionPointWithActorFaceDir, ReturnValue) == 0x000020, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerCollisionPointWithActorFaceDir::ReturnValue' has a wrong offset!");

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.GetBunkerShootableWithActorAbove
// 0x0010 (0x0010 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorAbove final
{
public:
	const class APawn*                            Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidEdgeHeight;                                   // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorAbove) == 0x000008, "Wrong alignment on MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorAbove");
static_assert(sizeof(MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorAbove) == 0x000010, "Wrong size on MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorAbove");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorAbove, Actor) == 0x000000, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorAbove::Actor' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorAbove, ValidEdgeHeight) == 0x000008, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorAbove::ValidEdgeHeight' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorAbove, ReturnValue) == 0x00000C, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorAbove::ReturnValue' has a wrong offset!");

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.GetBunkerShootableWithActorForward
// 0x0030 (0x0030 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorForward final
{
public:
	const class APawn*                            Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                FaceDirection;                                     // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MoveDirection;                                     // 0x0014(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShootDirZ;                                         // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidEdgeWidth;                                    // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorForward) == 0x000008, "Wrong alignment on MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorForward");
static_assert(sizeof(MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorForward) == 0x000030, "Wrong size on MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorForward");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorForward, Actor) == 0x000000, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorForward::Actor' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorForward, FaceDirection) == 0x000008, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorForward::FaceDirection' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorForward, MoveDirection) == 0x000014, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorForward::MoveDirection' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorForward, ShootDirZ) == 0x000020, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorForward::ShootDirZ' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorForward, ValidEdgeWidth) == 0x000024, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorForward::ValidEdgeWidth' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorForward, ReturnValue) == 0x000028, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorForward::ReturnValue' has a wrong offset!");

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.GetBunkerTrajectoryCollisionPoint
// 0x0058 (0x0058 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint final
{
public:
	const class APawn*                            Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTrajectorySampleRange                 Trajectory;                                        // 0x0008(0x0018)(Parm, NativeAccessSpecifierPublic)
	float                                         TraceHeight;                                       // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceHeightOffset;                                 // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidLengthToStart;                                // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidMovePredictionLength;                         // 0x002C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidEdgeWidth;                                    // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleLimit;                                        // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyLeft;                                         // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBunkerCollisionPoint                  ReturnValue;                                       // 0x003C(0x001C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint) == 0x000008, "Wrong alignment on MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint");
static_assert(sizeof(MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint) == 0x000058, "Wrong size on MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint, Actor) == 0x000000, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint::Actor' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint, Trajectory) == 0x000008, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint::Trajectory' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint, TraceHeight) == 0x000020, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint::TraceHeight' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint, TraceHeightOffset) == 0x000024, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint::TraceHeightOffset' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint, ValidLengthToStart) == 0x000028, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint::ValidLengthToStart' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint, ValidMovePredictionLength) == 0x00002C, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint::ValidMovePredictionLength' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint, ValidEdgeWidth) == 0x000030, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint::ValidEdgeWidth' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint, AngleLimit) == 0x000034, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint::AngleLimit' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint, bOnlyLeft) == 0x000038, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint::bOnlyLeft' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint, ReturnValue) == 0x00003C, "Member 'MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint::ReturnValue' has a wrong offset!");

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.GetCrossCollisionPointWithActorFaceDir
// 0x0040 (0x0040 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_GetCrossCollisionPointWithActorFaceDir final
{
public:
	const class APawn*                            Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceLength;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceHeight;                                       // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidLengthToStart;                                // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidEdgeWidth;                                    // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleLimit;                                        // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyLeft;                                         // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCrossCollisionPoint                   ReturnValue;                                       // 0x0020(0x001C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MotionTrajectoryBlueprintLibrary_GetCrossCollisionPointWithActorFaceDir) == 0x000008, "Wrong alignment on MotionTrajectoryBlueprintLibrary_GetCrossCollisionPointWithActorFaceDir");
static_assert(sizeof(MotionTrajectoryBlueprintLibrary_GetCrossCollisionPointWithActorFaceDir) == 0x000040, "Wrong size on MotionTrajectoryBlueprintLibrary_GetCrossCollisionPointWithActorFaceDir");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetCrossCollisionPointWithActorFaceDir, Actor) == 0x000000, "Member 'MotionTrajectoryBlueprintLibrary_GetCrossCollisionPointWithActorFaceDir::Actor' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetCrossCollisionPointWithActorFaceDir, TraceLength) == 0x000008, "Member 'MotionTrajectoryBlueprintLibrary_GetCrossCollisionPointWithActorFaceDir::TraceLength' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetCrossCollisionPointWithActorFaceDir, TraceHeight) == 0x00000C, "Member 'MotionTrajectoryBlueprintLibrary_GetCrossCollisionPointWithActorFaceDir::TraceHeight' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetCrossCollisionPointWithActorFaceDir, ValidLengthToStart) == 0x000010, "Member 'MotionTrajectoryBlueprintLibrary_GetCrossCollisionPointWithActorFaceDir::ValidLengthToStart' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetCrossCollisionPointWithActorFaceDir, ValidEdgeWidth) == 0x000014, "Member 'MotionTrajectoryBlueprintLibrary_GetCrossCollisionPointWithActorFaceDir::ValidEdgeWidth' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetCrossCollisionPointWithActorFaceDir, AngleLimit) == 0x000018, "Member 'MotionTrajectoryBlueprintLibrary_GetCrossCollisionPointWithActorFaceDir::AngleLimit' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetCrossCollisionPointWithActorFaceDir, bOnlyLeft) == 0x00001C, "Member 'MotionTrajectoryBlueprintLibrary_GetCrossCollisionPointWithActorFaceDir::bOnlyLeft' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetCrossCollisionPointWithActorFaceDir, ReturnValue) == 0x000020, "Member 'MotionTrajectoryBlueprintLibrary_GetCrossCollisionPointWithActorFaceDir::ReturnValue' has a wrong offset!");

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.GetCrossTrajectoryCollisionPoint
// 0x0058 (0x0058 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint final
{
public:
	const class APawn*                            Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTrajectorySampleRange                 Trajectory;                                        // 0x0008(0x0018)(Parm, NativeAccessSpecifierPublic)
	float                                         TraceLength;                                       // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceHeight;                                       // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidLengthToStart;                                // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidMovePredictionLength;                         // 0x002C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidEdgeWidth;                                    // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleLimit;                                        // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyLeft;                                         // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCrossCollisionPoint                   ReturnValue;                                       // 0x003C(0x001C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint) == 0x000008, "Wrong alignment on MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint");
static_assert(sizeof(MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint) == 0x000058, "Wrong size on MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint, Actor) == 0x000000, "Member 'MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint::Actor' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint, Trajectory) == 0x000008, "Member 'MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint::Trajectory' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint, TraceLength) == 0x000020, "Member 'MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint::TraceLength' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint, TraceHeight) == 0x000024, "Member 'MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint::TraceHeight' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint, ValidLengthToStart) == 0x000028, "Member 'MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint::ValidLengthToStart' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint, ValidMovePredictionLength) == 0x00002C, "Member 'MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint::ValidMovePredictionLength' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint, ValidEdgeWidth) == 0x000030, "Member 'MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint::ValidEdgeWidth' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint, AngleLimit) == 0x000034, "Member 'MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint::AngleLimit' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint, bOnlyLeft) == 0x000038, "Member 'MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint::bOnlyLeft' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint, ReturnValue) == 0x00003C, "Member 'MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint::ReturnValue' has a wrong offset!");

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.IsConstantSpeedTrajectory
// 0x0028 (0x0028 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_IsConstantSpeedTrajectory final
{
public:
	struct FTrajectorySampleRange                 Trajectory;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Tolerance;                                         // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MotionTrajectoryBlueprintLibrary_IsConstantSpeedTrajectory) == 0x000008, "Wrong alignment on MotionTrajectoryBlueprintLibrary_IsConstantSpeedTrajectory");
static_assert(sizeof(MotionTrajectoryBlueprintLibrary_IsConstantSpeedTrajectory) == 0x000028, "Wrong size on MotionTrajectoryBlueprintLibrary_IsConstantSpeedTrajectory");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_IsConstantSpeedTrajectory, Trajectory) == 0x000000, "Member 'MotionTrajectoryBlueprintLibrary_IsConstantSpeedTrajectory::Trajectory' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_IsConstantSpeedTrajectory, Speed) == 0x000018, "Member 'MotionTrajectoryBlueprintLibrary_IsConstantSpeedTrajectory::Speed' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_IsConstantSpeedTrajectory, Tolerance) == 0x00001C, "Member 'MotionTrajectoryBlueprintLibrary_IsConstantSpeedTrajectory::Tolerance' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_IsConstantSpeedTrajectory, ReturnValue) == 0x000020, "Member 'MotionTrajectoryBlueprintLibrary_IsConstantSpeedTrajectory::ReturnValue' has a wrong offset!");

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.IsStartingTrajectory
// 0x0028 (0x0028 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_IsStartingTrajectory final
{
public:
	struct FTrajectorySampleRange                 Trajectory;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         MoveMinSpeed;                                      // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IdleMaxSpeed;                                      // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MotionTrajectoryBlueprintLibrary_IsStartingTrajectory) == 0x000008, "Wrong alignment on MotionTrajectoryBlueprintLibrary_IsStartingTrajectory");
static_assert(sizeof(MotionTrajectoryBlueprintLibrary_IsStartingTrajectory) == 0x000028, "Wrong size on MotionTrajectoryBlueprintLibrary_IsStartingTrajectory");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_IsStartingTrajectory, Trajectory) == 0x000000, "Member 'MotionTrajectoryBlueprintLibrary_IsStartingTrajectory::Trajectory' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_IsStartingTrajectory, MoveMinSpeed) == 0x000018, "Member 'MotionTrajectoryBlueprintLibrary_IsStartingTrajectory::MoveMinSpeed' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_IsStartingTrajectory, IdleMaxSpeed) == 0x00001C, "Member 'MotionTrajectoryBlueprintLibrary_IsStartingTrajectory::IdleMaxSpeed' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_IsStartingTrajectory, ReturnValue) == 0x000020, "Member 'MotionTrajectoryBlueprintLibrary_IsStartingTrajectory::ReturnValue' has a wrong offset!");

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.IsStoppingTrajectory
// 0x0028 (0x0028 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_IsStoppingTrajectory final
{
public:
	struct FTrajectorySampleRange                 Trajectory;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         MoveMinSpeed;                                      // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IdleMaxSpeed;                                      // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MotionTrajectoryBlueprintLibrary_IsStoppingTrajectory) == 0x000008, "Wrong alignment on MotionTrajectoryBlueprintLibrary_IsStoppingTrajectory");
static_assert(sizeof(MotionTrajectoryBlueprintLibrary_IsStoppingTrajectory) == 0x000028, "Wrong size on MotionTrajectoryBlueprintLibrary_IsStoppingTrajectory");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_IsStoppingTrajectory, Trajectory) == 0x000000, "Member 'MotionTrajectoryBlueprintLibrary_IsStoppingTrajectory::Trajectory' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_IsStoppingTrajectory, MoveMinSpeed) == 0x000018, "Member 'MotionTrajectoryBlueprintLibrary_IsStoppingTrajectory::MoveMinSpeed' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_IsStoppingTrajectory, IdleMaxSpeed) == 0x00001C, "Member 'MotionTrajectoryBlueprintLibrary_IsStoppingTrajectory::IdleMaxSpeed' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_IsStoppingTrajectory, ReturnValue) == 0x000020, "Member 'MotionTrajectoryBlueprintLibrary_IsStoppingTrajectory::ReturnValue' has a wrong offset!");

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.MakeTrajectoryRelativeToComponent
// 0x0038 (0x0038 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_MakeTrajectoryRelativeToComponent final
{
public:
	struct FTrajectorySampleRange                 ActorTrajectory;                                   // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	const class USceneComponent*                  Component;                                         // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTrajectorySampleRange                 ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionTrajectoryBlueprintLibrary_MakeTrajectoryRelativeToComponent) == 0x000008, "Wrong alignment on MotionTrajectoryBlueprintLibrary_MakeTrajectoryRelativeToComponent");
static_assert(sizeof(MotionTrajectoryBlueprintLibrary_MakeTrajectoryRelativeToComponent) == 0x000038, "Wrong size on MotionTrajectoryBlueprintLibrary_MakeTrajectoryRelativeToComponent");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_MakeTrajectoryRelativeToComponent, ActorTrajectory) == 0x000000, "Member 'MotionTrajectoryBlueprintLibrary_MakeTrajectoryRelativeToComponent::ActorTrajectory' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_MakeTrajectoryRelativeToComponent, Component) == 0x000018, "Member 'MotionTrajectoryBlueprintLibrary_MakeTrajectoryRelativeToComponent::Component' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_MakeTrajectoryRelativeToComponent, ReturnValue) == 0x000020, "Member 'MotionTrajectoryBlueprintLibrary_MakeTrajectoryRelativeToComponent::ReturnValue' has a wrong offset!");

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.RotateTrajectory
// 0x0050 (0x0050 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_RotateTrajectory final
{
public:
	struct FTrajectorySampleRange                 Trajectory;                                        // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  Rotation;                                          // 0x0020(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTrajectorySampleRange                 ReturnValue;                                       // 0x0030(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MotionTrajectoryBlueprintLibrary_RotateTrajectory) == 0x000010, "Wrong alignment on MotionTrajectoryBlueprintLibrary_RotateTrajectory");
static_assert(sizeof(MotionTrajectoryBlueprintLibrary_RotateTrajectory) == 0x000050, "Wrong size on MotionTrajectoryBlueprintLibrary_RotateTrajectory");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_RotateTrajectory, Trajectory) == 0x000000, "Member 'MotionTrajectoryBlueprintLibrary_RotateTrajectory::Trajectory' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_RotateTrajectory, Rotation) == 0x000020, "Member 'MotionTrajectoryBlueprintLibrary_RotateTrajectory::Rotation' has a wrong offset!");
static_assert(offsetof(MotionTrajectoryBlueprintLibrary_RotateTrajectory, ReturnValue) == 0x000030, "Member 'MotionTrajectoryBlueprintLibrary_RotateTrajectory::ReturnValue' has a wrong offset!");

}

