#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NetworkLerpMovement

#include "Basic.hpp"

#include "NetworkLerpMovement_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class NetworkLerpMovement.NetworkLerpComponent
// 0x0160 (0x0210 - 0x00B0)
class UNetworkLerpComponent final : public UActorComponent
{
public:
	struct FNetworkLerpServerUpdate               NetworkLerpServerUpdate;                           // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkLerpFromTo                     NetworkLerpFromTo;                                 // 0x00C0(0x0070)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FTimerHandle                           ReplicateServerTimeHandle;                         // 0x0130(0x0008)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            FloatCurve;                                        // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ClientLerpTimeErrorTolerance;                      // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ServerReplicateRateInSeconds;                      // 0x0144(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ServerLerpThreshold;                               // 0x0148(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ClientMaxTimeBetweenUpdatesInSeconds;              // 0x014C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ClientCorrectionLerpAlpha;                         // 0x0150(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_154[0xC];                                      // 0x0154(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkLerpFromTo                     ServerCachedNetworkLerpFromTo;                     // 0x0160(0x0070)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         ServerCachedPredictedLerpTime;                     // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDebug;                                            // 0x01D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkLerpClientPrediction           ClientPredictionValues;                            // 0x01D8(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             OnLerpComplete;                                    // 0x01E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnLerpReverse;                                     // 0x01F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_200[0x10];                                     // 0x0200(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ForceStart();
	void ForceStop(bool bReset);
	const struct FTransform GetPredictedTransform(float TimeInSeconds);
	void LerpBetween(const struct FTransform& InStartTransform, const struct FTransform& InTargetTransform, float InLerpDuration, bool bInLoop);
	void LerpBetweenInternal(const struct FTransform& InStartTransform, const struct FTransform& InTargetTransform, float InLerpDuration, float InStartAtLerpTime, bool bInLoop);
	void OnRep_NetworkLerpFromTo();
	void OnRep_ServerLerpTime();
	void PerformLerp(float DeltaTime);
	void ReplicateServerTime();
	void ReplicateServerTimeInternal(bool bForce);
	void Teleport(const struct FTransform& InTransform);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetworkLerpComponent">();
	}
	static class UNetworkLerpComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetworkLerpComponent>();
	}
};
static_assert(alignof(UNetworkLerpComponent) == 0x000010, "Wrong alignment on UNetworkLerpComponent");
static_assert(sizeof(UNetworkLerpComponent) == 0x000210, "Wrong size on UNetworkLerpComponent");
static_assert(offsetof(UNetworkLerpComponent, NetworkLerpServerUpdate) == 0x0000B0, "Member 'UNetworkLerpComponent::NetworkLerpServerUpdate' has a wrong offset!");
static_assert(offsetof(UNetworkLerpComponent, NetworkLerpFromTo) == 0x0000C0, "Member 'UNetworkLerpComponent::NetworkLerpFromTo' has a wrong offset!");
static_assert(offsetof(UNetworkLerpComponent, ReplicateServerTimeHandle) == 0x000130, "Member 'UNetworkLerpComponent::ReplicateServerTimeHandle' has a wrong offset!");
static_assert(offsetof(UNetworkLerpComponent, FloatCurve) == 0x000138, "Member 'UNetworkLerpComponent::FloatCurve' has a wrong offset!");
static_assert(offsetof(UNetworkLerpComponent, ClientLerpTimeErrorTolerance) == 0x000140, "Member 'UNetworkLerpComponent::ClientLerpTimeErrorTolerance' has a wrong offset!");
static_assert(offsetof(UNetworkLerpComponent, ServerReplicateRateInSeconds) == 0x000144, "Member 'UNetworkLerpComponent::ServerReplicateRateInSeconds' has a wrong offset!");
static_assert(offsetof(UNetworkLerpComponent, ServerLerpThreshold) == 0x000148, "Member 'UNetworkLerpComponent::ServerLerpThreshold' has a wrong offset!");
static_assert(offsetof(UNetworkLerpComponent, ClientMaxTimeBetweenUpdatesInSeconds) == 0x00014C, "Member 'UNetworkLerpComponent::ClientMaxTimeBetweenUpdatesInSeconds' has a wrong offset!");
static_assert(offsetof(UNetworkLerpComponent, ClientCorrectionLerpAlpha) == 0x000150, "Member 'UNetworkLerpComponent::ClientCorrectionLerpAlpha' has a wrong offset!");
static_assert(offsetof(UNetworkLerpComponent, ServerCachedNetworkLerpFromTo) == 0x000160, "Member 'UNetworkLerpComponent::ServerCachedNetworkLerpFromTo' has a wrong offset!");
static_assert(offsetof(UNetworkLerpComponent, ServerCachedPredictedLerpTime) == 0x0001D0, "Member 'UNetworkLerpComponent::ServerCachedPredictedLerpTime' has a wrong offset!");
static_assert(offsetof(UNetworkLerpComponent, bDebug) == 0x0001D4, "Member 'UNetworkLerpComponent::bDebug' has a wrong offset!");
static_assert(offsetof(UNetworkLerpComponent, ClientPredictionValues) == 0x0001D8, "Member 'UNetworkLerpComponent::ClientPredictionValues' has a wrong offset!");
static_assert(offsetof(UNetworkLerpComponent, OnLerpComplete) == 0x0001E0, "Member 'UNetworkLerpComponent::OnLerpComplete' has a wrong offset!");
static_assert(offsetof(UNetworkLerpComponent, OnLerpReverse) == 0x0001F0, "Member 'UNetworkLerpComponent::OnLerpReverse' has a wrong offset!");

}

