#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NetworkLerpMovement

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function NetworkLerpMovement.NetworkLerpComponent.ForceStop
// 0x0001 (0x0001 - 0x0000)
struct NetworkLerpComponent_ForceStop final
{
public:
	bool                                          bReset;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NetworkLerpComponent_ForceStop) == 0x000001, "Wrong alignment on NetworkLerpComponent_ForceStop");
static_assert(sizeof(NetworkLerpComponent_ForceStop) == 0x000001, "Wrong size on NetworkLerpComponent_ForceStop");
static_assert(offsetof(NetworkLerpComponent_ForceStop, bReset) == 0x000000, "Member 'NetworkLerpComponent_ForceStop::bReset' has a wrong offset!");

// Function NetworkLerpMovement.NetworkLerpComponent.GetPredictedTransform
// 0x0040 (0x0040 - 0x0000)
struct NetworkLerpComponent_GetPredictedTransform final
{
public:
	float                                         TimeInSeconds;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(NetworkLerpComponent_GetPredictedTransform) == 0x000010, "Wrong alignment on NetworkLerpComponent_GetPredictedTransform");
static_assert(sizeof(NetworkLerpComponent_GetPredictedTransform) == 0x000040, "Wrong size on NetworkLerpComponent_GetPredictedTransform");
static_assert(offsetof(NetworkLerpComponent_GetPredictedTransform, TimeInSeconds) == 0x000000, "Member 'NetworkLerpComponent_GetPredictedTransform::TimeInSeconds' has a wrong offset!");
static_assert(offsetof(NetworkLerpComponent_GetPredictedTransform, ReturnValue) == 0x000010, "Member 'NetworkLerpComponent_GetPredictedTransform::ReturnValue' has a wrong offset!");

// Function NetworkLerpMovement.NetworkLerpComponent.LerpBetween
// 0x0070 (0x0070 - 0x0000)
struct NetworkLerpComponent_LerpBetween final
{
public:
	struct FTransform                             InStartTransform;                                  // 0x0000(0x0030)(ConstParm, Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             InTargetTransform;                                 // 0x0030(0x0030)(ConstParm, Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         InLerpDuration;                                    // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInLoop;                                           // 0x0064(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0xB];                                       // 0x0065(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NetworkLerpComponent_LerpBetween) == 0x000010, "Wrong alignment on NetworkLerpComponent_LerpBetween");
static_assert(sizeof(NetworkLerpComponent_LerpBetween) == 0x000070, "Wrong size on NetworkLerpComponent_LerpBetween");
static_assert(offsetof(NetworkLerpComponent_LerpBetween, InStartTransform) == 0x000000, "Member 'NetworkLerpComponent_LerpBetween::InStartTransform' has a wrong offset!");
static_assert(offsetof(NetworkLerpComponent_LerpBetween, InTargetTransform) == 0x000030, "Member 'NetworkLerpComponent_LerpBetween::InTargetTransform' has a wrong offset!");
static_assert(offsetof(NetworkLerpComponent_LerpBetween, InLerpDuration) == 0x000060, "Member 'NetworkLerpComponent_LerpBetween::InLerpDuration' has a wrong offset!");
static_assert(offsetof(NetworkLerpComponent_LerpBetween, bInLoop) == 0x000064, "Member 'NetworkLerpComponent_LerpBetween::bInLoop' has a wrong offset!");

// Function NetworkLerpMovement.NetworkLerpComponent.LerpBetweenInternal
// 0x0070 (0x0070 - 0x0000)
struct NetworkLerpComponent_LerpBetweenInternal final
{
public:
	struct FTransform                             InStartTransform;                                  // 0x0000(0x0030)(ConstParm, Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             InTargetTransform;                                 // 0x0030(0x0030)(ConstParm, Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         InLerpDuration;                                    // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InStartAtLerpTime;                                 // 0x0064(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInLoop;                                           // 0x0068(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NetworkLerpComponent_LerpBetweenInternal) == 0x000010, "Wrong alignment on NetworkLerpComponent_LerpBetweenInternal");
static_assert(sizeof(NetworkLerpComponent_LerpBetweenInternal) == 0x000070, "Wrong size on NetworkLerpComponent_LerpBetweenInternal");
static_assert(offsetof(NetworkLerpComponent_LerpBetweenInternal, InStartTransform) == 0x000000, "Member 'NetworkLerpComponent_LerpBetweenInternal::InStartTransform' has a wrong offset!");
static_assert(offsetof(NetworkLerpComponent_LerpBetweenInternal, InTargetTransform) == 0x000030, "Member 'NetworkLerpComponent_LerpBetweenInternal::InTargetTransform' has a wrong offset!");
static_assert(offsetof(NetworkLerpComponent_LerpBetweenInternal, InLerpDuration) == 0x000060, "Member 'NetworkLerpComponent_LerpBetweenInternal::InLerpDuration' has a wrong offset!");
static_assert(offsetof(NetworkLerpComponent_LerpBetweenInternal, InStartAtLerpTime) == 0x000064, "Member 'NetworkLerpComponent_LerpBetweenInternal::InStartAtLerpTime' has a wrong offset!");
static_assert(offsetof(NetworkLerpComponent_LerpBetweenInternal, bInLoop) == 0x000068, "Member 'NetworkLerpComponent_LerpBetweenInternal::bInLoop' has a wrong offset!");

// Function NetworkLerpMovement.NetworkLerpComponent.PerformLerp
// 0x0004 (0x0004 - 0x0000)
struct NetworkLerpComponent_PerformLerp final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NetworkLerpComponent_PerformLerp) == 0x000004, "Wrong alignment on NetworkLerpComponent_PerformLerp");
static_assert(sizeof(NetworkLerpComponent_PerformLerp) == 0x000004, "Wrong size on NetworkLerpComponent_PerformLerp");
static_assert(offsetof(NetworkLerpComponent_PerformLerp, DeltaTime) == 0x000000, "Member 'NetworkLerpComponent_PerformLerp::DeltaTime' has a wrong offset!");

// Function NetworkLerpMovement.NetworkLerpComponent.ReplicateServerTimeInternal
// 0x0001 (0x0001 - 0x0000)
struct NetworkLerpComponent_ReplicateServerTimeInternal final
{
public:
	bool                                          bForce;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NetworkLerpComponent_ReplicateServerTimeInternal) == 0x000001, "Wrong alignment on NetworkLerpComponent_ReplicateServerTimeInternal");
static_assert(sizeof(NetworkLerpComponent_ReplicateServerTimeInternal) == 0x000001, "Wrong size on NetworkLerpComponent_ReplicateServerTimeInternal");
static_assert(offsetof(NetworkLerpComponent_ReplicateServerTimeInternal, bForce) == 0x000000, "Member 'NetworkLerpComponent_ReplicateServerTimeInternal::bForce' has a wrong offset!");

// Function NetworkLerpMovement.NetworkLerpComponent.Teleport
// 0x0030 (0x0030 - 0x0000)
struct NetworkLerpComponent_Teleport final
{
public:
	struct FTransform                             InTransform;                                       // 0x0000(0x0030)(ConstParm, Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(NetworkLerpComponent_Teleport) == 0x000010, "Wrong alignment on NetworkLerpComponent_Teleport");
static_assert(sizeof(NetworkLerpComponent_Teleport) == 0x000030, "Wrong size on NetworkLerpComponent_Teleport");
static_assert(offsetof(NetworkLerpComponent_Teleport, InTransform) == 0x000000, "Member 'NetworkLerpComponent_Teleport::InTransform' has a wrong offset!");

}

