#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NetworkSplineMovement

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum NetworkSplineMovement.ENetworkSplineState
// NumValues: 0x0004
enum class ENetworkSplineState : uint8
{
	Start                                    = 0,
	Stop                                     = 1,
	None                                     = 2,
	ENetworkSplineState_MAX                  = 3,
};

// Enum NetworkSplineMovement.ENetworkSplineRotationMode
// NumValues: 0x0005
enum class ENetworkSplineRotationMode : uint8
{
	Overwrite                                = 0,
	Additive                                 = 1,
	Combined                                 = 2,
	Ignore                                   = 3,
	ENetworkSplineRotationMode_MAX           = 4,
};

// ScriptStruct NetworkSplineMovement.NetworkSplineActorOffsetData
// 0x000C (0x000C - 0x0000)
struct FNetworkSplineActorOffsetData final
{
public:
	float                                         Offset;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  Actor;                                             // 0x0004(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNetworkSplineActorOffsetData) == 0x000004, "Wrong alignment on FNetworkSplineActorOffsetData");
static_assert(sizeof(FNetworkSplineActorOffsetData) == 0x00000C, "Wrong size on FNetworkSplineActorOffsetData");
static_assert(offsetof(FNetworkSplineActorOffsetData, Offset) == 0x000000, "Member 'FNetworkSplineActorOffsetData::Offset' has a wrong offset!");
static_assert(offsetof(FNetworkSplineActorOffsetData, Actor) == 0x000004, "Member 'FNetworkSplineActorOffsetData::Actor' has a wrong offset!");

// ScriptStruct NetworkSplineMovement.NetworkSplineInitialData
// 0x0040 (0x0040 - 0x0000)
struct FNetworkSplineInitialData final
{
public:
	float                                         AtValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMovingForward;                                  // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoopReverse;                                      // 0x0006(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Speed;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENetworkSplineState                           State;                                             // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             OriginTransform;                                   // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNetworkSplineInitialData) == 0x000010, "Wrong alignment on FNetworkSplineInitialData");
static_assert(sizeof(FNetworkSplineInitialData) == 0x000040, "Wrong size on FNetworkSplineInitialData");
static_assert(offsetof(FNetworkSplineInitialData, AtValue) == 0x000000, "Member 'FNetworkSplineInitialData::AtValue' has a wrong offset!");
static_assert(offsetof(FNetworkSplineInitialData, bIsMovingForward) == 0x000004, "Member 'FNetworkSplineInitialData::bIsMovingForward' has a wrong offset!");
static_assert(offsetof(FNetworkSplineInitialData, bLoop) == 0x000005, "Member 'FNetworkSplineInitialData::bLoop' has a wrong offset!");
static_assert(offsetof(FNetworkSplineInitialData, bLoopReverse) == 0x000006, "Member 'FNetworkSplineInitialData::bLoopReverse' has a wrong offset!");
static_assert(offsetof(FNetworkSplineInitialData, Speed) == 0x000008, "Member 'FNetworkSplineInitialData::Speed' has a wrong offset!");
static_assert(offsetof(FNetworkSplineInitialData, State) == 0x00000C, "Member 'FNetworkSplineInitialData::State' has a wrong offset!");
static_assert(offsetof(FNetworkSplineInitialData, OriginTransform) == 0x000010, "Member 'FNetworkSplineInitialData::OriginTransform' has a wrong offset!");

// ScriptStruct NetworkSplineMovement.NetworkSplineCorrectionData
// 0x0010 (0x0010 - 0x0000)
struct FNetworkSplineCorrectionData final
{
public:
	float                                         AtValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMovingForward;                                  // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Speed;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Order;                                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         CycleCount;                                        // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNetworkSplineCorrectionData) == 0x000004, "Wrong alignment on FNetworkSplineCorrectionData");
static_assert(sizeof(FNetworkSplineCorrectionData) == 0x000010, "Wrong size on FNetworkSplineCorrectionData");
static_assert(offsetof(FNetworkSplineCorrectionData, AtValue) == 0x000000, "Member 'FNetworkSplineCorrectionData::AtValue' has a wrong offset!");
static_assert(offsetof(FNetworkSplineCorrectionData, bIsMovingForward) == 0x000004, "Member 'FNetworkSplineCorrectionData::bIsMovingForward' has a wrong offset!");
static_assert(offsetof(FNetworkSplineCorrectionData, Speed) == 0x000008, "Member 'FNetworkSplineCorrectionData::Speed' has a wrong offset!");
static_assert(offsetof(FNetworkSplineCorrectionData, Order) == 0x00000C, "Member 'FNetworkSplineCorrectionData::Order' has a wrong offset!");
static_assert(offsetof(FNetworkSplineCorrectionData, CycleCount) == 0x00000D, "Member 'FNetworkSplineCorrectionData::CycleCount' has a wrong offset!");

}

