#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NextXBulletEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NextXBulletEffect.NextXBulletEffect_C
// 0x0020 (0x0178 - 0x0158)
class UNextXBulletEffect_C final : public UWeaponBulletEffectBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0158(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         NextBulletCount;                                   // 0x0160(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpawnBulletCount;                                  // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOnlyNormal;                                       // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bOnlyAim;                                          // 0x0169(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bStateActive;                                      // 0x016A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPreFire;                                          // 0x016B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         BulletType;                                        // 0x016C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNeedPreheat;                                      // 0x0170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void SetModifierNextBullet();
	void K2_ReceiveInitialize(const TArray<struct FParamInfo>& Info, const class UGameAbilityComponent* LpInstigator);
	void K2_ReceiveDeActive(const class UGameAbilityComponent* Pawn);
	void ReceiveOnPreWeaponFire(EAttributeType BulletType_0);
	void ExecuteUbergraph_NextXBulletEffect(int32 EntryPoint);
	void CheckState(ECharacterActionState InState, bool bSet);
	void ReceiveOnWeaponFire(int32 ForceShootCount);
	void K2_ReceiveActive(const class UObject* Instigator);
	void OnPlayerActionFlay(class AGameCharacter* CurCharacter, ECharacterActionState InType, bool bSet);
	void ReceiveOnOverlaid();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NextXBulletEffect_C">();
	}
	static class UNextXBulletEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNextXBulletEffect_C>();
	}
};
static_assert(alignof(UNextXBulletEffect_C) == 0x000008, "Wrong alignment on UNextXBulletEffect_C");
static_assert(sizeof(UNextXBulletEffect_C) == 0x000178, "Wrong size on UNextXBulletEffect_C");
static_assert(offsetof(UNextXBulletEffect_C, UberGraphFrame) == 0x000158, "Member 'UNextXBulletEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNextXBulletEffect_C, NextBulletCount) == 0x000160, "Member 'UNextXBulletEffect_C::NextBulletCount' has a wrong offset!");
static_assert(offsetof(UNextXBulletEffect_C, SpawnBulletCount) == 0x000164, "Member 'UNextXBulletEffect_C::SpawnBulletCount' has a wrong offset!");
static_assert(offsetof(UNextXBulletEffect_C, bOnlyNormal) == 0x000168, "Member 'UNextXBulletEffect_C::bOnlyNormal' has a wrong offset!");
static_assert(offsetof(UNextXBulletEffect_C, bOnlyAim) == 0x000169, "Member 'UNextXBulletEffect_C::bOnlyAim' has a wrong offset!");
static_assert(offsetof(UNextXBulletEffect_C, bStateActive) == 0x00016A, "Member 'UNextXBulletEffect_C::bStateActive' has a wrong offset!");
static_assert(offsetof(UNextXBulletEffect_C, bPreFire) == 0x00016B, "Member 'UNextXBulletEffect_C::bPreFire' has a wrong offset!");
static_assert(offsetof(UNextXBulletEffect_C, BulletType) == 0x00016C, "Member 'UNextXBulletEffect_C::BulletType' has a wrong offset!");
static_assert(offsetof(UNextXBulletEffect_C, bNeedPreheat) == 0x000170, "Member 'UNextXBulletEffect_C::bNeedPreheat' has a wrong offset!");

}

