#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NextXBulletEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NextXBulletEffect.NextXBulletEffect_C
// 0x0020 (0x0178 - 0x0158)
class UNextXBulletEffect_C final : public UWeaponBulletEffectBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0158(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         NextBulletCount;                                   // 0x0160(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpawnBulletCount;                                  // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOnlyNormal;                                       // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bOnlyAim;                                          // 0x0169(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bStateActive;                                      // 0x016A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPreFire;                                          // 0x016B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         BulletType;                                        // 0x016C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNeedPreheat;                                      // 0x0170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EAttributeType                                InputBulletType;                                   // 0x0171(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetModifierNextBullet();
	void CheckState(ECharacterActionState InState, bool bSet);
	void K2_ReceiveInitialize(const TArray<struct FParamInfo>& Info, const class UGameAbilityComponent* lpInstigator);
	void K2_ReceiveDeActive(const class UGameAbilityComponent* Pawn);
	void ReceiveOnWeaponFire(int32 ForceShootCount);
	void K2_ReceiveActive(const class UObject* Instigator);
	void OnPlayerActionFlay(class AGameCharacter* CurCharacter, ECharacterActionState InType, bool bSet);
	void ReceiveOnPreWeaponFire(EAttributeType BulletType_0);
	void ReceiveOnOverlaid();
	void ExecuteUbergraph_NextXBulletEffect(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("NextXBulletEffect_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NextXBulletEffect_C")
	}
	static class UNextXBulletEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNextXBulletEffect_C>();
	}
};
DUMPER7_ASSERTS_UNextXBulletEffect_C;

}

