#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NextXBulletEffect

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function NextXBulletEffect.NextXBulletEffect_C.SetModifierNextBullet
// 0x0010 (0x0010 - 0x0000)
struct NextXBulletEffect_C_SetModifierNextBullet final
{
public:
	class UModifier*                              CallFunc_GetModifierOwner_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NextXBulletEffect_C_SetModifierNextBullet) == 0x000008, "Wrong alignment on NextXBulletEffect_C_SetModifierNextBullet");
static_assert(sizeof(NextXBulletEffect_C_SetModifierNextBullet) == 0x000010, "Wrong size on NextXBulletEffect_C_SetModifierNextBullet");
static_assert(offsetof(NextXBulletEffect_C_SetModifierNextBullet, CallFunc_GetModifierOwner_ReturnValue) == 0x000000, "Member 'NextXBulletEffect_C_SetModifierNextBullet::CallFunc_GetModifierOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_SetModifierNextBullet, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'NextXBulletEffect_C_SetModifierNextBullet::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_SetModifierNextBullet, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'NextXBulletEffect_C_SetModifierNextBullet::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function NextXBulletEffect.NextXBulletEffect_C.K2_ReceiveInitialize
// 0x0018 (0x0018 - 0x0000)
struct NextXBulletEffect_C_K2_ReceiveInitialize final
{
public:
	TArray<struct FParamInfo>                     Info;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	const class UGameAbilityComponent*            LpInstigator;                                      // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NextXBulletEffect_C_K2_ReceiveInitialize) == 0x000008, "Wrong alignment on NextXBulletEffect_C_K2_ReceiveInitialize");
static_assert(sizeof(NextXBulletEffect_C_K2_ReceiveInitialize) == 0x000018, "Wrong size on NextXBulletEffect_C_K2_ReceiveInitialize");
static_assert(offsetof(NextXBulletEffect_C_K2_ReceiveInitialize, Info) == 0x000000, "Member 'NextXBulletEffect_C_K2_ReceiveInitialize::Info' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_K2_ReceiveInitialize, LpInstigator) == 0x000010, "Member 'NextXBulletEffect_C_K2_ReceiveInitialize::LpInstigator' has a wrong offset!");

// Function NextXBulletEffect.NextXBulletEffect_C.K2_ReceiveDeActive
// 0x0008 (0x0008 - 0x0000)
struct NextXBulletEffect_C_K2_ReceiveDeActive final
{
public:
	const class UGameAbilityComponent*            Pawn;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NextXBulletEffect_C_K2_ReceiveDeActive) == 0x000008, "Wrong alignment on NextXBulletEffect_C_K2_ReceiveDeActive");
static_assert(sizeof(NextXBulletEffect_C_K2_ReceiveDeActive) == 0x000008, "Wrong size on NextXBulletEffect_C_K2_ReceiveDeActive");
static_assert(offsetof(NextXBulletEffect_C_K2_ReceiveDeActive, Pawn) == 0x000000, "Member 'NextXBulletEffect_C_K2_ReceiveDeActive::Pawn' has a wrong offset!");

// Function NextXBulletEffect.NextXBulletEffect_C.ReceiveOnPreWeaponFire
// 0x0001 (0x0001 - 0x0000)
struct NextXBulletEffect_C_ReceiveOnPreWeaponFire final
{
public:
	EAttributeType                                BulletType_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NextXBulletEffect_C_ReceiveOnPreWeaponFire) == 0x000001, "Wrong alignment on NextXBulletEffect_C_ReceiveOnPreWeaponFire");
static_assert(sizeof(NextXBulletEffect_C_ReceiveOnPreWeaponFire) == 0x000001, "Wrong size on NextXBulletEffect_C_ReceiveOnPreWeaponFire");
static_assert(offsetof(NextXBulletEffect_C_ReceiveOnPreWeaponFire, BulletType_0) == 0x000000, "Member 'NextXBulletEffect_C_ReceiveOnPreWeaponFire::BulletType_0' has a wrong offset!");

// Function NextXBulletEffect.NextXBulletEffect_C.ExecuteUbergraph_NextXBulletEffect
// 0x0158 (0x0158 - 0x0000)
struct NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGameCharacter* CurCharacter, ECharacterActionState InType, bool bSet)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParamInfo>                     K2Node_Event_Info;                                 // 0x0018(0x0010)(ConstParm, ReferenceParm)
	const class UGameAbilityComponent*            K2Node_Event_lpInstigator;                         // 0x0028(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UGameAbilityComponent*            K2Node_Event_Pawn;                                 // 0x0030(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FParamInfo                             CallFunc_Array_Get_Item;                           // 0x0038(0x0010)()
	int32                                         CallFunc_GetParamintValue_ReturnValue;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetParamboolValue_ReturnValue;            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 CallFunc_GetParamfloatArrayValue_ReturnValue;      // 0x0050(0x0010)(ReferenceParm)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 CallFunc_GetParamfloatArrayValue_ReturnValue_1;    // 0x0070(0x0010)(ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_4;             // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Event_ForceShootCount;                      // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UObject*                          K2Node_Event_Instigator;                           // 0x0090(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetOriginCharacter_ReturnValue;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerWeapon*                          CallFunc_GetWeapon_ReturnValue;                    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxAttributeValue_ReturnValue;         // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxAttributeValue_ReturnValue_1;       // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_CustomEvent_CurCharacter;                   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterActionState                         K2Node_CustomEvent_InType;                         // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSet;                           // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetOriginCharacter_ReturnValue_1;         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetOriginCharacter_ReturnValue_2;         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInAim_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F3[0x1];                                       // 0x00F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Variable;                                   // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatArrayValueForLevel_ReturnValue;   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevel_ReturnValue_1;                   // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatArrayValueForLevel_ReturnValue_1; // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAttributeType                                K2Node_Event_BulletType;                           // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x012E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x012F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetOriginCharacter_ReturnValue_3;         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerWeapon*                          CallFunc_GetWeapon_ReturnValue_1;                  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect) == 0x000008, "Wrong alignment on NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect");
static_assert(sizeof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect) == 0x000158, "Wrong size on NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, EntryPoint) == 0x000000, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, K2Node_Event_Info) == 0x000018, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::K2Node_Event_Info' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, K2Node_Event_lpInstigator) == 0x000028, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::K2Node_Event_lpInstigator' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, K2Node_Event_Pawn) == 0x000030, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::K2Node_Event_Pawn' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_Array_Get_Item) == 0x000038, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_GetParamintValue_ReturnValue) == 0x000048, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_GetParamintValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_GetParamboolValue_ReturnValue) == 0x00004C, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_GetParamboolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_GetParamfloatArrayValue_ReturnValue) == 0x000050, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_GetParamfloatArrayValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, K2Node_SwitchString_CmpSuccess) == 0x000060, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_Greater_IntInt_ReturnValue) == 0x000068, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_GetParamfloatArrayValue_ReturnValue_1) == 0x000070, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_GetParamfloatArrayValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000080, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000081, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_Greater_IntInt_ReturnValue_3) == 0x000082, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_Greater_IntInt_ReturnValue_4) == 0x000083, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_Greater_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, K2Node_Event_ForceShootCount) == 0x000084, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::K2Node_Event_ForceShootCount' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000088, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, K2Node_Event_Instigator) == 0x000090, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::K2Node_Event_Instigator' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_GetOriginCharacter_ReturnValue) == 0x0000A0, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_GetOriginCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_IsValid_ReturnValue_1) == 0x0000A8, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_GetWeapon_ReturnValue) == 0x0000B0, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_IsValid_ReturnValue_2) == 0x0000B8, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_GetMaxAttributeValue_ReturnValue) == 0x0000BC, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_GetMaxAttributeValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_GetMaxAttributeValue_ReturnValue_1) == 0x0000C0, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_GetMaxAttributeValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, K2Node_CustomEvent_CurCharacter) == 0x0000C8, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::K2Node_CustomEvent_CurCharacter' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, K2Node_CustomEvent_InType) == 0x0000D0, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::K2Node_CustomEvent_InType' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, K2Node_CustomEvent_bSet) == 0x0000D1, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::K2Node_CustomEvent_bSet' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_IsValid_ReturnValue_3) == 0x0000D2, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_GetOriginCharacter_ReturnValue_1) == 0x0000D8, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_GetOriginCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_IsValid_ReturnValue_4) == 0x0000E0, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_IsValid_ReturnValue_5) == 0x0000E1, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_GetOriginCharacter_ReturnValue_2) == 0x0000E8, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_GetOriginCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_IsInAim_ReturnValue) == 0x0000F0, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_IsInAim_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_IsValid_ReturnValue_6) == 0x0000F1, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_Not_PreBool_ReturnValue) == 0x0000F2, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, ___int_Variable) == 0x0000F4, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::___int_Variable' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000F8, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_BooleanAND_ReturnValue) == 0x0000F9, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_BooleanAND_ReturnValue_1) == 0x0000FA, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_BooleanAND_ReturnValue_2) == 0x0000FB, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_GetLevel_ReturnValue) == 0x0000FC, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_GetLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_GetFloatArrayValueForLevel_ReturnValue) == 0x000100, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_GetFloatArrayValueForLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_GetLevel_ReturnValue_1) == 0x000104, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_GetLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_FTrunc_ReturnValue) == 0x000108, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_GetFloatArrayValueForLevel_ReturnValue_1) == 0x00010C, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_GetFloatArrayValueForLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000110, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000114, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000118, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x00011C, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_FTrunc_ReturnValue_1) == 0x000120, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_FTrunc_ReturnValue_2) == 0x000124, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_Add_IntInt_ReturnValue_1) == 0x000128, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00012C, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, K2Node_Event_BulletType) == 0x00012D, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::K2Node_Event_BulletType' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00012E, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00012F, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, K2Node_SwitchInteger_CmpSuccess) == 0x000130, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, K2Node_SwitchInteger_CmpSuccess_1) == 0x000131, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_GetOriginCharacter_ReturnValue_3) == 0x000138, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_GetOriginCharacter_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_IsValid_ReturnValue_7) == 0x000140, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_IsValid_ReturnValue_8) == 0x000141, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_GetWeapon_ReturnValue_1) == 0x000148, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_GetWeapon_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_IsValid_ReturnValue_9) == 0x000150, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000151, "Member 'NextXBulletEffect_C_ExecuteUbergraph_NextXBulletEffect::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function NextXBulletEffect.NextXBulletEffect_C.CheckState
// 0x0005 (0x0005 - 0x0000)
struct NextXBulletEffect_C_CheckState final
{
public:
	ECharacterActionState                         InState;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSet;                                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bTempSet;                                          // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NextXBulletEffect_C_CheckState) == 0x000001, "Wrong alignment on NextXBulletEffect_C_CheckState");
static_assert(sizeof(NextXBulletEffect_C_CheckState) == 0x000005, "Wrong size on NextXBulletEffect_C_CheckState");
static_assert(offsetof(NextXBulletEffect_C_CheckState, InState) == 0x000000, "Member 'NextXBulletEffect_C_CheckState::InState' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_CheckState, bSet) == 0x000001, "Member 'NextXBulletEffect_C_CheckState::bSet' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_CheckState, bTempSet) == 0x000002, "Member 'NextXBulletEffect_C_CheckState::bTempSet' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_CheckState, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'NextXBulletEffect_C_CheckState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_CheckState, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'NextXBulletEffect_C_CheckState::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function NextXBulletEffect.NextXBulletEffect_C.ReceiveOnWeaponFire
// 0x0004 (0x0004 - 0x0000)
struct NextXBulletEffect_C_ReceiveOnWeaponFire final
{
public:
	int32                                         ForceShootCount;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NextXBulletEffect_C_ReceiveOnWeaponFire) == 0x000004, "Wrong alignment on NextXBulletEffect_C_ReceiveOnWeaponFire");
static_assert(sizeof(NextXBulletEffect_C_ReceiveOnWeaponFire) == 0x000004, "Wrong size on NextXBulletEffect_C_ReceiveOnWeaponFire");
static_assert(offsetof(NextXBulletEffect_C_ReceiveOnWeaponFire, ForceShootCount) == 0x000000, "Member 'NextXBulletEffect_C_ReceiveOnWeaponFire::ForceShootCount' has a wrong offset!");

// Function NextXBulletEffect.NextXBulletEffect_C.K2_ReceiveActive
// 0x0008 (0x0008 - 0x0000)
struct NextXBulletEffect_C_K2_ReceiveActive final
{
public:
	const class UObject*                          Instigator;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NextXBulletEffect_C_K2_ReceiveActive) == 0x000008, "Wrong alignment on NextXBulletEffect_C_K2_ReceiveActive");
static_assert(sizeof(NextXBulletEffect_C_K2_ReceiveActive) == 0x000008, "Wrong size on NextXBulletEffect_C_K2_ReceiveActive");
static_assert(offsetof(NextXBulletEffect_C_K2_ReceiveActive, Instigator) == 0x000000, "Member 'NextXBulletEffect_C_K2_ReceiveActive::Instigator' has a wrong offset!");

// Function NextXBulletEffect.NextXBulletEffect_C.OnPlayerActionFlay
// 0x0010 (0x0010 - 0x0000)
struct NextXBulletEffect_C_OnPlayerActionFlay final
{
public:
	class AGameCharacter*                         CurCharacter;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterActionState                         InType;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSet;                                              // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NextXBulletEffect_C_OnPlayerActionFlay) == 0x000008, "Wrong alignment on NextXBulletEffect_C_OnPlayerActionFlay");
static_assert(sizeof(NextXBulletEffect_C_OnPlayerActionFlay) == 0x000010, "Wrong size on NextXBulletEffect_C_OnPlayerActionFlay");
static_assert(offsetof(NextXBulletEffect_C_OnPlayerActionFlay, CurCharacter) == 0x000000, "Member 'NextXBulletEffect_C_OnPlayerActionFlay::CurCharacter' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_OnPlayerActionFlay, InType) == 0x000008, "Member 'NextXBulletEffect_C_OnPlayerActionFlay::InType' has a wrong offset!");
static_assert(offsetof(NextXBulletEffect_C_OnPlayerActionFlay, bSet) == 0x000009, "Member 'NextXBulletEffect_C_OnPlayerActionFlay::bSet' has a wrong offset!");

}

