#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NoBulletConsume

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NoBulletConsume.NoBulletConsume_C
// 0x0010 (0x0100 - 0x00F0)
class UNoBulletConsume_C final : public UCustomGameAbilityBuffer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         BulletCount;                                       // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurBulletCount;                                    // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void K2_ReceiveActive(const class UObject* Instigator);
	void K2_ReceiveInitialize(const TArray<struct FParamInfo>& Info, const class UGameAbilityComponent* LpInstigator);
	void K2_ReceiveDeActive(const class UGameAbilityComponent* Pawn);
	void WeaponFire(uint8 ForceShootCount, class APlayerWeapon* InCurWeapon);
	void ExecuteUbergraph_NoBulletConsume(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NoBulletConsume_C">();
	}
	static class UNoBulletConsume_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNoBulletConsume_C>();
	}
};
static_assert(alignof(UNoBulletConsume_C) == 0x000008, "Wrong alignment on UNoBulletConsume_C");
static_assert(sizeof(UNoBulletConsume_C) == 0x000100, "Wrong size on UNoBulletConsume_C");
static_assert(offsetof(UNoBulletConsume_C, UberGraphFrame) == 0x0000F0, "Member 'UNoBulletConsume_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNoBulletConsume_C, BulletCount) == 0x0000F8, "Member 'UNoBulletConsume_C::BulletCount' has a wrong offset!");
static_assert(offsetof(UNoBulletConsume_C, CurBulletCount) == 0x0000FC, "Member 'UNoBulletConsume_C::CurBulletCount' has a wrong offset!");

}

