#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NoBulletConsume

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function NoBulletConsume.NoBulletConsume_C.K2_ReceiveActive
// 0x0008 (0x0008 - 0x0000)
struct NoBulletConsume_C_K2_ReceiveActive final
{
public:
	const class UObject*                          Instigator;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NoBulletConsume_C_K2_ReceiveActive) == 0x000008, "Wrong alignment on NoBulletConsume_C_K2_ReceiveActive");
static_assert(sizeof(NoBulletConsume_C_K2_ReceiveActive) == 0x000008, "Wrong size on NoBulletConsume_C_K2_ReceiveActive");
static_assert(offsetof(NoBulletConsume_C_K2_ReceiveActive, Instigator) == 0x000000, "Member 'NoBulletConsume_C_K2_ReceiveActive::Instigator' has a wrong offset!");

// Function NoBulletConsume.NoBulletConsume_C.K2_ReceiveInitialize
// 0x0018 (0x0018 - 0x0000)
struct NoBulletConsume_C_K2_ReceiveInitialize final
{
public:
	TArray<struct FParamInfo>                     Info;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	const class UGameAbilityComponent*            LpInstigator;                                      // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NoBulletConsume_C_K2_ReceiveInitialize) == 0x000008, "Wrong alignment on NoBulletConsume_C_K2_ReceiveInitialize");
static_assert(sizeof(NoBulletConsume_C_K2_ReceiveInitialize) == 0x000018, "Wrong size on NoBulletConsume_C_K2_ReceiveInitialize");
static_assert(offsetof(NoBulletConsume_C_K2_ReceiveInitialize, Info) == 0x000000, "Member 'NoBulletConsume_C_K2_ReceiveInitialize::Info' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_K2_ReceiveInitialize, LpInstigator) == 0x000010, "Member 'NoBulletConsume_C_K2_ReceiveInitialize::LpInstigator' has a wrong offset!");

// Function NoBulletConsume.NoBulletConsume_C.K2_ReceiveDeActive
// 0x0008 (0x0008 - 0x0000)
struct NoBulletConsume_C_K2_ReceiveDeActive final
{
public:
	const class UGameAbilityComponent*            Pawn;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NoBulletConsume_C_K2_ReceiveDeActive) == 0x000008, "Wrong alignment on NoBulletConsume_C_K2_ReceiveDeActive");
static_assert(sizeof(NoBulletConsume_C_K2_ReceiveDeActive) == 0x000008, "Wrong size on NoBulletConsume_C_K2_ReceiveDeActive");
static_assert(offsetof(NoBulletConsume_C_K2_ReceiveDeActive, Pawn) == 0x000000, "Member 'NoBulletConsume_C_K2_ReceiveDeActive::Pawn' has a wrong offset!");

// Function NoBulletConsume.NoBulletConsume_C.WeaponFire
// 0x0010 (0x0010 - 0x0000)
struct NoBulletConsume_C_WeaponFire final
{
public:
	uint8                                         ForceShootCount;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerWeapon*                          InCurWeapon;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NoBulletConsume_C_WeaponFire) == 0x000008, "Wrong alignment on NoBulletConsume_C_WeaponFire");
static_assert(sizeof(NoBulletConsume_C_WeaponFire) == 0x000010, "Wrong size on NoBulletConsume_C_WeaponFire");
static_assert(offsetof(NoBulletConsume_C_WeaponFire, ForceShootCount) == 0x000000, "Member 'NoBulletConsume_C_WeaponFire::ForceShootCount' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_WeaponFire, InCurWeapon) == 0x000008, "Member 'NoBulletConsume_C_WeaponFire::InCurWeapon' has a wrong offset!");

// Function NoBulletConsume.NoBulletConsume_C.ExecuteUbergraph_NoBulletConsume
// 0x00E0 (0x00E0 - 0x0000)
struct NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(uint8 ForceShootCount, class APlayerWeapon* InCurWeapon)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	const class UObject*                          K2Node_Event_Instigator;                           // 0x0028(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FParamInfo>                     K2Node_Event_Info;                                 // 0x0030(0x0010)(ConstParm, ReferenceParm)
	const class UGameAbilityComponent*            K2Node_Event_lpInstigator;                         // 0x0040(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetLauncherActor_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FParamInfo                             CallFunc_Array_Get_Item;                           // 0x0050(0x0010)()
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetParamintValue_ReturnValue;             // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerWeapon*                          CallFunc_GetWeapon_ReturnValue;                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGameAbilityComponent*            K2Node_Event_Pawn;                                 // 0x0080(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetLauncherActor_ReturnValue_1;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character_1;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         K2Node_CustomEvent_ForceShootCount;                // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerWeapon*                          K2Node_CustomEvent_InCurWeapon;                    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerWeapon*                          CallFunc_GetWeapon_ReturnValue_1;                  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetLauncherActor_ReturnValue_2;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character_2;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerWeapon*                          CallFunc_GetWeapon_ReturnValue_2;                  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume) == 0x000008, "Wrong alignment on NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume");
static_assert(sizeof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume) == 0x0000E0, "Wrong size on NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, EntryPoint) == 0x000000, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::EntryPoint' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000005, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, ___int_Array_Index_Variable) == 0x000008, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, ___int_Loop_Counter_Variable) == 0x00000C, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, K2Node_Event_Instigator) == 0x000028, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::K2Node_Event_Instigator' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, K2Node_Event_Info) == 0x000030, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::K2Node_Event_Info' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, K2Node_Event_lpInstigator) == 0x000040, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::K2Node_Event_lpInstigator' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, CallFunc_GetLauncherActor_ReturnValue) == 0x000048, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::CallFunc_GetLauncherActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, CallFunc_Array_Get_Item) == 0x000050, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, K2Node_DynamicCast_AsGame_Character) == 0x000060, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, CallFunc_GetParamintValue_ReturnValue) == 0x00006C, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::CallFunc_GetParamintValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, CallFunc_GetWeapon_ReturnValue) == 0x000070, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, K2Node_Event_Pawn) == 0x000080, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::K2Node_Event_Pawn' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, CallFunc_GetLauncherActor_ReturnValue_1) == 0x000090, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::CallFunc_GetLauncherActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, K2Node_DynamicCast_AsGame_Character_1) == 0x000098, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::K2Node_DynamicCast_AsGame_Character_1' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, K2Node_CustomEvent_ForceShootCount) == 0x0000A1, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::K2Node_CustomEvent_ForceShootCount' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, K2Node_CustomEvent_InCurWeapon) == 0x0000A8, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::K2Node_CustomEvent_InCurWeapon' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, CallFunc_GetWeapon_ReturnValue_1) == 0x0000B0, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::CallFunc_GetWeapon_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, CallFunc_GetLauncherActor_ReturnValue_2) == 0x0000B8, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::CallFunc_GetLauncherActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, K2Node_DynamicCast_AsGame_Character_2) == 0x0000C0, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::K2Node_DynamicCast_AsGame_Character_2' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, K2Node_DynamicCast_bSuccess_2) == 0x0000C8, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, CallFunc_GetWeapon_ReturnValue_2) == 0x0000D0, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::CallFunc_GetWeapon_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000D8, "Member 'NoBulletConsume_C_ExecuteUbergraph_NoBulletConsume::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

}

