#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NodeScript

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class NodeScript.NodeScriptNpcActor
// 0x0000 (0x04C0 - 0x04C0)
class ANodeScriptNpcActor final : public ACharacter
{
public:
	class ASkillMgrActor*                         SkillMgr;                                          // 0x04B8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NodeScriptNpcActor">();
	}
	static class ANodeScriptNpcActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANodeScriptNpcActor>();
	}
};
static_assert(alignof(ANodeScriptNpcActor) == 0x000010, "Wrong alignment on ANodeScriptNpcActor");
static_assert(sizeof(ANodeScriptNpcActor) == 0x0004C0, "Wrong size on ANodeScriptNpcActor");
static_assert(offsetof(ANodeScriptNpcActor, SkillMgr) == 0x0004B8, "Member 'ANodeScriptNpcActor::SkillMgr' has a wrong offset!");

// Class NodeScript.SkillMgrActor
// 0x0078 (0x0298 - 0x0220)
class ASkillMgrActor final : public AActor
{
public:
	class USkillMgrSettingSystem*                 SettingSystem;                                     // 0x0220(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_228[0x70];                                     // 0x0228(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DebugCastSkill(int32 InSkillId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SkillMgrActor">();
	}
	static class ASkillMgrActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASkillMgrActor>();
	}
};
static_assert(alignof(ASkillMgrActor) == 0x000008, "Wrong alignment on ASkillMgrActor");
static_assert(sizeof(ASkillMgrActor) == 0x000298, "Wrong size on ASkillMgrActor");
static_assert(offsetof(ASkillMgrActor, SettingSystem) == 0x000220, "Member 'ASkillMgrActor::SettingSystem' has a wrong offset!");

// Class NodeScript.SkillMgrSettingSystem
// 0x00A0 (0x00D0 - 0x0030)
class USkillMgrSettingSystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0xA0];                                      // 0x0030(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SkillMgrSettingSystem">();
	}
	static class USkillMgrSettingSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkillMgrSettingSystem>();
	}
};
static_assert(alignof(USkillMgrSettingSystem) == 0x000008, "Wrong alignment on USkillMgrSettingSystem");
static_assert(sizeof(USkillMgrSettingSystem) == 0x0000D0, "Wrong size on USkillMgrSettingSystem");

}

