#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NotIfyUIEvent

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "GameTask_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NotIfyUIEvent.NotIfyUIEvent_C
// 0x0010 (0x0168 - 0x0158)
class UNotIfyUIEvent_C final : public UGameTaskEvent
{
public:
	int32                                         UIIndex;                                           // 0x0158(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UITypeID;                                          // 0x015C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOnlineTDDuty                                 OnlineTDDuty;                                      // 0x0160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool OnTrigger();
	void IsSucceed__Overridden(bool* Result);
	void OnlineTDDutyCheck(bool* Result);
	void IsSucceed(bool* Result);

	class FString GetSpecialStaticDescription() const;
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NotIfyUIEvent_C">();
	}
	static class UNotIfyUIEvent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNotIfyUIEvent_C>();
	}
};
static_assert(alignof(UNotIfyUIEvent_C) == 0x000008, "Wrong alignment on UNotIfyUIEvent_C");
static_assert(sizeof(UNotIfyUIEvent_C) == 0x000168, "Wrong size on UNotIfyUIEvent_C");
static_assert(offsetof(UNotIfyUIEvent_C, UIIndex) == 0x000158, "Member 'UNotIfyUIEvent_C::UIIndex' has a wrong offset!");
static_assert(offsetof(UNotIfyUIEvent_C, UITypeID) == 0x00015C, "Member 'UNotIfyUIEvent_C::UITypeID' has a wrong offset!");
static_assert(offsetof(UNotIfyUIEvent_C, OnlineTDDuty) == 0x000160, "Member 'UNotIfyUIEvent_C::OnlineTDDuty' has a wrong offset!");

}

