#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NotIfyUIEvent

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function NotIfyUIEvent.NotIfyUIEvent_C.OnTrigger
// 0x0018 (0x0018 - 0x0000)
struct NotIfyUIEvent_C_OnTrigger final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnlineTDDutyCheck_Result;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameTaskActor*                         CallFunc_GetGameTaskActor_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NotIfyUIEvent_C_OnTrigger) == 0x000008, "Wrong alignment on NotIfyUIEvent_C_OnTrigger");
static_assert(sizeof(NotIfyUIEvent_C_OnTrigger) == 0x000018, "Wrong size on NotIfyUIEvent_C_OnTrigger");
static_assert(offsetof(NotIfyUIEvent_C_OnTrigger, ReturnValue) == 0x000000, "Member 'NotIfyUIEvent_C_OnTrigger::ReturnValue' has a wrong offset!");
static_assert(offsetof(NotIfyUIEvent_C_OnTrigger, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000001, "Member 'NotIfyUIEvent_C_OnTrigger::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(NotIfyUIEvent_C_OnTrigger, CallFunc_OnlineTDDutyCheck_Result) == 0x000002, "Member 'NotIfyUIEvent_C_OnTrigger::CallFunc_OnlineTDDutyCheck_Result' has a wrong offset!");
static_assert(offsetof(NotIfyUIEvent_C_OnTrigger, CallFunc_GetGameTaskActor_ReturnValue) == 0x000008, "Member 'NotIfyUIEvent_C_OnTrigger::CallFunc_GetGameTaskActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(NotIfyUIEvent_C_OnTrigger, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'NotIfyUIEvent_C_OnTrigger::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function NotIfyUIEvent.NotIfyUIEvent_C.IsSucceed__Overridden
// 0x0001 (0x0001 - 0x0000)
struct NotIfyUIEvent_C_IsSucceed__Overridden final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NotIfyUIEvent_C_IsSucceed__Overridden) == 0x000001, "Wrong alignment on NotIfyUIEvent_C_IsSucceed__Overridden");
static_assert(sizeof(NotIfyUIEvent_C_IsSucceed__Overridden) == 0x000001, "Wrong size on NotIfyUIEvent_C_IsSucceed__Overridden");
static_assert(offsetof(NotIfyUIEvent_C_IsSucceed__Overridden, Result) == 0x000000, "Member 'NotIfyUIEvent_C_IsSucceed__Overridden::Result' has a wrong offset!");

// Function NotIfyUIEvent.NotIfyUIEvent_C.OnlineTDDutyCheck
// 0x0038 (0x0038 - 0x0000)
struct NotIfyUIEvent_C_OnlineTDDutyCheck final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerControllerFromID_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayerState*                       K2Node_DynamicCast_AsGame_Player_State;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameTaskActor*                         CallFunc_GetGameTaskActor_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOnlineClient_ReturnValue;               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOnlineTDDuty                                 CallFunc_GetOnlineTDConfirmDuty_ReturnValue;       // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NotIfyUIEvent_C_OnlineTDDutyCheck) == 0x000008, "Wrong alignment on NotIfyUIEvent_C_OnlineTDDutyCheck");
static_assert(sizeof(NotIfyUIEvent_C_OnlineTDDutyCheck) == 0x000038, "Wrong size on NotIfyUIEvent_C_OnlineTDDutyCheck");
static_assert(offsetof(NotIfyUIEvent_C_OnlineTDDutyCheck, Result) == 0x000000, "Member 'NotIfyUIEvent_C_OnlineTDDutyCheck::Result' has a wrong offset!");
static_assert(offsetof(NotIfyUIEvent_C_OnlineTDDutyCheck, CallFunc_GetPlayerControllerFromID_ReturnValue) == 0x000008, "Member 'NotIfyUIEvent_C_OnlineTDDutyCheck::CallFunc_GetPlayerControllerFromID_ReturnValue' has a wrong offset!");
static_assert(offsetof(NotIfyUIEvent_C_OnlineTDDutyCheck, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'NotIfyUIEvent_C_OnlineTDDutyCheck::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NotIfyUIEvent_C_OnlineTDDutyCheck, K2Node_DynamicCast_AsGame_Player_State) == 0x000018, "Member 'NotIfyUIEvent_C_OnlineTDDutyCheck::K2Node_DynamicCast_AsGame_Player_State' has a wrong offset!");
static_assert(offsetof(NotIfyUIEvent_C_OnlineTDDutyCheck, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'NotIfyUIEvent_C_OnlineTDDutyCheck::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(NotIfyUIEvent_C_OnlineTDDutyCheck, CallFunc_GetGameTaskActor_ReturnValue) == 0x000028, "Member 'NotIfyUIEvent_C_OnlineTDDutyCheck::CallFunc_GetGameTaskActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(NotIfyUIEvent_C_OnlineTDDutyCheck, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'NotIfyUIEvent_C_OnlineTDDutyCheck::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NotIfyUIEvent_C_OnlineTDDutyCheck, CallFunc_IsOnlineClient_ReturnValue) == 0x000031, "Member 'NotIfyUIEvent_C_OnlineTDDutyCheck::CallFunc_IsOnlineClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(NotIfyUIEvent_C_OnlineTDDutyCheck, CallFunc_GetOnlineTDConfirmDuty_ReturnValue) == 0x000032, "Member 'NotIfyUIEvent_C_OnlineTDDutyCheck::CallFunc_GetOnlineTDConfirmDuty_ReturnValue' has a wrong offset!");
static_assert(offsetof(NotIfyUIEvent_C_OnlineTDDutyCheck, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000033, "Member 'NotIfyUIEvent_C_OnlineTDDutyCheck::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(NotIfyUIEvent_C_OnlineTDDutyCheck, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000034, "Member 'NotIfyUIEvent_C_OnlineTDDutyCheck::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// LuaFunction NotIfyUIEvent.NotIfyUIEvent_C.IsSucceed
// 0x0001 (0x0001 - 0x0000)
struct NotIfyUIEvent_C_IsSucceed final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NotIfyUIEvent_C_IsSucceed) == 0x000001, "Wrong alignment on NotIfyUIEvent_C_IsSucceed");
static_assert(sizeof(NotIfyUIEvent_C_IsSucceed) == 0x000001, "Wrong size on NotIfyUIEvent_C_IsSucceed");
static_assert(offsetof(NotIfyUIEvent_C_IsSucceed, Result) == 0x000000, "Member 'NotIfyUIEvent_C_IsSucceed::Result' has a wrong offset!");

// Function NotIfyUIEvent.NotIfyUIEvent_C.GetSpecialStaticDescription
// 0x0090 (0x0090 - 0x0000)
struct NotIfyUIEvent_C_GetSpecialStaticDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(NotIfyUIEvent_C_GetSpecialStaticDescription) == 0x000008, "Wrong alignment on NotIfyUIEvent_C_GetSpecialStaticDescription");
static_assert(sizeof(NotIfyUIEvent_C_GetSpecialStaticDescription) == 0x000090, "Wrong size on NotIfyUIEvent_C_GetSpecialStaticDescription");
static_assert(offsetof(NotIfyUIEvent_C_GetSpecialStaticDescription, ReturnValue) == 0x000000, "Member 'NotIfyUIEvent_C_GetSpecialStaticDescription::ReturnValue' has a wrong offset!");
static_assert(offsetof(NotIfyUIEvent_C_GetSpecialStaticDescription, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000010, "Member 'NotIfyUIEvent_C_GetSpecialStaticDescription::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(NotIfyUIEvent_C_GetSpecialStaticDescription, CallFunc_Conv_IntToString_ReturnValue) == 0x000020, "Member 'NotIfyUIEvent_C_GetSpecialStaticDescription::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(NotIfyUIEvent_C_GetSpecialStaticDescription, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000030, "Member 'NotIfyUIEvent_C_GetSpecialStaticDescription::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NotIfyUIEvent_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'NotIfyUIEvent_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(NotIfyUIEvent_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000050, "Member 'NotIfyUIEvent_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NotIfyUIEvent_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000060, "Member 'NotIfyUIEvent_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NotIfyUIEvent_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000070, "Member 'NotIfyUIEvent_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NotIfyUIEvent_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000080, "Member 'NotIfyUIEvent_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");

// Function NotIfyUIEvent.NotIfyUIEvent_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct NotIfyUIEvent_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(NotIfyUIEvent_C_GetModuleName) == 0x000008, "Wrong alignment on NotIfyUIEvent_C_GetModuleName");
static_assert(sizeof(NotIfyUIEvent_C_GetModuleName) == 0x000010, "Wrong size on NotIfyUIEvent_C_GetModuleName");
static_assert(offsetof(NotIfyUIEvent_C_GetModuleName, ReturnValue) == 0x000000, "Member 'NotIfyUIEvent_C_GetModuleName::ReturnValue' has a wrong offset!");

}

