#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPCFollowComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPCFollowComponent.NPCFollowComponent_C
// 0x0028 (0x00D8 - 0x00B0)
class UNPCFollowComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         ResetSpeed;                                        // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FollowDistSquare;                                  // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FinishDistSquare;                                  // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 WeaponClass;                                       // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseLuaLogic;                                      // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ReceiveTick(float DeltaSeconds);
	void ReceiveTick__Overridden(float DeltaSeconds);
	void ExecuteUbergraph_NPCFollowComponent(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPCFollowComponent_C">();
	}
	static class UNPCFollowComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPCFollowComponent_C>();
	}
};
static_assert(alignof(UNPCFollowComponent_C) == 0x000008, "Wrong alignment on UNPCFollowComponent_C");
static_assert(sizeof(UNPCFollowComponent_C) == 0x0000D8, "Wrong size on UNPCFollowComponent_C");
static_assert(offsetof(UNPCFollowComponent_C, UberGraphFrame) == 0x0000B0, "Member 'UNPCFollowComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNPCFollowComponent_C, ResetSpeed) == 0x0000B8, "Member 'UNPCFollowComponent_C::ResetSpeed' has a wrong offset!");
static_assert(offsetof(UNPCFollowComponent_C, FollowDistSquare) == 0x0000BC, "Member 'UNPCFollowComponent_C::FollowDistSquare' has a wrong offset!");
static_assert(offsetof(UNPCFollowComponent_C, FinishDistSquare) == 0x0000C0, "Member 'UNPCFollowComponent_C::FinishDistSquare' has a wrong offset!");
static_assert(offsetof(UNPCFollowComponent_C, WeaponClass) == 0x0000C8, "Member 'UNPCFollowComponent_C::WeaponClass' has a wrong offset!");
static_assert(offsetof(UNPCFollowComponent_C, bUseLuaLogic) == 0x0000D0, "Member 'UNPCFollowComponent_C::bUseLuaLogic' has a wrong offset!");

}

