#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPCFollowComponent

#include "Basic.hpp"


namespace SDK::Params
{

// LuaFunction NPCFollowComponent.NPCFollowComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct NPCFollowComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPCFollowComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on NPCFollowComponent_C_ReceiveTick");
static_assert(sizeof(NPCFollowComponent_C_ReceiveTick) == 0x000004, "Wrong size on NPCFollowComponent_C_ReceiveTick");
static_assert(offsetof(NPCFollowComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'NPCFollowComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function NPCFollowComponent.NPCFollowComponent_C.ReceiveTick__Overridden
// 0x0004 (0x0004 - 0x0000)
struct NPCFollowComponent_C_ReceiveTick__Overridden final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPCFollowComponent_C_ReceiveTick__Overridden) == 0x000004, "Wrong alignment on NPCFollowComponent_C_ReceiveTick__Overridden");
static_assert(sizeof(NPCFollowComponent_C_ReceiveTick__Overridden) == 0x000004, "Wrong size on NPCFollowComponent_C_ReceiveTick__Overridden");
static_assert(offsetof(NPCFollowComponent_C_ReceiveTick__Overridden, DeltaSeconds) == 0x000000, "Member 'NPCFollowComponent_C_ReceiveTick__Overridden::DeltaSeconds' has a wrong offset!");

// Function NPCFollowComponent.NPCFollowComponent_C.ExecuteUbergraph_NPCFollowComponent
// 0x0008 (0x0008 - 0x0000)
struct NPCFollowComponent_C_ExecuteUbergraph_NPCFollowComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPCFollowComponent_C_ExecuteUbergraph_NPCFollowComponent) == 0x000004, "Wrong alignment on NPCFollowComponent_C_ExecuteUbergraph_NPCFollowComponent");
static_assert(sizeof(NPCFollowComponent_C_ExecuteUbergraph_NPCFollowComponent) == 0x000008, "Wrong size on NPCFollowComponent_C_ExecuteUbergraph_NPCFollowComponent");
static_assert(offsetof(NPCFollowComponent_C_ExecuteUbergraph_NPCFollowComponent, EntryPoint) == 0x000000, "Member 'NPCFollowComponent_C_ExecuteUbergraph_NPCFollowComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(NPCFollowComponent_C_ExecuteUbergraph_NPCFollowComponent, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'NPCFollowComponent_C_ExecuteUbergraph_NPCFollowComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function NPCFollowComponent.NPCFollowComponent_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct NPCFollowComponent_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(NPCFollowComponent_C_GetModuleName) == 0x000008, "Wrong alignment on NPCFollowComponent_C_GetModuleName");
static_assert(sizeof(NPCFollowComponent_C_GetModuleName) == 0x000010, "Wrong size on NPCFollowComponent_C_GetModuleName");
static_assert(offsetof(NPCFollowComponent_C_GetModuleName, ReturnValue) == 0x000000, "Member 'NPCFollowComponent_C_GetModuleName::ReturnValue' has a wrong offset!");

}

