#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: One00202

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass 100202.100202_C
// 0x0020 (0x0A20 - 0x0A00)
class AOne00202_C final : public ABullet
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          HasFire;                                           // 0x0A08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A09[0x3];                                      // 0x0A09(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TeamSot;                                           // 0x0A0C(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 BunkerState;                                       // 0x0A10(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ReceiveBulletFire();
	void ExecuteUbergraph_100202(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"100202_C">();
	}
	static class AOne00202_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOne00202_C>();
	}
};
static_assert(alignof(AOne00202_C) == 0x000010, "Wrong alignment on AOne00202_C");
static_assert(sizeof(AOne00202_C) == 0x000A20, "Wrong size on AOne00202_C");
static_assert(offsetof(AOne00202_C, UberGraphFrame) == 0x000A00, "Member 'AOne00202_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AOne00202_C, HasFire) == 0x000A08, "Member 'AOne00202_C::HasFire' has a wrong offset!");
static_assert(offsetof(AOne00202_C, TeamSot) == 0x000A0C, "Member 'AOne00202_C::TeamSot' has a wrong offset!");
static_assert(offsetof(AOne00202_C, BunkerState) == 0x000A10, "Member 'AOne00202_C::BunkerState' has a wrong offset!");

}

