#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: One10508

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function 110508.110508_C.ReceiveBulletHit
// 0x00A0 (0x00A0 - 0x0000)
struct One10508_C_ReceiveBulletHit final
{
public:
	bool                                          InHitPawn;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AActor*                           Other;                                             // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0010(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(One10508_C_ReceiveBulletHit) == 0x000008, "Wrong alignment on One10508_C_ReceiveBulletHit");
static_assert(sizeof(One10508_C_ReceiveBulletHit) == 0x0000A0, "Wrong size on One10508_C_ReceiveBulletHit");
static_assert(offsetof(One10508_C_ReceiveBulletHit, InHitPawn) == 0x000000, "Member 'One10508_C_ReceiveBulletHit::InHitPawn' has a wrong offset!");
static_assert(offsetof(One10508_C_ReceiveBulletHit, Other) == 0x000008, "Member 'One10508_C_ReceiveBulletHit::Other' has a wrong offset!");
static_assert(offsetof(One10508_C_ReceiveBulletHit, Hit) == 0x000010, "Member 'One10508_C_ReceiveBulletHit::Hit' has a wrong offset!");

// Function 110508.110508_C.ExecuteUbergraph_110508
// 0x00E8 (0x00E8 - 0x0000)
struct One10508_C_ExecuteUbergraph_110508 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetSpawnActor_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InHitPawn;                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AActor*                           K2Node_Event_Other;                                // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0020(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnGameNiagaraAtLocation_ReturnValue;   // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(One10508_C_ExecuteUbergraph_110508) == 0x000008, "Wrong alignment on One10508_C_ExecuteUbergraph_110508");
static_assert(sizeof(One10508_C_ExecuteUbergraph_110508) == 0x0000E8, "Wrong size on One10508_C_ExecuteUbergraph_110508");
static_assert(offsetof(One10508_C_ExecuteUbergraph_110508, EntryPoint) == 0x000000, "Member 'One10508_C_ExecuteUbergraph_110508::EntryPoint' has a wrong offset!");
static_assert(offsetof(One10508_C_ExecuteUbergraph_110508, CallFunc_GetSpawnActor_ReturnValue) == 0x000008, "Member 'One10508_C_ExecuteUbergraph_110508::CallFunc_GetSpawnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(One10508_C_ExecuteUbergraph_110508, K2Node_Event_InHitPawn) == 0x000010, "Member 'One10508_C_ExecuteUbergraph_110508::K2Node_Event_InHitPawn' has a wrong offset!");
static_assert(offsetof(One10508_C_ExecuteUbergraph_110508, K2Node_Event_Other) == 0x000018, "Member 'One10508_C_ExecuteUbergraph_110508::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(One10508_C_ExecuteUbergraph_110508, K2Node_Event_Hit) == 0x000020, "Member 'One10508_C_ExecuteUbergraph_110508::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(One10508_C_ExecuteUbergraph_110508, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000AC, "Member 'One10508_C_ExecuteUbergraph_110508::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(One10508_C_ExecuteUbergraph_110508, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0000B8, "Member 'One10508_C_ExecuteUbergraph_110508::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(One10508_C_ExecuteUbergraph_110508, CallFunc_BreakRotator_Roll) == 0x0000C4, "Member 'One10508_C_ExecuteUbergraph_110508::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(One10508_C_ExecuteUbergraph_110508, CallFunc_BreakRotator_Pitch) == 0x0000C8, "Member 'One10508_C_ExecuteUbergraph_110508::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(One10508_C_ExecuteUbergraph_110508, CallFunc_BreakRotator_Yaw) == 0x0000CC, "Member 'One10508_C_ExecuteUbergraph_110508::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(One10508_C_ExecuteUbergraph_110508, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000D0, "Member 'One10508_C_ExecuteUbergraph_110508::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(One10508_C_ExecuteUbergraph_110508, CallFunc_MakeRotator_ReturnValue) == 0x0000D4, "Member 'One10508_C_ExecuteUbergraph_110508::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(One10508_C_ExecuteUbergraph_110508, CallFunc_SpawnGameNiagaraAtLocation_ReturnValue) == 0x0000E0, "Member 'One10508_C_ExecuteUbergraph_110508::CallFunc_SpawnGameNiagaraAtLocation_ReturnValue' has a wrong offset!");

}

