#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: One10508

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass 110508.110508_C
// 0x0050 (0x0A20 - 0x09D0)
class AOne10508_C final : public ABullet
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCurveFloat*                            DistanceCurve;                                     // 0x09D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABaseMonster_C*                         Target;                                            // 0x09E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FVector                                RightOffset;                                       // 0x09E8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9F4[0x4];                                      // 0x09F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            DistanceTimeCurve;                                 // 0x09F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABaseMonster_C*>                 Targets;                                           // 0x0A00(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         TargetIndex;                                       // 0x0A10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBulletFire();
	void ReceiveBulletHit(bool InHitPawn, const class AActor* Other, const struct FHitResult& Hit);
	void ExecuteUbergraph_110508(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"110508_C">();
	}
	static class AOne10508_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOne10508_C>();
	}
};
static_assert(alignof(AOne10508_C) == 0x000010, "Wrong alignment on AOne10508_C");
static_assert(sizeof(AOne10508_C) == 0x000A20, "Wrong size on AOne10508_C");
static_assert(offsetof(AOne10508_C, UberGraphFrame) == 0x0009D0, "Member 'AOne10508_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AOne10508_C, DistanceCurve) == 0x0009D8, "Member 'AOne10508_C::DistanceCurve' has a wrong offset!");
static_assert(offsetof(AOne10508_C, Target) == 0x0009E0, "Member 'AOne10508_C::Target' has a wrong offset!");
static_assert(offsetof(AOne10508_C, RightOffset) == 0x0009E8, "Member 'AOne10508_C::RightOffset' has a wrong offset!");
static_assert(offsetof(AOne10508_C, DistanceTimeCurve) == 0x0009F8, "Member 'AOne10508_C::DistanceTimeCurve' has a wrong offset!");
static_assert(offsetof(AOne10508_C, Targets) == 0x000A00, "Member 'AOne10508_C::Targets' has a wrong offset!");
static_assert(offsetof(AOne10508_C, TargetIndex) == 0x000A10, "Member 'AOne10508_C::TargetIndex' has a wrong offset!");

}

