#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnHurt_DamageType

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function OnHurt_DamageType.OnHurt_DamageType_C.OnReceiveNotify
// 0x00C8 (0x00C8 - 0x0000)
struct OnHurt_DamageType_C_OnReceiveNotify final
{
public:
	struct FApplyDamageResultData                 DamageResultData;                                  // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckSkillDamageType_ReturnValue;         // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_OnHurt_DamageType_C_OnReceiveNotify;

// Function OnHurt_DamageType.OnHurt_DamageType_C.ExecuteUbergraph_OnHurt_DamageType
// 0x0008 (0x0008 - 0x0000)
struct OnHurt_DamageType_C_ExecuteUbergraph_OnHurt_DamageType final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSkillDamageType_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_OnHurt_DamageType_C_ExecuteUbergraph_OnHurt_DamageType;

}

