#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnHurt_CauseDead

#include "Basic.hpp"

#include "OnHurt_Base_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass OnHurt_CauseDead.OnHurt_CauseDead_C
// 0x0010 (0x0128 - 0x0118)
class UOnHurt_CauseDead_C final : public UOnHurt_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_OnHurt_CauseDead_C;                 // 0x0118(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bCauseTargetDead;                                  // 0x0120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bOnlyCheckCharacter;                               // 0x0121(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPartAllow;                                        // 0x0122(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void CheckCharacterType(class AGameCharacter* Character, bool* bIsCharacter);
	void OnReceiveNotify(const struct FApplyDamageResultData& Damage_Result, bool* bCastAllowed);
	void K2_InitCondition();
	void ExecuteUbergraph_OnHurt_CauseDead(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OnHurt_CauseDead_C">();
	}
	static class UOnHurt_CauseDead_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnHurt_CauseDead_C>();
	}
};
static_assert(alignof(UOnHurt_CauseDead_C) == 0x000008, "Wrong alignment on UOnHurt_CauseDead_C");
static_assert(sizeof(UOnHurt_CauseDead_C) == 0x000128, "Wrong size on UOnHurt_CauseDead_C");
static_assert(offsetof(UOnHurt_CauseDead_C, UberGraphFrame_OnHurt_CauseDead_C) == 0x000118, "Member 'UOnHurt_CauseDead_C::UberGraphFrame_OnHurt_CauseDead_C' has a wrong offset!");
static_assert(offsetof(UOnHurt_CauseDead_C, bCauseTargetDead) == 0x000120, "Member 'UOnHurt_CauseDead_C::bCauseTargetDead' has a wrong offset!");
static_assert(offsetof(UOnHurt_CauseDead_C, bOnlyCheckCharacter) == 0x000121, "Member 'UOnHurt_CauseDead_C::bOnlyCheckCharacter' has a wrong offset!");
static_assert(offsetof(UOnHurt_CauseDead_C, bPartAllow) == 0x000122, "Member 'UOnHurt_CauseDead_C::bPartAllow' has a wrong offset!");

}

