#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnHurt_Base

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function OnHurt_Base.OnHurt_Base_C.CondtionCacheTarget
// 0x0010 (0x0010 - 0x0000)
struct OnHurt_Base_C_CondtionCacheTarget final
{
public:
	class UAbilityComponentBase*                  InCaster;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponentBase*                  InTarget;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OnHurt_Base_C_CondtionCacheTarget) == 0x000008, "Wrong alignment on OnHurt_Base_C_CondtionCacheTarget");
static_assert(sizeof(OnHurt_Base_C_CondtionCacheTarget) == 0x000010, "Wrong size on OnHurt_Base_C_CondtionCacheTarget");
static_assert(offsetof(OnHurt_Base_C_CondtionCacheTarget, InCaster) == 0x000000, "Member 'OnHurt_Base_C_CondtionCacheTarget::InCaster' has a wrong offset!");
static_assert(offsetof(OnHurt_Base_C_CondtionCacheTarget, InTarget) == 0x000008, "Member 'OnHurt_Base_C_CondtionCacheTarget::InTarget' has a wrong offset!");

// Function OnHurt_Base.OnHurt_Base_C.OnReceiveNotify
// 0x00C8 (0x00C8 - 0x0000)
struct OnHurt_Base_C_OnReceiveNotify final
{
public:
	struct FApplyDamageResultData                 Damage_Result;                                     // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	bool                                          bCastAllowed;                                      // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OnHurt_Base_C_OnReceiveNotify) == 0x000008, "Wrong alignment on OnHurt_Base_C_OnReceiveNotify");
static_assert(sizeof(OnHurt_Base_C_OnReceiveNotify) == 0x0000C8, "Wrong size on OnHurt_Base_C_OnReceiveNotify");
static_assert(offsetof(OnHurt_Base_C_OnReceiveNotify, Damage_Result) == 0x000000, "Member 'OnHurt_Base_C_OnReceiveNotify::Damage_Result' has a wrong offset!");
static_assert(offsetof(OnHurt_Base_C_OnReceiveNotify, bCastAllowed) == 0x0000C0, "Member 'OnHurt_Base_C_OnReceiveNotify::bCastAllowed' has a wrong offset!");

// Function OnHurt_Base.OnHurt_Base_C.ReceiverBind
// 0x0008 (0x0008 - 0x0000)
struct OnHurt_Base_C_ReceiverBind final
{
public:
	class UAbilityComponentBase*                  BindTarget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OnHurt_Base_C_ReceiverBind) == 0x000008, "Wrong alignment on OnHurt_Base_C_ReceiverBind");
static_assert(sizeof(OnHurt_Base_C_ReceiverBind) == 0x000008, "Wrong size on OnHurt_Base_C_ReceiverBind");
static_assert(offsetof(OnHurt_Base_C_ReceiverBind, BindTarget) == 0x000000, "Member 'OnHurt_Base_C_ReceiverBind::BindTarget' has a wrong offset!");

// Function OnHurt_Base.OnHurt_Base_C.ReceiverUnbind
// 0x0008 (0x0008 - 0x0000)
struct OnHurt_Base_C_ReceiverUnbind final
{
public:
	class UAbilityComponentBase*                  BindTarget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OnHurt_Base_C_ReceiverUnbind) == 0x000008, "Wrong alignment on OnHurt_Base_C_ReceiverUnbind");
static_assert(sizeof(OnHurt_Base_C_ReceiverUnbind) == 0x000008, "Wrong size on OnHurt_Base_C_ReceiverUnbind");
static_assert(offsetof(OnHurt_Base_C_ReceiverUnbind, BindTarget) == 0x000000, "Member 'OnHurt_Base_C_ReceiverUnbind::BindTarget' has a wrong offset!");

// Function OnHurt_Base.OnHurt_Base_C.AttackerBind
// 0x0008 (0x0008 - 0x0000)
struct OnHurt_Base_C_AttackerBind final
{
public:
	class UAbilityComponentBase*                  BindTarget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OnHurt_Base_C_AttackerBind) == 0x000008, "Wrong alignment on OnHurt_Base_C_AttackerBind");
static_assert(sizeof(OnHurt_Base_C_AttackerBind) == 0x000008, "Wrong size on OnHurt_Base_C_AttackerBind");
static_assert(offsetof(OnHurt_Base_C_AttackerBind, BindTarget) == 0x000000, "Member 'OnHurt_Base_C_AttackerBind::BindTarget' has a wrong offset!");

// Function OnHurt_Base.OnHurt_Base_C.AttackerUnbind
// 0x0008 (0x0008 - 0x0000)
struct OnHurt_Base_C_AttackerUnbind final
{
public:
	class UAbilityComponentBase*                  BindTarget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OnHurt_Base_C_AttackerUnbind) == 0x000008, "Wrong alignment on OnHurt_Base_C_AttackerUnbind");
static_assert(sizeof(OnHurt_Base_C_AttackerUnbind) == 0x000008, "Wrong size on OnHurt_Base_C_AttackerUnbind");
static_assert(offsetof(OnHurt_Base_C_AttackerUnbind, BindTarget) == 0x000000, "Member 'OnHurt_Base_C_AttackerUnbind::BindTarget' has a wrong offset!");

// Function OnHurt_Base.OnHurt_Base_C.ReceiveDamage
// 0x00C0 (0x00C0 - 0x0000)
struct OnHurt_Base_C_ReceiveDamage final
{
public:
	struct FApplyDamageResultData                 DamageResultData;                                  // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(OnHurt_Base_C_ReceiveDamage) == 0x000008, "Wrong alignment on OnHurt_Base_C_ReceiveDamage");
static_assert(sizeof(OnHurt_Base_C_ReceiveDamage) == 0x0000C0, "Wrong size on OnHurt_Base_C_ReceiveDamage");
static_assert(offsetof(OnHurt_Base_C_ReceiveDamage, DamageResultData) == 0x000000, "Member 'OnHurt_Base_C_ReceiveDamage::DamageResultData' has a wrong offset!");

// Function OnHurt_Base.OnHurt_Base_C.ApplyDamage
// 0x00C0 (0x00C0 - 0x0000)
struct OnHurt_Base_C_ApplyDamage final
{
public:
	struct FApplyDamageResultData                 DamageResultData;                                  // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(OnHurt_Base_C_ApplyDamage) == 0x000008, "Wrong alignment on OnHurt_Base_C_ApplyDamage");
static_assert(sizeof(OnHurt_Base_C_ApplyDamage) == 0x0000C0, "Wrong size on OnHurt_Base_C_ApplyDamage");
static_assert(offsetof(OnHurt_Base_C_ApplyDamage, DamageResultData) == 0x000000, "Member 'OnHurt_Base_C_ApplyDamage::DamageResultData' has a wrong offset!");

// Function OnHurt_Base.OnHurt_Base_C.OnNotifySummon
// 0x0008 (0x0008 - 0x0000)
struct OnHurt_Base_C_OnNotifySummon final
{
public:
	class AGameCharacter*                         Summon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OnHurt_Base_C_OnNotifySummon) == 0x000008, "Wrong alignment on OnHurt_Base_C_OnNotifySummon");
static_assert(sizeof(OnHurt_Base_C_OnNotifySummon) == 0x000008, "Wrong size on OnHurt_Base_C_OnNotifySummon");
static_assert(offsetof(OnHurt_Base_C_OnNotifySummon, Summon) == 0x000000, "Member 'OnHurt_Base_C_OnNotifySummon::Summon' has a wrong offset!");

// Function OnHurt_Base.OnHurt_Base_C.BindNotifySummon
// 0x0008 (0x0008 - 0x0000)
struct OnHurt_Base_C_BindNotifySummon final
{
public:
	class AGameCharacter*                         InCharacter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OnHurt_Base_C_BindNotifySummon) == 0x000008, "Wrong alignment on OnHurt_Base_C_BindNotifySummon");
static_assert(sizeof(OnHurt_Base_C_BindNotifySummon) == 0x000008, "Wrong size on OnHurt_Base_C_BindNotifySummon");
static_assert(offsetof(OnHurt_Base_C_BindNotifySummon, InCharacter) == 0x000000, "Member 'OnHurt_Base_C_BindNotifySummon::InCharacter' has a wrong offset!");

// Function OnHurt_Base.OnHurt_Base_C.UnbindNotifySummon
// 0x0008 (0x0008 - 0x0000)
struct OnHurt_Base_C_UnbindNotifySummon final
{
public:
	class AGameCharacter*                         InCharacter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OnHurt_Base_C_UnbindNotifySummon) == 0x000008, "Wrong alignment on OnHurt_Base_C_UnbindNotifySummon");
static_assert(sizeof(OnHurt_Base_C_UnbindNotifySummon) == 0x000008, "Wrong size on OnHurt_Base_C_UnbindNotifySummon");
static_assert(offsetof(OnHurt_Base_C_UnbindNotifySummon, InCharacter) == 0x000000, "Member 'OnHurt_Base_C_UnbindNotifySummon::InCharacter' has a wrong offset!");

// Function OnHurt_Base.OnHurt_Base_C.K2_BindEvent
// 0x0010 (0x0010 - 0x0000)
struct OnHurt_Base_C_K2_BindEvent final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OnHurt_Base_C_K2_BindEvent) == 0x000008, "Wrong alignment on OnHurt_Base_C_K2_BindEvent");
static_assert(sizeof(OnHurt_Base_C_K2_BindEvent) == 0x000010, "Wrong size on OnHurt_Base_C_K2_BindEvent");
static_assert(offsetof(OnHurt_Base_C_K2_BindEvent, InCurLauncher) == 0x000000, "Member 'OnHurt_Base_C_K2_BindEvent::InCurLauncher' has a wrong offset!");
static_assert(offsetof(OnHurt_Base_C_K2_BindEvent, InCurLauncherChara) == 0x000008, "Member 'OnHurt_Base_C_K2_BindEvent::InCurLauncherChara' has a wrong offset!");

// Function OnHurt_Base.OnHurt_Base_C.K2_UnbindEvent
// 0x0010 (0x0010 - 0x0000)
struct OnHurt_Base_C_K2_UnbindEvent final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OnHurt_Base_C_K2_UnbindEvent) == 0x000008, "Wrong alignment on OnHurt_Base_C_K2_UnbindEvent");
static_assert(sizeof(OnHurt_Base_C_K2_UnbindEvent) == 0x000010, "Wrong size on OnHurt_Base_C_K2_UnbindEvent");
static_assert(offsetof(OnHurt_Base_C_K2_UnbindEvent, InCurLauncher) == 0x000000, "Member 'OnHurt_Base_C_K2_UnbindEvent::InCurLauncher' has a wrong offset!");
static_assert(offsetof(OnHurt_Base_C_K2_UnbindEvent, InCurLauncherChara) == 0x000008, "Member 'OnHurt_Base_C_K2_UnbindEvent::InCurLauncherChara' has a wrong offset!");

// Function OnHurt_Base.OnHurt_Base_C.ExecuteUbergraph_OnHurt_Base
// 0x0340 (0x0340 - 0x0000)
struct OnHurt_Base_C_ExecuteUbergraph_OnHurt_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_2;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGameCharacter* Summon)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         ___int_Loop_Counter_Variable_2;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_3;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_3;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FApplyDamageResultData& DamageResultData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_CustomEvent_BindTarget_3;                   // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponentBase*                  K2Node_CustomEvent_BindTarget_2;                   // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_CustomEvent_BindTarget_1;                   // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_CustomEvent_BindTarget;                     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FApplyDamageResultData                 K2Node_CustomEvent_DamageResultData_1;             // 0x0090(0x00C0)(ConstParm, ContainsInstancedReference)
	struct FApplyDamageResultData                 K2Node_CustomEvent_DamageResultData;               // 0x0150(0x00C0)(ConstParm, ContainsInstancedReference)
	class AGameCharacter*                         CallFunc_GetOriginCharacter_ReturnValue;           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckDamageSpecialTagsType_ReturnValue;   // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAbilityCharacterInterface> CallFunc_GetAbilityComponent_self_CastInput;       // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilityComponentBase*                  CallFunc_GetAbilityComponent_ReturnValue;          // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         CallFunc_GetOriginCharacter_ReturnValue_1;         // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAbilityCharacterInterface> CallFunc_GetAbilityComponent_self_CastInput_1;     // 0x0248(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilityComponentBase*                  CallFunc_GetAbilityComponent_ReturnValue_1;        // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnReceiveNotify_bCastAllowed;             // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnReceiveNotify_bCastAllowed_1;           // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_262[0x2];                                      // 0x0262(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FApplyDamageResultData& DamageResultData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0264(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_CustomEvent_Summon;                         // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_CustomEvent_InCharacter_1;                  // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_CustomEvent_InCharacter;                    // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_Event_InCurLauncher_1;                      // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_InCurLauncherChara_1;                 // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AGameCharacter*>                 CallFunc_GetAllSummoned_OutAllSummoned;            // 0x02B0(0x0010)(ReferenceParm)
	class AGameCharacter*                         CallFunc_Array_Get_Item;                           // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CE[0x2];                                      // 0x02CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGameCharacter*>                 CallFunc_GetAllSummoned_OutAllSummoned_1;          // 0x02D0(0x0010)(ReferenceParm)
	class AGameCharacter*                         CallFunc_Array_Get_Item_1;                         // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EE[0x2];                                      // 0x02EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_Event_InCurLauncher;                        // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_InCurLauncherChara;                   // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AGameCharacter*>                 CallFunc_GetAllSummoned_OutAllSummoned_2;          // 0x0300(0x0010)(ReferenceParm)
	class AGameCharacter*                         CallFunc_Array_Get_Item_2;                         // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x031D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31E[0x2];                                      // 0x031E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGameCharacter*>                 CallFunc_GetAllSummoned_OutAllSummoned_3;          // 0x0320(0x0010)(ReferenceParm)
	class AGameCharacter*                         CallFunc_Array_Get_Item_3;                         // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x033D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OnHurt_Base_C_ExecuteUbergraph_OnHurt_Base) == 0x000008, "Wrong alignment on OnHurt_Base_C_ExecuteUbergraph_OnHurt_Base");
static_assert(sizeof(OnHurt_Base_C_ExecuteUbergraph_OnHurt_Base) == 0x000340, "Wrong size on OnHurt_Base_C_ExecuteUbergraph_OnHurt_Base");
static_assert(offsetof(OnHurt_Base_C_ExecuteUbergraph_OnHurt_Base, EntryPoint) == 0x000000, "Member 'OnHurt_Base_C_ExecuteUbergraph_OnHurt_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(OnHurt_Base_C_ExecuteUbergraph_OnHurt_Base, ___int_Loop_Counter_Variable) == 0x000004, "Member 'OnHurt_Base_C_ExecuteUbergraph_OnHurt_Base::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(OnHurt_Base_C_ExecuteUbergraph_OnHurt_Base, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'OnHurt_Base_C_ExecuteUbergraph_OnHurt_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
