#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnHurt_NormalAttackState

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function OnHurt_NormalAttackState.OnHurt_NormalAttackState_C.OnReceiveNotify
// 0x00C0 (0x00C0 - 0x0000)
struct OnHurt_NormalAttackState_C_OnReceiveNotify final
{
public:
	struct FApplyDamageResultData                 Damage_Result;                                     // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	bool                                          bCastAllowed;                                      // 0x00B8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCharacterActionStates_ReturnValue;   // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OnHurt_NormalAttackState_C_OnReceiveNotify) == 0x000008, "Wrong alignment on OnHurt_NormalAttackState_C_OnReceiveNotify");
static_assert(sizeof(OnHurt_NormalAttackState_C_OnReceiveNotify) == 0x0000C0, "Wrong size on OnHurt_NormalAttackState_C_OnReceiveNotify");
static_assert(offsetof(OnHurt_NormalAttackState_C_OnReceiveNotify, Damage_Result) == 0x000000, "Member 'OnHurt_NormalAttackState_C_OnReceiveNotify::Damage_Result' has a wrong offset!");
static_assert(offsetof(OnHurt_NormalAttackState_C_OnReceiveNotify, bCastAllowed) == 0x0000B8, "Member 'OnHurt_NormalAttackState_C_OnReceiveNotify::bCastAllowed' has a wrong offset!");
static_assert(offsetof(OnHurt_NormalAttackState_C_OnReceiveNotify, CallFunc_CheckCharacterActionStates_ReturnValue) == 0x0000B9, "Member 'OnHurt_NormalAttackState_C_OnReceiveNotify::CallFunc_CheckCharacterActionStates_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_NormalAttackState_C_OnReceiveNotify, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000BA, "Member 'OnHurt_NormalAttackState_C_OnReceiveNotify::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_NormalAttackState_C_OnReceiveNotify, CallFunc_Not_PreBool_ReturnValue) == 0x0000BB, "Member 'OnHurt_NormalAttackState_C_OnReceiveNotify::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_NormalAttackState_C_OnReceiveNotify, CallFunc_BooleanAND_ReturnValue) == 0x0000BC, "Member 'OnHurt_NormalAttackState_C_OnReceiveNotify::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_NormalAttackState_C_OnReceiveNotify, CallFunc_BooleanAND_ReturnValue_1) == 0x0000BD, "Member 'OnHurt_NormalAttackState_C_OnReceiveNotify::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function OnHurt_NormalAttackState.OnHurt_NormalAttackState_C.ExecuteUbergraph_OnHurt_NormalAttackState
// 0x0008 (0x0008 - 0x0000)
struct OnHurt_NormalAttackState_C_ExecuteUbergraph_OnHurt_NormalAttackState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OnHurt_NormalAttackState_C_ExecuteUbergraph_OnHurt_NormalAttackState) == 0x000004, "Wrong alignment on OnHurt_NormalAttackState_C_ExecuteUbergraph_OnHurt_NormalAttackState");
static_assert(sizeof(OnHurt_NormalAttackState_C_ExecuteUbergraph_OnHurt_NormalAttackState) == 0x000008, "Wrong size on OnHurt_NormalAttackState_C_ExecuteUbergraph_OnHurt_NormalAttackState");
static_assert(offsetof(OnHurt_NormalAttackState_C_ExecuteUbergraph_OnHurt_NormalAttackState, EntryPoint) == 0x000000, "Member 'OnHurt_NormalAttackState_C_ExecuteUbergraph_OnHurt_NormalAttackState::EntryPoint' has a wrong offset!");
static_assert(offsetof(OnHurt_NormalAttackState_C_ExecuteUbergraph_OnHurt_NormalAttackState, K2Node_SwitchString_CmpSuccess) == 0x000004, "Member 'OnHurt_NormalAttackState_C_ExecuteUbergraph_OnHurt_NormalAttackState::K2Node_SwitchString_CmpSuccess' has a wrong offset!");

}

