#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnHurt_HitType

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function OnHurt_HitType.OnHurt_HitType_C.Check Skill ID or Type
// 0x0028 (0x0028 - 0x0000)
struct OnHurt_HitType_C_Check_Skill_ID_or_Type final
{
public:
	class UAbilityComponentBase*                  Causer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InSkillId;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutValue;                                          // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetOriginCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         CallFunc_GetSummonedOwner_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckSkillClassType_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckSkillClassType_ReturnValue_1;        // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OnHurt_HitType_C_Check_Skill_ID_or_Type) == 0x000008, "Wrong alignment on OnHurt_HitType_C_Check_Skill_ID_or_Type");
static_assert(sizeof(OnHurt_HitType_C_Check_Skill_ID_or_Type) == 0x000028, "Wrong size on OnHurt_HitType_C_Check_Skill_ID_or_Type");
static_assert(offsetof(OnHurt_HitType_C_Check_Skill_ID_or_Type, Causer) == 0x000000, "Member 'OnHurt_HitType_C_Check_Skill_ID_or_Type::Causer' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_Check_Skill_ID_or_Type, InSkillId) == 0x000008, "Member 'OnHurt_HitType_C_Check_Skill_ID_or_Type::InSkillId' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_Check_Skill_ID_or_Type, OutValue) == 0x00000C, "Member 'OnHurt_HitType_C_Check_Skill_ID_or_Type::OutValue' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_Check_Skill_ID_or_Type, CallFunc_GetOriginCharacter_ReturnValue) == 0x000010, "Member 'OnHurt_HitType_C_Check_Skill_ID_or_Type::CallFunc_GetOriginCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_Check_Skill_ID_or_Type, CallFunc_GetSummonedOwner_ReturnValue) == 0x000018, "Member 'OnHurt_HitType_C_Check_Skill_ID_or_Type::CallFunc_GetSummonedOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_Check_Skill_ID_or_Type, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'OnHurt_HitType_C_Check_Skill_ID_or_Type::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_Check_Skill_ID_or_Type, CallFunc_CheckSkillClassType_ReturnValue) == 0x000021, "Member 'OnHurt_HitType_C_Check_Skill_ID_or_Type::CallFunc_CheckSkillClassType_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_Check_Skill_ID_or_Type, CallFunc_CheckSkillClassType_ReturnValue_1) == 0x000022, "Member 'OnHurt_HitType_C_Check_Skill_ID_or_Type::CallFunc_CheckSkillClassType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_Check_Skill_ID_or_Type, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000023, "Member 'OnHurt_HitType_C_Check_Skill_ID_or_Type::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_Check_Skill_ID_or_Type, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000024, "Member 'OnHurt_HitType_C_Check_Skill_ID_or_Type::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function OnHurt_HitType.OnHurt_HitType_C.OnReceiveNotify
// 0x00E0 (0x00E0 - 0x0000)
struct OnHurt_HitType_C_OnReceiveNotify final
{
public:
	struct FApplyDamageResultData                 Damage_Result;                                     // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	bool                                          bCastAllowed;                                      // 0x00B8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LocalSkillID;                                      // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalDamageOriginType;                             // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  LocalCauser;                                       // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckDamageSpecialTagsType_ReturnValue;   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Check_Skill_ID_or_Type_OutValue;          // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Check_Skill_ID_or_Type_OutValue_1;        // 0x00D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OnHurt_HitType_C_OnReceiveNotify) == 0x000008, "Wrong alignment on OnHurt_HitType_C_OnReceiveNotify");
static_assert(sizeof(OnHurt_HitType_C_OnReceiveNotify) == 0x0000E0, "Wrong size on OnHurt_HitType_C_OnReceiveNotify");
static_assert(offsetof(OnHurt_HitType_C_OnReceiveNotify, Damage_Result) == 0x000000, "Member 'OnHurt_HitType_C_OnReceiveNotify::Damage_Result' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_OnReceiveNotify, bCastAllowed) == 0x0000B8, "Member 'OnHurt_HitType_C_OnReceiveNotify::bCastAllowed' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_OnReceiveNotify, LocalSkillID) == 0x0000BC, "Member 'OnHurt_HitType_C_OnReceiveNotify::LocalSkillID' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_OnReceiveNotify, LocalDamageOriginType) == 0x0000C0, "Member 'OnHurt_HitType_C_OnReceiveNotify::LocalDamageOriginType' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_OnReceiveNotify, LocalCauser) == 0x0000C8, "Member 'OnHurt_HitType_C_OnReceiveNotify::LocalCauser' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_OnReceiveNotify, CallFunc_CheckDamageSpecialTagsType_ReturnValue) == 0x0000D0, "Member 'OnHurt_HitType_C_OnReceiveNotify::CallFunc_CheckDamageSpecialTagsType_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_OnReceiveNotify, CallFunc_Not_PreBool_ReturnValue) == 0x0000D1, "Member 'OnHurt_HitType_C_OnReceiveNotify::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_OnReceiveNotify, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000D2, "Member 'OnHurt_HitType_C_OnReceiveNotify::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_OnReceiveNotify, CallFunc_Check_Skill_ID_or_Type_OutValue) == 0x0000D3, "Member 'OnHurt_HitType_C_OnReceiveNotify::CallFunc_Check_Skill_ID_or_Type_OutValue' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_OnReceiveNotify, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000D4, "Member 'OnHurt_HitType_C_OnReceiveNotify::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_OnReceiveNotify, CallFunc_BooleanAND_ReturnValue) == 0x0000D5, "Member 'OnHurt_HitType_C_OnReceiveNotify::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_OnReceiveNotify, CallFunc_IsValid_ReturnValue) == 0x0000D6, "Member 'OnHurt_HitType_C_OnReceiveNotify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_OnReceiveNotify, CallFunc_Check_Skill_ID_or_Type_OutValue_1) == 0x0000D7, "Member 'OnHurt_HitType_C_OnReceiveNotify::CallFunc_Check_Skill_ID_or_Type_OutValue_1' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_OnReceiveNotify, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000D8, "Member 'OnHurt_HitType_C_OnReceiveNotify::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_OnReceiveNotify, CallFunc_BooleanAND_ReturnValue_1) == 0x0000D9, "Member 'OnHurt_HitType_C_OnReceiveNotify::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_OnReceiveNotify, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000DA, "Member 'OnHurt_HitType_C_OnReceiveNotify::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_OnReceiveNotify, CallFunc_BooleanOR_ReturnValue) == 0x0000DB, "Member 'OnHurt_HitType_C_OnReceiveNotify::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_OnReceiveNotify, CallFunc_IsValid_ReturnValue_1) == 0x0000DC, "Member 'OnHurt_HitType_C_OnReceiveNotify::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_OnReceiveNotify, K2Node_SwitchInteger_CmpSuccess) == 0x0000DD, "Member 'OnHurt_HitType_C_OnReceiveNotify::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function OnHurt_HitType.OnHurt_HitType_C.ExecuteUbergraph_OnHurt_HitType
// 0x0010 (0x0010 - 0x0000)
struct OnHurt_HitType_C_ExecuteUbergraph_OnHurt_HitType final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParamintValue_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSkillClassType_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OnHurt_HitType_C_ExecuteUbergraph_OnHurt_HitType) == 0x000004, "Wrong alignment on OnHurt_HitType_C_ExecuteUbergraph_OnHurt_HitType");
static_assert(sizeof(OnHurt_HitType_C_ExecuteUbergraph_OnHurt_HitType) == 0x000010, "Wrong size on OnHurt_HitType_C_ExecuteUbergraph_OnHurt_HitType");
static_assert(offsetof(OnHurt_HitType_C_ExecuteUbergraph_OnHurt_HitType, EntryPoint) == 0x000000, "Member 'OnHurt_HitType_C_ExecuteUbergraph_OnHurt_HitType::EntryPoint' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_ExecuteUbergraph_OnHurt_HitType, CallFunc_GetParamintValue_ReturnValue) == 0x000004, "Member 'OnHurt_HitType_C_ExecuteUbergraph_OnHurt_HitType::CallFunc_GetParamintValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_ExecuteUbergraph_OnHurt_HitType, CallFunc_GetSkillClassType_ReturnValue) == 0x000008, "Member 'OnHurt_HitType_C_ExecuteUbergraph_OnHurt_HitType::CallFunc_GetSkillClassType_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_HitType_C_ExecuteUbergraph_OnHurt_HitType, K2Node_SwitchString_CmpSuccess) == 0x00000C, "Member 'OnHurt_HitType_C_ExecuteUbergraph_OnHurt_HitType::K2Node_SwitchString_CmpSuccess' has a wrong offset!");

}

