#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnHurt_Crit

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function OnHurt_Crit.OnHurt_Crit_C.OnReceiveNotify
// 0x00C8 (0x00C8 - 0x0000)
struct OnHurt_Crit_C_OnReceiveNotify final
{
public:
	struct FApplyDamageResultData                 Damage_Result;                                     // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	bool                                          bCastAllowed;                                      // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckModifyResultFlag_ReturnValue;        // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_OnHurt_Crit_C_OnReceiveNotify;

// Function OnHurt_Crit.OnHurt_Crit_C.ExecuteUbergraph_OnHurt_Crit
// 0x0008 (0x0008 - 0x0000)
struct OnHurt_Crit_C_ExecuteUbergraph_OnHurt_Crit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetParamboolValue_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_OnHurt_Crit_C_ExecuteUbergraph_OnHurt_Crit;

}

