#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnHurt_HitType

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OnHurt_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass OnHurt_HitType.OnHurt_HitType_C
// 0x0018 (0x0130 - 0x0118)
class UOnHurt_HitType_C final : public UOnHurt_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_OnHurt_HitType_C;                   // 0x0118(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         SkillID;                                           // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SkillType;                                         // 0x0124(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DamageOriginType;                                  // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Check_Skill_ID_or_Type(class UAbilityComponentBase* Causer, int32 InSkillId, bool* OutValue);
	void OnReceiveNotify(const struct FApplyDamageResultData& Damage_Result, bool* bCastAllowed);
	void K2_InitCondition();
	void ExecuteUbergraph_OnHurt_HitType(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OnHurt_HitType_C">();
	}
	static class UOnHurt_HitType_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnHurt_HitType_C>();
	}
};
static_assert(alignof(UOnHurt_HitType_C) == 0x000008, "Wrong alignment on UOnHurt_HitType_C");
static_assert(sizeof(UOnHurt_HitType_C) == 0x000130, "Wrong size on UOnHurt_HitType_C");
static_assert(offsetof(UOnHurt_HitType_C, UberGraphFrame_OnHurt_HitType_C) == 0x000118, "Member 'UOnHurt_HitType_C::UberGraphFrame_OnHurt_HitType_C' has a wrong offset!");
static_assert(offsetof(UOnHurt_HitType_C, SkillID) == 0x000120, "Member 'UOnHurt_HitType_C::SkillID' has a wrong offset!");
static_assert(offsetof(UOnHurt_HitType_C, SkillType) == 0x000124, "Member 'UOnHurt_HitType_C::SkillType' has a wrong offset!");
static_assert(offsetof(UOnHurt_HitType_C, DamageOriginType) == 0x000128, "Member 'UOnHurt_HitType_C::DamageOriginType' has a wrong offset!");

}

