#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnHurt_CauseDead

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function OnHurt_CauseDead.OnHurt_CauseDead_C.CheckCharacterType
// 0x0010 (0x0010 - 0x0000)
struct OnHurt_CauseDead_C_CheckCharacterType final
{
public:
	class AGameCharacter*                         Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsCharacter;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAI_ReturnValue;                         // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSummon_ReturnValue;                     // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayer_ReturnValue;                     // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OnHurt_CauseDead_C_CheckCharacterType) == 0x000008, "Wrong alignment on OnHurt_CauseDead_C_CheckCharacterType");
static_assert(sizeof(OnHurt_CauseDead_C_CheckCharacterType) == 0x000010, "Wrong size on OnHurt_CauseDead_C_CheckCharacterType");
static_assert(offsetof(OnHurt_CauseDead_C_CheckCharacterType, Character) == 0x000000, "Member 'OnHurt_CauseDead_C_CheckCharacterType::Character' has a wrong offset!");
static_assert(offsetof(OnHurt_CauseDead_C_CheckCharacterType, bIsCharacter) == 0x000008, "Member 'OnHurt_CauseDead_C_CheckCharacterType::bIsCharacter' has a wrong offset!");
static_assert(offsetof(OnHurt_CauseDead_C_CheckCharacterType, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'OnHurt_CauseDead_C_CheckCharacterType::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_CauseDead_C_CheckCharacterType, CallFunc_IsAI_ReturnValue) == 0x00000A, "Member 'OnHurt_CauseDead_C_CheckCharacterType::CallFunc_IsAI_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_CauseDead_C_CheckCharacterType, CallFunc_IsSummon_ReturnValue) == 0x00000B, "Member 'OnHurt_CauseDead_C_CheckCharacterType::CallFunc_IsSummon_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_CauseDead_C_CheckCharacterType, CallFunc_IsPlayer_ReturnValue) == 0x00000C, "Member 'OnHurt_CauseDead_C_CheckCharacterType::CallFunc_IsPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_CauseDead_C_CheckCharacterType, CallFunc_BooleanOR_ReturnValue) == 0x00000D, "Member 'OnHurt_CauseDead_C_CheckCharacterType::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_CauseDead_C_CheckCharacterType, CallFunc_BooleanOR_ReturnValue_1) == 0x00000E, "Member 'OnHurt_CauseDead_C_CheckCharacterType::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function OnHurt_CauseDead.OnHurt_CauseDead_C.OnReceiveNotify
// 0x0100 (0x0100 - 0x0000)
struct OnHurt_CauseDead_C_OnReceiveNotify final
{
public:
	struct FApplyDamageResultData                 Damage_Result;                                     // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	bool                                          bCastAllowed;                                      // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAccessory_Destructible*                K2Node_DynamicCast_AsAccessory_Destructible;       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetOriginCharacter_ReturnValue;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         CallFunc_GetOriginCharacter_ReturnValue_1;         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCharacterType_bIsCharacter;          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCharacterType_bIsCharacter_1;        // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OnHurt_CauseDead_C_OnReceiveNotify) == 0x000008, "Wrong alignment on OnHurt_CauseDead_C_OnReceiveNotify");
static_assert(sizeof(OnHurt_CauseDead_C_OnReceiveNotify) == 0x000100, "Wrong size on OnHurt_CauseDead_C_OnReceiveNotify");
static_assert(offsetof(OnHurt_CauseDead_C_OnReceiveNotify, Damage_Result) == 0x000000, "Member 'OnHurt_CauseDead_C_OnReceiveNotify::Damage_Result' has a wrong offset!");
static_assert(offsetof(OnHurt_CauseDead_C_OnReceiveNotify, bCastAllowed) == 0x0000C0, "Member 'OnHurt_CauseDead_C_OnReceiveNotify::bCastAllowed' has a wrong offset!");
static_assert(offsetof(OnHurt_CauseDead_C_OnReceiveNotify, CallFunc_GetOwner_ReturnValue) == 0x0000C8, "Member 'OnHurt_CauseDead_C_OnReceiveNotify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_CauseDead_C_OnReceiveNotify, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x0000D0, "Member 'OnHurt_CauseDead_C_OnReceiveNotify::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_CauseDead_C_OnReceiveNotify, K2Node_DynamicCast_AsAccessory_Destructible) == 0x0000D8, "Member 'OnHurt_CauseDead_C_OnReceiveNotify::K2Node_DynamicCast_AsAccessory_Destructible' has a wrong offset!");
static_assert(offsetof(OnHurt_CauseDead_C_OnReceiveNotify, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'OnHurt_CauseDead_C_OnReceiveNotify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OnHurt_CauseDead_C_OnReceiveNotify, CallFunc_GetOriginCharacter_ReturnValue) == 0x0000E8, "Member 'OnHurt_CauseDead_C_OnReceiveNotify::CallFunc_GetOriginCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_CauseDead_C_OnReceiveNotify, CallFunc_GetOriginCharacter_ReturnValue_1) == 0x0000F0, "Member 'OnHurt_CauseDead_C_OnReceiveNotify::CallFunc_GetOriginCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OnHurt_CauseDead_C_OnReceiveNotify, CallFunc_CheckCharacterType_bIsCharacter) == 0x0000F8, "Member 'OnHurt_CauseDead_C_OnReceiveNotify::CallFunc_CheckCharacterType_bIsCharacter' has a wrong offset!");
static_assert(offsetof(OnHurt_CauseDead_C_OnReceiveNotify, CallFunc_CheckCharacterType_bIsCharacter_1) == 0x0000F9, "Member 'OnHurt_CauseDead_C_OnReceiveNotify::CallFunc_CheckCharacterType_bIsCharacter_1' has a wrong offset!");

// Function OnHurt_CauseDead.OnHurt_CauseDead_C.ExecuteUbergraph_OnHurt_CauseDead
// 0x0008 (0x0008 - 0x0000)
struct OnHurt_CauseDead_C_ExecuteUbergraph_OnHurt_CauseDead final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetParamboolValue_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetParamboolValue_ReturnValue_1;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetParamboolValue_ReturnValue_2;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetParamboolValue_ReturnValue_3;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OnHurt_CauseDead_C_ExecuteUbergraph_OnHurt_CauseDead) == 0x000004, "Wrong alignment on OnHurt_CauseDead_C_ExecuteUbergraph_OnHurt_CauseDead");
static_assert(sizeof(OnHurt_CauseDead_C_ExecuteUbergraph_OnHurt_CauseDead) == 0x000008, "Wrong size on OnHurt_CauseDead_C_ExecuteUbergraph_OnHurt_CauseDead");
static_assert(offsetof(OnHurt_CauseDead_C_ExecuteUbergraph_OnHurt_CauseDead, EntryPoint) == 0x000000, "Member 'OnHurt_CauseDead_C_ExecuteUbergraph_OnHurt_CauseDead::EntryPoint' has a wrong offset!");
static_assert(offsetof(OnHurt_CauseDead_C_ExecuteUbergraph_OnHurt_CauseDead, CallFunc_GetParamboolValue_ReturnValue) == 0x000004, "Member 'OnHurt_CauseDead_C_ExecuteUbergraph_OnHurt_CauseDead::CallFunc_GetParamboolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_CauseDead_C_ExecuteUbergraph_OnHurt_CauseDead, CallFunc_GetParamboolValue_ReturnValue_1) == 0x000005, "Member 'OnHurt_CauseDead_C_ExecuteUbergraph_OnHurt_CauseDead::CallFunc_GetParamboolValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OnHurt_CauseDead_C_ExecuteUbergraph_OnHurt_CauseDead, CallFunc_GetParamboolValue_ReturnValue_2) == 0x000006, "Member 'OnHurt_CauseDead_C_ExecuteUbergraph_OnHurt_CauseDead::CallFunc_GetParamboolValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OnHurt_CauseDead_C_ExecuteUbergraph_OnHurt_CauseDead, CallFunc_GetParamboolValue_ReturnValue_3) == 0x000007, "Member 'OnHurt_CauseDead_C_ExecuteUbergraph_OnHurt_CauseDead::CallFunc_GetParamboolValue_ReturnValue_3' has a wrong offset!");

}

