#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnHurt_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass OnHurt_Base.OnHurt_Base_C
// 0x0010 (0x0118 - 0x0108)
class UOnHurt_Base_C : public UCastConditionCheck
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bAttackerListen;                                   // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCheckSummon;                                      // 0x0111(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void CondtionCacheTarget(class UAbilityComponentBase* InCaster, class UAbilityComponentBase* InTarget);
	void OnReceiveNotify(const struct FApplyDamageResultData& Damage_Result, bool* bCastAllowed);
	void K2_InitCondition();
	void ReceiverBind(class UAbilityComponentBase* BindTarget);
	void ReceiverUnbind(class UAbilityComponentBase* BindTarget);
	void AttackerBind(class UAbilityComponentBase* BindTarget);
	void AttackerUnbind(class UAbilityComponentBase* BindTarget);
	void ReceiveDamage(const struct FApplyDamageResultData& DamageResultData);
	void ApplyDamage(const struct FApplyDamageResultData& DamageResultData);
	void OnNotifySummon(class AGameCharacter* Summon);
	void BindNotifySummon(class AGameCharacter* InCharacter);
	void UnbindNotifySummon(class AGameCharacter* InCharacter);
	void K2_BindEvent(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void K2_UnbindEvent(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void ExecuteUbergraph_OnHurt_Base(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OnHurt_Base_C">();
	}
	static class UOnHurt_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnHurt_Base_C>();
	}
};
static_assert(alignof(UOnHurt_Base_C) == 0x000008, "Wrong alignment on UOnHurt_Base_C");
static_assert(sizeof(UOnHurt_Base_C) == 0x000118, "Wrong size on UOnHurt_Base_C");
static_assert(offsetof(UOnHurt_Base_C, UberGraphFrame) == 0x000108, "Member 'UOnHurt_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOnHurt_Base_C, bAttackerListen) == 0x000110, "Member 'UOnHurt_Base_C::bAttackerListen' has a wrong offset!");
static_assert(offsetof(UOnHurt_Base_C, bCheckSummon) == 0x000111, "Member 'UOnHurt_Base_C::bCheckSummon' has a wrong offset!");

}

