#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnHurt_Modifier

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OnHurt_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass OnHurt_Modifier.OnHurt_Modifier_C
// 0x0028 (0x0140 - 0x0118)
class UOnHurt_Modifier_C final : public UOnHurt_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_OnHurt_Modifier_C;                  // 0x0118(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         ModifierID;                                        // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x0124(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bHave;                                             // 0x0125(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_126[0x2];                                      // 0x0126(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ClassTagName;                                      // 0x0128(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          CheckAttacker;                                     // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnReceiveNotify(const struct FApplyDamageResultData& Damage_Result, bool* bCastAllowed);
	void K2_InitCondition();
	void ExecuteUbergraph_OnHurt_Modifier(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("OnHurt_Modifier_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnHurt_Modifier_C")
	}
	static class UOnHurt_Modifier_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnHurt_Modifier_C>();
	}
};
DUMPER7_ASSERTS_UOnHurt_Modifier_C;

}

