#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnHurt_Crit

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function OnHurt_Crit.OnHurt_Crit_C.OnReceiveNotify
// 0x00C0 (0x00C0 - 0x0000)
struct OnHurt_Crit_C_OnReceiveNotify final
{
public:
	struct FApplyDamageResultData                 Damage_Result;                                     // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	bool                                          bCastAllowed;                                      // 0x00B8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckModifyResultFlag_ReturnValue;        // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OnHurt_Crit_C_OnReceiveNotify) == 0x000008, "Wrong alignment on OnHurt_Crit_C_OnReceiveNotify");
static_assert(sizeof(OnHurt_Crit_C_OnReceiveNotify) == 0x0000C0, "Wrong size on OnHurt_Crit_C_OnReceiveNotify");
static_assert(offsetof(OnHurt_Crit_C_OnReceiveNotify, Damage_Result) == 0x000000, "Member 'OnHurt_Crit_C_OnReceiveNotify::Damage_Result' has a wrong offset!");
static_assert(offsetof(OnHurt_Crit_C_OnReceiveNotify, bCastAllowed) == 0x0000B8, "Member 'OnHurt_Crit_C_OnReceiveNotify::bCastAllowed' has a wrong offset!");
static_assert(offsetof(OnHurt_Crit_C_OnReceiveNotify, CallFunc_CheckModifyResultFlag_ReturnValue) == 0x0000B9, "Member 'OnHurt_Crit_C_OnReceiveNotify::CallFunc_CheckModifyResultFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHurt_Crit_C_OnReceiveNotify, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x0000BA, "Member 'OnHurt_Crit_C_OnReceiveNotify::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function OnHurt_Crit.OnHurt_Crit_C.ExecuteUbergraph_OnHurt_Crit
// 0x0008 (0x0008 - 0x0000)
struct OnHurt_Crit_C_ExecuteUbergraph_OnHurt_Crit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetParamboolValue_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OnHurt_Crit_C_ExecuteUbergraph_OnHurt_Crit) == 0x000004, "Wrong alignment on OnHurt_Crit_C_ExecuteUbergraph_OnHurt_Crit");
static_assert(sizeof(OnHurt_Crit_C_ExecuteUbergraph_OnHurt_Crit) == 0x000008, "Wrong size on OnHurt_Crit_C_ExecuteUbergraph_OnHurt_Crit");
static_assert(offsetof(OnHurt_Crit_C_ExecuteUbergraph_OnHurt_Crit, EntryPoint) == 0x000000, "Member 'OnHurt_Crit_C_ExecuteUbergraph_OnHurt_Crit::EntryPoint' has a wrong offset!");
static_assert(offsetof(OnHurt_Crit_C_ExecuteUbergraph_OnHurt_Crit, CallFunc_GetParamboolValue_ReturnValue) == 0x000004, "Member 'OnHurt_Crit_C_ExecuteUbergraph_OnHurt_Crit::CallFunc_GetParamboolValue_ReturnValue' has a wrong offset!");

}

