#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OpenDoorEvent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function OpenDoorEvent.OpenDoorEvent_C.OpenEvent
// 0x0038 (0x0038 - 0x0000)
struct OpenDoorEvent_C_OpenEvent final
{
public:
	int32                                         ___int_Array_Index_Variable;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ALevelScriptActor*>              CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OpenDoorEvent_C_OpenEvent) == 0x000008, "Wrong alignment on OpenDoorEvent_C_OpenEvent");
static_assert(sizeof(OpenDoorEvent_C_OpenEvent) == 0x000038, "Wrong size on OpenDoorEvent_C_OpenEvent");
static_assert(offsetof(OpenDoorEvent_C_OpenEvent, ___int_Array_Index_Variable) == 0x000000, "Member 'OpenDoorEvent_C_OpenEvent::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(OpenDoorEvent_C_OpenEvent, ___int_Loop_Counter_Variable) == 0x000004, "Member 'OpenDoorEvent_C_OpenEvent::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(OpenDoorEvent_C_OpenEvent, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'OpenDoorEvent_C_OpenEvent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OpenDoorEvent_C_OpenEvent, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'OpenDoorEvent_C_OpenEvent::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(OpenDoorEvent_C_OpenEvent, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'OpenDoorEvent_C_OpenEvent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(OpenDoorEvent_C_OpenEvent, CallFunc_Array_Get_Item) == 0x000028, "Member 'OpenDoorEvent_C_OpenEvent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(OpenDoorEvent_C_OpenEvent, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'OpenDoorEvent_C_OpenEvent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function OpenDoorEvent.OpenDoorEvent_C.OnTrigger
// 0x0018 (0x0018 - 0x0000)
struct OpenDoorEvent_C_OnTrigger final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OpenDoorEvent_C_OnTrigger) == 0x000008, "Wrong alignment on OpenDoorEvent_C_OnTrigger");
static_assert(sizeof(OpenDoorEvent_C_OnTrigger) == 0x000018, "Wrong size on OpenDoorEvent_C_OnTrigger");
static_assert(offsetof(OpenDoorEvent_C_OnTrigger, ReturnValue) == 0x000000, "Member 'OpenDoorEvent_C_OnTrigger::ReturnValue' has a wrong offset!");
static_assert(offsetof(OpenDoorEvent_C_OnTrigger, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'OpenDoorEvent_C_OnTrigger::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(OpenDoorEvent_C_OnTrigger, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'OpenDoorEvent_C_OnTrigger::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function OpenDoorEvent.OpenDoorEvent_C.GetSpecialStaticDescription
// 0x0050 (0x0050 - 0x0000)
struct OpenDoorEvent_C_GetSpecialStaticDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(OpenDoorEvent_C_GetSpecialStaticDescription) == 0x000008, "Wrong alignment on OpenDoorEvent_C_GetSpecialStaticDescription");
static_assert(sizeof(OpenDoorEvent_C_GetSpecialStaticDescription) == 0x000050, "Wrong size on OpenDoorEvent_C_GetSpecialStaticDescription");
static_assert(offsetof(OpenDoorEvent_C_GetSpecialStaticDescription, ReturnValue) == 0x000000, "Member 'OpenDoorEvent_C_GetSpecialStaticDescription::ReturnValue' has a wrong offset!");
static_assert(offsetof(OpenDoorEvent_C_GetSpecialStaticDescription, CallFunc_Conv_FloatToString_ReturnValue) == 0x000010, "Member 'OpenDoorEvent_C_GetSpecialStaticDescription::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(OpenDoorEvent_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'OpenDoorEvent_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(OpenDoorEvent_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000030, "Member 'OpenDoorEvent_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OpenDoorEvent_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000040, "Member 'OpenDoorEvent_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");

}

