#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OpenTreasureBoxExecute

#include "Basic.hpp"


namespace SDK::Params
{

// Function OpenTreasureBoxExecute.OpenTreasureBoxExecute_C.FindBoxsByTag
// 0x0060 (0x0060 - 0x0000)
struct OpenTreasureBoxExecute_C_FindBoxsByTag final
{
public:
	TArray<class ATreasureBoxBase_C*>             Ret;                                               // 0x0000(0x0010)(Parm, OutParm)
	TArray<class ATreasureBoxBase_C*>             FindBoxs;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         ___int_Array_Index_Variable;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATreasureBoxBase_C*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATreasureBoxBase_C*                     CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OpenTreasureBoxExecute_C_FindBoxsByTag) == 0x000008, "Wrong alignment on OpenTreasureBoxExecute_C_FindBoxsByTag");
static_assert(sizeof(OpenTreasureBoxExecute_C_FindBoxsByTag) == 0x000060, "Wrong size on OpenTreasureBoxExecute_C_FindBoxsByTag");
static_assert(offsetof(OpenTreasureBoxExecute_C_FindBoxsByTag, Ret) == 0x000000, "Member 'OpenTreasureBoxExecute_C_FindBoxsByTag::Ret' has a wrong offset!");
static_assert(offsetof(OpenTreasureBoxExecute_C_FindBoxsByTag, FindBoxs) == 0x000010, "Member 'OpenTreasureBoxExecute_C_FindBoxsByTag::FindBoxs' has a wrong offset!");
static_assert(offsetof(OpenTreasureBoxExecute_C_FindBoxsByTag, ___int_Array_Index_Variable) == 0x000020, "Member 'OpenTreasureBoxExecute_C_FindBoxsByTag::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(OpenTreasureBoxExecute_C_FindBoxsByTag, ___int_Loop_Counter_Variable) == 0x000024, "Member 'OpenTreasureBoxExecute_C_FindBoxsByTag::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(OpenTreasureBoxExecute_C_FindBoxsByTag, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'OpenTreasureBoxExecute_C_FindBoxsByTag::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OpenTreasureBoxExecute_C_FindBoxsByTag, CallFunc_GetAllActorsOfClass_OutActors) == 0x000030, "Member 'OpenTreasureBoxExecute_C_FindBoxsByTag::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(OpenTreasureBoxExecute_C_FindBoxsByTag, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'OpenTreasureBoxExecute_C_FindBoxsByTag::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(OpenTreasureBoxExecute_C_FindBoxsByTag, CallFunc_Array_Get_Item) == 0x000048, "Member 'OpenTreasureBoxExecute_C_FindBoxsByTag::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(OpenTreasureBoxExecute_C_FindBoxsByTag, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'OpenTreasureBoxExecute_C_FindBoxsByTag::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OpenTreasureBoxExecute_C_FindBoxsByTag, CallFunc_Array_Add_ReturnValue) == 0x000054, "Member 'OpenTreasureBoxExecute_C_FindBoxsByTag::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(OpenTreasureBoxExecute_C_FindBoxsByTag, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000058, "Member 'OpenTreasureBoxExecute_C_FindBoxsByTag::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// LuaFunction OpenTreasureBoxExecute.OpenTreasureBoxExecute_C.GetDescription
// 0x0010 (0x0010 - 0x0000)
struct OpenTreasureBoxExecute_C_GetDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OpenTreasureBoxExecute_C_GetDescription) == 0x000008, "Wrong alignment on OpenTreasureBoxExecute_C_GetDescription");
static_assert(sizeof(OpenTreasureBoxExecute_C_GetDescription) == 0x000010, "Wrong size on OpenTreasureBoxExecute_C_GetDescription");
static_assert(offsetof(OpenTreasureBoxExecute_C_GetDescription, ReturnValue) == 0x000000, "Member 'OpenTreasureBoxExecute_C_GetDescription::ReturnValue' has a wrong offset!");

// Function OpenTreasureBoxExecute.OpenTreasureBoxExecute_C.GetSpecialStaticDescription
// 0x0050 (0x0050 - 0x0000)
struct OpenTreasureBoxExecute_C_GetSpecialStaticDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(OpenTreasureBoxExecute_C_GetSpecialStaticDescription) == 0x000008, "Wrong alignment on OpenTreasureBoxExecute_C_GetSpecialStaticDescription");
static_assert(sizeof(OpenTreasureBoxExecute_C_GetSpecialStaticDescription) == 0x000050, "Wrong size on OpenTreasureBoxExecute_C_GetSpecialStaticDescription");
static_assert(offsetof(OpenTreasureBoxExecute_C_GetSpecialStaticDescription, ReturnValue) == 0x000000, "Member 'OpenTreasureBoxExecute_C_GetSpecialStaticDescription::ReturnValue' has a wrong offset!");
static_assert(offsetof(OpenTreasureBoxExecute_C_GetSpecialStaticDescription, CallFunc_Conv_IntToString_ReturnValue) == 0x000010, "Member 'OpenTreasureBoxExecute_C_GetSpecialStaticDescription::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(OpenTreasureBoxExecute_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'OpenTreasureBoxExecute_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(OpenTreasureBoxExecute_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000030, "Member 'OpenTreasureBoxExecute_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OpenTreasureBoxExecute_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000040, "Member 'OpenTreasureBoxExecute_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");

// Function OpenTreasureBoxExecute.OpenTreasureBoxExecute_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct OpenTreasureBoxExecute_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(OpenTreasureBoxExecute_C_GetModuleName) == 0x000008, "Wrong alignment on OpenTreasureBoxExecute_C_GetModuleName");
static_assert(sizeof(OpenTreasureBoxExecute_C_GetModuleName) == 0x000010, "Wrong size on OpenTreasureBoxExecute_C_GetModuleName");
static_assert(offsetof(OpenTreasureBoxExecute_C_GetModuleName, ReturnValue) == 0x000000, "Member 'OpenTreasureBoxExecute_C_GetModuleName::ReturnValue' has a wrong offset!");

}

