#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OVRLipSync

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "OVRLipSync_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class OVRLipSync.OVRLipSyncActorComponentBase
// 0x0070 (0x0120 - 0x00B0)
class UOVRLipSyncActorComponentBase : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_             OnVisemesReady;                                    // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_C0[0x28];                                      // 0x00C0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            DBCurve;                                           // 0x00E8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F0[0x30];                                      // 0x00F0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AssignVisemesToMorphTargets(class USkeletalMeshComponent* Mesh, const TArray<class FString>& MorphTargetNames);
	void AssignVisemesToMorphTargets_Default(class USkeletalMeshComponent* Mesh);
	void SetEnableLipSync(bool Enable);

	const float GetLaughterScore() const;
	const TArray<class FString> GetVisemeNames() const;
	const TArray<float> GetVisemes() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OVRLipSyncActorComponentBase">();
	}
	static class UOVRLipSyncActorComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOVRLipSyncActorComponentBase>();
	}
};
static_assert(alignof(UOVRLipSyncActorComponentBase) == 0x000008, "Wrong alignment on UOVRLipSyncActorComponentBase");
static_assert(sizeof(UOVRLipSyncActorComponentBase) == 0x000120, "Wrong size on UOVRLipSyncActorComponentBase");
static_assert(offsetof(UOVRLipSyncActorComponentBase, OnVisemesReady) == 0x0000B0, "Member 'UOVRLipSyncActorComponentBase::OnVisemesReady' has a wrong offset!");
static_assert(offsetof(UOVRLipSyncActorComponentBase, DBCurve) == 0x0000E8, "Member 'UOVRLipSyncActorComponentBase::DBCurve' has a wrong offset!");

// Class OVRLipSync.OVRLipSyncFrameSequence
// 0x0030 (0x0058 - 0x0028)
class UOVRLipSyncFrameSequence final : public UObject
{
public:
	float                                         ResetMinTime;                                      // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ResetMaxTime;                                      // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         KeyFrameGenerateThre;                              // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ReplaceViseme;                                     // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FOVRLipSyncFrame>               FrameSequence;                                     // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OVRLipSyncFrameSequence">();
	}
	static class UOVRLipSyncFrameSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOVRLipSyncFrameSequence>();
	}
};
static_assert(alignof(UOVRLipSyncFrameSequence) == 0x000008, "Wrong alignment on UOVRLipSyncFrameSequence");
static_assert(sizeof(UOVRLipSyncFrameSequence) == 0x000058, "Wrong size on UOVRLipSyncFrameSequence");
static_assert(offsetof(UOVRLipSyncFrameSequence, ResetMinTime) == 0x000028, "Member 'UOVRLipSyncFrameSequence::ResetMinTime' has a wrong offset!");
static_assert(offsetof(UOVRLipSyncFrameSequence, ResetMaxTime) == 0x00002C, "Member 'UOVRLipSyncFrameSequence::ResetMaxTime' has a wrong offset!");
static_assert(offsetof(UOVRLipSyncFrameSequence, KeyFrameGenerateThre) == 0x000030, "Member 'UOVRLipSyncFrameSequence::KeyFrameGenerateThre' has a wrong offset!");
static_assert(offsetof(UOVRLipSyncFrameSequence, ReplaceViseme) == 0x000038, "Member 'UOVRLipSyncFrameSequence::ReplaceViseme' has a wrong offset!");
static_assert(offsetof(UOVRLipSyncFrameSequence, FrameSequence) == 0x000048, "Member 'UOVRLipSyncFrameSequence::FrameSequence' has a wrong offset!");

// Class OVRLipSync.OVRLipSyncPlaybackActorComponent
// 0x0048 (0x0168 - 0x0120)
class UOVRLipSyncPlaybackActorComponent final : public UOVRLipSyncActorComponentBase
{
public:
	class UOVRLipSyncFrameSequence*               Sequence;                                          // 0x0120(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAudioComponent*                        AudioComponent;                                    // 0x0128(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TWeakObjectPtr<class USkeletalMeshComponent>> SyncMeshComponentContainer;                        // 0x0130(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_140[0x28];                                     // 0x0140(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddLipSnycSkeletalMesh(class USkeletalMeshComponent* Mesh);
	void RemoveLipSnycSkeletalMesh(class USkeletalMeshComponent* Mesh);
	void SetPlaybackSequence(class UOVRLipSyncFrameSequence* InSequence);
	void Start(class UAudioComponent* InAudioComponent, class UOVRLipSyncFrameSequence* InSequence);
	void Start_WithID(int32 CharacterID, int32 InPlayingID, const class FString& VoiceID, const class FString& WwiseEvent, const class FString& VoiceLang, class UWwiseComponent* AudioPlayer);
	void Stop();
	void SyncLipMesh();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OVRLipSyncPlaybackActorComponent">();
	}
	static class UOVRLipSyncPlaybackActorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOVRLipSyncPlaybackActorComponent>();
	}
};
static_assert(alignof(UOVRLipSyncPlaybackActorComponent) == 0x000008, "Wrong alignment on UOVRLipSyncPlaybackActorComponent");
static_assert(sizeof(UOVRLipSyncPlaybackActorComponent) == 0x000168, "Wrong size on UOVRLipSyncPlaybackActorComponent");
static_assert(offsetof(UOVRLipSyncPlaybackActorComponent, Sequence) == 0x000120, "Member 'UOVRLipSyncPlaybackActorComponent::Sequence' has a wrong offset!");
static_assert(offsetof(UOVRLipSyncPlaybackActorComponent, AudioComponent) == 0x000128, "Member 'UOVRLipSyncPlaybackActorComponent::AudioComponent' has a wrong offset!");
static_assert(offsetof(UOVRLipSyncPlaybackActorComponent, SyncMeshComponentContainer) == 0x000130, "Member 'UOVRLipSyncPlaybackActorComponent::SyncMeshComponentContainer' has a wrong offset!");

}

