#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Panel_Cd_Animation_pc

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Panel_Cd_Animation_pc.Panel_Cd_Animation_pc_C
// 0x0040 (0x02C0 - 0x0280)
class UPanel_Cd_Animation_pc_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Player_click;                                      // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CD;                                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Direction_cd;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Direction_cd_1;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Direction_cd_2;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Direction_cd_3;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Direction_cd_4;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Play(bool bLoop);
	void CustomEvent_0();
	void Stop();
	void ExecuteUbergraph_Panel_Cd_Animation_pc(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Panel_Cd_Animation_pc_C">();
	}
	static class UPanel_Cd_Animation_pc_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPanel_Cd_Animation_pc_C>();
	}
};
static_assert(alignof(UPanel_Cd_Animation_pc_C) == 0x000008, "Wrong alignment on UPanel_Cd_Animation_pc_C");
static_assert(sizeof(UPanel_Cd_Animation_pc_C) == 0x0002C0, "Wrong size on UPanel_Cd_Animation_pc_C");
static_assert(offsetof(UPanel_Cd_Animation_pc_C, UberGraphFrame) == 0x000280, "Member 'UPanel_Cd_Animation_pc_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPanel_Cd_Animation_pc_C, Player_click) == 0x000288, "Member 'UPanel_Cd_Animation_pc_C::Player_click' has a wrong offset!");
static_assert(offsetof(UPanel_Cd_Animation_pc_C, CD) == 0x000290, "Member 'UPanel_Cd_Animation_pc_C::CD' has a wrong offset!");
static_assert(offsetof(UPanel_Cd_Animation_pc_C, Direction_cd) == 0x000298, "Member 'UPanel_Cd_Animation_pc_C::Direction_cd' has a wrong offset!");
static_assert(offsetof(UPanel_Cd_Animation_pc_C, Direction_cd_1) == 0x0002A0, "Member 'UPanel_Cd_Animation_pc_C::Direction_cd_1' has a wrong offset!");
static_assert(offsetof(UPanel_Cd_Animation_pc_C, Direction_cd_2) == 0x0002A8, "Member 'UPanel_Cd_Animation_pc_C::Direction_cd_2' has a wrong offset!");
static_assert(offsetof(UPanel_Cd_Animation_pc_C, Direction_cd_3) == 0x0002B0, "Member 'UPanel_Cd_Animation_pc_C::Direction_cd_3' has a wrong offset!");
static_assert(offsetof(UPanel_Cd_Animation_pc_C, Direction_cd_4) == 0x0002B8, "Member 'UPanel_Cd_Animation_pc_C::Direction_cd_4' has a wrong offset!");

}

