#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Panel_Cd_Animation

#include "Basic.hpp"

#include "Game_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Panel_Cd_Animation.Panel_Cd_Animation_C
// 0x0040 (0x0388 - 0x0348)
class UPanel_Cd_Animation_C final : public UUserWidgetAnimation
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       player_click;                                      // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CD;                                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Direction_cd;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Direction_cd_1;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Direction_cd_2;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Direction_cd_3;                                    // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Direction_cd_4;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Panel_Cd_Animation(int32 EntryPoint);
	void K2_OnCustomUmgAnimFinished(const class FName& AnimName);
	void Stop();
	void Play(bool bLoop);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Panel_Cd_Animation_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Panel_Cd_Animation_C")
	}
	static class UPanel_Cd_Animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPanel_Cd_Animation_C>();
	}
};
DUMPER7_ASSERTS_UPanel_Cd_Animation_C;

}

