#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Panel_Cd_Animation

#include "Basic.hpp"


namespace SDK::Params
{

// Function Panel_Cd_Animation.Panel_Cd_Animation_C.ExecuteUbergraph_Panel_Cd_Animation
// 0x0014 (0x0014 - 0x0000)
struct Panel_Cd_Animation_C_ExecuteUbergraph_Panel_Cd_Animation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bLoop;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_AnimName;                             // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_Panel_Cd_Animation_C_ExecuteUbergraph_Panel_Cd_Animation;

// Function Panel_Cd_Animation.Panel_Cd_Animation_C.K2_OnCustomUmgAnimFinished
// 0x0008 (0x0008 - 0x0000)
struct Panel_Cd_Animation_C_K2_OnCustomUmgAnimFinished final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Panel_Cd_Animation_C_K2_OnCustomUmgAnimFinished;

// Function Panel_Cd_Animation.Panel_Cd_Animation_C.Play
// 0x0001 (0x0001 - 0x0000)
struct Panel_Cd_Animation_C_Play final
{
public:
	bool                                          bLoop;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_Panel_Cd_Animation_C_Play;

}

