#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Panel_Boss_Buff

#include "Basic.hpp"


namespace SDK::Params
{

// Function Panel_Boss_Buff.Panel_Boss_Buff_C.PlayAnim
// 0x0008 (0x0008 - 0x0000)
struct Panel_Boss_Buff_C_PlayAnim final
{
public:
	class UWidgetAnimation*                       InAnim;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Panel_Boss_Buff_C_PlayAnim) == 0x000008, "Wrong alignment on Panel_Boss_Buff_C_PlayAnim");
static_assert(sizeof(Panel_Boss_Buff_C_PlayAnim) == 0x000008, "Wrong size on Panel_Boss_Buff_C_PlayAnim");
static_assert(offsetof(Panel_Boss_Buff_C_PlayAnim, InAnim) == 0x000000, "Member 'Panel_Boss_Buff_C_PlayAnim::InAnim' has a wrong offset!");

// Function Panel_Boss_Buff.Panel_Boss_Buff_C.Get_Group_Buff_1_ToolTipWidget_0
// 0x0008 (0x0008 - 0x0000)
struct Panel_Boss_Buff_C_Get_Group_Buff_1_ToolTipWidget_0 final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Panel_Boss_Buff_C_Get_Group_Buff_1_ToolTipWidget_0) == 0x000008, "Wrong alignment on Panel_Boss_Buff_C_Get_Group_Buff_1_ToolTipWidget_0");
static_assert(sizeof(Panel_Boss_Buff_C_Get_Group_Buff_1_ToolTipWidget_0) == 0x000008, "Wrong size on Panel_Boss_Buff_C_Get_Group_Buff_1_ToolTipWidget_0");
static_assert(offsetof(Panel_Boss_Buff_C_Get_Group_Buff_1_ToolTipWidget_0, ReturnValue) == 0x000000, "Member 'Panel_Boss_Buff_C_Get_Group_Buff_1_ToolTipWidget_0::ReturnValue' has a wrong offset!");

// Function Panel_Boss_Buff.Panel_Boss_Buff_C.K2_PlayFinish
// 0x0001 (0x0001 - 0x0000)
struct Panel_Boss_Buff_C_K2_PlayFinish final
{
public:
	bool                                          bReset;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Panel_Boss_Buff_C_K2_PlayFinish) == 0x000001, "Wrong alignment on Panel_Boss_Buff_C_K2_PlayFinish");
static_assert(sizeof(Panel_Boss_Buff_C_K2_PlayFinish) == 0x000001, "Wrong size on Panel_Boss_Buff_C_K2_PlayFinish");
static_assert(offsetof(Panel_Boss_Buff_C_K2_PlayFinish, bReset) == 0x000000, "Member 'Panel_Boss_Buff_C_K2_PlayFinish::bReset' has a wrong offset!");

// Function Panel_Boss_Buff.Panel_Boss_Buff_C.K2_OnSkillBlockup
// 0x0001 (0x0001 - 0x0000)
struct Panel_Boss_Buff_C_K2_OnSkillBlockup final
{
public:
	bool                                          bBlockup;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Panel_Boss_Buff_C_K2_OnSkillBlockup) == 0x000001, "Wrong alignment on Panel_Boss_Buff_C_K2_OnSkillBlockup");
static_assert(sizeof(Panel_Boss_Buff_C_K2_OnSkillBlockup) == 0x000001, "Wrong size on Panel_Boss_Buff_C_K2_OnSkillBlockup");
static_assert(offsetof(Panel_Boss_Buff_C_K2_OnSkillBlockup, bBlockup) == 0x000000, "Member 'Panel_Boss_Buff_C_K2_OnSkillBlockup::bBlockup' has a wrong offset!");

// Function Panel_Boss_Buff.Panel_Boss_Buff_C.ExecuteUbergraph_Panel_Boss_Buff
// 0x0008 (0x0008 - 0x0000)
struct Panel_Boss_Buff_C_ExecuteUbergraph_Panel_Boss_Buff final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bReset;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bBlockup;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Panel_Boss_Buff_C_ExecuteUbergraph_Panel_Boss_Buff) == 0x000004, "Wrong alignment on Panel_Boss_Buff_C_ExecuteUbergraph_Panel_Boss_Buff");
static_assert(sizeof(Panel_Boss_Buff_C_ExecuteUbergraph_Panel_Boss_Buff) == 0x000008, "Wrong size on Panel_Boss_Buff_C_ExecuteUbergraph_Panel_Boss_Buff");
static_assert(offsetof(Panel_Boss_Buff_C_ExecuteUbergraph_Panel_Boss_Buff, EntryPoint) == 0x000000, "Member 'Panel_Boss_Buff_C_ExecuteUbergraph_Panel_Boss_Buff::EntryPoint' has a wrong offset!");
static_assert(offsetof(Panel_Boss_Buff_C_ExecuteUbergraph_Panel_Boss_Buff, K2Node_Event_bReset) == 0x000004, "Member 'Panel_Boss_Buff_C_ExecuteUbergraph_Panel_Boss_Buff::K2Node_Event_bReset' has a wrong offset!");
static_assert(offsetof(Panel_Boss_Buff_C_ExecuteUbergraph_Panel_Boss_Buff, K2Node_Event_bBlockup) == 0x000005, "Member 'Panel_Boss_Buff_C_ExecuteUbergraph_Panel_Boss_Buff::K2Node_Event_bBlockup' has a wrong offset!");

}

