#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Panel_Cd_Animation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Panel_Cd_Animation.Panel_Cd_Animation_C
// 0x0040 (0x0388 - 0x0348)
class UPanel_Cd_Animation_C final : public UUserWidgetAnimation
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Player_click;                                      // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CD;                                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Direction_cd;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Direction_cd_1;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Direction_cd_2;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Direction_cd_3;                                    // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Direction_cd_4;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Stop();
	void Play(bool bLoop);
	void K2_OnCustomUmgAnimFinished(const class FName& AnimName);
	void ExecuteUbergraph_Panel_Cd_Animation(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Panel_Cd_Animation_C">();
	}
	static class UPanel_Cd_Animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPanel_Cd_Animation_C>();
	}
};
static_assert(alignof(UPanel_Cd_Animation_C) == 0x000008, "Wrong alignment on UPanel_Cd_Animation_C");
static_assert(sizeof(UPanel_Cd_Animation_C) == 0x000388, "Wrong size on UPanel_Cd_Animation_C");
static_assert(offsetof(UPanel_Cd_Animation_C, UberGraphFrame) == 0x000348, "Member 'UPanel_Cd_Animation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPanel_Cd_Animation_C, Player_click) == 0x000350, "Member 'UPanel_Cd_Animation_C::Player_click' has a wrong offset!");
static_assert(offsetof(UPanel_Cd_Animation_C, CD) == 0x000358, "Member 'UPanel_Cd_Animation_C::CD' has a wrong offset!");
static_assert(offsetof(UPanel_Cd_Animation_C, Direction_cd) == 0x000360, "Member 'UPanel_Cd_Animation_C::Direction_cd' has a wrong offset!");
static_assert(offsetof(UPanel_Cd_Animation_C, Direction_cd_1) == 0x000368, "Member 'UPanel_Cd_Animation_C::Direction_cd_1' has a wrong offset!");
static_assert(offsetof(UPanel_Cd_Animation_C, Direction_cd_2) == 0x000370, "Member 'UPanel_Cd_Animation_C::Direction_cd_2' has a wrong offset!");
static_assert(offsetof(UPanel_Cd_Animation_C, Direction_cd_3) == 0x000378, "Member 'UPanel_Cd_Animation_C::Direction_cd_3' has a wrong offset!");
static_assert(offsetof(UPanel_Cd_Animation_C, Direction_cd_4) == 0x000380, "Member 'UPanel_Cd_Animation_C::Direction_cd_4' has a wrong offset!");

}

