#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Panel_Monster_Buff

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Panel_Monster_Buff.Panel_Monster_Buff_C
// 0x0050 (0x0428 - 0x03D8)
class UPanel_Monster_Buff_C final : public UMonsterItemBuf
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Silent;                                            // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Interrupt;                                         // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reset;                                             // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCustomText*                            CustomText_361;                                    // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_3;                                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_170;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgSkillBG;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgSklllBG2;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Mask_2;                                            // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Panel_Monster_Buff(int32 EntryPoint);
	void BP_OnEntryReleased_1();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void K2_OnCustomUmgAnimFinished(const class FName& AnimName);
	void K2_OnSkillBlockup(bool bInBlockUp);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Panel_Monster_Buff_C">();
	}
	static class UPanel_Monster_Buff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPanel_Monster_Buff_C>();
	}
};
static_assert(alignof(UPanel_Monster_Buff_C) == 0x000008, "Wrong alignment on UPanel_Monster_Buff_C");
static_assert(sizeof(UPanel_Monster_Buff_C) == 0x000428, "Wrong size on UPanel_Monster_Buff_C");
static_assert(offsetof(UPanel_Monster_Buff_C, UberGraphFrame) == 0x0003D8, "Member 'UPanel_Monster_Buff_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPanel_Monster_Buff_C, Silent) == 0x0003E0, "Member 'UPanel_Monster_Buff_C::Silent' has a wrong offset!");
static_assert(offsetof(UPanel_Monster_Buff_C, Interrupt) == 0x0003E8, "Member 'UPanel_Monster_Buff_C::Interrupt' has a wrong offset!");
static_assert(offsetof(UPanel_Monster_Buff_C, Reset) == 0x0003F0, "Member 'UPanel_Monster_Buff_C::Reset' has a wrong offset!");
static_assert(offsetof(UPanel_Monster_Buff_C, CustomText_361) == 0x0003F8, "Member 'UPanel_Monster_Buff_C::CustomText_361' has a wrong offset!");
static_assert(offsetof(UPanel_Monster_Buff_C, Image_3) == 0x000400, "Member 'UPanel_Monster_Buff_C::Image_3' has a wrong offset!");
static_assert(offsetof(UPanel_Monster_Buff_C, Image_170) == 0x000408, "Member 'UPanel_Monster_Buff_C::Image_170' has a wrong offset!");
static_assert(offsetof(UPanel_Monster_Buff_C, ImgSkillBG) == 0x000410, "Member 'UPanel_Monster_Buff_C::ImgSkillBG' has a wrong offset!");
static_assert(offsetof(UPanel_Monster_Buff_C, ImgSklllBG2) == 0x000418, "Member 'UPanel_Monster_Buff_C::ImgSklllBG2' has a wrong offset!");
static_assert(offsetof(UPanel_Monster_Buff_C, Mask_2) == 0x000420, "Member 'UPanel_Monster_Buff_C::Mask_2' has a wrong offset!");

}

