#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Panel_Monster_Buff

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function Panel_Monster_Buff.Panel_Monster_Buff_C.ExecuteUbergraph_Panel_Monster_Buff
// 0x004C (0x004C - 0x0000)
struct Panel_Monster_Buff_C_ExecuteUbergraph_Panel_Monster_Buff final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInBlockup;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_AnimName;                             // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Panel_Monster_Buff_C_ExecuteUbergraph_Panel_Monster_Buff;

// Function Panel_Monster_Buff.Panel_Monster_Buff_C.Tick
// 0x003C (0x003C - 0x0000)
struct Panel_Monster_Buff_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Panel_Monster_Buff_C_Tick;

// Function Panel_Monster_Buff.Panel_Monster_Buff_C.K2_OnCustomUmgAnimFinished
// 0x0008 (0x0008 - 0x0000)
struct Panel_Monster_Buff_C_K2_OnCustomUmgAnimFinished final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Panel_Monster_Buff_C_K2_OnCustomUmgAnimFinished;

// Function Panel_Monster_Buff.Panel_Monster_Buff_C.K2_OnSkillBlockup
// 0x0001 (0x0001 - 0x0000)
struct Panel_Monster_Buff_C_K2_OnSkillBlockup final
{
public:
	bool                                          bInBlockUp;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_Panel_Monster_Buff_C_K2_OnSkillBlockup;

}

