#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Panel_Boss_Buff

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Panel_Boss_Buff.Panel_Boss_Buff_C
// 0x0060 (0x0410 - 0x03B0)
class UPanel_Boss_Buff_C final : public UFightBossBuff
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Interrupt;                                         // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Silent;                                            // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reset;                                             // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Finish;                                            // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCustomText*                            CustomText_361;                                    // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_3;                                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_170;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgSklllBG2;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Mask_2;                                            // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     Text_Buff_1;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_Panel_Boss_Buff_data_C*             Data;                                              // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PlayAnim(class UWidgetAnimation* InAnim);
	class UWidget* Get_Group_Buff_1_ToolTipWidget_0();
	void Construct();
	void K2_PlayFinish(bool bReset);
	void K2_OnSkillBlockup(bool bBlockup);
	void ExecuteUbergraph_Panel_Boss_Buff(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Panel_Boss_Buff_C">();
	}
	static class UPanel_Boss_Buff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPanel_Boss_Buff_C>();
	}
};
static_assert(alignof(UPanel_Boss_Buff_C) == 0x000008, "Wrong alignment on UPanel_Boss_Buff_C");
static_assert(sizeof(UPanel_Boss_Buff_C) == 0x000410, "Wrong size on UPanel_Boss_Buff_C");
static_assert(offsetof(UPanel_Boss_Buff_C, UberGraphFrame) == 0x0003B0, "Member 'UPanel_Boss_Buff_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPanel_Boss_Buff_C, Interrupt) == 0x0003B8, "Member 'UPanel_Boss_Buff_C::Interrupt' has a wrong offset!");
static_assert(offsetof(UPanel_Boss_Buff_C, Silent) == 0x0003C0, "Member 'UPanel_Boss_Buff_C::Silent' has a wrong offset!");
static_assert(offsetof(UPanel_Boss_Buff_C, Reset) == 0x0003C8, "Member 'UPanel_Boss_Buff_C::Reset' has a wrong offset!");
static_assert(offsetof(UPanel_Boss_Buff_C, Finish) == 0x0003D0, "Member 'UPanel_Boss_Buff_C::Finish' has a wrong offset!");
static_assert(offsetof(UPanel_Boss_Buff_C, CustomText_361) == 0x0003D8, "Member 'UPanel_Boss_Buff_C::CustomText_361' has a wrong offset!");
static_assert(offsetof(UPanel_Boss_Buff_C, Image_3) == 0x0003E0, "Member 'UPanel_Boss_Buff_C::Image_3' has a wrong offset!");
static_assert(offsetof(UPanel_Boss_Buff_C, Image_170) == 0x0003E8, "Member 'UPanel_Boss_Buff_C::Image_170' has a wrong offset!");
static_assert(offsetof(UPanel_Boss_Buff_C, ImgSklllBG2) == 0x0003F0, "Member 'UPanel_Boss_Buff_C::ImgSklllBG2' has a wrong offset!");
static_assert(offsetof(UPanel_Boss_Buff_C, Mask_2) == 0x0003F8, "Member 'UPanel_Boss_Buff_C::Mask_2' has a wrong offset!");
static_assert(offsetof(UPanel_Boss_Buff_C, Text_Buff_1) == 0x000400, "Member 'UPanel_Boss_Buff_C::Text_Buff_1' has a wrong offset!");
static_assert(offsetof(UPanel_Boss_Buff_C, Data) == 0x000408, "Member 'UPanel_Boss_Buff_C::Data' has a wrong offset!");

}

