#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerformanceOptimizationBulletScreenBasedBluePrint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PerformanceOptimizationBulletScreenBasedBluePrint.PerformanceOptimizationBulletScreenBasedBlueprint_C.ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint
// 0x0210 (0x0210 - 0x0000)
struct PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_InHitPos;                             // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_InHitNormal;                          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemManager*                 CallFunc_GetPtr_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemManager*                 CallFunc_GetPtr_ReturnValue_1;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0040(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompositeAtLocation_ReturnValue;          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SpawnCompositeAtLocation_ReturnValue;     // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemManager*                 CallFunc_GetPtr_ReturnValue_2;                     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemManager*                 CallFunc_GetPtr_ReturnValue_3;                     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x00C0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SpawnCompositeAtLocation_ReturnValue_1;   // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SpawnCompositeAtLocation_ReturnValue_2;   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_CustomEvent_BulletGenerate;                 // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_CustomEvent_Bullet;                         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_CustomEvent_BulletHit;                      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABullet*>                        K2Node_CustomEvent_BulletsArray;                   // 0x0140(0x0010)(ConstParm, ReferenceParm)
	class UParticleSystemManager*                 CallFunc_GetPtr_ReturnValue_4;                     // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABullet*                                CallFunc_Array_Get_Item;                           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABullet*                                K2Node_CustomEvent_SingleBullet;                   // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemManager*                 CallFunc_GetPtr_ReturnValue_5;                     // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemManager*                 CallFunc_GetPtr_ReturnValue_6;                     // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_2;               // 0x0190(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location_2;                // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_2;                // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_2;                   // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnAtLocation_ReturnValue;              // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      K2Node_DynamicCast_AsNiagara____;                  // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint) == 0x000010, "Wrong alignment on PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint");
static_assert(sizeof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint) == 0x000210, "Wrong size on PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, EntryPoint) == 0x000000, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, ___int_Array_Index_Variable) == 0x000004, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, ___int_Loop_Counter_Variable) == 0x000008, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000010, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, K2Node_Event_InHitPos) == 0x000014, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::K2Node_Event_InHitPos' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, K2Node_Event_InHitNormal) == 0x000020, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::K2Node_Event_InHitNormal' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00002C, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_GetPtr_ReturnValue) == 0x000030, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_GetPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_GetPtr_ReturnValue_1) == 0x000038, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_GetPtr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_GetTransform_ReturnValue) == 0x000040, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_BreakTransform_Location) == 0x000070, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_BreakTransform_Rotation) == 0x00007C, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_BreakTransform_Scale) == 0x000088, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_CompositeAtLocation_ReturnValue) == 0x000094, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_CompositeAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_SpawnCompositeAtLocation_ReturnValue) == 0x00009C, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_SpawnCompositeAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_GetPtr_ReturnValue_2) == 0x0000A0, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_GetPtr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000A8, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x0000A9, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_GetPtr_ReturnValue_3) == 0x0000B0, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_GetPtr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_GetTransform_ReturnValue_1) == 0x0000C0, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_IsValid_ReturnValue_1) == 0x0000F0, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_BreakTransform_Location_1) == 0x0000F4, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_BreakTransform_Rotation_1) == 0x000100, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_BreakTransform_Scale_1) == 0x00010C, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_SpawnCompositeAtLocation_ReturnValue_1) == 0x000118, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_SpawnCompositeAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_IsValid_ReturnValue_2) == 0x00011C, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_SpawnCompositeAtLocation_ReturnValue_2) == 0x000120, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_SpawnCompositeAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, K2Node_CustomEvent_BulletGenerate) == 0x000128, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::K2Node_CustomEvent_BulletGenerate' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, K2Node_CustomEvent_Bullet) == 0x000130, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::K2Node_CustomEvent_Bullet' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, K2Node_CustomEvent_BulletHit) == 0x000138, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::K2Node_CustomEvent_BulletHit' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, K2Node_CustomEvent_BulletsArray) == 0x000140, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::K2Node_CustomEvent_BulletsArray' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_GetPtr_ReturnValue_4) == 0x000150, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_GetPtr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_Array_Get_Item) == 0x000158, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_Array_Length_ReturnValue) == 0x000160, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, K2Node_CustomEvent_SingleBullet) == 0x000168, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::K2Node_CustomEvent_SingleBullet' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000170, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_Max_ReturnValue) == 0x000174, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_GetPtr_ReturnValue_5) == 0x000178, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_GetPtr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_LessEqual_IntInt_ReturnValue_3) == 0x000180, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_LessEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_GetPtr_ReturnValue_6) == 0x000188, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_GetPtr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_GetTransform_ReturnValue_2) == 0x000190, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_GetTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_IsValid_ReturnValue_3) == 0x0001C0, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_BreakTransform_Location_2) == 0x0001C4, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_BreakTransform_Location_2' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_BreakTransform_Rotation_2) == 0x0001D0, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_BreakTransform_Rotation_2' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_BreakTransform_Scale_2) == 0x0001DC, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_BreakTransform_Scale_2' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_SpawnAtLocation_ReturnValue) == 0x0001E8, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_SpawnAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, K2Node_DynamicCast_AsNiagara____) == 0x0001F0, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::K2Node_DynamicCast_AsNiagara____' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, K2Node_DynamicCast_bSuccess) == 0x0001F8, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_Add_IntInt_ReturnValue) == 0x0001FC, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_Array_Add_ReturnValue) == 0x000200, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint, CallFunc_Array_Add_ReturnValue_1) == 0x000204, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function PerformanceOptimizationBulletScreenBasedBluePrint.PerformanceOptimizationBulletScreenBasedBlueprint_C.AttachSingleBulletEffect
// 0x0008 (0x0008 - 0x0000)
struct PerformanceOptimizationBulletScreenBasedBlueprint_C_AttachSingleBulletEffect final
{
public:
	class ABullet*                                SingleBullet;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerformanceOptimizationBulletScreenBasedBlueprint_C_AttachSingleBulletEffect) == 0x000008, "Wrong alignment on PerformanceOptimizationBulletScreenBasedBlueprint_C_AttachSingleBulletEffect");
static_assert(sizeof(PerformanceOptimizationBulletScreenBasedBlueprint_C_AttachSingleBulletEffect) == 0x000008, "Wrong size on PerformanceOptimizationBulletScreenBasedBlueprint_C_AttachSingleBulletEffect");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_AttachSingleBulletEffect, SingleBullet) == 0x000000, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_AttachSingleBulletEffect::SingleBullet' has a wrong offset!");

// Function PerformanceOptimizationBulletScreenBasedBluePrint.PerformanceOptimizationBulletScreenBasedBlueprint_C.AttachArrayBulletsEffect
// 0x0010 (0x0010 - 0x0000)
struct PerformanceOptimizationBulletScreenBasedBlueprint_C_AttachArrayBulletsEffect final
{
public:
	TArray<class ABullet*>                        BulletsArray;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PerformanceOptimizationBulletScreenBasedBlueprint_C_AttachArrayBulletsEffect) == 0x000008, "Wrong alignment on PerformanceOptimizationBulletScreenBasedBlueprint_C_AttachArrayBulletsEffect");
static_assert(sizeof(PerformanceOptimizationBulletScreenBasedBlueprint_C_AttachArrayBulletsEffect) == 0x000010, "Wrong size on PerformanceOptimizationBulletScreenBasedBlueprint_C_AttachArrayBulletsEffect");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_AttachArrayBulletsEffect, BulletsArray) == 0x000000, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_AttachArrayBulletsEffect::BulletsArray' has a wrong offset!");

// Function PerformanceOptimizationBulletScreenBasedBluePrint.PerformanceOptimizationBulletScreenBasedBlueprint_C.SetNiagara
// 0x0018 (0x0018 - 0x0000)
struct PerformanceOptimizationBulletScreenBasedBlueprint_C_SetNiagara final
{
public:
	class UNiagaraSystem*                         BulletGenerate;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Bullet;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         BulletHit;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerformanceOptimizationBulletScreenBasedBlueprint_C_SetNiagara) == 0x000008, "Wrong alignment on PerformanceOptimizationBulletScreenBasedBlueprint_C_SetNiagara");
static_assert(sizeof(PerformanceOptimizationBulletScreenBasedBlueprint_C_SetNiagara) == 0x000018, "Wrong size on PerformanceOptimizationBulletScreenBasedBlueprint_C_SetNiagara");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_SetNiagara, BulletGenerate) == 0x000000, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_SetNiagara::BulletGenerate' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_SetNiagara, Bullet) == 0x000008, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_SetNiagara::Bullet' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_SetNiagara, BulletHit) == 0x000010, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_SetNiagara::BulletHit' has a wrong offset!");

// Function PerformanceOptimizationBulletScreenBasedBluePrint.PerformanceOptimizationBulletScreenBasedBlueprint_C.OnNotifyBulletHit
// 0x0018 (0x0018 - 0x0000)
struct PerformanceOptimizationBulletScreenBasedBlueprint_C_OnNotifyBulletHit final
{
public:
	struct FVector                                InHitPos;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InHitNormal;                                       // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerformanceOptimizationBulletScreenBasedBlueprint_C_OnNotifyBulletHit) == 0x000004, "Wrong alignment on PerformanceOptimizationBulletScreenBasedBlueprint_C_OnNotifyBulletHit");
static_assert(sizeof(PerformanceOptimizationBulletScreenBasedBlueprint_C_OnNotifyBulletHit) == 0x000018, "Wrong size on PerformanceOptimizationBulletScreenBasedBlueprint_C_OnNotifyBulletHit");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_OnNotifyBulletHit, InHitPos) == 0x000000, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_OnNotifyBulletHit::InHitPos' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_OnNotifyBulletHit, InHitNormal) == 0x00000C, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_OnNotifyBulletHit::InHitNormal' has a wrong offset!");

// Function PerformanceOptimizationBulletScreenBasedBluePrint.PerformanceOptimizationBulletScreenBasedBlueprint_C.DoClearNiagara
// 0x0010 (0x0010 - 0x0000)
struct PerformanceOptimizationBulletScreenBasedBlueprint_C_DoClearNiagara final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemManager*                 CallFunc_GetPtr_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerformanceOptimizationBulletScreenBasedBlueprint_C_DoClearNiagara) == 0x000008, "Wrong alignment on PerformanceOptimizationBulletScreenBasedBlueprint_C_DoClearNiagara");
static_assert(sizeof(PerformanceOptimizationBulletScreenBasedBlueprint_C_DoClearNiagara) == 0x000010, "Wrong size on PerformanceOptimizationBulletScreenBasedBlueprint_C_DoClearNiagara");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_DoClearNiagara, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_DoClearNiagara::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_DoClearNiagara, CallFunc_GetPtr_ReturnValue) == 0x000008, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_DoClearNiagara::CallFunc_GetPtr_ReturnValue' has a wrong offset!");

// Function PerformanceOptimizationBulletScreenBasedBluePrint.PerformanceOptimizationBulletScreenBasedBlueprint_C.UpdateBuletInfoToNiagara
// 0x0008 (0x0008 - 0x0000)
struct PerformanceOptimizationBulletScreenBasedBlueprint_C_UpdateBuletInfoToNiagara final
{
public:
	class UParticleSystemManager*                 CallFunc_GetPtr_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerformanceOptimizationBulletScreenBasedBlueprint_C_UpdateBuletInfoToNiagara) == 0x000008, "Wrong alignment on PerformanceOptimizationBulletScreenBasedBlueprint_C_UpdateBuletInfoToNiagara");
static_assert(sizeof(PerformanceOptimizationBulletScreenBasedBlueprint_C_UpdateBuletInfoToNiagara) == 0x000008, "Wrong size on PerformanceOptimizationBulletScreenBasedBlueprint_C_UpdateBuletInfoToNiagara");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_UpdateBuletInfoToNiagara, CallFunc_GetPtr_ReturnValue) == 0x000000, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_UpdateBuletInfoToNiagara::CallFunc_GetPtr_ReturnValue' has a wrong offset!");

// Function PerformanceOptimizationBulletScreenBasedBluePrint.PerformanceOptimizationBulletScreenBasedBlueprint_C.BulletSpawnEffect
// 0x0028 (0x0028 - 0x0000)
struct PerformanceOptimizationBulletScreenBasedBlueprint_C_BulletSpawnEffect final
{
public:
	struct FVector                                Pos;                                               // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Rot;                                               // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemManager*                 CallFunc_GetPtr_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompositeAtLocation_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerformanceOptimizationBulletScreenBasedBlueprint_C_BulletSpawnEffect) == 0x000008, "Wrong alignment on PerformanceOptimizationBulletScreenBasedBlueprint_C_BulletSpawnEffect");
static_assert(sizeof(PerformanceOptimizationBulletScreenBasedBlueprint_C_BulletSpawnEffect) == 0x000028, "Wrong size on PerformanceOptimizationBulletScreenBasedBlueprint_C_BulletSpawnEffect");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_BulletSpawnEffect, Pos) == 0x000000, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_BulletSpawnEffect::Pos' has a wrong offset!");
static_assert(offsetof(PerformanceOptimizationBulletScreenBasedBlueprint_C_BulletSpawnEffect, Rot) == 0x00000C, "Member 'PerformanceOptimizationBulletScreenBasedBlueprint_C_BulletSpawnEffect::Rot' has a wrong offset!");
