#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerformanceOptimizationBulletScreenBasedBluePrint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PerformanceOptimizationBulletScreenBasedBluePrint.PerformanceOptimizationBulletScreenBasedBlueprint_C
// 0x0070 (0x0650 - 0x05E0)
class APerformanceOptimizationBulletScreenBasedBlueprint_C : public ABulletScreenReplicateEditor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxBulletCount;                                    // 0x05F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BulletCompositeId;                                 // 0x05F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BulletHitCompositeId;                              // 0x05F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BulletSpawnEffectCompositeId;                      // 0x05FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         BulletHitNiagaraEffect;                            // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         BulletNiagaraEffect;                               // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         BulletGenerateNiagaraEffect;                       // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BulletInfoFx;                                      // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BulletFxCount;                                     // 0x0620(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_624[0x4];                                      // 0x0624(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        Buffer_Position;                                   // 0x0628(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        Buffer_Forward;                                    // 0x0638(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bLaunchSpecialHitLogic;                            // 0x0648(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_PerformanceOptimizationBulletScreenBasedBlueprint(int32 EntryPoint);
	void AttachSingleBulletEffect(class ABullet* SingleBullet);
	void AttachArrayBulletsEffect(const TArray<class ABullet*>& BulletsArray);
	void SetNiagara(class UNiagaraSystem* BulletGenerate, class UNiagaraSystem* Bullet, class UNiagaraSystem* BulletHit);
	void InitializeBulletGenerateEffect_BulletEffect();
	void OnNotifyBulletHit(const struct FVector& InHitPos, const struct FVector& InHitNormal);
	void DoClearNiagara();
	void UpdateBuletInfoToNiagara();
	void BulletSpawnEffect(const struct FVector& Pos, const struct FVector& Rot);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PerformanceOptimizationBulletScreenBasedBlueprint_C">();
	}
	static class APerformanceOptimizationBulletScreenBasedBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APerformanceOptimizationBulletScreenBasedBlueprint_C>();
	}
};
static_assert(alignof(APerformanceOptimizationBulletScreenBasedBlueprint_C) == 0x000010, "Wrong alignment on APerformanceOptimizationBulletScreenBasedBlueprint_C");
static_assert(sizeof(APerformanceOptimizationBulletScreenBasedBlueprint_C) == 0x000650, "Wrong size on APerformanceOptimizationBulletScreenBasedBlueprint_C");
static_assert(offsetof(APerformanceOptimizationBulletScreenBasedBlueprint_C, UberGraphFrame) == 0x0005E0, "Member 'APerformanceOptimizationBulletScreenBasedBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APerformanceOptimizationBulletScreenBasedBlueprint_C, DefaultSceneRoot) == 0x0005E8, "Member 'APerformanceOptimizationBulletScreenBasedBlueprint_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(APerformanceOptimizationBulletScreenBasedBlueprint_C, MaxBulletCount) == 0x0005F0, "Member 'APerformanceOptimizationBulletScreenBasedBlueprint_C::MaxBulletCount' has a wrong offset!");
static_assert(offsetof(APerformanceOptimizationBulletScreenBasedBlueprint_C, BulletCompositeId) == 0x0005F4, "Member 'APerformanceOptimizationBulletScreenBasedBlueprint_C::BulletCompositeId' has a wrong offset!");
static_assert(offsetof(APerformanceOptimizationBulletScreenBasedBlueprint_C, BulletHitCompositeId) == 0x0005F8, "Member 'APerformanceOptimizationBulletScreenBasedBlueprint_C::BulletHitCompositeId' has a wrong offset!");
static_assert(offsetof(APerformanceOptimizationBulletScreenBasedBlueprint_C, BulletSpawnEffectCompositeId) == 0x0005FC, "Member 'APerformanceOptimizationBulletScreenBasedBlueprint_C::BulletSpawnEffectCompositeId' has a wrong offset!");
static_assert(offsetof(APerformanceOptimizationBulletScreenBasedBlueprint_C, BulletHitNiagaraEffect) == 0x000600, "Member 'APerformanceOptimizationBulletScreenBasedBlueprint_C::BulletHitNiagaraEffect' has a wrong offset!");
static_assert(offsetof(APerformanceOptimizationBulletScreenBasedBlueprint_C, BulletNiagaraEffect) == 0x000608, "Member 'APerformanceOptimizationBulletScreenBasedBlueprint_C::BulletNiagaraEffect' has a wrong offset!");
static_assert(offsetof(APerformanceOptimizationBulletScreenBasedBlueprint_C, BulletGenerateNiagaraEffect) == 0x000610, "Member 'APerformanceOptimizationBulletScreenBasedBlueprint_C::BulletGenerateNiagaraEffect' has a wrong offset!");
static_assert(offsetof(APerformanceOptimizationBulletScreenBasedBlueprint_C, BulletInfoFx) == 0x000618, "Member 'APerformanceOptimizationBulletScreenBasedBlueprint_C::BulletInfoFx' has a wrong offset!");
static_assert(offsetof(APerformanceOptimizationBulletScreenBasedBlueprint_C, BulletFxCount) == 0x000620, "Member 'APerformanceOptimizationBulletScreenBasedBlueprint_C::BulletFxCount' has a wrong offset!");
static_assert(offsetof(APerformanceOptimizationBulletScreenBasedBlueprint_C, Buffer_Position) == 0x000628, "Member 'APerformanceOptimizationBulletScreenBasedBlueprint_C::Buffer_Position' has a wrong offset!");
static_assert(offsetof(APerformanceOptimizationBulletScreenBasedBlueprint_C, Buffer_Forward) == 0x000638, "Member 'APerformanceOptimizationBulletScreenBasedBlueprint_C::Buffer_Forward' has a wrong offset!");
static_assert(offsetof(APerformanceOptimizationBulletScreenBasedBlueprint_C, bLaunchSpecialHitLogic) == 0x000648, "Member 'APerformanceOptimizationBulletScreenBasedBlueprint_C::bLaunchSpecialHitLogic' has a wrong offset!");

}

