#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PhysicsControl

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum PhysicsControl.EPhysicsControlUpdateApplyType
// NumValues: 0x0004
enum class EPhysicsControlUpdateApplyType : uint8
{
	Replace                                  = 0,
	Modulate                                 = 1,
	Add                                      = 2,
	EPhysicsControlUpdateApplyType_MAX       = 3,
};

// Enum PhysicsControl.EPhysUpdateParamType
// NumValues: 0x0006
enum class EPhysUpdateParamType : uint8
{
	None                                     = 0,
	LinearStrength                           = 1,
	LinearDamp                               = 2,
	AngularStrength                          = 3,
	AngularDamp                              = 4,
	EPhysUpdateParamType_MAX                 = 5,
};

// Enum PhysicsControl.EResetToCachedTargetBehavior
// NumValues: 0x0003
enum class EResetToCachedTargetBehavior : uint8
{
	ResetImmediately                         = 0,
	ResetDuringUpdateControls                = 1,
	EResetToCachedTargetBehavior_MAX         = 2,
};

// Enum PhysicsControl.EPhysicsControlType
// NumValues: 0x0003
enum class EPhysicsControlType : uint8
{
	WorldSpace                               = 0,
	ParentSpace                              = 1,
	EPhysicsControlType_MAX                  = 2,
};

// Enum PhysicsControl.EPhysicsMovementType
// NumValues: 0x0004
enum class EPhysicsMovementType : uint8
{
	Static                                   = 0,
	Kinematic                                = 1,
	Simulated                                = 2,
	EPhysicsMovementType_MAX                 = 3,
};

// Enum PhysicsControl.ERigidBodyAdditionalControlType
// NumValues: 0x0003
enum class ERigidBodyAdditionalControlType : uint8
{
	Create                                   = 0,
	Destory                                  = 1,
	ERigidBodyAdditionalControlType_MAX      = 2,
};

// Enum PhysicsControl.ERigidBodyFixVersionType
// NumValues: 0x0003
enum class ERigidBodyFixVersionType : uint8
{
	None                                     = 0,
	Version32                                = 1,
	ERigidBodyFixVersionType_MAX             = 2,
};

// Enum PhysicsControl.ERigidBodyGrabUpdateType
// NumValues: 0x0004
enum class ERigidBodyGrabUpdateType : uint8
{
	Update                                   = 0,
	Create                                   = 1,
	Destory                                  = 2,
	ERigidBodyGrabUpdateType_MAX             = 3,
};

// ScriptStruct PhysicsControl.RigidBodyKinematicTarget
// 0x001C (0x001C - 0x0000)
struct FRigidBodyKinematicTarget final
{
public:
	struct FVector                                TargetPosition;                                    // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               TargetOrientation;                                 // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         bUseSkeletalAnimation : 1;                         // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigidBodyKinematicTarget) == 0x000004, "Wrong alignment on FRigidBodyKinematicTarget");
static_assert(sizeof(FRigidBodyKinematicTarget) == 0x00001C, "Wrong size on FRigidBodyKinematicTarget");
static_assert(offsetof(FRigidBodyKinematicTarget, TargetPosition) == 0x000000, "Member 'FRigidBodyKinematicTarget::TargetPosition' has a wrong offset!");
static_assert(offsetof(FRigidBodyKinematicTarget, TargetOrientation) == 0x00000C, "Member 'FRigidBodyKinematicTarget::TargetOrientation' has a wrong offset!");

// ScriptStruct PhysicsControl.PhysicsControlSettings
// 0x0018 (0x0018 - 0x0000)
struct FPhysicsControlSettings final
{
public:
	struct FVector                                ControlPoint;                                      // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSkeletalAnimation;                             // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SkeletalAnimationVelocityMultiplier;               // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableCollision;                                 // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoDisable;                                      // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPhysicsControlSettings) == 0x000004, "Wrong alignment on FPhysicsControlSettings");
static_assert(sizeof(FPhysicsControlSettings) == 0x000018, "Wrong size on FPhysicsControlSettings");
static_assert(offsetof(FPhysicsControlSettings, ControlPoint) == 0x000000, "Member 'FPhysicsControlSettings::ControlPoint' has a wrong offset!");
static_assert(offsetof(FPhysicsControlSettings, bUseSkeletalAnimation) == 0x00000C, "Member 'FPhysicsControlSettings::bUseSkeletalAnimation' has a wrong offset!");
static_assert(offsetof(FPhysicsControlSettings, SkeletalAnimationVelocityMultiplier) == 0x000010, "Member 'FPhysicsControlSettings::SkeletalAnimationVelocityMultiplier' has a wrong offset!");
static_assert(offsetof(FPhysicsControlSettings, bDisableCollision) == 0x000014, "Member 'FPhysicsControlSettings::bDisableCollision' has a wrong offset!");
static_assert(offsetof(FPhysicsControlSettings, bAutoDisable) == 0x000015, "Member 'FPhysicsControlSettings::bAutoDisable' has a wrong offset!");

// ScriptStruct PhysicsControl.PhysicsControlData
// 0x0020 (0x0020 - 0x0000)
struct FPhysicsControlData final
{
public:
	float                                         LinearStrength;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LinearDampingRatio;                                // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LinearExtraDamping;                                // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxForce;                                          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularStrength;                                   // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularDampingRatio;                               // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularExtraDamping;                               // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTorque;                                         // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPhysicsControlData) == 0x000004, "Wrong alignment on FPhysicsControlData");
static_assert(sizeof(FPhysicsControlData) == 0x000020, "Wrong size on FPhysicsControlData");
static_assert(offsetof(FPhysicsControlData, LinearStrength) == 0x000000, "Member 'FPhysicsControlData::LinearStrength' has a wrong offset!");
static_assert(offsetof(FPhysicsControlData, LinearDampingRatio) == 0x000004, "Member 'FPhysicsControlData::LinearDampingRatio' has a wrong offset!");
static_assert(offsetof(FPhysicsControlData, LinearExtraDamping) == 0x000008, "Member 'FPhysicsControlData::LinearExtraDamping' has a wrong offset!");
static_assert(offsetof(FPhysicsControlData, MaxForce) == 0x00000C, "Member 'FPhysicsControlData::MaxForce' has a wrong offset!");
static_assert(offsetof(FPhysicsControlData, AngularStrength) == 0x000010, "Member 'FPhysicsControlData::AngularStrength' has a wrong offset!");
static_assert(offsetof(FPhysicsControlData, AngularDampingRatio) == 0x000014, "Member 'FPhysicsControlData::AngularDampingRatio' has a wrong offset!");
static_assert(offsetof(FPhysicsControlData, AngularExtraDamping) == 0x000018, "Member 'FPhysicsControlData::AngularExtraDamping' has a wrong offset!");
static_assert(offsetof(FPhysicsControlData, MaxTorque) == 0x00001C, "Member 'FPhysicsControlData::MaxTorque' has a wrong offset!");

// ScriptStruct PhysicsControl.RigidBodyKinematicTargets
// 0x0050 (0x0050 - 0x0000)
struct FRigidBodyKinematicTargets final
{
public:
	TMap<class FName, struct FRigidBodyKinematicTarget> Targets;                                           // 0x0000(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigidBodyKinematicTargets) == 0x000008, "Wrong alignment on FRigidBodyKinematicTargets");
static_assert(sizeof(FRigidBodyKinematicTargets) == 0x000050, "Wrong size on FRigidBodyKinematicTargets");
static_assert(offsetof(FRigidBodyKinematicTargets, Targets) == 0x000000, "Member 'FRigidBodyKinematicTargets::Targets' has a wrong offset!");

// ScriptStruct PhysicsControl.PhysicsControlLimbSetupData
// 0x0014 (0x0014 - 0x0000)
struct FPhysicsControlLimbSetupData final
{
public:
	class FName                                   LimbName;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StartBone;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeParentBone;                                // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPhysicsControlLimbSetupData) == 0x000004, "Wrong alignment on FPhysicsControlLimbSetupData");
static_assert(sizeof(FPhysicsControlLimbSetupData) == 0x000014, "Wrong size on FPhysicsControlLimbSetupData");
static_assert(offsetof(FPhysicsControlLimbSetupData, LimbName) == 0x000000, "Member 'FPhysicsControlLimbSetupData::LimbName' has a wrong offset!");
static_assert(offsetof(FPhysicsControlLimbSetupData, StartBone) == 0x000008, "Member 'FPhysicsControlLimbSetupData::StartBone' has a wrong offset!");
static_assert(offsetof(FPhysicsControlLimbSetupData, bIncludeParentBone) == 0x000010, "Member 'FPhysicsControlLimbSetupData::bIncludeParentBone' has a wrong offset!");

// ScriptStruct PhysicsControl.RigidBodyControlTarget
// 0x0018 (0x0018 - 0x0000)
struct FRigidBodyControlTarget final
{
public:
	struct FVector                                TargetPosition;                                    // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               TargetOrientation;                                 // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigidBodyControlTarget) == 0x000004, "Wrong alignment on FRigidBodyControlTarget");
static_assert(sizeof(FRigidBodyControlTarget) == 0x000018, "Wrong size on FRigidBodyControlTarget");
static_assert(offsetof(FRigidBodyControlTarget, TargetPosition) == 0x000000, "Member 'FRigidBodyControlTarget::TargetPosition' has a wrong offset!");
static_assert(offsetof(FRigidBodyControlTarget, TargetOrientation) == 0x00000C, "Member 'FRigidBodyControlTarget::TargetOrientation' has a wrong offset!");

// ScriptStruct PhysicsControl.RigidBodyControlTargets
// 0x0050 (0x0050 - 0x0000)
struct FRigidBodyControlTargets final
{
public:
	TMap<class FName, struct FRigidBodyControlTarget> Targets;                                           // 0x0000(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigidBodyControlTargets) == 0x000008, "Wrong alignment on FRigidBodyControlTargets");
static_assert(sizeof(FRigidBodyControlTargets) == 0x000050, "Wrong size on FRigidBodyControlTargets");
static_assert(offsetof(FRigidBodyControlTargets, Targets) == 0x000000, "Member 'FRigidBodyControlTargets::Targets' has a wrong offset!");

// ScriptStruct PhysicsControl.PhysicsControlSparseData
// 0x003C (0x003C - 0x0000)
struct FPhysicsControlSparseData final
{
public:
	float                                         LinearStrength;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LinearDampingRatio;                                // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LinearExtraDamping;                                // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxForce;                                          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularStrength;                                   // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularDampingRatio;                               // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularExtraDamping;                               // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTorque;                                         // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LinearTargetVelocityMultiplier;                    // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularTargetVelocityMultiplier;                   // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkeletalAnimationVelocityMultiplier;               // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CustomControlPoint;                                // 0x002C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bEnabled : 1;                                      // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseCustomControlPoint : 1;                        // 0x0038(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseSkeletalAnimation : 1;                         // 0x0038(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDisableCollision : 1;                             // 0x0038(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOnlyControlChildObject : 1;                       // 0x0038(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableLinearStrength : 1;                         // 0x0038(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableLinearDampingRatio : 1;                     // 0x0038(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableLinearExtraDamping : 1;                     // 0x0038(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableMaxForce : 1;                               // 0x0039(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableAngularStrength : 1;                        // 0x0039(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableAngularDampingRatio : 1;                    // 0x0039(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableAngularExtraDamping : 1;                    // 0x0039(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableMaxTorque : 1;                              // 0x0039(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableLinearTargetVelocityMultiplier : 1;         // 0x0039(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableAngularTargetVelocityMultiplier : 1;        // 0x0039(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableSkeletalAnimationVelocityMultiplier : 1;    // 0x0039(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableCustomControlPoint : 1;                     // 0x003A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnablebEnabled : 1;                               // 0x003A(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnablebUseCustomControlPoint : 1;                 // 0x003A(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnablebUseSkeletalAnimation : 1;                  // 0x003A(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnablebDisableCollision : 1;                      // 0x003A(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnablebOnlyControlChildObject : 1;                // 0x003A(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPhysicsControlSparseData) == 0x000004, "Wrong alignment on FPhysicsControlSparseData");
static_assert(sizeof(FPhysicsControlSparseData) == 0x00003C, "Wrong size on FPhysicsControlSparseData");
static_assert(offsetof(FPhysicsControlSparseData, LinearStrength) == 0x000000, "Member 'FPhysicsControlSparseData::LinearStrength' has a wrong offset!");
static_assert(offsetof(FPhysicsControlSparseData, LinearDampingRatio) == 0x000004, "Member 'FPhysicsControlSparseData::LinearDampingRatio' has a wrong offset!");
static_assert(offsetof(FPhysicsControlSparseData, LinearExtraDamping) == 0x000008, "Member 'FPhysicsControlSparseData::LinearExtraDamping' has a wrong offset!");
static_assert(offsetof(FPhysicsControlSparseData, MaxForce) == 0x00000C, "Member 'FPhysicsControlSparseData::MaxForce' has a wrong offset!");
static_assert(offsetof(FPhysicsControlSparseData, AngularStrength) == 0x000010, "Member 'FPhysicsControlSparseData::AngularStrength' has a wrong offset!");
static_assert(offsetof(FPhysicsControlSparseData, AngularDampingRatio) == 0x000014, "Member 'FPhysicsControlSparseData::AngularDampingRatio' has a wrong offset!");
static_assert(offsetof(FPhysicsControlSparseData, AngularExtraDamping) == 0x000018, "Member 'FPhysicsControlSparseData::AngularExtraDamping' has a wrong offset!");
static_assert(offsetof(FPhysicsControlSparseData, MaxTorque) == 0x00001C, "Member 'FPhysicsControlSparseData::MaxTorque' has a wrong offset!");
static_assert(offsetof(FPhysicsControlSparseData, LinearTargetVelocityMultiplier) == 0x000020, "Member 'FPhysicsControlSparseData::LinearTargetVelocityMultiplier' has a wrong offset!");
static_assert(offsetof(FPhysicsControlSparseData, AngularTargetVelocityMultiplier) == 0x000024, "Member 'FPhysicsControlSparseData::AngularTargetVelocityMultiplier' has a wrong offset!");
static_assert(offsetof(FPhysicsControlSparseData, SkeletalAnimationVelocityMultiplier) == 0x000028, "Member 'FPhysicsControlSparseData::SkeletalAnimationVelocityMultiplier' has a wrong offset!");
static_assert(offsetof(FPhysicsControlSparseData, CustomControlPoint) == 0x00002C, "Member 'FPhysicsControlSparseData::CustomControlPoint' has a wrong offset!");

// ScriptStruct PhysicsControl.PhysicsControlNamedControlParameters
// 0x0044 (0x0044 - 0x0000)
struct FPhysicsControlNamedControlParameters final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPhysicsControlSparseData              Data;                                              // 0x0008(0x003C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPhysicsControlNamedControlParameters) == 0x000004, "Wrong alignment on FPhysicsControlNamedControlParameters");
static_assert(sizeof(FPhysicsControlNamedControlParameters) == 0x000044, "Wrong size on FPhysicsControlNamedControlParameters");
static_assert(offsetof(FPhysicsControlNamedControlParameters, Name) == 0x000000, "Member 'FPhysicsControlNamedControlParameters::Name' has a wrong offset!");
static_assert(offsetof(FPhysicsControlNamedControlParameters, Data) == 0x000008, "Member 'FPhysicsControlNamedControlParameters::Data' has a wrong offset!");

// ScriptStruct PhysicsControl.PhysicsControlSparseMultiplier
// 0x0044 (0x0044 - 0x0000)
struct FPhysicsControlSparseMultiplier final
{
public:
	struct FVector                                LinearStrengthMultiplier;                          // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LinearDampingRatioMultiplier;                      // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LinearExtraDampingMultiplier;                      // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MaxForceMultiplier;                                // 0x0024(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularStrengthMultiplier;                         // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularDampingRatioMultiplier;                     // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularExtraDampingMultiplier;                     // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTorqueMultiplier;                               // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bEnableLinearStrengthMultiplier : 1;               // 0x0040(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableLinearDampingRatioMultiplier : 1;           // 0x0040(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableLinearExtraDampingMultiplier : 1;           // 0x0040(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableMaxForceMultiplier : 1;                     // 0x0040(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableAngularStrengthMultiplier : 1;              // 0x0040(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableAngularDampingRatioMultiplier : 1;          // 0x0040(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableAngularExtraDampingMultiplier : 1;          // 0x0040(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableMaxTorqueMultiplier : 1;                    // 0x0040(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPhysicsControlSparseMultiplier) == 0x000004, "Wrong alignment on FPhysicsControlSparseMultiplier");
static_assert(sizeof(FPhysicsControlSparseMultiplier) == 0x000044, "Wrong size on FPhysicsControlSparseMultiplier");
static_assert(offsetof(FPhysicsControlSparseMultiplier, LinearStrengthMultiplier) == 0x000000, "Member 'FPhysicsControlSparseMultiplier::LinearStrengthMultiplier' has a wrong offset!");
static_assert(offsetof(FPhysicsControlSparseMultiplier, LinearDampingRatioMultiplier) == 0x00000C, "Member 'FPhysicsControlSparseMultiplier::LinearDampingRatioMultiplier' has a wrong offset!");
static_assert(offsetof(FPhysicsControlSparseMultiplier, LinearExtraDampingMultiplier) == 0x000018, "Member 'FPhysicsControlSparseMultiplier::LinearExtraDampingMultiplier' has a wrong offset!");
static_assert(offsetof(FPhysicsControlSparseMultiplier, MaxForceMultiplier) == 0x000024, "Member 'FPhysicsControlSparseMultiplier::MaxForceMultiplier' has a wrong offset!");
static_assert(offsetof(FPhysicsControlSparseMultiplier, AngularStrengthMultiplier) == 0x000030, "Member 'FPhysicsControlSparseMultiplier::AngularStrengthMultiplier' has a wrong offset!");
static_assert(offsetof(FPhysicsControlSparseMultiplier, AngularDampingRatioMultiplier) == 0x000034, "Member 'FPhysicsControlSparseMultiplier::AngularDampingRatioMultiplier' has a wrong offset!");
static_assert(offsetof(FPhysicsControlSparseMultiplier, AngularExtraDampingMultiplier) == 0x000038, "Member 'FPhysicsControlSparseMultiplier::AngularExtraDampingMultiplier' has a wrong offset!");
static_assert(offsetof(FPhysicsControlSparseMultiplier, MaxTorqueMultiplier) == 0x00003C, "Member 'FPhysicsControlSparseMultiplier::MaxTorqueMultiplier' has a wrong offset!");

// ScriptStruct PhysicsControl.PhysicsControlNamedControlMultiplierParameters
// 0x004C (0x004C - 0x0000)
struct FPhysicsControlNamedControlMultiplierParameters final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPhysicsControlSparseMultiplier        Data;                                              // 0x0008(0x0044)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPhysicsControlNamedControlMultiplierParameters) == 0x000004, "Wrong alignment on FPhysicsControlNamedControlMultiplierParameters");
static_assert(sizeof(FPhysicsControlNamedControlMultiplierParameters) == 0x00004C, "Wrong size on FPhysicsControlNamedControlMultiplierParameters");
static_assert(offsetof(FPhysicsControlNamedControlMultiplierParameters, Name) == 0x000000, "Member 'FPhysicsControlNamedControlMultiplierParameters::Name' has a wrong offset!");
static_assert(offsetof(FPhysicsControlNamedControlMultiplierParameters, Data) == 0x000008, "Member 'FPhysicsControlNamedControlMultiplierParameters::Data' has a wrong offset!");

// ScriptStruct PhysicsControl.PhysicsControlModifierSparseData
// 0x0010 (0x0010 - 0x0000)
struct FPhysicsControlModifierSparseData final
{
public:
	EPhysicsMovementType                          MovementType;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionEnabled                             CollisionType;                                     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GravityMultiplier;                                 // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PhysicsBlendWeight;                                // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUseSkeletalAnimation : 1;                         // 0x000C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUpdateKinematicFromSimulation : 1;                // 0x000C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableMovementType : 1;                           // 0x000C(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableCollisionType : 1;                          // 0x000C(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableGravityMultiplier : 1;                      // 0x000C(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnablePhysicsBlendWeight : 1;                     // 0x000C(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnablebUseSkeletalAnimation : 1;                  // 0x000C(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnablebUpdateKinematicFromSimulation : 1;         // 0x000C(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPhysicsControlModifierSparseData) == 0x000004, "Wrong alignment on FPhysicsControlModifierSparseData");
static_assert(sizeof(FPhysicsControlModifierSparseData) == 0x000010, "Wrong size on FPhysicsControlModifierSparseData");
static_assert(offsetof(FPhysicsControlModifierSparseData, MovementType) == 0x000000, "Member 'FPhysicsControlModifierSparseData::MovementType' has a wrong offset!");
static_assert(offsetof(FPhysicsControlModifierSparseData, CollisionType) == 0x000001, "Member 'FPhysicsControlModifierSparseData::CollisionType' has a wrong offset!");
static_assert(offsetof(FPhysicsControlModifierSparseData, GravityMultiplier) == 0x000004, "Member 'FPhysicsControlModifierSparseData::GravityMultiplier' has a wrong offset!");
static_assert(offsetof(FPhysicsControlModifierSparseData, PhysicsBlendWeight) == 0x000008, "Member 'FPhysicsControlModifierSparseData::PhysicsBlendWeight' has a wrong offset!");

// ScriptStruct PhysicsControl.PhysicsControlNamedModifierParameters
// 0x0018 (0x0018 - 0x0000)
struct FPhysicsControlNamedModifierParameters final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPhysicsControlModifierSparseData      Data;                                              // 0x0008(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPhysicsControlNamedModifierParameters) == 0x000004, "Wrong alignment on FPhysicsControlNamedModifierParameters");
static_assert(sizeof(FPhysicsControlNamedModifierParameters) == 0x000018, "Wrong size on FPhysicsControlNamedModifierParameters");
static_assert(offsetof(FPhysicsControlNamedModifierParameters, Name) == 0x000000, "Member 'FPhysicsControlNamedModifierParameters::Name' has a wrong offset!");
static_assert(offsetof(FPhysicsControlNamedModifierParameters, Data) == 0x000008, "Member 'FPhysicsControlNamedModifierParameters::Data' has a wrong offset!");

// ScriptStruct PhysicsControl.PhysicsControlControlAndModifierParameters
// 0x0030 (0x0030 - 0x0000)
struct FPhysicsControlControlAndModifierParameters final
{
public:
	TArray<struct FPhysicsControlNamedControlParameters> ControlParameters;                                 // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPhysicsControlNamedControlMultiplierParameters> ControlMultiplierParameters;                       // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPhysicsControlNamedModifierParameters> ModifierParameters;                                // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPhysicsControlControlAndModifierParameters) == 0x000008, "Wrong alignment on FPhysicsControlControlAndModifierParameters");
static_assert(sizeof(FPhysicsControlControlAndModifierParameters) == 0x000030, "Wrong size on FPhysicsControlControlAndModifierParameters");
static_assert(offsetof(FPhysicsControlControlAndModifierParameters, ControlParameters) == 0x000000, "Member 'FPhysicsControlControlAndModifierParameters::ControlParameters' has a wrong offset!");
static_assert(offsetof(FPhysicsControlControlAndModifierParameters, ControlMultiplierParameters) == 0x000010, "Member 'FPhysicsControlControlAndModifierParameters::ControlMultiplierParameters' has a wrong offset!");
static_assert(offsetof(FPhysicsControlControlAndModifierParameters, ModifierParameters) == 0x000020, "Member 'FPhysicsControlControlAndModifierParameters::ModifierParameters' has a wrong offset!");

// ScriptStruct PhysicsControl.PhysicsControlControlAndModifierUpdates
// 0x0030 (0x0030 - 0x0000)
struct FPhysicsControlControlAndModifierUpdates final
{
public:
	TArray<struct FPhysicsControlNamedControlParameters> ControlUpdates;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPhysicsControlNamedControlMultiplierParameters> ControlMultiplierUpdates;                          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPhysicsControlNamedModifierParameters> ModifierUpdates;                                   // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPhysicsControlControlAndModifierUpdates) == 0x000008, "Wrong alignment on FPhysicsControlControlAndModifierUpdates");
static_assert(sizeof(FPhysicsControlControlAndModifierUpdates) == 0x000030, "Wrong size on FPhysicsControlControlAndModifierUpdates");
static_assert(offsetof(FPhysicsControlControlAndModifierUpdates, ControlUpdates) == 0x000000, "Member 'FPhysicsControlControlAndModifierUpdates::ControlUpdates' has a wrong offset!");
static_assert(offsetof(FPhysicsControlControlAndModifierUpdates, ControlMultiplierUpdates) == 0x000010, "Member 'FPhysicsControlControlAndModifierUpdates::ControlMultiplierUpdates' has a wrong offset!");
static_assert(offsetof(FPhysicsControlControlAndModifierUpdates, ModifierUpdates) == 0x000020, "Member 'FPhysicsControlControlAndModifierUpdates::ModifierUpdates' has a wrong offset!");

// ScriptStruct PhysicsControl.AnimNode_RigidBodyWithControl
// 0x0A08 (0x0AD0 - 0x00C8)
struct alignas(0x10) FAnimNode_RigidBodyWithControl final : public FAnimNode_SkeletalControlBase
{
public:
	class UPhysicsAsset*                          OverridePhysicsAsset;                              // 0x00C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDefaultToSkeletalMeshPhysicsAsset;                // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0xA7];                                      // 0x00D1(0x00A7)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicsControlAsset*                   PhysicsControlAssetToUse;                          // 0x0178(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                OverrideWorldGravity;                              // 0x0180(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ExternalForce;                                     // 0x018C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OverrideLinearVelocity;                            // 0x0198(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ComponentLinearAccScale;                           // 0x01A4(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            ComponentLinearAccScaleFilter;                     // 0x01B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ComponentLinearVelScale;                           // 0x01B8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ComponentAppliedLinearAccClamp;                    // 0x01C4(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CachedBoundsScale;                                 // 0x01D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateCacheEveryFrame;                            // 0x01D4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneReference                         BaseBoneRef;                                       // 0x01D8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	ECollisionChannel                             OverlapChannel;                                    // 0x01E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESimulationSpace                              SimulationSpace;                                   // 0x01E9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bCalculateVelocitiesForWorldGeometry : 1;          // 0x01EA(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bForceDisableCollisionBetweenConstraintBodies : 1; // 0x01EA(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseExternalClothCollision : 1;                    // 0x01EA(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDisableControl : 1;                               // 0x01EA(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMakeKinematicConstraints : 1;                     // 0x01EA(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BitPad_1EA_5 : 3;                                  // 0x01EA(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         Pad_1EB[0x1];                                      // 0x01EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bEnableWorldGeometry : 1;                          // 0x01EC(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverrideWorldGravity : 1;                         // 0x01EC(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverrideLinearVelocity : 1;                       // 0x01EC(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bTransferBoneVelocities : 1;                       // 0x01EC(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bFreezeIncomingPoseOnStart : 1;                    // 0x01EC(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bModifyConstraintTransformsToMatchSkeleton : 1;    // 0x01EC(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WorldSpaceMinimumScale;                            // 0x01F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EvaluationResetTime;                               // 0x01F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableControls;                                   // 0x01F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicsControlAsset*                   PhysicsControlAsset;                               // 0x0200(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, class FName>                BoneToBodyNameMap;                                 // 0x0208(0x0050)(Edit, NativeAccessSpecifierPublic)
	bool                                          bEnableCharacterSetupData;                         // 0x0258(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EnableControlMinFPS;                               // 0x025C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AverageFrameSampleCount;                           // 0x0260(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_264[0x14];                                     // 0x0264(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPhysicsControlControlAndModifierParameters ControlAndModifierParameters;                      // 0x0278(0x0030)(Edit, NativeAccessSpecifierPublic)
	struct FPhysicsControlControlAndModifierUpdates ControlAndModifierUpdates;                         // 0x02A8(0x0030)(Edit, NativeAccessSpecifierPublic)
	struct FRigidBodyControlTargets               ControlTargets;                                    // 0x02D8(0x0050)(Edit, NativeAccessSpecifierPublic)
	struct FRigidBodyKinematicTargets             KinematicTargets;                                  // 0x0328(0x0050)(Edit, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          PhysicsAssetAuthoredSkeletalMesh;                  // 0x0378(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ConstraintProfile;                                 // 0x0380(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ControlProfile;                                    // 0x0388(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AdjustBoneLengthThreshold;                         // 0x0390(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TeleportResetEnable;                               // 0x0394(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ResetEnable;                                       // 0x0395(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERigidBodyFixVersionType                      FixType;                                           // 0x0396(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_397[0x739];                                    // 0x0397(0x0739)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_RigidBodyWithControl) == 0x000010, "Wrong alignment on FAnimNode_RigidBodyWithControl");
static_assert(sizeof(FAnimNode_RigidBodyWithControl) == 0x000AD0, "Wrong size on FAnimNode_RigidBodyWithControl");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, OverridePhysicsAsset) == 0x0000C8, "Member 'FAnimNode_RigidBodyWithControl::OverridePhysicsAsset' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, bDefaultToSkeletalMeshPhysicsAsset) == 0x0000D0, "Member 'FAnimNode_RigidBodyWithControl::bDefaultToSkeletalMeshPhysicsAsset' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, PhysicsControlAssetToUse) == 0x000178, "Member 'FAnimNode_RigidBodyWithControl::PhysicsControlAssetToUse' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, OverrideWorldGravity) == 0x000180, "Member 'FAnimNode_RigidBodyWithControl::OverrideWorldGravity' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, ExternalForce) == 0x00018C, "Member 'FAnimNode_RigidBodyWithControl::ExternalForce' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, OverrideLinearVelocity) == 0x000198, "Member 'FAnimNode_RigidBodyWithControl::OverrideLinearVelocity' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, ComponentLinearAccScale) == 0x0001A4, "Member 'FAnimNode_RigidBodyWithControl::ComponentLinearAccScale' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, ComponentLinearAccScaleFilter) == 0x0001B0, "Member 'FAnimNode_RigidBodyWithControl::ComponentLinearAccScaleFilter' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, ComponentLinearVelScale) == 0x0001B8, "Member 'FAnimNode_RigidBodyWithControl::ComponentLinearVelScale' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, ComponentAppliedLinearAccClamp) == 0x0001C4, "Member 'FAnimNode_RigidBodyWithControl::ComponentAppliedLinearAccClamp' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, CachedBoundsScale) == 0x0001D0, "Member 'FAnimNode_RigidBodyWithControl::CachedBoundsScale' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, bUpdateCacheEveryFrame) == 0x0001D4, "Member 'FAnimNode_RigidBodyWithControl::bUpdateCacheEveryFrame' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, BaseBoneRef) == 0x0001D8, "Member 'FAnimNode_RigidBodyWithControl::BaseBoneRef' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, OverlapChannel) == 0x0001E8, "Member 'FAnimNode_RigidBodyWithControl::OverlapChannel' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, SimulationSpace) == 0x0001E9, "Member 'FAnimNode_RigidBodyWithControl::SimulationSpace' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, WorldSpaceMinimumScale) == 0x0001F0, "Member 'FAnimNode_RigidBodyWithControl::WorldSpaceMinimumScale' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, EvaluationResetTime) == 0x0001F4, "Member 'FAnimNode_RigidBodyWithControl::EvaluationResetTime' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, bEnableControls) == 0x0001F8, "Member 'FAnimNode_RigidBodyWithControl::bEnableControls' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, PhysicsControlAsset) == 0x000200, "Member 'FAnimNode_RigidBodyWithControl::PhysicsControlAsset' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, BoneToBodyNameMap) == 0x000208, "Member 'FAnimNode_RigidBodyWithControl::BoneToBodyNameMap' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, bEnableCharacterSetupData) == 0x000258, "Member 'FAnimNode_RigidBodyWithControl::bEnableCharacterSetupData' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, EnableControlMinFPS) == 0x00025C, "Member 'FAnimNode_RigidBodyWithControl::EnableControlMinFPS' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, AverageFrameSampleCount) == 0x000260, "Member 'FAnimNode_RigidBodyWithControl::AverageFrameSampleCount' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, ControlAndModifierParameters) == 0x000278, "Member 'FAnimNode_RigidBodyWithControl::ControlAndModifierParameters' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, ControlAndModifierUpdates) == 0x0002A8, "Member 'FAnimNode_RigidBodyWithControl::ControlAndModifierUpdates' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, ControlTargets) == 0x0002D8, "Member 'FAnimNode_RigidBodyWithControl::ControlTargets' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, KinematicTargets) == 0x000328, "Member 'FAnimNode_RigidBodyWithControl::KinematicTargets' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, PhysicsAssetAuthoredSkeletalMesh) == 0x000378, "Member 'FAnimNode_RigidBodyWithControl::PhysicsAssetAuthoredSkeletalMesh' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, ConstraintProfile) == 0x000380, "Member 'FAnimNode_RigidBodyWithControl::ConstraintProfile' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, ControlProfile) == 0x000388, "Member 'FAnimNode_RigidBodyWithControl::ControlProfile' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, AdjustBoneLengthThreshold) == 0x000390, "Member 'FAnimNode_RigidBodyWithControl::AdjustBoneLengthThreshold' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, TeleportResetEnable) == 0x000394, "Member 'FAnimNode_RigidBodyWithControl::TeleportResetEnable' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, ResetEnable) == 0x000395, "Member 'FAnimNode_RigidBodyWithControl::ResetEnable' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBodyWithControl, FixType) == 0x000396, "Member 'FAnimNode_RigidBodyWithControl::FixType' has a wrong offset!");

// ScriptStruct PhysicsControl.PhysicsControlNames
// 0x0010 (0x0010 - 0x0000)
struct FPhysicsControlNames final
{
public:
	TArray<class FName>                           Names;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPhysicsControlNames) == 0x000008, "Wrong alignment on FPhysicsControlNames");
static_assert(sizeof(FPhysicsControlNames) == 0x000010, "Wrong size on FPhysicsControlNames");
static_assert(offsetof(FPhysicsControlNames, Names) == 0x000000, "Member 'FPhysicsControlNames::Names' has a wrong offset!");

// ScriptStruct PhysicsControl.SetMovementDatas
// 0x0018 (0x0018 - 0x0000)
struct FSetMovementDatas final
{
public:
	EPhysicsMovementType                          MovementType;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
