#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlaySimplePlotEvent

#include "Basic.hpp"


namespace SDK::Params
{

// LuaFunction PlaySimplePlotEvent.PlaySimplePlotEvent_C.OnTrigger
// 0x0001 (0x0001 - 0x0000)
struct PlaySimplePlotEvent_C_OnTrigger final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlaySimplePlotEvent_C_OnTrigger) == 0x000001, "Wrong alignment on PlaySimplePlotEvent_C_OnTrigger");
static_assert(sizeof(PlaySimplePlotEvent_C_OnTrigger) == 0x000001, "Wrong size on PlaySimplePlotEvent_C_OnTrigger");
static_assert(offsetof(PlaySimplePlotEvent_C_OnTrigger, ReturnValue) == 0x000000, "Member 'PlaySimplePlotEvent_C_OnTrigger::ReturnValue' has a wrong offset!");

// Function PlaySimplePlotEvent.PlaySimplePlotEvent_C.GetSpecialStaticDescription
// 0x0020 (0x0020 - 0x0000)
struct PlaySimplePlotEvent_C_GetSpecialStaticDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(PlaySimplePlotEvent_C_GetSpecialStaticDescription) == 0x000008, "Wrong alignment on PlaySimplePlotEvent_C_GetSpecialStaticDescription");
static_assert(sizeof(PlaySimplePlotEvent_C_GetSpecialStaticDescription) == 0x000020, "Wrong size on PlaySimplePlotEvent_C_GetSpecialStaticDescription");
static_assert(offsetof(PlaySimplePlotEvent_C_GetSpecialStaticDescription, ReturnValue) == 0x000000, "Member 'PlaySimplePlotEvent_C_GetSpecialStaticDescription::ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySimplePlotEvent_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue) == 0x000010, "Member 'PlaySimplePlotEvent_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function PlaySimplePlotEvent.PlaySimplePlotEvent_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct PlaySimplePlotEvent_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(PlaySimplePlotEvent_C_GetModuleName) == 0x000008, "Wrong alignment on PlaySimplePlotEvent_C_GetModuleName");
static_assert(sizeof(PlaySimplePlotEvent_C_GetModuleName) == 0x000010, "Wrong size on PlaySimplePlotEvent_C_GetModuleName");
static_assert(offsetof(PlaySimplePlotEvent_C_GetModuleName, ReturnValue) == 0x000000, "Member 'PlaySimplePlotEvent_C_GetModuleName::ReturnValue' has a wrong offset!");

}

