#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerAddModifier

#include "Basic.hpp"

#include "GameTask_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PlayerAddModifier.PlayerAddModifier_C
// 0x0010 (0x0168 - 0x0158)
class UPlayerAddModifier_C final : public UGameTaskEvent
{
public:
	bool                                          bCurrent;                                          // 0x0158(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Modifier_ID;                                       // 0x015C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         KeepTime;                                          // 0x0160(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool OnTrigger();
	void RemovePlayersModifier();
	void GetApplyPlayers(TArray<class AGamePlayer*>* ApplyPlayers);

	class FString GetSpecialStaticDescription() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerAddModifier_C">();
	}
	static class UPlayerAddModifier_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerAddModifier_C>();
	}
};
static_assert(alignof(UPlayerAddModifier_C) == 0x000008, "Wrong alignment on UPlayerAddModifier_C");
static_assert(sizeof(UPlayerAddModifier_C) == 0x000168, "Wrong size on UPlayerAddModifier_C");
static_assert(offsetof(UPlayerAddModifier_C, bCurrent) == 0x000158, "Member 'UPlayerAddModifier_C::bCurrent' has a wrong offset!");
static_assert(offsetof(UPlayerAddModifier_C, Modifier_ID) == 0x00015C, "Member 'UPlayerAddModifier_C::Modifier_ID' has a wrong offset!");
static_assert(offsetof(UPlayerAddModifier_C, KeepTime) == 0x000160, "Member 'UPlayerAddModifier_C::KeepTime' has a wrong offset!");

}

