#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerMoveStateMachine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"
#include "BasePlayerStateMachine_classes.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass PlayerMoveStateMachine.PlayerMoveStateMachine_C
// 0x1308 (0x1968 - 0x0660)
class UPlayerMoveStateMachine_C final : public UBasePlayerStateMachine_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_PlayerMoveStateMachine_C;           // 0x0660(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          PlayerMoveStateMachine_PlayerMoveStateMachine_C;   // 0x0668(0x01A8)()
	struct FSMTransition                          PlayerMoveStateMachine_PlayerMoveStateMachine_C_0; // 0x0810(0x01A8)()
	struct FSMTransition                          PlayerMoveStateMachine_PlayerMoveStateMachine_C_1; // 0x09B8(0x01A8)()
	struct FSMTransition                          PlayerMoveStateMachine_PlayerMoveStateMachine_C_2; // 0x0B60(0x01A8)()
	struct FSMTransition                          PlayerMoveStateMachine_PlayerMoveStateMachine_C_3; // 0x0D08(0x01A8)()
	struct FSMState                               PlayerMoveStateMachine_PlayerMoveStateMachine_C_4; // 0x0EB0(0x01C8)()
	struct FSMState                               PlayerMoveStateMachine_PlayerMoveStateMachine_C_5; // 0x1078(0x01C8)()
	struct FSMState                               PlayerMoveStateMachine_PlayerMoveStateMachine_C_6; // 0x1240(0x01C8)()
	struct FSMState                               PlayerMoveStateMachine_PlayerMoveStateMachine_C_7; // 0x1408(0x01C8)()
	struct FSMState                               PlayerMoveStateMachine_PlayerMoveStateMachine_C_8; // 0x15D0(0x01C8)()
	struct FSMState                               PlayerMoveStateMachine_PlayerMoveStateMachine_C_9; // 0x1798(0x01C8)()
	class UMoveContextObject*                     MoveCtxObj;                                        // 0x1960(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Func_PlayerMoveStateMachine_PlayerMoveStateMachine_C_0();
	void Func_PlayerMoveStateMachine_PlayerMoveStateMachine_C_1();
	void Func_PlayerMoveStateMachine_PlayerMoveStateMachine_C_2();
	void Func_PlayerMoveStateMachine_PlayerMoveStateMachine_C_3();
	void Func_PlayerMoveStateMachine_PlayerMoveStateMachine_C_4();
	void OnStateMachineStart();
	void ExecuteUbergraph_PlayerMoveStateMachine(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PlayerMoveStateMachine_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayerMoveStateMachine_C")
	}
	static class UPlayerMoveStateMachine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerMoveStateMachine_C>();
	}
};
DUMPER7_ASSERTS_UPlayerMoveStateMachine_C;

}

