#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlaySequenceExecute

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameTask_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PlaySequenceExecute.PlaySequenceExecute_C
// 0x0080 (0x0280 - 0x0200)
class UPlaySequenceExecute_C final : public UGameTask_Execute
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0200(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FString                                 SequenceActorName;                                 // 0x0208(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 FixedSequenceActorName;                            // 0x0218(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 GDPL;                                              // 0x0228(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Fixed_GDPL;                                        // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          FixedDisable;                                      // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UsingPause;                                        // 0x0249(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HasSkipBtn;                                        // 0x024A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NotAllowInput;                                     // 0x024B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bNeedCancelSkill;                                  // 0x024C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelSequenceActor*                    ActorCache;                                        // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayRemoveSceneSwitchTime;                        // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAddSwitch;                                        // 0x025C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPreSwitch;                                        // 0x025D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bAfterSwitch;                                      // 0x025E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bStartHideFightUI;                                 // 0x025F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bEndShowFightUI;                                   // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bHiddenPlayer;                                     // 0x0261(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SwitchModel;                                       // 0x0262(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_263[0x1];                                      // 0x0263(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PrerollTime;                                       // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOneTakeType                                  OneTake;                                           // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _________;                                         // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               EndCameraRotation;                                 // 0x0270(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsDynamicCreate;                                  // 0x027C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_PlaySequenceExecute(int32 EntryPoint);
	void OnPlay();
	void WhenSeqFinished();
	void OnActive();
	void CancelQTE__Overridden();
	void Get_Fixed_Name(class FString* Name_0);
	void TryAddSceneSwitch();
	void TryRemoveSceneSwitch();
	void PreSwitch();
	void AfterSwitch();
	void UpdatePlayerVisibility__Overridden(bool bHidden);
	void NotifyBeforeFinish__Overridden();
	void SetTaskCountDownPause(bool UsingPause_0, bool IsPause);
	void FixedDisableEnd();
	void SetInputDisable();
	void SkipSequence__Overridden();
	void AddSkipButton__Overridden();
	void SetPlayBackPos(class UMovieSceneSequencePlayer* SeqPlayer);
	void EnsureSequenceActor(class AActor** SequenceActor);
	void SetPlayerSeqStatus(bool InPlaying);
	void SkipSequence();
	void UpdatePlayerVisibility(bool bHidden);
	void NotifyBeforeFinish();
	void CancelQTE();
	void AddSkipButton();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlaySequenceExecute_C">();
	}
	static class UPlaySequenceExecute_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlaySequenceExecute_C>();
	}
};
static_assert(alignof(UPlaySequenceExecute_C) == 0x000008, "Wrong alignment on UPlaySequenceExecute_C");
static_assert(sizeof(UPlaySequenceExecute_C) == 0x000280, "Wrong size on UPlaySequenceExecute_C");
static_assert(offsetof(UPlaySequenceExecute_C, UberGraphFrame) == 0x000200, "Member 'UPlaySequenceExecute_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlaySequenceExecute_C, SequenceActorName) == 0x000208, "Member 'UPlaySequenceExecute_C::SequenceActorName' has a wrong offset!");
static_assert(offsetof(UPlaySequenceExecute_C, FixedSequenceActorName) == 0x000218, "Member 'UPlaySequenceExecute_C::FixedSequenceActorName' has a wrong offset!");
static_assert(offsetof(UPlaySequenceExecute_C, GDPL) == 0x000228, "Member 'UPlaySequenceExecute_C::GDPL' has a wrong offset!");
static_assert(offsetof(UPlaySequenceExecute_C, Fixed_GDPL) == 0x000238, "Member 'UPlaySequenceExecute_C::Fixed_GDPL' has a wrong offset!");
static_assert(offsetof(UPlaySequenceExecute_C, FixedDisable) == 0x000248, "Member 'UPlaySequenceExecute_C::FixedDisable' has a wrong offset!");
static_assert(offsetof(UPlaySequenceExecute_C, UsingPause) == 0x000249, "Member 'UPlaySequenceExecute_C::UsingPause' has a wrong offset!");
static_assert(offsetof(UPlaySequenceExecute_C, HasSkipBtn) == 0x00024A, "Member 'UPlaySequenceExecute_C::HasSkipBtn' has a wrong offset!");
static_assert(offsetof(UPlaySequenceExecute_C, NotAllowInput) == 0x00024B, "Member 'UPlaySequenceExecute_C::NotAllowInput' has a wrong offset!");
static_assert(offsetof(UPlaySequenceExecute_C, bNeedCancelSkill) == 0x00024C, "Member 'UPlaySequenceExecute_C::bNeedCancelSkill' has a wrong offset!");
static_assert(offsetof(UPlaySequenceExecute_C, ActorCache) == 0x000250, "Member 'UPlaySequenceExecute_C::ActorCache' has a wrong offset!");
static_assert(offsetof(UPlaySequenceExecute_C, DelayRemoveSceneSwitchTime) == 0x000258, "Member 'UPlaySequenceExecute_C::DelayRemoveSceneSwitchTime' has a wrong offset!");
static_assert(offsetof(UPlaySequenceExecute_C, bAddSwitch) == 0x00025C, "Member 'UPlaySequenceExecute_C::bAddSwitch' has a wrong offset!");
static_assert(offsetof(UPlaySequenceExecute_C, bPreSwitch) == 0x00025D, "Member 'UPlaySequenceExecute_C::bPreSwitch' has a wrong offset!");
static_assert(offsetof(UPlaySequenceExecute_C, bAfterSwitch) == 0x00025E, "Member 'UPlaySequenceExecute_C::bAfterSwitch' has a wrong offset!");
static_assert(offsetof(UPlaySequenceExecute_C, bStartHideFightUI) == 0x00025F, "Member 'UPlaySequenceExecute_C::bStartHideFightUI' has a wrong offset!");
static_assert(offsetof(UPlaySequenceExecute_C, bEndShowFightUI) == 0x000260, "Member 'UPlaySequenceExecute_C::bEndShowFightUI' has a wrong offset!");
static_assert(offsetof(UPlaySequenceExecute_C, bHiddenPlayer) == 0x000261, "Member 'UPlaySequenceExecute_C::bHiddenPlayer' has a wrong offset!");
static_assert(offsetof(UPlaySequenceExecute_C, SwitchModel) == 0x000262, "Member 'UPlaySequenceExecute_C::SwitchModel' has a wrong offset!");
static_assert(offsetof(UPlaySequenceExecute_C, PrerollTime) == 0x000264, "Member 'UPlaySequenceExecute_C::PrerollTime' has a wrong offset!");
static_assert(offsetof(UPlaySequenceExecute_C, OneTake) == 0x000268, "Member 'UPlaySequenceExecute_C::OneTake' has a wrong offset!");
static_assert(offsetof(UPlaySequenceExecute_C, _________) == 0x00026C, "Member 'UPlaySequenceExecute_C::_________' has a wrong offset!");
static_assert(offsetof(UPlaySequenceExecute_C, EndCameraRotation) == 0x000270, "Member 'UPlaySequenceExecute_C::EndCameraRotation' has a wrong offset!");
static_assert(offsetof(UPlaySequenceExecute_C, bIsDynamicCreate) == 0x00027C, "Member 'UPlaySequenceExecute_C::bIsDynamicCreate' has a wrong offset!");

}

