#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerReturnZone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PlayerReturnZone.PlayerReturnZone_C
// 0x0050 (0x0278 - 0x0228)
class APlayerReturnZone_C final : public ATriggerBox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         BlackOutTime;                                      // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AddFallPunishment;                                 // 0x0234(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bReturnToTagPos;                                   // 0x0235(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_236[0x2];                                      // 0x0236(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter_C*                       FallingPlayer;                                     // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PlayerFallLoc;                                     // 0x0240(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinDistance;                                       // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Return_Location;                                   // 0x0254(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReturnTag;                                         // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         FallingRobot;                                      // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlayer;                                          // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void CheckLevelState(bool* IsOK);
	void CheckLevelState__Overridden(bool* IsOK);
	void PlayerReturn(const struct FVector& InLoc);
	void LoopThroughAllReturnPoints(class FName Tag);
	void PlayerAppearEffect();
	void PlayerAddBuff();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void Client_PostProcessOverLap(float Delay, const struct FVector& Location, const struct FRotator& Rotation);
	void ExecuteUbergraph_PlayerReturnZone(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerReturnZone_C">();
	}
	static class APlayerReturnZone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayerReturnZone_C>();
	}
};
static_assert(alignof(APlayerReturnZone_C) == 0x000008, "Wrong alignment on APlayerReturnZone_C");
static_assert(sizeof(APlayerReturnZone_C) == 0x000278, "Wrong size on APlayerReturnZone_C");
static_assert(offsetof(APlayerReturnZone_C, UberGraphFrame) == 0x000228, "Member 'APlayerReturnZone_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APlayerReturnZone_C, BlackOutTime) == 0x000230, "Member 'APlayerReturnZone_C::BlackOutTime' has a wrong offset!");
static_assert(offsetof(APlayerReturnZone_C, AddFallPunishment) == 0x000234, "Member 'APlayerReturnZone_C::AddFallPunishment' has a wrong offset!");
static_assert(offsetof(APlayerReturnZone_C, bReturnToTagPos) == 0x000235, "Member 'APlayerReturnZone_C::bReturnToTagPos' has a wrong offset!");
static_assert(offsetof(APlayerReturnZone_C, FallingPlayer) == 0x000238, "Member 'APlayerReturnZone_C::FallingPlayer' has a wrong offset!");
static_assert(offsetof(APlayerReturnZone_C, PlayerFallLoc) == 0x000240, "Member 'APlayerReturnZone_C::PlayerFallLoc' has a wrong offset!");
static_assert(offsetof(APlayerReturnZone_C, MinDistance) == 0x00024C, "Member 'APlayerReturnZone_C::MinDistance' has a wrong offset!");
static_assert(offsetof(APlayerReturnZone_C, Index_0) == 0x000250, "Member 'APlayerReturnZone_C::Index_0' has a wrong offset!");
static_assert(offsetof(APlayerReturnZone_C, Return_Location) == 0x000254, "Member 'APlayerReturnZone_C::Return_Location' has a wrong offset!");
static_assert(offsetof(APlayerReturnZone_C, ReturnTag) == 0x000260, "Member 'APlayerReturnZone_C::ReturnTag' has a wrong offset!");
static_assert(offsetof(APlayerReturnZone_C, FallingRobot) == 0x000268, "Member 'APlayerReturnZone_C::FallingRobot' has a wrong offset!");
static_assert(offsetof(APlayerReturnZone_C, IsPlayer) == 0x000270, "Member 'APlayerReturnZone_C::IsPlayer' has a wrong offset!");

}

