#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerReturnZone

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// LuaFunction PlayerReturnZone.PlayerReturnZone_C.CheckLevelState
// 0x0001 (0x0001 - 0x0000)
struct PlayerReturnZone_C_CheckLevelState final
{
public:
	bool                                          IsOK;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerReturnZone_C_CheckLevelState) == 0x000001, "Wrong alignment on PlayerReturnZone_C_CheckLevelState");
static_assert(sizeof(PlayerReturnZone_C_CheckLevelState) == 0x000001, "Wrong size on PlayerReturnZone_C_CheckLevelState");
static_assert(offsetof(PlayerReturnZone_C_CheckLevelState, IsOK) == 0x000000, "Member 'PlayerReturnZone_C_CheckLevelState::IsOK' has a wrong offset!");

// Function PlayerReturnZone.PlayerReturnZone_C.CheckLevelState__Overridden
// 0x0001 (0x0001 - 0x0000)
struct PlayerReturnZone_C_CheckLevelState__Overridden final
{
public:
	bool                                          IsOK;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerReturnZone_C_CheckLevelState__Overridden) == 0x000001, "Wrong alignment on PlayerReturnZone_C_CheckLevelState__Overridden");
static_assert(sizeof(PlayerReturnZone_C_CheckLevelState__Overridden) == 0x000001, "Wrong size on PlayerReturnZone_C_CheckLevelState__Overridden");
static_assert(offsetof(PlayerReturnZone_C_CheckLevelState__Overridden, IsOK) == 0x000000, "Member 'PlayerReturnZone_C_CheckLevelState__Overridden::IsOK' has a wrong offset!");

// Function PlayerReturnZone.PlayerReturnZone_C.PlayerReturn
// 0x009C (0x009C - 0x0000)
struct PlayerReturnZone_C_PlayerReturn final
{
public:
	struct FVector                                InLoc;                                             // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x000C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerReturnZone_C_PlayerReturn) == 0x000004, "Wrong alignment on PlayerReturnZone_C_PlayerReturn");
static_assert(sizeof(PlayerReturnZone_C_PlayerReturn) == 0x00009C, "Wrong size on PlayerReturnZone_C_PlayerReturn");
static_assert(offsetof(PlayerReturnZone_C_PlayerReturn, InLoc) == 0x000000, "Member 'PlayerReturnZone_C_PlayerReturn::InLoc' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_PlayerReturn, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x00000C, "Member 'PlayerReturnZone_C_PlayerReturn::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_PlayerReturn, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000098, "Member 'PlayerReturnZone_C_PlayerReturn::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

// Function PlayerReturnZone.PlayerReturnZone_C.LoopThroughAllReturnPoints
// 0x00A0 (0x00A0 - 0x0000)
struct PlayerReturnZone_C_LoopThroughAllReturnPoints final
{
public:
	class FName                                   Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             Character;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	int32                                         ___int_Array_Index_Variable;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStart*                           CallFunc_GetActorOfClass_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerReturnZone_C_LoopThroughAllReturnPoints) == 0x000008, "Wrong alignment on PlayerReturnZone_C_LoopThroughAllReturnPoints");
static_assert(sizeof(PlayerReturnZone_C_LoopThroughAllReturnPoints) == 0x0000A0, "Wrong size on PlayerReturnZone_C_LoopThroughAllReturnPoints");
static_assert(offsetof(PlayerReturnZone_C_LoopThroughAllReturnPoints, Tag) == 0x000000, "Member 'PlayerReturnZone_C_LoopThroughAllReturnPoints::Tag' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_LoopThroughAllReturnPoints, Character) == 0x000008, "Member 'PlayerReturnZone_C_LoopThroughAllReturnPoints::Character' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_LoopThroughAllReturnPoints, CallFunc_GetAllActorsWithTag_OutActors) == 0x000010, "Member 'PlayerReturnZone_C_LoopThroughAllReturnPoints::CallFunc_GetAllActorsWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_LoopThroughAllReturnPoints, ___int_Array_Index_Variable) == 0x000020, "Member 'PlayerReturnZone_C_LoopThroughAllReturnPoints::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_LoopThroughAllReturnPoints, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'PlayerReturnZone_C_LoopThroughAllReturnPoints::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_LoopThroughAllReturnPoints, CallFunc_Array_Get_Item) == 0x000028, "Member 'PlayerReturnZone_C_LoopThroughAllReturnPoints::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_LoopThroughAllReturnPoints, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'PlayerReturnZone_C_LoopThroughAllReturnPoints::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_LoopThroughAllReturnPoints, ___int_Loop_Counter_Variable) == 0x00003C, "Member 'PlayerReturnZone_C_LoopThroughAllReturnPoints::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_LoopThroughAllReturnPoints, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'PlayerReturnZone_C_LoopThroughAllReturnPoints::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_LoopThroughAllReturnPoints, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'PlayerReturnZone_C_LoopThroughAllReturnPoints::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_LoopThroughAllReturnPoints, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x000048, "Member 'PlayerReturnZone_C_LoopThroughAllReturnPoints::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_LoopThroughAllReturnPoints, CallFunc_GetActorOfClass_ReturnValue) == 0x000050, "Member 'PlayerReturnZone_C_LoopThroughAllReturnPoints::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_LoopThroughAllReturnPoints, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000058, "Member 'PlayerReturnZone_C_LoopThroughAllReturnPoints::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_LoopThroughAllReturnPoints, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000064, "Member 'PlayerReturnZone_C_LoopThroughAllReturnPoints::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_LoopThroughAllReturnPoints, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'PlayerReturnZone_C_LoopThroughAllReturnPoints::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_LoopThroughAllReturnPoints, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000070, "Member 'PlayerReturnZone_C_LoopThroughAllReturnPoints::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_LoopThroughAllReturnPoints, CallFunc_Vector_Distance_ReturnValue) == 0x00007C, "Member 'PlayerReturnZone_C_LoopThroughAllReturnPoints::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_LoopThroughAllReturnPoints, CallFunc_BreakVector_X) == 0x000080, "Member 'PlayerReturnZone_C_LoopThroughAllReturnPoints::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_LoopThroughAllReturnPoints, CallFunc_BreakVector_Y) == 0x000084, "Member 'PlayerReturnZone_C_LoopThroughAllReturnPoints::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_LoopThroughAllReturnPoints, CallFunc_BreakVector_Z) == 0x000088, "Member 'PlayerReturnZone_C_LoopThroughAllReturnPoints::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_LoopThroughAllReturnPoints, CallFunc_Add_FloatFloat_ReturnValue) == 0x00008C, "Member 'PlayerReturnZone_C_LoopThroughAllReturnPoints::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_LoopThroughAllReturnPoints, CallFunc_Less_FloatFloat_ReturnValue) == 0x000090, "Member 'PlayerReturnZone_C_LoopThroughAllReturnPoints::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_LoopThroughAllReturnPoints, CallFunc_MakeVector_ReturnValue) == 0x000094, "Member 'PlayerReturnZone_C_LoopThroughAllReturnPoints::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function PlayerReturnZone.PlayerReturnZone_C.PlayerAppearEffect
// 0x0020 (0x0020 - 0x0000)
struct PlayerReturnZone_C_PlayerAppearEffect final
{
public:
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerReturnZone_C_PlayerAppearEffect) == 0x000008, "Wrong alignment on PlayerReturnZone_C_PlayerAppearEffect");
static_assert(sizeof(PlayerReturnZone_C_PlayerAppearEffect) == 0x000020, "Wrong size on PlayerReturnZone_C_PlayerAppearEffect");
static_assert(offsetof(PlayerReturnZone_C_PlayerAppearEffect, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000000, "Member 'PlayerReturnZone_C_PlayerAppearEffect::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_PlayerAppearEffect, CallFunc_GetSocketLocation_ReturnValue) == 0x00000C, "Member 'PlayerReturnZone_C_PlayerAppearEffect::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_PlayerAppearEffect, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000018, "Member 'PlayerReturnZone_C_PlayerAppearEffect::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

// Function PlayerReturnZone.PlayerReturnZone_C.PlayerAddBuff
// 0x0018 (0x0018 - 0x0000)
struct PlayerReturnZone_C_PlayerAddBuff final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeModifier_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeModifier_ReturnValue_1;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerReturnZone_C_PlayerAddBuff) == 0x000004, "Wrong alignment on PlayerReturnZone_C_PlayerAddBuff");
static_assert(sizeof(PlayerReturnZone_C_PlayerAddBuff) == 0x000018, "Wrong size on PlayerReturnZone_C_PlayerAddBuff");
static_assert(offsetof(PlayerReturnZone_C_PlayerAddBuff, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'PlayerReturnZone_C_PlayerAddBuff::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_PlayerAddBuff, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00000C, "Member 'PlayerReturnZone_C_PlayerAddBuff::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_PlayerAddBuff, CallFunc_MakeModifier_ReturnValue) == 0x000010, "Member 'PlayerReturnZone_C_PlayerAddBuff::CallFunc_MakeModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_PlayerAddBuff, CallFunc_MakeModifier_ReturnValue_1) == 0x000014, "Member 'PlayerReturnZone_C_PlayerAddBuff::CallFunc_MakeModifier_ReturnValue_1' has a wrong offset!");

// Function PlayerReturnZone.PlayerReturnZone_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct PlayerReturnZone_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerReturnZone_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on PlayerReturnZone_C_ReceiveActorBeginOverlap");
static_assert(sizeof(PlayerReturnZone_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on PlayerReturnZone_C_ReceiveActorBeginOverlap");
static_assert(offsetof(PlayerReturnZone_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'PlayerReturnZone_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function PlayerReturnZone.PlayerReturnZone_C.Client_PostProcessOverLap
// 0x001C (0x001C - 0x0000)
struct PlayerReturnZone_C_Client_PostProcessOverLap final
{
public:
	float                                         Delay;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerReturnZone_C_Client_PostProcessOverLap) == 0x000004, "Wrong alignment on PlayerReturnZone_C_Client_PostProcessOverLap");
static_assert(sizeof(PlayerReturnZone_C_Client_PostProcessOverLap) == 0x00001C, "Wrong size on PlayerReturnZone_C_Client_PostProcessOverLap");
static_assert(offsetof(PlayerReturnZone_C_Client_PostProcessOverLap, Delay) == 0x000000, "Member 'PlayerReturnZone_C_Client_PostProcessOverLap::Delay' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_Client_PostProcessOverLap, Location) == 0x000004, "Member 'PlayerReturnZone_C_Client_PostProcessOverLap::Location' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_Client_PostProcessOverLap, Rotation) == 0x000010, "Member 'PlayerReturnZone_C_Client_PostProcessOverLap::Rotation' has a wrong offset!");

// Function PlayerReturnZone.PlayerReturnZone_C.ExecuteUbergraph_PlayerReturnZone
// 0x01B0 (0x01B0 - 0x0000)
struct PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Delay;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Rotation;                       // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter_C*                       K2Node_DynamicCast_AsBase_Character;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameVehicleAICharacter*                K2Node_DynamicCast_AsGame_Vehicle_AICharacter;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player;                  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckLevelState_IsOK;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PalGameMode_C*                      K2Node_DynamicCast_AsBP_Pal_Game_Mode;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetReturnPos_ReturnValue;                 // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DarkZoneGameMode_C*                 K2Node_DynamicCast_AsBP_Dark_Zone_Game_Mode;       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetReturnPos_ReturnValue_1;               // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0104(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter_C*                       K2Node_DynamicCast_AsBase_Character_1;             // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone) == 0x000008, "Wrong alignment on PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone");
static_assert(sizeof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone) == 0x0001B0, "Wrong size on PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, EntryPoint) == 0x000000, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000004, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, CallFunc_HasAuthority_ReturnValue) == 0x000008, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00000C, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, K2Node_CustomEvent_Delay) == 0x000018, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::K2Node_CustomEvent_Delay' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, K2Node_CustomEvent_Location) == 0x00001C, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, K2Node_CustomEvent_Rotation) == 0x000028, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::K2Node_CustomEvent_Rotation' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000038, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, CallFunc_HasAuthority_ReturnValue_1) == 0x000040, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000044, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, CallFunc_GetSocketLocation_ReturnValue) == 0x000050, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, K2Node_Event_OtherActor) == 0x000060, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, K2Node_DynamicCast_AsBase_Character) == 0x000068, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::K2Node_DynamicCast_AsBase_Character' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, K2Node_DynamicCast_AsGame_Vehicle_AICharacter) == 0x000078, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::K2Node_DynamicCast_AsGame_Vehicle_AICharacter' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, CallFunc_GetDisplayName_ReturnValue) == 0x000088, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, K2Node_DynamicCast_AsGame_Player) == 0x000098, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::K2Node_DynamicCast_AsGame_Player' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, CallFunc_Concat_StrStr_ReturnValue) == 0x0000A8, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, CallFunc_GetGameMode_ReturnValue) == 0x0000B8, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, CallFunc_CheckLevelState_IsOK) == 0x0000C0, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::CallFunc_CheckLevelState_IsOK' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, K2Node_DynamicCast_AsBP_Pal_Game_Mode) == 0x0000C8, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::K2Node_DynamicCast_AsBP_Pal_Game_Mode' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, K2Node_DynamicCast_bSuccess_3) == 0x0000D0, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, CallFunc_GetReturnPos_ReturnValue) == 0x0000D4, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::CallFunc_GetReturnPos_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, K2Node_DynamicCast_AsBP_Dark_Zone_Game_Mode) == 0x0000E0, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::K2Node_DynamicCast_AsBP_Dark_Zone_Game_Mode' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, K2Node_DynamicCast_bSuccess_4) == 0x0000E8, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, CallFunc_GetReturnPos_ReturnValue_1) == 0x0000EC, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::CallFunc_GetReturnPos_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000F8, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000104, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000190, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000198, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, K2Node_DynamicCast_AsBase_Character_1) == 0x0001A0, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::K2Node_DynamicCast_AsBase_Character_1' has a wrong offset!");
static_assert(offsetof(PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone, K2Node_DynamicCast_bSuccess_5) == 0x0001A8, "Member 'PlayerReturnZone_C_ExecuteUbergraph_PlayerReturnZone::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");

// Function PlayerReturnZone.PlayerReturnZone_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct PlayerReturnZone_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(PlayerReturnZone_C_GetModuleName) == 0x000008, "Wrong alignment on PlayerReturnZone_C_GetModuleName");
static_assert(sizeof(PlayerReturnZone_C_GetModuleName) == 0x000010, "Wrong size on PlayerReturnZone_C_GetModuleName");
static_assert(offsetof(PlayerReturnZone_C_GetModuleName, ReturnValue) == 0x000000, "Member 'PlayerReturnZone_C_GetModuleName::ReturnValue' has a wrong offset!");

}

