#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlaySequenceExecute

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK::Params
{

// Function PlaySequenceExecute.PlaySequenceExecute_C.ExecuteUbergraph_PlaySequenceExecute
// 0x0098 (0x0098 - 0x0000)
struct PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USubtitleSubsystem*                     CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASubtitleGameplay*                      CallFunc_GetGameplay_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayerController*                  K2Node_DynamicCast_AsGame_Player_Controller;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_1;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFixGDPL_ReturnValue;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_EnsureSequenceActor_SequenceActor;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelSequenceActor*                    K2Node_DynamicCast_As____actor;                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_2;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute) == 0x000008, "Wrong alignment on PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute");
static_assert(sizeof(PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute) == 0x000098, "Wrong size on PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute");
static_assert(offsetof(PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute, EntryPoint) == 0x000000, "Member 'PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute, CallFunc_GetGameplay_ReturnValue) == 0x000010, "Member 'PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute::CallFunc_GetGameplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute, K2Node_DynamicCast_AsGame_Player_Controller) == 0x000030, "Member 'PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute::K2Node_DynamicCast_AsGame_Player_Controller' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute, CallFunc_GetSequencePlayer_ReturnValue) == 0x000040, "Member 'PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute, CallFunc_GetSequencePlayer_ReturnValue_1) == 0x000060, "Member 'PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute::CallFunc_GetSequencePlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute, CallFunc_IsFixGDPL_ReturnValue) == 0x000068, "Member 'PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute::CallFunc_IsFixGDPL_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute, CallFunc_EnsureSequenceActor_SequenceActor) == 0x000070, "Member 'PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute::CallFunc_EnsureSequenceActor_SequenceActor' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute, K2Node_DynamicCast_As____actor) == 0x000080, "Member 'PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute::K2Node_DynamicCast_As____actor' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute, CallFunc_GetSequencePlayer_ReturnValue_2) == 0x000090, "Member 'PlaySequenceExecute_C_ExecuteUbergraph_PlaySequenceExecute::CallFunc_GetSequencePlayer_ReturnValue_2' has a wrong offset!");

// Function PlaySequenceExecute.PlaySequenceExecute_C.Get Fixed Name
// 0x0028 (0x0028 - 0x0000)
struct PlaySequenceExecute_C_Get_Fixed_Name final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFixGDPL_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlaySequenceExecute_C_Get_Fixed_Name) == 0x000008, "Wrong alignment on PlaySequenceExecute_C_Get_Fixed_Name");
static_assert(sizeof(PlaySequenceExecute_C_Get_Fixed_Name) == 0x000028, "Wrong size on PlaySequenceExecute_C_Get_Fixed_Name");
static_assert(offsetof(PlaySequenceExecute_C_Get_Fixed_Name, Name_0) == 0x000000, "Member 'PlaySequenceExecute_C_Get_Fixed_Name::Name_0' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_Get_Fixed_Name, Temp) == 0x000010, "Member 'PlaySequenceExecute_C_Get_Fixed_Name::Temp' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_Get_Fixed_Name, CallFunc_IsFixGDPL_ReturnValue) == 0x000020, "Member 'PlaySequenceExecute_C_Get_Fixed_Name::CallFunc_IsFixGDPL_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_Get_Fixed_Name, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000021, "Member 'PlaySequenceExecute_C_Get_Fixed_Name::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function PlaySequenceExecute.PlaySequenceExecute_C.TryAddSceneSwitch
// 0x0048 (0x0048 - 0x0000)
struct PlaySequenceExecute_C_TryAddSceneSwitch final
{
public:
	class AGameTaskActor*                         CallFunc_GetGameTaskActor_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_CreateWidgetByCPP_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUw_fight_scene_switch_C*               K2Node_DynamicCast_AsUw_Fight_Scene_Switch;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TaskActor_C*                        K2Node_DynamicCast_AsBP_Task_Actor;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUw_fight_scene_switch_C*               K2Node_DynamicCast_AsUw_Fight_Scene_Switch_1;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlaySequenceExecute_C_TryAddSceneSwitch) == 0x000008, "Wrong alignment on PlaySequenceExecute_C_TryAddSceneSwitch");
static_assert(sizeof(PlaySequenceExecute_C_TryAddSceneSwitch) == 0x000048, "Wrong size on PlaySequenceExecute_C_TryAddSceneSwitch");
static_assert(offsetof(PlaySequenceExecute_C_TryAddSceneSwitch, CallFunc_GetGameTaskActor_ReturnValue) == 0x000000, "Member 'PlaySequenceExecute_C_TryAddSceneSwitch::CallFunc_GetGameTaskActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_TryAddSceneSwitch, CallFunc_CreateWidgetByCPP_ReturnValue) == 0x000008, "Member 'PlaySequenceExecute_C_TryAddSceneSwitch::CallFunc_CreateWidgetByCPP_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_TryAddSceneSwitch, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'PlaySequenceExecute_C_TryAddSceneSwitch::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_TryAddSceneSwitch, K2Node_DynamicCast_AsUw_Fight_Scene_Switch) == 0x000018, "Member 'PlaySequenceExecute_C_TryAddSceneSwitch::K2Node_DynamicCast_AsUw_Fight_Scene_Switch' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_TryAddSceneSwitch, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'PlaySequenceExecute_C_TryAddSceneSwitch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_TryAddSceneSwitch, K2Node_DynamicCast_AsBP_Task_Actor) == 0x000028, "Member 'PlaySequenceExecute_C_TryAddSceneSwitch::K2Node_DynamicCast_AsBP_Task_Actor' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_TryAddSceneSwitch, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'PlaySequenceExecute_C_TryAddSceneSwitch::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_TryAddSceneSwitch, K2Node_DynamicCast_AsUw_Fight_Scene_Switch_1) == 0x000038, "Member 'PlaySequenceExecute_C_TryAddSceneSwitch::K2Node_DynamicCast_AsUw_Fight_Scene_Switch_1' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_TryAddSceneSwitch, K2Node_DynamicCast_bSuccess_2) == 0x000040, "Member 'PlaySequenceExecute_C_TryAddSceneSwitch::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_TryAddSceneSwitch, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'PlaySequenceExecute_C_TryAddSceneSwitch::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function PlaySequenceExecute.PlaySequenceExecute_C.TryRemoveSceneSwitch
// 0x0018 (0x0018 - 0x0000)
struct PlaySequenceExecute_C_TryRemoveSceneSwitch final
{
public:
	class AGameTaskActor*                         CallFunc_GetGameTaskActor_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_TaskActor_C*                        K2Node_DynamicCast_AsBP_Task_Actor;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlaySequenceExecute_C_TryRemoveSceneSwitch) == 0x000008, "Wrong alignment on PlaySequenceExecute_C_TryRemoveSceneSwitch");
static_assert(sizeof(PlaySequenceExecute_C_TryRemoveSceneSwitch) == 0x000018, "Wrong size on PlaySequenceExecute_C_TryRemoveSceneSwitch");
static_assert(offsetof(PlaySequenceExecute_C_TryRemoveSceneSwitch, CallFunc_GetGameTaskActor_ReturnValue) == 0x000000, "Member 'PlaySequenceExecute_C_TryRemoveSceneSwitch::CallFunc_GetGameTaskActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_TryRemoveSceneSwitch, K2Node_DynamicCast_AsBP_Task_Actor) == 0x000008, "Member 'PlaySequenceExecute_C_TryRemoveSceneSwitch::K2Node_DynamicCast_AsBP_Task_Actor' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_TryRemoveSceneSwitch, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'PlaySequenceExecute_C_TryRemoveSceneSwitch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_TryRemoveSceneSwitch, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'PlaySequenceExecute_C_TryRemoveSceneSwitch::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function PlaySequenceExecute.PlaySequenceExecute_C.PreSwitch
// 0x0048 (0x0048 - 0x0000)
struct PlaySequenceExecute_C_PreSwitch final
{
public:
	class AGameTaskActor*                         CallFunc_GetGameTaskActor_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_CreateWidgetByCPP_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUw_fight_scene_switch_C*               K2Node_DynamicCast_AsUw_Fight_Scene_Switch;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TaskActor_C*                        K2Node_DynamicCast_AsBP_Task_Actor;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUw_fight_scene_switch_C*               K2Node_DynamicCast_AsUw_Fight_Scene_Switch_1;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlaySequenceExecute_C_PreSwitch) == 0x000008, "Wrong alignment on PlaySequenceExecute_C_PreSwitch");
static_assert(sizeof(PlaySequenceExecute_C_PreSwitch) == 0x000048, "Wrong size on PlaySequenceExecute_C_PreSwitch");
static_assert(offsetof(PlaySequenceExecute_C_PreSwitch, CallFunc_GetGameTaskActor_ReturnValue) == 0x000000, "Member 'PlaySequenceExecute_C_PreSwitch::CallFunc_GetGameTaskActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_PreSwitch, CallFunc_CreateWidgetByCPP_ReturnValue) == 0x000008, "Member 'PlaySequenceExecute_C_PreSwitch::CallFunc_CreateWidgetByCPP_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_PreSwitch, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'PlaySequenceExecute_C_PreSwitch::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_PreSwitch, K2Node_DynamicCast_AsUw_Fight_Scene_Switch) == 0x000018, "Member 'PlaySequenceExecute_C_PreSwitch::K2Node_DynamicCast_AsUw_Fight_Scene_Switch' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_PreSwitch, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'PlaySequenceExecute_C_PreSwitch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_PreSwitch, K2Node_DynamicCast_AsBP_Task_Actor) == 0x000028, "Member 'PlaySequenceExecute_C_PreSwitch::K2Node_DynamicCast_AsBP_Task_Actor' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_PreSwitch, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'PlaySequenceExecute_C_PreSwitch::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_PreSwitch, K2Node_DynamicCast_AsUw_Fight_Scene_Switch_1) == 0x000038, "Member 'PlaySequenceExecute_C_PreSwitch::K2Node_DynamicCast_AsUw_Fight_Scene_Switch_1' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_PreSwitch, K2Node_DynamicCast_bSuccess_2) == 0x000040, "Member 'PlaySequenceExecute_C_PreSwitch::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_PreSwitch, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'PlaySequenceExecute_C_PreSwitch::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_PreSwitch, CallFunc_IsInViewport_ReturnValue) == 0x000042, "Member 'PlaySequenceExecute_C_PreSwitch::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");

// Function PlaySequenceExecute.PlaySequenceExecute_C.AfterSwitch
// 0x0048 (0x0048 - 0x0000)
struct PlaySequenceExecute_C_AfterSwitch final
{
public:
	class AGameTaskActor*                         CallFunc_GetGameTaskActor_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_CreateWidgetByCPP_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUw_fight_scene_switch_C*               K2Node_DynamicCast_AsUw_Fight_Scene_Switch;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TaskActor_C*                        K2Node_DynamicCast_AsBP_Task_Actor;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUw_fight_scene_switch_C*               K2Node_DynamicCast_AsUw_Fight_Scene_Switch_1;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlaySequenceExecute_C_AfterSwitch) == 0x000008, "Wrong alignment on PlaySequenceExecute_C_AfterSwitch");
static_assert(sizeof(PlaySequenceExecute_C_AfterSwitch) == 0x000048, "Wrong size on PlaySequenceExecute_C_AfterSwitch");
static_assert(offsetof(PlaySequenceExecute_C_AfterSwitch, CallFunc_GetGameTaskActor_ReturnValue) == 0x000000, "Member 'PlaySequenceExecute_C_AfterSwitch::CallFunc_GetGameTaskActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_AfterSwitch, CallFunc_CreateWidgetByCPP_ReturnValue) == 0x000008, "Member 'PlaySequenceExecute_C_AfterSwitch::CallFunc_CreateWidgetByCPP_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_AfterSwitch, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'PlaySequenceExecute_C_AfterSwitch::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_AfterSwitch, K2Node_DynamicCast_AsUw_Fight_Scene_Switch) == 0x000018, "Member 'PlaySequenceExecute_C_AfterSwitch::K2Node_DynamicCast_AsUw_Fight_Scene_Switch' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_AfterSwitch, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'PlaySequenceExecute_C_AfterSwitch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_AfterSwitch, K2Node_DynamicCast_AsBP_Task_Actor) == 0x000028, "Member 'PlaySequenceExecute_C_AfterSwitch::K2Node_DynamicCast_AsBP_Task_Actor' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_AfterSwitch, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'PlaySequenceExecute_C_AfterSwitch::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_AfterSwitch, K2Node_DynamicCast_AsUw_Fight_Scene_Switch_1) == 0x000038, "Member 'PlaySequenceExecute_C_AfterSwitch::K2Node_DynamicCast_AsUw_Fight_Scene_Switch_1' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_AfterSwitch, K2Node_DynamicCast_bSuccess_2) == 0x000040, "Member 'PlaySequenceExecute_C_AfterSwitch::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_AfterSwitch, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'PlaySequenceExecute_C_AfterSwitch::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_AfterSwitch, CallFunc_IsInViewport_ReturnValue) == 0x000042, "Member 'PlaySequenceExecute_C_AfterSwitch::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");

// Function PlaySequenceExecute.PlaySequenceExecute_C.UpdatePlayerVisibility__Overridden
// 0x0001 (0x0001 - 0x0000)
struct PlaySequenceExecute_C_UpdatePlayerVisibility__Overridden final
{
public:
	bool                                          bHidden;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlaySequenceExecute_C_UpdatePlayerVisibility__Overridden) == 0x000001, "Wrong alignment on PlaySequenceExecute_C_UpdatePlayerVisibility__Overridden");
static_assert(sizeof(PlaySequenceExecute_C_UpdatePlayerVisibility__Overridden) == 0x000001, "Wrong size on PlaySequenceExecute_C_UpdatePlayerVisibility__Overridden");
static_assert(offsetof(PlaySequenceExecute_C_UpdatePlayerVisibility__Overridden, bHidden) == 0x000000, "Member 'PlaySequenceExecute_C_UpdatePlayerVisibility__Overridden::bHidden' has a wrong offset!");

// Function PlaySequenceExecute.PlaySequenceExecute_C.SetTaskCountDownPause
// 0x0018 (0x0018 - 0x0000)
struct PlaySequenceExecute_C_SetTaskCountDownPause final
{
public:
	bool                                          UsingPause_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsPause;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameTaskActor*                         CallFunc_GetGameTaskActor_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlaySequenceExecute_C_SetTaskCountDownPause) == 0x000008, "Wrong alignment on PlaySequenceExecute_C_SetTaskCountDownPause");
static_assert(sizeof(PlaySequenceExecute_C_SetTaskCountDownPause) == 0x000018, "Wrong size on PlaySequenceExecute_C_SetTaskCountDownPause");
static_assert(offsetof(PlaySequenceExecute_C_SetTaskCountDownPause, UsingPause_0) == 0x000000, "Member 'PlaySequenceExecute_C_SetTaskCountDownPause::UsingPause_0' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_SetTaskCountDownPause, IsPause) == 0x000001, "Member 'PlaySequenceExecute_C_SetTaskCountDownPause::IsPause' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_SetTaskCountDownPause, CallFunc_GetGameTaskActor_ReturnValue) == 0x000008, "Member 'PlaySequenceExecute_C_SetTaskCountDownPause::CallFunc_GetGameTaskActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_SetTaskCountDownPause, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'PlaySequenceExecute_C_SetTaskCountDownPause::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function PlaySequenceExecute.PlaySequenceExecute_C.SetInputDisable
// 0x0018 (0x0018 - 0x0000)
struct PlaySequenceExecute_C_SetInputDisable final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayerController*                  K2Node_DynamicCast_AsGame_Player_Controller;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlaySequenceExecute_C_SetInputDisable) == 0x000008, "Wrong alignment on PlaySequenceExecute_C_SetInputDisable");
static_assert(sizeof(PlaySequenceExecute_C_SetInputDisable) == 0x000018, "Wrong size on PlaySequenceExecute_C_SetInputDisable");
static_assert(offsetof(PlaySequenceExecute_C_SetInputDisable, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'PlaySequenceExecute_C_SetInputDisable::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_SetInputDisable, K2Node_DynamicCast_AsGame_Player_Controller) == 0x000008, "Member 'PlaySequenceExecute_C_SetInputDisable::K2Node_DynamicCast_AsGame_Player_Controller' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_SetInputDisable, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'PlaySequenceExecute_C_SetInputDisable::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function PlaySequenceExecute.PlaySequenceExecute_C.SetPlayBackPos
// 0x0038 (0x0038 - 0x0000)
struct PlaySequenceExecute_C_SetPlayBackPos final
{
public:
	class UMovieSceneSequencePlayer*              SeqPlayer;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneSequencePlaybackParams      K2Node_MakeStruct_MovieSceneSequencePlaybackParams; // 0x0010(0x0028)()
};
static_assert(alignof(PlaySequenceExecute_C_SetPlayBackPos) == 0x000008, "Wrong alignment on PlaySequenceExecute_C_SetPlayBackPos");
static_assert(sizeof(PlaySequenceExecute_C_SetPlayBackPos) == 0x000038, "Wrong size on PlaySequenceExecute_C_SetPlayBackPos");
static_assert(offsetof(PlaySequenceExecute_C_SetPlayBackPos, SeqPlayer) == 0x000000, "Member 'PlaySequenceExecute_C_SetPlayBackPos::SeqPlayer' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_SetPlayBackPos, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000008, "Member 'PlaySequenceExecute_C_SetPlayBackPos::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_SetPlayBackPos, K2Node_MakeStruct_MovieSceneSequencePlaybackParams) == 0x000010, "Member 'PlaySequenceExecute_C_SetPlayBackPos::K2Node_MakeStruct_MovieSceneSequencePlaybackParams' has a wrong offset!");

// Function PlaySequenceExecute.PlaySequenceExecute_C.EnsureSequenceActor
// 0x0140 (0x0140 - 0x0000)
struct PlaySequenceExecute_C_EnsureSequenceActor final
{
public:
	class AActor*                                 SequenceActor;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKeyToSequence                         SequenceInfo;                                      // 0x0008(0x0038)(Edit, BlueprintVisible)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_SpawnActorFromClass_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    K2Node_DynamicCast_As____actor;                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_SoftObjectReferenceToString_ReturnValue; // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_Fixed_Name_name;                      // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        CallFunc_MakeSoftObjectPath_ReturnValue;           // 0x00A8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadUObject_ReturnValue;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKeyToSequence                         CallFunc_GetDataTableRowFromName_OutRow;           // 0x00D0(0x0038)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         K2Node_DynamicCast_As____;                         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_Fixed_Name_name_1;                    // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FindActorByName_ReturnValue;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlaySequenceExecute_C_EnsureSequenceActor) == 0x000010, "Wrong alignment on PlaySequenceExecute_C_EnsureSequenceActor");
static_assert(sizeof(PlaySequenceExecute_C_EnsureSequenceActor) == 0x000140, "Wrong size on PlaySequenceExecute_C_EnsureSequenceActor");
static_assert(offsetof(PlaySequenceExecute_C_EnsureSequenceActor, SequenceActor) == 0x000000, "Member 'PlaySequenceExecute_C_EnsureSequenceActor::SequenceActor' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_EnsureSequenceActor, SequenceInfo) == 0x000008, "Member 'PlaySequenceExecute_C_EnsureSequenceActor::SequenceInfo' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_EnsureSequenceActor, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'PlaySequenceExecute_C_EnsureSequenceActor::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_EnsureSequenceActor, CallFunc_SpawnActorFromClass_ReturnValue) == 0x000070, "Member 'PlaySequenceExecute_C_EnsureSequenceActor::CallFunc_SpawnActorFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_EnsureSequenceActor, K2Node_DynamicCast_As____actor) == 0x000078, "Member 'PlaySequenceExecute_C_EnsureSequenceActor::K2Node_DynamicCast_As____actor' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_EnsureSequenceActor, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'PlaySequenceExecute_C_EnsureSequenceActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_EnsureSequenceActor, CallFunc_Conv_SoftObjectReferenceToString_ReturnValue) == 0x000088, "Member 'PlaySequenceExecute_C_EnsureSequenceActor::CallFunc_Conv_SoftObjectReferenceToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_EnsureSequenceActor, CallFunc_Get_Fixed_Name_name) == 0x000098, "Member 'PlaySequenceExecute_C_EnsureSequenceActor::CallFunc_Get_Fixed_Name_name' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_EnsureSequenceActor, CallFunc_MakeSoftObjectPath_ReturnValue) == 0x0000A8, "Member 'PlaySequenceExecute_C_EnsureSequenceActor::CallFunc_MakeSoftObjectPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_EnsureSequenceActor, CallFunc_Conv_StringToName_ReturnValue) == 0x0000C0, "Member 'PlaySequenceExecute_C_EnsureSequenceActor::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_EnsureSequenceActor, CallFunc_LoadUObject_ReturnValue) == 0x0000C8, "Member 'PlaySequenceExecute_C_EnsureSequenceActor::CallFunc_LoadUObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_EnsureSequenceActor, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000D0, "Member 'PlaySequenceExecute_C_EnsureSequenceActor::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_EnsureSequenceActor, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000108, "Member 'PlaySequenceExecute_C_EnsureSequenceActor::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_EnsureSequenceActor, K2Node_DynamicCast_As____) == 0x000110, "Member 'PlaySequenceExecute_C_EnsureSequenceActor::K2Node_DynamicCast_As____' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_EnsureSequenceActor, K2Node_DynamicCast_bSuccess_1) == 0x000118, "Member 'PlaySequenceExecute_C_EnsureSequenceActor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_EnsureSequenceActor, CallFunc_Get_Fixed_Name_name_1) == 0x000120, "Member 'PlaySequenceExecute_C_EnsureSequenceActor::CallFunc_Get_Fixed_Name_name_1' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_EnsureSequenceActor, CallFunc_FindActorByName_ReturnValue) == 0x000130, "Member 'PlaySequenceExecute_C_EnsureSequenceActor::CallFunc_FindActorByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_EnsureSequenceActor, CallFunc_IsValid_ReturnValue) == 0x000138, "Member 'PlaySequenceExecute_C_EnsureSequenceActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function PlaySequenceExecute.PlaySequenceExecute_C.SetPlayerSeqStatus
// 0x0020 (0x0020 - 0x0000)
struct PlaySequenceExecute_C_SetPlayerSeqStatus final
{
public:
	bool                                          InPlaying;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlaySequenceExecute_C_SetPlayerSeqStatus) == 0x000008, "Wrong alignment on PlaySequenceExecute_C_SetPlayerSeqStatus");
static_assert(sizeof(PlaySequenceExecute_C_SetPlayerSeqStatus) == 0x000020, "Wrong size on PlaySequenceExecute_C_SetPlayerSeqStatus");
static_assert(offsetof(PlaySequenceExecute_C_SetPlayerSeqStatus, InPlaying) == 0x000000, "Member 'PlaySequenceExecute_C_SetPlayerSeqStatus::InPlaying' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_SetPlayerSeqStatus, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'PlaySequenceExecute_C_SetPlayerSeqStatus::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_SetPlayerSeqStatus, K2Node_DynamicCast_AsGame_Character) == 0x000010, "Member 'PlaySequenceExecute_C_SetPlayerSeqStatus::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(PlaySequenceExecute_C_SetPlayerSeqStatus, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PlaySequenceExecute_C_SetPlayerSeqStatus::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// LuaFunction PlaySequenceExecute.PlaySequenceExecute_C.UpdatePlayerVisibility
// 0x0001 (0x0001 - 0x0000)
struct PlaySequenceExecute_C_UpdatePlayerVisibility final
{
public:
	bool                                          bHidden;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlaySequenceExecute_C_UpdatePlayerVisibility) == 0x000001, "Wrong alignment on PlaySequenceExecute_C_UpdatePlayerVisibility");
static_assert(sizeof(PlaySequenceExecute_C_UpdatePlayerVisibility) == 0x000001, "Wrong size on PlaySequenceExecute_C_UpdatePlayerVisibility");
static_assert(offsetof(PlaySequenceExecute_C_UpdatePlayerVisibility, bHidden) == 0x000000, "Member 'PlaySequenceExecute_C_UpdatePlayerVisibility::bHidden' has a wrong offset!");

// Function PlaySequenceExecute.PlaySequenceExecute_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct PlaySequenceExecute_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(PlaySequenceExecute_C_GetModuleName) == 0x000008, "Wrong alignment on PlaySequenceExecute_C_GetModuleName");
static_assert(sizeof(PlaySequenceExecute_C_GetModuleName) == 0x000010, "Wrong size on PlaySequenceExecute_C_GetModuleName");
static_assert(offsetof(PlaySequenceExecute_C_GetModuleName, ReturnValue) == 0x000000, "Member 'PlaySequenceExecute_C_GetModuleName::ReturnValue' has a wrong offset!");

}

