#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerStateMachine

#include "Basic.hpp"

#include "SMSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "BasePlayerStateMachine_classes.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass PlayerStateMachine.PlayerStateMachine_C
// 0x39A8 (0x4008 - 0x0660)
class UPlayerStateMachine_C final : public UBasePlayerStateMachine_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_PlayerStateMachine_C;               // 0x0660(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          PlayerStateMachine_PlayerStateMachine_C;           // 0x0668(0x01A8)()
	struct FSMTransition                          PlayerStateMachine_PlayerStateMachine_C_0;         // 0x0810(0x01A8)()
	struct FSMTransition                          PlayerStateMachine_PlayerStateMachine_C_1;         // 0x09B8(0x01A8)()
	struct FSMTransition                          PlayerStateMachine_PlayerStateMachine_C_2;         // 0x0B60(0x01A8)()
	struct FSMTransition                          PlayerStateMachine_PlayerStateMachine_C_3;         // 0x0D08(0x01A8)()
	struct FSMTransition                          PlayerStateMachine_PlayerStateMachine_C_4;         // 0x0EB0(0x01A8)()
	struct FSMTransition                          PlayerStateMachine_PlayerStateMachine_C_5;         // 0x1058(0x01A8)()
	struct FSMTransition                          PlayerStateMachine_PlayerStateMachine_C_6;         // 0x1200(0x01A8)()
	struct FSMTransition                          PlayerStateMachine_PlayerStateMachine_C_7;         // 0x13A8(0x01A8)()
	struct FSMTransition                          PlayerStateMachine_PlayerStateMachine_C_8;         // 0x1550(0x01A8)()
	struct FSMTransition                          PlayerStateMachine_PlayerStateMachine_C_9;         // 0x16F8(0x01A8)()
	struct FSMTransition                          PlayerStateMachine_PlayerStateMachine_C_10;        // 0x18A0(0x01A8)()
	struct FSMTransition                          PlayerStateMachine_PlayerStateMachine_C_11;        // 0x1A48(0x01A8)()
	struct FSMTransition                          PlayerStateMachine_PlayerStateMachine_C_12;        // 0x1BF0(0x01A8)()
	struct FSMTransition                          PlayerStateMachine_PlayerStateMachine_C_13;        // 0x1D98(0x01A8)()
	struct FSMTransition                          PlayerStateMachine_PlayerStateMachine_C_14;        // 0x1F40(0x01A8)()
	struct FSMTransition                          PlayerStateMachine_PlayerStateMachine_C_15;        // 0x20E8(0x01A8)()
	struct FSMTransition                          PlayerStateMachine_PlayerStateMachine_C_16;        // 0x2290(0x01A8)()
	struct FSMTransition                          PlayerStateMachine_PlayerStateMachine_C_17;        // 0x2438(0x01A8)()
	struct FSMTransition                          PlayerStateMachine_PlayerStateMachine_C_18;        // 0x25E0(0x01A8)()
	struct FSMTransition                          PlayerStateMachine_PlayerStateMachine_C_19;        // 0x2788(0x01A8)()
	struct FSMTransition                          PlayerStateMachine_PlayerStateMachine_C_20;        // 0x2930(0x01A8)()
	struct FSMTransition                          PlayerStateMachine_PlayerStateMachine_C_21;        // 0x2AD8(0x01A8)()
	struct FSMState                               PlayerStateMachine_PlayerStateMachine_C_22;        // 0x2C80(0x01C8)()
	struct FSMState                               PlayerStateMachine_PlayerStateMachine_C_23;        // 0x2E48(0x01C8)()
	struct FSMState                               PlayerStateMachine_PlayerStateMachine_C_24;        // 0x3010(0x01C8)()
	struct FSMState                               PlayerStateMachine_PlayerStateMachine_C_25;        // 0x31D8(0x01C8)()
	struct FSMState                               PlayerStateMachine_PlayerStateMachine_C_26;        // 0x33A0(0x01C8)()
	struct FSMState                               PlayerStateMachine_PlayerStateMachine_C_27;        // 0x3568(0x01C8)()
	struct FSMState                               PlayerStateMachine_PlayerStateMachine_C_28;        // 0x3730(0x01C8)()
	struct FSMState                               PlayerStateMachine_PlayerStateMachine_C_29;        // 0x38F8(0x01C8)()
	struct FSMState                               PlayerStateMachine_PlayerStateMachine_C_30;        // 0x3AC0(0x01C8)()
	struct FSMConduit                             PlayerStateMachine_PlayerStateMachine_C;           // 0x3C88(0x01B8)()
	struct FSMState                               PlayerStateMachine_PlayerStateMachine_C_0;         // 0x3E40(0x01C8)()

public:
	void OnStartDodge();
	void Func_PlayerStateMachine_PlayerStateMachine_C_0();
	void Func_PlayerStateMachine_PlayerStateMachine_C_1();
	void Func_PlayerStateMachine_PlayerStateMachine_C_2();
	void Func_PlayerStateMachine_PlayerStateMachine_C_3();
	void Func_PlayerStateMachine_PlayerStateMachine_C_4();
	void Func_PlayerStateMachine_PlayerStateMachine_C_5();
	void Func_PlayerStateMachine_PlayerStateMachine_C_6();
	void Func_PlayerStateMachine_PlayerStateMachine_C_7();
	void Func_PlayerStateMachine_PlayerStateMachine_C_8();
	void Func_PlayerStateMachine_PlayerStateMachine_C_9();
	void Func_PlayerStateMachine_PlayerStateMachine_C_10();
	void Func_PlayerStateMachine_PlayerStateMachine_C_11();
	void Func_PlayerStateMachine_PlayerStateMachine_C_12();
	void Func_PlayerStateMachine_PlayerStateMachine_C_13();
	void Func_PlayerStateMachine_PlayerStateMachine_C_14();
	void Func_PlayerStateMachine_PlayerStateMachine_C_15();
	void Func_PlayerStateMachine_PlayerStateMachine_C_16();
	void Func_PlayerStateMachine_PlayerStateMachine_C_17();
	void Func_PlayerStateMachine_PlayerStateMachine_C_18();
	void Func_PlayerStateMachine_PlayerStateMachine_C_19();
	void Func_PlayerStateMachine_PlayerStateMachine_C_20();
	void Func_PlayerStateMachine_PlayerStateMachine_C_21();
	void Func_PlayerStateMachine_PlayerStateMachine_C_22();
	void Func_PlayerStateMachine_PlayerStateMachine_C_23();
	void Func_PlayerStateMachine_PlayerStateMachine_C_24();
	void Func_PlayerStateMachine_PlayerStateMachine_C_25();
	void Func_PlayerStateMachine_PlayerStateMachine_C_26();
	void Func_PlayerStateMachine_PlayerStateMachine_C_27();
	void Func_PlayerStateMachine_PlayerStateMachine_C_28();
	void Func_PlayerStateMachine_PlayerStateMachine_C_29();
	void Func_PlayerStateMachine_PlayerStateMachine_C_30();
	void Func_PlayerStateMachine_PlayerStateMachine_C();
	void Func_PlayerStateMachine_PlayerStateMachine_C_0();
	void Func_PlayerStateMachine_PlayerStateMachine_C_1();
	void Func_PlayerStateMachine_PlayerStateMachine_C_2();
	void Func_PlayerStateMachine_PlayerStateMachine_C_3();
	void Func_PlayerStateMachine_PlayerStateMachine_C_4();
	void Func_PlayerStateMachine_PlayerStateMachine_C_5();
	void Func_PlayerStateMachine_PlayerStateMachine_C_6();
	void Func_PlayerStateMachine_PlayerStateMachine_C_7();
	void Func_PlayerStateMachine_PlayerStateMachine_C_8();
	void Func_PlayerStateMachine_PlayerStateMachine_C_9();
	void ExecuteUbergraph_PlayerStateMachine(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PlayerStateMachine_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayerStateMachine_C")
	}
	static class UPlayerStateMachine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerStateMachine_C>();
	}
};
DUMPER7_ASSERTS_UPlayerStateMachine_C;

}

