#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerMovementLogicStateMachine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"
#include "BasePlayerStateMachine_classes.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass PlayerMovementLogicStateMachine.PlayerMovementLogicStateMachine_C
// 0x0C18 (0x1278 - 0x0660)
class UPlayerMovementLogicStateMachine_C final : public UBasePlayerStateMachine_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_PlayerMovementLogicStateMachine_C;  // 0x0660(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          PlayerMovementLogicStateMachine_PlayerMovementLogicStateMachine_C; // 0x0668(0x01A8)()
	struct FSMTransition                          PlayerMovementLogicStateMachine_PlayerMovementLogicStateMachine_C_0; // 0x0810(0x01A8)()
	struct FSMTransition                          PlayerMovementLogicStateMachine_PlayerMovementLogicStateMachine_C_1; // 0x09B8(0x01A8)()
	struct FSMTransition                          PlayerMovementLogicStateMachine_PlayerMovementLogicStateMachine_C_2; // 0x0B60(0x01A8)()
	struct FSMState                               PlayerMovementLogicStateMachine_PlayerMovementLogicStateMachine_C_3; // 0x0D08(0x01C8)()
	struct FSMState                               PlayerMovementLogicStateMachine_PlayerMovementLogicStateMachine_C_4; // 0x0ED0(0x01C8)()
	struct FSMState                               PlayerMovementLogicStateMachine_PlayerMovementLogicStateMachine_C_5; // 0x1098(0x01C8)()
	class UMoveContextObject*                     MoveCtxObj;                                        // 0x1260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         X;                                                 // 0x1268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_126C[0x4];                                     // 0x126C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AThirdPersonPlayerCameraManager*        As_Third_Person_Player_Camera_Manager;             // 0x1270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateCamera();
	void Func_PlayerMovementLogicStateMachine_PlayerMovementLogicStateMachine_C_0();
	void Func_PlayerMovementLogicStateMachine_PlayerMovementLogicStateMachine_C_1();
	void Func_PlayerMovementLogicStateMachine_PlayerMovementLogicStateMachine_C_2();
	void Func_PlayerMovementLogicStateMachine_PlayerMovementLogicStateMachine_C_3();
	void Func_PlayerMovementLogicStateMachine_PlayerMovementLogicStateMachine_C_4();
	void Func_PlayerMovementLogicStateMachine_PlayerMovementLogicStateMachine_C_5();
	void Func_PlayerMovementLogicStateMachine_PlayerMovementLogicStateMachine_C_6();
	void Func_PlayerMovementLogicStateMachine_PlayerMovementLogicStateMachine_C_7();
	void Func_PlayerMovementLogicStateMachine_PlayerMovementLogicStateMachine_C_8();
	void Func_PlayerMovementLogicStateMachine_PlayerMovementLogicStateMachine_C_9();
	void OnStateMachineStart();
	void Tick(float DeltaTime);
	void ExecuteUbergraph_PlayerMovementLogicStateMachine(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PlayerMovementLogicStateMachine_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayerMovementLogicStateMachine_C")
	}
	static class UPlayerMovementLogicStateMachine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerMovementLogicStateMachine_C>();
	}
};
DUMPER7_ASSERTS_UPlayerMovementLogicStateMachine_C;

}

