#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerTombstone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PlayerTombstone.PlayerTombstone_C
// 0x0030 (0x02C8 - 0x0298)
class APlayerTombstone_C final : public AReviveHelper
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCapsuleComponent*                      Capsule;                                           // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      E_prop_interact002_a01_p;                          // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 InteractWidgetClass;                               // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_PlayerTombstone(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerTombstone_C">();
	}
	static class APlayerTombstone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayerTombstone_C>();
	}
};
static_assert(alignof(APlayerTombstone_C) == 0x000008, "Wrong alignment on APlayerTombstone_C");
static_assert(sizeof(APlayerTombstone_C) == 0x0002C8, "Wrong size on APlayerTombstone_C");
static_assert(offsetof(APlayerTombstone_C, UberGraphFrame) == 0x000298, "Member 'APlayerTombstone_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APlayerTombstone_C, Capsule) == 0x0002A0, "Member 'APlayerTombstone_C::Capsule' has a wrong offset!");
static_assert(offsetof(APlayerTombstone_C, Mesh) == 0x0002A8, "Member 'APlayerTombstone_C::Mesh' has a wrong offset!");
static_assert(offsetof(APlayerTombstone_C, E_prop_interact002_a01_p) == 0x0002B0, "Member 'APlayerTombstone_C::E_prop_interact002_a01_p' has a wrong offset!");
static_assert(offsetof(APlayerTombstone_C, DefaultSceneRoot) == 0x0002B8, "Member 'APlayerTombstone_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(APlayerTombstone_C, InteractWidgetClass) == 0x0002C0, "Member 'APlayerTombstone_C::InteractWidgetClass' has a wrong offset!");

}

