#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerMovementLogicStateMachine

#include "Basic.hpp"


namespace SDK::Params
{

// Function PlayerMovementLogicStateMachine.PlayerMovementLogicStateMachine_C.Tick
// 0x0004 (0x0004 - 0x0000)
struct PlayerMovementLogicStateMachine_C_Tick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerMovementLogicStateMachine_C_Tick) == 0x000004, "Wrong alignment on PlayerMovementLogicStateMachine_C_Tick");
static_assert(sizeof(PlayerMovementLogicStateMachine_C_Tick) == 0x000004, "Wrong size on PlayerMovementLogicStateMachine_C_Tick");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_Tick, DeltaTime) == 0x000000, "Member 'PlayerMovementLogicStateMachine_C_Tick::DeltaTime' has a wrong offset!");

// Function PlayerMovementLogicStateMachine.PlayerMovementLogicStateMachine_C.ExecuteUbergraph_PlayerMovementLogicStateMachine
// 0x0068 (0x0068 - 0x0000)
struct PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerMovementComponent*               K2Node_DynamicCast_AsPlayer_Movement_Component;    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMoveContextObject*                     CallFunc_GetMoveCtxObject_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetStateEventId_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetStateEventId_ReturnValue_1;            // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetStateEventId_ReturnValue_2;            // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetStateEventId_ReturnValue_3;            // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_SetCurrentStateId_ReturnValue;            // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_SetCurrentStateId_ReturnValue_1;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player_1;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_SetCurrentStateId_ReturnValue_2;          // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetCurrentStateId_ReturnValue;            // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_ByteByte_ReturnValue;                // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTime;                            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine) == 0x000008, "Wrong alignment on PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine");
static_assert(sizeof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine) == 0x000068, "Wrong size on PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, EntryPoint) == 0x000000, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, K2Node_DynamicCast_AsGame_Player) == 0x000010, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::K2Node_DynamicCast_AsGame_Player' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_GetMovementComponent_ReturnValue) == 0x000020, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, K2Node_DynamicCast_AsPlayer_Movement_Component) == 0x000028, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::K2Node_DynamicCast_AsPlayer_Movement_Component' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_GetMoveCtxObject_ReturnValue) == 0x000038, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_GetMoveCtxObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_GetStateEventId_ReturnValue) == 0x000040, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_GetStateEventId_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_MakeLiteralByte_ReturnValue) == 0x000041, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_GetStateEventId_ReturnValue_1) == 0x000042, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_GetStateEventId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_GetStateEventId_ReturnValue_2) == 0x000043, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_GetStateEventId_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000044, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_GetStateEventId_ReturnValue_3) == 0x000045, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_GetStateEventId_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_SetCurrentStateId_ReturnValue) == 0x000046, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_SetCurrentStateId_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000047, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000048, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000049, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00004A, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x00004B, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_SetCurrentStateId_ReturnValue_1) == 0x00004C, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_SetCurrentStateId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_IsValid_ReturnValue) == 0x00004D, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, K2Node_DynamicCast_AsGame_Player_1) == 0x000050, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::K2Node_DynamicCast_AsGame_Player_1' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_IsValid_ReturnValue_1) == 0x000059, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x00005A, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00005B, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x00005C, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x00005D, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00005E, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_SetCurrentStateId_ReturnValue_2) == 0x00005F, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_SetCurrentStateId_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_Not_PreBool_ReturnValue) == 0x000060, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_GetCurrentStateId_ReturnValue) == 0x000061, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_GetCurrentStateId_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, CallFunc_Less_ByteByte_ReturnValue) == 0x000062, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::CallFunc_Less_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine, K2Node_Event_DeltaTime) == 0x000064, "Member 'PlayerMovementLogicStateMachine_C_ExecuteUbergraph_PlayerMovementLogicStateMachine::K2Node_Event_DeltaTime' has a wrong offset!");

}

