#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerTombstone

#include "Basic.hpp"


namespace SDK::Params
{

// Function PlayerTombstone.PlayerTombstone_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct PlayerTombstone_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerTombstone_C_ReceiveTick) == 0x000004, "Wrong alignment on PlayerTombstone_C_ReceiveTick");
static_assert(sizeof(PlayerTombstone_C_ReceiveTick) == 0x000004, "Wrong size on PlayerTombstone_C_ReceiveTick");
static_assert(offsetof(PlayerTombstone_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'PlayerTombstone_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function PlayerTombstone.PlayerTombstone_C.ExecuteUbergraph_PlayerTombstone
// 0x000C (0x000C - 0x0000)
struct PlayerTombstone_C_ExecuteUbergraph_PlayerTombstone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActorEnableCollision_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerTombstone_C_ExecuteUbergraph_PlayerTombstone) == 0x000004, "Wrong alignment on PlayerTombstone_C_ExecuteUbergraph_PlayerTombstone");
static_assert(sizeof(PlayerTombstone_C_ExecuteUbergraph_PlayerTombstone) == 0x00000C, "Wrong size on PlayerTombstone_C_ExecuteUbergraph_PlayerTombstone");
static_assert(offsetof(PlayerTombstone_C_ExecuteUbergraph_PlayerTombstone, EntryPoint) == 0x000000, "Member 'PlayerTombstone_C_ExecuteUbergraph_PlayerTombstone::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerTombstone_C_ExecuteUbergraph_PlayerTombstone, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'PlayerTombstone_C_ExecuteUbergraph_PlayerTombstone::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(PlayerTombstone_C_ExecuteUbergraph_PlayerTombstone, CallFunc_GetActorEnableCollision_ReturnValue) == 0x000008, "Member 'PlayerTombstone_C_ExecuteUbergraph_PlayerTombstone::CallFunc_GetActorEnableCollision_ReturnValue' has a wrong offset!");

// Function PlayerTombstone.PlayerTombstone_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct PlayerTombstone_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(PlayerTombstone_C_GetModuleName) == 0x000008, "Wrong alignment on PlayerTombstone_C_GetModuleName");
static_assert(sizeof(PlayerTombstone_C_GetModuleName) == 0x000010, "Wrong size on PlayerTombstone_C_GetModuleName");
static_assert(offsetof(PlayerTombstone_C_GetModuleName, ReturnValue) == 0x000000, "Member 'PlayerTombstone_C_GetModuleName::ReturnValue' has a wrong offset!");

}

