#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Plot

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MovieScene_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum Plot.EHandDrawPlayType
// NumValues: 0x0004
enum class EHandDrawPlayType : uint8
{
	Normal                                   = 0,
	Force                                    = 1,
	Hide                                     = 2,
	EHandDrawPlayType_MAX                    = 3,
};

// Enum Plot.EPlotWidgetOrderType
// NumValues: 0x0004
enum class EPlotWidgetOrderType : uint8
{
	All                                      = 0,
	RoleAndBg                                = 3,
	Bg                                       = 10,
	EPlotWidgetOrderType_MAX                 = 11,
};

// Enum Plot.EPlotScreenType
// NumValues: 0x0004
enum class EPlotScreenType : uint8
{
	Global                                   = 0,
	First                                    = 1,
	Second                                   = 2,
	EPlotScreenType_MAX                      = 3,
};

// Enum Plot.EPlotCompleteType
// NumValues: 0x0004
enum class EPlotCompleteType : uint8
{
	Normal                                   = 0,
	Skip                                     = 1,
	Close                                    = 2,
	EPlotCompleteType_MAX                    = 3,
};

// Enum Plot.EDialogueType
// NumValues: 0x0006
enum class EDialogueType : uint8
{
	None                                     = 0,
	Normal                                   = 1,
	Fight                                    = 2,
	Animation                                = 3,
	Stage                                    = 4,
	EDialogueType_MAX                        = 5,
};

// Enum Plot.EPlotPostProcessEffectType
// NumValues: 0x0007
enum class EPlotPostProcessEffectType : uint8
{
	Recall                                   = 0,
	Twinkle                                  = 1,
	SpeedLine                                = 2,
	ColorTint                                = 3,
	Shake                                    = 4,
	Noise                                    = 5,
	EPlotPostProcessEffectType_MAX           = 6,
};

// Enum Plot.EScreenTransitionEffectType
// NumValues: 0x0008
enum class EScreenTransitionEffectType : uint8
{
	Mosaic                                   = 0,
	BlackBackground                          = 1,
	WhiteBackground                          = 2,
	CloseEye                                 = 3,
	OpenEye                                  = 4,
	DiffusionBegin                           = 5,
	DiffusionEnd                             = 6,
	EScreenTransitionEffectType_MAX          = 7,
};

// Enum Plot.ESpineEffectType
// NumValues: 0x0008
enum class ESpineEffectType : uint8
{
	None                                     = 0,
	Normal                                   = 1,
	Message                                  = 2,
	Ghost                                    = 3,
	NormalDisappear                          = 4,
	HalfBlack                                = 5,
	HalfBlackMessage                         = 6,
	ESpineEffectType_MAX                     = 7,
};

// Enum Plot.ECameraMotionType
// NumValues: 0x0005
enum class ECameraMotionType : uint8
{
	ChangeProperty                           = 0,
	MoveMainCamera                           = 1,
	FollowRole                               = 2,
	MoveToTarget                             = 3,
	ECameraMotionType_MAX                    = 4,
};

// Enum Plot.EPlotBgSwitchType
// NumValues: 0x0003
enum class EPlotBgSwitchType : uint8
{
	Default                                  = 0,
	Dissolve                                 = 1,
	EPlotBgSwitchType_MAX                    = 2,
};

// Enum Plot.EWaitOperationType
// NumValues: 0x0003
enum class EWaitOperationType : uint8
{
	WaitForCompletion                        = 0,
	WaitAll                                  = 1,
	EWaitOperationType_MAX                   = 2,
};

// Enum Plot.EFowardType
// NumValues: 0x0003
enum class EFowardType : uint8
{
	Click                                    = 0,
	Time                                     = 1,
	EFowardType_MAX                          = 2,
};

// Enum Plot.EPlotType
// NumValues: 0x0003
enum class EPlotType : uint8
{
	Plot                                     = 0,
	CG                                       = 1,
	EPlotType_MAX                            = 2,
};

// Enum Plot.EPlayControllerType
// NumValues: 0x0005
enum class EPlayControllerType : uint8
{
	Computer                                 = 0,
	Phone                                    = 1,
	Gamepad_Xbox                             = 2,
	Gamepad_PS                               = 3,
	EPlayControllerType_MAX                  = 4,
};

// Enum Plot.EPlotCategory
// NumValues: 0x0003
enum class EPlotCategory : uint8
{
	Plot2D                                   = 0,
	Plot3D                                   = 1,
	EPlotCategory_MAX                        = 2,
};

// Enum Plot.EPlotSpinePos
// NumValues: 0x0007
enum class EPlotSpinePos : uint8
{
	Pos1                                     = 0,
	Pos2                                     = 1,
	Pos3                                     = 2,
	Pos4                                     = 3,
	Pos5                                     = 4,
	Pos6                                     = 5,
	EPlotSpinePos_MAX                        = 6,
};

// Enum Plot.EPlotTextAnchorLayoutType
// NumValues: 0x0008
enum class EPlotTextAnchorLayoutType : uint8
{
	LeftTop                                  = 0,
	RightTop                                 = 1,
	RightBottom                              = 2,
	LeftBottom                               = 3,
	Center                                   = 4,
	CenterBottom                             = 5,
	CenterTop                                = 6,
	EPlotTextAnchorLayoutType_MAX            = 7,
};

// Enum Plot.EPlotSubtitlesFadeInType
// NumValues: 0x0003
enum class EPlotSubtitlesFadeInType : uint8
{
	Normal                                   = 0,
	Mask                                     = 1,
	EPlotSubtitlesFadeInType_MAX             = 2,
};

// Enum Plot.EDialogueOperationType
// NumValues: 0x0004
enum class EDialogueOperationType : uint8
{
	User                                     = 0,
	Normal                                   = 1,
	Stage                                    = 2,
	EDialogueOperationType_MAX               = 3,
};

// Enum Plot.EPlayMode
// NumValues: 0x0004
enum class EPlayMode : uint8
{
	Normal                                   = 0,
	Auto                                     = 1,
	Jump                                     = 2,
	EPlayMode_MAX                            = 3,
};

// Enum Plot.EPlotSwitchScreenEntryType
// NumValues: 0x0003
enum class EPlotSwitchScreenEntryType : uint8
{
	EntryFromRight                           = 0,
	EntryFromLeft                            = 1,
	EPlotSwitchScreenEntryType_MAX           = 2,
};

// Enum Plot.ESpliceType
// NumValues: 0x0003
enum class ESpliceType : uint8
{
	Vertical                                 = 0,
	Horizontal                               = 1,
	ESpliceType_MAX                          = 2,
};

// Enum Plot.EWwiseVolumeType
// NumValues: 0x0006
enum class EWwiseVolumeType : uint8
{
	None                                     = 0,
	Voice                                    = 1,
	Sound                                    = 2,
	Music                                    = 3,
	Master                                   = 4,
	EWwiseVolumeType_MAX                     = 5,
};

// Enum Plot.ERoleControlActionType
// NumValues: 0x000A
enum class ERoleControlActionType : uint8
{
	Move                                     = 0,
	Animation                                = 1,
	FaceToTarget                             = 2,
	LookAtForward                            = 3,
	StopFaceToTarget                         = 4,
	Location                                 = 5,
	Rotation                                 = 6,
	LocationAndRotation                      = 7,
	FacialExpression                         = 8,
	ERoleControlActionType_MAX               = 9,
};

// Enum Plot.EPlotOutShowType
// NumValues: 0x0003
enum class EPlotOutShowType : uint8
{
	Place                                    = 0,
	Time                                     = 1,
	EPlotOutShowType_MAX                     = 2,
};

// Enum Plot.EPlotItemUINodeType
// NumValues: 0x0005
enum class EPlotItemUINodeType : uint8
{
	None                                     = 0,
	DialogueNode                             = 1,
	PanelAside                               = 2,
	UINode                                   = 3,
	EPlotItemUINodeType_MAX                  = 4,
};

// Enum Plot.ESpineChangeEffectType
// NumValues: 0x0008
enum class ESpineChangeEffectType : uint8
{
	ToWhite                                  = 0,
	ToNormal                                 = 1,
	CancelBack                               = 2,
	GhostToDisappear                         = 3,
	NormalToDisappear                        = 4,
	DisappearToGhost                         = 5,
	DisappearToNormal                        = 6,
	ESpineChangeEffectType_MAX               = 7,
};

// Enum Plot.ETalkState
// NumValues: 0x0004
enum class ETalkState : uint8
{
	Noraml                                   = 0,
	Talk                                     = 1,
	CountDown                                = 2,
	ETalkState_MAX                           = 3,
};

// Enum Plot.EPlotWidgetType
// NumValues: 0x0003
enum class EPlotWidgetType : uint8
{
	StaticRoleImage                          = 0,
	Spine                                    = 1,
	EPlotWidgetType_MAX                      = 2,
};

// ScriptStruct Plot.HandDrawAxisParams
// 0x0008 (0x0008 - 0x0000)
struct FHandDrawAxisParams final
{
public:
	int32                                         Index;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHandDrawPlayType                             PlayType;                                          // 0x0004(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHandDrawAxisParams) == 0x000004, "Wrong alignment on FHandDrawAxisParams");
static_assert(sizeof(FHandDrawAxisParams) == 0x000008, "Wrong size on FHandDrawAxisParams");
static_assert(offsetof(FHandDrawAxisParams, Index) == 0x000000, "Member 'FHandDrawAxisParams::Index' has a wrong offset!");
static_assert(offsetof(FHandDrawAxisParams, PlayType) == 0x000004, "Member 'FHandDrawAxisParams::PlayType' has a wrong offset!");

// ScriptStruct Plot.PlotCameraInfo
// 0x0058 (0x0058 - 0x0000)
struct FPlotCameraInfo final
{
public:
	ECameraMotionType                             CameraMotionType;                                  // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Postion;                                           // 0x0004(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotator;                                           // 0x0010(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         FOV;                                               // 0x001C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Offset;                                            // 0x0020(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetCameraName;                                  // 0x002C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveTime;                                          // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FollowRoleName;                                    // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Direction;                                         // 0x0048(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPlotCameraInfo) == 0x000008, "Wrong alignment on FPlotCameraInfo");
static_assert(sizeof(FPlotCameraInfo) == 0x000058, "Wrong size on FPlotCameraInfo");
static_assert(offsetof(FPlotCameraInfo, CameraMotionType) == 0x000000, "Member 'FPlotCameraInfo::CameraMotionType' has a wrong offset!");
static_assert(offsetof(FPlotCameraInfo, Postion) == 0x000004, "Member 'FPlotCameraInfo::Postion' has a wrong offset!");
static_assert(offsetof(FPlotCameraInfo, Rotator) == 0x000010, "Member 'FPlotCameraInfo::Rotator' has a wrong offset!");
static_assert(offsetof(FPlotCameraInfo, FOV) == 0x00001C, "Member 'FPlotCameraInfo::FOV' has a wrong offset!");
static_assert(offsetof(FPlotCameraInfo, Offset) == 0x000020, "Member 'FPlotCameraInfo::Offset' has a wrong offset!");
static_assert(offsetof(FPlotCameraInfo, TargetCameraName) == 0x00002C, "Member 'FPlotCameraInfo::TargetCameraName' has a wrong offset!");
static_assert(offsetof(FPlotCameraInfo, MoveTime) == 0x000034, "Member 'FPlotCameraInfo::MoveTime' has a wrong offset!");
static_assert(offsetof(FPlotCameraInfo, FollowRoleName) == 0x000038, "Member 'FPlotCameraInfo::FollowRoleName' has a wrong offset!");
static_assert(offsetof(FPlotCameraInfo, Direction) == 0x000048, "Member 'FPlotCameraInfo::Direction' has a wrong offset!");

// ScriptStruct Plot.PlotAccessoriesInfo
// 0x0020 (0x0020 - 0x0000)
struct FPlotAccessoriesInfo final
{
public:
	struct FSoftObjectPath                        Accessorie;                                        // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SokectName;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPlotAccessoriesInfo) == 0x000008, "Wrong alignment on FPlotAccessoriesInfo");
static_assert(sizeof(FPlotAccessoriesInfo) == 0x000020, "Wrong size on FPlotAccessoriesInfo");
static_assert(offsetof(FPlotAccessoriesInfo, Accessorie) == 0x000000, "Member 'FPlotAccessoriesInfo::Accessorie' has a wrong offset!");
static_assert(offsetof(FPlotAccessoriesInfo, SokectName) == 0x000018, "Member 'FPlotAccessoriesInfo::SokectName' has a wrong offset!");

// ScriptStruct Plot.SpineParameters
// 0x0050 (0x0050 - 0x0000)
struct FSpineParameters final
{
public:
	ESpineEffectType                              SpineEffectType;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Offset;                                            // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Animation;                                         // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LoopStandAnimation;                                // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ZOrder;                                            // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x0041(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HalfBlackDarkValue;                                // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HalfBlackSmoothStrength;                           // 0x0048(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSpineParameters) == 0x000008, "Wrong alignment on FSpineParameters");
static_assert(sizeof(FSpineParameters) == 0x000050, "Wrong size on FSpineParameters");
static_assert(offsetof(FSpineParameters, SpineEffectType) == 0x000000, "Member 'FSpineParameters::SpineEffectType' has a wrong offset!");
static_assert(offsetof(FSpineParameters, Offset) == 0x000004, "Member 'FSpineParameters::Offset' has a wrong offset!");
static_assert(offsetof(FSpineParameters, Scale) == 0x00000C, "Member 'FSpineParameters::Scale' has a wrong offset!");
static_assert(offsetof(FSpineParameters, Color) == 0x000010, "Member 'FSpineParameters::Color' has a wrong offset!");
static_assert(offsetof(FSpineParameters, Animation) == 0x000020, "Member 'FSpineParameters::Animation' has a wrong offset!");
static_assert(offsetof(FSpineParameters, LoopStandAnimation) == 0x000030, "Member 'FSpineParameters::LoopStandAnimation' has a wrong offset!");
static_assert(offsetof(FSpineParameters, ZOrder) == 0x000040, "Member 'FSpineParameters::ZOrder' has a wrong offset!");
static_assert(offsetof(FSpineParameters, bLoop) == 0x000041, "Member 'FSpineParameters::bLoop' has a wrong offset!");
static_assert(offsetof(FSpineParameters, HalfBlackDarkValue) == 0x000044, "Member 'FSpineParameters::HalfBlackDarkValue' has a wrong offset!");
static_assert(offsetof(FSpineParameters, HalfBlackSmoothStrength) == 0x000048, "Member 'FSpineParameters::HalfBlackSmoothStrength' has a wrong offset!");

// ScriptStruct Plot.FacialMorphTargetInfo
// 0x000C (0x000C - 0x0000)
struct FFacialMorphTargetInfo final
{
public:
	class FName                                   MorphTargetName;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimationTime;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFacialMorphTargetInfo) == 0x000004, "Wrong alignment on FFacialMorphTargetInfo");
static_assert(sizeof(FFacialMorphTargetInfo) == 0x00000C, "Wrong size on FFacialMorphTargetInfo");
static_assert(offsetof(FFacialMorphTargetInfo, MorphTargetName) == 0x000000, "Member 'FFacialMorphTargetInfo::MorphTargetName' has a wrong offset!");
static_assert(offsetof(FFacialMorphTargetInfo, AnimationTime) == 0x000008, "Member 'FFacialMorphTargetInfo::AnimationTime' has a wrong offset!");

// ScriptStruct Plot.FacialAnimationGroup
// 0x0020 (0x0020 - 0x0000)
struct FFacialAnimationGroup final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FacialAnimName;                                    // 0x0004(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFacialMorphTargetInfo>         AnimDatas;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFacialAnimationGroup) == 0x000008, "Wrong alignment on FFacialAnimationGroup");
static_assert(sizeof(FFacialAnimationGroup) == 0x000020, "Wrong size on FFacialAnimationGroup");
static_assert(offsetof(FFacialAnimationGroup, ID) == 0x000000, "Member 'FFacialAnimationGroup::ID' has a wrong offset!");
static_assert(offsetof(FFacialAnimationGroup, FacialAnimName) == 0x000004, "Member 'FFacialAnimationGroup::FacialAnimName' has a wrong offset!");
static_assert(offsetof(FFacialAnimationGroup, AnimDatas) == 0x000010, "Member 'FFacialAnimationGroup::AnimDatas' has a wrong offset!");

// ScriptStruct Plot.PlotRoleControlArgs
// 0x00A8 (0x00A8 - 0x0000)
struct FPlotRoleControlArgs final
{
public:
	class FString                                 ShowName;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ModelID;                                           // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LookAtRoleName;                                    // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LookAtSocketName;                                  // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LookAtSpeed;                                       // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        Anim;                                              // 0x0038(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LoopNum;                                           // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0054(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TargetLocation;                                    // 0x0060(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveTime;                                          // 0x006C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotator;                                           // 0x0070(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFacialAnimationGroup                  FacialAnimationGroup;                              // 0x0080(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                          bHide;                                             // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowWeapon;                                       // 0x00A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPlotRoleControlArgs) == 0x000008, "Wrong alignment on FPlotRoleControlArgs");
static_assert(sizeof(FPlotRoleControlArgs) == 0x0000A8, "Wrong size on FPlotRoleControlArgs");
static_assert(offsetof(FPlotRoleControlArgs, ShowName) == 0x000000, "Member 'FPlotRoleControlArgs::ShowName' has a wrong offset!");
static_assert(offsetof(FPlotRoleControlArgs, ModelID) == 0x000010, "Member 'FPlotRoleControlArgs::ModelID' has a wrong offset!");
static_assert(offsetof(FPlotRoleControlArgs, LookAtRoleName) == 0x000018, "Member 'FPlotRoleControlArgs::LookAtRoleName' has a wrong offset!");
static_assert(offsetof(FPlotRoleControlArgs, LookAtSocketName) == 0x000028, "Member 'FPlotRoleControlArgs::LookAtSocketName' has a wrong offset!");
static_assert(offsetof(FPlotRoleControlArgs, LookAtSpeed) == 0x000030, "Member 'FPlotRoleControlArgs::LookAtSpeed' has a wrong offset!");
static_assert(offsetof(FPlotRoleControlArgs, Anim) == 0x000038, "Member 'FPlotRoleControlArgs::Anim' has a wrong offset!");
static_assert(offsetof(FPlotRoleControlArgs, LoopNum) == 0x000050, "Member 'FPlotRoleControlArgs::LoopNum' has a wrong offset!");
static_assert(offsetof(FPlotRoleControlArgs, Position) == 0x000054, "Member 'FPlotRoleControlArgs::Position' has a wrong offset!");
static_assert(offsetof(FPlotRoleControlArgs, TargetLocation) == 0x000060, "Member 'FPlotRoleControlArgs::TargetLocation' has a wrong offset!");
static_assert(offsetof(FPlotRoleControlArgs, MoveTime) == 0x00006C, "Member 'FPlotRoleControlArgs::MoveTime' has a wrong offset!");
static_assert(offsetof(FPlotRoleControlArgs, Rotator) == 0x000070, "Member 'FPlotRoleControlArgs::Rotator' has a wrong offset!");
static_assert(offsetof(FPlotRoleControlArgs, FacialAnimationGroup) == 0x000080, "Member 'FPlotRoleControlArgs::FacialAnimationGroup' has a wrong offset!");
static_assert(offsetof(FPlotRoleControlArgs, bHide) == 0x0000A0, "Member 'FPlotRoleControlArgs::bHide' has a wrong offset!");
static_assert(offsetof(FPlotRoleControlArgs, bShowWeapon) == 0x0000A1, "Member 'FPlotRoleControlArgs::bShowWeapon' has a wrong offset!");

// ScriptStruct Plot.BackgroundSubtitlesParams
// 0x0010 (0x0010 - 0x0000)
struct FBackgroundSubtitlesParams final
{
public:
	EFowardType                                   FowardType;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlotSubtitlesFadeInType                      FadeInType;                                        // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendInTime;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaitTime;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendOutTime;                                      // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBackgroundSubtitlesParams) == 0x000004, "Wrong alignment on FBackgroundSubtitlesParams");
static_assert(sizeof(FBackgroundSubtitlesParams) == 0x000010, "Wrong size on FBackgroundSubtitlesParams");
static_assert(offsetof(FBackgroundSubtitlesParams, FowardType) == 0x000000, "Member 'FBackgroundSubtitlesParams::FowardType' has a wrong offset!");
static_assert(offsetof(FBackgroundSubtitlesParams, FadeInType) == 0x000001, "Member 'FBackgroundSubtitlesParams::FadeInType' has a wrong offset!");
static_assert(offsetof(FBackgroundSubtitlesParams, BlendInTime) == 0x000004, "Member 'FBackgroundSubtitlesParams::BlendInTime' has a wrong offset!");
static_assert(offsetof(FBackgroundSubtitlesParams, WaitTime) == 0x000008, "Member 'FBackgroundSubtitlesParams::WaitTime' has a wrong offset!");
static_assert(offsetof(FBackgroundSubtitlesParams, BlendOutTime) == 0x00000C, "Member 'FBackgroundSubtitlesParams::BlendOutTime' has a wrong offset!");

// ScriptStruct Plot.SelectItemData
// 0x0040 (0x0040 - 0x0000)
struct FSelectItemData
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPlotCondition*>                 AppearCondition;                                   // 0x0008(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UPlotCondition*>                 DisAppearCondition;                                // 0x0018(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         Index;                                             // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SelectNum;                                         // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Highlight;                                         // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0xF];                                       // 0x0031(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSelectItemData) == 0x000008, "Wrong alignment on FSelectItemData");
static_assert(sizeof(FSelectItemData) == 0x000040, "Wrong size on FSelectItemData");
static_assert(offsetof(FSelectItemData, AppearCondition) == 0x000008, "Member 'FSelectItemData::AppearCondition' has a wrong offset!");
static_assert(offsetof(FSelectItemData, DisAppearCondition) == 0x000018, "Member 'FSelectItemData::DisAppearCondition' has a wrong offset!");
static_assert(offsetof(FSelectItemData, Index) == 0x000028, "Member 'FSelectItemData::Index' has a wrong offset!");
static_assert(offsetof(FSelectItemData, SelectNum) == 0x00002C, "Member 'FSelectItemData::SelectNum' has a wrong offset!");
static_assert(offsetof(FSelectItemData, Highlight) == 0x000030, "Member 'FSelectItemData::Highlight' has a wrong offset!");

// ScriptStruct Plot.BackgroundSubtitlesOneByOneParams
// 0x000C (0x000C - 0x0000)
struct FBackgroundSubtitlesOneByOneParams final
{
public:
	float                                         Speed;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeOut;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DirTime;                                           // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBackgroundSubtitlesOneByOneParams) == 0x000004, "Wrong alignment on FBackgroundSubtitlesOneByOneParams");
static_assert(sizeof(FBackgroundSubtitlesOneByOneParams) == 0x00000C, "Wrong size on FBackgroundSubtitlesOneByOneParams");
static_assert(offsetof(FBackgroundSubtitlesOneByOneParams, Speed) == 0x000000, "Member 'FBackgroundSubtitlesOneByOneParams::Speed' has a wrong offset!");
static_assert(offsetof(FBackgroundSubtitlesOneByOneParams, FadeOut) == 0x000004, "Member 'FBackgroundSubtitlesOneByOneParams::FadeOut' has a wrong offset!");
static_assert(offsetof(FBackgroundSubtitlesOneByOneParams, DirTime) == 0x000008, "Member 'FBackgroundSubtitlesOneByOneParams::DirTime' has a wrong offset!");

// ScriptStruct Plot.BlendParameters
// 0x0010 (0x0010 - 0x0000)
struct FBlendParameters final
{
public:
	EPlotBgSwitchType                             SwitchType;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendInTime;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaitTime;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendOutTime;                                      // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBlendParameters) == 0x000004, "Wrong alignment on FBlendParameters");
static_assert(sizeof(FBlendParameters) == 0x000010, "Wrong size on FBlendParameters");
static_assert(offsetof(FBlendParameters, SwitchType) == 0x000000, "Member 'FBlendParameters::SwitchType' has a wrong offset!");
static_assert(offsetof(FBlendParameters, BlendInTime) == 0x000004, "Member 'FBlendParameters::BlendInTime' has a wrong offset!");
static_assert(offsetof(FBlendParameters, WaitTime) == 0x000008, "Member 'FBlendParameters::WaitTime' has a wrong offset!");
static_assert(offsetof(FBlendParameters, BlendOutTime) == 0x00000C, "Member 'FBlendParameters::BlendOutTime' has a wrong offset!");

// ScriptStruct Plot.ConfigItem
// 0x0080 (0x0080 - 0x0000)
struct FConfigItem final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Pos;                                               // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Flag;                                              // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Speaker;                                           // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RealSpeaker;                                       // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Content;                                           // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WwiseEventID;                                      // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x18];                                      // 0x0068(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FConfigItem) == 0x000008, "Wrong alignment on FConfigItem");
static_assert(sizeof(FConfigItem) == 0x000080, "Wrong size on FConfigItem");
static_assert(offsetof(FConfigItem, Key) == 0x000000, "Member 'FConfigItem::Key' has a wrong offset!");
static_assert(offsetof(FConfigItem, Pos) == 0x000010, "Member 'FConfigItem::Pos' has a wrong offset!");
static_assert(offsetof(FConfigItem, Flag) == 0x000018, "Member 'FConfigItem::Flag' has a wrong offset!");
static_assert(offsetof(FConfigItem, Speaker) == 0x000028, "Member 'FConfigItem::Speaker' has a wrong offset!");
static_assert(offsetof(FConfigItem, RealSpeaker) == 0x000038, "Member 'FConfigItem::RealSpeaker' has a wrong offset!");
static_assert(offsetof(FConfigItem, Content) == 0x000048, "Member 'FConfigItem::Content' has a wrong offset!");
static_assert(offsetof(FConfigItem, WwiseEventID) == 0x000058, "Member 'FConfigItem::WwiseEventID' has a wrong offset!");

// ScriptStruct Plot.PlotName2Img
// 0x0120 (0x0128 - 0x0008)
struct FPlotName2Img final : public FTableRowBase
{
public:
	class FString                                 Key;                                               // 0x0008(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleName;                                          // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ImgPath;                                           // 0x0028(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        HeadImagePath;                                     // 0x0040(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ImageSpritePath;                                   // 0x0058(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        MessageHeadPath;                                   // 0x0070(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        SpineAtlas;                                        // 0x0088(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        SpineSkeletonData;                                 // 0x00A0(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpineAtlasScale;                                   // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              SpineAtlasOffset;                                  // 0x00BC(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpineParameters                       DefaultSpineParameters;                            // 0x00C8(0x0050)(Edit, NativeAccessSpecifierPublic)
	float                                         AdditionalImageScale;                              // 0x0118(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpinePlotDefaultScale;                             // 0x011C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SpeakingTogether;                                  // 0x0120(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPlotName2Img) == 0x000008, "Wrong alignment on FPlotName2Img");
static_assert(sizeof(FPlotName2Img) == 0x000128, "Wrong size on FPlotName2Img");
static_assert(offsetof(FPlotName2Img, Key) == 0x000008, "Member 'FPlotName2Img::Key' has a wrong offset!");
static_assert(offsetof(FPlotName2Img, RoleName) == 0x000018, "Member 'FPlotName2Img::RoleName' has a wrong offset!");
static_assert(offsetof(FPlotName2Img, ImgPath) == 0x000028, "Member 'FPlotName2Img::ImgPath' has a wrong offset!");
static_assert(offsetof(FPlotName2Img, HeadImagePath) == 0x000040, "Member 'FPlotName2Img::HeadImagePath' has a wrong offset!");
static_assert(offsetof(FPlotName2Img, ImageSpritePath) == 0x000058, "Member 'FPlotName2Img::ImageSpritePath' has a wrong offset!");
static_assert(offsetof(FPlotName2Img, MessageHeadPath) == 0x000070, "Member 'FPlotName2Img::MessageHeadPath' has a wrong offset!");
static_assert(offsetof(FPlotName2Img, SpineAtlas) == 0x000088, "Member 'FPlotName2Img::SpineAtlas' has a wrong offset!");
static_assert(offsetof(FPlotName2Img, SpineSkeletonData) == 0x0000A0, "Member 'FPlotName2Img::SpineSkeletonData' has a wrong offset!");
static_assert(offsetof(FPlotName2Img, SpineAtlasScale) == 0x0000B8, "Member 'FPlotName2Img::SpineAtlasScale' has a wrong offset!");
static_assert(offsetof(FPlotName2Img, SpineAtlasOffset) == 0x0000BC, "Member 'FPlotName2Img::SpineAtlasOffset' has a wrong offset!");
static_assert(offsetof(FPlotName2Img, DefaultSpineParameters) == 0x0000C8, "Member 'FPlotName2Img::DefaultSpineParameters' has a wrong offset!");
static_assert(offsetof(FPlotName2Img, AdditionalImageScale) == 0x000118, "Member 'FPlotName2Img::AdditionalImageScale' has a wrong offset!");
static_assert(offsetof(FPlotName2Img, SpinePlotDefaultScale) == 0x00011C, "Member 'FPlotName2Img::SpinePlotDefaultScale' has a wrong offset!");
static_assert(offsetof(FPlotName2Img, SpeakingTogether) == 0x000120, "Member 'FPlotName2Img::SpeakingTogether' has a wrong offset!");

// ScriptStruct Plot.TalkConfig
// 0x0030 (0x0030 - 0x0000)
struct FTalkConfig final
{
public:
	struct FSoftObjectPath                        Img;                                               // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FontSize;                                          // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBold;                                             // 0x001C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFowardType                                   FowardType;                                        // 0x001D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Time;                                              // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDialogueType                                 DialogueType;                                      // 0x0024(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TalkPlaySpeed;                                     // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCustomSpeed;                                   // 0x002C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseDefaultFontParams;                             // 0x002D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTalkConfig) == 0x000008, "Wrong alignment on FTalkConfig");
static_assert(sizeof(FTalkConfig) == 0x000030, "Wrong size on FTalkConfig");
static_assert(offsetof(FTalkConfig, Img) == 0x000000, "Member 'FTalkConfig::Img' has a wrong offset!");
static_assert(offsetof(FTalkConfig, FontSize) == 0x000018, "Member 'FTalkConfig::FontSize' has a wrong offset!");
static_assert(offsetof(FTalkConfig, bBold) == 0x00001C, "Member 'FTalkConfig::bBold' has a wrong offset!");
static_assert(offsetof(FTalkConfig, FowardType) == 0x00001D, "Member 'FTalkConfig::FowardType' has a wrong offset!");
static_assert(offsetof(FTalkConfig, Time) == 0x000020, "Member 'FTalkConfig::Time' has a wrong offset!");
static_assert(offsetof(FTalkConfig, DialogueType) == 0x000024, "Member 'FTalkConfig::DialogueType' has a wrong offset!");
static_assert(offsetof(FTalkConfig, TalkPlaySpeed) == 0x000028, "Member 'FTalkConfig::TalkPlaySpeed' has a wrong offset!");
static_assert(offsetof(FTalkConfig, bUseCustomSpeed) == 0x00002C, "Member 'FTalkConfig::bUseCustomSpeed' has a wrong offset!");
static_assert(offsetof(FTalkConfig, bUseDefaultFontParams) == 0x00002D, "Member 'FTalkConfig::bUseDefaultFontParams' has a wrong offset!");

// ScriptStruct Plot.FacialAnimationData
// 0x0018 (0x0020 - 0x0008)
struct FFacialAnimationData final : public FTableRowBase
{
public:
	int32                                         ID;                                                // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFacialAnimationGroup>          FacialAnimations;                                  // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFacialAnimationData) == 0x000008, "Wrong alignment on FFacialAnimationData");
static_assert(sizeof(FFacialAnimationData) == 0x000020, "Wrong size on FFacialAnimationData");
static_assert(offsetof(FFacialAnimationData, ID) == 0x000008, "Member 'FFacialAnimationData::ID' has a wrong offset!");
static_assert(offsetof(FFacialAnimationData, FacialAnimations) == 0x000010, "Member 'FFacialAnimationData::FacialAnimations' has a wrong offset!");

// ScriptStruct Plot.PlotCutSceneData
// 0x0080 (0x0080 - 0x0000)
struct FPlotCutSceneData final
{
public:
	struct FSoftObjectPath                        SequencePath;                                      // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneSequencePlaybackSettings    Settings;                                          // 0x0018(0x0014)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        Style;                                             // 0x0030(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Size;                                              // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Position;                                          // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeInTime;                                        // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeOutTime;                                       // 0x005C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeOutTargetAlpha;                                // 0x0060(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayDelayTime;                                     // 0x0064(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeOutDelayTime;                                  // 0x0068(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              TargetPosition;                                    // 0x006C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveDelayTime;                                     // 0x0074(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveSpeed;                                         // 0x0078(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Layer;                                             // 0x007C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIsMainCamera : 1;                                 // 0x007D(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPlotCutSceneData) == 0x000008, "Wrong alignment on FPlotCutSceneData");
static_assert(sizeof(FPlotCutSceneData) == 0x000080, "Wrong size on FPlotCutSceneData");
static_assert(offsetof(FPlotCutSceneData, SequencePath) == 0x000000, "Member 'FPlotCutSceneData::SequencePath' has a wrong offset!");
static_assert(offsetof(FPlotCutSceneData, Settings) == 0x000018, "Member 'FPlotCutSceneData::Settings' has a wrong offset!");
static_assert(offsetof(FPlotCutSceneData, Style) == 0x000030, "Member 'FPlotCutSceneData::Style' has a wrong offset!");
static_assert(offsetof(FPlotCutSceneData, Size) == 0x000048, "Member 'FPlotCutSceneData::Size' has a wrong offset!");
static_assert(offsetof(FPlotCutSceneData, Position) == 0x000050, "Member 'FPlotCutSceneData::Position' has a wrong offset!");
static_assert(offsetof(FPlotCutSceneData, FadeInTime) == 0x000058, "Member 'FPlotCutSceneData::FadeInTime' has a wrong offset!");
static_assert(offsetof(FPlotCutSceneData, FadeOutTime) == 0x00005C, "Member 'FPlotCutSceneData::FadeOutTime' has a wrong offset!");
static_assert(offsetof(FPlotCutSceneData, FadeOutTargetAlpha) == 0x000060, "Member 'FPlotCutSceneData::FadeOutTargetAlpha' has a wrong offset!");
static_assert(offsetof(FPlotCutSceneData, PlayDelayTime) == 0x000064, "Member 'FPlotCutSceneData::PlayDelayTime' has a wrong offset!");
static_assert(offsetof(FPlotCutSceneData, FadeOutDelayTime) == 0x000068, "Member 'FPlotCutSceneData::FadeOutDelayTime' has a wrong offset!");
static_assert(offsetof(FPlotCutSceneData, TargetPosition) == 0x00006C, "Member 'FPlotCutSceneData::TargetPosition' has a wrong offset!");
static_assert(offsetof(FPlotCutSceneData, MoveDelayTime) == 0x000074, "Member 'FPlotCutSceneData::MoveDelayTime' has a wrong offset!");
static_assert(offsetof(FPlotCutSceneData, MoveSpeed) == 0x000078, "Member 'FPlotCutSceneData::MoveSpeed' has a wrong offset!");
static_assert(offsetof(FPlotCutSceneData, Layer) == 0x00007C, "Member 'FPlotCutSceneData::Layer' has a wrong offset!");

// ScriptStruct Plot.SubtitleRecord
// 0x0020 (0x0020 - 0x0000)
struct FSubtitleRecord final
{
public:
	class FString                                 Content;                                           // 0x0000(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WwiseEventID;                                      // 0x0010(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSubtitleRecord) == 0x000008, "Wrong alignment on FSubtitleRecord");
static_assert(sizeof(FSubtitleRecord) == 0x000020, "Wrong size on FSubtitleRecord");
static_assert(offsetof(FSubtitleRecord, Content) == 0x000000, "Member 'FSubtitleRecord::Content' has a wrong offset!");
static_assert(offsetof(FSubtitleRecord, WwiseEventID) == 0x000010, "Member 'FSubtitleRecord::WwiseEventID' has a wrong offset!");

// ScriptStruct Plot.InteractionGameRecord
// 0x0038 (0x0038 - 0x0000)
struct FInteractionGameRecord final
{
public:
	class FString                                 Content;                                           // 0x0000(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Speaker;                                           // 0x0010(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsCurTalking;                                      // 0x0020(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 WwiseEventID;                                      // 0x0028(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FInteractionGameRecord) == 0x000008, "Wrong alignment on FInteractionGameRecord");
