#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Plot

#include "Basic.hpp"

#include "Plot_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function Plot.PlotItem.SetExecuteIndex
// 0x0004 (0x0004 - 0x0000)
struct PlotItem_SetExecuteIndex final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotItem_SetExecuteIndex) == 0x000004, "Wrong alignment on PlotItem_SetExecuteIndex");
static_assert(sizeof(PlotItem_SetExecuteIndex) == 0x000004, "Wrong size on PlotItem_SetExecuteIndex");
static_assert(offsetof(PlotItem_SetExecuteIndex, InIndex) == 0x000000, "Member 'PlotItem_SetExecuteIndex::InIndex' has a wrong offset!");

// Function Plot.PlotItem.GetChildrenCount
// 0x0004 (0x0004 - 0x0000)
struct PlotItem_GetChildrenCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotItem_GetChildrenCount) == 0x000004, "Wrong alignment on PlotItem_GetChildrenCount");
static_assert(sizeof(PlotItem_GetChildrenCount) == 0x000004, "Wrong size on PlotItem_GetChildrenCount");
static_assert(offsetof(PlotItem_GetChildrenCount, ReturnValue) == 0x000000, "Member 'PlotItem_GetChildrenCount::ReturnValue' has a wrong offset!");

// Function Plot.PlotItem.GetIndex
// 0x0004 (0x0004 - 0x0000)
struct PlotItem_GetIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotItem_GetIndex) == 0x000004, "Wrong alignment on PlotItem_GetIndex");
static_assert(sizeof(PlotItem_GetIndex) == 0x000004, "Wrong size on PlotItem_GetIndex");
static_assert(offsetof(PlotItem_GetIndex, ReturnValue) == 0x000000, "Member 'PlotItem_GetIndex::ReturnValue' has a wrong offset!");

// Function Plot.PlotItem.GetParent
// 0x0008 (0x0008 - 0x0000)
struct PlotItem_GetParent final
{
public:
	class UPlotItem*                              ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotItem_GetParent) == 0x000008, "Wrong alignment on PlotItem_GetParent");
static_assert(sizeof(PlotItem_GetParent) == 0x000008, "Wrong size on PlotItem_GetParent");
static_assert(offsetof(PlotItem_GetParent, ReturnValue) == 0x000000, "Member 'PlotItem_GetParent::ReturnValue' has a wrong offset!");

// Function Plot.PlotItem.GetPlot
// 0x0008 (0x0008 - 0x0000)
struct PlotItem_GetPlot final
{
public:
	class UPlot*                                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotItem_GetPlot) == 0x000008, "Wrong alignment on PlotItem_GetPlot");
static_assert(sizeof(PlotItem_GetPlot) == 0x000008, "Wrong size on PlotItem_GetPlot");
static_assert(offsetof(PlotItem_GetPlot, ReturnValue) == 0x000000, "Member 'PlotItem_GetPlot::ReturnValue' has a wrong offset!");

// Function Plot.PlotItem.GetWidget
// 0x0008 (0x0008 - 0x0000)
struct PlotItem_GetWidget final
{
public:
	class UPlotWidget*                            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotItem_GetWidget) == 0x000008, "Wrong alignment on PlotItem_GetWidget");
static_assert(sizeof(PlotItem_GetWidget) == 0x000008, "Wrong size on PlotItem_GetWidget");
static_assert(offsetof(PlotItem_GetWidget, ReturnValue) == 0x000000, "Member 'PlotItem_GetWidget::ReturnValue' has a wrong offset!");

// Function Plot.PlotItem.GetWorld
// 0x0008 (0x0008 - 0x0000)
struct PlotItem_GetWorld final
{
public:
	class UWorld*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotItem_GetWorld) == 0x000008, "Wrong alignment on PlotItem_GetWorld");
static_assert(sizeof(PlotItem_GetWorld) == 0x000008, "Wrong size on PlotItem_GetWorld");
static_assert(offsetof(PlotItem_GetWorld, ReturnValue) == 0x000000, "Member 'PlotItem_GetWorld::ReturnValue' has a wrong offset!");

// Function Plot.PlotItem.IsTimeout
// 0x0001 (0x0001 - 0x0000)
struct PlotItem_IsTimeout final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotItem_IsTimeout) == 0x000001, "Wrong alignment on PlotItem_IsTimeout");
static_assert(sizeof(PlotItem_IsTimeout) == 0x000001, "Wrong size on PlotItem_IsTimeout");
static_assert(offsetof(PlotItem_IsTimeout, ReturnValue) == 0x000000, "Member 'PlotItem_IsTimeout::ReturnValue' has a wrong offset!");

// Function Plot.PlotRoleEffectWidget.GetSpineDefaultAnimName
// 0x0020 (0x0020 - 0x0000)
struct PlotRoleEffectWidget_GetSpineDefaultAnimName final
{
public:
	class FString                                 RoleName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotRoleEffectWidget_GetSpineDefaultAnimName) == 0x000008, "Wrong alignment on PlotRoleEffectWidget_GetSpineDefaultAnimName");
static_assert(sizeof(PlotRoleEffectWidget_GetSpineDefaultAnimName) == 0x000020, "Wrong size on PlotRoleEffectWidget_GetSpineDefaultAnimName");
static_assert(offsetof(PlotRoleEffectWidget_GetSpineDefaultAnimName, RoleName) == 0x000000, "Member 'PlotRoleEffectWidget_GetSpineDefaultAnimName::RoleName' has a wrong offset!");
static_assert(offsetof(PlotRoleEffectWidget_GetSpineDefaultAnimName, ReturnValue) == 0x000010, "Member 'PlotRoleEffectWidget_GetSpineDefaultAnimName::ReturnValue' has a wrong offset!");

// Function Plot.PlotRoleEffectWidget.HideOrShowSpine
// 0x0001 (0x0001 - 0x0000)
struct PlotRoleEffectWidget_HideOrShowSpine final
{
public:
	bool                                          bIsHide;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotRoleEffectWidget_HideOrShowSpine) == 0x000001, "Wrong alignment on PlotRoleEffectWidget_HideOrShowSpine");
static_assert(sizeof(PlotRoleEffectWidget_HideOrShowSpine) == 0x000001, "Wrong size on PlotRoleEffectWidget_HideOrShowSpine");
static_assert(offsetof(PlotRoleEffectWidget_HideOrShowSpine, bIsHide) == 0x000000, "Member 'PlotRoleEffectWidget_HideOrShowSpine::bIsHide' has a wrong offset!");

// Function Plot.PlotRoleEffectWidget.OnAnimationCompleteHandler
// 0x0010 (0x0010 - 0x0000)
struct PlotRoleEffectWidget_OnAnimationCompleteHandler final
{
public:
	class UObject*                                InDispatcher;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTrackEntry*                            InEntry;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotRoleEffectWidget_OnAnimationCompleteHandler) == 0x000008, "Wrong alignment on PlotRoleEffectWidget_OnAnimationCompleteHandler");
static_assert(sizeof(PlotRoleEffectWidget_OnAnimationCompleteHandler) == 0x000010, "Wrong size on PlotRoleEffectWidget_OnAnimationCompleteHandler");
static_assert(offsetof(PlotRoleEffectWidget_OnAnimationCompleteHandler, InDispatcher) == 0x000000, "Member 'PlotRoleEffectWidget_OnAnimationCompleteHandler::InDispatcher' has a wrong offset!");
static_assert(offsetof(PlotRoleEffectWidget_OnAnimationCompleteHandler, InEntry) == 0x000008, "Member 'PlotRoleEffectWidget_OnAnimationCompleteHandler::InEntry' has a wrong offset!");

// Function Plot.PlotRoleEffectWidget.OnEffectAnimationCompleteHandler
// 0x0010 (0x0010 - 0x0000)
struct PlotRoleEffectWidget_OnEffectAnimationCompleteHandler final
{
public:
	class UObject*                                InDispatcher;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTrackEntry*                            InEntry;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotRoleEffectWidget_OnEffectAnimationCompleteHandler) == 0x000008, "Wrong alignment on PlotRoleEffectWidget_OnEffectAnimationCompleteHandler");
static_assert(sizeof(PlotRoleEffectWidget_OnEffectAnimationCompleteHandler) == 0x000010, "Wrong size on PlotRoleEffectWidget_OnEffectAnimationCompleteHandler");
static_assert(offsetof(PlotRoleEffectWidget_OnEffectAnimationCompleteHandler, InDispatcher) == 0x000000, "Member 'PlotRoleEffectWidget_OnEffectAnimationCompleteHandler::InDispatcher' has a wrong offset!");
static_assert(offsetof(PlotRoleEffectWidget_OnEffectAnimationCompleteHandler, InEntry) == 0x000008, "Member 'PlotRoleEffectWidget_OnEffectAnimationCompleteHandler::InEntry' has a wrong offset!");

// Function Plot.PlotRoleEffectWidget.PlayDefaultSpine
// 0x0010 (0x0010 - 0x0000)
struct PlotRoleEffectWidget_PlayDefaultSpine final
{
public:
	class FString                                 RoleName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotRoleEffectWidget_PlayDefaultSpine) == 0x000008, "Wrong alignment on PlotRoleEffectWidget_PlayDefaultSpine");
static_assert(sizeof(PlotRoleEffectWidget_PlayDefaultSpine) == 0x000010, "Wrong size on PlotRoleEffectWidget_PlayDefaultSpine");
static_assert(offsetof(PlotRoleEffectWidget_PlayDefaultSpine, RoleName) == 0x000000, "Member 'PlotRoleEffectWidget_PlayDefaultSpine::RoleName' has a wrong offset!");

// Function Plot.PlotRoleEffectWidget.PlaySpine
// 0x0068 (0x0068 - 0x0000)
struct PlotRoleEffectWidget_PlaySpine final
{
public:
	class FString                                 RoleName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSpineParameters                       InParameters;                                      // 0x0010(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bIsHide;                                           // 0x0060(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PlotRoleEffectWidget_PlaySpine) == 0x000008, "Wrong alignment on PlotRoleEffectWidget_PlaySpine");
static_assert(sizeof(PlotRoleEffectWidget_PlaySpine) == 0x000068, "Wrong size on PlotRoleEffectWidget_PlaySpine");
static_assert(offsetof(PlotRoleEffectWidget_PlaySpine, RoleName) == 0x000000, "Member 'PlotRoleEffectWidget_PlaySpine::RoleName' has a wrong offset!");
static_assert(offsetof(PlotRoleEffectWidget_PlaySpine, InParameters) == 0x000010, "Member 'PlotRoleEffectWidget_PlaySpine::InParameters' has a wrong offset!");
static_assert(offsetof(PlotRoleEffectWidget_PlaySpine, bIsHide) == 0x000060, "Member 'PlotRoleEffectWidget_PlaySpine::bIsHide' has a wrong offset!");

// Function Plot.MovieClipBackgroundUserWidget.ReplaceFontAsset
// 0x0008 (0x0008 - 0x0000)
struct MovieClipBackgroundUserWidget_ReplaceFontAsset final
{
public:
	class UTextBlock*                             InTextBlock;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieClipBackgroundUserWidget_ReplaceFontAsset) == 0x000008, "Wrong alignment on MovieClipBackgroundUserWidget_ReplaceFontAsset");
static_assert(sizeof(MovieClipBackgroundUserWidget_ReplaceFontAsset) == 0x000008, "Wrong size on MovieClipBackgroundUserWidget_ReplaceFontAsset");
static_assert(offsetof(MovieClipBackgroundUserWidget_ReplaceFontAsset, InTextBlock) == 0x000000, "Member 'MovieClipBackgroundUserWidget_ReplaceFontAsset::InTextBlock' has a wrong offset!");

// Function Plot.MovieClipBackgroundUserWidget.SetCurrentControlerType
// 0x0001 (0x0001 - 0x0000)
struct MovieClipBackgroundUserWidget_SetCurrentControlerType final
{
public:
	EPlayControllerType                           TypeToSet;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieClipBackgroundUserWidget_SetCurrentControlerType) == 0x000001, "Wrong alignment on MovieClipBackgroundUserWidget_SetCurrentControlerType");
static_assert(sizeof(MovieClipBackgroundUserWidget_SetCurrentControlerType) == 0x000001, "Wrong size on MovieClipBackgroundUserWidget_SetCurrentControlerType");
static_assert(offsetof(MovieClipBackgroundUserWidget_SetCurrentControlerType, TypeToSet) == 0x000000, "Member 'MovieClipBackgroundUserWidget_SetCurrentControlerType::TypeToSet' has a wrong offset!");

// Function Plot.MovieClipBackgroundUserWidget.SetVisible
// 0x0001 (0x0001 - 0x0000)
struct MovieClipBackgroundUserWidget_SetVisible final
{
public:
	bool                                          bIsSetVisible;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieClipBackgroundUserWidget_SetVisible) == 0x000001, "Wrong alignment on MovieClipBackgroundUserWidget_SetVisible");
static_assert(sizeof(MovieClipBackgroundUserWidget_SetVisible) == 0x000001, "Wrong size on MovieClipBackgroundUserWidget_SetVisible");
static_assert(offsetof(MovieClipBackgroundUserWidget_SetVisible, bIsSetVisible) == 0x000000, "Member 'MovieClipBackgroundUserWidget_SetVisible::bIsSetVisible' has a wrong offset!");

// Function Plot.SpliceImgBG.OnInit
// 0x0048 (0x0048 - 0x0000)
struct SpliceImgBG_OnInit final
{
public:
	ESpliceType                                   SpliceType;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTexture2D*>                     TexturesArray;                                     // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FBlendParameters                       BlendParameters;                                   // 0x0018(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bHide;                                             // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              RelativeAnchors;                                   // 0x002C(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              FocusPosition;                                     // 0x0034(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleMultiplier;                                   // 0x003C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                InWidget;                                          // 0x0040(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpliceImgBG_OnInit) == 0x000008, "Wrong alignment on SpliceImgBG_OnInit");
static_assert(sizeof(SpliceImgBG_OnInit) == 0x000048, "Wrong size on SpliceImgBG_OnInit");
static_assert(offsetof(SpliceImgBG_OnInit, SpliceType) == 0x000000, "Member 'SpliceImgBG_OnInit::SpliceType' has a wrong offset!");
static_assert(offsetof(SpliceImgBG_OnInit, TexturesArray) == 0x000008, "Member 'SpliceImgBG_OnInit::TexturesArray' has a wrong offset!");
static_assert(offsetof(SpliceImgBG_OnInit, BlendParameters) == 0x000018, "Member 'SpliceImgBG_OnInit::BlendParameters' has a wrong offset!");
static_assert(offsetof(SpliceImgBG_OnInit, bHide) == 0x000028, "Member 'SpliceImgBG_OnInit::bHide' has a wrong offset!");
static_assert(offsetof(SpliceImgBG_OnInit, RelativeAnchors) == 0x00002C, "Member 'SpliceImgBG_OnInit::RelativeAnchors' has a wrong offset!");
static_assert(offsetof(SpliceImgBG_OnInit, FocusPosition) == 0x000034, "Member 'SpliceImgBG_OnInit::FocusPosition' has a wrong offset!");
static_assert(offsetof(SpliceImgBG_OnInit, ScaleMultiplier) == 0x00003C, "Member 'SpliceImgBG_OnInit::ScaleMultiplier' has a wrong offset!");
static_assert(offsetof(SpliceImgBG_OnInit, InWidget) == 0x000040, "Member 'SpliceImgBG_OnInit::InWidget' has a wrong offset!");

// Function Plot.SpliceImgBG.RemoveAllEffect
// 0x0002 (0x0002 - 0x0000)
struct SpliceImgBG_RemoveAllEffect final
{
public:
	bool                                          Recover;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FastComplete;                                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpliceImgBG_RemoveAllEffect) == 0x000001, "Wrong alignment on SpliceImgBG_RemoveAllEffect");
static_assert(sizeof(SpliceImgBG_RemoveAllEffect) == 0x000002, "Wrong size on SpliceImgBG_RemoveAllEffect");
static_assert(offsetof(SpliceImgBG_RemoveAllEffect, Recover) == 0x000000, "Member 'SpliceImgBG_RemoveAllEffect::Recover' has a wrong offset!");
static_assert(offsetof(SpliceImgBG_RemoveAllEffect, FastComplete) == 0x000001, "Member 'SpliceImgBG_RemoveAllEffect::FastComplete' has a wrong offset!");

// Function Plot.SpliceImgBG.SetAndMoveBG
// 0x0024 (0x0024 - 0x0000)
struct SpliceImgBG_SetAndMoveBG final
{
public:
	bool                                          bHide;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              RelativeAnchors;                                   // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              FocusPosition;                                     // 0x000C(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleMultiplier;                                   // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsLoop;                                            // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LoopTimes;                                         // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpliceImgBG_SetAndMoveBG) == 0x000004, "Wrong alignment on SpliceImgBG_SetAndMoveBG");
static_assert(sizeof(SpliceImgBG_SetAndMoveBG) == 0x000024, "Wrong size on SpliceImgBG_SetAndMoveBG");
static_assert(offsetof(SpliceImgBG_SetAndMoveBG, bHide) == 0x000000, "Member 'SpliceImgBG_SetAndMoveBG::bHide' has a wrong offset!");
static_assert(offsetof(SpliceImgBG_SetAndMoveBG, RelativeAnchors) == 0x000004, "Member 'SpliceImgBG_SetAndMoveBG::RelativeAnchors' has a wrong offset!");
static_assert(offsetof(SpliceImgBG_SetAndMoveBG, FocusPosition) == 0x00000C, "Member 'SpliceImgBG_SetAndMoveBG::FocusPosition' has a wrong offset!");
static_assert(offsetof(SpliceImgBG_SetAndMoveBG, ScaleMultiplier) == 0x000014, "Member 'SpliceImgBG_SetAndMoveBG::ScaleMultiplier' has a wrong offset!");
static_assert(offsetof(SpliceImgBG_SetAndMoveBG, Duration) == 0x000018, "Member 'SpliceImgBG_SetAndMoveBG::Duration' has a wrong offset!");
static_assert(offsetof(SpliceImgBG_SetAndMoveBG, IsLoop) == 0x00001C, "Member 'SpliceImgBG_SetAndMoveBG::IsLoop' has a wrong offset!");
static_assert(offsetof(SpliceImgBG_SetAndMoveBG, LoopTimes) == 0x000020, "Member 'SpliceImgBG_SetAndMoveBG::LoopTimes' has a wrong offset!");

// Function Plot.SpliceImgBG.TickMoveBG
// 0x0004 (0x0004 - 0x0000)
struct SpliceImgBG_TickMoveBG final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpliceImgBG_TickMoveBG) == 0x000004, "Wrong alignment on SpliceImgBG_TickMoveBG");
static_assert(sizeof(SpliceImgBG_TickMoveBG) == 0x000004, "Wrong size on SpliceImgBG_TickMoveBG");
static_assert(offsetof(SpliceImgBG_TickMoveBG, InDeltaTime) == 0x000000, "Member 'SpliceImgBG_TickMoveBG::InDeltaTime' has a wrong offset!");

// Function Plot.PlotItem_InteractionGame.GetHasPlayRecord
// 0x0010 (0x0010 - 0x0000)
struct PlotItem_InteractionGame_GetHasPlayRecord final
{
public:
	TArray<struct FInteractionGameRecord>         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotItem_InteractionGame_GetHasPlayRecord) == 0x000008, "Wrong alignment on PlotItem_InteractionGame_GetHasPlayRecord");
static_assert(sizeof(PlotItem_InteractionGame_GetHasPlayRecord) == 0x000010, "Wrong size on PlotItem_InteractionGame_GetHasPlayRecord");
static_assert(offsetof(PlotItem_InteractionGame_GetHasPlayRecord, ReturnValue) == 0x000000, "Member 'PlotItem_InteractionGame_GetHasPlayRecord::ReturnValue' has a wrong offset!");

// Function Plot.PlotItem_InteractionGame.OnTalkBegin
// 0x0030 (0x0030 - 0x0000)
struct PlotItem_InteractionGame_OnTalkBegin final
{
public:
	class FString                                 InText;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InSpeaker;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InWwiseKey;                                        // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotItem_InteractionGame_OnTalkBegin) == 0x000008, "Wrong alignment on PlotItem_InteractionGame_OnTalkBegin");
static_assert(sizeof(PlotItem_InteractionGame_OnTalkBegin) == 0x000030, "Wrong size on PlotItem_InteractionGame_OnTalkBegin");
static_assert(offsetof(PlotItem_InteractionGame_OnTalkBegin, InText) == 0x000000, "Member 'PlotItem_InteractionGame_OnTalkBegin::InText' has a wrong offset!");
static_assert(offsetof(PlotItem_InteractionGame_OnTalkBegin, InSpeaker) == 0x000010, "Member 'PlotItem_InteractionGame_OnTalkBegin::InSpeaker' has a wrong offset!");
static_assert(offsetof(PlotItem_InteractionGame_OnTalkBegin, InWwiseKey) == 0x000020, "Member 'PlotItem_InteractionGame_OnTalkBegin::InWwiseKey' has a wrong offset!");

// Function Plot.PlotItem_InteractionGame.OnTalkTextChange
// 0x0028 (0x0028 - 0x0000)
struct PlotItem_InteractionGame_OnTalkTextChange final
{
public:
	class FString                                 InText;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InMaxNumText;                                      // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Speaker;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotItem_InteractionGame_OnTalkTextChange) == 0x000008, "Wrong alignment on PlotItem_InteractionGame_OnTalkTextChange");
static_assert(sizeof(PlotItem_InteractionGame_OnTalkTextChange) == 0x000028, "Wrong size on PlotItem_InteractionGame_OnTalkTextChange");
static_assert(offsetof(PlotItem_InteractionGame_OnTalkTextChange, InText) == 0x000000, "Member 'PlotItem_InteractionGame_OnTalkTextChange::InText' has a wrong offset!");
static_assert(offsetof(PlotItem_InteractionGame_OnTalkTextChange, InMaxNumText) == 0x000010, "Member 'PlotItem_InteractionGame_OnTalkTextChange::InMaxNumText' has a wrong offset!");
static_assert(offsetof(PlotItem_InteractionGame_OnTalkTextChange, Speaker) == 0x000018, "Member 'PlotItem_InteractionGame_OnTalkTextChange::Speaker' has a wrong offset!");

// Function Plot.PlotItem_InteractionGame.OnWwiseBegin
// 0x0010 (0x0010 - 0x0000)
struct PlotItem_InteractionGame_OnWwiseBegin final
{
public:
	class FString                                 InWwiseEventID;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotItem_InteractionGame_OnWwiseBegin) == 0x000008, "Wrong alignment on PlotItem_InteractionGame_OnWwiseBegin");
static_assert(sizeof(PlotItem_InteractionGame_OnWwiseBegin) == 0x000010, "Wrong size on PlotItem_InteractionGame_OnWwiseBegin");
static_assert(offsetof(PlotItem_InteractionGame_OnWwiseBegin, InWwiseEventID) == 0x000000, "Member 'PlotItem_InteractionGame_OnWwiseBegin::InWwiseEventID' has a wrong offset!");

// Function Plot.PlotItem_InteractionGame.OnWwiseCompleteHandler
// 0x0008 (0x0008 - 0x0000)
struct PlotItem_InteractionGame_OnWwiseCompleteHandler final
{
public:
	class UWwiseComponent*                        InWwiseComponent;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotItem_InteractionGame_OnWwiseCompleteHandler) == 0x000008, "Wrong alignment on PlotItem_InteractionGame_OnWwiseCompleteHandler");
static_assert(sizeof(PlotItem_InteractionGame_OnWwiseCompleteHandler) == 0x000008, "Wrong size on PlotItem_InteractionGame_OnWwiseCompleteHandler");
static_assert(offsetof(PlotItem_InteractionGame_OnWwiseCompleteHandler, InWwiseComponent) == 0x000000, "Member 'PlotItem_InteractionGame_OnWwiseCompleteHandler::InWwiseComponent' has a wrong offset!");

// Function Plot.MovieClipImage.OnCameraCut
// 0x0008 (0x0008 - 0x0000)
struct MovieClipImage_OnCameraCut final
{
public:
	class UCameraComponent*                       CameraComp;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieClipImage_OnCameraCut) == 0x000008, "Wrong alignment on MovieClipImage_OnCameraCut");
static_assert(sizeof(MovieClipImage_OnCameraCut) == 0x000008, "Wrong size on MovieClipImage_OnCameraCut");
static_assert(offsetof(MovieClipImage_OnCameraCut, CameraComp) == 0x000000, "Member 'MovieClipImage_OnCameraCut::CameraComp' has a wrong offset!");

// Function Plot.PlotItem_LuaImpl.IsSingleWidget
// 0x0001 (0x0001 - 0x0000)
struct PlotItem_LuaImpl_IsSingleWidget final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotItem_LuaImpl_IsSingleWidget) == 0x000001, "Wrong alignment on PlotItem_LuaImpl_IsSingleWidget");
static_assert(sizeof(PlotItem_LuaImpl_IsSingleWidget) == 0x000001, "Wrong size on PlotItem_LuaImpl_IsSingleWidget");
static_assert(offsetof(PlotItem_LuaImpl_IsSingleWidget, ReturnValue) == 0x000000, "Member 'PlotItem_LuaImpl_IsSingleWidget::ReturnValue' has a wrong offset!");

// Function Plot.PlotItem_LuaImpl.SetWait
// 0x0001 (0x0001 - 0x0000)
struct PlotItem_LuaImpl_SetWait final
{
public:
	bool                                          InValue;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotItem_LuaImpl_SetWait) == 0x000001, "Wrong alignment on PlotItem_LuaImpl_SetWait");
static_assert(sizeof(PlotItem_LuaImpl_SetWait) == 0x000001, "Wrong size on PlotItem_LuaImpl_SetWait");
static_assert(offsetof(PlotItem_LuaImpl_SetWait, InValue) == 0x000000, "Member 'PlotItem_LuaImpl_SetWait::InValue' has a wrong offset!");

// Function Plot.MovieClipMediaSourceImage.OnMediaOpenFailedHandler
// 0x0010 (0x0010 - 0x0000)
struct MovieClipMediaSourceImage_OnMediaOpenFailedHandler final
{
public:
	class FString                                 DeviceUrl;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieClipMediaSourceImage_OnMediaOpenFailedHandler) == 0x000008, "Wrong alignment on MovieClipMediaSourceImage_OnMediaOpenFailedHandler");
static_assert(sizeof(MovieClipMediaSourceImage_OnMediaOpenFailedHandler) == 0x000010, "Wrong size on MovieClipMediaSourceImage_OnMediaOpenFailedHandler");
static_assert(offsetof(MovieClipMediaSourceImage_OnMediaOpenFailedHandler, DeviceUrl) == 0x000000, "Member 'MovieClipMediaSourceImage_OnMediaOpenFailedHandler::DeviceUrl' has a wrong offset!");

// Function Plot.MovieClipMediaSourceImage.OnMediaSourceOpenedHandler
// 0x0010 (0x0010 - 0x0000)
struct MovieClipMediaSourceImage_OnMediaSourceOpenedHandler final
{
public:
	class FString                                 DeviceUrl;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieClipMediaSourceImage_OnMediaSourceOpenedHandler) == 0x000008, "Wrong alignment on MovieClipMediaSourceImage_OnMediaSourceOpenedHandler");
static_assert(sizeof(MovieClipMediaSourceImage_OnMediaSourceOpenedHandler) == 0x000010, "Wrong size on MovieClipMediaSourceImage_OnMediaSourceOpenedHandler");
static_assert(offsetof(MovieClipMediaSourceImage_OnMediaSourceOpenedHandler, DeviceUrl) == 0x000000, "Member 'MovieClipMediaSourceImage_OnMediaSourceOpenedHandler::DeviceUrl' has a wrong offset!");

// Function Plot.MovieClipMediaSourceImage.GetFileList
// 0x0010 (0x0010 - 0x0000)
struct MovieClipMediaSourceImage_GetFileList final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieClipMediaSourceImage_GetFileList) == 0x000008, "Wrong alignment on MovieClipMediaSourceImage_GetFileList");
static_assert(sizeof(MovieClipMediaSourceImage_GetFileList) == 0x000010, "Wrong size on MovieClipMediaSourceImage_GetFileList");
static_assert(offsetof(MovieClipMediaSourceImage_GetFileList, ReturnValue) == 0x000000, "Member 'MovieClipMediaSourceImage_GetFileList::ReturnValue' has a wrong offset!");

// Function Plot.PlotCondition.Check
// 0x0001 (0x0001 - 0x0000)
struct PlotCondition_Check final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotCondition_Check) == 0x000001, "Wrong alignment on PlotCondition_Check");
static_assert(sizeof(PlotCondition_Check) == 0x000001, "Wrong size on PlotCondition_Check");
static_assert(offsetof(PlotCondition_Check, ReturnValue) == 0x000000, "Member 'PlotCondition_Check::ReturnValue' has a wrong offset!");

// Function Plot.PlotCondition.GetPlot
// 0x0008 (0x0008 - 0x0000)
struct PlotCondition_GetPlot final
{
public:
	class UPlot*                                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotCondition_GetPlot) == 0x000008, "Wrong alignment on PlotCondition_GetPlot");
static_assert(sizeof(PlotCondition_GetPlot) == 0x000008, "Wrong size on PlotCondition_GetPlot");
static_assert(offsetof(PlotCondition_GetPlot, ReturnValue) == 0x000000, "Member 'PlotCondition_GetPlot::ReturnValue' has a wrong offset!");

// Function Plot.Plot.SetPlotLanguageNames
// 0x0010 (0x0010 - 0x0000)
struct Plot_SetPlotLanguageNames final
{
public:
	TArray<class FString>                         InLanguageNames;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(Plot_SetPlotLanguageNames) == 0x000008, "Wrong alignment on Plot_SetPlotLanguageNames");
static_assert(sizeof(Plot_SetPlotLanguageNames) == 0x000010, "Wrong size on Plot_SetPlotLanguageNames");
static_assert(offsetof(Plot_SetPlotLanguageNames, InLanguageNames) == 0x000000, "Member 'Plot_SetPlotLanguageNames::InLanguageNames' has a wrong offset!");

// Function Plot.Plot.End
// 0x0001 (0x0001 - 0x0000)
struct Plot_End final
{
public:
	EPlotCompleteType                             InCompleteType;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Plot_End) == 0x000001, "Wrong alignment on Plot_End");
static_assert(sizeof(Plot_End) == 0x000001, "Wrong size on Plot_End");
static_assert(offsetof(Plot_End, InCompleteType) == 0x000000, "Member 'Plot_End::InCompleteType' has a wrong offset!");

// Function Plot.Plot.GetConfigId
// 0x0004 (0x0004 - 0x0000)
struct Plot_GetConfigId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Plot_GetConfigId) == 0x000004, "Wrong alignment on Plot_GetConfigId");
static_assert(sizeof(Plot_GetConfigId) == 0x000004, "Wrong size on Plot_GetConfigId");
static_assert(offsetof(Plot_GetConfigId, ReturnValue) == 0x000000, "Member 'Plot_GetConfigId::ReturnValue' has a wrong offset!");

// Function Plot.Plot.GetTalkConfig
// 0x0090 (0x0090 - 0x0000)
struct Plot_GetTalkConfig final
{
public:
	class FString                                 InKey;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConfigItem                            ReturnValue;                                       // 0x0010(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(Plot_GetTalkConfig) == 0x000008, "Wrong alignment on Plot_GetTalkConfig");
static_assert(sizeof(Plot_GetTalkConfig) == 0x000090, "Wrong size on Plot_GetTalkConfig");
static_assert(offsetof(Plot_GetTalkConfig, InKey) == 0x000000, "Member 'Plot_GetTalkConfig::InKey' has a wrong offset!");
static_assert(offsetof(Plot_GetTalkConfig, ReturnValue) == 0x000010, "Member 'Plot_GetTalkConfig::ReturnValue' has a wrong offset!");

// Function Plot.Plot.IsJump
// 0x0010 (0x0010 - 0x0000)
struct Plot_IsJump final
{
public:
	class UPlotItem*                              InItem;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Plot_IsJump) == 0x000008, "Wrong alignment on Plot_IsJump");
static_assert(sizeof(Plot_IsJump) == 0x000010, "Wrong size on Plot_IsJump");
static_assert(offsetof(Plot_IsJump, InItem) == 0x000000, "Member 'Plot_IsJump::InItem' has a wrong offset!");
static_assert(offsetof(Plot_IsJump, ReturnValue) == 0x000008, "Member 'Plot_IsJump::ReturnValue' has a wrong offset!");

// Function Plot.Plot.SetAutoPlay
// 0x0001 (0x0001 - 0x0000)
struct Plot_SetAutoPlay final
{
public:
	bool                                          bIsAutoPlay;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Plot_SetAutoPlay) == 0x000001, "Wrong alignment on Plot_SetAutoPlay");
static_assert(sizeof(Plot_SetAutoPlay) == 0x000001, "Wrong size on Plot_SetAutoPlay");
static_assert(offsetof(Plot_SetAutoPlay, bIsAutoPlay) == 0x000000, "Member 'Plot_SetAutoPlay::bIsAutoPlay' has a wrong offset!");

// Function Plot.Plot.SetPlayMode
// 0x0001 (0x0001 - 0x0000)
struct Plot_SetPlayMode final
{
public:
	EPlayMode                                     InPlayMode;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Plot_SetPlayMode) == 0x000001, "Wrong alignment on Plot_SetPlayMode");
static_assert(sizeof(Plot_SetPlayMode) == 0x000001, "Wrong size on Plot_SetPlayMode");
static_assert(offsetof(Plot_SetPlayMode, InPlayMode) == 0x000000, "Member 'Plot_SetPlayMode::InPlayMode' has a wrong offset!");

// Function Plot.Plot.SetWidget
// 0x0008 (0x0008 - 0x0000)
struct Plot_SetWidget final
{
public:
	class UPlotWidget*                            InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Plot_SetWidget) == 0x000008, "Wrong alignment on Plot_SetWidget");
static_assert(sizeof(Plot_SetWidget) == 0x000008, "Wrong size on Plot_SetWidget");
static_assert(offsetof(Plot_SetWidget, InWidget) == 0x000000, "Member 'Plot_SetWidget::InWidget' has a wrong offset!");

// Function Plot.Plot.GetFadeTime
// 0x0004 (0x0004 - 0x0000)
struct Plot_GetFadeTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Plot_GetFadeTime) == 0x000004, "Wrong alignment on Plot_GetFadeTime");
static_assert(sizeof(Plot_GetFadeTime) == 0x000004, "Wrong size on Plot_GetFadeTime");
static_assert(offsetof(Plot_GetFadeTime, ReturnValue) == 0x000000, "Member 'Plot_GetFadeTime::ReturnValue' has a wrong offset!");

// Function Plot.Plot.GetIsAutoPlay
// 0x0001 (0x0001 - 0x0000)
struct Plot_GetIsAutoPlay final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Plot_GetIsAutoPlay) == 0x000001, "Wrong alignment on Plot_GetIsAutoPlay");
static_assert(sizeof(Plot_GetIsAutoPlay) == 0x000001, "Wrong size on Plot_GetIsAutoPlay");
static_assert(offsetof(Plot_GetIsAutoPlay, ReturnValue) == 0x000000, "Member 'Plot_GetIsAutoPlay::ReturnValue' has a wrong offset!");

// Function Plot.Plot.GetPlayMode
// 0x0001 (0x0001 - 0x0000)
struct Plot_GetPlayMode final
{
public:
	EPlayMode                                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Plot_GetPlayMode) == 0x000001, "Wrong alignment on Plot_GetPlayMode");
static_assert(sizeof(Plot_GetPlayMode) == 0x000001, "Wrong size on Plot_GetPlayMode");
static_assert(offsetof(Plot_GetPlayMode, ReturnValue) == 0x000000, "Member 'Plot_GetPlayMode::ReturnValue' has a wrong offset!");

// Function Plot.Plot.GetPlaySpeed
// 0x0004 (0x0004 - 0x0000)
struct Plot_GetPlaySpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Plot_GetPlaySpeed) == 0x000004, "Wrong alignment on Plot_GetPlaySpeed");
static_assert(sizeof(Plot_GetPlaySpeed) == 0x000004, "Wrong size on Plot_GetPlaySpeed");
static_assert(offsetof(Plot_GetPlaySpeed, ReturnValue) == 0x000000, "Member 'Plot_GetPlaySpeed::ReturnValue' has a wrong offset!");

// Function Plot.Plot.GetRootItem
// 0x0008 (0x0008 - 0x0000)
struct Plot_GetRootItem final
{
public:
	class UPlotItem*                              ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Plot_GetRootItem) == 0x000008, "Wrong alignment on Plot_GetRootItem");
static_assert(sizeof(Plot_GetRootItem) == 0x000008, "Wrong size on Plot_GetRootItem");
static_assert(offsetof(Plot_GetRootItem, ReturnValue) == 0x000000, "Member 'Plot_GetRootItem::ReturnValue' has a wrong offset!");

// Function Plot.Plot.GetWidget
// 0x0008 (0x0008 - 0x0000)
struct Plot_GetWidget final
{
public:
	class UPlotWidget*                            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Plot_GetWidget) == 0x000008, "Wrong alignment on Plot_GetWidget");
static_assert(sizeof(Plot_GetWidget) == 0x000008, "Wrong size on Plot_GetWidget");
static_assert(offsetof(Plot_GetWidget, ReturnValue) == 0x000000, "Member 'Plot_GetWidget::ReturnValue' has a wrong offset!");

// Function Plot.Plot.GetWorld
// 0x0008 (0x0008 - 0x0000)
struct Plot_GetWorld final
{
public:
	class UWorld*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Plot_GetWorld) == 0x000008, "Wrong alignment on Plot_GetWorld");
static_assert(sizeof(Plot_GetWorld) == 0x000008, "Wrong size on Plot_GetWorld");
static_assert(offsetof(Plot_GetWorld, ReturnValue) == 0x000000, "Member 'Plot_GetWorld::ReturnValue' has a wrong offset!");

// Function Plot.Plot.HasKey
// 0x0018 (0x0018 - 0x0000)
struct Plot_HasKey final
{
public:
	class FString                                 InKey;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Plot_HasKey) == 0x000008, "Wrong alignment on Plot_HasKey");
static_assert(sizeof(Plot_HasKey) == 0x000018, "Wrong size on Plot_HasKey");
static_assert(offsetof(Plot_HasKey, InKey) == 0x000000, "Member 'Plot_HasKey::InKey' has a wrong offset!");
static_assert(offsetof(Plot_HasKey, ReturnValue) == 0x000010, "Member 'Plot_HasKey::ReturnValue' has a wrong offset!");

// Function Plot.Plot.IsNormalDialogueType
// 0x0001 (0x0001 - 0x0000)
struct Plot_IsNormalDialogueType final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Plot_IsNormalDialogueType) == 0x000001, "Wrong alignment on Plot_IsNormalDialogueType");
static_assert(sizeof(Plot_IsNormalDialogueType) == 0x000001, "Wrong size on Plot_IsNormalDialogueType");
static_assert(offsetof(Plot_IsNormalDialogueType, ReturnValue) == 0x000000, "Member 'Plot_IsNormalDialogueType::ReturnValue' has a wrong offset!");

// Function Plot.Plot.IsVisiableSequencerUserWidget
// 0x0001 (0x0001 - 0x0000)
struct Plot_IsVisiableSequencerUserWidget final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Plot_IsVisiableSequencerUserWidget) == 0x000001, "Wrong alignment on Plot_IsVisiableSequencerUserWidget");
static_assert(sizeof(Plot_IsVisiableSequencerUserWidget) == 0x000001, "Wrong size on Plot_IsVisiableSequencerUserWidget");
static_assert(offsetof(Plot_IsVisiableSequencerUserWidget, ReturnValue) == 0x000000, "Member 'Plot_IsVisiableSequencerUserWidget::ReturnValue' has a wrong offset!");

// Function Plot.Plot.JumpTo
// 0x0018 (0x0018 - 0x0000)
struct Plot_JumpTo final
{
public:
	class FString                                 InKey;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Plot_JumpTo) == 0x000008, "Wrong alignment on Plot_JumpTo");
static_assert(sizeof(Plot_JumpTo) == 0x000018, "Wrong size on Plot_JumpTo");
static_assert(offsetof(Plot_JumpTo, InKey) == 0x000000, "Member 'Plot_JumpTo::InKey' has a wrong offset!");
static_assert(offsetof(Plot_JumpTo, ReturnValue) == 0x000010, "Member 'Plot_JumpTo::ReturnValue' has a wrong offset!");

// Function Plot.Plot.SaveKey
// 0x0010 (0x0010 - 0x0000)
struct Plot_SaveKey final
{
public:
	class FString                                 InKey;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Plot_SaveKey) == 0x000008, "Wrong alignment on Plot_SaveKey");
static_assert(sizeof(Plot_SaveKey) == 0x000010, "Wrong size on Plot_SaveKey");
static_assert(offsetof(Plot_SaveKey, InKey) == 0x000000, "Member 'Plot_SaveKey::InKey' has a wrong offset!");

// Function Plot.PlotCharacter.GetCameraArgs
// 0x0058 (0x0058 - 0x0000)
struct PlotCharacter_GetCameraArgs final
{
public:
	struct FPlotCameraInfo                        ReturnValue;                                       // 0x0000(0x0058)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotCharacter_GetCameraArgs) == 0x000008, "Wrong alignment on PlotCharacter_GetCameraArgs");
static_assert(sizeof(PlotCharacter_GetCameraArgs) == 0x000058, "Wrong size on PlotCharacter_GetCameraArgs");
static_assert(offsetof(PlotCharacter_GetCameraArgs, ReturnValue) == 0x000000, "Member 'PlotCharacter_GetCameraArgs::ReturnValue' has a wrong offset!");

// Function Plot.PlotCharacter.SetCameraArgs
// 0x0060 (0x0060 - 0x0000)
struct PlotCharacter_SetCameraArgs final
{
public:
	struct FPlotCameraInfo                        InArgs;                                            // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UPlot*                                  InPlot;                                            // 0x0058(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotCharacter_SetCameraArgs) == 0x000008, "Wrong alignment on PlotCharacter_SetCameraArgs");
static_assert(sizeof(PlotCharacter_SetCameraArgs) == 0x000060, "Wrong size on PlotCharacter_SetCameraArgs");
static_assert(offsetof(PlotCharacter_SetCameraArgs, InArgs) == 0x000000, "Member 'PlotCharacter_SetCameraArgs::InArgs' has a wrong offset!");
static_assert(offsetof(PlotCharacter_SetCameraArgs, InPlot) == 0x000058, "Member 'PlotCharacter_SetCameraArgs::InPlot' has a wrong offset!");

// Function Plot.PlotLuaImplWidget.NotifyStart
// 0x0018 (0x0018 - 0x0000)
struct PlotLuaImplWidget_NotifyStart final
{
public:
	class UPlotItem_LuaImpl*                      InPlotItem;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlotWidget*                            InPlotWidget;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InIsPreview;                                       // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PlotLuaImplWidget_NotifyStart) == 0x000008, "Wrong alignment on PlotLuaImplWidget_NotifyStart");
static_assert(sizeof(PlotLuaImplWidget_NotifyStart) == 0x000018, "Wrong size on PlotLuaImplWidget_NotifyStart");
static_assert(offsetof(PlotLuaImplWidget_NotifyStart, InPlotItem) == 0x000000, "Member 'PlotLuaImplWidget_NotifyStart::InPlotItem' has a wrong offset!");
static_assert(offsetof(PlotLuaImplWidget_NotifyStart, InPlotWidget) == 0x000008, "Member 'PlotLuaImplWidget_NotifyStart::InPlotWidget' has a wrong offset!");
static_assert(offsetof(PlotLuaImplWidget_NotifyStart, InIsPreview) == 0x000010, "Member 'PlotLuaImplWidget_NotifyStart::InIsPreview' has a wrong offset!");

// Function Plot.PlotEvent.DoEvent
// 0x0001 (0x0001 - 0x0000)
struct PlotEvent_DoEvent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotEvent_DoEvent) == 0x000001, "Wrong alignment on PlotEvent_DoEvent");
static_assert(sizeof(PlotEvent_DoEvent) == 0x000001, "Wrong size on PlotEvent_DoEvent");
static_assert(offsetof(PlotEvent_DoEvent, ReturnValue) == 0x000000, "Member 'PlotEvent_DoEvent::ReturnValue' has a wrong offset!");

// Function Plot.PlotSaveItem.GetContentFromSelectItemData
// 0x0050 (0x0050 - 0x0000)
struct PlotSaveItem_GetContentFromSelectItemData final
{
public:
	struct FSelectItemData                        SelectItemData;                                    // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotSaveItem_GetContentFromSelectItemData) == 0x000008, "Wrong alignment on PlotSaveItem_GetContentFromSelectItemData");
static_assert(sizeof(PlotSaveItem_GetContentFromSelectItemData) == 0x000050, "Wrong size on PlotSaveItem_GetContentFromSelectItemData");
static_assert(offsetof(PlotSaveItem_GetContentFromSelectItemData, SelectItemData) == 0x000000, "Member 'PlotSaveItem_GetContentFromSelectItemData::SelectItemData' has a wrong offset!");
static_assert(offsetof(PlotSaveItem_GetContentFromSelectItemData, ReturnValue) == 0x000040, "Member 'PlotSaveItem_GetContentFromSelectItemData::ReturnValue' has a wrong offset!");

// Function Plot.PlotItem_BackgroundSubtitles.OnWwiseCompleteHandler
// 0x0008 (0x0008 - 0x0000)
struct PlotItem_BackgroundSubtitles_OnWwiseCompleteHandler final
{
public:
	class UWwiseComponent*                        InWwiseComponent;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotItem_BackgroundSubtitles_OnWwiseCompleteHandler) == 0x000008, "Wrong alignment on PlotItem_BackgroundSubtitles_OnWwiseCompleteHandler");
static_assert(sizeof(PlotItem_BackgroundSubtitles_OnWwiseCompleteHandler) == 0x000008, "Wrong size on PlotItem_BackgroundSubtitles_OnWwiseCompleteHandler");
static_assert(offsetof(PlotItem_BackgroundSubtitles_OnWwiseCompleteHandler, InWwiseComponent) == 0x000000, "Member 'PlotItem_BackgroundSubtitles_OnWwiseCompleteHandler::InWwiseComponent' has a wrong offset!");

// Function Plot.PlotItem_BackgroundSubtitles.GetRemoveLineBreakText
// 0x0018 (0x0018 - 0x0000)
struct PlotItem_BackgroundSubtitles_GetRemoveLineBreakText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotItem_BackgroundSubtitles_GetRemoveLineBreakText) == 0x000008, "Wrong alignment on PlotItem_BackgroundSubtitles_GetRemoveLineBreakText");
static_assert(sizeof(PlotItem_BackgroundSubtitles_GetRemoveLineBreakText) == 0x000018, "Wrong size on PlotItem_BackgroundSubtitles_GetRemoveLineBreakText");
static_assert(offsetof(PlotItem_BackgroundSubtitles_GetRemoveLineBreakText, ReturnValue) == 0x000000, "Member 'PlotItem_BackgroundSubtitles_GetRemoveLineBreakText::ReturnValue' has a wrong offset!");

// Function Plot.PlotItem_BackgroundSubtitleOneByOne.GetHasPlayRecord
// 0x0010 (0x0010 - 0x0000)
struct PlotItem_BackgroundSubtitleOneByOne_GetHasPlayRecord final
{
public:
	TArray<struct FSubtitleRecord>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotItem_BackgroundSubtitleOneByOne_GetHasPlayRecord) == 0x000008, "Wrong alignment on PlotItem_BackgroundSubtitleOneByOne_GetHasPlayRecord");
static_assert(sizeof(PlotItem_BackgroundSubtitleOneByOne_GetHasPlayRecord) == 0x000010, "Wrong size on PlotItem_BackgroundSubtitleOneByOne_GetHasPlayRecord");
static_assert(offsetof(PlotItem_BackgroundSubtitleOneByOne_GetHasPlayRecord, ReturnValue) == 0x000000, "Member 'PlotItem_BackgroundSubtitleOneByOne_GetHasPlayRecord::ReturnValue' has a wrong offset!");

// Function Plot.PlotItem_BackgroundSubtitleOneByOne.OnWwiseCompleteHandler
// 0x0008 (0x0008 - 0x0000)
struct PlotItem_BackgroundSubtitleOneByOne_OnWwiseCompleteHandler final
{
public:
	class UWwiseComponent*                        InWwiseComponent;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotItem_BackgroundSubtitleOneByOne_OnWwiseCompleteHandler) == 0x000008, "Wrong alignment on PlotItem_BackgroundSubtitleOneByOne_OnWwiseCompleteHandler");
static_assert(sizeof(PlotItem_BackgroundSubtitleOneByOne_OnWwiseCompleteHandler) == 0x000008, "Wrong size on PlotItem_BackgroundSubtitleOneByOne_OnWwiseCompleteHandler");
static_assert(offsetof(PlotItem_BackgroundSubtitleOneByOne_OnWwiseCompleteHandler, InWwiseComponent) == 0x000000, "Member 'PlotItem_BackgroundSubtitleOneByOne_OnWwiseCompleteHandler::InWwiseComponent' has a wrong offset!");

// Function Plot.PlotItem_BackgroundSubtitle_New.GetHasPlayRecord
// 0x0010 (0x0010 - 0x0000)
struct PlotItem_BackgroundSubtitle_New_GetHasPlayRecord final
{
public:
	TArray<struct FSubtitleRecord>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlotItem_BackgroundSubtitle_New_GetHasPlayRecord) == 0x000008, "Wrong alignment on PlotItem_BackgroundSubtitle_New_GetHasPlayRecord");
