#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Plot

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Plot_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "GameCore_structs.hpp"
#include "GameCore_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// Class Plot.SubtitlesTextInterface
// 0x0000 (0x0028 - 0x0028)
class ISubtitlesTextInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SubtitlesTextInterface">();
	}
	static class ISubtitlesTextInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISubtitlesTextInterface>();
	}
};
static_assert(alignof(ISubtitlesTextInterface) == 0x000008, "Wrong alignment on ISubtitlesTextInterface");
static_assert(sizeof(ISubtitlesTextInterface) == 0x000028, "Wrong size on ISubtitlesTextInterface");

// Class Plot.PlotItem
// 0x0068 (0x0090 - 0x0028)
class UPlotItem : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPlotItem*>                      Childs;                                            // 0x0030(0x0010)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UPlotItem*                              Parent;                                            // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlotScreenType                               ScreenType;                                        // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWait;                                             // 0x0049(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWaitOperationType                            WaitType;                                          // 0x004A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Timeout;                                           // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UPlotEvent*>                     TimeoutEvents;                                     // 0x0050(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         TrackTime;                                         // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x2];                                       // 0x0064(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bCanHaveMultipleChildren;                          // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_67[0x1];                                       // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ExecuteIndex;                                      // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DisplayLabel;                                      // 0x0070(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ItemIndex;                                         // 0x0080(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_84[0x2];                                       // 0x0084(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bCanEditWait;                                      // 0x0086(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_87[0x9];                                       // 0x0087(0x0009)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Clearup();
	void End();
	void OnEnd();
	void OnStart();
	void SetExecuteIndex(int32 InIndex);
	void Start();

	int32 GetChildrenCount() const;
	int32 GetIndex() const;
	class UPlotItem* GetParent() const;
	class UPlot* GetPlot() const;
	class UPlotWidget* GetWidget() const;
	class UWorld* GetWorld() const;
	bool IsTimeout() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlotItem">();
	}
	static class UPlotItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotItem>();
	}
};
static_assert(alignof(UPlotItem) == 0x000008, "Wrong alignment on UPlotItem");
static_assert(sizeof(UPlotItem) == 0x000090, "Wrong size on UPlotItem");
static_assert(offsetof(UPlotItem, Childs) == 0x000030, "Member 'UPlotItem::Childs' has a wrong offset!");
static_assert(offsetof(UPlotItem, Parent) == 0x000040, "Member 'UPlotItem::Parent' has a wrong offset!");
static_assert(offsetof(UPlotItem, ScreenType) == 0x000048, "Member 'UPlotItem::ScreenType' has a wrong offset!");
static_assert(offsetof(UPlotItem, bWait) == 0x000049, "Member 'UPlotItem::bWait' has a wrong offset!");
static_assert(offsetof(UPlotItem, WaitType) == 0x00004A, "Member 'UPlotItem::WaitType' has a wrong offset!");
static_assert(offsetof(UPlotItem, Timeout) == 0x00004C, "Member 'UPlotItem::Timeout' has a wrong offset!");
static_assert(offsetof(UPlotItem, TimeoutEvents) == 0x000050, "Member 'UPlotItem::TimeoutEvents' has a wrong offset!");
static_assert(offsetof(UPlotItem, TrackTime) == 0x000060, "Member 'UPlotItem::TrackTime' has a wrong offset!");
static_assert(offsetof(UPlotItem, bCanHaveMultipleChildren) == 0x000066, "Member 'UPlotItem::bCanHaveMultipleChildren' has a wrong offset!");
static_assert(offsetof(UPlotItem, ExecuteIndex) == 0x000068, "Member 'UPlotItem::ExecuteIndex' has a wrong offset!");
static_assert(offsetof(UPlotItem, DisplayLabel) == 0x000070, "Member 'UPlotItem::DisplayLabel' has a wrong offset!");
static_assert(offsetof(UPlotItem, ItemIndex) == 0x000080, "Member 'UPlotItem::ItemIndex' has a wrong offset!");
static_assert(offsetof(UPlotItem, bCanEditWait) == 0x000086, "Member 'UPlotItem::bCanEditWait' has a wrong offset!");

// Class Plot.PlotItem_FindEvidenceHide
// 0x0010 (0x00A0 - 0x0090)
class UPlotItem_FindEvidenceHide final : public UPlotItem
{
public:
	bool                                          IsShow;                                            // 0x0090(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0xF];                                       // 0x0091(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlotItem_FindEvidenceHide">();
	}
	static class UPlotItem_FindEvidenceHide* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotItem_FindEvidenceHide>();
	}
};
static_assert(alignof(UPlotItem_FindEvidenceHide) == 0x000008, "Wrong alignment on UPlotItem_FindEvidenceHide");
static_assert(sizeof(UPlotItem_FindEvidenceHide) == 0x0000A0, "Wrong size on UPlotItem_FindEvidenceHide");
static_assert(offsetof(UPlotItem_FindEvidenceHide, IsShow) == 0x000090, "Member 'UPlotItem_FindEvidenceHide::IsShow' has a wrong offset!");

// Class Plot.PlotRoleEffectWidget
// 0x0050 (0x02D0 - 0x0280)
class UPlotRoleEffectWidget final : public UUserWidget
{
public:
	class USpineWidget*                           RoleSpineWidget;                                   // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlotSpineEffectImage*                  RoleSpineEffectImage;                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_290[0x40];                                     // 0x0290(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FString GetSpineDefaultAnimName(const class FString& RoleName);
	void HideOrShowSpine(bool bIsHide);
	void OnAnimationCompleteHandler(class UObject* InDispatcher, class UTrackEntry* InEntry);
	void OnEffectAnimationCompleteHandler(class UObject* InDispatcher, class UTrackEntry* InEntry);
	void PlayDefaultSpine(const class FString& RoleName);
	void PlaySpine(const class FString& RoleName, const struct FSpineParameters& InParameters, bool bIsHide);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlotRoleEffectWidget">();
	}
	static class UPlotRoleEffectWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotRoleEffectWidget>();
	}
};
static_assert(alignof(UPlotRoleEffectWidget) == 0x000008, "Wrong alignment on UPlotRoleEffectWidget");
static_assert(sizeof(UPlotRoleEffectWidget) == 0x0002D0, "Wrong size on UPlotRoleEffectWidget");
static_assert(offsetof(UPlotRoleEffectWidget, RoleSpineWidget) == 0x000280, "Member 'UPlotRoleEffectWidget::RoleSpineWidget' has a wrong offset!");
static_assert(offsetof(UPlotRoleEffectWidget, RoleSpineEffectImage) == 0x000288, "Member 'UPlotRoleEffectWidget::RoleSpineEffectImage' has a wrong offset!");

// Class Plot.MovieClipBackgroundUserWidget
// 0x0038 (0x02B8 - 0x0280)
class UMovieClipBackgroundUserWidget final : public UUserWidget
{
public:
	class UMovieSkipWidget*                       Umg_MovieSkipWidget;                               // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             Text_SkipTip_Phone;                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             Text_SkipTip_Computer;                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                 Image_SkipTip_Gamepad_Xbox;                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                 Image_SkipTip_Gamepad_PS;                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlayControllerType                           CurrentType;                                       // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A9[0xF];                                      // 0x02A9(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ReplaceFontAsset(class UTextBlock* InTextBlock);
	void SetCurrentControlerType(EPlayControllerType TypeToSet);
	void SetSkipTipVisible();
	void SetVisible(bool bIsSetVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieClipBackgroundUserWidget">();
	}
	static class UMovieClipBackgroundUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieClipBackgroundUserWidget>();
	}
};
static_assert(alignof(UMovieClipBackgroundUserWidget) == 0x000008, "Wrong alignment on UMovieClipBackgroundUserWidget");
static_assert(sizeof(UMovieClipBackgroundUserWidget) == 0x0002B8, "Wrong size on UMovieClipBackgroundUserWidget");
static_assert(offsetof(UMovieClipBackgroundUserWidget, Umg_MovieSkipWidget) == 0x000280, "Member 'UMovieClipBackgroundUserWidget::Umg_MovieSkipWidget' has a wrong offset!");
static_assert(offsetof(UMovieClipBackgroundUserWidget, Text_SkipTip_Phone) == 0x000288, "Member 'UMovieClipBackgroundUserWidget::Text_SkipTip_Phone' has a wrong offset!");
static_assert(offsetof(UMovieClipBackgroundUserWidget, Text_SkipTip_Computer) == 0x000290, "Member 'UMovieClipBackgroundUserWidget::Text_SkipTip_Computer' has a wrong offset!");
static_assert(offsetof(UMovieClipBackgroundUserWidget, Image_SkipTip_Gamepad_Xbox) == 0x000298, "Member 'UMovieClipBackgroundUserWidget::Image_SkipTip_Gamepad_Xbox' has a wrong offset!");
static_assert(offsetof(UMovieClipBackgroundUserWidget, Image_SkipTip_Gamepad_PS) == 0x0002A0, "Member 'UMovieClipBackgroundUserWidget::Image_SkipTip_Gamepad_PS' has a wrong offset!");
static_assert(offsetof(UMovieClipBackgroundUserWidget, CurrentType) == 0x0002A8, "Member 'UMovieClipBackgroundUserWidget::CurrentType' has a wrong offset!");

// Class Plot.MovieClipSubUserWidget
// 0x0010 (0x0290 - 0x0280)
class UMovieClipSubUserWidget final : public UUserWidget
{
public:
	class FString                                 SubtitlesPath;                                     // 0x0280(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieClipSubUserWidget">();
	}
	static class UMovieClipSubUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieClipSubUserWidget>();
	}
};
static_assert(alignof(UMovieClipSubUserWidget) == 0x000008, "Wrong alignment on UMovieClipSubUserWidget");
static_assert(sizeof(UMovieClipSubUserWidget) == 0x000290, "Wrong size on UMovieClipSubUserWidget");
static_assert(offsetof(UMovieClipSubUserWidget, SubtitlesPath) == 0x000280, "Member 'UMovieClipSubUserWidget::SubtitlesPath' has a wrong offset!");

// Class Plot.SpliceImgBG
// 0x0010 (0x0290 - 0x0280)
class USpliceImgBG final : public UUserWidget
{
public:
	uint8                                         Pad_280[0x8];                                      // 0x0280(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bTick;                                             // 0x0288(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DeleteSpliceBG();
	void OnInit(ESpliceType* SpliceType, TArray<class UTexture2D*>* TexturesArray, struct FBlendParameters* BlendParameters, bool bHide, struct FVector2D* RelativeAnchors, struct FVector2D* FocusPosition, float* ScaleMultiplier, class UWidget* InWidget);
	void OnMoveComplete();
	void RemoveAllEffect(bool Recover, bool FastComplete);
	void SetAndMoveBG(bool bHide, struct FVector2D* RelativeAnchors, struct FVector2D* FocusPosition, float* ScaleMultiplier, float Duration, bool IsLoop, int32 LoopTimes);
	void TickMoveBG(float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpliceImgBG">();
	}
	static class USpliceImgBG* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpliceImgBG>();
	}
};
static_assert(alignof(USpliceImgBG) == 0x000008, "Wrong alignment on USpliceImgBG");
static_assert(sizeof(USpliceImgBG) == 0x000290, "Wrong size on USpliceImgBG");
static_assert(offsetof(USpliceImgBG, bTick) == 0x000288, "Member 'USpliceImgBG::bTick' has a wrong offset!");

// Class Plot.PlotItem_InteractionGame
// 0x0050 (0x00E0 - 0x0090)
class UPlotItem_InteractionGame final : public UPlotItem
{
public:
	int32                                         PosID;                                             // 0x0090(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         LangKeys;                                          // 0x0098(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          IsEnforceProcess;                                  // 0x00A8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseComponent*                        WwiseComponent;                                    // 0x00B0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B8[0x28];                                      // 0x00B8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<struct FInteractionGameRecord> GetHasPlayRecord();
	void OnInput();
	void OnTalkBegin(const class FString& InText, const class FString& InSpeaker, const class FString& InWwiseKey);
	void OnTalkTextChange(const class FString& InText, int32 InMaxNumText, const class FString& Speaker);
	void OnWwiseBegin(const class FString& InWwiseEventID);
	void OnWwiseCompleteHandler(class UWwiseComponent* InWwiseComponent);
	void StopCurPlayWwiseByWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlotItem_InteractionGame">();
	}
	static class UPlotItem_InteractionGame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotItem_InteractionGame>();
	}
};
static_assert(alignof(UPlotItem_InteractionGame) == 0x000008, "Wrong alignment on UPlotItem_InteractionGame");
static_assert(sizeof(UPlotItem_InteractionGame) == 0x0000E0, "Wrong size on UPlotItem_InteractionGame");
static_assert(offsetof(UPlotItem_InteractionGame, PosID) == 0x000090, "Member 'UPlotItem_InteractionGame::PosID' has a wrong offset!");
static_assert(offsetof(UPlotItem_InteractionGame, LangKeys) == 0x000098, "Member 'UPlotItem_InteractionGame::LangKeys' has a wrong offset!");
static_assert(offsetof(UPlotItem_InteractionGame, IsEnforceProcess) == 0x0000A8, "Member 'UPlotItem_InteractionGame::IsEnforceProcess' has a wrong offset!");
static_assert(offsetof(UPlotItem_InteractionGame, WwiseComponent) == 0x0000B0, "Member 'UPlotItem_InteractionGame::WwiseComponent' has a wrong offset!");

// Class Plot.MovieClipCameraActor
// 0x0010 (0x07D0 - 0x07C0)
class AMovieClipCameraActor final : public ACameraActor
{
public:
	class UStaticMeshComponent*                   PlaneComponent;                                    // 0x07C0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   BackgroundMesh;                                    // 0x07C8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieClipCameraActor">();
	}
	static class AMovieClipCameraActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMovieClipCameraActor>();
	}
};
static_assert(alignof(AMovieClipCameraActor) == 0x000010, "Wrong alignment on AMovieClipCameraActor");
static_assert(sizeof(AMovieClipCameraActor) == 0x0007D0, "Wrong size on AMovieClipCameraActor");
static_assert(offsetof(AMovieClipCameraActor, PlaneComponent) == 0x0007C0, "Member 'AMovieClipCameraActor::PlaneComponent' has a wrong offset!");
static_assert(offsetof(AMovieClipCameraActor, BackgroundMesh) == 0x0007C8, "Member 'AMovieClipCameraActor::BackgroundMesh' has a wrong offset!");

// Class Plot.MovieClipCanvasPanel
// 0x0000 (0x0150 - 0x0150)
class UMovieClipCanvasPanel final : public UCanvasPanel
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieClipCanvasPanel">();
	}
	static class UMovieClipCanvasPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieClipCanvasPanel>();
	}
};
static_assert(alignof(UMovieClipCanvasPanel) == 0x000008, "Wrong alignment on UMovieClipCanvasPanel");
static_assert(sizeof(UMovieClipCanvasPanel) == 0x000150, "Wrong size on UMovieClipCanvasPanel");

// Class Plot.MovieClipImage
// 0x00E8 (0x0210 - 0x0128)
class UMovieClipImage : public UWidget
{
public:
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Brush;                                             // 0x0130(0x0088)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class ULevelSequence*                         LpSequence;                                        // 0x01B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMainView;                                       // 0x01C0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxViewDistance;                                   // 0x01C4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              PlaybackRange;                                     // 0x01C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             BrushDelegate;                                     // 0x01D0(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E0[0x30];                                     // 0x01E0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCameraCut(class UCameraComponent* CameraComp);
	void PlayAnimation();
	void StopAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieClipImage">();
	}
	static class UMovieClipImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieClipImage>();
	}
};
static_assert(alignof(UMovieClipImage) == 0x000008, "Wrong alignment on UMovieClipImage");
static_assert(sizeof(UMovieClipImage) == 0x000210, "Wrong size on UMovieClipImage");
static_assert(offsetof(UMovieClipImage, Brush) == 0x000130, "Member 'UMovieClipImage::Brush' has a wrong offset!");
static_assert(offsetof(UMovieClipImage, LpSequence) == 0x0001B8, "Member 'UMovieClipImage::LpSequence' has a wrong offset!");
static_assert(offsetof(UMovieClipImage, bIsMainView) == 0x0001C0, "Member 'UMovieClipImage::bIsMainView' has a wrong offset!");
static_assert(offsetof(UMovieClipImage, MaxViewDistance) == 0x0001C4, "Member 'UMovieClipImage::MaxViewDistance' has a wrong offset!");
static_assert(offsetof(UMovieClipImage, PlaybackRange) == 0x0001C8, "Member 'UMovieClipImage::PlaybackRange' has a wrong offset!");
static_assert(offsetof(UMovieClipImage, BrushDelegate) == 0x0001D0, "Member 'UMovieClipImage::BrushDelegate' has a wrong offset!");

// Class Plot.PlotItem_LuaImpl
// 0x0020 (0x00B0 - 0x0090)
class UPlotItem_LuaImpl : public UPlotItem
{
public:
	EPlotWidgetOrderType                          OrderType;                                         // 0x0090(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OrderOffset;                                       // 0x0094(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x18];                                      // 0x0098(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsSingleWidget();
	void SetWait(bool InValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlotItem_LuaImpl">();
	}
	static class UPlotItem_LuaImpl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotItem_LuaImpl>();
	}
};
static_assert(alignof(UPlotItem_LuaImpl) == 0x000008, "Wrong alignment on UPlotItem_LuaImpl");
static_assert(sizeof(UPlotItem_LuaImpl) == 0x0000B0, "Wrong size on UPlotItem_LuaImpl");
static_assert(offsetof(UPlotItem_LuaImpl, OrderType) == 0x000090, "Member 'UPlotItem_LuaImpl::OrderType' has a wrong offset!");
static_assert(offsetof(UPlotItem_LuaImpl, OrderOffset) == 0x000094, "Member 'UPlotItem_LuaImpl::OrderOffset' has a wrong offset!");

// Class Plot.PlotItem_AssignNpcName
// 0x0010 (0x00C0 - 0x00B0)
class UPlotItem_AssignNpcName final : public UPlotItem_LuaImpl
{
public:
	class FString                                 NPC;                                               // 0x00B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlotItem_AssignNpcName">();
	}
	static class UPlotItem_AssignNpcName* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotItem_AssignNpcName>();
	}
};
static_assert(alignof(UPlotItem_AssignNpcName) == 0x000008, "Wrong alignment on UPlotItem_AssignNpcName");
static_assert(sizeof(UPlotItem_AssignNpcName) == 0x0000C0, "Wrong size on UPlotItem_AssignNpcName");
static_assert(offsetof(UPlotItem_AssignNpcName, NPC) == 0x0000B0, "Member 'UPlotItem_AssignNpcName::NPC' has a wrong offset!");

// Class Plot.MovieClipMediaSourceImage
// 0x0050 (0x0260 - 0x0210)
class UMovieClipMediaSourceImage final : public UMovieClipImage
{
public:
	class FString                                 MP4Path;                                           // 0x0210(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFileMediaSource*                       LpMediaSource;                                     // 0x0220(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMediaPlayer*                           LpMediaPlayer;                                     // 0x0228(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        MediaTexturePath;                                  // 0x0230(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMediaTexture*                          MediaTexture;                                      // 0x0248(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AMovieClipCameraActor*                  MovieClipCameraActor;                              // 0x0250(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_258[0x8];                                      // 0x0258(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AutoSetPath();
	void OnMediaOpenFailedHandler(const class FString& DeviceUrl);
	void OnMediaSourceOpenedHandler(const class FString& DeviceUrl);

	TArray<class FString> GetFileList() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieClipMediaSourceImage">();
	}
	static class UMovieClipMediaSourceImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieClipMediaSourceImage>();
	}
};
static_assert(alignof(UMovieClipMediaSourceImage) == 0x000008, "Wrong alignment on UMovieClipMediaSourceImage");
static_assert(sizeof(UMovieClipMediaSourceImage) == 0x000260, "Wrong size on UMovieClipMediaSourceImage");
static_assert(offsetof(UMovieClipMediaSourceImage, MP4Path) == 0x000210, "Member 'UMovieClipMediaSourceImage::MP4Path' has a wrong offset!");
static_assert(offsetof(UMovieClipMediaSourceImage, LpMediaSource) == 0x000220, "Member 'UMovieClipMediaSourceImage::LpMediaSource' has a wrong offset!");
static_assert(offsetof(UMovieClipMediaSourceImage, LpMediaPlayer) == 0x000228, "Member 'UMovieClipMediaSourceImage::LpMediaPlayer' has a wrong offset!");
static_assert(offsetof(UMovieClipMediaSourceImage, MediaTexturePath) == 0x000230, "Member 'UMovieClipMediaSourceImage::MediaTexturePath' has a wrong offset!");
static_assert(offsetof(UMovieClipMediaSourceImage, MediaTexture) == 0x000248, "Member 'UMovieClipMediaSourceImage::MediaTexture' has a wrong offset!");
static_assert(offsetof(UMovieClipMediaSourceImage, MovieClipCameraActor) == 0x000250, "Member 'UMovieClipMediaSourceImage::MovieClipCameraActor' has a wrong offset!");

// Class Plot.PlotItem_Root
// 0x0030 (0x00C0 - 0x0090)
class UPlotItem_Root final : public UPlotItem
{
public:
	struct FTalkConfig                            TalkConfig;                                        // 0x0090(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlotItem_Root">();
	}
	static class UPlotItem_Root* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotItem_Root>();
	}
};
static_assert(alignof(UPlotItem_Root) == 0x000008, "Wrong alignment on UPlotItem_Root");
static_assert(sizeof(UPlotItem_Root) == 0x0000C0, "Wrong size on UPlotItem_Root");
static_assert(offsetof(UPlotItem_Root, TalkConfig) == 0x000090, "Member 'UPlotItem_Root::TalkConfig' has a wrong offset!");

// Class Plot.MovieClipNormalSubtitlesText
// 0x0020 (0x02E8 - 0x02C8)
class UMovieClipNormalSubtitlesText final : public UTextBlock
{
public:
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Key;                                               // 0x02D0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E0[0x8];                                      // 0x02E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieClipNormalSubtitlesText">();
	}
	static class UMovieClipNormalSubtitlesText* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieClipNormalSubtitlesText>();
	}
};
static_assert(alignof(UMovieClipNormalSubtitlesText) == 0x000008, "Wrong alignment on UMovieClipNormalSubtitlesText");
static_assert(sizeof(UMovieClipNormalSubtitlesText) == 0x0002E8, "Wrong size on UMovieClipNormalSubtitlesText");
static_assert(offsetof(UMovieClipNormalSubtitlesText, Key) == 0x0002D0, "Member 'UMovieClipNormalSubtitlesText::Key' has a wrong offset!");

// Class Plot.PlotCondition
// 0x0000 (0x0028 - 0x0028)
class UPlotCondition : public UObject
{
public:
	bool Check();

	class UPlot* GetPlot() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlotCondition">();
	}
	static class UPlotCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotCondition>();
	}
};
static_assert(alignof(UPlotCondition) == 0x000008, "Wrong alignment on UPlotCondition");
static_assert(sizeof(UPlotCondition) == 0x000028, "Wrong size on UPlotCondition");

// Class Plot.PlotTimeoutCondition
// 0x0010 (0x0038 - 0x0028)
class UPlotTimeoutCondition final : public UPlotCondition
{
public:
	class FString                                 Key;                                               // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlotTimeoutCondition">();
	}
	static class UPlotTimeoutCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotTimeoutCondition>();
	}
};
static_assert(alignof(UPlotTimeoutCondition) == 0x000008, "Wrong alignment on UPlotTimeoutCondition");
static_assert(sizeof(UPlotTimeoutCondition) == 0x000038, "Wrong size on UPlotTimeoutCondition");
static_assert(offsetof(UPlotTimeoutCondition, Key) == 0x000028, "Member 'UPlotTimeoutCondition::Key' has a wrong offset!");

// Class Plot.MovieSkipWidget
// 0x0020 (0x02A0 - 0x0280)
class UMovieSkipWidget final : public UUserWidget
{
public:
	class UMaterialInstanceDynamic*               SkipCircleInstance;                                // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStartingCount;                                    // 0x0288(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartToNow;                                        // 0x028C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkipIntervalTime;                                  // 0x0290(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpValue;                                       // 0x0294(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                 SkipCircle;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSkipWidget">();
	}
	static class UMovieSkipWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSkipWidget>();
	}
};
static_assert(alignof(UMovieSkipWidget) == 0x000008, "Wrong alignment on UMovieSkipWidget");
static_assert(sizeof(UMovieSkipWidget) == 0x0002A0, "Wrong size on UMovieSkipWidget");
static_assert(offsetof(UMovieSkipWidget, SkipCircleInstance) == 0x000280, "Member 'UMovieSkipWidget::SkipCircleInstance' has a wrong offset!");
static_assert(offsetof(UMovieSkipWidget, bStartingCount) == 0x000288, "Member 'UMovieSkipWidget::bStartingCount' has a wrong offset!");
static_assert(offsetof(UMovieSkipWidget, StartToNow) == 0x00028C, "Member 'UMovieSkipWidget::StartToNow' has a wrong offset!");
static_assert(offsetof(UMovieSkipWidget, SkipIntervalTime) == 0x000290, "Member 'UMovieSkipWidget::SkipIntervalTime' has a wrong offset!");
static_assert(offsetof(UMovieSkipWidget, InterpValue) == 0x000294, "Member 'UMovieSkipWidget::InterpValue' has a wrong offset!");
static_assert(offsetof(UMovieSkipWidget, SkipCircle) == 0x000298, "Member 'UMovieSkipWidget::SkipCircle' has a wrong offset!");

// Class Plot.Plot
// 0x0278 (0x02A0 - 0x0028)
class UPlot final : public UObject
{
public:
	class FString                                 PlotConfig;                                        // 0x0028(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        BGPath;                                            // 0x0038(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowBackgroundMask;                               // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeTime;                                          // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class USequencerUserWidget>       StageAnimationWidgetClass;                         // 0x0058(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpineAnimationBlendTime;                           // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Preload;                                           // 0x0064(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlotItem*                              RootItem;                                          // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x118];                                     // 0x0070(0x0118)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UPlotWidget>             Widget;                                            // 0x0188(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USequencerUserWidget*                   SequencerWidget;                                   // 0x0190(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlotItem*                              SequencerPlotItem;                                 // 0x0198(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlotItem*                              CGSpinePlotItem;                                   // 0x01A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FConfigItem>       ConfigMap;                                         // 0x01B0(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_200[0xA0];                                     // 0x0200(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void ReloadLanguage();
	static void SetPlotLanguageNames(const TArray<class FString>& InLanguageNames);

	void Cleanup();
	void ClearSequence();
	void End(EPlotCompleteType InCompleteType);
	int32 GetConfigId();
	struct FConfigItem GetTalkConfig(class FString* InKey);
	bool IsJump(class UPlotItem* InItem);
	void OnSequencerFinishedHandler();
	void OnWindowActivatedHandler();
	void OnWindowDeactivatedHandler();
	void SetAutoPlay(bool bIsAutoPlay);
	void SetPlayMode(const EPlayMode InPlayMode);
	void SetWidget(class UPlotWidget* InWidget);
	void Start();

	float GetFadeTime() const;
	bool GetIsAutoPlay() const;
	EPlayMode GetPlayMode() const;
	float GetPlaySpeed() const;
	class UPlotItem* GetRootItem() const;
	class UPlotWidget* GetWidget() const;
	class UWorld* GetWorld() const;
	bool HasKey(const class FString& InKey) const;
	bool IsNormalDialogueType() const;
	bool IsVisiableSequencerUserWidget() const;
	bool JumpTo(const class FString& InKey) const;
	void SaveKey(const class FString& InKey) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Plot">();
	}
	static class UPlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlot>();
	}
};
static_assert(alignof(UPlot) == 0x000008, "Wrong alignment on UPlot");
static_assert(sizeof(UPlot) == 0x0002A0, "Wrong size on UPlot");
static_assert(offsetof(UPlot, PlotConfig) == 0x000028, "Member 'UPlot::PlotConfig' has a wrong offset!");
static_assert(offsetof(UPlot, BGPath) == 0x000038, "Member 'UPlot::BGPath' has a wrong offset!");
static_assert(offsetof(UPlot, bShowBackgroundMask) == 0x000050, "Member 'UPlot::bShowBackgroundMask' has a wrong offset!");
static_assert(offsetof(UPlot, FadeTime) == 0x000054, "Member 'UPlot::FadeTime' has a wrong offset!");
static_assert(offsetof(UPlot, StageAnimationWidgetClass) == 0x000058, "Member 'UPlot::StageAnimationWidgetClass' has a wrong offset!");
static_assert(offsetof(UPlot, SpineAnimationBlendTime) == 0x000060, "Member 'UPlot::SpineAnimationBlendTime' has a wrong offset!");
static_assert(offsetof(UPlot, Preload) == 0x000064, "Member 'UPlot::Preload' has a wrong offset!");
static_assert(offsetof(UPlot, RootItem) == 0x000068, "Member 'UPlot::RootItem' has a wrong offset!");
static_assert(offsetof(UPlot, Widget) == 0x000188, "Member 'UPlot::Widget' has a wrong offset!");
static_assert(offsetof(UPlot, SequencerWidget) == 0x000190, "Member 'UPlot::SequencerWidget' has a wrong offset!");
static_assert(offsetof(UPlot, SequencerPlotItem) == 0x000198, "Member 'UPlot::SequencerPlotItem' has a wrong offset!");
static_assert(offsetof(UPlot, CGSpinePlotItem) == 0x0001A0, "Member 'UPlot::CGSpinePlotItem' has a wrong offset!");
static_assert(offsetof(UPlot, ConfigMap) == 0x0001B0, "Member 'UPlot::ConfigMap' has a wrong offset!");

// Class Plot.PlotCameraObj
// 0x0058 (0x0080 - 0x0028)
class UPlotCameraObj final : public UObject
{
public:
	struct FPlotCameraInfo                        CameraArgs;                                        // 0x0028(0x0058)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlotCameraObj">();
	}
	static class UPlotCameraObj* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotCameraObj>();
	}
};
static_assert(alignof(UPlotCameraObj) == 0x000008, "Wrong alignment on UPlotCameraObj");
static_assert(sizeof(UPlotCameraObj) == 0x000080, "Wrong size on UPlotCameraObj");
static_assert(offsetof(UPlotCameraObj, CameraArgs) == 0x000028, "Member 'UPlotCameraObj::CameraArgs' has a wrong offset!");

// Class Plot.PlotCharacter
// 0x0050 (0x0510 - 0x04C0)
class APlotCharacter final : public ACharacter
{
public:
	class USpringArmComponent*                    CameraArm;                                         // 0x04B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraComponent*                       Camera;                                            // 0x04C0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C8[0x48];                                     // 0x04C8(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FPlotCameraInfo GetCameraArgs() const;
	void SetCameraArgs(const struct FPlotCameraInfo& InArgs, class UPlot* InPlot) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlotCharacter">();
	}
	static class APlotCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlotCharacter>();
	}
};
static_assert(alignof(APlotCharacter) == 0x000010, "Wrong alignment on APlotCharacter");
static_assert(sizeof(APlotCharacter) == 0x000510, "Wrong size on APlotCharacter");
static_assert(offsetof(APlotCharacter, CameraArm) == 0x0004B8, "Member 'APlotCharacter::CameraArm' has a wrong offset!");
static_assert(offsetof(APlotCharacter, Camera) == 0x0004C0, "Member 'APlotCharacter::Camera' has a wrong offset!");

// Class Plot.PlotImage
// 0x0058 (0x0288 - 0x0230)
class UPlotImage final : public UImage
{
public:
	uint8                                         Pad_230[0x58];                                     // 0x0230(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlotImage">();
	}
	static class UPlotImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotImage>();
	}
};
static_assert(alignof(UPlotImage) == 0x000008, "Wrong alignment on UPlotImage");
static_assert(sizeof(UPlotImage) == 0x000288, "Wrong size on UPlotImage");

// Class Plot.PlotItem_LuaWidget
// 0x0010 (0x00C0 - 0x00B0)
class UPlotItem_LuaWidget final : public UPlotItem_LuaImpl
{
public:
	class FString                                 LuaPath;                                           // 0x00B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlotItem_LuaWidget">();
	}
	static class UPlotItem_LuaWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotItem_LuaWidget>();
	}
};
static_assert(alignof(UPlotItem_LuaWidget) == 0x000008, "Wrong alignment on UPlotItem_LuaWidget");
static_assert(sizeof(UPlotItem_LuaWidget) == 0x0000C0, "Wrong size on UPlotItem_LuaWidget");
static_assert(offsetof(UPlotItem_LuaWidget, LuaPath) == 0x0000B0, "Member 'UPlotItem_LuaWidget::LuaPath' has a wrong offset!");

// Class Plot.PlotReadKeyCondition
// 0x0018 (0x0040 - 0x0028)
class UPlotReadKeyCondition final : public UPlotCondition
{
public:
	class FString                                 Key;                                               // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSavedKey;                                      // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasRead;                                          // 0x0039(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlotReadKeyCondition">();
	}
	static class UPlotReadKeyCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotReadKeyCondition>();
	}
};
static_assert(alignof(UPlotReadKeyCondition) == 0x000008, "Wrong alignment on UPlotReadKeyCondition");
static_assert(sizeof(UPlotReadKeyCondition) == 0x000040, "Wrong size on UPlotReadKeyCondition");
static_assert(offsetof(UPlotReadKeyCondition, Key) == 0x000028, "Member 'UPlotReadKeyCondition::Key' has a wrong offset!");
static_assert(offsetof(UPlotReadKeyCondition, bUseSavedKey) == 0x000038, "Member 'UPlotReadKeyCondition::bUseSavedKey' has a wrong offset!");
static_assert(offsetof(UPlotReadKeyCondition, bHasRead) == 0x000039, "Member 'UPlotReadKeyCondition::bHasRead' has a wrong offset!");

// Class Plot.PlotSelectNumCondition
// 0x0008 (0x0030 - 0x0028)
class UPlotSelectNumCondition final : public UPlotCondition
{
public:
	int32                                         Num;                                               // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlotSelectNumCondition">();
	}
	static class UPlotSelectNumCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotSelectNumCondition>();
	}
};
static_assert(alignof(UPlotSelectNumCondition) == 0x000008, "Wrong alignment on UPlotSelectNumCondition");
static_assert(sizeof(UPlotSelectNumCondition) == 0x000030, "Wrong size on UPlotSelectNumCondition");
static_assert(offsetof(UPlotSelectNumCondition, Num) == 0x000028, "Member 'UPlotSelectNumCondition::Num' has a wrong offset!");

// Class Plot.PlotLuaImplWidget
// 0x0008 (0x0288 - 0x0280)
class UPlotLuaImplWidget final : public UUserWidget
{
public:
	uint8                                         Pad_280[0x8];                                      // 0x0280(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void NotifyStart(class UPlotItem_LuaImpl* InPlotItem, class UPlotWidget* InPlotWidget, bool InIsPreview);
	void NotifyStop();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlotLuaImplWidget">();
	}
	static class UPlotLuaImplWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotLuaImplWidget>();
	}
};
static_assert(alignof(UPlotLuaImplWidget) == 0x000008, "Wrong alignment on UPlotLuaImplWidget");
static_assert(sizeof(UPlotLuaImplWidget) == 0x000288, "Wrong size on UPlotLuaImplWidget");

// Class Plot.PlotEvent
// 0x0000 (0x0028 - 0x0028)
class UPlotEvent : public UObject
{
public:
	bool DoEvent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlotEvent">();
	}
	static class UPlotEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotEvent>();
	}
};
static_assert(alignof(UPlotEvent) == 0x000008, "Wrong alignment on UPlotEvent");
static_assert(sizeof(UPlotEvent) == 0x000028, "Wrong size on UPlotEvent");

// Class Plot.PlotEvent_JumpKey
// 0x0010 (0x0038 - 0x0028)
class UPlotEvent_JumpKey final : public UPlotEvent
{
public:
	class FString                                 Key;                                               // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlotEvent_JumpKey">();
	}
	static class UPlotEvent_JumpKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotEvent_JumpKey>();
	}
};
static_assert(alignof(UPlotEvent_JumpKey) == 0x000008, "Wrong alignment on UPlotEvent_JumpKey");
static_assert(sizeof(UPlotEvent_JumpKey) == 0x000038, "Wrong size on UPlotEvent_JumpKey");
static_assert(offsetof(UPlotEvent_JumpKey, Key) == 0x000028, "Member 'UPlotEvent_JumpKey::Key' has a wrong offset!");

// Class Plot.PlotSaveItem
// 0x0088 (0x0118 - 0x0090)
class UPlotSaveItem : public UPlotItem
{
public:
	struct FConfigItem                            Config;                                            // 0x0090(0x0080)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	bool                                          bSave;                                             // 0x0110(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class FString GetContentFromSelectItemData(const struct FSelectItemData& SelectItemData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlotSaveItem">();
	}
	static class UPlotSaveItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotSaveItem>();
	}
};
static_assert(alignof(UPlotSaveItem) == 0x000008, "Wrong alignment on UPlotSaveItem");
static_assert(sizeof(UPlotSaveItem) == 0x000118, "Wrong size on UPlotSaveItem");
static_assert(offsetof(UPlotSaveItem, Config) == 0x000090, "Member 'UPlotSaveItem::Config' has a wrong offset!");
static_assert(offsetof(UPlotSaveItem, bSave) == 0x000110, "Member 'UPlotSaveItem::bSave' has a wrong offset!");

// Class Plot.PlotItem_AddSpotLight
// 0x0060 (0x00F0 - 0x0090)
class UPlotItem_AddSpotLight final : public UPlotItem
{
public:
	class FString                                 RoleName;                                          // 0x0090(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LightName;                                         // 0x00A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSpotLightParameters                   SpotLightParameters;                               // 0x00B0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                RelativeLocation;                                  // 0x00D0(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RelativeRotation;                                  // 0x00DC(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         bHide : 1;                                         // 0x00E8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlotItem_AddSpotLight">();
	}
	static class UPlotItem_AddSpotLight* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotItem_AddSpotLight>();
	}
};
static_assert(alignof(UPlotItem_AddSpotLight) == 0x000008, "Wrong alignment on UPlotItem_AddSpotLight");
static_assert(sizeof(UPlotItem_AddSpotLight) == 0x0000F0, "Wrong size on UPlotItem_AddSpotLight");
static_assert(offsetof(UPlotItem_AddSpotLight, RoleName) == 0x000090, "Member 'UPlotItem_AddSpotLight::RoleName' has a wrong offset!");
static_assert(offsetof(UPlotItem_AddSpotLight, LightName) == 0x0000A0, "Member 'UPlotItem_AddSpotLight::LightName' has a wrong offset!");
static_assert(offsetof(UPlotItem_AddSpotLight, SpotLightParameters) == 0x0000B0, "Member 'UPlotItem_AddSpotLight::SpotLightParameters' has a wrong offset!");
static_assert(offsetof(UPlotItem_AddSpotLight, RelativeLocation) == 0x0000D0, "Member 'UPlotItem_AddSpotLight::RelativeLocation' has a wrong offset!");
static_assert(offsetof(UPlotItem_AddSpotLight, RelativeRotation) == 0x0000DC, "Member 'UPlotItem_AddSpotLight::RelativeRotation' has a wrong offset!");

// Class Plot.PlotSubtitlesTextBlock
// 0x0000 (0x02C8 - 0x02C8)
class UPlotSubtitlesTextBlock final : public UTextBlock
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlotSubtitlesTextBlock">();
	}
	static class UPlotSubtitlesTextBlock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotSubtitlesTextBlock>();
	}
};
static_assert(alignof(UPlotSubtitlesTextBlock) == 0x000008, "Wrong alignment on UPlotSubtitlesTextBlock");
static_assert(sizeof(UPlotSubtitlesTextBlock) == 0x0002C8, "Wrong size on UPlotSubtitlesTextBlock");

// Class Plot.PlotItem_BackgroundSubtitles
// 0x00B8 (0x0148 - 0x0090)
class UPlotItem_BackgroundSubtitles final : public UPlotItem
{
public:
	class FText                                   Text;                                              // 0x0090(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   TextKey;                                           // 0x00A8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FString                                 WwiseEventID;                                      // 0x00C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseSelfLangFile;                                   // 0x00D0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        FontPath;                                          // 0x00D8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FontSize;                                          // 0x00F0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextJustify                                  Justification;                                     // 0x00F4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
