#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostFog_Under_BP

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "PostFogInSide_Str_structs.hpp"
#include "TwostFogInSide_Str_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PostFog_Under_BP.PostFog_Under_BP_C.Initializ Fog Param
// 0x00F0 (0x00F0 - 0x0000)
struct PostFog_Under_BP_C_Initializ_Fog_Param final
{
public:
	int32                                         ___int_Array_Index_Variable;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AExpFog_C*>                      CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	class AExpFog_C*                              CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFogConfig1st                          CallFunc_Get_Fog_Data_Value_Fog_Data_1st;          // 0x0030(0x0024)(NoDestructor)
	struct FFogConfig2st                          CallFunc_Get_Fog_Data_Value_Fog_Data_2st;          // 0x0054(0x0024)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTwostFogInSide_Str                    K2Node_MakeStruct_2stFogInSide_Str;                // 0x007C(0x0024)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPostFogInSide_Str                     K2Node_MakeStruct_PostFogInSide_Str;               // 0x00A0(0x0024)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostFogInSide_Str                     K2Node_MakeStruct_PostFogInSide_Str_1;             // 0x00CC(0x0024)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PostFog_Under_BP_C_Initializ_Fog_Param) == 0x000008, "Wrong alignment on PostFog_Under_BP_C_Initializ_Fog_Param");
static_assert(sizeof(PostFog_Under_BP_C_Initializ_Fog_Param) == 0x0000F0, "Wrong size on PostFog_Under_BP_C_Initializ_Fog_Param");
static_assert(offsetof(PostFog_Under_BP_C_Initializ_Fog_Param, ___int_Array_Index_Variable) == 0x000000, "Member 'PostFog_Under_BP_C_Initializ_Fog_Param::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_Initializ_Fog_Param, ___int_Loop_Counter_Variable) == 0x000004, "Member 'PostFog_Under_BP_C_Initializ_Fog_Param::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_Initializ_Fog_Param, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'PostFog_Under_BP_C_Initializ_Fog_Param::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_Initializ_Fog_Param, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'PostFog_Under_BP_C_Initializ_Fog_Param::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_Initializ_Fog_Param, CallFunc_Array_Get_Item) == 0x000020, "Member 'PostFog_Under_BP_C_Initializ_Fog_Param::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_Initializ_Fog_Param, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'PostFog_Under_BP_C_Initializ_Fog_Param::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_Initializ_Fog_Param, CallFunc_Get_Fog_Data_Value_Fog_Data_1st) == 0x000030, "Member 'PostFog_Under_BP_C_Initializ_Fog_Param::CallFunc_Get_Fog_Data_Value_Fog_Data_1st' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_Initializ_Fog_Param, CallFunc_Get_Fog_Data_Value_Fog_Data_2st) == 0x000054, "Member 'PostFog_Under_BP_C_Initializ_Fog_Param::CallFunc_Get_Fog_Data_Value_Fog_Data_2st' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_Initializ_Fog_Param, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'PostFog_Under_BP_C_Initializ_Fog_Param::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_Initializ_Fog_Param, K2Node_MakeStruct_2stFogInSide_Str) == 0x00007C, "Member 'PostFog_Under_BP_C_Initializ_Fog_Param::K2Node_MakeStruct_2stFogInSide_Str' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_Initializ_Fog_Param, K2Node_MakeStruct_PostFogInSide_Str) == 0x0000A0, "Member 'PostFog_Under_BP_C_Initializ_Fog_Param::K2Node_MakeStruct_PostFogInSide_Str' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_Initializ_Fog_Param, CallFunc_Array_Length_ReturnValue) == 0x0000C4, "Member 'PostFog_Under_BP_C_Initializ_Fog_Param::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_Initializ_Fog_Param, CallFunc_Less_IntInt_ReturnValue) == 0x0000C8, "Member 'PostFog_Under_BP_C_Initializ_Fog_Param::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_Initializ_Fog_Param, K2Node_MakeStruct_PostFogInSide_Str_1) == 0x0000CC, "Member 'PostFog_Under_BP_C_Initializ_Fog_Param::K2Node_MakeStruct_PostFogInSide_Str_1' has a wrong offset!");

// Function PostFog_Under_BP.PostFog_Under_BP_C.GetExpHeightFog
// 0x0058 (0x0058 - 0x0000)
struct PostFog_Under_BP_C_GetExpHeightFog final
{
public:
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFogMangaer_C*>                  CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ReferenceParm)
	TArray<class AExpFog_C*>                      CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0028(0x0010)(ReferenceParm)
	class AFogMangaer_C*                          CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AExpFog_C*                              CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostFog_Under_BP_C_GetExpHeightFog) == 0x000008, "Wrong alignment on PostFog_Under_BP_C_GetExpHeightFog");
static_assert(sizeof(PostFog_Under_BP_C_GetExpHeightFog) == 0x000058, "Wrong size on PostFog_Under_BP_C_GetExpHeightFog");
static_assert(offsetof(PostFog_Under_BP_C_GetExpHeightFog, ___int_Loop_Counter_Variable) == 0x000000, "Member 'PostFog_Under_BP_C_GetExpHeightFog::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_GetExpHeightFog, ___int_Array_Index_Variable) == 0x000004, "Member 'PostFog_Under_BP_C_GetExpHeightFog::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_GetExpHeightFog, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'PostFog_Under_BP_C_GetExpHeightFog::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_GetExpHeightFog, ___int_Loop_Counter_Variable_1) == 0x00000C, "Member 'PostFog_Under_BP_C_GetExpHeightFog::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_GetExpHeightFog, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'PostFog_Under_BP_C_GetExpHeightFog::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_GetExpHeightFog, ___int_Array_Index_Variable_1) == 0x000014, "Member 'PostFog_Under_BP_C_GetExpHeightFog::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_GetExpHeightFog, CallFunc_GetAllActorsOfClass_OutActors) == 0x000018, "Member 'PostFog_Under_BP_C_GetExpHeightFog::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_GetExpHeightFog, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000028, "Member 'PostFog_Under_BP_C_GetExpHeightFog::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_GetExpHeightFog, CallFunc_Array_Get_Item) == 0x000038, "Member 'PostFog_Under_BP_C_GetExpHeightFog::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_GetExpHeightFog, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'PostFog_Under_BP_C_GetExpHeightFog::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_GetExpHeightFog, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'PostFog_Under_BP_C_GetExpHeightFog::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_GetExpHeightFog, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'PostFog_Under_BP_C_GetExpHeightFog::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_GetExpHeightFog, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'PostFog_Under_BP_C_GetExpHeightFog::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_GetExpHeightFog, CallFunc_Array_Length_ReturnValue_1) == 0x000050, "Member 'PostFog_Under_BP_C_GetExpHeightFog::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_GetExpHeightFog, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'PostFog_Under_BP_C_GetExpHeightFog::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_GetExpHeightFog, CallFunc_Less_IntInt_ReturnValue_1) == 0x000055, "Member 'PostFog_Under_BP_C_GetExpHeightFog::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function PostFog_Under_BP.PostFog_Under_BP_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct PostFog_Under_BP_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostFog_Under_BP_C_UserConstructionScript) == 0x000001, "Wrong alignment on PostFog_Under_BP_C_UserConstructionScript");
static_assert(sizeof(PostFog_Under_BP_C_UserConstructionScript) == 0x000001, "Wrong size on PostFog_Under_BP_C_UserConstructionScript");
static_assert(offsetof(PostFog_Under_BP_C_UserConstructionScript, CallFunc_IsEditor_ReturnValue) == 0x000000, "Member 'PostFog_Under_BP_C_UserConstructionScript::CallFunc_IsEditor_ReturnValue' has a wrong offset!");

// Function PostFog_Under_BP.PostFog_Under_BP_C.FogInitialize
// 0x0001 (0x0001 - 0x0000)
struct PostFog_Under_BP_C_FogInitialize final
{
public:
	bool                                          bIsInCollision;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostFog_Under_BP_C_FogInitialize) == 0x000001, "Wrong alignment on PostFog_Under_BP_C_FogInitialize");
static_assert(sizeof(PostFog_Under_BP_C_FogInitialize) == 0x000001, "Wrong size on PostFog_Under_BP_C_FogInitialize");
static_assert(offsetof(PostFog_Under_BP_C_FogInitialize, bIsInCollision) == 0x000000, "Member 'PostFog_Under_BP_C_FogInitialize::bIsInCollision' has a wrong offset!");

// Function PostFog_Under_BP.PostFog_Under_BP_C.BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function PostFog_Under_BP.PostFog_Under_BP_C.BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'PostFog_Under_BP_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function PostFog_Under_BP.PostFog_Under_BP_C.ExecuteUbergraph_PostFog_Under_BP
// 0x01C8 (0x01C8 - 0x0000)
struct PostFog_Under_BP_C_ExecuteUbergraph_PostFog_Under_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsInCollision;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOverlappingActor_ReturnValue;           // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_2;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOverlappingActor_ReturnValue_1;         // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_3;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOverlappingComponent_ReturnValue;       // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOverlappingComponent_ReturnValue_1;     // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanProcessTriggerEvent_ReturnValue;       // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87[0x1];                                       // 0x0087(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x00A8(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player_1;                // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanProcessTriggerEvent_ReturnValue_1;     // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_146[0x2];                                      // 0x0146(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGameRogue3D_ReturnValue;                // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGameRogue3D_ReturnValue_1;              // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_163[0x1];                                      // 0x0163(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0164(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_2;                         // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_2;          // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_3;                         // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_3;          // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(PostFog_Under_BP_C_ExecuteUbergraph_PostFog_Under_BP) == 0x000008, "Wrong alignment on PostFog_Under_BP_C_ExecuteUbergraph_PostFog_Under_BP");
static_assert(sizeof(PostFog_Under_BP_C_ExecuteUbergraph_PostFog_Under_BP) == 0x0001C8, "Wrong size on PostFog_Under_BP_C_ExecuteUbergraph_PostFog_Under_BP");
static_assert(offsetof(PostFog_Under_BP_C_ExecuteUbergraph_PostFog_Under_BP, EntryPoint) == 0x000000, "Member 'PostFog_Under_BP_C_ExecuteUbergraph_PostFog_Under_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(PostFog_Under_BP_C_ExecuteUbergraph_PostFog_Under_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'PostFog_Under_BP_C_ExecuteUbergraph_PostFog_Under_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
