#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostFogInSide_Str

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct PostFogInSide_Str.PostFogInSide_Str
// 0x0024 (0x0024 - 0x0000)
struct FPostFogInSide_Str final
{
public:
	struct FLinearColor                           FogColor_15_30C0BCCF4C7028B57B05BFA9A5F7719A;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FogDensity_14_BAE9E1834A63504A702520A525C9485C;    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FogHeightFalloff_18_DF488FD9481BA0B7725295B5E661A61D; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FogMaxOpacity_12_EBD194BF473152C3A2768D9D50C40765; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartDistance_13_2C88C46A406D36D50D40E38ED6ED499F; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CustomHeight_63_3D67777D47AB4EA5709A39897D07440A;  // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPostFogInSide_Str) == 0x000004, "Wrong alignment on FPostFogInSide_Str");
static_assert(sizeof(FPostFogInSide_Str) == 0x000024, "Wrong size on FPostFogInSide_Str");
static_assert(offsetof(FPostFogInSide_Str, FogColor_15_30C0BCCF4C7028B57B05BFA9A5F7719A) == 0x000000, "Member 'FPostFogInSide_Str::FogColor_15_30C0BCCF4C7028B57B05BFA9A5F7719A' has a wrong offset!");
static_assert(offsetof(FPostFogInSide_Str, FogDensity_14_BAE9E1834A63504A702520A525C9485C) == 0x000010, "Member 'FPostFogInSide_Str::FogDensity_14_BAE9E1834A63504A702520A525C9485C' has a wrong offset!");
static_assert(offsetof(FPostFogInSide_Str, FogHeightFalloff_18_DF488FD9481BA0B7725295B5E661A61D) == 0x000014, "Member 'FPostFogInSide_Str::FogHeightFalloff_18_DF488FD9481BA0B7725295B5E661A61D' has a wrong offset!");
static_assert(offsetof(FPostFogInSide_Str, FogMaxOpacity_12_EBD194BF473152C3A2768D9D50C40765) == 0x000018, "Member 'FPostFogInSide_Str::FogMaxOpacity_12_EBD194BF473152C3A2768D9D50C40765' has a wrong offset!");
static_assert(offsetof(FPostFogInSide_Str, StartDistance_13_2C88C46A406D36D50D40E38ED6ED499F) == 0x00001C, "Member 'FPostFogInSide_Str::StartDistance_13_2C88C46A406D36D50D40E38ED6ED499F' has a wrong offset!");
static_assert(offsetof(FPostFogInSide_Str, CustomHeight_63_3D67777D47AB4EA5709A39897D07440A) == 0x000020, "Member 'FPostFogInSide_Str::CustomHeight_63_3D67777D47AB4EA5709A39897D07440A' has a wrong offset!");

}

