#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostFogOut_Str

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct PostFogOut_Str.PostFogOut_Str
// 0x0024 (0x0024 - 0x0000)
struct FPostFogOut_Str final
{
public:
	struct FLinearColor                           OutFogColor_30_7203BDEF4DE777775F87BA8964A365CE;   // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutFogDensity_31_923525634D7E6F305AF7E8A0D3593522; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutFogHeightFalloff_32_BC8CF12F4E314576A6918BA206D7D3B7; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutFogMaxOpacity_33_14B0C57E4CB7C171CDFEEFA701C4749B; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutStartDistance_34_EE15E64E419BA353465290A8214A2D63; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutCustomHeight_61_AC952AFC49CF49F05D23F9B5C273E314; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPostFogOut_Str;

}

