#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostFog_Under_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "PostFogInSide_Str_structs.hpp"
#include "TwostFogInSide_Str_structs.hpp"
#include "TwostFogOringin_Str_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PostFog_Under_BP.PostFog_Under_BP_C
// 0x0108 (0x0330 - 0x0228)
class APostFog_Under_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  Post;                                              // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Default;                                           // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AExpFog_C*                              GetExpFog;                                         // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __2stFog;                                          // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostFogInSide_Str                     Z_____1stFog;                                      // 0x0254(0x0024)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTwostFogInSide_Str                    Z_____2stFog;                                      // 0x0278(0x0024)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPostFogInSide_Str                     Z_____;                                            // 0x029C(0x0024)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInBox;                                          // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NewTime;                                           // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer;                                             // 0x02C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  Post_0;                                            // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInit;                                           // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTwostFogOringin_Str                   Origin_Fog_Param;                                  // 0x02DC(0x0024)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFogMangaer_C*                          FogManager;                                        // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           EndOverLapTimer;                                   // 0x0308(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 FinalName;                                         // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         FogIndex;                                          // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableSwitch;                                     // 0x0324(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APostFog_Under_BP_C*                    NewVar_0;                                          // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Initializ_Fog_Param();
	void Enabl_Fog_Param();
	void GetExpHeightFog();
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void FogInitialize(bool bIsInCollision);
	void PawnActivate();
	void BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void bEndOverLap();
	void ExecuteUbergraph_PostFog_Under_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PostFog_Under_BP_C">();
	}
	static class APostFog_Under_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APostFog_Under_BP_C>();
	}
};
static_assert(alignof(APostFog_Under_BP_C) == 0x000008, "Wrong alignment on APostFog_Under_BP_C");
static_assert(sizeof(APostFog_Under_BP_C) == 0x000330, "Wrong size on APostFog_Under_BP_C");
static_assert(offsetof(APostFog_Under_BP_C, UberGraphFrame) == 0x000228, "Member 'APostFog_Under_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APostFog_Under_BP_C, Post) == 0x000230, "Member 'APostFog_Under_BP_C::Post' has a wrong offset!");
static_assert(offsetof(APostFog_Under_BP_C, Box) == 0x000238, "Member 'APostFog_Under_BP_C::Box' has a wrong offset!");
static_assert(offsetof(APostFog_Under_BP_C, Default) == 0x000240, "Member 'APostFog_Under_BP_C::Default' has a wrong offset!");
static_assert(offsetof(APostFog_Under_BP_C, GetExpFog) == 0x000248, "Member 'APostFog_Under_BP_C::GetExpFog' has a wrong offset!");
static_assert(offsetof(APostFog_Under_BP_C, __2stFog) == 0x000250, "Member 'APostFog_Under_BP_C::__2stFog' has a wrong offset!");
static_assert(offsetof(APostFog_Under_BP_C, Z_____1stFog) == 0x000254, "Member 'APostFog_Under_BP_C::Z_____1stFog' has a wrong offset!");
static_assert(offsetof(APostFog_Under_BP_C, Z_____2stFog) == 0x000278, "Member 'APostFog_Under_BP_C::Z_____2stFog' has a wrong offset!");
static_assert(offsetof(APostFog_Under_BP_C, Z_____) == 0x00029C, "Member 'APostFog_Under_BP_C::Z_____' has a wrong offset!");
static_assert(offsetof(APostFog_Under_BP_C, bIsInBox) == 0x0002C0, "Member 'APostFog_Under_BP_C::bIsInBox' has a wrong offset!");
static_assert(offsetof(APostFog_Under_BP_C, NewTime) == 0x0002C4, "Member 'APostFog_Under_BP_C::NewTime' has a wrong offset!");
static_assert(offsetof(APostFog_Under_BP_C, Timer) == 0x0002C8, "Member 'APostFog_Under_BP_C::Timer' has a wrong offset!");
static_assert(offsetof(APostFog_Under_BP_C, Post_0) == 0x0002D0, "Member 'APostFog_Under_BP_C::Post_0' has a wrong offset!");
static_assert(offsetof(APostFog_Under_BP_C, bIsInit) == 0x0002D8, "Member 'APostFog_Under_BP_C::bIsInit' has a wrong offset!");
static_assert(offsetof(APostFog_Under_BP_C, Origin_Fog_Param) == 0x0002DC, "Member 'APostFog_Under_BP_C::Origin_Fog_Param' has a wrong offset!");
static_assert(offsetof(APostFog_Under_BP_C, FogManager) == 0x000300, "Member 'APostFog_Under_BP_C::FogManager' has a wrong offset!");
static_assert(offsetof(APostFog_Under_BP_C, EndOverLapTimer) == 0x000308, "Member 'APostFog_Under_BP_C::EndOverLapTimer' has a wrong offset!");
static_assert(offsetof(APostFog_Under_BP_C, FinalName) == 0x000310, "Member 'APostFog_Under_BP_C::FinalName' has a wrong offset!");
static_assert(offsetof(APostFog_Under_BP_C, FogIndex) == 0x000320, "Member 'APostFog_Under_BP_C::FogIndex' has a wrong offset!");
static_assert(offsetof(APostFog_Under_BP_C, bEnableSwitch) == 0x000324, "Member 'APostFog_Under_BP_C::bEnableSwitch' has a wrong offset!");
static_assert(offsetof(APostFog_Under_BP_C, NewVar_0) == 0x000328, "Member 'APostFog_Under_BP_C::NewVar_0' has a wrong offset!");

}

