#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostFog_bp

#include "Basic.hpp"

#include "PostFog_Str_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PostFog_bp.PostFog_bp_C.·Öê
// 0x0030 (0x0030 - 0x0000)
struct PostFog_bp_C_Func_____0 final
{
public:
	int32                                         ___int_Array_Index_Variable;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACreate020_01_bp_C*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm)
	class ACreate020_01_bp_C*                     CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PostFog_bp_C____) == 0x000008, "Wrong alignment on PostFog_bp_C____");
static_assert(sizeof(PostFog_bp_C____) == 0x000030, "Wrong size on PostFog_bp_C____");
static_assert(offsetof(PostFog_bp_C____, ___int_Array_Index_Variable) == 0x000000, "Member 'PostFog_bp_C____::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C____, ___int_Loop_Counter_Variable) == 0x000004, "Member 'PostFog_bp_C____::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C____, CallFunc_GetAllActorsOfClass_OutActors) == 0x000008, "Member 'PostFog_bp_C____::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C____, CallFunc_Array_Get_Item) == 0x000018, "Member 'PostFog_bp_C____::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C____, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'PostFog_bp_C____::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C____, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'PostFog_bp_C____::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C____, CallFunc_IsValid_ReturnValue) == 0x000025, "Member 'PostFog_bp_C____::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C____, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'PostFog_bp_C____::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function PostFog_bp.PostFog_bp_C.·Öþ
// 0x0040 (0x0040 - 0x0000)
struct PostFog_bp_C_Func_____1 final
{
public:
	TArray<class AExponentialHeightFog*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0000(0x0010)(ReferenceParm)
	class AExponentialHeightFog*                  CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostFog_Str                           K2Node_MakeStruct_PostFog_Str;                     // 0x001C(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PostFog_bp_C____) == 0x000008, "Wrong alignment on PostFog_bp_C____");
static_assert(sizeof(PostFog_bp_C____) == 0x000040, "Wrong size on PostFog_bp_C____");
static_assert(offsetof(PostFog_bp_C____, CallFunc_GetAllActorsOfClass_OutActors) == 0x000000, "Member 'PostFog_bp_C____::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C____, CallFunc_Array_Get_Item) == 0x000010, "Member 'PostFog_bp_C____::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C____, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'PostFog_bp_C____::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C____, K2Node_MakeStruct_PostFog_Str) == 0x00001C, "Member 'PostFog_bp_C____::K2Node_MakeStruct_PostFog_Str' has a wrong offset!");

// Function PostFog_bp.PostFog_bp_C.¾n¹„°ž
// 0x0018 (0x0018 - 0x0000)
struct PostFog_bp_C__n_____ final
{
public:
	class UPrimitiveComponent*                    ___e1;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    ___e2;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EntryPoint;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostFog_bp_C__n_____) == 0x000008, "Wrong alignment on PostFog_bp_C__n_____");
static_assert(sizeof(PostFog_bp_C__n_____) == 0x000018, "Wrong size on PostFog_bp_C__n_____");
static_assert(offsetof(PostFog_bp_C__n_____, ___e1) == 0x000000, "Member 'PostFog_bp_C__n_____::___e1' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C__n_____, ___e2) == 0x000008, "Member 'PostFog_bp_C__n_____::___e2' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C__n_____, EntryPoint) == 0x000010, "Member 'PostFog_bp_C__n_____::EntryPoint' has a wrong offset!");

// Function PostFog_bp.PostFog_bp_C.UserConstructionScript
// 0x0024 (0x0024 - 0x0000)
struct PostFog_bp_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostFog_Str                           K2Node_MakeStruct_PostFog_Str;                     // 0x0004(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PostFog_bp_C_UserConstructionScript) == 0x000004, "Wrong alignment on PostFog_bp_C_UserConstructionScript");
static_assert(sizeof(PostFog_bp_C_UserConstructionScript) == 0x000024, "Wrong size on PostFog_bp_C_UserConstructionScript");
static_assert(offsetof(PostFog_bp_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'PostFog_bp_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_UserConstructionScript, K2Node_MakeStruct_PostFog_Str) == 0x000004, "Member 'PostFog_bp_C_UserConstructionScript::K2Node_MakeStruct_PostFog_Str' has a wrong offset!");

// Function PostFog_bp.PostFog_bp_C.BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function PostFog_bp.PostFog_bp_C.BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'PostFog_bp_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function PostFog_bp.PostFog_bp_C.BndEvt__Cube_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function PostFog_bp.PostFog_bp_C.BndEvt__Cube_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'PostFog_bp_C_BndEvt__Cube_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function PostFog_bp.PostFog_bp_C.BndEvt__ó_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function PostFog_bp.PostFog_bp_C.BndEvt__ó_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function PostFog_bp.PostFog_bp_C.BndEvt__M_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function PostFog_bp.PostFog_bp_C.BndEvt__M_K2Node_ComponentBoundEvent_11_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_11_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_11_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_11_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_11_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_11_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_11_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_11_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_11_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_11_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_11_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_11_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_11_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'PostFog_bp_C_BndEvt__M_K2Node_ComponentBoundEvent_11_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function PostFog_bp.PostFog_bp_C.BndEvt___K2Node_ComponentBoundEvent_12_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_12_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_12_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_12_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_12_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_12_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_12_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_12_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_12_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_12_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_12_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_12_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_12_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_12_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_12_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_12_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_12_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_12_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function PostFog_bp.PostFog_bp_C.BndEvt___K2Node_ComponentBoundEvent_13_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_13_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_13_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_13_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_13_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_13_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_13_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_13_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_13_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_13_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_13_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_13_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_13_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_13_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function PostFog_bp.PostFog_bp_C.BndEvt__
_K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function PostFog_bp.PostFog_bp_C.BndEvt__
_K2Node_ComponentBoundEvent_15_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_15_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_15_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_15_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_15_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_15_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_15_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_15_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_15_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_15_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_15_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_15_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_15_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_15_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function PostFog_bp.PostFog_bp_C.BndEvt___K2Node_ComponentBoundEvent_16_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_16_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_16_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_16_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_16_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_16_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_16_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_16_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_16_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_16_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_16_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_16_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_16_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_16_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_16_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_16_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_16_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_16_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function PostFog_bp.PostFog_bp_C.BndEvt___K2Node_ComponentBoundEvent_17_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_17_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_17_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_17_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_17_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_17_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_17_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_17_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_17_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_17_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_17_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_17_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_17_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'PostFog_bp_C_BndEvt____K2Node_ComponentBoundEvent_17_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function PostFog_bp.PostFog_bp_C.þHË
// 0x0001 (0x0001 - 0x0000)
struct PostFog_bp_C__H___ final
{
public:
	bool                                          __z___0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostFog_bp_C__H___) == 0x000001, "Wrong alignment on PostFog_bp_C__H___");
static_assert(sizeof(PostFog_bp_C__H___) == 0x000001, "Wrong size on PostFog_bp_C__H___");
static_assert(offsetof(PostFog_bp_C__H___, __z___0) == 0x000000, "Member 'PostFog_bp_C__H___::__z___0' has a wrong offset!");

// Function PostFog_bp.PostFog_bp_C.ExecuteUbergraph_PostFog_bp
// 0x0730 (0x0730 - 0x0000)
struct PostFog_bp_C_ExecuteUbergraph_PostFog_bp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_13; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_13;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_13;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
