#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostFog_bp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PostFog_Str_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PostFog_bp.PostFog_bp_C
// 0x0100 (0x0328 - 0x0228)
class APostFog_bp_C final : public ANoCookConstructionActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   _;                                                 // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   __0;                                               // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   __1;                                               // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   M;                                                 // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   __2;                                               // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   __3;                                               // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  Post;                                              // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Default;                                           // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0______EE0332F2419B040CE4522A82C2A73107;  // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_EE0332F2419B040CE4522A82C2A73107; // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Seven_;                                            // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AExponentialHeightFog*                  _____;                                             // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPostFog_Str                           Z_____;                                            // 0x0298(0x0020)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPostFog_Str                           Z______0;                                          // 0x02B8(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GL_p;                                              // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ______p;                                           // 0x02DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          __h_;                                              // 0x02DD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___;                                               // 0x02DE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ____0;                                             // 0x02DF(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          __M;                                               // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ____1;                                             // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ____2;                                             // 0x02E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ____3;                                             // 0x02E3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FPostFog_Str                           __Iz_____;                                         // 0x02E4(0x0020)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __z__;                                             // 0x0304(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NewTime;                                           // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __0_b;                                             // 0x030C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Z___;                                              // 0x030D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Z____0;                                            // 0x030E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Z____I_;                                           // 0x030F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Z__G_;                                             // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Z__G__0;                                           // 0x0311(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Z____G_;                                           // 0x0312(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_313[0x5];                                      // 0x0313(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ACreate020_01_bp_C*                     A___;                                              // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____;                                              // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Func_____0();
	void Func_____1();
	void _n_____(class UPrimitiveComponent* ___e1, class UPrimitiveComponent* ___e2, bool EntryPoint);
	void UserConstructionScript();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void ReceiveBeginPlay();
	void BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__Cube_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__Cube_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt____K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt____K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__M_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__M_K2Node_ComponentBoundEvent_11_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt____K2Node_ComponentBoundEvent_12_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt____K2Node_ComponentBoundEvent_13_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt____K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt____K2Node_ComponentBoundEvent_15_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt____K2Node_ComponentBoundEvent_16_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt____K2Node_ComponentBoundEvent_17_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void _H___(bool __z___0);
	void Seven_fog();
	void ExecuteUbergraph_PostFog_bp(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PostFog_bp_C">();
	}
	static class APostFog_bp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APostFog_bp_C>();
	}
};
static_assert(alignof(APostFog_bp_C) == 0x000008, "Wrong alignment on APostFog_bp_C");
static_assert(sizeof(APostFog_bp_C) == 0x000328, "Wrong size on APostFog_bp_C");
static_assert(offsetof(APostFog_bp_C, UberGraphFrame) == 0x000228, "Member 'APostFog_bp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, _) == 0x000230, "Member 'APostFog_bp_C::_' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, __0) == 0x000238, "Member 'APostFog_bp_C::__0' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, __1) == 0x000240, "Member 'APostFog_bp_C::__1' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, M) == 0x000248, "Member 'APostFog_bp_C::M' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, __2) == 0x000250, "Member 'APostFog_bp_C::__2' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, __3) == 0x000258, "Member 'APostFog_bp_C::__3' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, Post) == 0x000260, "Member 'APostFog_bp_C::Post' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, Box) == 0x000268, "Member 'APostFog_bp_C::Box' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, Default) == 0x000270, "Member 'APostFog_bp_C::Default' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, Timeline_0______EE0332F2419B040CE4522A82C2A73107) == 0x000278, "Member 'APostFog_bp_C::Timeline_0______EE0332F2419B040CE4522A82C2A73107' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, Timeline_0__Direction_EE0332F2419B040CE4522A82C2A73107) == 0x00027C, "Member 'APostFog_bp_C::Timeline_0__Direction_EE0332F2419B040CE4522A82C2A73107' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, Timeline_0) == 0x000280, "Member 'APostFog_bp_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, Seven_) == 0x000288, "Member 'APostFog_bp_C::Seven_' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, _____) == 0x000290, "Member 'APostFog_bp_C::_____' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, Z_____) == 0x000298, "Member 'APostFog_bp_C::Z_____' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, Z______0) == 0x0002B8, "Member 'APostFog_bp_C::Z______0' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, GL_p) == 0x0002D8, "Member 'APostFog_bp_C::GL_p' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, ______p) == 0x0002DC, "Member 'APostFog_bp_C::______p' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, __h_) == 0x0002DD, "Member 'APostFog_bp_C::__h_' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, ___) == 0x0002DE, "Member 'APostFog_bp_C::___' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, ____0) == 0x0002DF, "Member 'APostFog_bp_C::____0' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, __M) == 0x0002E0, "Member 'APostFog_bp_C::__M' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, ____1) == 0x0002E1, "Member 'APostFog_bp_C::____1' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, ____2) == 0x0002E2, "Member 'APostFog_bp_C::____2' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, ____3) == 0x0002E3, "Member 'APostFog_bp_C::____3' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, __Iz_____) == 0x0002E4, "Member 'APostFog_bp_C::__Iz_____' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, __z__) == 0x000304, "Member 'APostFog_bp_C::__z__' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, NewTime) == 0x000308, "Member 'APostFog_bp_C::NewTime' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, __0_b) == 0x00030C, "Member 'APostFog_bp_C::__0_b' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, Z___) == 0x00030D, "Member 'APostFog_bp_C::Z___' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, Z____0) == 0x00030E, "Member 'APostFog_bp_C::Z____0' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, Z____I_) == 0x00030F, "Member 'APostFog_bp_C::Z____I_' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, Z__G_) == 0x000310, "Member 'APostFog_bp_C::Z__G_' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, Z__G__0) == 0x000311, "Member 'APostFog_bp_C::Z__G__0' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, Z____G_) == 0x000312, "Member 'APostFog_bp_C::Z____G_' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, A___) == 0x000318, "Member 'APostFog_bp_C::A___' has a wrong offset!");
static_assert(offsetof(APostFog_bp_C, ____) == 0x000320, "Member 'APostFog_bp_C::____' has a wrong offset!");

}

