#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PreheatBullet

#include "Basic.hpp"


namespace SDK::Params
{

// Function PreheatBullet.PreheatBullet_C.ExecuteUbergraph_PreheatBullet
// 0x0008 (0x0008 - 0x0000)
struct PreheatBullet_C_ExecuteUbergraph_PreheatBullet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStandalone_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PreheatBullet_C_ExecuteUbergraph_PreheatBullet) == 0x000004, "Wrong alignment on PreheatBullet_C_ExecuteUbergraph_PreheatBullet");
static_assert(sizeof(PreheatBullet_C_ExecuteUbergraph_PreheatBullet) == 0x000008, "Wrong size on PreheatBullet_C_ExecuteUbergraph_PreheatBullet");
static_assert(offsetof(PreheatBullet_C_ExecuteUbergraph_PreheatBullet, EntryPoint) == 0x000000, "Member 'PreheatBullet_C_ExecuteUbergraph_PreheatBullet::EntryPoint' has a wrong offset!");
static_assert(offsetof(PreheatBullet_C_ExecuteUbergraph_PreheatBullet, CallFunc_IsStandalone_ReturnValue) == 0x000004, "Member 'PreheatBullet_C_ExecuteUbergraph_PreheatBullet::CallFunc_IsStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(PreheatBullet_C_ExecuteUbergraph_PreheatBullet, CallFunc_HasAuthority_ReturnValue) == 0x000005, "Member 'PreheatBullet_C_ExecuteUbergraph_PreheatBullet::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

}

