#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PreheatBullet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PreheatBullet.PreheatBullet_C
// 0x0020 (0x0AD0 - 0x0AB0)
class APreheatBullet_C final : public APreheatBullet
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBulletSubTraceComponent*               BulletSubTrace;                                    // 0x0AB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBulletSubArrowTraceComponent*          BulletSubArrowTrace;                               // 0x0AC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBulletFire();
	void ExecuteUbergraph_PreheatBullet(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PreheatBullet_C">();
	}
	static class APreheatBullet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APreheatBullet_C>();
	}
};
static_assert(alignof(APreheatBullet_C) == 0x000010, "Wrong alignment on APreheatBullet_C");
static_assert(sizeof(APreheatBullet_C) == 0x000AD0, "Wrong size on APreheatBullet_C");
static_assert(offsetof(APreheatBullet_C, UberGraphFrame) == 0x000AB0, "Member 'APreheatBullet_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APreheatBullet_C, BulletSubTrace) == 0x000AB8, "Member 'APreheatBullet_C::BulletSubTrace' has a wrong offset!");
static_assert(offsetof(APreheatBullet_C, BulletSubArrowTrace) == 0x000AC0, "Member 'APreheatBullet_C::BulletSubArrowTrace' has a wrong offset!");

}

