#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RadarChart

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Enum RadarChart.ERadarChartEventSource
// NumValues: 0x0005
enum class ERadarChartEventSource : uint8
{
	BaseLabel                                = 0,
	BasePin                                  = 1,
	ValueLabel                               = 2,
	ValuePin                                 = 3,
	ERadarChartEventSource_MAX               = 4,
};

// Enum RadarChart.ERadarChartBlendMode
// NumValues: 0x0004
enum class ERadarChartBlendMode : uint8
{
	Opaque                                   = 0,
	Translucent                              = 1,
	Additive                                 = 2,
	ERadarChartBlendMode_MAX                 = 3,
};

// Enum RadarChart.ERadarChartColorOverride
// NumValues: 0x0009
enum class ERadarChartColorOverride : uint8
{
	None                                     = 0,
	Multiply                                 = 1,
	Override                                 = 2,
	OverrideAlphaOnly                        = 3,
	OverrideHue                              = 4,
	OverrideHueAndAlpha                      = 5,
	Desaturate                               = 6,
	DesaturateAndAlpha                       = 7,
	ERadarChartColorOverride_MAX             = 8,
};

// Enum RadarChart.ERadarChartValueDisplay
// NumValues: 0x0004
enum class ERadarChartValueDisplay : uint8
{
	Disabled                                 = 0,
	Normal                                   = 1,
	Snap                                     = 2,
	ERadarChartValueDisplay_MAX              = 3,
};

// ScriptStruct RadarChart.RadarChartColorOverride
// 0x0014 (0x0014 - 0x0000)
struct FRadarChartColorOverride final
{
public:
	ERadarChartColorOverride                      Method;                                            // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color;                                             // 0x0004(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRadarChartColorOverride) == 0x000004, "Wrong alignment on FRadarChartColorOverride");
static_assert(sizeof(FRadarChartColorOverride) == 0x000014, "Wrong size on FRadarChartColorOverride");
static_assert(offsetof(FRadarChartColorOverride, Method) == 0x000000, "Member 'FRadarChartColorOverride::Method' has a wrong offset!");
static_assert(offsetof(FRadarChartColorOverride, Color) == 0x000004, "Member 'FRadarChartColorOverride::Color' has a wrong offset!");

// ScriptStruct RadarChart.RadarChartButtonInteraction
// 0x0004 (0x0004 - 0x0000)
struct FRadarChartButtonInteraction final
{
public:
	uint8                                         bHoverable : 1;                                    // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bPressable : 1;                                    // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bClickable : 1;                                    // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	EButtonClickMethod                            ClickMethod;                                       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EButtonTouchMethod                            TouchMethod;                                       // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EButtonPressMethod                            PressMethod;                                       // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRadarChartButtonInteraction) == 0x000001, "Wrong alignment on FRadarChartButtonInteraction");
static_assert(sizeof(FRadarChartButtonInteraction) == 0x000004, "Wrong size on FRadarChartButtonInteraction");
static_assert(offsetof(FRadarChartButtonInteraction, ClickMethod) == 0x000001, "Member 'FRadarChartButtonInteraction::ClickMethod' has a wrong offset!");
static_assert(offsetof(FRadarChartButtonInteraction, TouchMethod) == 0x000002, "Member 'FRadarChartButtonInteraction::TouchMethod' has a wrong offset!");
static_assert(offsetof(FRadarChartButtonInteraction, PressMethod) == 0x000003, "Member 'FRadarChartButtonInteraction::PressMethod' has a wrong offset!");

// ScriptStruct RadarChart.RadarChartButtonStyle
// 0x0028 (0x02A0 - 0x0278)
struct FRadarChartButtonStyle final : public FButtonStyle
{
public:
	struct FRadarChartColorOverride               Color;                                             // 0x0278(0x0014)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Angle;                                             // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bAlign : 1;                                        // 0x0294(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	struct FRadarChartButtonInteraction           Interaction;                                       // 0x0295(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ZOrderOffset;                                      // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRadarChartButtonStyle) == 0x000008, "Wrong alignment on FRadarChartButtonStyle");
static_assert(sizeof(FRadarChartButtonStyle) == 0x0002A0, "Wrong size on FRadarChartButtonStyle");
static_assert(offsetof(FRadarChartButtonStyle, Color) == 0x000278, "Member 'FRadarChartButtonStyle::Color' has a wrong offset!");
static_assert(offsetof(FRadarChartButtonStyle, Distance) == 0x00028C, "Member 'FRadarChartButtonStyle::Distance' has a wrong offset!");
static_assert(offsetof(FRadarChartButtonStyle, Angle) == 0x000290, "Member 'FRadarChartButtonStyle::Angle' has a wrong offset!");
static_assert(offsetof(FRadarChartButtonStyle, Interaction) == 0x000295, "Member 'FRadarChartButtonStyle::Interaction' has a wrong offset!");
static_assert(offsetof(FRadarChartButtonStyle, ZOrderOffset) == 0x00029C, "Member 'FRadarChartButtonStyle::ZOrderOffset' has a wrong offset!");

// ScriptStruct RadarChart.RadarChartEvent
// 0x000C (0x000C - 0x0000)
struct FRadarChartEvent final
{
public:
	ERadarChartEventSource                        Source;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ValueLayerIndex;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ValueIndex;                                        // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ScreenSpacePosition;                               // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRadarChartEvent) == 0x000004, "Wrong alignment on FRadarChartEvent");
static_assert(sizeof(FRadarChartEvent) == 0x00000C, "Wrong size on FRadarChartEvent");
static_assert(offsetof(FRadarChartEvent, Source) == 0x000000, "Member 'FRadarChartEvent::Source' has a wrong offset!");
static_assert(offsetof(FRadarChartEvent, ValueLayerIndex) == 0x000001, "Member 'FRadarChartEvent::ValueLayerIndex' has a wrong offset!");
static_assert(offsetof(FRadarChartEvent, ValueIndex) == 0x000002, "Member 'FRadarChartEvent::ValueIndex' has a wrong offset!");
static_assert(offsetof(FRadarChartEvent, ScreenSpacePosition) == 0x000004, "Member 'FRadarChartEvent::ScreenSpacePosition' has a wrong offset!");

// ScriptStruct RadarChart.RadarChartAppearance
// 0x0398 (0x0398 - 0x0000)
struct FRadarChartAppearance final
{
public:
	uint8                                         Pad_0[0xB0];                                       // 0x0000(0x00B0)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bShowShape : 1;                                    // 0x00B0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bConcentricUVs : 1;                                // 0x00B0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowOutline : 1;                                  // 0x00B0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowPins : 1;                                     // 0x00B0(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMultiplyTextureAlpha : 1;                         // 0x00B0(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	ERadarChartBlendMode                          BlendMode;                                         // 0x00B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRadarChartColorOverride               ShapeColor;                                        // 0x00B4(0x0014)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	class UTexture*                               ShapeTexture;                                      // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              TextureScale;                                      // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Angle;                                             // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Panner;                                            // 0x00DC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           OutlineColor;                                      // 0x00E4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutlineThickness;                                  // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRadarChartButtonStyle                 Pin;                                               // 0x00F8(0x02A0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRadarChartAppearance) == 0x000008, "Wrong alignment on FRadarChartAppearance");
static_assert(sizeof(FRadarChartAppearance) == 0x000398, "Wrong size on FRadarChartAppearance");
static_assert(offsetof(FRadarChartAppearance, BlendMode) == 0x0000B1, "Member 'FRadarChartAppearance::BlendMode' has a wrong offset!");
static_assert(offsetof(FRadarChartAppearance, ShapeColor) == 0x0000B4, "Member 'FRadarChartAppearance::ShapeColor' has a wrong offset!");
static_assert(offsetof(FRadarChartAppearance, ShapeTexture) == 0x0000C8, "Member 'FRadarChartAppearance::ShapeTexture' has a wrong offset!");
static_assert(offsetof(FRadarChartAppearance, TextureScale) == 0x0000D0, "Member 'FRadarChartAppearance::TextureScale' has a wrong offset!");
static_assert(offsetof(FRadarChartAppearance, Angle) == 0x0000D8, "Member 'FRadarChartAppearance::Angle' has a wrong offset!");
static_assert(offsetof(FRadarChartAppearance, Panner) == 0x0000DC, "Member 'FRadarChartAppearance::Panner' has a wrong offset!");
static_assert(offsetof(FRadarChartAppearance, OutlineColor) == 0x0000E4, "Member 'FRadarChartAppearance::OutlineColor' has a wrong offset!");
static_assert(offsetof(FRadarChartAppearance, OutlineThickness) == 0x0000F4, "Member 'FRadarChartAppearance::OutlineThickness' has a wrong offset!");
static_assert(offsetof(FRadarChartAppearance, Pin) == 0x0000F8, "Member 'FRadarChartAppearance::Pin' has a wrong offset!");

// ScriptStruct RadarChart.RadarChartSegmentLayout
// 0x0018 (0x0018 - 0x0000)
struct FRadarChartSegmentLayout final
{
public:
	struct FIntPoint                              IconColumnRow;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              NameLabelColumnRow;                                // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              ValueLabelColumnRow;                               // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRadarChartSegmentLayout) == 0x000004, "Wrong alignment on FRadarChartSegmentLayout");
static_assert(sizeof(FRadarChartSegmentLayout) == 0x000018, "Wrong size on FRadarChartSegmentLayout");
static_assert(offsetof(FRadarChartSegmentLayout, IconColumnRow) == 0x000000, "Member 'FRadarChartSegmentLayout::IconColumnRow' has a wrong offset!");
static_assert(offsetof(FRadarChartSegmentLayout, NameLabelColumnRow) == 0x000008, "Member 'FRadarChartSegmentLayout::NameLabelColumnRow' has a wrong offset!");
static_assert(offsetof(FRadarChartSegmentLayout, ValueLabelColumnRow) == 0x000010, "Member 'FRadarChartSegmentLayout::ValueLabelColumnRow' has a wrong offset!");

// ScriptStruct RadarChart.RadarChartSegment
// 0x00E0 (0x00E0 - 0x0000)
struct FRadarChartSegment final
{
public:
	struct FLinearColor                           SegmentColor;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Icon;                                              // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Name;                                              // 0x0018(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FVector2D                              Offset;                                            // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         BitPad_38_0 : 1;                                   // 0x0038(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bUseCustomLayout : 1;                              // 0x0038(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRadarChartSegmentLayout               CustomLayout;                                      // 0x003C(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x8C];                                      // 0x0054(0x008C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRadarChartSegment) == 0x000008, "Wrong alignment on FRadarChartSegment");
static_assert(sizeof(FRadarChartSegment) == 0x0000E0, "Wrong size on FRadarChartSegment");
static_assert(offsetof(FRadarChartSegment, SegmentColor) == 0x000000, "Member 'FRadarChartSegment::SegmentColor' has a wrong offset!");
static_assert(offsetof(FRadarChartSegment, Icon) == 0x000010, "Member 'FRadarChartSegment::Icon' has a wrong offset!");
static_assert(offsetof(FRadarChartSegment, Name) == 0x000018, "Member 'FRadarChartSegment::Name' has a wrong offset!");
static_assert(offsetof(FRadarChartSegment, Offset) == 0x000030, "Member 'FRadarChartSegment::Offset' has a wrong offset!");
static_assert(offsetof(FRadarChartSegment, CustomLayout) == 0x00003C, "Member 'FRadarChartSegment::CustomLayout' has a wrong offset!");

// ScriptStruct RadarChart.RadarChartStyle
// 0x08E0 (0x08E0 - 0x0000)
struct FRadarChartStyle final
{
public:
	float                                         NormalizationScale;                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bShowIcons : 1;                                    // 0x0004(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowNameLabel : 1;                                // 0x0004(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowCuts : 1;                                     // 0x0004(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bPositionUnitsBetweenCuts : 1;                     // 0x0004(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bHideZeroUnit : 1;                                 // 0x0004(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bHideLastUnit : 1;                                 // 0x0004(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAlwaysUprightIcon : 1;                            // 0x0004(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAlwaysUprightName : 1;                            // 0x0004(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ChartRadius;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartAngle;                                        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRadarChartAppearance                  Appearance;                                        // 0x0010(0x0398)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FRadarChartSegment>             Segments;                                          // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           CutsColor;                                         // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CutsThickness;                                     // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CutsZOrderOffset;                                  // 0x03CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         DividersCount;                                     // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D1[0x3];                                      // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           DividersColor;                                     // 0x03D4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DividersThickness;                                 // 0x03E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DividerZOrderOffset;                               // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Units;                                             // 0x03EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ShowEveryNUnit;                                    // 0x03ED(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         UnitsSourceSegment;                                // 0x03EE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3EF[0x1];                                      // 0x03EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         UnitsFont;                                         // 0x03F0(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           UnitsColor;                                        // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         UnitsDecimalPlaces;                                // 0x0458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          UnitsAlignment;                                    // 0x0459(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45A[0x2];                                      // 0x045A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              UnitsOffset;                                       // 0x045C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UnitsZOrderOffset;                                 // 0x0464(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRadarChartButtonStyle                 LabelButton;                                       // 0x0468(0x02A0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRadarChartColorOverride               IconColor;                                         // 0x0708(0x0014)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              IconSize;                                          // 0x071C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRadarChartColorOverride               NameColor;                                         // 0x0724(0x0014)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         NameFont;                                          // 0x0738(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         ValuesFont;                                        // 0x0790(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ValueSeparator;                                    // 0x07E8(0x0088)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EOrientation                                  ValueLabelOrientation;                             // 0x0870(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_871[0x3];                                      // 0x0871(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRadarChartSegmentLayout               DefaultLayout;                                     // 0x0874(0x0018)(Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FMargin                                IconPadding;                                       // 0x088C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FMargin                                NamePadding;                                       // 0x089C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FMargin                                ValueLabelContainerPadding;                        // 0x08AC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FMargin                                SeparatorPadding;                                  // 0x08BC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	float                                         AutoFlipAligned;                                   // 0x08CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinNameWidth;                                      // 0x08D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinValuesWidth;                                    // 0x08D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ValueLabelDecimalPlaces;                           // 0x08D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUseSimpleTextMode : 1;                            // 0x08D9(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bNestedLabelHoverFix : 1;                          // 0x08D9(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_8DA[0x6];                                      // 0x08DA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRadarChartStyle) == 0x000008, "Wrong alignment on FRadarChartStyle");
static_assert(sizeof(FRadarChartStyle) == 0x0008E0, "Wrong size on FRadarChartStyle");
static_assert(offsetof(FRadarChartStyle, NormalizationScale) == 0x000000, "Member 'FRadarChartStyle::NormalizationScale' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, ChartRadius) == 0x000008, "Member 'FRadarChartStyle::ChartRadius' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, StartAngle) == 0x00000C, "Member 'FRadarChartStyle::StartAngle' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, Appearance) == 0x000010, "Member 'FRadarChartStyle::Appearance' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, Segments) == 0x0003A8, "Member 'FRadarChartStyle::Segments' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, CutsColor) == 0x0003B8, "Member 'FRadarChartStyle::CutsColor' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, CutsThickness) == 0x0003C8, "Member 'FRadarChartStyle::CutsThickness' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, CutsZOrderOffset) == 0x0003CC, "Member 'FRadarChartStyle::CutsZOrderOffset' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, DividersCount) == 0x0003D0, "Member 'FRadarChartStyle::DividersCount' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, DividersColor) == 0x0003D4, "Member 'FRadarChartStyle::DividersColor' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, DividersThickness) == 0x0003E4, "Member 'FRadarChartStyle::DividersThickness' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, DividerZOrderOffset) == 0x0003E8, "Member 'FRadarChartStyle::DividerZOrderOffset' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, Units) == 0x0003EC, "Member 'FRadarChartStyle::Units' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, ShowEveryNUnit) == 0x0003ED, "Member 'FRadarChartStyle::ShowEveryNUnit' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, UnitsSourceSegment) == 0x0003EE, "Member 'FRadarChartStyle::UnitsSourceSegment' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, UnitsFont) == 0x0003F0, "Member 'FRadarChartStyle::UnitsFont' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, UnitsColor) == 0x000448, "Member 'FRadarChartStyle::UnitsColor' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, UnitsDecimalPlaces) == 0x000458, "Member 'FRadarChartStyle::UnitsDecimalPlaces' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, UnitsAlignment) == 0x000459, "Member 'FRadarChartStyle::UnitsAlignment' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, UnitsOffset) == 0x00045C, "Member 'FRadarChartStyle::UnitsOffset' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, UnitsZOrderOffset) == 0x000464, "Member 'FRadarChartStyle::UnitsZOrderOffset' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, LabelButton) == 0x000468, "Member 'FRadarChartStyle::LabelButton' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, IconColor) == 0x000708, "Member 'FRadarChartStyle::IconColor' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, IconSize) == 0x00071C, "Member 'FRadarChartStyle::IconSize' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, NameColor) == 0x000724, "Member 'FRadarChartStyle::NameColor' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, NameFont) == 0x000738, "Member 'FRadarChartStyle::NameFont' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, ValuesFont) == 0x000790, "Member 'FRadarChartStyle::ValuesFont' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, ValueSeparator) == 0x0007E8, "Member 'FRadarChartStyle::ValueSeparator' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, ValueLabelOrientation) == 0x000870, "Member 'FRadarChartStyle::ValueLabelOrientation' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, DefaultLayout) == 0x000874, "Member 'FRadarChartStyle::DefaultLayout' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, IconPadding) == 0x00088C, "Member 'FRadarChartStyle::IconPadding' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, NamePadding) == 0x00089C, "Member 'FRadarChartStyle::NamePadding' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, ValueLabelContainerPadding) == 0x0008AC, "Member 'FRadarChartStyle::ValueLabelContainerPadding' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, SeparatorPadding) == 0x0008BC, "Member 'FRadarChartStyle::SeparatorPadding' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, AutoFlipAligned) == 0x0008CC, "Member 'FRadarChartStyle::AutoFlipAligned' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, MinNameWidth) == 0x0008D0, "Member 'FRadarChartStyle::MinNameWidth' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, MinValuesWidth) == 0x0008D4, "Member 'FRadarChartStyle::MinValuesWidth' has a wrong offset!");
static_assert(offsetof(FRadarChartStyle, ValueLabelDecimalPlaces) == 0x0008D8, "Member 'FRadarChartStyle::ValueLabelDecimalPlaces' has a wrong offset!");

// ScriptStruct RadarChart.RadarChartValueText
// 0x02C8 (0x02C8 - 0x0000)
struct FRadarChartValueText final
{
public:
	ERadarChartValueDisplay                       DisplayMode;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRadarChartColorOverride               Color;                                             // 0x0004(0x0014)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              Offset;                                            // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRadarChartButtonStyle                 Button;                                            // 0x0020(0x02A0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         bAlwaysUprightValue : 1;                           // 0x02C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bFlipTextWhenAligned : 1;                          // 0x02C0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRadarChartValueText) == 0x000008, "Wrong alignment on FRadarChartValueText");
static_assert(sizeof(FRadarChartValueText) == 0x0002C8, "Wrong size on FRadarChartValueText");
static_assert(offsetof(FRadarChartValueText, DisplayMode) == 0x000000, "Member 'FRadarChartValueText::DisplayMode' has a wrong offset!");
static_assert(offsetof(FRadarChartValueText, Color) == 0x000004, "Member 'FRadarChartValueText::Color' has a wrong offset!");
static_assert(offsetof(FRadarChartValueText, Offset) == 0x000018, "Member 'FRadarChartValueText::Offset' has a wrong offset!");
static_assert(offsetof(FRadarChartValueText, Button) == 0x000020, "Member 'FRadarChartValueText::Button' has a wrong offset!");

// ScriptStruct RadarChart.RadarChartValueLayer
// 0x06F0 (0x06F0 - 0x0000)
struct FRadarChartValueLayer final
{
public:
	uint8                                         Pad_0[0x68];                                       // 0x0000(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 RawValues;                                         // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 NormalizedValues;                                  // 0x0078(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FRadarChartAppearance                  Appearance;                                        // 0x0088(0x0398)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRadarChartValueText                   TextSettings;                                      // 0x0420(0x02C8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         bEnablePinSliding : 1;                             // 0x06E8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_6E9[0x3];                                      // 0x06E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PinSlidingSteps;                                   // 0x06EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRadarChartValueLayer) == 0x000008, "Wrong alignment on FRadarChartValueLayer");
static_assert(sizeof(FRadarChartValueLayer) == 0x0006F0, "Wrong size on FRadarChartValueLayer");
static_assert(offsetof(FRadarChartValueLayer, RawValues) == 0x000068, "Member 'FRadarChartValueLayer::RawValues' has a wrong offset!");
static_assert(offsetof(FRadarChartValueLayer, NormalizedValues) == 0x000078, "Member 'FRadarChartValueLayer::NormalizedValues' has a wrong offset!");
static_assert(offsetof(FRadarChartValueLayer, Appearance) == 0x000088, "Member 'FRadarChartValueLayer::Appearance' has a wrong offset!");
static_assert(offsetof(FRadarChartValueLayer, TextSettings) == 0x000420, "Member 'FRadarChartValueLayer::TextSettings' has a wrong offset!");
