#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RadarChart

#include "Basic.hpp"

#include "RadarChart_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class RadarChart.RadarChart
// 0x0978 (0x0AA0 - 0x0128)
class URadarChart final : public UWidget
{
public:
	struct FRadarChartStyle                       ChartStyle;                                        // 0x0128(0x08E0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FRadarChartValueLayer>          ValueLayers;                                       // 0x0A08(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         bWrapWithInvalidationPanel : 1;                    // 0x0A18(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_A19[0x7];                                      // 0x0A19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x0A20(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnPressed;                                         // 0x0A30(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnReleased;                                        // 0x0A40(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnHovered;                                         // 0x0A50(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnUnhovered;                                       // 0x0A60(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnValueSlide;                                      // 0x0A70(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_A80[0x20];                                     // 0x0A80(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ForceRebuild();
	void InvalidateAllMaterials();
	void InvalidateMaterial(struct FRadarChartAppearance& InAppearance);
	void Refresh();
	void RefreshBase();
	void RefreshValueLayers();
	void SetNormalizationScale(float InValue);
	void SetValue(uint8 ValueLayerIndex, uint8 ValueIndex, float Value);
	void SetValuesForLayer(uint8 ValueLayerIndex, const TArray<float>& InValues);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RadarChart">();
	}
	static class URadarChart* GetDefaultObj()
	{
		return GetDefaultObjImpl<URadarChart>();
	}
};
static_assert(alignof(URadarChart) == 0x000008, "Wrong alignment on URadarChart");
static_assert(sizeof(URadarChart) == 0x000AA0, "Wrong size on URadarChart");
static_assert(offsetof(URadarChart, ChartStyle) == 0x000128, "Member 'URadarChart::ChartStyle' has a wrong offset!");
static_assert(offsetof(URadarChart, ValueLayers) == 0x000A08, "Member 'URadarChart::ValueLayers' has a wrong offset!");
static_assert(offsetof(URadarChart, OnClicked) == 0x000A20, "Member 'URadarChart::OnClicked' has a wrong offset!");
static_assert(offsetof(URadarChart, OnPressed) == 0x000A30, "Member 'URadarChart::OnPressed' has a wrong offset!");
static_assert(offsetof(URadarChart, OnReleased) == 0x000A40, "Member 'URadarChart::OnReleased' has a wrong offset!");
static_assert(offsetof(URadarChart, OnHovered) == 0x000A50, "Member 'URadarChart::OnHovered' has a wrong offset!");
static_assert(offsetof(URadarChart, OnUnhovered) == 0x000A60, "Member 'URadarChart::OnUnhovered' has a wrong offset!");
static_assert(offsetof(URadarChart, OnValueSlide) == 0x000A70, "Member 'URadarChart::OnValueSlide' has a wrong offset!");

// Class RadarChart.RadarChartSetValuesAnimated
// 0x0050 (0x0080 - 0x0030)
class URadarChartSetValuesAnimated final : public UBlueprintAsyncActionBase
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnUpdate;                                          // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFinished;                                        // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class URadarChartSetValuesAnimated* SetValuesAnimated(class URadarChart* Target, uint8 ValueLayer, const TArray<float>& Values, float Duration, uint8 FPS, EEasingFunc Ease);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RadarChartSetValuesAnimated">();
	}
	static class URadarChartSetValuesAnimated* GetDefaultObj()
	{
		return GetDefaultObjImpl<URadarChartSetValuesAnimated>();
	}
};
static_assert(alignof(URadarChartSetValuesAnimated) == 0x000008, "Wrong alignment on URadarChartSetValuesAnimated");
static_assert(sizeof(URadarChartSetValuesAnimated) == 0x000080, "Wrong size on URadarChartSetValuesAnimated");
static_assert(offsetof(URadarChartSetValuesAnimated, OnUpdate) == 0x000060, "Member 'URadarChartSetValuesAnimated::OnUpdate' has a wrong offset!");
static_assert(offsetof(URadarChartSetValuesAnimated, OnFinished) == 0x000070, "Member 'URadarChartSetValuesAnimated::OnFinished' has a wrong offset!");

// Class RadarChart.RadarChartSetNormalizationScaleAnimated
// 0x0048 (0x0078 - 0x0030)
class URadarChartSetNormalizationScaleAnimated final : public UBlueprintAsyncActionBase
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnUpdate;                                          // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFinished;                                        // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class URadarChartSetNormalizationScaleAnimated* SetNormalizationScaleAnimated(class URadarChart* Target, float NewScale, float Duration, uint8 FPS, EEasingFunc Ease);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RadarChartSetNormalizationScaleAnimated">();
	}
	static class URadarChartSetNormalizationScaleAnimated* GetDefaultObj()
	{
		return GetDefaultObjImpl<URadarChartSetNormalizationScaleAnimated>();
	}
};
static_assert(alignof(URadarChartSetNormalizationScaleAnimated) == 0x000008, "Wrong alignment on URadarChartSetNormalizationScaleAnimated");
static_assert(sizeof(URadarChartSetNormalizationScaleAnimated) == 0x000078, "Wrong size on URadarChartSetNormalizationScaleAnimated");
static_assert(offsetof(URadarChartSetNormalizationScaleAnimated, OnUpdate) == 0x000058, "Member 'URadarChartSetNormalizationScaleAnimated::OnUpdate' has a wrong offset!");
static_assert(offsetof(URadarChartSetNormalizationScaleAnimated, OnFinished) == 0x000068, "Member 'URadarChartSetNormalizationScaleAnimated::OnFinished' has a wrong offset!");

}

