#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RadarChart

#include "Basic.hpp"

#include "RadarChart_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function RadarChart.RadarChart.InvalidateMaterial
// 0x0398 (0x0398 - 0x0000)
struct RadarChart_InvalidateMaterial final
{
public:
	struct FRadarChartAppearance                  InAppearance;                                      // 0x0000(0x0398)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RadarChart_InvalidateMaterial) == 0x000008, "Wrong alignment on RadarChart_InvalidateMaterial");
static_assert(sizeof(RadarChart_InvalidateMaterial) == 0x000398, "Wrong size on RadarChart_InvalidateMaterial");
static_assert(offsetof(RadarChart_InvalidateMaterial, InAppearance) == 0x000000, "Member 'RadarChart_InvalidateMaterial::InAppearance' has a wrong offset!");

// Function RadarChart.RadarChart.SetNormalizationScale
// 0x0004 (0x0004 - 0x0000)
struct RadarChart_SetNormalizationScale final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RadarChart_SetNormalizationScale) == 0x000004, "Wrong alignment on RadarChart_SetNormalizationScale");
static_assert(sizeof(RadarChart_SetNormalizationScale) == 0x000004, "Wrong size on RadarChart_SetNormalizationScale");
static_assert(offsetof(RadarChart_SetNormalizationScale, InValue) == 0x000000, "Member 'RadarChart_SetNormalizationScale::InValue' has a wrong offset!");

// Function RadarChart.RadarChart.SetValue
// 0x0008 (0x0008 - 0x0000)
struct RadarChart_SetValue final
{
public:
	uint8                                         ValueLayerIndex;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ValueIndex;                                        // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Value;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RadarChart_SetValue) == 0x000004, "Wrong alignment on RadarChart_SetValue");
static_assert(sizeof(RadarChart_SetValue) == 0x000008, "Wrong size on RadarChart_SetValue");
static_assert(offsetof(RadarChart_SetValue, ValueLayerIndex) == 0x000000, "Member 'RadarChart_SetValue::ValueLayerIndex' has a wrong offset!");
static_assert(offsetof(RadarChart_SetValue, ValueIndex) == 0x000001, "Member 'RadarChart_SetValue::ValueIndex' has a wrong offset!");
static_assert(offsetof(RadarChart_SetValue, Value) == 0x000004, "Member 'RadarChart_SetValue::Value' has a wrong offset!");

// Function RadarChart.RadarChart.SetValuesForLayer
// 0x0018 (0x0018 - 0x0000)
struct RadarChart_SetValuesForLayer final
{
public:
	uint8                                         ValueLayerIndex;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 InValues;                                          // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RadarChart_SetValuesForLayer) == 0x000008, "Wrong alignment on RadarChart_SetValuesForLayer");
static_assert(sizeof(RadarChart_SetValuesForLayer) == 0x000018, "Wrong size on RadarChart_SetValuesForLayer");
static_assert(offsetof(RadarChart_SetValuesForLayer, ValueLayerIndex) == 0x000000, "Member 'RadarChart_SetValuesForLayer::ValueLayerIndex' has a wrong offset!");
static_assert(offsetof(RadarChart_SetValuesForLayer, InValues) == 0x000008, "Member 'RadarChart_SetValuesForLayer::InValues' has a wrong offset!");

// Function RadarChart.RadarChartSetValuesAnimated.SetValuesAnimated
// 0x0030 (0x0030 - 0x0000)
struct RadarChartSetValuesAnimated_SetValuesAnimated final
{
public:
	class URadarChart*                            Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ValueLayer;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 Values;                                            // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         FPS;                                               // 0x0024(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEasingFunc                                   Ease;                                              // 0x0025(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class URadarChartSetValuesAnimated*           ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RadarChartSetValuesAnimated_SetValuesAnimated) == 0x000008, "Wrong alignment on RadarChartSetValuesAnimated_SetValuesAnimated");
static_assert(sizeof(RadarChartSetValuesAnimated_SetValuesAnimated) == 0x000030, "Wrong size on RadarChartSetValuesAnimated_SetValuesAnimated");
static_assert(offsetof(RadarChartSetValuesAnimated_SetValuesAnimated, Target) == 0x000000, "Member 'RadarChartSetValuesAnimated_SetValuesAnimated::Target' has a wrong offset!");
static_assert(offsetof(RadarChartSetValuesAnimated_SetValuesAnimated, ValueLayer) == 0x000008, "Member 'RadarChartSetValuesAnimated_SetValuesAnimated::ValueLayer' has a wrong offset!");
static_assert(offsetof(RadarChartSetValuesAnimated_SetValuesAnimated, Values) == 0x000010, "Member 'RadarChartSetValuesAnimated_SetValuesAnimated::Values' has a wrong offset!");
static_assert(offsetof(RadarChartSetValuesAnimated_SetValuesAnimated, Duration) == 0x000020, "Member 'RadarChartSetValuesAnimated_SetValuesAnimated::Duration' has a wrong offset!");
static_assert(offsetof(RadarChartSetValuesAnimated_SetValuesAnimated, FPS) == 0x000024, "Member 'RadarChartSetValuesAnimated_SetValuesAnimated::FPS' has a wrong offset!");
static_assert(offsetof(RadarChartSetValuesAnimated_SetValuesAnimated, Ease) == 0x000025, "Member 'RadarChartSetValuesAnimated_SetValuesAnimated::Ease' has a wrong offset!");
static_assert(offsetof(RadarChartSetValuesAnimated_SetValuesAnimated, ReturnValue) == 0x000028, "Member 'RadarChartSetValuesAnimated_SetValuesAnimated::ReturnValue' has a wrong offset!");

// Function RadarChart.RadarChartSetNormalizationScaleAnimated.SetNormalizationScaleAnimated
// 0x0020 (0x0020 - 0x0000)
struct RadarChartSetNormalizationScaleAnimated_SetNormalizationScaleAnimated final
{
public:
	class URadarChart*                            Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewScale;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         FPS;                                               // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEasingFunc                                   Ease;                                              // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URadarChartSetNormalizationScaleAnimated* ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RadarChartSetNormalizationScaleAnimated_SetNormalizationScaleAnimated) == 0x000008, "Wrong alignment on RadarChartSetNormalizationScaleAnimated_SetNormalizationScaleAnimated");
static_assert(sizeof(RadarChartSetNormalizationScaleAnimated_SetNormalizationScaleAnimated) == 0x000020, "Wrong size on RadarChartSetNormalizationScaleAnimated_SetNormalizationScaleAnimated");
static_assert(offsetof(RadarChartSetNormalizationScaleAnimated_SetNormalizationScaleAnimated, Target) == 0x000000, "Member 'RadarChartSetNormalizationScaleAnimated_SetNormalizationScaleAnimated::Target' has a wrong offset!");
static_assert(offsetof(RadarChartSetNormalizationScaleAnimated_SetNormalizationScaleAnimated, NewScale) == 0x000008, "Member 'RadarChartSetNormalizationScaleAnimated_SetNormalizationScaleAnimated::NewScale' has a wrong offset!");
static_assert(offsetof(RadarChartSetNormalizationScaleAnimated_SetNormalizationScaleAnimated, Duration) == 0x00000C, "Member 'RadarChartSetNormalizationScaleAnimated_SetNormalizationScaleAnimated::Duration' has a wrong offset!");
static_assert(offsetof(RadarChartSetNormalizationScaleAnimated_SetNormalizationScaleAnimated, FPS) == 0x000010, "Member 'RadarChartSetNormalizationScaleAnimated_SetNormalizationScaleAnimated::FPS' has a wrong offset!");
static_assert(offsetof(RadarChartSetNormalizationScaleAnimated_SetNormalizationScaleAnimated, Ease) == 0x000011, "Member 'RadarChartSetNormalizationScaleAnimated_SetNormalizationScaleAnimated::Ease' has a wrong offset!");
static_assert(offsetof(RadarChartSetNormalizationScaleAnimated_SetNormalizationScaleAnimated, ReturnValue) == 0x000018, "Member 'RadarChartSetNormalizationScaleAnimated_SetNormalizationScaleAnimated::ReturnValue' has a wrong offset!");

}

