#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RangeLimitBuffer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RangeLimitBuffer.RangeLimitBuffer_C
// 0x0098 (0x01C0 - 0x0128)
class URangeLimitBuffer_C final : public UCustomGameAbilityBuffer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0128(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Launcher;                                          // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            LauncherController;                                // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Range;                                             // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 RunTimeID;                                         // 0x0148(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAbilityComponentBase*                  OwnerAbility;                                      // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UNiagaraComponent*                      Beam;                                              // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInitialFinish;                                    // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 OwnerPawn;                                         // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         ChainParticle;                                     // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 ModifierIDs;                                       // 0x0180(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 LauncherModifiers;                                 // 0x0190(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 LaucnherRunTimeID;                                 // 0x01A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                TemLocation;                                       // 0x01B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	TArray<struct FSoftObjectPath> OnGetAssetPath(const TArray<struct FParamInfo>& InParams, TArray<int32>& CharacterIDs, TArray<int32>& SkillIDs, TArray<int32>& ModifierIDs_0, TArray<int32>& EmitterIDs);
	void GetControlledPawn(class AController* Controller, class AActor** Out);
	bool IsControlByModifier();
	void InitParams(TArray<struct FParamInfo>& Info);
	void K2_ReceiveInitialize(const TArray<struct FParamInfo>& Info, const class UGameAbilityComponent* lpInstigator);
	void K2_ReceiveActive(const class UObject* Instigator);
	void K2_ReceiveDeActive(const class UGameAbilityComponent* Pawn);
	void K2_ReceiveTick(float DeltaSeconds, const class UGameAbilityComponent* Pawn);
	void ExecuteUbergraph_RangeLimitBuffer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("RangeLimitBuffer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RangeLimitBuffer_C")
	}
	static class URangeLimitBuffer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URangeLimitBuffer_C>();
	}
};
DUMPER7_ASSERTS_URangeLimitBuffer_C;

}

