#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReceiveCustomMessageExecute

#include "Basic.hpp"


namespace SDK::Params
{

// Function ReceiveCustomMessageExecute.ReceiveCustomMessageExecute_C.ExecuteUbergraph_ReceiveCustomMessageExecute
// 0x0040 (0x0040 - 0x0000)
struct ReceiveCustomMessageExecute_C_ExecuteUbergraph_ReceiveCustomMessageExecute final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Msg)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATaskDispatcher_C*                      CallFunc_GetTaskDispatcher_Dispatcher;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Msg;                            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATaskDispatcher_C*                      CallFunc_GetTaskDispatcher_Dispatcher_1;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ReceiveCustomMessageExecute_C_ExecuteUbergraph_ReceiveCustomMessageExecute) == 0x000008, "Wrong alignment on ReceiveCustomMessageExecute_C_ExecuteUbergraph_ReceiveCustomMessageExecute");
static_assert(sizeof(ReceiveCustomMessageExecute_C_ExecuteUbergraph_ReceiveCustomMessageExecute) == 0x000040, "Wrong size on ReceiveCustomMessageExecute_C_ExecuteUbergraph_ReceiveCustomMessageExecute");
static_assert(offsetof(ReceiveCustomMessageExecute_C_ExecuteUbergraph_ReceiveCustomMessageExecute, EntryPoint) == 0x000000, "Member 'ReceiveCustomMessageExecute_C_ExecuteUbergraph_ReceiveCustomMessageExecute::EntryPoint' has a wrong offset!");
static_assert(offsetof(ReceiveCustomMessageExecute_C_ExecuteUbergraph_ReceiveCustomMessageExecute, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ReceiveCustomMessageExecute_C_ExecuteUbergraph_ReceiveCustomMessageExecute::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ReceiveCustomMessageExecute_C_ExecuteUbergraph_ReceiveCustomMessageExecute, CallFunc_GetTaskDispatcher_Dispatcher) == 0x000018, "Member 'ReceiveCustomMessageExecute_C_ExecuteUbergraph_ReceiveCustomMessageExecute::CallFunc_GetTaskDispatcher_Dispatcher' has a wrong offset!");
static_assert(offsetof(ReceiveCustomMessageExecute_C_ExecuteUbergraph_ReceiveCustomMessageExecute, K2Node_CustomEvent_Msg) == 0x000020, "Member 'ReceiveCustomMessageExecute_C_ExecuteUbergraph_ReceiveCustomMessageExecute::K2Node_CustomEvent_Msg' has a wrong offset!");
static_assert(offsetof(ReceiveCustomMessageExecute_C_ExecuteUbergraph_ReceiveCustomMessageExecute, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000030, "Member 'ReceiveCustomMessageExecute_C_ExecuteUbergraph_ReceiveCustomMessageExecute::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReceiveCustomMessageExecute_C_ExecuteUbergraph_ReceiveCustomMessageExecute, CallFunc_GetTaskDispatcher_Dispatcher_1) == 0x000038, "Member 'ReceiveCustomMessageExecute_C_ExecuteUbergraph_ReceiveCustomMessageExecute::CallFunc_GetTaskDispatcher_Dispatcher_1' has a wrong offset!");

// Function ReceiveCustomMessageExecute.ReceiveCustomMessageExecute_C.OnReceiveMsg
// 0x0010 (0x0010 - 0x0000)
struct ReceiveCustomMessageExecute_C_OnReceiveMsg final
{
public:
	class FString                                 Msg;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(ReceiveCustomMessageExecute_C_OnReceiveMsg) == 0x000008, "Wrong alignment on ReceiveCustomMessageExecute_C_OnReceiveMsg");
static_assert(sizeof(ReceiveCustomMessageExecute_C_OnReceiveMsg) == 0x000010, "Wrong size on ReceiveCustomMessageExecute_C_OnReceiveMsg");
static_assert(offsetof(ReceiveCustomMessageExecute_C_OnReceiveMsg, Msg) == 0x000000, "Member 'ReceiveCustomMessageExecute_C_OnReceiveMsg::Msg' has a wrong offset!");

// Function ReceiveCustomMessageExecute.ReceiveCustomMessageExecute_C.GetSpecialStaticDescription
// 0x0020 (0x0020 - 0x0000)
struct ReceiveCustomMessageExecute_C_GetSpecialStaticDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(ReceiveCustomMessageExecute_C_GetSpecialStaticDescription) == 0x000008, "Wrong alignment on ReceiveCustomMessageExecute_C_GetSpecialStaticDescription");
static_assert(sizeof(ReceiveCustomMessageExecute_C_GetSpecialStaticDescription) == 0x000020, "Wrong size on ReceiveCustomMessageExecute_C_GetSpecialStaticDescription");
static_assert(offsetof(ReceiveCustomMessageExecute_C_GetSpecialStaticDescription, ReturnValue) == 0x000000, "Member 'ReceiveCustomMessageExecute_C_GetSpecialStaticDescription::ReturnValue' has a wrong offset!");
static_assert(offsetof(ReceiveCustomMessageExecute_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue) == 0x000010, "Member 'ReceiveCustomMessageExecute_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

}

