#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReloadSkill_Accessory

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ReloadSkill_Accessory.ReloadSkill_Accessory_C
// 0x0030 (0x0A30 - 0x0A00)
class AReloadSkill_Accessory_C final : public AGameSkill
{
public:
	uint8                                         Pad_9F8[0x8];                                      // 0x09F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UMontageStateComponent*                 MontageState;                                      // 0x0A00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillEmitterComponent*                 SkillEmitter;                                      // 0x0A08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillTagComponent*                     SkillTag1;                                         // 0x0A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UReloadSkillComponent_Accessory_C*      ReloadSkillComponent_Accessory;                    // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillInBunkerComponent*                SkillInBunker;                                     // 0x0A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ReloadSkill_Accessory_C">();
	}
	static class AReloadSkill_Accessory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AReloadSkill_Accessory_C>();
	}
};
static_assert(alignof(AReloadSkill_Accessory_C) == 0x000010, "Wrong alignment on AReloadSkill_Accessory_C");
static_assert(sizeof(AReloadSkill_Accessory_C) == 0x000A30, "Wrong size on AReloadSkill_Accessory_C");
static_assert(offsetof(AReloadSkill_Accessory_C, MontageState) == 0x000A00, "Member 'AReloadSkill_Accessory_C::MontageState' has a wrong offset!");
static_assert(offsetof(AReloadSkill_Accessory_C, SkillEmitter) == 0x000A08, "Member 'AReloadSkill_Accessory_C::SkillEmitter' has a wrong offset!");
static_assert(offsetof(AReloadSkill_Accessory_C, SkillTag1) == 0x000A10, "Member 'AReloadSkill_Accessory_C::SkillTag1' has a wrong offset!");
static_assert(offsetof(AReloadSkill_Accessory_C, ReloadSkillComponent_Accessory) == 0x000A18, "Member 'AReloadSkill_Accessory_C::ReloadSkillComponent_Accessory' has a wrong offset!");
static_assert(offsetof(AReloadSkill_Accessory_C, SkillInBunker) == 0x000A20, "Member 'AReloadSkill_Accessory_C::SkillInBunker' has a wrong offset!");
static_assert(offsetof(AReloadSkill_Accessory_C, DefaultSceneRoot) == 0x000A28, "Member 'AReloadSkill_Accessory_C::DefaultSceneRoot' has a wrong offset!");

}

