#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReloadSkill

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ReloadSkill.ReloadSkill_C
// 0x0030 (0x0A20 - 0x09F0)
class AReloadSkill_C final : public AGameSkill
{
public:
	uint8                                         Pad_9E8[0x8];                                      // 0x09E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UReloadMontageState_C*                  ReloadMontageState;                                // 0x09F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillEmitterComponent*                 SkillEmitter;                                      // 0x09F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillTagComponent*                     SkillTag1;                                         // 0x0A00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UReloadSkillComponent*                  ReloadSkill;                                       // 0x0A08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillInBunkerComponent*                SkillInBunker;                                     // 0x0A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ReloadSkill_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ReloadSkill_C")
	}
	static class AReloadSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AReloadSkill_C>();
	}
};
DUMPER7_ASSERTS_AReloadSkill_C;

}

