#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RemoteDebug

#include "Basic.hpp"

#include "RemoteDebug_structs.hpp"


namespace SDK::Params
{

// Function RemoteDebug.SocketObject.Create
// 0x0028 (0x0028 - 0x0000)
struct SocketObject_Create final
{
public:
	class FString                                 IP;                                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bServer;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Port;                                              // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReceiveSize;                                       // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SendSize;                                          // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SocketObject_Create) == 0x000008, "Wrong alignment on SocketObject_Create");
static_assert(sizeof(SocketObject_Create) == 0x000028, "Wrong size on SocketObject_Create");
static_assert(offsetof(SocketObject_Create, IP) == 0x000000, "Member 'SocketObject_Create::IP' has a wrong offset!");
static_assert(offsetof(SocketObject_Create, bServer) == 0x000010, "Member 'SocketObject_Create::bServer' has a wrong offset!");
static_assert(offsetof(SocketObject_Create, Port) == 0x000014, "Member 'SocketObject_Create::Port' has a wrong offset!");
static_assert(offsetof(SocketObject_Create, ReceiveSize) == 0x000018, "Member 'SocketObject_Create::ReceiveSize' has a wrong offset!");
static_assert(offsetof(SocketObject_Create, SendSize) == 0x00001C, "Member 'SocketObject_Create::SendSize' has a wrong offset!");
static_assert(offsetof(SocketObject_Create, ReturnValue) == 0x000020, "Member 'SocketObject_Create::ReturnValue' has a wrong offset!");

// Function RemoteDebug.SocketObject.OnDisConnected
// 0x0008 (0x0008 - 0x0000)
struct SocketObject_OnDisConnected final
{
public:
	class USocketRSThread*                        PThread;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SocketObject_OnDisConnected) == 0x000008, "Wrong alignment on SocketObject_OnDisConnected");
static_assert(sizeof(SocketObject_OnDisConnected) == 0x000008, "Wrong size on SocketObject_OnDisConnected");
static_assert(offsetof(SocketObject_OnDisConnected, PThread) == 0x000000, "Member 'SocketObject_OnDisConnected::PThread' has a wrong offset!");

// Function RemoteDebug.SocketObject.ReceiveSocketDataDelegateClientEvent
// 0x0010 (0x0010 - 0x0000)
struct SocketObject_ReceiveSocketDataDelegateClientEvent final
{
public:
	class FString                                 Data;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SocketObject_ReceiveSocketDataDelegateClientEvent) == 0x000008, "Wrong alignment on SocketObject_ReceiveSocketDataDelegateClientEvent");
static_assert(sizeof(SocketObject_ReceiveSocketDataDelegateClientEvent) == 0x000010, "Wrong size on SocketObject_ReceiveSocketDataDelegateClientEvent");
static_assert(offsetof(SocketObject_ReceiveSocketDataDelegateClientEvent, Data) == 0x000000, "Member 'SocketObject_ReceiveSocketDataDelegateClientEvent::Data' has a wrong offset!");

// Function RemoteDebug.SocketObject.ReceiveSocketDataDelegateEvent
// 0x0010 (0x0010 - 0x0000)
struct SocketObject_ReceiveSocketDataDelegateEvent final
{
public:
	class FString                                 Data;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SocketObject_ReceiveSocketDataDelegateEvent) == 0x000008, "Wrong alignment on SocketObject_ReceiveSocketDataDelegateEvent");
static_assert(sizeof(SocketObject_ReceiveSocketDataDelegateEvent) == 0x000010, "Wrong size on SocketObject_ReceiveSocketDataDelegateEvent");
static_assert(offsetof(SocketObject_ReceiveSocketDataDelegateEvent, Data) == 0x000000, "Member 'SocketObject_ReceiveSocketDataDelegateEvent::Data' has a wrong offset!");

// Function RemoteDebug.SocketObject.SendClientData
// 0x0060 (0x0060 - 0x0000)
struct SocketObject_SendClientData final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, struct FActorDetailStruct> ActorInfoList;                                     // 0x0010(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SocketObject_SendClientData) == 0x000008, "Wrong alignment on SocketObject_SendClientData");
static_assert(sizeof(SocketObject_SendClientData) == 0x000060, "Wrong size on SocketObject_SendClientData");
static_assert(offsetof(SocketObject_SendClientData, Message) == 0x000000, "Member 'SocketObject_SendClientData::Message' has a wrong offset!");
static_assert(offsetof(SocketObject_SendClientData, ActorInfoList) == 0x000010, "Member 'SocketObject_SendClientData::ActorInfoList' has a wrong offset!");

// Function RemoteDebug.SocketObject.SendData
// 0x0060 (0x0060 - 0x0000)
struct SocketObject_SendData final
{
public:
	struct FSocketStruct                          SocketStruct;                                      // 0x0000(0x0060)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SocketObject_SendData) == 0x000008, "Wrong alignment on SocketObject_SendData");
static_assert(sizeof(SocketObject_SendData) == 0x000060, "Wrong size on SocketObject_SendData");
static_assert(offsetof(SocketObject_SendData, SocketStruct) == 0x000000, "Member 'SocketObject_SendData::SocketStruct' has a wrong offset!");

}

