#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Repel_Formula

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Repel_Formula.Repel_Formula_C
// 0x0018 (0x00E8 - 0x00D0)
class URepel_Formula_C final : public URepelAbnormalMove
{
public:
	float                                         MoveDis;                                           // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            Curve;                                             // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExtendTime;                                        // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	float RepelMoveExtendTime();
	float MoveTickCalcVelocity(float DeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Repel_Formula_C">();
	}
	static class URepel_Formula_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URepel_Formula_C>();
	}
};
static_assert(alignof(URepel_Formula_C) == 0x000008, "Wrong alignment on URepel_Formula_C");
static_assert(sizeof(URepel_Formula_C) == 0x0000E8, "Wrong size on URepel_Formula_C");
static_assert(offsetof(URepel_Formula_C, MoveDis) == 0x0000D0, "Member 'URepel_Formula_C::MoveDis' has a wrong offset!");
static_assert(offsetof(URepel_Formula_C, Curve) == 0x0000D8, "Member 'URepel_Formula_C::Curve' has a wrong offset!");
static_assert(offsetof(URepel_Formula_C, ExtendTime) == 0x0000E0, "Member 'URepel_Formula_C::ExtendTime' has a wrong offset!");

}

