#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Repel_Formula

#include "Basic.hpp"


namespace SDK::Params
{

// Function Repel_Formula.Repel_Formula_C.RepelMoveExtendTime
// 0x0004 (0x0004 - 0x0000)
struct Repel_Formula_C_RepelMoveExtendTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Repel_Formula_C_RepelMoveExtendTime) == 0x000004, "Wrong alignment on Repel_Formula_C_RepelMoveExtendTime");
static_assert(sizeof(Repel_Formula_C_RepelMoveExtendTime) == 0x000004, "Wrong size on Repel_Formula_C_RepelMoveExtendTime");
static_assert(offsetof(Repel_Formula_C_RepelMoveExtendTime, ReturnValue) == 0x000000, "Member 'Repel_Formula_C_RepelMoveExtendTime::ReturnValue' has a wrong offset!");

// Function Repel_Formula.Repel_Formula_C.MoveTickCalcVelocity
// 0x003C (0x003C - 0x0000)
struct Repel_Formula_C_MoveTickCalcVelocity final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Repel_Formula_C_MoveTickCalcVelocity) == 0x000004, "Wrong alignment on Repel_Formula_C_MoveTickCalcVelocity");
static_assert(sizeof(Repel_Formula_C_MoveTickCalcVelocity) == 0x00003C, "Wrong size on Repel_Formula_C_MoveTickCalcVelocity");
static_assert(offsetof(Repel_Formula_C_MoveTickCalcVelocity, DeltaTime) == 0x000000, "Member 'Repel_Formula_C_MoveTickCalcVelocity::DeltaTime' has a wrong offset!");
static_assert(offsetof(Repel_Formula_C_MoveTickCalcVelocity, ReturnValue) == 0x000004, "Member 'Repel_Formula_C_MoveTickCalcVelocity::ReturnValue' has a wrong offset!");
static_assert(offsetof(Repel_Formula_C_MoveTickCalcVelocity, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'Repel_Formula_C_MoveTickCalcVelocity::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Repel_Formula_C_MoveTickCalcVelocity, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'Repel_Formula_C_MoveTickCalcVelocity::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Repel_Formula_C_MoveTickCalcVelocity, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000010, "Member 'Repel_Formula_C_MoveTickCalcVelocity::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Repel_Formula_C_MoveTickCalcVelocity, CallFunc_Add_FloatFloat_ReturnValue) == 0x000014, "Member 'Repel_Formula_C_MoveTickCalcVelocity::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Repel_Formula_C_MoveTickCalcVelocity, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'Repel_Formula_C_MoveTickCalcVelocity::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Repel_Formula_C_MoveTickCalcVelocity, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00001C, "Member 'Repel_Formula_C_MoveTickCalcVelocity::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Repel_Formula_C_MoveTickCalcVelocity, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000020, "Member 'Repel_Formula_C_MoveTickCalcVelocity::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Repel_Formula_C_MoveTickCalcVelocity, CallFunc_FMax_ReturnValue) == 0x000024, "Member 'Repel_Formula_C_MoveTickCalcVelocity::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(Repel_Formula_C_MoveTickCalcVelocity, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000028, "Member 'Repel_Formula_C_MoveTickCalcVelocity::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Repel_Formula_C_MoveTickCalcVelocity, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00002C, "Member 'Repel_Formula_C_MoveTickCalcVelocity::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Repel_Formula_C_MoveTickCalcVelocity, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000030, "Member 'Repel_Formula_C_MoveTickCalcVelocity::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Repel_Formula_C_MoveTickCalcVelocity, CallFunc_Subtract_FloatFloat_ReturnValue_3) == 0x000034, "Member 'Repel_Formula_C_MoveTickCalcVelocity::CallFunc_Subtract_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Repel_Formula_C_MoveTickCalcVelocity, CallFunc_FMax_ReturnValue_1) == 0x000038, "Member 'Repel_Formula_C_MoveTickCalcVelocity::CallFunc_FMax_ReturnValue_1' has a wrong offset!");

}

