#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReturnAttributeProductValue

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function ReturnAttributeProductValue.ReturnAttributeProductValue_C.CaclValue
// 0x0250 (0x0250 - 0x0000)
struct ReturnAttributeProductValue_C_CaclValue final
{
public:
	const class UAbilityComponentBase*            InLauncher;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UAbilityComponentBase*            InTarget;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FParamInfo>                     Params_0;                                          // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPreDamageResultData                   PreDamageData;                                     // 0x0020(0x01E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int32                                         InSkillLevel;                                      // 0x0200(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UModifier*                        InModifier;                                        // 0x0208(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0210(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutValue;                                          // 0x0214(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponentBase*                  Ability;                                           // 0x0218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Distance;                                          // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Per;                                               // 0x0224(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParamfloatValueForLevel_ReturnValue;   // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable;                                   // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPropertieValueFromString_ReturnValue;  // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReturnAttributeProductValue_C_CaclValue) == 0x000008, "Wrong alignment on ReturnAttributeProductValue_C_CaclValue");
static_assert(sizeof(ReturnAttributeProductValue_C_CaclValue) == 0x000250, "Wrong size on ReturnAttributeProductValue_C_CaclValue");
static_assert(offsetof(ReturnAttributeProductValue_C_CaclValue, InLauncher) == 0x000000, "Member 'ReturnAttributeProductValue_C_CaclValue::InLauncher' has a wrong offset!");
static_assert(offsetof(ReturnAttributeProductValue_C_CaclValue, InTarget) == 0x000008, "Member 'ReturnAttributeProductValue_C_CaclValue::InTarget' has a wrong offset!");
static_assert(offsetof(ReturnAttributeProductValue_C_CaclValue, Params_0) == 0x000010, "Member 'ReturnAttributeProductValue_C_CaclValue::Params_0' has a wrong offset!");
static_assert(offsetof(ReturnAttributeProductValue_C_CaclValue, PreDamageData) == 0x000020, "Member 'ReturnAttributeProductValue_C_CaclValue::PreDamageData' has a wrong offset!");
static_assert(offsetof(ReturnAttributeProductValue_C_CaclValue, InSkillLevel) == 0x000200, "Member 'ReturnAttributeProductValue_C_CaclValue::InSkillLevel' has a wrong offset!");
static_assert(offsetof(ReturnAttributeProductValue_C_CaclValue, InModifier) == 0x000208, "Member 'ReturnAttributeProductValue_C_CaclValue::InModifier' has a wrong offset!");
static_assert(offsetof(ReturnAttributeProductValue_C_CaclValue, ReturnValue) == 0x000210, "Member 'ReturnAttributeProductValue_C_CaclValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(ReturnAttributeProductValue_C_CaclValue, OutValue) == 0x000214, "Member 'ReturnAttributeProductValue_C_CaclValue::OutValue' has a wrong offset!");
static_assert(offsetof(ReturnAttributeProductValue_C_CaclValue, Ability) == 0x000218, "Member 'ReturnAttributeProductValue_C_CaclValue::Ability' has a wrong offset!");
static_assert(offsetof(ReturnAttributeProductValue_C_CaclValue, Distance) == 0x000220, "Member 'ReturnAttributeProductValue_C_CaclValue::Distance' has a wrong offset!");
static_assert(offsetof(ReturnAttributeProductValue_C_CaclValue, Per) == 0x000224, "Member 'ReturnAttributeProductValue_C_CaclValue::Per' has a wrong offset!");
static_assert(offsetof(ReturnAttributeProductValue_C_CaclValue, CallFunc_GetParamfloatValueForLevel_ReturnValue) == 0x000228, "Member 'ReturnAttributeProductValue_C_CaclValue::CallFunc_GetParamfloatValueForLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReturnAttributeProductValue_C_CaclValue, K2Node_SwitchString_CmpSuccess) == 0x00022C, "Member 'ReturnAttributeProductValue_C_CaclValue::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ReturnAttributeProductValue_C_CaclValue, CallFunc_Array_Length_ReturnValue) == 0x000230, "Member 'ReturnAttributeProductValue_C_CaclValue::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReturnAttributeProductValue_C_CaclValue, CallFunc_Subtract_IntInt_ReturnValue) == 0x000234, "Member 'ReturnAttributeProductValue_C_CaclValue::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReturnAttributeProductValue_C_CaclValue, ___int_Variable) == 0x000238, "Member 'ReturnAttributeProductValue_C_CaclValue::___int_Variable' has a wrong offset!");
static_assert(offsetof(ReturnAttributeProductValue_C_CaclValue, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00023C, "Member 'ReturnAttributeProductValue_C_CaclValue::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReturnAttributeProductValue_C_CaclValue, CallFunc_GetPropertieValueFromString_ReturnValue) == 0x000240, "Member 'ReturnAttributeProductValue_C_CaclValue::CallFunc_GetPropertieValueFromString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReturnAttributeProductValue_C_CaclValue, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000244, "Member 'ReturnAttributeProductValue_C_CaclValue::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReturnAttributeProductValue_C_CaclValue, CallFunc_Add_IntInt_ReturnValue) == 0x000248, "Member 'ReturnAttributeProductValue_C_CaclValue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReturnAttributeProductValue_C_CaclValue, CallFunc_IsValid_ReturnValue) == 0x00024C, "Member 'ReturnAttributeProductValue_C_CaclValue::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

