#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Richman

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Richman_structs.hpp"


namespace SDK::Params
{

// Function Richman.Richman_ChessGround.CheckObjectHasTag
// 0x0018 (0x0018 - 0x0000)
struct Richman_ChessGround_CheckObjectHasTag final
{
public:
	class FString                                 InTagName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Richman_ChessGround_CheckObjectHasTag) == 0x000008, "Wrong alignment on Richman_ChessGround_CheckObjectHasTag");
static_assert(sizeof(Richman_ChessGround_CheckObjectHasTag) == 0x000018, "Wrong size on Richman_ChessGround_CheckObjectHasTag");
static_assert(offsetof(Richman_ChessGround_CheckObjectHasTag, InTagName) == 0x000000, "Member 'Richman_ChessGround_CheckObjectHasTag::InTagName' has a wrong offset!");
static_assert(offsetof(Richman_ChessGround_CheckObjectHasTag, ReturnValue) == 0x000010, "Member 'Richman_ChessGround_CheckObjectHasTag::ReturnValue' has a wrong offset!");

// Function Richman.Richman_ChessGround.GetBuilding
// 0x0008 (0x0008 - 0x0000)
struct Richman_ChessGround_GetBuilding final
{
public:
	class ARichman_BuildingObject*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Richman_ChessGround_GetBuilding) == 0x000008, "Wrong alignment on Richman_ChessGround_GetBuilding");
static_assert(sizeof(Richman_ChessGround_GetBuilding) == 0x000008, "Wrong size on Richman_ChessGround_GetBuilding");
static_assert(offsetof(Richman_ChessGround_GetBuilding, ReturnValue) == 0x000000, "Member 'Richman_ChessGround_GetBuilding::ReturnValue' has a wrong offset!");

// Function Richman.Richman_ChessGround.GetObjectsByTag
// 0x0020 (0x0020 - 0x0000)
struct Richman_ChessGround_GetObjectsByTag final
{
public:
	class FString                                 InTagName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AChessObject*>                   ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(Richman_ChessGround_GetObjectsByTag) == 0x000008, "Wrong alignment on Richman_ChessGround_GetObjectsByTag");
static_assert(sizeof(Richman_ChessGround_GetObjectsByTag) == 0x000020, "Wrong size on Richman_ChessGround_GetObjectsByTag");
static_assert(offsetof(Richman_ChessGround_GetObjectsByTag, InTagName) == 0x000000, "Member 'Richman_ChessGround_GetObjectsByTag::InTagName' has a wrong offset!");
static_assert(offsetof(Richman_ChessGround_GetObjectsByTag, ReturnValue) == 0x000010, "Member 'Richman_ChessGround_GetObjectsByTag::ReturnValue' has a wrong offset!");

// Function Richman.Richman_ChessGround.HasProp
// 0x0001 (0x0001 - 0x0000)
struct Richman_ChessGround_HasProp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Richman_ChessGround_HasProp) == 0x000001, "Wrong alignment on Richman_ChessGround_HasProp");
static_assert(sizeof(Richman_ChessGround_HasProp) == 0x000001, "Wrong size on Richman_ChessGround_HasProp");
static_assert(offsetof(Richman_ChessGround_HasProp, ReturnValue) == 0x000000, "Member 'Richman_ChessGround_HasProp::ReturnValue' has a wrong offset!");

// Function Richman.Richman_ChessGround.IsInFrontOfBuilding
// 0x0010 (0x0010 - 0x0000)
struct Richman_ChessGround_IsInFrontOfBuilding final
{
public:
	class ARichman_BuildingObject*                InBuilding;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Richman_ChessGround_IsInFrontOfBuilding) == 0x000008, "Wrong alignment on Richman_ChessGround_IsInFrontOfBuilding");
static_assert(sizeof(Richman_ChessGround_IsInFrontOfBuilding) == 0x000010, "Wrong size on Richman_ChessGround_IsInFrontOfBuilding");
static_assert(offsetof(Richman_ChessGround_IsInFrontOfBuilding, InBuilding) == 0x000000, "Member 'Richman_ChessGround_IsInFrontOfBuilding::InBuilding' has a wrong offset!");
static_assert(offsetof(Richman_ChessGround_IsInFrontOfBuilding, ReturnValue) == 0x000008, "Member 'Richman_ChessGround_IsInFrontOfBuilding::ReturnValue' has a wrong offset!");

// Function Richman.Richman_ChessObject.GetTagParam
// 0x0010 (0x0010 - 0x0000)
struct Richman_ChessObject_GetTagParam final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Richman_ChessObject_GetTagParam) == 0x000008, "Wrong alignment on Richman_ChessObject_GetTagParam");
static_assert(sizeof(Richman_ChessObject_GetTagParam) == 0x000010, "Wrong size on Richman_ChessObject_GetTagParam");
static_assert(offsetof(Richman_ChessObject_GetTagParam, ReturnValue) == 0x000000, "Member 'Richman_ChessObject_GetTagParam::ReturnValue' has a wrong offset!");

// Function Richman.Richman_BuildingObject.GetOwnerCharacter
// 0x0008 (0x0008 - 0x0000)
struct Richman_BuildingObject_GetOwnerCharacter final
{
public:
	class ARichmanCharacter*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Richman_BuildingObject_GetOwnerCharacter) == 0x000008, "Wrong alignment on Richman_BuildingObject_GetOwnerCharacter");
static_assert(sizeof(Richman_BuildingObject_GetOwnerCharacter) == 0x000008, "Wrong size on Richman_BuildingObject_GetOwnerCharacter");
static_assert(offsetof(Richman_BuildingObject_GetOwnerCharacter, ReturnValue) == 0x000000, "Member 'Richman_BuildingObject_GetOwnerCharacter::ReturnValue' has a wrong offset!");

// Function Richman.Richman_BuildingObject.GetRealLevel
// 0x0004 (0x0004 - 0x0000)
struct Richman_BuildingObject_GetRealLevel final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Richman_BuildingObject_GetRealLevel) == 0x000004, "Wrong alignment on Richman_BuildingObject_GetRealLevel");
static_assert(sizeof(Richman_BuildingObject_GetRealLevel) == 0x000004, "Wrong size on Richman_BuildingObject_GetRealLevel");
static_assert(offsetof(Richman_BuildingObject_GetRealLevel, ReturnValue) == 0x000000, "Member 'Richman_BuildingObject_GetRealLevel::ReturnValue' has a wrong offset!");

// Function Richman.Richman_BuildingObject.GetRealTplId
// 0x0004 (0x0004 - 0x0000)
struct Richman_BuildingObject_GetRealTplId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Richman_BuildingObject_GetRealTplId) == 0x000004, "Wrong alignment on Richman_BuildingObject_GetRealTplId");
static_assert(sizeof(Richman_BuildingObject_GetRealTplId) == 0x000004, "Wrong size on Richman_BuildingObject_GetRealTplId");
static_assert(offsetof(Richman_BuildingObject_GetRealTplId, ReturnValue) == 0x000000, "Member 'Richman_BuildingObject_GetRealTplId::ReturnValue' has a wrong offset!");

// Function Richman.RichmanAIController.LookAtTarget
// 0x0008 (0x0008 - 0x0000)
struct RichmanAIController_LookAtTarget final
{
public:
	class AChessBase*                             InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanAIController_LookAtTarget) == 0x000008, "Wrong alignment on RichmanAIController_LookAtTarget");
static_assert(sizeof(RichmanAIController_LookAtTarget) == 0x000008, "Wrong size on RichmanAIController_LookAtTarget");
static_assert(offsetof(RichmanAIController_LookAtTarget, InActor) == 0x000000, "Member 'RichmanAIController_LookAtTarget::InActor' has a wrong offset!");

// Function Richman.RichmanAIController.SetScale
// 0x0004 (0x0004 - 0x0000)
struct RichmanAIController_SetScale final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanAIController_SetScale) == 0x000004, "Wrong alignment on RichmanAIController_SetScale");
static_assert(sizeof(RichmanAIController_SetScale) == 0x000004, "Wrong size on RichmanAIController_SetScale");
static_assert(offsetof(RichmanAIController_SetScale, InValue) == 0x000000, "Member 'RichmanAIController_SetScale::InValue' has a wrong offset!");

// Function Richman.RichmanAIController.StartMoving
// 0x0008 (0x0008 - 0x0000)
struct RichmanAIController_StartMoving final
{
public:
	int32                                         Steps;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InForce;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsCustomFlag;                                      // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RichmanAIController_StartMoving) == 0x000004, "Wrong alignment on RichmanAIController_StartMoving");
static_assert(sizeof(RichmanAIController_StartMoving) == 0x000008, "Wrong size on RichmanAIController_StartMoving");
static_assert(offsetof(RichmanAIController_StartMoving, Steps) == 0x000000, "Member 'RichmanAIController_StartMoving::Steps' has a wrong offset!");
static_assert(offsetof(RichmanAIController_StartMoving, InForce) == 0x000004, "Member 'RichmanAIController_StartMoving::InForce' has a wrong offset!");
static_assert(offsetof(RichmanAIController_StartMoving, IsCustomFlag) == 0x000005, "Member 'RichmanAIController_StartMoving::IsCustomFlag' has a wrong offset!");

// Function Richman.RichmanAIController.UpdateWalkState
// 0x0002 (0x0002 - 0x0000)
struct RichmanAIController_UpdateWalkState final
{
public:
	bool                                          IsRun;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsWalk;                                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanAIController_UpdateWalkState) == 0x000001, "Wrong alignment on RichmanAIController_UpdateWalkState");
static_assert(sizeof(RichmanAIController_UpdateWalkState) == 0x000002, "Wrong size on RichmanAIController_UpdateWalkState");
static_assert(offsetof(RichmanAIController_UpdateWalkState, IsRun) == 0x000000, "Member 'RichmanAIController_UpdateWalkState::IsRun' has a wrong offset!");
static_assert(offsetof(RichmanAIController_UpdateWalkState, IsWalk) == 0x000001, "Member 'RichmanAIController_UpdateWalkState::IsWalk' has a wrong offset!");

// Function Richman.RichmanAIController.GetCurrentChar
// 0x0008 (0x0008 - 0x0000)
struct RichmanAIController_GetCurrentChar final
{
public:
	class ARichmanCharacter*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanAIController_GetCurrentChar) == 0x000008, "Wrong alignment on RichmanAIController_GetCurrentChar");
static_assert(sizeof(RichmanAIController_GetCurrentChar) == 0x000008, "Wrong size on RichmanAIController_GetCurrentChar");
static_assert(offsetof(RichmanAIController_GetCurrentChar, ReturnValue) == 0x000000, "Member 'RichmanAIController_GetCurrentChar::ReturnValue' has a wrong offset!");

// Function Richman.RichmanCameraFollow.CheckAutoFollowComplete
// 0x0001 (0x0001 - 0x0000)
struct RichmanCameraFollow_CheckAutoFollowComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCameraFollow_CheckAutoFollowComplete) == 0x000001, "Wrong alignment on RichmanCameraFollow_CheckAutoFollowComplete");
static_assert(sizeof(RichmanCameraFollow_CheckAutoFollowComplete) == 0x000001, "Wrong size on RichmanCameraFollow_CheckAutoFollowComplete");
static_assert(offsetof(RichmanCameraFollow_CheckAutoFollowComplete, ReturnValue) == 0x000000, "Member 'RichmanCameraFollow_CheckAutoFollowComplete::ReturnValue' has a wrong offset!");

// Function Richman.RichmanCameraFollow.GetLockControl
// 0x0001 (0x0001 - 0x0000)
struct RichmanCameraFollow_GetLockControl final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCameraFollow_GetLockControl) == 0x000001, "Wrong alignment on RichmanCameraFollow_GetLockControl");
static_assert(sizeof(RichmanCameraFollow_GetLockControl) == 0x000001, "Wrong size on RichmanCameraFollow_GetLockControl");
static_assert(offsetof(RichmanCameraFollow_GetLockControl, ReturnValue) == 0x000000, "Member 'RichmanCameraFollow_GetLockControl::ReturnValue' has a wrong offset!");

// Function Richman.RichmanCameraFollow.IsSlidingView
// 0x0001 (0x0001 - 0x0000)
struct RichmanCameraFollow_IsSlidingView final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCameraFollow_IsSlidingView) == 0x000001, "Wrong alignment on RichmanCameraFollow_IsSlidingView");
static_assert(sizeof(RichmanCameraFollow_IsSlidingView) == 0x000001, "Wrong size on RichmanCameraFollow_IsSlidingView");
static_assert(offsetof(RichmanCameraFollow_IsSlidingView, ReturnValue) == 0x000000, "Member 'RichmanCameraFollow_IsSlidingView::ReturnValue' has a wrong offset!");

// Function Richman.RichmanCameraFollow.OnMouseMove
// 0x0008 (0x0008 - 0x0000)
struct RichmanCameraFollow_OnMouseMove final
{
public:
	struct FVector2D                              DeltaPos;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCameraFollow_OnMouseMove) == 0x000004, "Wrong alignment on RichmanCameraFollow_OnMouseMove");
static_assert(sizeof(RichmanCameraFollow_OnMouseMove) == 0x000008, "Wrong size on RichmanCameraFollow_OnMouseMove");
static_assert(offsetof(RichmanCameraFollow_OnMouseMove, DeltaPos) == 0x000000, "Member 'RichmanCameraFollow_OnMouseMove::DeltaPos' has a wrong offset!");

// Function Richman.RichmanCameraFollow.OnZoomChange
// 0x0004 (0x0004 - 0x0000)
struct RichmanCameraFollow_OnZoomChange final
{
public:
	float                                         InZoom;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCameraFollow_OnZoomChange) == 0x000004, "Wrong alignment on RichmanCameraFollow_OnZoomChange");
static_assert(sizeof(RichmanCameraFollow_OnZoomChange) == 0x000004, "Wrong size on RichmanCameraFollow_OnZoomChange");
static_assert(offsetof(RichmanCameraFollow_OnZoomChange, InZoom) == 0x000000, "Member 'RichmanCameraFollow_OnZoomChange::InZoom' has a wrong offset!");

// Function Richman.RichmanCameraFollow.RefreshCameraRange
// 0x0008 (0x0008 - 0x0000)
struct RichmanCameraFollow_RefreshCameraRange final
{
public:
	class AChessRegion*                           Region;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCameraFollow_RefreshCameraRange) == 0x000008, "Wrong alignment on RichmanCameraFollow_RefreshCameraRange");
static_assert(sizeof(RichmanCameraFollow_RefreshCameraRange) == 0x000008, "Wrong size on RichmanCameraFollow_RefreshCameraRange");
static_assert(offsetof(RichmanCameraFollow_RefreshCameraRange, Region) == 0x000000, "Member 'RichmanCameraFollow_RefreshCameraRange::Region' has a wrong offset!");

// Function Richman.RichmanCameraFollow.SetCameraShowTarget
// 0x0008 (0x0008 - 0x0000)
struct RichmanCameraFollow_SetCameraShowTarget final
{
public:
	class AActor*                                 InTarget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCameraFollow_SetCameraShowTarget) == 0x000008, "Wrong alignment on RichmanCameraFollow_SetCameraShowTarget");
static_assert(sizeof(RichmanCameraFollow_SetCameraShowTarget) == 0x000008, "Wrong size on RichmanCameraFollow_SetCameraShowTarget");
static_assert(offsetof(RichmanCameraFollow_SetCameraShowTarget, InTarget) == 0x000000, "Member 'RichmanCameraFollow_SetCameraShowTarget::InTarget' has a wrong offset!");

// Function Richman.RichmanCameraFollow.SetFollowTarget
// 0x0010 (0x0010 - 0x0000)
struct RichmanCameraFollow_SetFollowTarget final
{
public:
	class AActor*                                 InCharacter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Immediately;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RichmanCameraFollow_SetFollowTarget) == 0x000008, "Wrong alignment on RichmanCameraFollow_SetFollowTarget");
static_assert(sizeof(RichmanCameraFollow_SetFollowTarget) == 0x000010, "Wrong size on RichmanCameraFollow_SetFollowTarget");
static_assert(offsetof(RichmanCameraFollow_SetFollowTarget, InCharacter) == 0x000000, "Member 'RichmanCameraFollow_SetFollowTarget::InCharacter' has a wrong offset!");
static_assert(offsetof(RichmanCameraFollow_SetFollowTarget, Immediately) == 0x000008, "Member 'RichmanCameraFollow_SetFollowTarget::Immediately' has a wrong offset!");

// Function Richman.RichmanCameraFollow.SetLockControl
// 0x0001 (0x0001 - 0x0000)
struct RichmanCameraFollow_SetLockControl final
{
public:
	bool                                          InLockControl;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCameraFollow_SetLockControl) == 0x000001, "Wrong alignment on RichmanCameraFollow_SetLockControl");
static_assert(sizeof(RichmanCameraFollow_SetLockControl) == 0x000001, "Wrong size on RichmanCameraFollow_SetLockControl");
static_assert(offsetof(RichmanCameraFollow_SetLockControl, InLockControl) == 0x000000, "Member 'RichmanCameraFollow_SetLockControl::InLockControl' has a wrong offset!");

// Function Richman.RichmanCameraFollow.SetSlidingView
// 0x0001 (0x0001 - 0x0000)
struct RichmanCameraFollow_SetSlidingView final
{
public:
	bool                                          bSlid;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCameraFollow_SetSlidingView) == 0x000001, "Wrong alignment on RichmanCameraFollow_SetSlidingView");
static_assert(sizeof(RichmanCameraFollow_SetSlidingView) == 0x000001, "Wrong size on RichmanCameraFollow_SetSlidingView");
static_assert(offsetof(RichmanCameraFollow_SetSlidingView, bSlid) == 0x000000, "Member 'RichmanCameraFollow_SetSlidingView::bSlid' has a wrong offset!");

// Function Richman.RichmanCharacter.ApplyBuyLand
// 0x0001 (0x0001 - 0x0000)
struct RichmanCharacter_ApplyBuyLand final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCharacter_ApplyBuyLand) == 0x000001, "Wrong alignment on RichmanCharacter_ApplyBuyLand");
static_assert(sizeof(RichmanCharacter_ApplyBuyLand) == 0x000001, "Wrong size on RichmanCharacter_ApplyBuyLand");
static_assert(offsetof(RichmanCharacter_ApplyBuyLand, ReturnValue) == 0x000000, "Member 'RichmanCharacter_ApplyBuyLand::ReturnValue' has a wrong offset!");

// Function Richman.RichmanCharacter.CheckHasObjectByParam
// 0x0018 (0x0018 - 0x0000)
struct RichmanCharacter_CheckHasObjectByParam final
{
public:
	class FString                                 InParam;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RichmanCharacter_CheckHasObjectByParam) == 0x000008, "Wrong alignment on RichmanCharacter_CheckHasObjectByParam");
static_assert(sizeof(RichmanCharacter_CheckHasObjectByParam) == 0x000018, "Wrong size on RichmanCharacter_CheckHasObjectByParam");
static_assert(offsetof(RichmanCharacter_CheckHasObjectByParam, InParam) == 0x000000, "Member 'RichmanCharacter_CheckHasObjectByParam::InParam' has a wrong offset!");
static_assert(offsetof(RichmanCharacter_CheckHasObjectByParam, ReturnValue) == 0x000010, "Member 'RichmanCharacter_CheckHasObjectByParam::ReturnValue' has a wrong offset!");

// Function Richman.RichmanCharacter.CheckLandAvailabilityForPurchase
// 0x0001 (0x0001 - 0x0000)
struct RichmanCharacter_CheckLandAvailabilityForPurchase final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCharacter_CheckLandAvailabilityForPurchase) == 0x000001, "Wrong alignment on RichmanCharacter_CheckLandAvailabilityForPurchase");
static_assert(sizeof(RichmanCharacter_CheckLandAvailabilityForPurchase) == 0x000001, "Wrong size on RichmanCharacter_CheckLandAvailabilityForPurchase");
static_assert(offsetof(RichmanCharacter_CheckLandAvailabilityForPurchase, ReturnValue) == 0x000000, "Member 'RichmanCharacter_CheckLandAvailabilityForPurchase::ReturnValue' has a wrong offset!");

// Function Richman.RichmanCharacter.EntryHospital
// 0x0004 (0x0004 - 0x0000)
struct RichmanCharacter_EntryHospital final
{
public:
	int32                                         InDay;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCharacter_EntryHospital) == 0x000004, "Wrong alignment on RichmanCharacter_EntryHospital");
static_assert(sizeof(RichmanCharacter_EntryHospital) == 0x000004, "Wrong size on RichmanCharacter_EntryHospital");
static_assert(offsetof(RichmanCharacter_EntryHospital, InDay) == 0x000000, "Member 'RichmanCharacter_EntryHospital::InDay' has a wrong offset!");

// Function Richman.RichmanCharacter.GetAIController
// 0x0008 (0x0008 - 0x0000)
struct RichmanCharacter_GetAIController final
{
public:
	class ARichmanAIController*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCharacter_GetAIController) == 0x000008, "Wrong alignment on RichmanCharacter_GetAIController");
static_assert(sizeof(RichmanCharacter_GetAIController) == 0x000008, "Wrong size on RichmanCharacter_GetAIController");
static_assert(offsetof(RichmanCharacter_GetAIController, ReturnValue) == 0x000000, "Member 'RichmanCharacter_GetAIController::ReturnValue' has a wrong offset!");

// Function Richman.RichmanCharacter.GetChessGround
// 0x0008 (0x0008 - 0x0000)
struct RichmanCharacter_GetChessGround final
{
public:
	class ARichman_ChessGround*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCharacter_GetChessGround) == 0x000008, "Wrong alignment on RichmanCharacter_GetChessGround");
static_assert(sizeof(RichmanCharacter_GetChessGround) == 0x000008, "Wrong size on RichmanCharacter_GetChessGround");
static_assert(offsetof(RichmanCharacter_GetChessGround, ReturnValue) == 0x000000, "Member 'RichmanCharacter_GetChessGround::ReturnValue' has a wrong offset!");

// Function Richman.RichmanCharacter.GetHeadIconId
// 0x0010 (0x0010 - 0x0000)
struct RichmanCharacter_GetHeadIconId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCharacter_GetHeadIconId) == 0x000008, "Wrong alignment on RichmanCharacter_GetHeadIconId");
static_assert(sizeof(RichmanCharacter_GetHeadIconId) == 0x000010, "Wrong size on RichmanCharacter_GetHeadIconId");
static_assert(offsetof(RichmanCharacter_GetHeadIconId, ReturnValue) == 0x000000, "Member 'RichmanCharacter_GetHeadIconId::ReturnValue' has a wrong offset!");

// Function Richman.RichmanCharacter.GetLangNameKey
// 0x0010 (0x0010 - 0x0000)
struct RichmanCharacter_GetLangNameKey final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCharacter_GetLangNameKey) == 0x000008, "Wrong alignment on RichmanCharacter_GetLangNameKey");
static_assert(sizeof(RichmanCharacter_GetLangNameKey) == 0x000010, "Wrong size on RichmanCharacter_GetLangNameKey");
static_assert(offsetof(RichmanCharacter_GetLangNameKey, ReturnValue) == 0x000000, "Member 'RichmanCharacter_GetLangNameKey::ReturnValue' has a wrong offset!");

// Function Richman.RichmanCharacter.GetNpcUID
// 0x0004 (0x0004 - 0x0000)
struct RichmanCharacter_GetNpcUID final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCharacter_GetNpcUID) == 0x000004, "Wrong alignment on RichmanCharacter_GetNpcUID");
static_assert(sizeof(RichmanCharacter_GetNpcUID) == 0x000004, "Wrong size on RichmanCharacter_GetNpcUID");
static_assert(offsetof(RichmanCharacter_GetNpcUID, ReturnValue) == 0x000000, "Member 'RichmanCharacter_GetNpcUID::ReturnValue' has a wrong offset!");

// Function Richman.RichmanCharacter.GetPosition
// 0x000C (0x000C - 0x0000)
struct RichmanCharacter_GetPosition final
{
public:
	struct FIntVector                             ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCharacter_GetPosition) == 0x000004, "Wrong alignment on RichmanCharacter_GetPosition");
static_assert(sizeof(RichmanCharacter_GetPosition) == 0x00000C, "Wrong size on RichmanCharacter_GetPosition");
static_assert(offsetof(RichmanCharacter_GetPosition, ReturnValue) == 0x000000, "Member 'RichmanCharacter_GetPosition::ReturnValue' has a wrong offset!");

// Function Richman.RichmanCharacter.GetRegionId
// 0x0004 (0x0004 - 0x0000)
struct RichmanCharacter_GetRegionId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCharacter_GetRegionId) == 0x000004, "Wrong alignment on RichmanCharacter_GetRegionId");
static_assert(sizeof(RichmanCharacter_GetRegionId) == 0x000004, "Wrong size on RichmanCharacter_GetRegionId");
static_assert(offsetof(RichmanCharacter_GetRegionId, ReturnValue) == 0x000000, "Member 'RichmanCharacter_GetRegionId::ReturnValue' has a wrong offset!");

// Function Richman.RichmanCharacter.GetTeamId
// 0x0004 (0x0004 - 0x0000)
struct RichmanCharacter_GetTeamId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCharacter_GetTeamId) == 0x000004, "Wrong alignment on RichmanCharacter_GetTeamId");
static_assert(sizeof(RichmanCharacter_GetTeamId) == 0x000004, "Wrong size on RichmanCharacter_GetTeamId");
static_assert(offsetof(RichmanCharacter_GetTeamId, ReturnValue) == 0x000000, "Member 'RichmanCharacter_GetTeamId::ReturnValue' has a wrong offset!");

// Function Richman.RichmanCharacter.GotoFlowState
// 0x0001 (0x0001 - 0x0000)
struct RichmanCharacter_GotoFlowState final
{
public:
	ERichmanCharacterState                        InNewState;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCharacter_GotoFlowState) == 0x000001, "Wrong alignment on RichmanCharacter_GotoFlowState");
static_assert(sizeof(RichmanCharacter_GotoFlowState) == 0x000001, "Wrong size on RichmanCharacter_GotoFlowState");
static_assert(offsetof(RichmanCharacter_GotoFlowState, InNewState) == 0x000000, "Member 'RichmanCharacter_GotoFlowState::InNewState' has a wrong offset!");

// Function Richman.RichmanCharacter.IsAnyMontagePlaying
// 0x0001 (0x0001 - 0x0000)
struct RichmanCharacter_IsAnyMontagePlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCharacter_IsAnyMontagePlaying) == 0x000001, "Wrong alignment on RichmanCharacter_IsAnyMontagePlaying");
static_assert(sizeof(RichmanCharacter_IsAnyMontagePlaying) == 0x000001, "Wrong size on RichmanCharacter_IsAnyMontagePlaying");
static_assert(offsetof(RichmanCharacter_IsAnyMontagePlaying, ReturnValue) == 0x000000, "Member 'RichmanCharacter_IsAnyMontagePlaying::ReturnValue' has a wrong offset!");

// Function Richman.RichmanCharacter.MoveTo
// 0x0018 (0x0018 - 0x0000)
struct RichmanCharacter_MoveTo final
{
public:
	class AChessRegion*                           InRegion;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPosX;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPosY;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InUpdate3DPos;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RichmanCharacter_MoveTo) == 0x000008, "Wrong alignment on RichmanCharacter_MoveTo");
static_assert(sizeof(RichmanCharacter_MoveTo) == 0x000018, "Wrong size on RichmanCharacter_MoveTo");
static_assert(offsetof(RichmanCharacter_MoveTo, InRegion) == 0x000000, "Member 'RichmanCharacter_MoveTo::InRegion' has a wrong offset!");
static_assert(offsetof(RichmanCharacter_MoveTo, InPosX) == 0x000008, "Member 'RichmanCharacter_MoveTo::InPosX' has a wrong offset!");
static_assert(offsetof(RichmanCharacter_MoveTo, InPosY) == 0x00000C, "Member 'RichmanCharacter_MoveTo::InPosY' has a wrong offset!");
static_assert(offsetof(RichmanCharacter_MoveTo, InUpdate3DPos) == 0x000010, "Member 'RichmanCharacter_MoveTo::InUpdate3DPos' has a wrong offset!");
static_assert(offsetof(RichmanCharacter_MoveTo, ReturnValue) == 0x000011, "Member 'RichmanCharacter_MoveTo::ReturnValue' has a wrong offset!");

// Function Richman.RichmanCharacter.OnMoveEnd
// 0x0008 (0x0008 - 0x0000)
struct RichmanCharacter_OnMoveEnd final
{
public:
	class ARichman_ChessGround*                   Ground;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCharacter_OnMoveEnd) == 0x000008, "Wrong alignment on RichmanCharacter_OnMoveEnd");
static_assert(sizeof(RichmanCharacter_OnMoveEnd) == 0x000008, "Wrong size on RichmanCharacter_OnMoveEnd");
static_assert(offsetof(RichmanCharacter_OnMoveEnd, Ground) == 0x000000, "Member 'RichmanCharacter_OnMoveEnd::Ground' has a wrong offset!");

// Function Richman.RichmanCharacter.PlayTopEffect
// 0x0004 (0x0004 - 0x0000)
struct RichmanCharacter_PlayTopEffect final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCharacter_PlayTopEffect) == 0x000004, "Wrong alignment on RichmanCharacter_PlayTopEffect");
static_assert(sizeof(RichmanCharacter_PlayTopEffect) == 0x000004, "Wrong size on RichmanCharacter_PlayTopEffect");
static_assert(offsetof(RichmanCharacter_PlayTopEffect, ID) == 0x000000, "Member 'RichmanCharacter_PlayTopEffect::ID' has a wrong offset!");

// Function Richman.RichmanCharacter.SetGroundActor
// 0x0008 (0x0008 - 0x0000)
struct RichmanCharacter_SetGroundActor final
{
public:
	class AChessGround*                           InGroundActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCharacter_SetGroundActor) == 0x000008, "Wrong alignment on RichmanCharacter_SetGroundActor");
static_assert(sizeof(RichmanCharacter_SetGroundActor) == 0x000008, "Wrong size on RichmanCharacter_SetGroundActor");
static_assert(offsetof(RichmanCharacter_SetGroundActor, InGroundActor) == 0x000000, "Member 'RichmanCharacter_SetGroundActor::InGroundActor' has a wrong offset!");

// Function Richman.RichmanCharacter.StartMoving
// 0x0004 (0x0004 - 0x0000)
struct RichmanCharacter_StartMoving final
{
public:
	int32                                         Steps;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanCharacter_StartMoving) == 0x000004, "Wrong alignment on RichmanCharacter_StartMoving");
static_assert(sizeof(RichmanCharacter_StartMoving) == 0x000004, "Wrong size on RichmanCharacter_StartMoving");
static_assert(offsetof(RichmanCharacter_StartMoving, Steps) == 0x000000, "Member 'RichmanCharacter_StartMoving::Steps' has a wrong offset!");

// Function Richman.RichmanGameMode.DestroyEffect
// 0x0004 (0x0004 - 0x0000)
struct RichmanGameMode_DestroyEffect final
{
public:
	int32                                         InEffectId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanGameMode_DestroyEffect) == 0x000004, "Wrong alignment on RichmanGameMode_DestroyEffect");
static_assert(sizeof(RichmanGameMode_DestroyEffect) == 0x000004, "Wrong size on RichmanGameMode_DestroyEffect");
static_assert(offsetof(RichmanGameMode_DestroyEffect, InEffectId) == 0x000000, "Member 'RichmanGameMode_DestroyEffect::InEffectId' has a wrong offset!");

// Function Richman.RichmanGameMode.PlayCustomAnim
// 0x0020 (0x0020 - 0x0000)
struct RichmanGameMode_PlayCustomAnim final
{
public:
	class FString                                 InPath;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TargetActor;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLooping;                                          // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RichmanGameMode_PlayCustomAnim) == 0x000008, "Wrong alignment on RichmanGameMode_PlayCustomAnim");
static_assert(sizeof(RichmanGameMode_PlayCustomAnim) == 0x000020, "Wrong size on RichmanGameMode_PlayCustomAnim");
static_assert(offsetof(RichmanGameMode_PlayCustomAnim, InPath) == 0x000000, "Member 'RichmanGameMode_PlayCustomAnim::InPath' has a wrong offset!");
static_assert(offsetof(RichmanGameMode_PlayCustomAnim, TargetActor) == 0x000010, "Member 'RichmanGameMode_PlayCustomAnim::TargetActor' has a wrong offset!");
static_assert(offsetof(RichmanGameMode_PlayCustomAnim, bLooping) == 0x000018, "Member 'RichmanGameMode_PlayCustomAnim::bLooping' has a wrong offset!");

// Function Richman.RichmanGameMode.PlayEffect
// 0x0030 (0x0030 - 0x0000)
struct RichmanGameMode_PlayEffect final
{
public:
	class FString                                 InPath;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InLocation;                                        // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               InRotate;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          IsPersistent;                                      // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x002C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanGameMode_PlayEffect) == 0x000008, "Wrong alignment on RichmanGameMode_PlayEffect");
static_assert(sizeof(RichmanGameMode_PlayEffect) == 0x000030, "Wrong size on RichmanGameMode_PlayEffect");
static_assert(offsetof(RichmanGameMode_PlayEffect, InPath) == 0x000000, "Member 'RichmanGameMode_PlayEffect::InPath' has a wrong offset!");
static_assert(offsetof(RichmanGameMode_PlayEffect, InLocation) == 0x000010, "Member 'RichmanGameMode_PlayEffect::InLocation' has a wrong offset!");
static_assert(offsetof(RichmanGameMode_PlayEffect, InRotate) == 0x00001C, "Member 'RichmanGameMode_PlayEffect::InRotate' has a wrong offset!");
static_assert(offsetof(RichmanGameMode_PlayEffect, IsPersistent) == 0x000028, "Member 'RichmanGameMode_PlayEffect::IsPersistent' has a wrong offset!");
static_assert(offsetof(RichmanGameMode_PlayEffect, ReturnValue) == 0x00002C, "Member 'RichmanGameMode_PlayEffect::ReturnValue' has a wrong offset!");

// Function Richman.RichmanGameMode.PlayEffectAttached
// 0x0038 (0x0038 - 0x0000)
struct RichmanGameMode_PlayEffectAttached final
{
public:
	class FString                                 InPath;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        AttachToComponent;                                 // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InLocation;                                        // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               InRotate;                                          // 0x0024(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          IsPersistent;                                      // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0034(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanGameMode_PlayEffectAttached) == 0x000008, "Wrong alignment on RichmanGameMode_PlayEffectAttached");
static_assert(sizeof(RichmanGameMode_PlayEffectAttached) == 0x000038, "Wrong size on RichmanGameMode_PlayEffectAttached");
static_assert(offsetof(RichmanGameMode_PlayEffectAttached, InPath) == 0x000000, "Member 'RichmanGameMode_PlayEffectAttached::InPath' has a wrong offset!");
static_assert(offsetof(RichmanGameMode_PlayEffectAttached, AttachToComponent) == 0x000010, "Member 'RichmanGameMode_PlayEffectAttached::AttachToComponent' has a wrong offset!");
static_assert(offsetof(RichmanGameMode_PlayEffectAttached, InLocation) == 0x000018, "Member 'RichmanGameMode_PlayEffectAttached::InLocation' has a wrong offset!");
static_assert(offsetof(RichmanGameMode_PlayEffectAttached, InRotate) == 0x000024, "Member 'RichmanGameMode_PlayEffectAttached::InRotate' has a wrong offset!");
static_assert(offsetof(RichmanGameMode_PlayEffectAttached, IsPersistent) == 0x000030, "Member 'RichmanGameMode_PlayEffectAttached::IsPersistent' has a wrong offset!");
static_assert(offsetof(RichmanGameMode_PlayEffectAttached, ReturnValue) == 0x000034, "Member 'RichmanGameMode_PlayEffectAttached::ReturnValue' has a wrong offset!");

// Function Richman.RichmanGroundSelector.GetAllCanReachGridsByCard
// 0x0020 (0x0020 - 0x0000)
struct RichmanGroundSelector_GetAllCanReachGridsByCard final
{
public:
	class ARichmanCharacter*                      InCharacter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InStep;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FindType;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanGroundSelector_GetAllCanReachGridsByCard) == 0x000008, "Wrong alignment on RichmanGroundSelector_GetAllCanReachGridsByCard");
static_assert(sizeof(RichmanGroundSelector_GetAllCanReachGridsByCard) == 0x000020, "Wrong size on RichmanGroundSelector_GetAllCanReachGridsByCard");
static_assert(offsetof(RichmanGroundSelector_GetAllCanReachGridsByCard, InCharacter) == 0x000000, "Member 'RichmanGroundSelector_GetAllCanReachGridsByCard::InCharacter' has a wrong offset!");
static_assert(offsetof(RichmanGroundSelector_GetAllCanReachGridsByCard, InStep) == 0x000008, "Member 'RichmanGroundSelector_GetAllCanReachGridsByCard::InStep' has a wrong offset!");
static_assert(offsetof(RichmanGroundSelector_GetAllCanReachGridsByCard, FindType) == 0x000010, "Member 'RichmanGroundSelector_GetAllCanReachGridsByCard::FindType' has a wrong offset!");

// Function Richman.RichmanGroundSelector.OnDirGroundSelected
// 0x0004 (0x0004 - 0x0000)
struct RichmanGroundSelector_OnDirGroundSelected final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanGroundSelector_OnDirGroundSelected) == 0x000004, "Wrong alignment on RichmanGroundSelector_OnDirGroundSelected");
static_assert(sizeof(RichmanGroundSelector_OnDirGroundSelected) == 0x000004, "Wrong size on RichmanGroundSelector_OnDirGroundSelected");
static_assert(offsetof(RichmanGroundSelector_OnDirGroundSelected, Index_0) == 0x000000, "Member 'RichmanGroundSelector_OnDirGroundSelected::Index_0' has a wrong offset!");

// Function Richman.RichmanGroundSelector.SelectGroundByIndex
// 0x0004 (0x0004 - 0x0000)
struct RichmanGroundSelector_SelectGroundByIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanGroundSelector_SelectGroundByIndex) == 0x000004, "Wrong alignment on RichmanGroundSelector_SelectGroundByIndex");
static_assert(sizeof(RichmanGroundSelector_SelectGroundByIndex) == 0x000004, "Wrong size on RichmanGroundSelector_SelectGroundByIndex");
static_assert(offsetof(RichmanGroundSelector_SelectGroundByIndex, Index_0) == 0x000000, "Member 'RichmanGroundSelector_SelectGroundByIndex::Index_0' has a wrong offset!");

// Function Richman.RichmanGroundSelector.SetBombOrBarrier
// 0x0010 (0x0010 - 0x0000)
struct RichmanGroundSelector_SetBombOrBarrier final
{
public:
	class ARichmanCharacter*                      InCharacter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InStep;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CleanFlag;                                         // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RichmanGroundSelector_SetBombOrBarrier) == 0x000008, "Wrong alignment on RichmanGroundSelector_SetBombOrBarrier");
static_assert(sizeof(RichmanGroundSelector_SetBombOrBarrier) == 0x000010, "Wrong size on RichmanGroundSelector_SetBombOrBarrier");
static_assert(offsetof(RichmanGroundSelector_SetBombOrBarrier, InCharacter) == 0x000000, "Member 'RichmanGroundSelector_SetBombOrBarrier::InCharacter' has a wrong offset!");
static_assert(offsetof(RichmanGroundSelector_SetBombOrBarrier, InStep) == 0x000008, "Member 'RichmanGroundSelector_SetBombOrBarrier::InStep' has a wrong offset!");
static_assert(offsetof(RichmanGroundSelector_SetBombOrBarrier, CleanFlag) == 0x00000C, "Member 'RichmanGroundSelector_SetBombOrBarrier::CleanFlag' has a wrong offset!");

// Function Richman.RichmanGroundSelector.SetCharacter
// 0x0010 (0x0010 - 0x0000)
struct RichmanGroundSelector_SetCharacter final
{
public:
	class ARichmanCharacter*                      InCharacter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InStep;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RichmanGroundSelector_SetCharacter) == 0x000008, "Wrong alignment on RichmanGroundSelector_SetCharacter");
static_assert(sizeof(RichmanGroundSelector_SetCharacter) == 0x000010, "Wrong size on RichmanGroundSelector_SetCharacter");
static_assert(offsetof(RichmanGroundSelector_SetCharacter, InCharacter) == 0x000000, "Member 'RichmanGroundSelector_SetCharacter::InCharacter' has a wrong offset!");
static_assert(offsetof(RichmanGroundSelector_SetCharacter, InStep) == 0x000008, "Member 'RichmanGroundSelector_SetCharacter::InStep' has a wrong offset!");

// Function Richman.RichmanLibrary.AISelectCardTarget
// 0x0018 (0x0018 - 0x0000)
struct RichmanLibrary_AISelectCardTarget final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanCharacter*                      Character;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanCharacter*                      ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLibrary_AISelectCardTarget) == 0x000008, "Wrong alignment on RichmanLibrary_AISelectCardTarget");
static_assert(sizeof(RichmanLibrary_AISelectCardTarget) == 0x000018, "Wrong size on RichmanLibrary_AISelectCardTarget");
static_assert(offsetof(RichmanLibrary_AISelectCardTarget, InMgr) == 0x000000, "Member 'RichmanLibrary_AISelectCardTarget::InMgr' has a wrong offset!");
static_assert(offsetof(RichmanLibrary_AISelectCardTarget, Character) == 0x000008, "Member 'RichmanLibrary_AISelectCardTarget::Character' has a wrong offset!");
static_assert(offsetof(RichmanLibrary_AISelectCardTarget, ReturnValue) == 0x000010, "Member 'RichmanLibrary_AISelectCardTarget::ReturnValue' has a wrong offset!");

// Function Richman.RichmanLibrary.AISelectCardTargetFromArray
// 0x0028 (0x0028 - 0x0000)
struct RichmanLibrary_AISelectCardTargetFromArray final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanCharacter*                      InCharacter;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ARichmanCharacter*>              CanSelectCharacters;                               // 0x0010(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class ARichmanCharacter*                      ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLibrary_AISelectCardTargetFromArray) == 0x000008, "Wrong alignment on RichmanLibrary_AISelectCardTargetFromArray");
static_assert(sizeof(RichmanLibrary_AISelectCardTargetFromArray) == 0x000028, "Wrong size on RichmanLibrary_AISelectCardTargetFromArray");
static_assert(offsetof(RichmanLibrary_AISelectCardTargetFromArray, InMgr) == 0x000000, "Member 'RichmanLibrary_AISelectCardTargetFromArray::InMgr' has a wrong offset!");
static_assert(offsetof(RichmanLibrary_AISelectCardTargetFromArray, InCharacter) == 0x000008, "Member 'RichmanLibrary_AISelectCardTargetFromArray::InCharacter' has a wrong offset!");
static_assert(offsetof(RichmanLibrary_AISelectCardTargetFromArray, CanSelectCharacters) == 0x000010, "Member 'RichmanLibrary_AISelectCardTargetFromArray::CanSelectCharacters' has a wrong offset!");
static_assert(offsetof(RichmanLibrary_AISelectCardTargetFromArray, ReturnValue) == 0x000020, "Member 'RichmanLibrary_AISelectCardTargetFromArray::ReturnValue' has a wrong offset!");

// Function Richman.RichmanLibrary.ChainExplosion
// 0x0038 (0x0038 - 0x0000)
struct RichmanLibrary_ChainExplosion final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichman_ChessGround*                   Ground;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanCharacter*                      Character;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBombExistData>                 BombExistDatas;                                    // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FBombVictimData>                ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLibrary_ChainExplosion) == 0x000008, "Wrong alignment on RichmanLibrary_ChainExplosion");
static_assert(sizeof(RichmanLibrary_ChainExplosion) == 0x000038, "Wrong size on RichmanLibrary_ChainExplosion");
static_assert(offsetof(RichmanLibrary_ChainExplosion, InMgr) == 0x000000, "Member 'RichmanLibrary_ChainExplosion::InMgr' has a wrong offset!");
static_assert(offsetof(RichmanLibrary_ChainExplosion, Ground) == 0x000008, "Member 'RichmanLibrary_ChainExplosion::Ground' has a wrong offset!");
static_assert(offsetof(RichmanLibrary_ChainExplosion, Character) == 0x000010, "Member 'RichmanLibrary_ChainExplosion::Character' has a wrong offset!");
static_assert(offsetof(RichmanLibrary_ChainExplosion, BombExistDatas) == 0x000018, "Member 'RichmanLibrary_ChainExplosion::BombExistDatas' has a wrong offset!");
static_assert(offsetof(RichmanLibrary_ChainExplosion, ReturnValue) == 0x000028, "Member 'RichmanLibrary_ChainExplosion::ReturnValue' has a wrong offset!");

// Function Richman.RichmanLibrary.ChainExplosion_Nearest
// 0x0038 (0x0038 - 0x0000)
struct RichmanLibrary_ChainExplosion_Nearest final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichman_ChessGround*                   Ground;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanCharacter*                      Character;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBombExistData>                 BombExistDatas;                                    // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
