#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RichmanOL

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "RichmanOL_structs.hpp"


namespace SDK::Params
{

// Function RichmanOL.RichmanOL_AIController.GetCurrentChar
// 0x0008 (0x0008 - 0x0000)
struct RichmanOL_AIController_GetCurrentChar final
{
public:
	class ARichmanOL_Character*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_AIController_GetCurrentChar) == 0x000008, "Wrong alignment on RichmanOL_AIController_GetCurrentChar");
static_assert(sizeof(RichmanOL_AIController_GetCurrentChar) == 0x000008, "Wrong size on RichmanOL_AIController_GetCurrentChar");
static_assert(offsetof(RichmanOL_AIController_GetCurrentChar, ReturnValue) == 0x000000, "Member 'RichmanOL_AIController_GetCurrentChar::ReturnValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_CameraFollow.CheckAutoFollowComplete
// 0x0001 (0x0001 - 0x0000)
struct RichmanOL_CameraFollow_CheckAutoFollowComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_CameraFollow_CheckAutoFollowComplete) == 0x000001, "Wrong alignment on RichmanOL_CameraFollow_CheckAutoFollowComplete");
static_assert(sizeof(RichmanOL_CameraFollow_CheckAutoFollowComplete) == 0x000001, "Wrong size on RichmanOL_CameraFollow_CheckAutoFollowComplete");
static_assert(offsetof(RichmanOL_CameraFollow_CheckAutoFollowComplete, ReturnValue) == 0x000000, "Member 'RichmanOL_CameraFollow_CheckAutoFollowComplete::ReturnValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_CameraFollow.GetLockControl
// 0x0001 (0x0001 - 0x0000)
struct RichmanOL_CameraFollow_GetLockControl final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_CameraFollow_GetLockControl) == 0x000001, "Wrong alignment on RichmanOL_CameraFollow_GetLockControl");
static_assert(sizeof(RichmanOL_CameraFollow_GetLockControl) == 0x000001, "Wrong size on RichmanOL_CameraFollow_GetLockControl");
static_assert(offsetof(RichmanOL_CameraFollow_GetLockControl, ReturnValue) == 0x000000, "Member 'RichmanOL_CameraFollow_GetLockControl::ReturnValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_CameraFollow.IsSlidingView
// 0x0001 (0x0001 - 0x0000)
struct RichmanOL_CameraFollow_IsSlidingView final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_CameraFollow_IsSlidingView) == 0x000001, "Wrong alignment on RichmanOL_CameraFollow_IsSlidingView");
static_assert(sizeof(RichmanOL_CameraFollow_IsSlidingView) == 0x000001, "Wrong size on RichmanOL_CameraFollow_IsSlidingView");
static_assert(offsetof(RichmanOL_CameraFollow_IsSlidingView, ReturnValue) == 0x000000, "Member 'RichmanOL_CameraFollow_IsSlidingView::ReturnValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_CameraFollow.OnMouseMove
// 0x0008 (0x0008 - 0x0000)
struct RichmanOL_CameraFollow_OnMouseMove final
{
public:
	struct FVector2D                              DeltaPos;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_CameraFollow_OnMouseMove) == 0x000004, "Wrong alignment on RichmanOL_CameraFollow_OnMouseMove");
static_assert(sizeof(RichmanOL_CameraFollow_OnMouseMove) == 0x000008, "Wrong size on RichmanOL_CameraFollow_OnMouseMove");
static_assert(offsetof(RichmanOL_CameraFollow_OnMouseMove, DeltaPos) == 0x000000, "Member 'RichmanOL_CameraFollow_OnMouseMove::DeltaPos' has a wrong offset!");

// Function RichmanOL.RichmanOL_CameraFollow.OnZoomChange
// 0x0004 (0x0004 - 0x0000)
struct RichmanOL_CameraFollow_OnZoomChange final
{
public:
	float                                         InZoom;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_CameraFollow_OnZoomChange) == 0x000004, "Wrong alignment on RichmanOL_CameraFollow_OnZoomChange");
static_assert(sizeof(RichmanOL_CameraFollow_OnZoomChange) == 0x000004, "Wrong size on RichmanOL_CameraFollow_OnZoomChange");
static_assert(offsetof(RichmanOL_CameraFollow_OnZoomChange, InZoom) == 0x000000, "Member 'RichmanOL_CameraFollow_OnZoomChange::InZoom' has a wrong offset!");

// Function RichmanOL.RichmanOL_CameraFollow.PlayReturnAnim
// 0x0004 (0x0004 - 0x0000)
struct RichmanOL_CameraFollow_PlayReturnAnim final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_CameraFollow_PlayReturnAnim) == 0x000004, "Wrong alignment on RichmanOL_CameraFollow_PlayReturnAnim");
static_assert(sizeof(RichmanOL_CameraFollow_PlayReturnAnim) == 0x000004, "Wrong size on RichmanOL_CameraFollow_PlayReturnAnim");
static_assert(offsetof(RichmanOL_CameraFollow_PlayReturnAnim, Duration) == 0x000000, "Member 'RichmanOL_CameraFollow_PlayReturnAnim::Duration' has a wrong offset!");

// Function RichmanOL.RichmanOL_CameraFollow.RefreshCameraRange
// 0x0008 (0x0008 - 0x0000)
struct RichmanOL_CameraFollow_RefreshCameraRange final
{
public:
	class AChessRegion*                           Region;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_CameraFollow_RefreshCameraRange) == 0x000008, "Wrong alignment on RichmanOL_CameraFollow_RefreshCameraRange");
static_assert(sizeof(RichmanOL_CameraFollow_RefreshCameraRange) == 0x000008, "Wrong size on RichmanOL_CameraFollow_RefreshCameraRange");
static_assert(offsetof(RichmanOL_CameraFollow_RefreshCameraRange, Region) == 0x000000, "Member 'RichmanOL_CameraFollow_RefreshCameraRange::Region' has a wrong offset!");

// Function RichmanOL.RichmanOL_CameraFollow.SetCameraShowTarget
// 0x0008 (0x0008 - 0x0000)
struct RichmanOL_CameraFollow_SetCameraShowTarget final
{
public:
	class AActor*                                 InTarget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_CameraFollow_SetCameraShowTarget) == 0x000008, "Wrong alignment on RichmanOL_CameraFollow_SetCameraShowTarget");
static_assert(sizeof(RichmanOL_CameraFollow_SetCameraShowTarget) == 0x000008, "Wrong size on RichmanOL_CameraFollow_SetCameraShowTarget");
static_assert(offsetof(RichmanOL_CameraFollow_SetCameraShowTarget, InTarget) == 0x000000, "Member 'RichmanOL_CameraFollow_SetCameraShowTarget::InTarget' has a wrong offset!");

// Function RichmanOL.RichmanOL_CameraFollow.SetFollowTarget
// 0x0010 (0x0010 - 0x0000)
struct RichmanOL_CameraFollow_SetFollowTarget final
{
public:
	class AActor*                                 InCharacter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Immediately;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RichmanOL_CameraFollow_SetFollowTarget) == 0x000008, "Wrong alignment on RichmanOL_CameraFollow_SetFollowTarget");
static_assert(sizeof(RichmanOL_CameraFollow_SetFollowTarget) == 0x000010, "Wrong size on RichmanOL_CameraFollow_SetFollowTarget");
static_assert(offsetof(RichmanOL_CameraFollow_SetFollowTarget, InCharacter) == 0x000000, "Member 'RichmanOL_CameraFollow_SetFollowTarget::InCharacter' has a wrong offset!");
static_assert(offsetof(RichmanOL_CameraFollow_SetFollowTarget, Immediately) == 0x000008, "Member 'RichmanOL_CameraFollow_SetFollowTarget::Immediately' has a wrong offset!");

// Function RichmanOL.RichmanOL_CameraFollow.SetLockControl
// 0x0001 (0x0001 - 0x0000)
struct RichmanOL_CameraFollow_SetLockControl final
{
public:
	bool                                          InLockControl;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_CameraFollow_SetLockControl) == 0x000001, "Wrong alignment on RichmanOL_CameraFollow_SetLockControl");
static_assert(sizeof(RichmanOL_CameraFollow_SetLockControl) == 0x000001, "Wrong size on RichmanOL_CameraFollow_SetLockControl");
static_assert(offsetof(RichmanOL_CameraFollow_SetLockControl, InLockControl) == 0x000000, "Member 'RichmanOL_CameraFollow_SetLockControl::InLockControl' has a wrong offset!");

// Function RichmanOL.RichmanOL_CameraFollow.SetSlidingView
// 0x0001 (0x0001 - 0x0000)
struct RichmanOL_CameraFollow_SetSlidingView final
{
public:
	bool                                          bSlid;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_CameraFollow_SetSlidingView) == 0x000001, "Wrong alignment on RichmanOL_CameraFollow_SetSlidingView");
static_assert(sizeof(RichmanOL_CameraFollow_SetSlidingView) == 0x000001, "Wrong size on RichmanOL_CameraFollow_SetSlidingView");
static_assert(offsetof(RichmanOL_CameraFollow_SetSlidingView, bSlid) == 0x000000, "Member 'RichmanOL_CameraFollow_SetSlidingView::bSlid' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.AddCharge
// 0x0004 (0x0004 - 0x0000)
struct RichmanOL_Character_AddCharge final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_AddCharge) == 0x000004, "Wrong alignment on RichmanOL_Character_AddCharge");
static_assert(sizeof(RichmanOL_Character_AddCharge) == 0x000004, "Wrong size on RichmanOL_Character_AddCharge");
static_assert(offsetof(RichmanOL_Character_AddCharge, InValue) == 0x000000, "Member 'RichmanOL_Character_AddCharge::InValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.AddEffect
// 0x0014 (0x0014 - 0x0000)
struct RichmanOL_Character_AddEffect final
{
public:
	struct FRichmanOL_SkillEffect                 Effect;                                            // 0x0000(0x0014)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_AddEffect) == 0x000004, "Wrong alignment on RichmanOL_Character_AddEffect");
static_assert(sizeof(RichmanOL_Character_AddEffect) == 0x000014, "Wrong size on RichmanOL_Character_AddEffect");
static_assert(offsetof(RichmanOL_Character_AddEffect, Effect) == 0x000000, "Member 'RichmanOL_Character_AddEffect::Effect' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.AddMoney
// 0x0008 (0x0008 - 0x0000)
struct RichmanOL_Character_AddMoney final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RichmanOL_Character_AddMoney) == 0x000004, "Wrong alignment on RichmanOL_Character_AddMoney");
static_assert(sizeof(RichmanOL_Character_AddMoney) == 0x000008, "Wrong size on RichmanOL_Character_AddMoney");
static_assert(offsetof(RichmanOL_Character_AddMoney, InValue) == 0x000000, "Member 'RichmanOL_Character_AddMoney::InValue' has a wrong offset!");
static_assert(offsetof(RichmanOL_Character_AddMoney, ReturnValue) == 0x000004, "Member 'RichmanOL_Character_AddMoney::ReturnValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.ForceSetSkillActive
// 0x0008 (0x0008 - 0x0000)
struct RichmanOL_Character_ForceSetSkillActive final
{
public:
	int32                                         InSkillId;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InValue;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RichmanOL_Character_ForceSetSkillActive) == 0x000004, "Wrong alignment on RichmanOL_Character_ForceSetSkillActive");
static_assert(sizeof(RichmanOL_Character_ForceSetSkillActive) == 0x000008, "Wrong size on RichmanOL_Character_ForceSetSkillActive");
static_assert(offsetof(RichmanOL_Character_ForceSetSkillActive, InSkillId) == 0x000000, "Member 'RichmanOL_Character_ForceSetSkillActive::InSkillId' has a wrong offset!");
static_assert(offsetof(RichmanOL_Character_ForceSetSkillActive, InValue) == 0x000004, "Member 'RichmanOL_Character_ForceSetSkillActive::InValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.GetHeadIconId
// 0x0010 (0x0010 - 0x0000)
struct RichmanOL_Character_GetHeadIconId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_GetHeadIconId) == 0x000008, "Wrong alignment on RichmanOL_Character_GetHeadIconId");
static_assert(sizeof(RichmanOL_Character_GetHeadIconId) == 0x000010, "Wrong size on RichmanOL_Character_GetHeadIconId");
static_assert(offsetof(RichmanOL_Character_GetHeadIconId, ReturnValue) == 0x000000, "Member 'RichmanOL_Character_GetHeadIconId::ReturnValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.GetLangNameKey
// 0x0010 (0x0010 - 0x0000)
struct RichmanOL_Character_GetLangNameKey final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_GetLangNameKey) == 0x000008, "Wrong alignment on RichmanOL_Character_GetLangNameKey");
static_assert(sizeof(RichmanOL_Character_GetLangNameKey) == 0x000010, "Wrong size on RichmanOL_Character_GetLangNameKey");
static_assert(offsetof(RichmanOL_Character_GetLangNameKey, ReturnValue) == 0x000000, "Member 'RichmanOL_Character_GetLangNameKey::ReturnValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.GetNpcUID
// 0x0004 (0x0004 - 0x0000)
struct RichmanOL_Character_GetNpcUID final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_GetNpcUID) == 0x000004, "Wrong alignment on RichmanOL_Character_GetNpcUID");
static_assert(sizeof(RichmanOL_Character_GetNpcUID) == 0x000004, "Wrong size on RichmanOL_Character_GetNpcUID");
static_assert(offsetof(RichmanOL_Character_GetNpcUID, ReturnValue) == 0x000000, "Member 'RichmanOL_Character_GetNpcUID::ReturnValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.GetPosition
// 0x000C (0x000C - 0x0000)
struct RichmanOL_Character_GetPosition final
{
public:
	struct FIntVector                             ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_GetPosition) == 0x000004, "Wrong alignment on RichmanOL_Character_GetPosition");
static_assert(sizeof(RichmanOL_Character_GetPosition) == 0x00000C, "Wrong size on RichmanOL_Character_GetPosition");
static_assert(offsetof(RichmanOL_Character_GetPosition, ReturnValue) == 0x000000, "Member 'RichmanOL_Character_GetPosition::ReturnValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.GetRegionId
// 0x0004 (0x0004 - 0x0000)
struct RichmanOL_Character_GetRegionId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_GetRegionId) == 0x000004, "Wrong alignment on RichmanOL_Character_GetRegionId");
static_assert(sizeof(RichmanOL_Character_GetRegionId) == 0x000004, "Wrong size on RichmanOL_Character_GetRegionId");
static_assert(offsetof(RichmanOL_Character_GetRegionId, ReturnValue) == 0x000000, "Member 'RichmanOL_Character_GetRegionId::ReturnValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.GetStarValue
// 0x0008 (0x0008 - 0x0000)
struct RichmanOL_Character_GetStarValue final
{
public:
	int32                                         Idx;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_GetStarValue) == 0x000004, "Wrong alignment on RichmanOL_Character_GetStarValue");
static_assert(sizeof(RichmanOL_Character_GetStarValue) == 0x000008, "Wrong size on RichmanOL_Character_GetStarValue");
static_assert(offsetof(RichmanOL_Character_GetStarValue, Idx) == 0x000000, "Member 'RichmanOL_Character_GetStarValue::Idx' has a wrong offset!");
static_assert(offsetof(RichmanOL_Character_GetStarValue, ReturnValue) == 0x000004, "Member 'RichmanOL_Character_GetStarValue::ReturnValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.HasActiveEffect
// 0x0014 (0x0014 - 0x0000)
struct RichmanOL_Character_HasActiveEffect final
{
public:
	class FName                                   EffectName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InSkillId;                                         // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InParam;                                           // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RichmanOL_Character_HasActiveEffect) == 0x000004, "Wrong alignment on RichmanOL_Character_HasActiveEffect");
static_assert(sizeof(RichmanOL_Character_HasActiveEffect) == 0x000014, "Wrong size on RichmanOL_Character_HasActiveEffect");
static_assert(offsetof(RichmanOL_Character_HasActiveEffect, EffectName) == 0x000000, "Member 'RichmanOL_Character_HasActiveEffect::EffectName' has a wrong offset!");
static_assert(offsetof(RichmanOL_Character_HasActiveEffect, InSkillId) == 0x000008, "Member 'RichmanOL_Character_HasActiveEffect::InSkillId' has a wrong offset!");
static_assert(offsetof(RichmanOL_Character_HasActiveEffect, InParam) == 0x00000C, "Member 'RichmanOL_Character_HasActiveEffect::InParam' has a wrong offset!");
static_assert(offsetof(RichmanOL_Character_HasActiveEffect, ReturnValue) == 0x000010, "Member 'RichmanOL_Character_HasActiveEffect::ReturnValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.HasEffectByName
// 0x000C (0x000C - 0x0000)
struct RichmanOL_Character_HasEffectByName final
{
public:
	class FName                                   EffectName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RichmanOL_Character_HasEffectByName) == 0x000004, "Wrong alignment on RichmanOL_Character_HasEffectByName");
static_assert(sizeof(RichmanOL_Character_HasEffectByName) == 0x00000C, "Wrong size on RichmanOL_Character_HasEffectByName");
static_assert(offsetof(RichmanOL_Character_HasEffectByName, EffectName) == 0x000000, "Member 'RichmanOL_Character_HasEffectByName::EffectName' has a wrong offset!");
static_assert(offsetof(RichmanOL_Character_HasEffectByName, ReturnValue) == 0x000008, "Member 'RichmanOL_Character_HasEffectByName::ReturnValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.LuaImpl_NotifyInIslandChanged
// 0x0001 (0x0001 - 0x0000)
struct RichmanOL_Character_LuaImpl_NotifyInIslandChanged final
{
public:
	bool                                          InValue;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_LuaImpl_NotifyInIslandChanged) == 0x000001, "Wrong alignment on RichmanOL_Character_LuaImpl_NotifyInIslandChanged");
static_assert(sizeof(RichmanOL_Character_LuaImpl_NotifyInIslandChanged) == 0x000001, "Wrong size on RichmanOL_Character_LuaImpl_NotifyInIslandChanged");
static_assert(offsetof(RichmanOL_Character_LuaImpl_NotifyInIslandChanged, InValue) == 0x000000, "Member 'RichmanOL_Character_LuaImpl_NotifyInIslandChanged::InValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.LuaImpl_NotifyInitSkills
// 0x0040 (0x0040 - 0x0000)
struct RichmanOL_Character_LuaImpl_NotifyInitSkills final
{
public:
	struct FRichmanOL_PlayerData                  InData;                                            // 0x0000(0x0040)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_LuaImpl_NotifyInitSkills) == 0x000008, "Wrong alignment on RichmanOL_Character_LuaImpl_NotifyInitSkills");
static_assert(sizeof(RichmanOL_Character_LuaImpl_NotifyInitSkills) == 0x000040, "Wrong size on RichmanOL_Character_LuaImpl_NotifyInitSkills");
static_assert(offsetof(RichmanOL_Character_LuaImpl_NotifyInitSkills, InData) == 0x000000, "Member 'RichmanOL_Character_LuaImpl_NotifyInitSkills::InData' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.LuaImpl_NotifyMoveEnd
// 0x0008 (0x0008 - 0x0000)
struct RichmanOL_Character_LuaImpl_NotifyMoveEnd final
{
public:
	class ARichmanOL_ChessGround*                 InGround;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_LuaImpl_NotifyMoveEnd) == 0x000008, "Wrong alignment on RichmanOL_Character_LuaImpl_NotifyMoveEnd");
static_assert(sizeof(RichmanOL_Character_LuaImpl_NotifyMoveEnd) == 0x000008, "Wrong size on RichmanOL_Character_LuaImpl_NotifyMoveEnd");
static_assert(offsetof(RichmanOL_Character_LuaImpl_NotifyMoveEnd, InGround) == 0x000000, "Member 'RichmanOL_Character_LuaImpl_NotifyMoveEnd::InGround' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.Multicast_DoExpression
// 0x0008 (0x0008 - 0x0000)
struct RichmanOL_Character_Multicast_DoExpression final
{
public:
	int32                                         ExpressionId;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InRoleID;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_Multicast_DoExpression) == 0x000004, "Wrong alignment on RichmanOL_Character_Multicast_DoExpression");
static_assert(sizeof(RichmanOL_Character_Multicast_DoExpression) == 0x000008, "Wrong size on RichmanOL_Character_Multicast_DoExpression");
static_assert(offsetof(RichmanOL_Character_Multicast_DoExpression, ExpressionId) == 0x000000, "Member 'RichmanOL_Character_Multicast_DoExpression::ExpressionId' has a wrong offset!");
static_assert(offsetof(RichmanOL_Character_Multicast_DoExpression, InRoleID) == 0x000004, "Member 'RichmanOL_Character_Multicast_DoExpression::InRoleID' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.NotifyEffectStage
// 0x0018 (0x0018 - 0x0000)
struct RichmanOL_Character_NotifyEffectStage final
{
public:
	ERichmanOL_FlowStage                          InStage;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Effective;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_NotifyEffectStage) == 0x000008, "Wrong alignment on RichmanOL_Character_NotifyEffectStage");
static_assert(sizeof(RichmanOL_Character_NotifyEffectStage) == 0x000018, "Wrong size on RichmanOL_Character_NotifyEffectStage");
static_assert(offsetof(RichmanOL_Character_NotifyEffectStage, InStage) == 0x000000, "Member 'RichmanOL_Character_NotifyEffectStage::InStage' has a wrong offset!");
static_assert(offsetof(RichmanOL_Character_NotifyEffectStage, Effective) == 0x000004, "Member 'RichmanOL_Character_NotifyEffectStage::Effective' has a wrong offset!");
static_assert(offsetof(RichmanOL_Character_NotifyEffectStage, ReturnValue) == 0x000008, "Member 'RichmanOL_Character_NotifyEffectStage::ReturnValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.PlayTopEffect
// 0x0004 (0x0004 - 0x0000)
struct RichmanOL_Character_PlayTopEffect final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_PlayTopEffect) == 0x000004, "Wrong alignment on RichmanOL_Character_PlayTopEffect");
static_assert(sizeof(RichmanOL_Character_PlayTopEffect) == 0x000004, "Wrong size on RichmanOL_Character_PlayTopEffect");
static_assert(offsetof(RichmanOL_Character_PlayTopEffect, ID) == 0x000000, "Member 'RichmanOL_Character_PlayTopEffect::ID' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.RemoveEffectByName
// 0x0008 (0x0008 - 0x0000)
struct RichmanOL_Character_RemoveEffectByName final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_RemoveEffectByName) == 0x000004, "Wrong alignment on RichmanOL_Character_RemoveEffectByName");
static_assert(sizeof(RichmanOL_Character_RemoveEffectByName) == 0x000008, "Wrong size on RichmanOL_Character_RemoveEffectByName");
static_assert(offsetof(RichmanOL_Character_RemoveEffectByName, InName) == 0x000000, "Member 'RichmanOL_Character_RemoveEffectByName::InName' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.RemoveEffectBySkillId
// 0x0004 (0x0004 - 0x0000)
struct RichmanOL_Character_RemoveEffectBySkillId final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_RemoveEffectBySkillId) == 0x000004, "Wrong alignment on RichmanOL_Character_RemoveEffectBySkillId");
static_assert(sizeof(RichmanOL_Character_RemoveEffectBySkillId) == 0x000004, "Wrong size on RichmanOL_Character_RemoveEffectBySkillId");
static_assert(offsetof(RichmanOL_Character_RemoveEffectBySkillId, SkillID) == 0x000000, "Member 'RichmanOL_Character_RemoveEffectBySkillId::SkillID' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.SetActionId
// 0x0004 (0x0004 - 0x0000)
struct RichmanOL_Character_SetActionId final
{
public:
	int32                                         InActionId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_SetActionId) == 0x000004, "Wrong alignment on RichmanOL_Character_SetActionId");
static_assert(sizeof(RichmanOL_Character_SetActionId) == 0x000004, "Wrong size on RichmanOL_Character_SetActionId");
static_assert(offsetof(RichmanOL_Character_SetActionId, InActionId) == 0x000000, "Member 'RichmanOL_Character_SetActionId::InActionId' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.SetAutoPlay
// 0x0001 (0x0001 - 0x0000)
struct RichmanOL_Character_SetAutoPlay final
{
public:
	bool                                          InValue;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_SetAutoPlay) == 0x000001, "Wrong alignment on RichmanOL_Character_SetAutoPlay");
static_assert(sizeof(RichmanOL_Character_SetAutoPlay) == 0x000001, "Wrong size on RichmanOL_Character_SetAutoPlay");
static_assert(offsetof(RichmanOL_Character_SetAutoPlay, InValue) == 0x000000, "Member 'RichmanOL_Character_SetAutoPlay::InValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.SetBitFlag
// 0x0004 (0x0004 - 0x0000)
struct RichmanOL_Character_SetBitFlag final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_SetBitFlag) == 0x000004, "Wrong alignment on RichmanOL_Character_SetBitFlag");
static_assert(sizeof(RichmanOL_Character_SetBitFlag) == 0x000004, "Wrong size on RichmanOL_Character_SetBitFlag");
static_assert(offsetof(RichmanOL_Character_SetBitFlag, InValue) == 0x000000, "Member 'RichmanOL_Character_SetBitFlag::InValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.SetBuildScore
// 0x0004 (0x0004 - 0x0000)
struct RichmanOL_Character_SetBuildScore final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_SetBuildScore) == 0x000004, "Wrong alignment on RichmanOL_Character_SetBuildScore");
static_assert(sizeof(RichmanOL_Character_SetBuildScore) == 0x000004, "Wrong size on RichmanOL_Character_SetBuildScore");
static_assert(offsetof(RichmanOL_Character_SetBuildScore, InValue) == 0x000000, "Member 'RichmanOL_Character_SetBuildScore::InValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.SetCharge
// 0x0004 (0x0004 - 0x0000)
struct RichmanOL_Character_SetCharge final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_SetCharge) == 0x000004, "Wrong alignment on RichmanOL_Character_SetCharge");
static_assert(sizeof(RichmanOL_Character_SetCharge) == 0x000004, "Wrong size on RichmanOL_Character_SetCharge");
static_assert(offsetof(RichmanOL_Character_SetCharge, InValue) == 0x000000, "Member 'RichmanOL_Character_SetCharge::InValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.SetCurrentUseCardId
// 0x0004 (0x0004 - 0x0000)
struct RichmanOL_Character_SetCurrentUseCardId final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_SetCurrentUseCardId) == 0x000004, "Wrong alignment on RichmanOL_Character_SetCurrentUseCardId");
static_assert(sizeof(RichmanOL_Character_SetCurrentUseCardId) == 0x000004, "Wrong size on RichmanOL_Character_SetCurrentUseCardId");
static_assert(offsetof(RichmanOL_Character_SetCurrentUseCardId, InValue) == 0x000000, "Member 'RichmanOL_Character_SetCurrentUseCardId::InValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.SetDebugSkillRate
// 0x0004 (0x0004 - 0x0000)
struct RichmanOL_Character_SetDebugSkillRate final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_SetDebugSkillRate) == 0x000004, "Wrong alignment on RichmanOL_Character_SetDebugSkillRate");
static_assert(sizeof(RichmanOL_Character_SetDebugSkillRate) == 0x000004, "Wrong size on RichmanOL_Character_SetDebugSkillRate");
static_assert(offsetof(RichmanOL_Character_SetDebugSkillRate, InValue) == 0x000000, "Member 'RichmanOL_Character_SetDebugSkillRate::InValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.SetGroundActor
// 0x0008 (0x0008 - 0x0000)
struct RichmanOL_Character_SetGroundActor final
{
public:
	class AChessGround*                           InGroundActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_SetGroundActor) == 0x000008, "Wrong alignment on RichmanOL_Character_SetGroundActor");
static_assert(sizeof(RichmanOL_Character_SetGroundActor) == 0x000008, "Wrong size on RichmanOL_Character_SetGroundActor");
static_assert(offsetof(RichmanOL_Character_SetGroundActor, InGroundActor) == 0x000000, "Member 'RichmanOL_Character_SetGroundActor::InGroundActor' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.SetGuessIndex
// 0x0004 (0x0004 - 0x0000)
struct RichmanOL_Character_SetGuessIndex final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_SetGuessIndex) == 0x000004, "Wrong alignment on RichmanOL_Character_SetGuessIndex");
static_assert(sizeof(RichmanOL_Character_SetGuessIndex) == 0x000004, "Wrong size on RichmanOL_Character_SetGuessIndex");
static_assert(offsetof(RichmanOL_Character_SetGuessIndex, InValue) == 0x000000, "Member 'RichmanOL_Character_SetGuessIndex::InValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.SetGuessValue
// 0x0004 (0x0004 - 0x0000)
struct RichmanOL_Character_SetGuessValue final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_SetGuessValue) == 0x000004, "Wrong alignment on RichmanOL_Character_SetGuessValue");
static_assert(sizeof(RichmanOL_Character_SetGuessValue) == 0x000004, "Wrong size on RichmanOL_Character_SetGuessValue");
static_assert(offsetof(RichmanOL_Character_SetGuessValue, InValue) == 0x000000, "Member 'RichmanOL_Character_SetGuessValue::InValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.SetInIsland
// 0x0001 (0x0001 - 0x0000)
struct RichmanOL_Character_SetInIsland final
{
public:
	bool                                          InValue;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_SetInIsland) == 0x000001, "Wrong alignment on RichmanOL_Character_SetInIsland");
static_assert(sizeof(RichmanOL_Character_SetInIsland) == 0x000001, "Wrong size on RichmanOL_Character_SetInIsland");
static_assert(offsetof(RichmanOL_Character_SetInIsland, InValue) == 0x000000, "Member 'RichmanOL_Character_SetInIsland::InValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.SetInOperation
// 0x0001 (0x0001 - 0x0000)
struct RichmanOL_Character_SetInOperation final
{
public:
	bool                                          InValue;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_SetInOperation) == 0x000001, "Wrong alignment on RichmanOL_Character_SetInOperation");
static_assert(sizeof(RichmanOL_Character_SetInOperation) == 0x000001, "Wrong size on RichmanOL_Character_SetInOperation");
static_assert(offsetof(RichmanOL_Character_SetInOperation, InValue) == 0x000000, "Member 'RichmanOL_Character_SetInOperation::InValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.SetMaxCharge
// 0x0004 (0x0004 - 0x0000)
struct RichmanOL_Character_SetMaxCharge final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_SetMaxCharge) == 0x000004, "Wrong alignment on RichmanOL_Character_SetMaxCharge");
static_assert(sizeof(RichmanOL_Character_SetMaxCharge) == 0x000004, "Wrong size on RichmanOL_Character_SetMaxCharge");
static_assert(offsetof(RichmanOL_Character_SetMaxCharge, InValue) == 0x000000, "Member 'RichmanOL_Character_SetMaxCharge::InValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.SetMoney
// 0x0004 (0x0004 - 0x0000)
struct RichmanOL_Character_SetMoney final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_SetMoney) == 0x000004, "Wrong alignment on RichmanOL_Character_SetMoney");
static_assert(sizeof(RichmanOL_Character_SetMoney) == 0x000004, "Wrong size on RichmanOL_Character_SetMoney");
static_assert(offsetof(RichmanOL_Character_SetMoney, InValue) == 0x000000, "Member 'RichmanOL_Character_SetMoney::InValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.SetSkillIds
// 0x0010 (0x0010 - 0x0000)
struct RichmanOL_Character_SetSkillIds final
{
public:
	TArray<int32>                                 InValue;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_SetSkillIds) == 0x000008, "Wrong alignment on RichmanOL_Character_SetSkillIds");
static_assert(sizeof(RichmanOL_Character_SetSkillIds) == 0x000010, "Wrong size on RichmanOL_Character_SetSkillIds");
static_assert(offsetof(RichmanOL_Character_SetSkillIds, InValue) == 0x000000, "Member 'RichmanOL_Character_SetSkillIds::InValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.SetStarValue
// 0x0008 (0x0008 - 0x0000)
struct RichmanOL_Character_SetStarValue final
{
public:
	int32                                         Idx;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_SetStarValue) == 0x000004, "Wrong alignment on RichmanOL_Character_SetStarValue");
static_assert(sizeof(RichmanOL_Character_SetStarValue) == 0x000008, "Wrong size on RichmanOL_Character_SetStarValue");
static_assert(offsetof(RichmanOL_Character_SetStarValue, Idx) == 0x000000, "Member 'RichmanOL_Character_SetStarValue::Idx' has a wrong offset!");
static_assert(offsetof(RichmanOL_Character_SetStarValue, Value) == 0x000004, "Member 'RichmanOL_Character_SetStarValue::Value' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.SetStateCode
// 0x0004 (0x0004 - 0x0000)
struct RichmanOL_Character_SetStateCode final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_SetStateCode) == 0x000004, "Wrong alignment on RichmanOL_Character_SetStateCode");
static_assert(sizeof(RichmanOL_Character_SetStateCode) == 0x000004, "Wrong size on RichmanOL_Character_SetStateCode");
static_assert(offsetof(RichmanOL_Character_SetStateCode, InValue) == 0x000000, "Member 'RichmanOL_Character_SetStateCode::InValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.StartMoving
// 0x0004 (0x0004 - 0x0000)
struct RichmanOL_Character_StartMoving final
{
public:
	int32                                         Steps;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_StartMoving) == 0x000004, "Wrong alignment on RichmanOL_Character_StartMoving");
static_assert(sizeof(RichmanOL_Character_StartMoving) == 0x000004, "Wrong size on RichmanOL_Character_StartMoving");
static_assert(offsetof(RichmanOL_Character_StartMoving, Steps) == 0x000000, "Member 'RichmanOL_Character_StartMoving::Steps' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.Teleport
// 0x0008 (0x0008 - 0x0000)
struct RichmanOL_Character_Teleport final
{
public:
	class ARichmanOL_ChessGround*                 InDestGround;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_Teleport) == 0x000008, "Wrong alignment on RichmanOL_Character_Teleport");
static_assert(sizeof(RichmanOL_Character_Teleport) == 0x000008, "Wrong size on RichmanOL_Character_Teleport");
static_assert(offsetof(RichmanOL_Character_Teleport, InDestGround) == 0x000000, "Member 'RichmanOL_Character_Teleport::InDestGround' has a wrong offset!");

// Function RichmanOL.RichmanOL_Character.UpdateWalkState
// 0x0002 (0x0002 - 0x0000)
struct RichmanOL_Character_UpdateWalkState final
{
public:
	bool                                          IsRun_0;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsWalk_0;                                          // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_Character_UpdateWalkState) == 0x000001, "Wrong alignment on RichmanOL_Character_UpdateWalkState");
static_assert(sizeof(RichmanOL_Character_UpdateWalkState) == 0x000002, "Wrong size on RichmanOL_Character_UpdateWalkState");
static_assert(offsetof(RichmanOL_Character_UpdateWalkState, IsRun_0) == 0x000000, "Member 'RichmanOL_Character_UpdateWalkState::IsRun_0' has a wrong offset!");
static_assert(offsetof(RichmanOL_Character_UpdateWalkState, IsWalk_0) == 0x000001, "Member 'RichmanOL_Character_UpdateWalkState::IsWalk_0' has a wrong offset!");

// Function RichmanOL.RichmanOL_ChessGround.CheckObjectHasTag
// 0x0018 (0x0018 - 0x0000)
struct RichmanOL_ChessGround_CheckObjectHasTag final
{
public:
	class FString                                 InTagName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RichmanOL_ChessGround_CheckObjectHasTag) == 0x000008, "Wrong alignment on RichmanOL_ChessGround_CheckObjectHasTag");
static_assert(sizeof(RichmanOL_ChessGround_CheckObjectHasTag) == 0x000018, "Wrong size on RichmanOL_ChessGround_CheckObjectHasTag");
static_assert(offsetof(RichmanOL_ChessGround_CheckObjectHasTag, InTagName) == 0x000000, "Member 'RichmanOL_ChessGround_CheckObjectHasTag::InTagName' has a wrong offset!");
static_assert(offsetof(RichmanOL_ChessGround_CheckObjectHasTag, ReturnValue) == 0x000010, "Member 'RichmanOL_ChessGround_CheckObjectHasTag::ReturnValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_ChessGround.GetBuilding
// 0x0008 (0x0008 - 0x0000)
struct RichmanOL_ChessGround_GetBuilding final
{
public:
	class ARichmanOL_BuildingObject*              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_ChessGround_GetBuilding) == 0x000008, "Wrong alignment on RichmanOL_ChessGround_GetBuilding");
static_assert(sizeof(RichmanOL_ChessGround_GetBuilding) == 0x000008, "Wrong size on RichmanOL_ChessGround_GetBuilding");
static_assert(offsetof(RichmanOL_ChessGround_GetBuilding, ReturnValue) == 0x000000, "Member 'RichmanOL_ChessGround_GetBuilding::ReturnValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_ChessGround.GetFirstObjectByTag
// 0x0018 (0x0018 - 0x0000)
struct RichmanOL_ChessGround_GetFirstObjectByTag final
{
public:
	class FString                                 InTagName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AChessObject*                           ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_ChessGround_GetFirstObjectByTag) == 0x000008, "Wrong alignment on RichmanOL_ChessGround_GetFirstObjectByTag");
static_assert(sizeof(RichmanOL_ChessGround_GetFirstObjectByTag) == 0x000018, "Wrong size on RichmanOL_ChessGround_GetFirstObjectByTag");
static_assert(offsetof(RichmanOL_ChessGround_GetFirstObjectByTag, InTagName) == 0x000000, "Member 'RichmanOL_ChessGround_GetFirstObjectByTag::InTagName' has a wrong offset!");
static_assert(offsetof(RichmanOL_ChessGround_GetFirstObjectByTag, ReturnValue) == 0x000010, "Member 'RichmanOL_ChessGround_GetFirstObjectByTag::ReturnValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_ChessGround.IsInFrontOfBuilding
// 0x0010 (0x0010 - 0x0000)
struct RichmanOL_ChessGround_IsInFrontOfBuilding final
{
public:
	class ARichmanOL_BuildingObject*              InBuilding;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RichmanOL_ChessGround_IsInFrontOfBuilding) == 0x000008, "Wrong alignment on RichmanOL_ChessGround_IsInFrontOfBuilding");
static_assert(sizeof(RichmanOL_ChessGround_IsInFrontOfBuilding) == 0x000010, "Wrong size on RichmanOL_ChessGround_IsInFrontOfBuilding");
static_assert(offsetof(RichmanOL_ChessGround_IsInFrontOfBuilding, InBuilding) == 0x000000, "Member 'RichmanOL_ChessGround_IsInFrontOfBuilding::InBuilding' has a wrong offset!");
static_assert(offsetof(RichmanOL_ChessGround_IsInFrontOfBuilding, ReturnValue) == 0x000008, "Member 'RichmanOL_ChessGround_IsInFrontOfBuilding::ReturnValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_ChessGround.NotifyCharacterEntry
// 0x0010 (0x0010 - 0x0000)
struct RichmanOL_ChessGround_NotifyCharacterEntry final
{
public:
	class ARichmanOL_Character*                   InCharacter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsMoving;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RichmanOL_ChessGround_NotifyCharacterEntry) == 0x000008, "Wrong alignment on RichmanOL_ChessGround_NotifyCharacterEntry");
static_assert(sizeof(RichmanOL_ChessGround_NotifyCharacterEntry) == 0x000010, "Wrong size on RichmanOL_ChessGround_NotifyCharacterEntry");
static_assert(offsetof(RichmanOL_ChessGround_NotifyCharacterEntry, InCharacter) == 0x000000, "Member 'RichmanOL_ChessGround_NotifyCharacterEntry::InCharacter' has a wrong offset!");
static_assert(offsetof(RichmanOL_ChessGround_NotifyCharacterEntry, IsMoving) == 0x000008, "Member 'RichmanOL_ChessGround_NotifyCharacterEntry::IsMoving' has a wrong offset!");

// Function RichmanOL.RichmanOL_ChessGround.NotifyCharacterLeave
// 0x0008 (0x0008 - 0x0000)
struct RichmanOL_ChessGround_NotifyCharacterLeave final
{
public:
	class ARichmanOL_Character*                   InCharacter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_ChessGround_NotifyCharacterLeave) == 0x000008, "Wrong alignment on RichmanOL_ChessGround_NotifyCharacterLeave");
static_assert(sizeof(RichmanOL_ChessGround_NotifyCharacterLeave) == 0x000008, "Wrong size on RichmanOL_ChessGround_NotifyCharacterLeave");
static_assert(offsetof(RichmanOL_ChessGround_NotifyCharacterLeave, InCharacter) == 0x000000, "Member 'RichmanOL_ChessGround_NotifyCharacterLeave::InCharacter' has a wrong offset!");

// Function RichmanOL.RichmanOL_ChessGround.SetColorMonopoly
// 0x0001 (0x0001 - 0x0000)
struct RichmanOL_ChessGround_SetColorMonopoly final
{
public:
	bool                                          InValue;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_ChessGround_SetColorMonopoly) == 0x000001, "Wrong alignment on RichmanOL_ChessGround_SetColorMonopoly");
static_assert(sizeof(RichmanOL_ChessGround_SetColorMonopoly) == 0x000001, "Wrong size on RichmanOL_ChessGround_SetColorMonopoly");
static_assert(offsetof(RichmanOL_ChessGround_SetColorMonopoly, InValue) == 0x000000, "Member 'RichmanOL_ChessGround_SetColorMonopoly::InValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_ChessGround.SetSkillTollMultiplier
// 0x0004 (0x0004 - 0x0000)
struct RichmanOL_ChessGround_SetSkillTollMultiplier final
{
public:
	float                                         InSkillTollMultiplier;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_ChessGround_SetSkillTollMultiplier) == 0x000004, "Wrong alignment on RichmanOL_ChessGround_SetSkillTollMultiplier");
static_assert(sizeof(RichmanOL_ChessGround_SetSkillTollMultiplier) == 0x000004, "Wrong size on RichmanOL_ChessGround_SetSkillTollMultiplier");
static_assert(offsetof(RichmanOL_ChessGround_SetSkillTollMultiplier, InSkillTollMultiplier) == 0x000000, "Member 'RichmanOL_ChessGround_SetSkillTollMultiplier::InSkillTollMultiplier' has a wrong offset!");

// Function RichmanOL.RichmanOL_ChessGround.SetSkillTollMultiplierEnemy
// 0x0004 (0x0004 - 0x0000)
struct RichmanOL_ChessGround_SetSkillTollMultiplierEnemy final
{
public:
	float                                         InSkillTollMultiplier;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_ChessGround_SetSkillTollMultiplierEnemy) == 0x000004, "Wrong alignment on RichmanOL_ChessGround_SetSkillTollMultiplierEnemy");
static_assert(sizeof(RichmanOL_ChessGround_SetSkillTollMultiplierEnemy) == 0x000004, "Wrong size on RichmanOL_ChessGround_SetSkillTollMultiplierEnemy");
static_assert(offsetof(RichmanOL_ChessGround_SetSkillTollMultiplierEnemy, InSkillTollMultiplier) == 0x000000, "Member 'RichmanOL_ChessGround_SetSkillTollMultiplierEnemy::InSkillTollMultiplier' has a wrong offset!");

// Function RichmanOL.RichmanOL_ChessObject.GetTagParam
// 0x0010 (0x0010 - 0x0000)
struct RichmanOL_ChessObject_GetTagParam final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_ChessObject_GetTagParam) == 0x000008, "Wrong alignment on RichmanOL_ChessObject_GetTagParam");
static_assert(sizeof(RichmanOL_ChessObject_GetTagParam) == 0x000010, "Wrong size on RichmanOL_ChessObject_GetTagParam");
static_assert(offsetof(RichmanOL_ChessObject_GetTagParam, ReturnValue) == 0x000000, "Member 'RichmanOL_ChessObject_GetTagParam::ReturnValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_BuildingObject.ChangeOwner
// 0x0008 (0x0008 - 0x0000)
struct RichmanOL_BuildingObject_ChangeOwner final
{
public:
	class ARichmanOL_Character*                   InOwner;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_BuildingObject_ChangeOwner) == 0x000008, "Wrong alignment on RichmanOL_BuildingObject_ChangeOwner");
static_assert(sizeof(RichmanOL_BuildingObject_ChangeOwner) == 0x000008, "Wrong size on RichmanOL_BuildingObject_ChangeOwner");
static_assert(offsetof(RichmanOL_BuildingObject_ChangeOwner, InOwner) == 0x000000, "Member 'RichmanOL_BuildingObject_ChangeOwner::InOwner' has a wrong offset!");

// Function RichmanOL.RichmanOL_BuildingObject.GetBuildingLevel
// 0x0004 (0x0004 - 0x0000)
struct RichmanOL_BuildingObject_GetBuildingLevel final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_BuildingObject_GetBuildingLevel) == 0x000004, "Wrong alignment on RichmanOL_BuildingObject_GetBuildingLevel");
static_assert(sizeof(RichmanOL_BuildingObject_GetBuildingLevel) == 0x000004, "Wrong size on RichmanOL_BuildingObject_GetBuildingLevel");
static_assert(offsetof(RichmanOL_BuildingObject_GetBuildingLevel, ReturnValue) == 0x000000, "Member 'RichmanOL_BuildingObject_GetBuildingLevel::ReturnValue' has a wrong offset!");

// Function RichmanOL.RichmanOL_BuildingObject.GetBuildingType
// 0x0001 (0x0001 - 0x0000)
struct RichmanOL_BuildingObject_GetBuildingType final
{
public:
	ERichmanOL_BuildingType                       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanOL_BuildingObject_GetBuildingType) == 0x000001, "Wrong alignment on RichmanOL_BuildingObject_GetBuildingType");
static_assert(sizeof(RichmanOL_BuildingObject_GetBuildingType) == 0x000001, "Wrong size on RichmanOL_BuildingObject_GetBuildingType");
