#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RichmanLove

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "RichmanLove_structs.hpp"


namespace SDK::Params
{

// Function RichmanLove.RichmanLove_ChessGround.CheckHasObject
// 0x0001 (0x0001 - 0x0000)
struct RichmanLove_ChessGround_CheckHasObject final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLove_ChessGround_CheckHasObject) == 0x000001, "Wrong alignment on RichmanLove_ChessGround_CheckHasObject");
static_assert(sizeof(RichmanLove_ChessGround_CheckHasObject) == 0x000001, "Wrong size on RichmanLove_ChessGround_CheckHasObject");
static_assert(offsetof(RichmanLove_ChessGround_CheckHasObject, ReturnValue) == 0x000000, "Member 'RichmanLove_ChessGround_CheckHasObject::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLove_ChessGround.CheckObjectHasTag
// 0x0018 (0x0018 - 0x0000)
struct RichmanLove_ChessGround_CheckObjectHasTag final
{
public:
	class FString                                 InTagName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RichmanLove_ChessGround_CheckObjectHasTag) == 0x000008, "Wrong alignment on RichmanLove_ChessGround_CheckObjectHasTag");
static_assert(sizeof(RichmanLove_ChessGround_CheckObjectHasTag) == 0x000018, "Wrong size on RichmanLove_ChessGround_CheckObjectHasTag");
static_assert(offsetof(RichmanLove_ChessGround_CheckObjectHasTag, InTagName) == 0x000000, "Member 'RichmanLove_ChessGround_CheckObjectHasTag::InTagName' has a wrong offset!");
static_assert(offsetof(RichmanLove_ChessGround_CheckObjectHasTag, ReturnValue) == 0x000010, "Member 'RichmanLove_ChessGround_CheckObjectHasTag::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLove_ChessGround.GetObjectsByTag
// 0x0020 (0x0020 - 0x0000)
struct RichmanLove_ChessGround_GetObjectsByTag final
{
public:
	class FString                                 InTagName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AChessObject*>                   ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLove_ChessGround_GetObjectsByTag) == 0x000008, "Wrong alignment on RichmanLove_ChessGround_GetObjectsByTag");
static_assert(sizeof(RichmanLove_ChessGround_GetObjectsByTag) == 0x000020, "Wrong size on RichmanLove_ChessGround_GetObjectsByTag");
static_assert(offsetof(RichmanLove_ChessGround_GetObjectsByTag, InTagName) == 0x000000, "Member 'RichmanLove_ChessGround_GetObjectsByTag::InTagName' has a wrong offset!");
static_assert(offsetof(RichmanLove_ChessGround_GetObjectsByTag, ReturnValue) == 0x000010, "Member 'RichmanLove_ChessGround_GetObjectsByTag::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLove_ChessGround.HasProp
// 0x0001 (0x0001 - 0x0000)
struct RichmanLove_ChessGround_HasProp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLove_ChessGround_HasProp) == 0x000001, "Wrong alignment on RichmanLove_ChessGround_HasProp");
static_assert(sizeof(RichmanLove_ChessGround_HasProp) == 0x000001, "Wrong size on RichmanLove_ChessGround_HasProp");
static_assert(offsetof(RichmanLove_ChessGround_HasProp, ReturnValue) == 0x000000, "Member 'RichmanLove_ChessGround_HasProp::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLove_ChessObject.GetTagParam
// 0x0010 (0x0010 - 0x0000)
struct RichmanLove_ChessObject_GetTagParam final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLove_ChessObject_GetTagParam) == 0x000008, "Wrong alignment on RichmanLove_ChessObject_GetTagParam");
static_assert(sizeof(RichmanLove_ChessObject_GetTagParam) == 0x000010, "Wrong size on RichmanLove_ChessObject_GetTagParam");
static_assert(offsetof(RichmanLove_ChessObject_GetTagParam, ReturnValue) == 0x000000, "Member 'RichmanLove_ChessObject_GetTagParam::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveCameraFollow.CheckAutoFollowComplete
// 0x0001 (0x0001 - 0x0000)
struct RichmanLoveCameraFollow_CheckAutoFollowComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveCameraFollow_CheckAutoFollowComplete) == 0x000001, "Wrong alignment on RichmanLoveCameraFollow_CheckAutoFollowComplete");
static_assert(sizeof(RichmanLoveCameraFollow_CheckAutoFollowComplete) == 0x000001, "Wrong size on RichmanLoveCameraFollow_CheckAutoFollowComplete");
static_assert(offsetof(RichmanLoveCameraFollow_CheckAutoFollowComplete, ReturnValue) == 0x000000, "Member 'RichmanLoveCameraFollow_CheckAutoFollowComplete::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveCameraFollow.GetLockControl
// 0x0001 (0x0001 - 0x0000)
struct RichmanLoveCameraFollow_GetLockControl final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveCameraFollow_GetLockControl) == 0x000001, "Wrong alignment on RichmanLoveCameraFollow_GetLockControl");
static_assert(sizeof(RichmanLoveCameraFollow_GetLockControl) == 0x000001, "Wrong size on RichmanLoveCameraFollow_GetLockControl");
static_assert(offsetof(RichmanLoveCameraFollow_GetLockControl, ReturnValue) == 0x000000, "Member 'RichmanLoveCameraFollow_GetLockControl::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveCameraFollow.IsSlidingView
// 0x0001 (0x0001 - 0x0000)
struct RichmanLoveCameraFollow_IsSlidingView final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveCameraFollow_IsSlidingView) == 0x000001, "Wrong alignment on RichmanLoveCameraFollow_IsSlidingView");
static_assert(sizeof(RichmanLoveCameraFollow_IsSlidingView) == 0x000001, "Wrong size on RichmanLoveCameraFollow_IsSlidingView");
static_assert(offsetof(RichmanLoveCameraFollow_IsSlidingView, ReturnValue) == 0x000000, "Member 'RichmanLoveCameraFollow_IsSlidingView::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveCameraFollow.OnMouseMove
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveCameraFollow_OnMouseMove final
{
public:
	struct FVector2D                              DeltaPos;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveCameraFollow_OnMouseMove) == 0x000004, "Wrong alignment on RichmanLoveCameraFollow_OnMouseMove");
static_assert(sizeof(RichmanLoveCameraFollow_OnMouseMove) == 0x000008, "Wrong size on RichmanLoveCameraFollow_OnMouseMove");
static_assert(offsetof(RichmanLoveCameraFollow_OnMouseMove, DeltaPos) == 0x000000, "Member 'RichmanLoveCameraFollow_OnMouseMove::DeltaPos' has a wrong offset!");

// Function RichmanLove.RichmanLoveCameraFollow.OnZoomChange
// 0x0004 (0x0004 - 0x0000)
struct RichmanLoveCameraFollow_OnZoomChange final
{
public:
	float                                         InZoom;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveCameraFollow_OnZoomChange) == 0x000004, "Wrong alignment on RichmanLoveCameraFollow_OnZoomChange");
static_assert(sizeof(RichmanLoveCameraFollow_OnZoomChange) == 0x000004, "Wrong size on RichmanLoveCameraFollow_OnZoomChange");
static_assert(offsetof(RichmanLoveCameraFollow_OnZoomChange, InZoom) == 0x000000, "Member 'RichmanLoveCameraFollow_OnZoomChange::InZoom' has a wrong offset!");

// Function RichmanLove.RichmanLoveCameraFollow.RefreshCameraRange
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveCameraFollow_RefreshCameraRange final
{
public:
	class AChessRegion*                           Region;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveCameraFollow_RefreshCameraRange) == 0x000008, "Wrong alignment on RichmanLoveCameraFollow_RefreshCameraRange");
static_assert(sizeof(RichmanLoveCameraFollow_RefreshCameraRange) == 0x000008, "Wrong size on RichmanLoveCameraFollow_RefreshCameraRange");
static_assert(offsetof(RichmanLoveCameraFollow_RefreshCameraRange, Region) == 0x000000, "Member 'RichmanLoveCameraFollow_RefreshCameraRange::Region' has a wrong offset!");

// Function RichmanLove.RichmanLoveCameraFollow.SetFollowTarget
// 0x0010 (0x0010 - 0x0000)
struct RichmanLoveCameraFollow_SetFollowTarget final
{
public:
	class AActor*                                 InCharacter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Immediately;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RichmanLoveCameraFollow_SetFollowTarget) == 0x000008, "Wrong alignment on RichmanLoveCameraFollow_SetFollowTarget");
static_assert(sizeof(RichmanLoveCameraFollow_SetFollowTarget) == 0x000010, "Wrong size on RichmanLoveCameraFollow_SetFollowTarget");
static_assert(offsetof(RichmanLoveCameraFollow_SetFollowTarget, InCharacter) == 0x000000, "Member 'RichmanLoveCameraFollow_SetFollowTarget::InCharacter' has a wrong offset!");
static_assert(offsetof(RichmanLoveCameraFollow_SetFollowTarget, Immediately) == 0x000008, "Member 'RichmanLoveCameraFollow_SetFollowTarget::Immediately' has a wrong offset!");

// Function RichmanLove.RichmanLoveCameraFollow.SetLockControl
// 0x0001 (0x0001 - 0x0000)
struct RichmanLoveCameraFollow_SetLockControl final
{
public:
	bool                                          InLockControl;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveCameraFollow_SetLockControl) == 0x000001, "Wrong alignment on RichmanLoveCameraFollow_SetLockControl");
static_assert(sizeof(RichmanLoveCameraFollow_SetLockControl) == 0x000001, "Wrong size on RichmanLoveCameraFollow_SetLockControl");
static_assert(offsetof(RichmanLoveCameraFollow_SetLockControl, InLockControl) == 0x000000, "Member 'RichmanLoveCameraFollow_SetLockControl::InLockControl' has a wrong offset!");

// Function RichmanLove.RichmanLoveCameraFollow.SetSlidingView
// 0x0001 (0x0001 - 0x0000)
struct RichmanLoveCameraFollow_SetSlidingView final
{
public:
	bool                                          bSlid;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveCameraFollow_SetSlidingView) == 0x000001, "Wrong alignment on RichmanLoveCameraFollow_SetSlidingView");
static_assert(sizeof(RichmanLoveCameraFollow_SetSlidingView) == 0x000001, "Wrong size on RichmanLoveCameraFollow_SetSlidingView");
static_assert(offsetof(RichmanLoveCameraFollow_SetSlidingView, bSlid) == 0x000000, "Member 'RichmanLoveCameraFollow_SetSlidingView::bSlid' has a wrong offset!");

// Function RichmanLove.RichmanLoveGroundSelector.GetAllCanReachGridsByCard
// 0x0020 (0x0020 - 0x0000)
struct RichmanLoveGroundSelector_GetAllCanReachGridsByCard final
{
public:
	class AActor*                                 InCharacter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InStep;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FindType;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveGroundSelector_GetAllCanReachGridsByCard) == 0x000008, "Wrong alignment on RichmanLoveGroundSelector_GetAllCanReachGridsByCard");
static_assert(sizeof(RichmanLoveGroundSelector_GetAllCanReachGridsByCard) == 0x000020, "Wrong size on RichmanLoveGroundSelector_GetAllCanReachGridsByCard");
static_assert(offsetof(RichmanLoveGroundSelector_GetAllCanReachGridsByCard, InCharacter) == 0x000000, "Member 'RichmanLoveGroundSelector_GetAllCanReachGridsByCard::InCharacter' has a wrong offset!");
static_assert(offsetof(RichmanLoveGroundSelector_GetAllCanReachGridsByCard, InStep) == 0x000008, "Member 'RichmanLoveGroundSelector_GetAllCanReachGridsByCard::InStep' has a wrong offset!");
static_assert(offsetof(RichmanLoveGroundSelector_GetAllCanReachGridsByCard, FindType) == 0x000010, "Member 'RichmanLoveGroundSelector_GetAllCanReachGridsByCard::FindType' has a wrong offset!");

// Function RichmanLove.RichmanLoveGroundSelector.OnDirGroundSelected
// 0x0004 (0x0004 - 0x0000)
struct RichmanLoveGroundSelector_OnDirGroundSelected final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveGroundSelector_OnDirGroundSelected) == 0x000004, "Wrong alignment on RichmanLoveGroundSelector_OnDirGroundSelected");
static_assert(sizeof(RichmanLoveGroundSelector_OnDirGroundSelected) == 0x000004, "Wrong size on RichmanLoveGroundSelector_OnDirGroundSelected");
static_assert(offsetof(RichmanLoveGroundSelector_OnDirGroundSelected, Index_0) == 0x000000, "Member 'RichmanLoveGroundSelector_OnDirGroundSelected::Index_0' has a wrong offset!");

// Function RichmanLove.RichmanLoveGroundSelector.SetCharacter
// 0x0010 (0x0010 - 0x0000)
struct RichmanLoveGroundSelector_SetCharacter final
{
public:
	class AActor*                                 InCharacter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InStep;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RichmanLoveGroundSelector_SetCharacter) == 0x000008, "Wrong alignment on RichmanLoveGroundSelector_SetCharacter");
static_assert(sizeof(RichmanLoveGroundSelector_SetCharacter) == 0x000010, "Wrong size on RichmanLoveGroundSelector_SetCharacter");
static_assert(offsetof(RichmanLoveGroundSelector_SetCharacter, InCharacter) == 0x000000, "Member 'RichmanLoveGroundSelector_SetCharacter::InCharacter' has a wrong offset!");
static_assert(offsetof(RichmanLoveGroundSelector_SetCharacter, InStep) == 0x000008, "Member 'RichmanLoveGroundSelector_SetCharacter::InStep' has a wrong offset!");

// Function RichmanLove.RichmanLoveLibrary.GetAllMoveDirs
// 0x0030 (0x0030 - 0x0000)
struct RichmanLoveLibrary_GetAllMoveDirs final
{
public:
	class AActor*                                 InCharacter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanLove_ChessGround*               InGround;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanLoveMgr*                        InMgr;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 AllCanReachGirds;                                  // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         BackDir;                                           // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x002C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveLibrary_GetAllMoveDirs) == 0x000008, "Wrong alignment on RichmanLoveLibrary_GetAllMoveDirs");
static_assert(sizeof(RichmanLoveLibrary_GetAllMoveDirs) == 0x000030, "Wrong size on RichmanLoveLibrary_GetAllMoveDirs");
static_assert(offsetof(RichmanLoveLibrary_GetAllMoveDirs, InCharacter) == 0x000000, "Member 'RichmanLoveLibrary_GetAllMoveDirs::InCharacter' has a wrong offset!");
static_assert(offsetof(RichmanLoveLibrary_GetAllMoveDirs, InGround) == 0x000008, "Member 'RichmanLoveLibrary_GetAllMoveDirs::InGround' has a wrong offset!");
static_assert(offsetof(RichmanLoveLibrary_GetAllMoveDirs, InMgr) == 0x000010, "Member 'RichmanLoveLibrary_GetAllMoveDirs::InMgr' has a wrong offset!");
static_assert(offsetof(RichmanLoveLibrary_GetAllMoveDirs, AllCanReachGirds) == 0x000018, "Member 'RichmanLoveLibrary_GetAllMoveDirs::AllCanReachGirds' has a wrong offset!");
static_assert(offsetof(RichmanLoveLibrary_GetAllMoveDirs, BackDir) == 0x000028, "Member 'RichmanLoveLibrary_GetAllMoveDirs::BackDir' has a wrong offset!");
static_assert(offsetof(RichmanLoveLibrary_GetAllMoveDirs, ReturnValue) == 0x00002C, "Member 'RichmanLoveLibrary_GetAllMoveDirs::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveLibrary.GetBuildingDescKey
// 0x0020 (0x0020 - 0x0000)
struct RichmanLoveLibrary_GetBuildingDescKey final
{
public:
	class ARichmanLoveMgr*                        InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InTplId;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveLibrary_GetBuildingDescKey) == 0x000008, "Wrong alignment on RichmanLoveLibrary_GetBuildingDescKey");
static_assert(sizeof(RichmanLoveLibrary_GetBuildingDescKey) == 0x000020, "Wrong size on RichmanLoveLibrary_GetBuildingDescKey");
static_assert(offsetof(RichmanLoveLibrary_GetBuildingDescKey, InMgr) == 0x000000, "Member 'RichmanLoveLibrary_GetBuildingDescKey::InMgr' has a wrong offset!");
static_assert(offsetof(RichmanLoveLibrary_GetBuildingDescKey, InTplId) == 0x000008, "Member 'RichmanLoveLibrary_GetBuildingDescKey::InTplId' has a wrong offset!");
static_assert(offsetof(RichmanLoveLibrary_GetBuildingDescKey, ReturnValue) == 0x000010, "Member 'RichmanLoveLibrary_GetBuildingDescKey::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveLibrary.GetBuildingNameKey
// 0x0020 (0x0020 - 0x0000)
struct RichmanLoveLibrary_GetBuildingNameKey final
{
public:
	class ARichmanLoveMgr*                        InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InTplId;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveLibrary_GetBuildingNameKey) == 0x000008, "Wrong alignment on RichmanLoveLibrary_GetBuildingNameKey");
static_assert(sizeof(RichmanLoveLibrary_GetBuildingNameKey) == 0x000020, "Wrong size on RichmanLoveLibrary_GetBuildingNameKey");
static_assert(offsetof(RichmanLoveLibrary_GetBuildingNameKey, InMgr) == 0x000000, "Member 'RichmanLoveLibrary_GetBuildingNameKey::InMgr' has a wrong offset!");
static_assert(offsetof(RichmanLoveLibrary_GetBuildingNameKey, InTplId) == 0x000008, "Member 'RichmanLoveLibrary_GetBuildingNameKey::InTplId' has a wrong offset!");
static_assert(offsetof(RichmanLoveLibrary_GetBuildingNameKey, ReturnValue) == 0x000010, "Member 'RichmanLoveLibrary_GetBuildingNameKey::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveLibrary.GetDiceThrow
// 0x000C (0x000C - 0x0000)
struct RichmanLoveLibrary_GetDiceThrow final
{
public:
	int32                                         Max;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Min;                                               // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveLibrary_GetDiceThrow) == 0x000004, "Wrong alignment on RichmanLoveLibrary_GetDiceThrow");
static_assert(sizeof(RichmanLoveLibrary_GetDiceThrow) == 0x00000C, "Wrong size on RichmanLoveLibrary_GetDiceThrow");
static_assert(offsetof(RichmanLoveLibrary_GetDiceThrow, Max) == 0x000000, "Member 'RichmanLoveLibrary_GetDiceThrow::Max' has a wrong offset!");
static_assert(offsetof(RichmanLoveLibrary_GetDiceThrow, Min) == 0x000004, "Member 'RichmanLoveLibrary_GetDiceThrow::Min' has a wrong offset!");
static_assert(offsetof(RichmanLoveLibrary_GetDiceThrow, ReturnValue) == 0x000008, "Member 'RichmanLoveLibrary_GetDiceThrow::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveLibrary.SetSelectWalkDirection
// 0x0018 (0x0018 - 0x0000)
struct RichmanLoveLibrary_SetSelectWalkDirection final
{
public:
	class ARichmanLoveMgr*                        InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 InCharacter;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RichmanLoveLibrary_SetSelectWalkDirection) == 0x000008, "Wrong alignment on RichmanLoveLibrary_SetSelectWalkDirection");
static_assert(sizeof(RichmanLoveLibrary_SetSelectWalkDirection) == 0x000018, "Wrong size on RichmanLoveLibrary_SetSelectWalkDirection");
static_assert(offsetof(RichmanLoveLibrary_SetSelectWalkDirection, InMgr) == 0x000000, "Member 'RichmanLoveLibrary_SetSelectWalkDirection::InMgr' has a wrong offset!");
static_assert(offsetof(RichmanLoveLibrary_SetSelectWalkDirection, InCharacter) == 0x000008, "Member 'RichmanLoveLibrary_SetSelectWalkDirection::InCharacter' has a wrong offset!");
static_assert(offsetof(RichmanLoveLibrary_SetSelectWalkDirection, ReturnValue) == 0x000010, "Member 'RichmanLoveLibrary_SetSelectWalkDirection::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveMgr.ActiveNiagara
// 0x0001 (0x0001 - 0x0000)
struct RichmanLoveMgr_ActiveNiagara final
{
public:
	bool                                          Inactive;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveMgr_ActiveNiagara) == 0x000001, "Wrong alignment on RichmanLoveMgr_ActiveNiagara");
static_assert(sizeof(RichmanLoveMgr_ActiveNiagara) == 0x000001, "Wrong size on RichmanLoveMgr_ActiveNiagara");
static_assert(offsetof(RichmanLoveMgr_ActiveNiagara, Inactive) == 0x000000, "Member 'RichmanLoveMgr_ActiveNiagara::Inactive' has a wrong offset!");

// Function RichmanLove.RichmanLoveMgr.CheckHaveGirl
// 0x0001 (0x0001 - 0x0000)
struct RichmanLoveMgr_CheckHaveGirl final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveMgr_CheckHaveGirl) == 0x000001, "Wrong alignment on RichmanLoveMgr_CheckHaveGirl");
static_assert(sizeof(RichmanLoveMgr_CheckHaveGirl) == 0x000001, "Wrong size on RichmanLoveMgr_CheckHaveGirl");
static_assert(offsetof(RichmanLoveMgr_CheckHaveGirl, ReturnValue) == 0x000000, "Member 'RichmanLoveMgr_CheckHaveGirl::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveMgr.CheckIsGameOver
// 0x0001 (0x0001 - 0x0000)
struct RichmanLoveMgr_CheckIsGameOver final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveMgr_CheckIsGameOver) == 0x000001, "Wrong alignment on RichmanLoveMgr_CheckIsGameOver");
static_assert(sizeof(RichmanLoveMgr_CheckIsGameOver) == 0x000001, "Wrong size on RichmanLoveMgr_CheckIsGameOver");
static_assert(offsetof(RichmanLoveMgr_CheckIsGameOver, ReturnValue) == 0x000000, "Member 'RichmanLoveMgr_CheckIsGameOver::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveMgr.DestroyEffect
// 0x0004 (0x0004 - 0x0000)
struct RichmanLoveMgr_DestroyEffect final
{
public:
	int32                                         InEffectId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveMgr_DestroyEffect) == 0x000004, "Wrong alignment on RichmanLoveMgr_DestroyEffect");
static_assert(sizeof(RichmanLoveMgr_DestroyEffect) == 0x000004, "Wrong size on RichmanLoveMgr_DestroyEffect");
static_assert(offsetof(RichmanLoveMgr_DestroyEffect, InEffectId) == 0x000000, "Member 'RichmanLoveMgr_DestroyEffect::InEffectId' has a wrong offset!");

// Function RichmanLove.RichmanLoveMgr.GetClickActor
// 0x0010 (0x0010 - 0x0000)
struct RichmanLoveMgr_GetClickActor final
{
public:
	bool                                          IgnoreGround;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveMgr_GetClickActor) == 0x000008, "Wrong alignment on RichmanLoveMgr_GetClickActor");
static_assert(sizeof(RichmanLoveMgr_GetClickActor) == 0x000010, "Wrong size on RichmanLoveMgr_GetClickActor");
static_assert(offsetof(RichmanLoveMgr_GetClickActor, IgnoreGround) == 0x000000, "Member 'RichmanLoveMgr_GetClickActor::IgnoreGround' has a wrong offset!");
static_assert(offsetof(RichmanLoveMgr_GetClickActor, ReturnValue) == 0x000008, "Member 'RichmanLoveMgr_GetClickActor::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveMgr.GetGroundByObject
// 0x0010 (0x0010 - 0x0000)
struct RichmanLoveMgr_GetGroundByObject final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AChessGround*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveMgr_GetGroundByObject) == 0x000008, "Wrong alignment on RichmanLoveMgr_GetGroundByObject");
static_assert(sizeof(RichmanLoveMgr_GetGroundByObject) == 0x000010, "Wrong size on RichmanLoveMgr_GetGroundByObject");
static_assert(offsetof(RichmanLoveMgr_GetGroundByObject, InActor) == 0x000000, "Member 'RichmanLoveMgr_GetGroundByObject::InActor' has a wrong offset!");
static_assert(offsetof(RichmanLoveMgr_GetGroundByObject, ReturnValue) == 0x000008, "Member 'RichmanLoveMgr_GetGroundByObject::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveMgr.InitGirlNpcTrans
// 0x0050 (0x0050 - 0x0000)
struct RichmanLoveMgr_InitGirlNpcTrans final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InRotation;                                        // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InScale;                                           // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0020(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveMgr_InitGirlNpcTrans) == 0x000010, "Wrong alignment on RichmanLoveMgr_InitGirlNpcTrans");
static_assert(sizeof(RichmanLoveMgr_InitGirlNpcTrans) == 0x000050, "Wrong size on RichmanLoveMgr_InitGirlNpcTrans");
static_assert(offsetof(RichmanLoveMgr_InitGirlNpcTrans, InId) == 0x000000, "Member 'RichmanLoveMgr_InitGirlNpcTrans::InId' has a wrong offset!");
static_assert(offsetof(RichmanLoveMgr_InitGirlNpcTrans, InRotation) == 0x000004, "Member 'RichmanLoveMgr_InitGirlNpcTrans::InRotation' has a wrong offset!");
static_assert(offsetof(RichmanLoveMgr_InitGirlNpcTrans, InScale) == 0x000010, "Member 'RichmanLoveMgr_InitGirlNpcTrans::InScale' has a wrong offset!");
static_assert(offsetof(RichmanLoveMgr_InitGirlNpcTrans, ReturnValue) == 0x000020, "Member 'RichmanLoveMgr_InitGirlNpcTrans::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveMgr.InitPlayerTrans
// 0x0050 (0x0050 - 0x0000)
struct RichmanLoveMgr_InitPlayerTrans final
{
public:
	bool                                          InIsFirst;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InRotation;                                        // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InScale;                                           // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0020(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveMgr_InitPlayerTrans) == 0x000010, "Wrong alignment on RichmanLoveMgr_InitPlayerTrans");
static_assert(sizeof(RichmanLoveMgr_InitPlayerTrans) == 0x000050, "Wrong size on RichmanLoveMgr_InitPlayerTrans");
static_assert(offsetof(RichmanLoveMgr_InitPlayerTrans, InIsFirst) == 0x000000, "Member 'RichmanLoveMgr_InitPlayerTrans::InIsFirst' has a wrong offset!");
static_assert(offsetof(RichmanLoveMgr_InitPlayerTrans, InRotation) == 0x000004, "Member 'RichmanLoveMgr_InitPlayerTrans::InRotation' has a wrong offset!");
static_assert(offsetof(RichmanLoveMgr_InitPlayerTrans, InScale) == 0x000010, "Member 'RichmanLoveMgr_InitPlayerTrans::InScale' has a wrong offset!");
static_assert(offsetof(RichmanLoveMgr_InitPlayerTrans, ReturnValue) == 0x000020, "Member 'RichmanLoveMgr_InitPlayerTrans::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveMgr.MoveGirlToOtherGround
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveMgr_MoveGirlToOtherGround final
{
public:
	class AActor*                                 InGirl;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveMgr_MoveGirlToOtherGround) == 0x000008, "Wrong alignment on RichmanLoveMgr_MoveGirlToOtherGround");
static_assert(sizeof(RichmanLoveMgr_MoveGirlToOtherGround) == 0x000008, "Wrong size on RichmanLoveMgr_MoveGirlToOtherGround");
static_assert(offsetof(RichmanLoveMgr_MoveGirlToOtherGround, InGirl) == 0x000000, "Member 'RichmanLoveMgr_MoveGirlToOtherGround::InGirl' has a wrong offset!");

// Function RichmanLove.RichmanLoveMgr.NotifyLuaTick
// 0x0004 (0x0004 - 0x0000)
struct RichmanLoveMgr_NotifyLuaTick final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveMgr_NotifyLuaTick) == 0x000004, "Wrong alignment on RichmanLoveMgr_NotifyLuaTick");
static_assert(sizeof(RichmanLoveMgr_NotifyLuaTick) == 0x000004, "Wrong size on RichmanLoveMgr_NotifyLuaTick");
static_assert(offsetof(RichmanLoveMgr_NotifyLuaTick, InDeltaTime) == 0x000000, "Member 'RichmanLoveMgr_NotifyLuaTick::InDeltaTime' has a wrong offset!");

// Function RichmanLove.RichmanLoveMgr.OnReachGrid
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveMgr_OnReachGrid final
{
public:
	class ARichmanLove_ChessGround*               InGround;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveMgr_OnReachGrid) == 0x000008, "Wrong alignment on RichmanLoveMgr_OnReachGrid");
static_assert(sizeof(RichmanLoveMgr_OnReachGrid) == 0x000008, "Wrong size on RichmanLoveMgr_OnReachGrid");
static_assert(offsetof(RichmanLoveMgr_OnReachGrid, InGround) == 0x000000, "Member 'RichmanLoveMgr_OnReachGrid::InGround' has a wrong offset!");

// Function RichmanLove.RichmanLoveMgr.PlayEffectById
// 0x0024 (0x0024 - 0x0000)
struct RichmanLoveMgr_PlayEffectById final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InLocation;                                        // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               InRotate;                                          // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          IsPersistent;                                      // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveMgr_PlayEffectById) == 0x000004, "Wrong alignment on RichmanLoveMgr_PlayEffectById");
static_assert(sizeof(RichmanLoveMgr_PlayEffectById) == 0x000024, "Wrong size on RichmanLoveMgr_PlayEffectById");
static_assert(offsetof(RichmanLoveMgr_PlayEffectById, ID) == 0x000000, "Member 'RichmanLoveMgr_PlayEffectById::ID' has a wrong offset!");
static_assert(offsetof(RichmanLoveMgr_PlayEffectById, InLocation) == 0x000004, "Member 'RichmanLoveMgr_PlayEffectById::InLocation' has a wrong offset!");
static_assert(offsetof(RichmanLoveMgr_PlayEffectById, InRotate) == 0x000010, "Member 'RichmanLoveMgr_PlayEffectById::InRotate' has a wrong offset!");
static_assert(offsetof(RichmanLoveMgr_PlayEffectById, IsPersistent) == 0x00001C, "Member 'RichmanLoveMgr_PlayEffectById::IsPersistent' has a wrong offset!");
static_assert(offsetof(RichmanLoveMgr_PlayEffectById, ReturnValue) == 0x000020, "Member 'RichmanLoveMgr_PlayEffectById::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveMgr.ShowDirEffect
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveMgr_ShowDirEffect final
{
public:
	bool                                          InIsFirst;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InIsShowEffect;                                    // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveMgr_ShowDirEffect) == 0x000004, "Wrong alignment on RichmanLoveMgr_ShowDirEffect");
static_assert(sizeof(RichmanLoveMgr_ShowDirEffect) == 0x000008, "Wrong size on RichmanLoveMgr_ShowDirEffect");
static_assert(offsetof(RichmanLoveMgr_ShowDirEffect, InIsFirst) == 0x000000, "Member 'RichmanLoveMgr_ShowDirEffect::InIsFirst' has a wrong offset!");
static_assert(offsetof(RichmanLoveMgr_ShowDirEffect, InIsShowEffect) == 0x000001, "Member 'RichmanLoveMgr_ShowDirEffect::InIsShowEffect' has a wrong offset!");
static_assert(offsetof(RichmanLoveMgr_ShowDirEffect, ReturnValue) == 0x000004, "Member 'RichmanLoveMgr_ShowDirEffect::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveMgr.StartGame
// 0x0038 (0x0038 - 0x0000)
struct RichmanLoveMgr_StartGame final
{
public:
	class FString                                 InDlcId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InMapId;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InRegionId;                                        // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InSaved;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InDataPath;                                        // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveMgr_StartGame) == 0x000008, "Wrong alignment on RichmanLoveMgr_StartGame");
static_assert(sizeof(RichmanLoveMgr_StartGame) == 0x000038, "Wrong size on RichmanLoveMgr_StartGame");
static_assert(offsetof(RichmanLoveMgr_StartGame, InDlcId) == 0x000000, "Member 'RichmanLoveMgr_StartGame::InDlcId' has a wrong offset!");
static_assert(offsetof(RichmanLoveMgr_StartGame, InMapId) == 0x000010, "Member 'RichmanLoveMgr_StartGame::InMapId' has a wrong offset!");
static_assert(offsetof(RichmanLoveMgr_StartGame, InRegionId) == 0x000014, "Member 'RichmanLoveMgr_StartGame::InRegionId' has a wrong offset!");
static_assert(offsetof(RichmanLoveMgr_StartGame, InSaved) == 0x000018, "Member 'RichmanLoveMgr_StartGame::InSaved' has a wrong offset!");
static_assert(offsetof(RichmanLoveMgr_StartGame, InDataPath) == 0x000028, "Member 'RichmanLoveMgr_StartGame::InDataPath' has a wrong offset!");

// Function RichmanLove.RichmanLoveMgr.StartMoving
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveMgr_StartMoving final
{
public:
	int32                                         Steps;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InForce;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsCustom;                                          // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RichmanLoveMgr_StartMoving) == 0x000004, "Wrong alignment on RichmanLoveMgr_StartMoving");
static_assert(sizeof(RichmanLoveMgr_StartMoving) == 0x000008, "Wrong size on RichmanLoveMgr_StartMoving");
static_assert(offsetof(RichmanLoveMgr_StartMoving, Steps) == 0x000000, "Member 'RichmanLoveMgr_StartMoving::Steps' has a wrong offset!");
static_assert(offsetof(RichmanLoveMgr_StartMoving, InForce) == 0x000004, "Member 'RichmanLoveMgr_StartMoving::InForce' has a wrong offset!");
static_assert(offsetof(RichmanLoveMgr_StartMoving, IsCustom) == 0x000005, "Member 'RichmanLoveMgr_StartMoving::IsCustom' has a wrong offset!");

// Function RichmanLove.RichmanLoveMgr.UpdateSpineCommunication
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveMgr_UpdateSpineCommunication final
{
public:
	class AActor*                                 InGirl;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveMgr_UpdateSpineCommunication) == 0x000008, "Wrong alignment on RichmanLoveMgr_UpdateSpineCommunication");
static_assert(sizeof(RichmanLoveMgr_UpdateSpineCommunication) == 0x000008, "Wrong size on RichmanLoveMgr_UpdateSpineCommunication");
static_assert(offsetof(RichmanLoveMgr_UpdateSpineCommunication, InGirl) == 0x000000, "Member 'RichmanLoveMgr_UpdateSpineCommunication::InGirl' has a wrong offset!");

// Function RichmanLove.RichmanLoveSaveComponent.AddAbility
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveSaveComponent_AddAbility final
{
public:
	ERichmanLovePlayerAbility                     InAbility;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InValue;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveSaveComponent_AddAbility) == 0x000004, "Wrong alignment on RichmanLoveSaveComponent_AddAbility");
static_assert(sizeof(RichmanLoveSaveComponent_AddAbility) == 0x000008, "Wrong size on RichmanLoveSaveComponent_AddAbility");
static_assert(offsetof(RichmanLoveSaveComponent_AddAbility, InAbility) == 0x000000, "Member 'RichmanLoveSaveComponent_AddAbility::InAbility' has a wrong offset!");
static_assert(offsetof(RichmanLoveSaveComponent_AddAbility, InValue) == 0x000004, "Member 'RichmanLoveSaveComponent_AddAbility::InValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveSaveComponent.AddItem
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveSaveComponent_AddItem final
{
public:
	int32                                         InTplId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveSaveComponent_AddItem) == 0x000004, "Wrong alignment on RichmanLoveSaveComponent_AddItem");
static_assert(sizeof(RichmanLoveSaveComponent_AddItem) == 0x000008, "Wrong size on RichmanLoveSaveComponent_AddItem");
static_assert(offsetof(RichmanLoveSaveComponent_AddItem, InTplId) == 0x000000, "Member 'RichmanLoveSaveComponent_AddItem::InTplId' has a wrong offset!");
static_assert(offsetof(RichmanLoveSaveComponent_AddItem, ReturnValue) == 0x000004, "Member 'RichmanLoveSaveComponent_AddItem::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveSaveComponent.AddPlotRead
// 0x000C (0x000C - 0x0000)
struct RichmanLoveSaveComponent_AddPlotRead final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InGirlId;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RichmanLoveSaveComponent_AddPlotRead) == 0x000004, "Wrong alignment on RichmanLoveSaveComponent_AddPlotRead");
static_assert(sizeof(RichmanLoveSaveComponent_AddPlotRead) == 0x00000C, "Wrong size on RichmanLoveSaveComponent_AddPlotRead");
static_assert(offsetof(RichmanLoveSaveComponent_AddPlotRead, InId) == 0x000000, "Member 'RichmanLoveSaveComponent_AddPlotRead::InId' has a wrong offset!");
static_assert(offsetof(RichmanLoveSaveComponent_AddPlotRead, InGirlId) == 0x000004, "Member 'RichmanLoveSaveComponent_AddPlotRead::InGirlId' has a wrong offset!");
static_assert(offsetof(RichmanLoveSaveComponent_AddPlotRead, ReturnValue) == 0x000008, "Member 'RichmanLoveSaveComponent_AddPlotRead::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveSaveComponent.AddState
// 0x000C (0x000C - 0x0000)
struct RichmanLoveSaveComponent_AddState final
{
public:
	ERichmanLovePlayerState                       InState;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InDay;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveSaveComponent_AddState) == 0x000004, "Wrong alignment on RichmanLoveSaveComponent_AddState");
static_assert(sizeof(RichmanLoveSaveComponent_AddState) == 0x00000C, "Wrong size on RichmanLoveSaveComponent_AddState");
static_assert(offsetof(RichmanLoveSaveComponent_AddState, InState) == 0x000000, "Member 'RichmanLoveSaveComponent_AddState::InState' has a wrong offset!");
static_assert(offsetof(RichmanLoveSaveComponent_AddState, InDay) == 0x000004, "Member 'RichmanLoveSaveComponent_AddState::InDay' has a wrong offset!");
static_assert(offsetof(RichmanLoveSaveComponent_AddState, ReturnValue) == 0x000008, "Member 'RichmanLoveSaveComponent_AddState::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveSaveComponent.ApplyUseItem
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveSaveComponent_ApplyUseItem final
{
public:
	int32                                         InUId;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RichmanLoveSaveComponent_ApplyUseItem) == 0x000004, "Wrong alignment on RichmanLoveSaveComponent_ApplyUseItem");
static_assert(sizeof(RichmanLoveSaveComponent_ApplyUseItem) == 0x000008, "Wrong size on RichmanLoveSaveComponent_ApplyUseItem");
static_assert(offsetof(RichmanLoveSaveComponent_ApplyUseItem, InUId) == 0x000000, "Member 'RichmanLoveSaveComponent_ApplyUseItem::InUId' has a wrong offset!");
static_assert(offsetof(RichmanLoveSaveComponent_ApplyUseItem, ReturnValue) == 0x000004, "Member 'RichmanLoveSaveComponent_ApplyUseItem::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveSaveComponent.CheckDuringSpWeek
// 0x0001 (0x0001 - 0x0000)
struct RichmanLoveSaveComponent_CheckDuringSpWeek final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveSaveComponent_CheckDuringSpWeek) == 0x000001, "Wrong alignment on RichmanLoveSaveComponent_CheckDuringSpWeek");
static_assert(sizeof(RichmanLoveSaveComponent_CheckDuringSpWeek) == 0x000001, "Wrong size on RichmanLoveSaveComponent_CheckDuringSpWeek");
static_assert(offsetof(RichmanLoveSaveComponent_CheckDuringSpWeek, ReturnValue) == 0x000000, "Member 'RichmanLoveSaveComponent_CheckDuringSpWeek::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveSaveComponent.CheckHasItem
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveSaveComponent_CheckHasItem final
{
public:
	int32                                         InTplId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RichmanLoveSaveComponent_CheckHasItem) == 0x000004, "Wrong alignment on RichmanLoveSaveComponent_CheckHasItem");
static_assert(sizeof(RichmanLoveSaveComponent_CheckHasItem) == 0x000008, "Wrong size on RichmanLoveSaveComponent_CheckHasItem");
static_assert(offsetof(RichmanLoveSaveComponent_CheckHasItem, InTplId) == 0x000000, "Member 'RichmanLoveSaveComponent_CheckHasItem::InTplId' has a wrong offset!");
static_assert(offsetof(RichmanLoveSaveComponent_CheckHasItem, ReturnValue) == 0x000004, "Member 'RichmanLoveSaveComponent_CheckHasItem::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveSaveComponent.CheckIsLastWeek
// 0x0001 (0x0001 - 0x0000)
struct RichmanLoveSaveComponent_CheckIsLastWeek final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveSaveComponent_CheckIsLastWeek) == 0x000001, "Wrong alignment on RichmanLoveSaveComponent_CheckIsLastWeek");
static_assert(sizeof(RichmanLoveSaveComponent_CheckIsLastWeek) == 0x000001, "Wrong size on RichmanLoveSaveComponent_CheckIsLastWeek");
static_assert(offsetof(RichmanLoveSaveComponent_CheckIsLastWeek, ReturnValue) == 0x000000, "Member 'RichmanLoveSaveComponent_CheckIsLastWeek::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveSaveComponent.CheckPlotIsRead
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveSaveComponent_CheckPlotIsRead final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RichmanLoveSaveComponent_CheckPlotIsRead) == 0x000004, "Wrong alignment on RichmanLoveSaveComponent_CheckPlotIsRead");
static_assert(sizeof(RichmanLoveSaveComponent_CheckPlotIsRead) == 0x000008, "Wrong size on RichmanLoveSaveComponent_CheckPlotIsRead");
static_assert(offsetof(RichmanLoveSaveComponent_CheckPlotIsRead, InId) == 0x000000, "Member 'RichmanLoveSaveComponent_CheckPlotIsRead::InId' has a wrong offset!");
static_assert(offsetof(RichmanLoveSaveComponent_CheckPlotIsRead, ReturnValue) == 0x000004, "Member 'RichmanLoveSaveComponent_CheckPlotIsRead::ReturnValue' has a wrong offset!");

// Function RichmanLove.RichmanLoveSaveComponent.DiscardPopOut
// 0x0004 (0x0004 - 0x0000)
struct RichmanLoveSaveComponent_DiscardPopOut final
{
public:
	int32                                         InUId;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichmanLoveSaveComponent_DiscardPopOut) == 0x000004, "Wrong alignment on RichmanLoveSaveComponent_DiscardPopOut");
static_assert(sizeof(RichmanLoveSaveComponent_DiscardPopOut) == 0x000004, "Wrong size on RichmanLoveSaveComponent_DiscardPopOut");
static_assert(offsetof(RichmanLoveSaveComponent_DiscardPopOut, InUId) == 0x000000, "Member 'RichmanLoveSaveComponent_DiscardPopOut::InUId' has a wrong offset!");

// Function RichmanLove.RichmanLoveSaveComponent.DynamicAddSpGround
// 0x0001 (0x0001 - 0x0000)
struct RichmanLoveSaveComponent_DynamicAddSpGround final
