#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RoleLightController

#include "Basic.hpp"


namespace SDK::Params
{

// Function RoleLightController.RoleLightController_C.UpdateMaterialVolume
// 0x0048 (0x0048 - 0x0000)
struct RoleLightController_C_UpdateMaterialVolume final
{
public:
	class AMaterialControlVolume*                 OtherMaterialVolume;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABaseMonster_C*>                 CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm)
	TArray<class ABP_Girl_Head_Base_C*>           CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0018(0x0010)(ReferenceParm)
	TArray<class AGameCharacter*>                 CallFunc_GetAllActorsOfClass_OutActors_2;          // 0x0028(0x0010)(ReferenceParm)
	TArray<class ACharacterAccessory*>            CallFunc_GetAllActorsOfClass_OutActors_3;          // 0x0038(0x0010)(ReferenceParm)
};
static_assert(alignof(RoleLightController_C_UpdateMaterialVolume) == 0x000008, "Wrong alignment on RoleLightController_C_UpdateMaterialVolume");
static_assert(sizeof(RoleLightController_C_UpdateMaterialVolume) == 0x000048, "Wrong size on RoleLightController_C_UpdateMaterialVolume");
static_assert(offsetof(RoleLightController_C_UpdateMaterialVolume, OtherMaterialVolume) == 0x000000, "Member 'RoleLightController_C_UpdateMaterialVolume::OtherMaterialVolume' has a wrong offset!");
static_assert(offsetof(RoleLightController_C_UpdateMaterialVolume, CallFunc_GetAllActorsOfClass_OutActors) == 0x000008, "Member 'RoleLightController_C_UpdateMaterialVolume::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(RoleLightController_C_UpdateMaterialVolume, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000018, "Member 'RoleLightController_C_UpdateMaterialVolume::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(RoleLightController_C_UpdateMaterialVolume, CallFunc_GetAllActorsOfClass_OutActors_2) == 0x000028, "Member 'RoleLightController_C_UpdateMaterialVolume::CallFunc_GetAllActorsOfClass_OutActors_2' has a wrong offset!");
static_assert(offsetof(RoleLightController_C_UpdateMaterialVolume, CallFunc_GetAllActorsOfClass_OutActors_3) == 0x000038, "Member 'RoleLightController_C_UpdateMaterialVolume::CallFunc_GetAllActorsOfClass_OutActors_3' has a wrong offset!");

// Function RoleLightController.RoleLightController_C.UpdateManually
// 0x0040 (0x0040 - 0x0000)
struct RoleLightController_C_UpdateManually final
{
public:
	TArray<class ABP_Girl_Head_Base_C*>           CallFunc_GetAllActorsOfClass_OutActors;            // 0x0000(0x0010)(ReferenceParm)
	TArray<class AGameCharacter*>                 CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0010(0x0010)(ReferenceParm)
	TArray<class AHouseBaseCharacter*>            CallFunc_GetAllActorsOfClass_OutActors_2;          // 0x0020(0x0010)(ReferenceParm)
	TArray<class ASkeletalMeshActor*>             CallFunc_GetAllActorsOfClass_OutActors_3;          // 0x0030(0x0010)(ReferenceParm)
};
static_assert(alignof(RoleLightController_C_UpdateManually) == 0x000008, "Wrong alignment on RoleLightController_C_UpdateManually");
static_assert(sizeof(RoleLightController_C_UpdateManually) == 0x000040, "Wrong size on RoleLightController_C_UpdateManually");
static_assert(offsetof(RoleLightController_C_UpdateManually, CallFunc_GetAllActorsOfClass_OutActors) == 0x000000, "Member 'RoleLightController_C_UpdateManually::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(RoleLightController_C_UpdateManually, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000010, "Member 'RoleLightController_C_UpdateManually::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(RoleLightController_C_UpdateManually, CallFunc_GetAllActorsOfClass_OutActors_2) == 0x000020, "Member 'RoleLightController_C_UpdateManually::CallFunc_GetAllActorsOfClass_OutActors_2' has a wrong offset!");
static_assert(offsetof(RoleLightController_C_UpdateManually, CallFunc_GetAllActorsOfClass_OutActors_3) == 0x000030, "Member 'RoleLightController_C_UpdateManually::CallFunc_GetAllActorsOfClass_OutActors_3' has a wrong offset!");

// Function RoleLightController.RoleLightController_C.ExecuteUbergraph_RoleLightController
// 0x0004 (0x0004 - 0x0000)
struct RoleLightController_C_ExecuteUbergraph_RoleLightController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RoleLightController_C_ExecuteUbergraph_RoleLightController) == 0x000004, "Wrong alignment on RoleLightController_C_ExecuteUbergraph_RoleLightController");
static_assert(sizeof(RoleLightController_C_ExecuteUbergraph_RoleLightController) == 0x000004, "Wrong size on RoleLightController_C_ExecuteUbergraph_RoleLightController");
static_assert(offsetof(RoleLightController_C_ExecuteUbergraph_RoleLightController, EntryPoint) == 0x000000, "Member 'RoleLightController_C_ExecuteUbergraph_RoleLightController::EntryPoint' has a wrong offset!");

}

