#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RVT

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct RVT.RuntimeVirtualTextureVolumeSetting
// 0x0038 (0x0038 - 0x0000)
struct FRuntimeVirtualTextureVolumeSetting final
{
public:
	TSoftObjectPtr<class AActor>                  InBoundsAlignActor;                                // 0x0000(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URuntimeVirtualTexture*                 DrawInVirtualTexture;                              // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSnapBoundsToLandscape;                            // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInHidePrimitives;                                 // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableScalability;                                // 0x0032(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InScalabilityGroup;                                // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRuntimeVirtualTextureVolumeSetting) == 0x000008, "Wrong alignment on FRuntimeVirtualTextureVolumeSetting");
static_assert(sizeof(FRuntimeVirtualTextureVolumeSetting) == 0x000038, "Wrong size on FRuntimeVirtualTextureVolumeSetting");
static_assert(offsetof(FRuntimeVirtualTextureVolumeSetting, InBoundsAlignActor) == 0x000000, "Member 'FRuntimeVirtualTextureVolumeSetting::InBoundsAlignActor' has a wrong offset!");
static_assert(offsetof(FRuntimeVirtualTextureVolumeSetting, DrawInVirtualTexture) == 0x000028, "Member 'FRuntimeVirtualTextureVolumeSetting::DrawInVirtualTexture' has a wrong offset!");
static_assert(offsetof(FRuntimeVirtualTextureVolumeSetting, bSnapBoundsToLandscape) == 0x000030, "Member 'FRuntimeVirtualTextureVolumeSetting::bSnapBoundsToLandscape' has a wrong offset!");
static_assert(offsetof(FRuntimeVirtualTextureVolumeSetting, bInHidePrimitives) == 0x000031, "Member 'FRuntimeVirtualTextureVolumeSetting::bInHidePrimitives' has a wrong offset!");
static_assert(offsetof(FRuntimeVirtualTextureVolumeSetting, bEnableScalability) == 0x000032, "Member 'FRuntimeVirtualTextureVolumeSetting::bEnableScalability' has a wrong offset!");
static_assert(offsetof(FRuntimeVirtualTextureVolumeSetting, InScalabilityGroup) == 0x000034, "Member 'FRuntimeVirtualTextureVolumeSetting::InScalabilityGroup' has a wrong offset!");

// ScriptStruct RVT.VirtualTextureLandScapeSetting
// 0x0038 (0x0038 - 0x0000)
struct FVirtualTextureLandScapeSetting final
{
public:
	TSoftObjectPtr<class URuntimeVirtualTexture>  DrawInVirtualTexture;                              // 0x0000(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERuntimeVirtualTextureMainPassType            EVirtualTextureMainPassType;                       // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VirtualTextureNumLods;                             // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VirtualTextureLodBias;                             // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVirtualTextureLandScapeSetting) == 0x000008, "Wrong alignment on FVirtualTextureLandScapeSetting");
static_assert(sizeof(FVirtualTextureLandScapeSetting) == 0x000038, "Wrong size on FVirtualTextureLandScapeSetting");
static_assert(offsetof(FVirtualTextureLandScapeSetting, DrawInVirtualTexture) == 0x000000, "Member 'FVirtualTextureLandScapeSetting::DrawInVirtualTexture' has a wrong offset!");
static_assert(offsetof(FVirtualTextureLandScapeSetting, EVirtualTextureMainPassType) == 0x000028, "Member 'FVirtualTextureLandScapeSetting::EVirtualTextureMainPassType' has a wrong offset!");
static_assert(offsetof(FVirtualTextureLandScapeSetting, VirtualTextureNumLods) == 0x00002C, "Member 'FVirtualTextureLandScapeSetting::VirtualTextureNumLods' has a wrong offset!");
static_assert(offsetof(FVirtualTextureLandScapeSetting, VirtualTextureLodBias) == 0x000030, "Member 'FVirtualTextureLandScapeSetting::VirtualTextureLodBias' has a wrong offset!");

// ScriptStruct RVT.VirtualTextureDecalMeshSetting
// 0x0040 (0x0040 - 0x0000)
struct FVirtualTextureDecalMeshSetting final
{
public:
	TSoftObjectPtr<class URuntimeVirtualTexture>  DrawInVirtualTexture;                              // 0x0000(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERuntimeVirtualTextureMainPassType            EVirtualTextureMainPassType;                       // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VirtualTextureLodBias;                             // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VirtualTextureCullMips;                            // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VirtualTextureMinCoverage;                         // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TranslucencySortPriority;                          // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVirtualTextureDecalMeshSetting) == 0x000008, "Wrong alignment on FVirtualTextureDecalMeshSetting");
static_assert(sizeof(FVirtualTextureDecalMeshSetting) == 0x000040, "Wrong size on FVirtualTextureDecalMeshSetting");
static_assert(offsetof(FVirtualTextureDecalMeshSetting, DrawInVirtualTexture) == 0x000000, "Member 'FVirtualTextureDecalMeshSetting::DrawInVirtualTexture' has a wrong offset!");
static_assert(offsetof(FVirtualTextureDecalMeshSetting, EVirtualTextureMainPassType) == 0x000028, "Member 'FVirtualTextureDecalMeshSetting::EVirtualTextureMainPassType' has a wrong offset!");
static_assert(offsetof(FVirtualTextureDecalMeshSetting, VirtualTextureLodBias) == 0x00002C, "Member 'FVirtualTextureDecalMeshSetting::VirtualTextureLodBias' has a wrong offset!");
static_assert(offsetof(FVirtualTextureDecalMeshSetting, VirtualTextureCullMips) == 0x000030, "Member 'FVirtualTextureDecalMeshSetting::VirtualTextureCullMips' has a wrong offset!");
static_assert(offsetof(FVirtualTextureDecalMeshSetting, VirtualTextureMinCoverage) == 0x000034, "Member 'FVirtualTextureDecalMeshSetting::VirtualTextureMinCoverage' has a wrong offset!");
static_assert(offsetof(FVirtualTextureDecalMeshSetting, TranslucencySortPriority) == 0x000038, "Member 'FVirtualTextureDecalMeshSetting::TranslucencySortPriority' has a wrong offset!");

// ScriptStruct RVT.VirtualTextureStaticMeshActorSetting
// 0x0040 (0x0040 - 0x0000)
struct FVirtualTextureStaticMeshActorSetting final
{
public:
	TSoftObjectPtr<class URuntimeVirtualTexture>  DrawInVirtualTexture;                              // 0x0000(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERuntimeVirtualTextureMainPassType            EVirtualTextureMainPassType;                       // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VirtualTextureLodBias;                             // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VirtualTextureCullMips;                            // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VirtualTextureMinCoverage;                         // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TranslucencySortPriority;                          // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVirtualTextureStaticMeshActorSetting) == 0x000008, "Wrong alignment on FVirtualTextureStaticMeshActorSetting");
static_assert(sizeof(FVirtualTextureStaticMeshActorSetting) == 0x000040, "Wrong size on FVirtualTextureStaticMeshActorSetting");
static_assert(offsetof(FVirtualTextureStaticMeshActorSetting, DrawInVirtualTexture) == 0x000000, "Member 'FVirtualTextureStaticMeshActorSetting::DrawInVirtualTexture' has a wrong offset!");
static_assert(offsetof(FVirtualTextureStaticMeshActorSetting, EVirtualTextureMainPassType) == 0x000028, "Member 'FVirtualTextureStaticMeshActorSetting::EVirtualTextureMainPassType' has a wrong offset!");
static_assert(offsetof(FVirtualTextureStaticMeshActorSetting, VirtualTextureLodBias) == 0x00002C, "Member 'FVirtualTextureStaticMeshActorSetting::VirtualTextureLodBias' has a wrong offset!");
static_assert(offsetof(FVirtualTextureStaticMeshActorSetting, VirtualTextureCullMips) == 0x000030, "Member 'FVirtualTextureStaticMeshActorSetting::VirtualTextureCullMips' has a wrong offset!");
static_assert(offsetof(FVirtualTextureStaticMeshActorSetting, VirtualTextureMinCoverage) == 0x000034, "Member 'FVirtualTextureStaticMeshActorSetting::VirtualTextureMinCoverage' has a wrong offset!");
static_assert(offsetof(FVirtualTextureStaticMeshActorSetting, TranslucencySortPriority) == 0x000038, "Member 'FVirtualTextureStaticMeshActorSetting::TranslucencySortPriority' has a wrong offset!");

// ScriptStruct RVT.VirtualTextureRVTActorSetting
// 0x0048 (0x0048 - 0x0000)
struct FVirtualTextureRVTActorSetting final
{
public:
	bool                                          bUseVirtualTexture;                                // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class URuntimeVirtualTexture>  DrawInVirtualTexture;                              // 0x0008(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERuntimeVirtualTextureMainPassType            EVirtualTextureMainPassType;                       // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VirtualTextureLodBias;                             // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VirtualTextureCullMips;                            // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VirtualTextureMinCoverage;                         // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TranslucencySortPriority;                          // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVirtualTextureRVTActorSetting) == 0x000008, "Wrong alignment on FVirtualTextureRVTActorSetting");
static_assert(sizeof(FVirtualTextureRVTActorSetting) == 0x000048, "Wrong size on FVirtualTextureRVTActorSetting");
static_assert(offsetof(FVirtualTextureRVTActorSetting, bUseVirtualTexture) == 0x000000, "Member 'FVirtualTextureRVTActorSetting::bUseVirtualTexture' has a wrong offset!");
static_assert(offsetof(FVirtualTextureRVTActorSetting, DrawInVirtualTexture) == 0x000008, "Member 'FVirtualTextureRVTActorSetting::DrawInVirtualTexture' has a wrong offset!");
static_assert(offsetof(FVirtualTextureRVTActorSetting, EVirtualTextureMainPassType) == 0x000030, "Member 'FVirtualTextureRVTActorSetting::EVirtualTextureMainPassType' has a wrong offset!");
static_assert(offsetof(FVirtualTextureRVTActorSetting, VirtualTextureLodBias) == 0x000034, "Member 'FVirtualTextureRVTActorSetting::VirtualTextureLodBias' has a wrong offset!");
static_assert(offsetof(FVirtualTextureRVTActorSetting, VirtualTextureCullMips) == 0x000038, "Member 'FVirtualTextureRVTActorSetting::VirtualTextureCullMips' has a wrong offset!");
static_assert(offsetof(FVirtualTextureRVTActorSetting, VirtualTextureMinCoverage) == 0x00003C, "Member 'FVirtualTextureRVTActorSetting::VirtualTextureMinCoverage' has a wrong offset!");
static_assert(offsetof(FVirtualTextureRVTActorSetting, TranslucencySortPriority) == 0x000040, "Member 'FVirtualTextureRVTActorSetting::TranslucencySortPriority' has a wrong offset!");

}

