#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScreenMatching

#include "Basic.hpp"


namespace SDK::Params
{

// Function ScreenMatching.ScreenMatchingSettings.GetSafeZoneRowValue
// 0x0004 (0x0004 - 0x0000)
struct ScreenMatchingSettings_GetSafeZoneRowValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScreenMatchingSettings_GetSafeZoneRowValue) == 0x000004, "Wrong alignment on ScreenMatchingSettings_GetSafeZoneRowValue");
static_assert(sizeof(ScreenMatchingSettings_GetSafeZoneRowValue) == 0x000004, "Wrong size on ScreenMatchingSettings_GetSafeZoneRowValue");
static_assert(offsetof(ScreenMatchingSettings_GetSafeZoneRowValue, ReturnValue) == 0x000000, "Member 'ScreenMatchingSettings_GetSafeZoneRowValue::ReturnValue' has a wrong offset!");

// Function ScreenMatching.ScreenMatchingSettings.IsMatched
// 0x0001 (0x0001 - 0x0000)
struct ScreenMatchingSettings_IsMatched final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScreenMatchingSettings_IsMatched) == 0x000001, "Wrong alignment on ScreenMatchingSettings_IsMatched");
static_assert(sizeof(ScreenMatchingSettings_IsMatched) == 0x000001, "Wrong size on ScreenMatchingSettings_IsMatched");
static_assert(offsetof(ScreenMatchingSettings_IsMatched, ReturnValue) == 0x000000, "Member 'ScreenMatchingSettings_IsMatched::ReturnValue' has a wrong offset!");

}

