#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SeasunAccount

#include "Basic.hpp"

#include "GameCore_structs.hpp"


namespace SDK
{

// Enum SeasunAccount.EItemType
// NumValues: 0x0017
enum class EItemType : uint8
{
	Error                                    = 0,
	CharacterCard                            = 1,
	Weapon                                   = 2,
	SupporterCard                            = 3,
	Useable                                  = 4,
	Suplies                                  = 5,
	WeaponParts                              = 6,
	CharacterSkin                            = 7,
	HouseGift                                = 8,
	ProfileFace                              = 9,
	ProfileFrame                             = 10,
	Badge                                    = 11,
	Cover                                    = 12,
	NameCard                                 = 13,
	Expression                               = 14,
	Bubble                                   = 15,
	Analyst                                  = 16,
	WeaponSkin                               = 17,
	MonsterCard                              = 18,
	Manifestation                            = 19,
	CardSkinPart                             = 20,
	MainScene                                = 21,
	EItemType_MAX                            = 22,
};

// Enum SeasunAccount.EMonsterCardSlotType
// NumValues: 0x000F
enum class EMonsterCardSlotType : uint8
{
	Error                                    = 0,
	SkillId1                                 = 1,
	Skill1Level                              = 2,
	SkillId2                                 = 3,
	Skill2Level                              = 4,
	SkillId3                                 = 5,
	Skill3Level                              = 6,
	SkillId4                                 = 7,
	Skill4Level                              = 8,
	SkillId5                                 = 9,
	Skill5Level                              = 10,
	SkillId6                                 = 11,
	Skill6Level                              = 12,
	Other                                    = 13,
	EMonsterCardSlotType_MAX                 = 14,
};

// Enum SeasunAccount.ESupliesType
// NumValues: 0x0007
enum class ESupliesType : uint8
{
	Error                                    = 0,
	CharacterCardFragment                    = 1,
	CharacterCardNurture                     = 2,
	WeaponNurture                            = 3,
	SupporterCardNurture                     = 4,
	Other                                    = 5,
	ESupliesType_MAX                         = 6,
};

// Enum SeasunAccount.ECardSlotType
// NumValues: 0x000F
enum class ECardSlotType : uint8
{
	Error                                    = 0,
	SupporterCard1                           = 1,
	SupporterCard2                           = 2,
	SupporterCard3                           = 3,
	Weapon                                   = 4,
	Skin                                     = 5,
	WeaponSkin                               = 6,
	SupporterCardIndex                       = 7,
	SupporterCard4                           = 8,
	SupporterCard5                           = 9,
	SupporterCard6                           = 10,
	SupporterCard7                           = 11,
	SupporterCard8                           = 12,
	SupporterCard9                           = 13,
	ECardSlotType_MAX                        = 14,
};

// Enum SeasunAccount.EWeaponSlotType
// NumValues: 0x000B
enum class EWeaponSlotType : uint8
{
	Error                                    = 0,
	Muzzle                                   = 1,
	TopGuide                                 = 2,
	Butt                                     = 3,
	Ammunition                               = 4,
	LowerGuide                               = 5,
	Trigger                                  = 6,
	Grip                                     = 7,
	Sight                                    = 8,
	Stabilizer                               = 9,
	EWeaponSlotType_MAX                      = 10,
};

// ScriptStruct SeasunAccount.SpineNodeGrowTemplate
// 0x001C (0x001C - 0x0000)
struct FSpineNodeGrowTemplate final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Health;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Attack;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Defence;                                           // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CriticalValue;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CriticalDamage;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Command;                                           // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSpineNodeGrowTemplate) == 0x000004, "Wrong alignment on FSpineNodeGrowTemplate");
static_assert(sizeof(FSpineNodeGrowTemplate) == 0x00001C, "Wrong size on FSpineNodeGrowTemplate");
static_assert(offsetof(FSpineNodeGrowTemplate, ID) == 0x000000, "Member 'FSpineNodeGrowTemplate::ID' has a wrong offset!");
static_assert(offsetof(FSpineNodeGrowTemplate, Health) == 0x000004, "Member 'FSpineNodeGrowTemplate::Health' has a wrong offset!");
static_assert(offsetof(FSpineNodeGrowTemplate, Attack) == 0x000008, "Member 'FSpineNodeGrowTemplate::Attack' has a wrong offset!");
static_assert(offsetof(FSpineNodeGrowTemplate, Defence) == 0x00000C, "Member 'FSpineNodeGrowTemplate::Defence' has a wrong offset!");
static_assert(offsetof(FSpineNodeGrowTemplate, CriticalValue) == 0x000010, "Member 'FSpineNodeGrowTemplate::CriticalValue' has a wrong offset!");
static_assert(offsetof(FSpineNodeGrowTemplate, CriticalDamage) == 0x000014, "Member 'FSpineNodeGrowTemplate::CriticalDamage' has a wrong offset!");
static_assert(offsetof(FSpineNodeGrowTemplate, Command) == 0x000018, "Member 'FSpineNodeGrowTemplate::Command' has a wrong offset!");

// ScriptStruct SeasunAccount.ItemTemplate
// 0x0130 (0x0130 - 0x0000)
struct FItemTemplate final
{
public:
	int32                                         Genre;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Detail;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Particular;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Level;                                             // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LuaType;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 I18N;                                              // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Color;                                             // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InitBreak;                                         // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Icon;                                              // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CompanyID;                                         // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CanStack;                                          // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EvolutionMatID;                                    // 0x0044(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BreakMatID;                                        // 0x0048(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LevelLimitID;                                      // 0x004C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BreakLimitID;                                      // 0x0050(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RecycleID;                                         // 0x0054(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param1;                                            // 0x0058(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param2;                                            // 0x005C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param3;                                            // 0x0060(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ATime;                                             // 0x0068(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 GrowupID;                                          // 0x0078(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         AppearID;                                          // 0x0088(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 ExAppearIDs;                                       // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FTemplateId                            DefaultWeaponGPDL;                                 // 0x00A0(0x0010)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ProvideExp;                                        // 0x00B0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ConsumeGold;                                       // 0x00B4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EvolutionGold;                                     // 0x00B8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ProvideGold;                                       // 0x00BC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 DefaultSkills;                                     // 0x00C0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 SkillFixIDs;                                       // 0x00D0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         SuitSkill;                                         // 0x00E0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SpineID;                                           // 0x00E4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ForFree;                                           // 0x00E8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 PiecesGDPLN;                                       // 0x00F0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         EXIcon;                                            // 0x0100(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IconBreak;                                         // 0x0104(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Classify;                                          // 0x0108(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SPAttackTimes;                                     // 0x010C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 Attribute;                                         // 0x0110(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 Positioning;                                       // 0x0120(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FItemTemplate) == 0x000008, "Wrong alignment on FItemTemplate");
static_assert(sizeof(FItemTemplate) == 0x000130, "Wrong size on FItemTemplate");
static_assert(offsetof(FItemTemplate, Genre) == 0x000000, "Member 'FItemTemplate::Genre' has a wrong offset!");
static_assert(offsetof(FItemTemplate, Detail) == 0x000004, "Member 'FItemTemplate::Detail' has a wrong offset!");
static_assert(offsetof(FItemTemplate, Particular) == 0x000008, "Member 'FItemTemplate::Particular' has a wrong offset!");
static_assert(offsetof(FItemTemplate, Level) == 0x00000C, "Member 'FItemTemplate::Level' has a wrong offset!");
static_assert(offsetof(FItemTemplate, LuaType) == 0x000010, "Member 'FItemTemplate::LuaType' has a wrong offset!");
static_assert(offsetof(FItemTemplate, I18N) == 0x000020, "Member 'FItemTemplate::I18N' has a wrong offset!");
static_assert(offsetof(FItemTemplate, Color) == 0x000030, "Member 'FItemTemplate::Color' has a wrong offset!");
static_assert(offsetof(FItemTemplate, InitBreak) == 0x000034, "Member 'FItemTemplate::InitBreak' has a wrong offset!");
static_assert(offsetof(FItemTemplate, Icon) == 0x000038, "Member 'FItemTemplate::Icon' has a wrong offset!");
static_assert(offsetof(FItemTemplate, CompanyID) == 0x00003C, "Member 'FItemTemplate::CompanyID' has a wrong offset!");
static_assert(offsetof(FItemTemplate, CanStack) == 0x000040, "Member 'FItemTemplate::CanStack' has a wrong offset!");
static_assert(offsetof(FItemTemplate, EvolutionMatID) == 0x000044, "Member 'FItemTemplate::EvolutionMatID' has a wrong offset!");
static_assert(offsetof(FItemTemplate, BreakMatID) == 0x000048, "Member 'FItemTemplate::BreakMatID' has a wrong offset!");
static_assert(offsetof(FItemTemplate, LevelLimitID) == 0x00004C, "Member 'FItemTemplate::LevelLimitID' has a wrong offset!");
static_assert(offsetof(FItemTemplate, BreakLimitID) == 0x000050, "Member 'FItemTemplate::BreakLimitID' has a wrong offset!");
static_assert(offsetof(FItemTemplate, RecycleID) == 0x000054, "Member 'FItemTemplate::RecycleID' has a wrong offset!");
static_assert(offsetof(FItemTemplate, Param1) == 0x000058, "Member 'FItemTemplate::Param1' has a wrong offset!");
static_assert(offsetof(FItemTemplate, Param2) == 0x00005C, "Member 'FItemTemplate::Param2' has a wrong offset!");
static_assert(offsetof(FItemTemplate, Param3) == 0x000060, "Member 'FItemTemplate::Param3' has a wrong offset!");
static_assert(offsetof(FItemTemplate, ATime) == 0x000068, "Member 'FItemTemplate::ATime' has a wrong offset!");
static_assert(offsetof(FItemTemplate, GrowupID) == 0x000078, "Member 'FItemTemplate::GrowupID' has a wrong offset!");
static_assert(offsetof(FItemTemplate, AppearID) == 0x000088, "Member 'FItemTemplate::AppearID' has a wrong offset!");
static_assert(offsetof(FItemTemplate, ExAppearIDs) == 0x000090, "Member 'FItemTemplate::ExAppearIDs' has a wrong offset!");
static_assert(offsetof(FItemTemplate, DefaultWeaponGPDL) == 0x0000A0, "Member 'FItemTemplate::DefaultWeaponGPDL' has a wrong offset!");
static_assert(offsetof(FItemTemplate, ProvideExp) == 0x0000B0, "Member 'FItemTemplate::ProvideExp' has a wrong offset!");
static_assert(offsetof(FItemTemplate, ConsumeGold) == 0x0000B4, "Member 'FItemTemplate::ConsumeGold' has a wrong offset!");
static_assert(offsetof(FItemTemplate, EvolutionGold) == 0x0000B8, "Member 'FItemTemplate::EvolutionGold' has a wrong offset!");
static_assert(offsetof(FItemTemplate, ProvideGold) == 0x0000BC, "Member 'FItemTemplate::ProvideGold' has a wrong offset!");
static_assert(offsetof(FItemTemplate, DefaultSkills) == 0x0000C0, "Member 'FItemTemplate::DefaultSkills' has a wrong offset!");
static_assert(offsetof(FItemTemplate, SkillFixIDs) == 0x0000D0, "Member 'FItemTemplate::SkillFixIDs' has a wrong offset!");
static_assert(offsetof(FItemTemplate, SuitSkill) == 0x0000E0, "Member 'FItemTemplate::SuitSkill' has a wrong offset!");
static_assert(offsetof(FItemTemplate, SpineID) == 0x0000E4, "Member 'FItemTemplate::SpineID' has a wrong offset!");
static_assert(offsetof(FItemTemplate, ForFree) == 0x0000E8, "Member 'FItemTemplate::ForFree' has a wrong offset!");
static_assert(offsetof(FItemTemplate, PiecesGDPLN) == 0x0000F0, "Member 'FItemTemplate::PiecesGDPLN' has a wrong offset!");
static_assert(offsetof(FItemTemplate, EXIcon) == 0x000100, "Member 'FItemTemplate::EXIcon' has a wrong offset!");
static_assert(offsetof(FItemTemplate, IconBreak) == 0x000104, "Member 'FItemTemplate::IconBreak' has a wrong offset!");
static_assert(offsetof(FItemTemplate, Classify) == 0x000108, "Member 'FItemTemplate::Classify' has a wrong offset!");
static_assert(offsetof(FItemTemplate, SPAttackTimes) == 0x00010C, "Member 'FItemTemplate::SPAttackTimes' has a wrong offset!");
static_assert(offsetof(FItemTemplate, Attribute) == 0x000110, "Member 'FItemTemplate::Attribute' has a wrong offset!");
static_assert(offsetof(FItemTemplate, Positioning) == 0x000120, "Member 'FItemTemplate::Positioning' has a wrong offset!");

// ScriptStruct SeasunAccount.MonsterCardAttributePoolTemplate
// 0x0028 (0x0028 - 0x0000)
struct FMonsterCardAttributePoolTemplate final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 AttributeList;                                     // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 LevelList;                                         // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMonsterCardAttributePoolTemplate) == 0x000008, "Wrong alignment on FMonsterCardAttributePoolTemplate");
static_assert(sizeof(FMonsterCardAttributePoolTemplate) == 0x000028, "Wrong size on FMonsterCardAttributePoolTemplate");
static_assert(offsetof(FMonsterCardAttributePoolTemplate, ID) == 0x000000, "Member 'FMonsterCardAttributePoolTemplate::ID' has a wrong offset!");
static_assert(offsetof(FMonsterCardAttributePoolTemplate, AttributeList) == 0x000008, "Member 'FMonsterCardAttributePoolTemplate::AttributeList' has a wrong offset!");
static_assert(offsetof(FMonsterCardAttributePoolTemplate, LevelList) == 0x000018, "Member 'FMonsterCardAttributePoolTemplate::LevelList' has a wrong offset!");

// ScriptStruct SeasunAccount.TrialSupporterCardTemplate
// 0x0030 (0x0030 - 0x0000)
struct FTrialSupporterCardTemplate final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 SupporterCardID;                                   // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         SupportLevel;                                      // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SupportBreak;                                      // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 SupporterAffix;                                    // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTrialSupporterCardTemplate) == 0x000008, "Wrong alignment on FTrialSupporterCardTemplate");
static_assert(sizeof(FTrialSupporterCardTemplate) == 0x000030, "Wrong size on FTrialSupporterCardTemplate");
static_assert(offsetof(FTrialSupporterCardTemplate, ID) == 0x000000, "Member 'FTrialSupporterCardTemplate::ID' has a wrong offset!");
static_assert(offsetof(FTrialSupporterCardTemplate, SupporterCardID) == 0x000008, "Member 'FTrialSupporterCardTemplate::SupporterCardID' has a wrong offset!");
static_assert(offsetof(FTrialSupporterCardTemplate, SupportLevel) == 0x000018, "Member 'FTrialSupporterCardTemplate::SupportLevel' has a wrong offset!");
static_assert(offsetof(FTrialSupporterCardTemplate, SupportBreak) == 0x00001C, "Member 'FTrialSupporterCardTemplate::SupportBreak' has a wrong offset!");
static_assert(offsetof(FTrialSupporterCardTemplate, SupporterAffix) == 0x000020, "Member 'FTrialSupporterCardTemplate::SupporterAffix' has a wrong offset!");

// ScriptStruct SeasunAccount.TrialWeaponTemplate
// 0x0038 (0x0038 - 0x0000)
struct FTrialWeaponTemplate final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 WeaponID;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         WeaponLevel;                                       // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WeaponBreak;                                       // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WeaponSkill;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 WeaponParts;                                       // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTrialWeaponTemplate) == 0x000008, "Wrong alignment on FTrialWeaponTemplate");
static_assert(sizeof(FTrialWeaponTemplate) == 0x000038, "Wrong size on FTrialWeaponTemplate");
static_assert(offsetof(FTrialWeaponTemplate, ID) == 0x000000, "Member 'FTrialWeaponTemplate::ID' has a wrong offset!");
static_assert(offsetof(FTrialWeaponTemplate, WeaponID) == 0x000008, "Member 'FTrialWeaponTemplate::WeaponID' has a wrong offset!");
static_assert(offsetof(FTrialWeaponTemplate, WeaponLevel) == 0x000018, "Member 'FTrialWeaponTemplate::WeaponLevel' has a wrong offset!");
static_assert(offsetof(FTrialWeaponTemplate, WeaponBreak) == 0x00001C, "Member 'FTrialWeaponTemplate::WeaponBreak' has a wrong offset!");
static_assert(offsetof(FTrialWeaponTemplate, WeaponSkill) == 0x000020, "Member 'FTrialWeaponTemplate::WeaponSkill' has a wrong offset!");
static_assert(offsetof(FTrialWeaponTemplate, WeaponParts) == 0x000028, "Member 'FTrialWeaponTemplate::WeaponParts' has a wrong offset!");

// ScriptStruct SeasunAccount.TrialCardTemplate
// 0x0080 (0x0080 - 0x0000)
struct FTrialCardTemplate final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CardID;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         CardLevel;                                         // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CardBreak;                                         // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CardProLevel;                                      // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CardSkill;                                         // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 Weapons;                                           // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 SupporterCards;                                    // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 Skin;                                              // 0x0058(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 WeaponSkin;                                        // 0x0068(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         OnlineFlag;                                        // 0x0078(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTrialCardTemplate) == 0x000008, "Wrong alignment on FTrialCardTemplate");
static_assert(sizeof(FTrialCardTemplate) == 0x000080, "Wrong size on FTrialCardTemplate");
static_assert(offsetof(FTrialCardTemplate, ID) == 0x000000, "Member 'FTrialCardTemplate::ID' has a wrong offset!");
static_assert(offsetof(FTrialCardTemplate, CardID) == 0x000008, "Member 'FTrialCardTemplate::CardID' has a wrong offset!");
static_assert(offsetof(FTrialCardTemplate, CardLevel) == 0x000018, "Member 'FTrialCardTemplate::CardLevel' has a wrong offset!");
static_assert(offsetof(FTrialCardTemplate, CardBreak) == 0x00001C, "Member 'FTrialCardTemplate::CardBreak' has a wrong offset!");
static_assert(offsetof(FTrialCardTemplate, CardProLevel) == 0x000020, "Member 'FTrialCardTemplate::CardProLevel' has a wrong offset!");
static_assert(offsetof(FTrialCardTemplate, CardSkill) == 0x000028, "Member 'FTrialCardTemplate::CardSkill' has a wrong offset!");
static_assert(offsetof(FTrialCardTemplate, Weapons) == 0x000038, "Member 'FTrialCardTemplate::Weapons' has a wrong offset!");
static_assert(offsetof(FTrialCardTemplate, SupporterCards) == 0x000048, "Member 'FTrialCardTemplate::SupporterCards' has a wrong offset!");
static_assert(offsetof(FTrialCardTemplate, Skin) == 0x000058, "Member 'FTrialCardTemplate::Skin' has a wrong offset!");
static_assert(offsetof(FTrialCardTemplate, WeaponSkin) == 0x000068, "Member 'FTrialCardTemplate::WeaponSkin' has a wrong offset!");
static_assert(offsetof(FTrialCardTemplate, OnlineFlag) == 0x000078, "Member 'FTrialCardTemplate::OnlineFlag' has a wrong offset!");

// ScriptStruct SeasunAccount.SpineNodeTemplate
// 0x0038 (0x0038 - 0x0000)
struct FSpineNodeTemplate final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Node;                                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x10];                                      // 0x0018(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Abilitys;                                          // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSpineNodeTemplate) == 0x000008, "Wrong alignment on FSpineNodeTemplate");
static_assert(sizeof(FSpineNodeTemplate) == 0x000038, "Wrong size on FSpineNodeTemplate");
static_assert(offsetof(FSpineNodeTemplate, ID) == 0x000000, "Member 'FSpineNodeTemplate::ID' has a wrong offset!");
static_assert(offsetof(FSpineNodeTemplate, Node) == 0x000008, "Member 'FSpineNodeTemplate::Node' has a wrong offset!");
static_assert(offsetof(FSpineNodeTemplate, Abilitys) == 0x000028, "Member 'FSpineNodeTemplate::Abilitys' has a wrong offset!");

// ScriptStruct SeasunAccount.SpineTemplate
// 0x0018 (0x0018 - 0x0000)
struct FSpineTemplate final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Spine;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSpineTemplate) == 0x000008, "Wrong alignment on FSpineTemplate");
static_assert(sizeof(FSpineTemplate) == 0x000018, "Wrong size on FSpineTemplate");
static_assert(offsetof(FSpineTemplate, ID) == 0x000000, "Member 'FSpineTemplate::ID' has a wrong offset!");
static_assert(offsetof(FSpineTemplate, Spine) == 0x000008, "Member 'FSpineTemplate::Spine' has a wrong offset!");

// ScriptStruct SeasunAccount.SupportAffixTemplate
// 0x0188 (0x0188 - 0x0000)
struct FSupportAffixTemplate final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 CriticalValue;                                     // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 CriticalDamageAddtion;                             // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 SkillIntensity;                                    // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 ShieldDynamicAddtion;                              // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 VigourRecoverSpeed;                                // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 ShootDamageBonus;                                  // 0x0058(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 SkillDamageBonus;                                  // 0x0068(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 HealBonus;                                         // 0x0078(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 HealthPer;                                         // 0x0088(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 AttackPer;                                         // 0x0098(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 DefencePer;                                        // 0x00A8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 Command;                                           // 0x00B8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 CharacterEnergyEfficiency;                         // 0x00C8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 FireDamageBonus;                                   // 0x00D8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 ThunderDamageBonus;                                // 0x00E8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 IceDamageBonus;                                    // 0x00F8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 EntityBulletDamageBonus;                           // 0x0108(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 SuperpowersDamageBonus;                            // 0x0118(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 SkillMastery;                                      // 0x0128(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 ShootMastery;                                      // 0x0138(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 NormalEnergySpeedPer;                              // 0x0148(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 SkillCDQuick;                                      // 0x0158(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 ElemExplosionRateAddtion;                          // 0x0168(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 CharacterEnergyMax;                                // 0x0178(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSupportAffixTemplate) == 0x000008, "Wrong alignment on FSupportAffixTemplate");
static_assert(sizeof(FSupportAffixTemplate) == 0x000188, "Wrong size on FSupportAffixTemplate");
static_assert(offsetof(FSupportAffixTemplate, ID) == 0x000000, "Member 'FSupportAffixTemplate::ID' has a wrong offset!");
static_assert(offsetof(FSupportAffixTemplate, CriticalValue) == 0x000008, "Member 'FSupportAffixTemplate::CriticalValue' has a wrong offset!");
static_assert(offsetof(FSupportAffixTemplate, CriticalDamageAddtion) == 0x000018, "Member 'FSupportAffixTemplate::CriticalDamageAddtion' has a wrong offset!");
static_assert(offsetof(FSupportAffixTemplate, SkillIntensity) == 0x000028, "Member 'FSupportAffixTemplate::SkillIntensity' has a wrong offset!");
static_assert(offsetof(FSupportAffixTemplate, ShieldDynamicAddtion) == 0x000038, "Member 'FSupportAffixTemplate::ShieldDynamicAddtion' has a wrong offset!");
static_assert(offsetof(FSupportAffixTemplate, VigourRecoverSpeed) == 0x000048, "Member 'FSupportAffixTemplate::VigourRecoverSpeed' has a wrong offset!");
static_assert(offsetof(FSupportAffixTemplate, ShootDamageBonus) == 0x000058, "Member 'FSupportAffixTemplate::ShootDamageBonus' has a wrong offset!");
static_assert(offsetof(FSupportAffixTemplate, SkillDamageBonus) == 0x000068, "Member 'FSupportAffixTemplate::SkillDamageBonus' has a wrong offset!");
static_assert(offsetof(FSupportAffixTemplate, HealBonus) == 0x000078, "Member 'FSupportAffixTemplate::HealBonus' has a wrong offset!");
static_assert(offsetof(FSupportAffixTemplate, HealthPer) == 0x000088, "Member 'FSupportAffixTemplate::HealthPer' has a wrong offset!");
static_assert(offsetof(FSupportAffixTemplate, AttackPer) == 0x000098, "Member 'FSupportAffixTemplate::AttackPer' has a wrong offset!");
static_assert(offsetof(FSupportAffixTemplate, DefencePer) == 0x0000A8, "Member 'FSupportAffixTemplate::DefencePer' has a wrong offset!");
static_assert(offsetof(FSupportAffixTemplate, Command) == 0x0000B8, "Member 'FSupportAffixTemplate::Command' has a wrong offset!");
static_assert(offsetof(FSupportAffixTemplate, CharacterEnergyEfficiency) == 0x0000C8, "Member 'FSupportAffixTemplate::CharacterEnergyEfficiency' has a wrong offset!");
static_assert(offsetof(FSupportAffixTemplate, FireDamageBonus) == 0x0000D8, "Member 'FSupportAffixTemplate::FireDamageBonus' has a wrong offset!");
static_assert(offsetof(FSupportAffixTemplate, ThunderDamageBonus) == 0x0000E8, "Member 'FSupportAffixTemplate::ThunderDamageBonus' has a wrong offset!");
static_assert(offsetof(FSupportAffixTemplate, IceDamageBonus) == 0x0000F8, "Member 'FSupportAffixTemplate::IceDamageBonus' has a wrong offset!");
static_assert(offsetof(FSupportAffixTemplate, EntityBulletDamageBonus) == 0x000108, "Member 'FSupportAffixTemplate::EntityBulletDamageBonus' has a wrong offset!");
static_assert(offsetof(FSupportAffixTemplate, SuperpowersDamageBonus) == 0x000118, "Member 'FSupportAffixTemplate::SuperpowersDamageBonus' has a wrong offset!");
static_assert(offsetof(FSupportAffixTemplate, SkillMastery) == 0x000128, "Member 'FSupportAffixTemplate::SkillMastery' has a wrong offset!");
static_assert(offsetof(FSupportAffixTemplate, ShootMastery) == 0x000138, "Member 'FSupportAffixTemplate::ShootMastery' has a wrong offset!");
static_assert(offsetof(FSupportAffixTemplate, NormalEnergySpeedPer) == 0x000148, "Member 'FSupportAffixTemplate::NormalEnergySpeedPer' has a wrong offset!");
static_assert(offsetof(FSupportAffixTemplate, SkillCDQuick) == 0x000158, "Member 'FSupportAffixTemplate::SkillCDQuick' has a wrong offset!");
static_assert(offsetof(FSupportAffixTemplate, ElemExplosionRateAddtion) == 0x000168, "Member 'FSupportAffixTemplate::ElemExplosionRateAddtion' has a wrong offset!");
static_assert(offsetof(FSupportAffixTemplate, CharacterEnergyMax) == 0x000178, "Member 'FSupportAffixTemplate::CharacterEnergyMax' has a wrong offset!");

// ScriptStruct SeasunAccount.SupportSuitSkillTemplate
// 0x0048 (0x0048 - 0x0000)
struct FSupportSuitSkillTemplate final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 TwoSkillID;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 ThreeSkillID;                                      // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 TwoSkillFixID;                                     // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 ThreeSkillFixID;                                   // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSupportSuitSkillTemplate) == 0x000008, "Wrong alignment on FSupportSuitSkillTemplate");
static_assert(sizeof(FSupportSuitSkillTemplate) == 0x000048, "Wrong size on FSupportSuitSkillTemplate");
static_assert(offsetof(FSupportSuitSkillTemplate, ID) == 0x000000, "Member 'FSupportSuitSkillTemplate::ID' has a wrong offset!");
static_assert(offsetof(FSupportSuitSkillTemplate, TwoSkillID) == 0x000008, "Member 'FSupportSuitSkillTemplate::TwoSkillID' has a wrong offset!");
static_assert(offsetof(FSupportSuitSkillTemplate, ThreeSkillID) == 0x000018, "Member 'FSupportSuitSkillTemplate::ThreeSkillID' has a wrong offset!");
static_assert(offsetof(FSupportSuitSkillTemplate, TwoSkillFixID) == 0x000028, "Member 'FSupportSuitSkillTemplate::TwoSkillFixID' has a wrong offset!");
static_assert(offsetof(FSupportSuitSkillTemplate, ThreeSkillFixID) == 0x000038, "Member 'FSupportSuitSkillTemplate::ThreeSkillFixID' has a wrong offset!");

// ScriptStruct SeasunAccount.GrowLevelArrayInt
// 0x0010 (0x0010 - 0x0000)
struct FGrowLevelArrayInt final
{
public:
	TArray<int32>                                 Value;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGrowLevelArrayInt) == 0x000008, "Wrong alignment on FGrowLevelArrayInt");
static_assert(sizeof(FGrowLevelArrayInt) == 0x000010, "Wrong size on FGrowLevelArrayInt");
static_assert(offsetof(FGrowLevelArrayInt, Value) == 0x000000, "Member 'FGrowLevelArrayInt::Value' has a wrong offset!");

// ScriptStruct SeasunAccount.GrowLevelArrayFloat
// 0x0010 (0x0010 - 0x0000)
struct FGrowLevelArrayFloat final
{
public:
	TArray<float>                                 Value;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGrowLevelArrayFloat) == 0x000008, "Wrong alignment on FGrowLevelArrayFloat");
static_assert(sizeof(FGrowLevelArrayFloat) == 0x000010, "Wrong size on FGrowLevelArrayFloat");
static_assert(offsetof(FGrowLevelArrayFloat, Value) == 0x000000, "Member 'FGrowLevelArrayFloat::Value' has a wrong offset!");

// ScriptStruct SeasunAccount.SupportAbilityGrowTemplate
// 0x00F8 (0x00F8 - 0x0000)
struct FSupportAbilityGrowTemplate final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGrowLevelArrayInt                     Health;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGrowLevelArrayInt                     Attack;                                            // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGrowLevelArrayInt                     Defence;                                           // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGrowLevelArrayInt                     Vigour;                                            // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGrowLevelArrayFloat                   CriticalValue;                                     // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGrowLevelArrayFloat                   ShieldDamageScaler;                                // 0x0058(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGrowLevelArrayFloat                   CriticalValue_Break;                               // 0x0068(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGrowLevelArrayFloat                   CriticalDamageAddtion_Break;                       // 0x0078(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGrowLevelArrayFloat                   SkillIntensity_Break;                              // 0x0088(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGrowLevelArrayFloat                   ShieldDamageScaler_Break;                          // 0x0098(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGrowLevelArrayFloat                   HealthPer_break;                                   // 0x00A8(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGrowLevelArrayFloat                   AttackPer_break;                                   // 0x00B8(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGrowLevelArrayFloat                   DefencePer_break;                                  // 0x00C8(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGrowLevelArrayFloat                   Command_break;                                     // 0x00D8(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGrowLevelArrayFloat                   CharacterEnergyEfficiency_break;                   // 0x00E8(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSupportAbilityGrowTemplate) == 0x000008, "Wrong alignment on FSupportAbilityGrowTemplate");
static_assert(sizeof(FSupportAbilityGrowTemplate) == 0x0000F8, "Wrong size on FSupportAbilityGrowTemplate");
static_assert(offsetof(FSupportAbilityGrowTemplate, ID) == 0x000000, "Member 'FSupportAbilityGrowTemplate::ID' has a wrong offset!");
static_assert(offsetof(FSupportAbilityGrowTemplate, Health) == 0x000008, "Member 'FSupportAbilityGrowTemplate::Health' has a wrong offset!");
static_assert(offsetof(FSupportAbilityGrowTemplate, Attack) == 0x000018, "Member 'FSupportAbilityGrowTemplate::Attack' has a wrong offset!");
static_assert(offsetof(FSupportAbilityGrowTemplate, Defence) == 0x000028, "Member 'FSupportAbilityGrowTemplate::Defence' has a wrong offset!");
static_assert(offsetof(FSupportAbilityGrowTemplate, Vigour) == 0x000038, "Member 'FSupportAbilityGrowTemplate::Vigour' has a wrong offset!");
static_assert(offsetof(FSupportAbilityGrowTemplate, CriticalValue) == 0x000048, "Member 'FSupportAbilityGrowTemplate::CriticalValue' has a wrong offset!");
static_assert(offsetof(FSupportAbilityGrowTemplate, ShieldDamageScaler) == 0x000058, "Member 'FSupportAbilityGrowTemplate::ShieldDamageScaler' has a wrong offset!");
static_assert(offsetof(FSupportAbilityGrowTemplate, CriticalValue_Break) == 0x000068, "Member 'FSupportAbilityGrowTemplate::CriticalValue_Break' has a wrong offset!");
static_assert(offsetof(FSupportAbilityGrowTemplate, CriticalDamageAddtion_Break) == 0x000078, "Member 'FSupportAbilityGrowTemplate::CriticalDamageAddtion_Break' has a wrong offset!");
static_assert(offsetof(FSupportAbilityGrowTemplate, SkillIntensity_Break) == 0x000088, "Member 'FSupportAbilityGrowTemplate::SkillIntensity_Break' has a wrong offset!");
static_assert(offsetof(FSupportAbilityGrowTemplate, ShieldDamageScaler_Break) == 0x000098, "Member 'FSupportAbilityGrowTemplate::ShieldDamageScaler_Break' has a wrong offset!");
static_assert(offsetof(FSupportAbilityGrowTemplate, HealthPer_break) == 0x0000A8, "Member 'FSupportAbilityGrowTemplate::HealthPer_break' has a wrong offset!");
static_assert(offsetof(FSupportAbilityGrowTemplate, AttackPer_break) == 0x0000B8, "Member 'FSupportAbilityGrowTemplate::AttackPer_break' has a wrong offset!");
static_assert(offsetof(FSupportAbilityGrowTemplate, DefencePer_break) == 0x0000C8, "Member 'FSupportAbilityGrowTemplate::DefencePer_break' has a wrong offset!");
static_assert(offsetof(FSupportAbilityGrowTemplate, Command_break) == 0x0000D8, "Member 'FSupportAbilityGrowTemplate::Command_break' has a wrong offset!");
static_assert(offsetof(FSupportAbilityGrowTemplate, CharacterEnergyEfficiency_break) == 0x0000E8, "Member 'FSupportAbilityGrowTemplate::CharacterEnergyEfficiency_break' has a wrong offset!");

// ScriptStruct SeasunAccount.WeaponPartsAbilityTemplate
// 0x007C (0x007C - 0x0000)
struct FWeaponPartsAbilityTemplate final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Health;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Attack;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Defence;                                           // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CriticalValue;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CriticalDamageAddtion;                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkillIntensity;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReloadSpeedCoefficient;                            // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Accuracy;                                          // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedPer;                                          // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HealthPer;                                         // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AttackPer;                                         // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefencePer;                                        // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Command;                                           // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CharacterEnergyEfficiency;                         // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BulletNum;                                         // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BulletCost;                                        // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
