#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SeasunAnimGraph

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SeasunAnimGraph_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SeasunAnimGraph.CurveSequenceControllerAnimInstance.ApplyStandardDirectionProcess
// 0x0098 (0x0098 - 0x0000)
struct CurveSequenceControllerAnimInstance_ApplyStandardDirectionProcess final
{
public:
	class UCurveSequenceAsset*                    Curve;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0008(0x008C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CurveSequenceControllerAnimInstance_ApplyStandardDirectionProcess) == 0x000008, "Wrong alignment on CurveSequenceControllerAnimInstance_ApplyStandardDirectionProcess");
static_assert(sizeof(CurveSequenceControllerAnimInstance_ApplyStandardDirectionProcess) == 0x000098, "Wrong size on CurveSequenceControllerAnimInstance_ApplyStandardDirectionProcess");
static_assert(offsetof(CurveSequenceControllerAnimInstance_ApplyStandardDirectionProcess, Curve) == 0x000000, "Member 'CurveSequenceControllerAnimInstance_ApplyStandardDirectionProcess::Curve' has a wrong offset!");
static_assert(offsetof(CurveSequenceControllerAnimInstance_ApplyStandardDirectionProcess, Hit) == 0x000008, "Member 'CurveSequenceControllerAnimInstance_ApplyStandardDirectionProcess::Hit' has a wrong offset!");

// Function SeasunAnimGraph.CurveSequenceControllerAnimInstance.CurveSequence_Play
// 0x0020 (0x0020 - 0x0000)
struct CurveSequenceControllerAnimInstance_CurveSequence_Play final
{
public:
	TScriptInterface<class ICurveSequenceInterface> CurveSequenceToPlay;                               // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	float                                         InPlayRate;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InTimeToStartCurveSequenceAt;                      // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CurveSequenceControllerAnimInstance_CurveSequence_Play) == 0x000008, "Wrong alignment on CurveSequenceControllerAnimInstance_CurveSequence_Play");
static_assert(sizeof(CurveSequenceControllerAnimInstance_CurveSequence_Play) == 0x000020, "Wrong size on CurveSequenceControllerAnimInstance_CurveSequence_Play");
static_assert(offsetof(CurveSequenceControllerAnimInstance_CurveSequence_Play, CurveSequenceToPlay) == 0x000000, "Member 'CurveSequenceControllerAnimInstance_CurveSequence_Play::CurveSequenceToPlay' has a wrong offset!");
static_assert(offsetof(CurveSequenceControllerAnimInstance_CurveSequence_Play, InPlayRate) == 0x000010, "Member 'CurveSequenceControllerAnimInstance_CurveSequence_Play::InPlayRate' has a wrong offset!");
static_assert(offsetof(CurveSequenceControllerAnimInstance_CurveSequence_Play, InTimeToStartCurveSequenceAt) == 0x000014, "Member 'CurveSequenceControllerAnimInstance_CurveSequence_Play::InTimeToStartCurveSequenceAt' has a wrong offset!");
static_assert(offsetof(CurveSequenceControllerAnimInstance_CurveSequence_Play, ReturnValue) == 0x000018, "Member 'CurveSequenceControllerAnimInstance_CurveSequence_Play::ReturnValue' has a wrong offset!");

// Function SeasunAnimGraph.CurveSequenceControllerAnimInstance.CurveSequence_Stop
// 0x0018 (0x0018 - 0x0000)
struct CurveSequenceControllerAnimInstance_CurveSequence_Stop final
{
public:
	float                                         InBlendOutTime;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICurveSequenceInterface> CurveSequence;                                     // 0x0008(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
};
static_assert(alignof(CurveSequenceControllerAnimInstance_CurveSequence_Stop) == 0x000008, "Wrong alignment on CurveSequenceControllerAnimInstance_CurveSequence_Stop");
static_assert(sizeof(CurveSequenceControllerAnimInstance_CurveSequence_Stop) == 0x000018, "Wrong size on CurveSequenceControllerAnimInstance_CurveSequence_Stop");
static_assert(offsetof(CurveSequenceControllerAnimInstance_CurveSequence_Stop, InBlendOutTime) == 0x000000, "Member 'CurveSequenceControllerAnimInstance_CurveSequence_Stop::InBlendOutTime' has a wrong offset!");
static_assert(offsetof(CurveSequenceControllerAnimInstance_CurveSequence_Stop, CurveSequence) == 0x000008, "Member 'CurveSequenceControllerAnimInstance_CurveSequence_Stop::CurveSequence' has a wrong offset!");

// Function SeasunAnimGraph.CurveSequenceControllerAnimInstance.GetCustomPhysicMode
// 0x0001 (0x0001 - 0x0000)
struct CurveSequenceControllerAnimInstance_GetCustomPhysicMode final
{
public:
	ECustomPhysicCalcMode                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CurveSequenceControllerAnimInstance_GetCustomPhysicMode) == 0x000001, "Wrong alignment on CurveSequenceControllerAnimInstance_GetCustomPhysicMode");
static_assert(sizeof(CurveSequenceControllerAnimInstance_GetCustomPhysicMode) == 0x000001, "Wrong size on CurveSequenceControllerAnimInstance_GetCustomPhysicMode");
static_assert(offsetof(CurveSequenceControllerAnimInstance_GetCustomPhysicMode, ReturnValue) == 0x000000, "Member 'CurveSequenceControllerAnimInstance_GetCustomPhysicMode::ReturnValue' has a wrong offset!");

// Function SeasunAnimGraph.CurveSequenceControllerAnimInstance.GetCustomPhysicState
// 0x0001 (0x0001 - 0x0000)
struct CurveSequenceControllerAnimInstance_GetCustomPhysicState final
{
public:
	ECustomPhysicState                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CurveSequenceControllerAnimInstance_GetCustomPhysicState) == 0x000001, "Wrong alignment on CurveSequenceControllerAnimInstance_GetCustomPhysicState");
static_assert(sizeof(CurveSequenceControllerAnimInstance_GetCustomPhysicState) == 0x000001, "Wrong size on CurveSequenceControllerAnimInstance_GetCustomPhysicState");
static_assert(offsetof(CurveSequenceControllerAnimInstance_GetCustomPhysicState, ReturnValue) == 0x000000, "Member 'CurveSequenceControllerAnimInstance_GetCustomPhysicState::ReturnValue' has a wrong offset!");

// Function SeasunAnimGraph.CurveSequenceControllerAnimInstance.SetCustomPhysicMode
// 0x0001 (0x0001 - 0x0000)
struct CurveSequenceControllerAnimInstance_SetCustomPhysicMode final
{
public:
	ECustomPhysicCalcMode                         InState;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CurveSequenceControllerAnimInstance_SetCustomPhysicMode) == 0x000001, "Wrong alignment on CurveSequenceControllerAnimInstance_SetCustomPhysicMode");
static_assert(sizeof(CurveSequenceControllerAnimInstance_SetCustomPhysicMode) == 0x000001, "Wrong size on CurveSequenceControllerAnimInstance_SetCustomPhysicMode");
static_assert(offsetof(CurveSequenceControllerAnimInstance_SetCustomPhysicMode, InState) == 0x000000, "Member 'CurveSequenceControllerAnimInstance_SetCustomPhysicMode::InState' has a wrong offset!");

// Function SeasunAnimGraph.CurveSequenceControllerAnimInstance.SetCustomPhysicState
// 0x0001 (0x0001 - 0x0000)
struct CurveSequenceControllerAnimInstance_SetCustomPhysicState final
{
public:
	ECustomPhysicState                            InState;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CurveSequenceControllerAnimInstance_SetCustomPhysicState) == 0x000001, "Wrong alignment on CurveSequenceControllerAnimInstance_SetCustomPhysicState");
static_assert(sizeof(CurveSequenceControllerAnimInstance_SetCustomPhysicState) == 0x000001, "Wrong size on CurveSequenceControllerAnimInstance_SetCustomPhysicState");
static_assert(offsetof(CurveSequenceControllerAnimInstance_SetCustomPhysicState, InState) == 0x000000, "Member 'CurveSequenceControllerAnimInstance_SetCustomPhysicState::InState' has a wrong offset!");

// Function SeasunAnimGraph.CurveSequenceControllerAnimInstance.CurveSequence_GetPosition
// 0x0018 (0x0018 - 0x0000)
struct CurveSequenceControllerAnimInstance_CurveSequence_GetPosition final
{
public:
	TScriptInterface<class ICurveSequenceInterface> CurveSequence;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CurveSequenceControllerAnimInstance_CurveSequence_GetPosition) == 0x000008, "Wrong alignment on CurveSequenceControllerAnimInstance_CurveSequence_GetPosition");
static_assert(sizeof(CurveSequenceControllerAnimInstance_CurveSequence_GetPosition) == 0x000018, "Wrong size on CurveSequenceControllerAnimInstance_CurveSequence_GetPosition");
static_assert(offsetof(CurveSequenceControllerAnimInstance_CurveSequence_GetPosition, CurveSequence) == 0x000000, "Member 'CurveSequenceControllerAnimInstance_CurveSequence_GetPosition::CurveSequence' has a wrong offset!");
static_assert(offsetof(CurveSequenceControllerAnimInstance_CurveSequence_GetPosition, ReturnValue) == 0x000010, "Member 'CurveSequenceControllerAnimInstance_CurveSequence_GetPosition::ReturnValue' has a wrong offset!");

// Function SeasunAnimGraph.CurveSequenceControllerAnimInstance.CurveSequence_IsActive
// 0x0018 (0x0018 - 0x0000)
struct CurveSequenceControllerAnimInstance_CurveSequence_IsActive final
{
public:
	TScriptInterface<class ICurveSequenceInterface> CurveSequence;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CurveSequenceControllerAnimInstance_CurveSequence_IsActive) == 0x000008, "Wrong alignment on CurveSequenceControllerAnimInstance_CurveSequence_IsActive");
static_assert(sizeof(CurveSequenceControllerAnimInstance_CurveSequence_IsActive) == 0x000018, "Wrong size on CurveSequenceControllerAnimInstance_CurveSequence_IsActive");
static_assert(offsetof(CurveSequenceControllerAnimInstance_CurveSequence_IsActive, CurveSequence) == 0x000000, "Member 'CurveSequenceControllerAnimInstance_CurveSequence_IsActive::CurveSequence' has a wrong offset!");
static_assert(offsetof(CurveSequenceControllerAnimInstance_CurveSequence_IsActive, ReturnValue) == 0x000010, "Member 'CurveSequenceControllerAnimInstance_CurveSequence_IsActive::ReturnValue' has a wrong offset!");

// Function SeasunAnimGraph.CurveSequenceControllerAnimInstance.CurveSequence_IsPlaying
// 0x0018 (0x0018 - 0x0000)
struct CurveSequenceControllerAnimInstance_CurveSequence_IsPlaying final
{
public:
	TScriptInterface<class ICurveSequenceInterface> CurveSequence;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CurveSequenceControllerAnimInstance_CurveSequence_IsPlaying) == 0x000008, "Wrong alignment on CurveSequenceControllerAnimInstance_CurveSequence_IsPlaying");
static_assert(sizeof(CurveSequenceControllerAnimInstance_CurveSequence_IsPlaying) == 0x000018, "Wrong size on CurveSequenceControllerAnimInstance_CurveSequence_IsPlaying");
static_assert(offsetof(CurveSequenceControllerAnimInstance_CurveSequence_IsPlaying, CurveSequence) == 0x000000, "Member 'CurveSequenceControllerAnimInstance_CurveSequence_IsPlaying::CurveSequence' has a wrong offset!");
static_assert(offsetof(CurveSequenceControllerAnimInstance_CurveSequence_IsPlaying, ReturnValue) == 0x000010, "Member 'CurveSequenceControllerAnimInstance_CurveSequence_IsPlaying::ReturnValue' has a wrong offset!");

// Function SeasunAnimGraph.CurveSequenceControllerAnimInstance.HasCurveEffect
// 0x0001 (0x0001 - 0x0000)
struct CurveSequenceControllerAnimInstance_HasCurveEffect final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CurveSequenceControllerAnimInstance_HasCurveEffect) == 0x000001, "Wrong alignment on CurveSequenceControllerAnimInstance_HasCurveEffect");
static_assert(sizeof(CurveSequenceControllerAnimInstance_HasCurveEffect) == 0x000001, "Wrong size on CurveSequenceControllerAnimInstance_HasCurveEffect");
static_assert(offsetof(CurveSequenceControllerAnimInstance_HasCurveEffect, ReturnValue) == 0x000000, "Member 'CurveSequenceControllerAnimInstance_HasCurveEffect::ReturnValue' has a wrong offset!");

// Function SeasunAnimGraph.HitReactCondition.K2_Accepts
// 0x0090 (0x0090 - 0x0000)
struct HitReactCondition_K2_Accepts final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x008C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x008C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HitReactCondition_K2_Accepts) == 0x000004, "Wrong alignment on HitReactCondition_K2_Accepts");
static_assert(sizeof(HitReactCondition_K2_Accepts) == 0x000090, "Wrong size on HitReactCondition_K2_Accepts");
static_assert(offsetof(HitReactCondition_K2_Accepts, Hit) == 0x000000, "Member 'HitReactCondition_K2_Accepts::Hit' has a wrong offset!");
static_assert(offsetof(HitReactCondition_K2_Accepts, ReturnValue) == 0x00008C, "Member 'HitReactCondition_K2_Accepts::ReturnValue' has a wrong offset!");

// Function SeasunAnimGraph.HitReactData.GetCaclHitDirectionFromHitResult
// 0x0094 (0x0094 - 0x0000)
struct HitReactData_GetCaclHitDirectionFromHitResult final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x008C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         WeaponType;                                        // 0x008C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HitReactData_GetCaclHitDirectionFromHitResult) == 0x000004, "Wrong alignment on HitReactData_GetCaclHitDirectionFromHitResult");
static_assert(sizeof(HitReactData_GetCaclHitDirectionFromHitResult) == 0x000094, "Wrong size on HitReactData_GetCaclHitDirectionFromHitResult");
static_assert(offsetof(HitReactData_GetCaclHitDirectionFromHitResult, Hit) == 0x000000, "Member 'HitReactData_GetCaclHitDirectionFromHitResult::Hit' has a wrong offset!");
static_assert(offsetof(HitReactData_GetCaclHitDirectionFromHitResult, WeaponType) == 0x00008C, "Member 'HitReactData_GetCaclHitDirectionFromHitResult::WeaponType' has a wrong offset!");
static_assert(offsetof(HitReactData_GetCaclHitDirectionFromHitResult, ReturnValue) == 0x000090, "Member 'HitReactData_GetCaclHitDirectionFromHitResult::ReturnValue' has a wrong offset!");

// Function SeasunAnimGraph.HitReactData.GetCurveSequenceFromHitResult
// 0x0098 (0x0098 - 0x0000)
struct HitReactData_GetCurveSequenceFromHitResult final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x008C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         WeaponType;                                        // 0x008C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveSequenceAsset*                    ReturnValue;                                       // 0x0090(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HitReactData_GetCurveSequenceFromHitResult) == 0x000008, "Wrong alignment on HitReactData_GetCurveSequenceFromHitResult");
static_assert(sizeof(HitReactData_GetCurveSequenceFromHitResult) == 0x000098, "Wrong size on HitReactData_GetCurveSequenceFromHitResult");
static_assert(offsetof(HitReactData_GetCurveSequenceFromHitResult, Hit) == 0x000000, "Member 'HitReactData_GetCurveSequenceFromHitResult::Hit' has a wrong offset!");
static_assert(offsetof(HitReactData_GetCurveSequenceFromHitResult, WeaponType) == 0x00008C, "Member 'HitReactData_GetCurveSequenceFromHitResult::WeaponType' has a wrong offset!");
static_assert(offsetof(HitReactData_GetCurveSequenceFromHitResult, ReturnValue) == 0x000090, "Member 'HitReactData_GetCurveSequenceFromHitResult::ReturnValue' has a wrong offset!");

// Function SeasunAnimGraph.HitReactData.GetCurveSequencesFromHitResult
// 0x00A0 (0x00A0 - 0x0000)
struct HitReactData_GetCurveSequencesFromHitResult final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x008C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         WeaponType;                                        // 0x008C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UCurveSequenceAsset*>            ReturnValue;                                       // 0x0090(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HitReactData_GetCurveSequencesFromHitResult) == 0x000008, "Wrong alignment on HitReactData_GetCurveSequencesFromHitResult");
static_assert(sizeof(HitReactData_GetCurveSequencesFromHitResult) == 0x0000A0, "Wrong size on HitReactData_GetCurveSequencesFromHitResult");
static_assert(offsetof(HitReactData_GetCurveSequencesFromHitResult, Hit) == 0x000000, "Member 'HitReactData_GetCurveSequencesFromHitResult::Hit' has a wrong offset!");
static_assert(offsetof(HitReactData_GetCurveSequencesFromHitResult, WeaponType) == 0x00008C, "Member 'HitReactData_GetCurveSequencesFromHitResult::WeaponType' has a wrong offset!");
static_assert(offsetof(HitReactData_GetCurveSequencesFromHitResult, ReturnValue) == 0x000090, "Member 'HitReactData_GetCurveSequencesFromHitResult::ReturnValue' has a wrong offset!");

// Function SeasunAnimGraph.AbnormalReactData.GetCurveSequenceFromAbnormalState
// 0x0010 (0x0010 - 0x0000)
struct AbnormalReactData_GetCurveSequenceFromAbnormalState final
{
public:
	uint8                                         InState;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveSequenceAsset*                    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbnormalReactData_GetCurveSequenceFromAbnormalState) == 0x000008, "Wrong alignment on AbnormalReactData_GetCurveSequenceFromAbnormalState");
static_assert(sizeof(AbnormalReactData_GetCurveSequenceFromAbnormalState) == 0x000010, "Wrong size on AbnormalReactData_GetCurveSequenceFromAbnormalState");
static_assert(offsetof(AbnormalReactData_GetCurveSequenceFromAbnormalState, InState) == 0x000000, "Member 'AbnormalReactData_GetCurveSequenceFromAbnormalState::InState' has a wrong offset!");
static_assert(offsetof(AbnormalReactData_GetCurveSequenceFromAbnormalState, ReturnValue) == 0x000008, "Member 'AbnormalReactData_GetCurveSequenceFromAbnormalState::ReturnValue' has a wrong offset!");

// Function SeasunAnimGraph.AttributeAbnormalReactData.GetCurveSequenceFromAttributeAbnormalState
// 0x0010 (0x0010 - 0x0000)
struct AttributeAbnormalReactData_GetCurveSequenceFromAttributeAbnormalState final
{
public:
	uint8                                         InState;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveSequenceAsset*                    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AttributeAbnormalReactData_GetCurveSequenceFromAttributeAbnormalState) == 0x000008, "Wrong alignment on AttributeAbnormalReactData_GetCurveSequenceFromAttributeAbnormalState");
static_assert(sizeof(AttributeAbnormalReactData_GetCurveSequenceFromAttributeAbnormalState) == 0x000010, "Wrong size on AttributeAbnormalReactData_GetCurveSequenceFromAttributeAbnormalState");
static_assert(offsetof(AttributeAbnormalReactData_GetCurveSequenceFromAttributeAbnormalState, InState) == 0x000000, "Member 'AttributeAbnormalReactData_GetCurveSequenceFromAttributeAbnormalState::InState' has a wrong offset!");
static_assert(offsetof(AttributeAbnormalReactData_GetCurveSequenceFromAttributeAbnormalState, ReturnValue) == 0x000008, "Member 'AttributeAbnormalReactData_GetCurveSequenceFromAttributeAbnormalState::ReturnValue' has a wrong offset!");

// Function SeasunAnimGraph.PhysAnimLibrary.GetBodyNameByIndex
// 0x0018 (0x0018 - 0x0000)
struct PhysAnimLibrary_GetBodyNameByIndex final
{
public:
	const class USkeletalMeshComponent*           Mesh;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BodyName;                                          // 0x000C(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PhysAnimLibrary_GetBodyNameByIndex) == 0x000008, "Wrong alignment on PhysAnimLibrary_GetBodyNameByIndex");
static_assert(sizeof(PhysAnimLibrary_GetBodyNameByIndex) == 0x000018, "Wrong size on PhysAnimLibrary_GetBodyNameByIndex");
static_assert(offsetof(PhysAnimLibrary_GetBodyNameByIndex, Mesh) == 0x000000, "Member 'PhysAnimLibrary_GetBodyNameByIndex::Mesh' has a wrong offset!");
static_assert(offsetof(PhysAnimLibrary_GetBodyNameByIndex, Index_0) == 0x000008, "Member 'PhysAnimLibrary_GetBodyNameByIndex::Index_0' has a wrong offset!");
static_assert(offsetof(PhysAnimLibrary_GetBodyNameByIndex, BodyName) == 0x00000C, "Member 'PhysAnimLibrary_GetBodyNameByIndex::BodyName' has a wrong offset!");
static_assert(offsetof(PhysAnimLibrary_GetBodyNameByIndex, ReturnValue) == 0x000014, "Member 'PhysAnimLibrary_GetBodyNameByIndex::ReturnValue' has a wrong offset!");

// Function SeasunAnimGraph.PhysAnimLibrary.ResetBoneSimulationInfo
// 0x0008 (0x0008 - 0x0000)
struct PhysAnimLibrary_ResetBoneSimulationInfo final
{
public:
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PhysAnimLibrary_ResetBoneSimulationInfo) == 0x000008, "Wrong alignment on PhysAnimLibrary_ResetBoneSimulationInfo");
static_assert(sizeof(PhysAnimLibrary_ResetBoneSimulationInfo) == 0x000008, "Wrong size on PhysAnimLibrary_ResetBoneSimulationInfo");
static_assert(offsetof(PhysAnimLibrary_ResetBoneSimulationInfo, Mesh) == 0x000000, "Member 'PhysAnimLibrary_ResetBoneSimulationInfo::Mesh' has a wrong offset!");

// Function SeasunAnimGraph.PhysAnimLibrary.SetBodySimulateWeightByIndex
// 0x0010 (0x0010 - 0x0000)
struct PhysAnimLibrary_SetBodySimulateWeightByIndex final
{
public:
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BodyIndex;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PhysAnimLibrary_SetBodySimulateWeightByIndex) == 0x000008, "Wrong alignment on PhysAnimLibrary_SetBodySimulateWeightByIndex");
static_assert(sizeof(PhysAnimLibrary_SetBodySimulateWeightByIndex) == 0x000010, "Wrong size on PhysAnimLibrary_SetBodySimulateWeightByIndex");
static_assert(offsetof(PhysAnimLibrary_SetBodySimulateWeightByIndex, Mesh) == 0x000000, "Member 'PhysAnimLibrary_SetBodySimulateWeightByIndex::Mesh' has a wrong offset!");
static_assert(offsetof(PhysAnimLibrary_SetBodySimulateWeightByIndex, BodyIndex) == 0x000008, "Member 'PhysAnimLibrary_SetBodySimulateWeightByIndex::BodyIndex' has a wrong offset!");
static_assert(offsetof(PhysAnimLibrary_SetBodySimulateWeightByIndex, Weight) == 0x00000C, "Member 'PhysAnimLibrary_SetBodySimulateWeightByIndex::Weight' has a wrong offset!");

// Function SeasunAnimGraph.PhysAnimLibrary.SetBodySimulationWeight
// 0x0018 (0x0018 - 0x0000)
struct PhysAnimLibrary_SetBodySimulationWeight final
{
public:
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PhysAnimLibrary_SetBodySimulationWeight) == 0x000008, "Wrong alignment on PhysAnimLibrary_SetBodySimulationWeight");
static_assert(sizeof(PhysAnimLibrary_SetBodySimulationWeight) == 0x000018, "Wrong size on PhysAnimLibrary_SetBodySimulationWeight");
static_assert(offsetof(PhysAnimLibrary_SetBodySimulationWeight, Mesh) == 0x000000, "Member 'PhysAnimLibrary_SetBodySimulationWeight::Mesh' has a wrong offset!");
static_assert(offsetof(PhysAnimLibrary_SetBodySimulationWeight, BoneName) == 0x000008, "Member 'PhysAnimLibrary_SetBodySimulationWeight::BoneName' has a wrong offset!");
static_assert(offsetof(PhysAnimLibrary_SetBodySimulationWeight, Weight) == 0x000010, "Member 'PhysAnimLibrary_SetBodySimulationWeight::Weight' has a wrong offset!");

// Function SeasunAnimGraph.PhysAnimLibrary.SetBoneSimulationInfo
// 0x0070 (0x0070 - 0x0000)
struct PhysAnimLibrary_SetBoneSimulationInfo final
{
public:
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitBoneSimulationInfo                 SimulationInfo;                                    // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPhysAnimCharState                     CharPhysState;                                     // 0x0020(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PhysAnimLibrary_SetBoneSimulationInfo) == 0x000008, "Wrong alignment on PhysAnimLibrary_SetBoneSimulationInfo");
static_assert(sizeof(PhysAnimLibrary_SetBoneSimulationInfo) == 0x000070, "Wrong size on PhysAnimLibrary_SetBoneSimulationInfo");
static_assert(offsetof(PhysAnimLibrary_SetBoneSimulationInfo, Mesh) == 0x000000, "Member 'PhysAnimLibrary_SetBoneSimulationInfo::Mesh' has a wrong offset!");
static_assert(offsetof(PhysAnimLibrary_SetBoneSimulationInfo, SimulationInfo) == 0x000008, "Member 'PhysAnimLibrary_SetBoneSimulationInfo::SimulationInfo' has a wrong offset!");
static_assert(offsetof(PhysAnimLibrary_SetBoneSimulationInfo, CharPhysState) == 0x000020, "Member 'PhysAnimLibrary_SetBoneSimulationInfo::CharPhysState' has a wrong offset!");

// Function SeasunAnimGraph.SeasunAnimFunctionLibrary.AngleBetweenVectors
// 0x001C (0x001C - 0x0000)
struct SeasunAnimFunctionLibrary_AngleBetweenVectors final
{
public:
	struct FVector                                V1;                                                // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                V2;                                                // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SeasunAnimFunctionLibrary_AngleBetweenVectors) == 0x000004, "Wrong alignment on SeasunAnimFunctionLibrary_AngleBetweenVectors");
static_assert(sizeof(SeasunAnimFunctionLibrary_AngleBetweenVectors) == 0x00001C, "Wrong size on SeasunAnimFunctionLibrary_AngleBetweenVectors");
static_assert(offsetof(SeasunAnimFunctionLibrary_AngleBetweenVectors, V1) == 0x000000, "Member 'SeasunAnimFunctionLibrary_AngleBetweenVectors::V1' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_AngleBetweenVectors, V2) == 0x00000C, "Member 'SeasunAnimFunctionLibrary_AngleBetweenVectors::V2' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_AngleBetweenVectors, ReturnValue) == 0x000018, "Member 'SeasunAnimFunctionLibrary_AngleBetweenVectors::ReturnValue' has a wrong offset!");

// Function SeasunAnimGraph.SeasunAnimFunctionLibrary.ApplyRecoilForce
// 0x0150 (0x0150 - 0x0000)
struct SeasunAnimFunctionLibrary_ApplyRecoilForce final
{
public:
	struct FAnimRecoilSystem                      InRecoilSystem;                                    // 0x0000(0x0120)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRecoilStrength                        InStrength;                                        // 0x0120(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SeasunAnimFunctionLibrary_ApplyRecoilForce) == 0x000008, "Wrong alignment on SeasunAnimFunctionLibrary_ApplyRecoilForce");
static_assert(sizeof(SeasunAnimFunctionLibrary_ApplyRecoilForce) == 0x000150, "Wrong size on SeasunAnimFunctionLibrary_ApplyRecoilForce");
static_assert(offsetof(SeasunAnimFunctionLibrary_ApplyRecoilForce, InRecoilSystem) == 0x000000, "Member 'SeasunAnimFunctionLibrary_ApplyRecoilForce::InRecoilSystem' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_ApplyRecoilForce, InStrength) == 0x000120, "Member 'SeasunAnimFunctionLibrary_ApplyRecoilForce::InStrength' has a wrong offset!");

// Function SeasunAnimGraph.SeasunAnimFunctionLibrary.CalculateAimRotation
// 0x0038 (0x0038 - 0x0000)
struct SeasunAnimFunctionLibrary_CalculateAimRotation final
{
public:
	class UAnimInstance*                          AnimInstance;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimYaw;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimPitch;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                FacingDirection;                                   // 0x0014(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationInterpSpeed;                               // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxAngle;                                          // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutPitch;                                          // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutYaw;                                            // 0x002C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ViewLocationSocketName;                            // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SeasunAnimFunctionLibrary_CalculateAimRotation) == 0x000008, "Wrong alignment on SeasunAnimFunctionLibrary_CalculateAimRotation");
static_assert(sizeof(SeasunAnimFunctionLibrary_CalculateAimRotation) == 0x000038, "Wrong size on SeasunAnimFunctionLibrary_CalculateAimRotation");
static_assert(offsetof(SeasunAnimFunctionLibrary_CalculateAimRotation, AnimInstance) == 0x000000, "Member 'SeasunAnimFunctionLibrary_CalculateAimRotation::AnimInstance' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_CalculateAimRotation, AimYaw) == 0x000008, "Member 'SeasunAnimFunctionLibrary_CalculateAimRotation::AimYaw' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_CalculateAimRotation, AimPitch) == 0x00000C, "Member 'SeasunAnimFunctionLibrary_CalculateAimRotation::AimPitch' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_CalculateAimRotation, DeltaSeconds) == 0x000010, "Member 'SeasunAnimFunctionLibrary_CalculateAimRotation::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_CalculateAimRotation, FacingDirection) == 0x000014, "Member 'SeasunAnimFunctionLibrary_CalculateAimRotation::FacingDirection' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_CalculateAimRotation, RotationInterpSpeed) == 0x000020, "Member 'SeasunAnimFunctionLibrary_CalculateAimRotation::RotationInterpSpeed' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_CalculateAimRotation, MaxAngle) == 0x000024, "Member 'SeasunAnimFunctionLibrary_CalculateAimRotation::MaxAngle' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_CalculateAimRotation, OutPitch) == 0x000028, "Member 'SeasunAnimFunctionLibrary_CalculateAimRotation::OutPitch' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_CalculateAimRotation, OutYaw) == 0x00002C, "Member 'SeasunAnimFunctionLibrary_CalculateAimRotation::OutYaw' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_CalculateAimRotation, ViewLocationSocketName) == 0x000030, "Member 'SeasunAnimFunctionLibrary_CalculateAimRotation::ViewLocationSocketName' has a wrong offset!");

// Function SeasunAnimGraph.SeasunAnimFunctionLibrary.CalculateDirection
// 0x001C (0x001C - 0x0000)
struct SeasunAnimFunctionLibrary_CalculateDirection final
{
public:
	struct FVector                                Vector;                                            // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               BaseRotation;                                      // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SeasunAnimFunctionLibrary_CalculateDirection) == 0x000004, "Wrong alignment on SeasunAnimFunctionLibrary_CalculateDirection");
static_assert(sizeof(SeasunAnimFunctionLibrary_CalculateDirection) == 0x00001C, "Wrong size on SeasunAnimFunctionLibrary_CalculateDirection");
static_assert(offsetof(SeasunAnimFunctionLibrary_CalculateDirection, Vector) == 0x000000, "Member 'SeasunAnimFunctionLibrary_CalculateDirection::Vector' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_CalculateDirection, BaseRotation) == 0x00000C, "Member 'SeasunAnimFunctionLibrary_CalculateDirection::BaseRotation' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_CalculateDirection, ReturnValue) == 0x000018, "Member 'SeasunAnimFunctionLibrary_CalculateDirection::ReturnValue' has a wrong offset!");

// Function SeasunAnimGraph.SeasunAnimFunctionLibrary.GetLerpedTimeByCurveValueFromAnimMontage
// 0x0028 (0x0028 - 0x0000)
struct SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimMontage final
{
public:
	const class UAnimMontage*                     AnimMontage;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SectionName;                                       // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CurveName;                                         // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurveValue;                                        // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutTime;                                           // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUnsigned;                                         // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimMontage) == 0x000008, "Wrong alignment on SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimMontage");
static_assert(sizeof(SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimMontage) == 0x000028, "Wrong size on SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimMontage");
static_assert(offsetof(SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimMontage, AnimMontage) == 0x000000, "Member 'SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimMontage::AnimMontage' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimMontage, SectionName) == 0x000008, "Member 'SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimMontage::SectionName' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimMontage, CurveName) == 0x000010, "Member 'SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimMontage::CurveName' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimMontage, CurveValue) == 0x000018, "Member 'SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimMontage::CurveValue' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimMontage, OutTime) == 0x00001C, "Member 'SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimMontage::OutTime' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimMontage, bUnsigned) == 0x000020, "Member 'SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimMontage::bUnsigned' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimMontage, ReturnValue) == 0x000021, "Member 'SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimMontage::ReturnValue' has a wrong offset!");

// Function SeasunAnimGraph.SeasunAnimFunctionLibrary.GetLerpedTimeByCurveValueFromAnimSequence
// 0x0020 (0x0020 - 0x0000)
struct SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimSequence final
{
public:
	const class UAnimSequenceBase*                AnimSequence;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CurveName;                                         // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurveValue;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutTime;                                           // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUnsigned;                                         // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimSequence) == 0x000008, "Wrong alignment on SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimSequence");
static_assert(sizeof(SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimSequence) == 0x000020, "Wrong size on SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimSequence");
static_assert(offsetof(SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimSequence, AnimSequence) == 0x000000, "Member 'SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimSequence::AnimSequence' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimSequence, CurveName) == 0x000008, "Member 'SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimSequence::CurveName' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimSequence, CurveValue) == 0x000010, "Member 'SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimSequence::CurveValue' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimSequence, OutTime) == 0x000014, "Member 'SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimSequence::OutTime' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimSequence, bUnsigned) == 0x000018, "Member 'SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimSequence::bUnsigned' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimSequence, ReturnValue) == 0x000019, "Member 'SeasunAnimFunctionLibrary_GetLerpedTimeByCurveValueFromAnimSequence::ReturnValue' has a wrong offset!");

// Function SeasunAnimGraph.SeasunAnimFunctionLibrary.GetSavedBoneTransform
// 0x0050 (0x0050 - 0x0000)
struct SeasunAnimFunctionLibrary_GetSavedBoneTransform final
{
public:
	class UAnimInstance*                          AnimInstance;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GroupName;                                         // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0020(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SeasunAnimFunctionLibrary_GetSavedBoneTransform) == 0x000010, "Wrong alignment on SeasunAnimFunctionLibrary_GetSavedBoneTransform");
static_assert(sizeof(SeasunAnimFunctionLibrary_GetSavedBoneTransform) == 0x000050, "Wrong size on SeasunAnimFunctionLibrary_GetSavedBoneTransform");
static_assert(offsetof(SeasunAnimFunctionLibrary_GetSavedBoneTransform, AnimInstance) == 0x000000, "Member 'SeasunAnimFunctionLibrary_GetSavedBoneTransform::AnimInstance' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_GetSavedBoneTransform, GroupName) == 0x000008, "Member 'SeasunAnimFunctionLibrary_GetSavedBoneTransform::GroupName' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_GetSavedBoneTransform, BoneName) == 0x000010, "Member 'SeasunAnimFunctionLibrary_GetSavedBoneTransform::BoneName' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_GetSavedBoneTransform, ReturnValue) == 0x000020, "Member 'SeasunAnimFunctionLibrary_GetSavedBoneTransform::ReturnValue' has a wrong offset!");

// Function SeasunAnimGraph.SeasunAnimFunctionLibrary.HasSavedBoneTransform
// 0x0020 (0x0020 - 0x0000)
struct SeasunAnimFunctionLibrary_HasSavedBoneTransform final
{
public:
	class UAnimInstance*                          AnimInstance;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GroupName;                                         // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SeasunAnimFunctionLibrary_HasSavedBoneTransform) == 0x000008, "Wrong alignment on SeasunAnimFunctionLibrary_HasSavedBoneTransform");
static_assert(sizeof(SeasunAnimFunctionLibrary_HasSavedBoneTransform) == 0x000020, "Wrong size on SeasunAnimFunctionLibrary_HasSavedBoneTransform");
static_assert(offsetof(SeasunAnimFunctionLibrary_HasSavedBoneTransform, AnimInstance) == 0x000000, "Member 'SeasunAnimFunctionLibrary_HasSavedBoneTransform::AnimInstance' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_HasSavedBoneTransform, GroupName) == 0x000008, "Member 'SeasunAnimFunctionLibrary_HasSavedBoneTransform::GroupName' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_HasSavedBoneTransform, BoneName) == 0x000010, "Member 'SeasunAnimFunctionLibrary_HasSavedBoneTransform::BoneName' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_HasSavedBoneTransform, ReturnValue) == 0x000018, "Member 'SeasunAnimFunctionLibrary_HasSavedBoneTransform::ReturnValue' has a wrong offset!");

// Function SeasunAnimGraph.SeasunAnimFunctionLibrary.PlayLoopSlotAnimationAsDynamicMontage
// 0x0040 (0x0040 - 0x0000)
struct SeasunAnimFunctionLibrary_PlayLoopSlotAnimationAsDynamicMontage final
{
public:
	class UAnimInstance*                          AnimInstance;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      Asset;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SlotNodeName;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartLoopTime;                                     // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndLoopTime;                                       // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendInTime;                                       // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendOutTime;                                      // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InPlayRate;                                        // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendOutTriggerTime;                               // 0x002C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InTimeToStartMontageAt;                            // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SeasunAnimFunctionLibrary_PlayLoopSlotAnimationAsDynamicMontage) == 0x000008, "Wrong alignment on SeasunAnimFunctionLibrary_PlayLoopSlotAnimationAsDynamicMontage");
static_assert(sizeof(SeasunAnimFunctionLibrary_PlayLoopSlotAnimationAsDynamicMontage) == 0x000040, "Wrong size on SeasunAnimFunctionLibrary_PlayLoopSlotAnimationAsDynamicMontage");
static_assert(offsetof(SeasunAnimFunctionLibrary_PlayLoopSlotAnimationAsDynamicMontage, AnimInstance) == 0x000000, "Member 'SeasunAnimFunctionLibrary_PlayLoopSlotAnimationAsDynamicMontage::AnimInstance' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_PlayLoopSlotAnimationAsDynamicMontage, Asset) == 0x000008, "Member 'SeasunAnimFunctionLibrary_PlayLoopSlotAnimationAsDynamicMontage::Asset' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_PlayLoopSlotAnimationAsDynamicMontage, SlotNodeName) == 0x000010, "Member 'SeasunAnimFunctionLibrary_PlayLoopSlotAnimationAsDynamicMontage::SlotNodeName' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_PlayLoopSlotAnimationAsDynamicMontage, StartLoopTime) == 0x000018, "Member 'SeasunAnimFunctionLibrary_PlayLoopSlotAnimationAsDynamicMontage::StartLoopTime' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_PlayLoopSlotAnimationAsDynamicMontage, EndLoopTime) == 0x00001C, "Member 'SeasunAnimFunctionLibrary_PlayLoopSlotAnimationAsDynamicMontage::EndLoopTime' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_PlayLoopSlotAnimationAsDynamicMontage, BlendInTime) == 0x000020, "Member 'SeasunAnimFunctionLibrary_PlayLoopSlotAnimationAsDynamicMontage::BlendInTime' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_PlayLoopSlotAnimationAsDynamicMontage, BlendOutTime) == 0x000024, "Member 'SeasunAnimFunctionLibrary_PlayLoopSlotAnimationAsDynamicMontage::BlendOutTime' has a wrong offset!");
static_assert(offsetof(SeasunAnimFunctionLibrary_PlayLoopSlotAnimationAsDynamicMontage, InPlayRate) == 0x000028, "Member 'SeasunAnimFunctionLibrary_PlayLoopSlotAnimationAsDynamicMontage::InPlayRate' has a wrong offset!");
