#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SeasunAsset

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SeasunAsset_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class SeasunAsset.SeasunAssetLib
// 0x0000 (0x0028 - 0x0028)
class USeasunAssetLib final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SeasunAssetLib">();
	}
	static class USeasunAssetLib* GetDefaultObj()
	{
		return GetDefaultObjImpl<USeasunAssetLib>();
	}
};
static_assert(alignof(USeasunAssetLib) == 0x000008, "Wrong alignment on USeasunAssetLib");
static_assert(sizeof(USeasunAssetLib) == 0x000028, "Wrong size on USeasunAssetLib");

// Class SeasunAsset.SeasunAssetManager
// 0x0000 (0x0458 - 0x0458)
class USeasunAssetManager : public UAssetManager
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SeasunAssetManager">();
	}
	static class USeasunAssetManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<USeasunAssetManager>();
	}
};
static_assert(alignof(USeasunAssetManager) == 0x000008, "Wrong alignment on USeasunAssetManager");
static_assert(sizeof(USeasunAssetManager) == 0x000458, "Wrong size on USeasunAssetManager");

// Class SeasunAsset.SeasunAssetSetting
// 0x00F0 (0x0118 - 0x0028)
class USeasunAssetSetting final : public UObject
{
public:
	bool                                          bCookOnlyAppData;                                  // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCustomCookSplit;                                  // 0x0029(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFilePath>                      FilesInApp;                                        // 0x0030(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FDirectoryPath>                 DirectoryInApp;                                    // 0x0040(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FFilePath>                      FilesInPaks;                                       // 0x0050(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FDirectoryPath>                 DirectoryInPaks;                                   // 0x0060(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FFilePath>                      IgnoreFiles;                                       // 0x0070(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FDirectoryPath>                 IgnoreDirectories;                                 // 0x0080(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	struct FDirectorySplitDesc                    DefaultSplitMethod;                                // 0x0090(0x0018)(Edit, Config, NativeAccessSpecifierPublic)
	TArray<struct FDirectorySplitDesc>            SpliteMethods;                                     // 0x00A8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FDirectorySplitDesc>            NonAssetSpliteMethos_APP;                          // 0x00B8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FDirectorySplitDesc>            NonAssetSpliteMethos_OutAPP;                       // 0x00C8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bSaveCookFile;                                     // 0x00D8(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCalCRC;                                           // 0x00D9(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerateFileOpenOrder;                            // 0x00DA(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCookSingleFile;                                   // 0x00DB(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFilePath                              SingleFilePath;                                    // 0x00E0(0x0010)(Edit, Config, NativeAccessSpecifierPublic)
	TArray<class UClass*>                         CookIgnoreClasses;                                 // 0x00F0(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	uint8                                         Pad_100[0x18];                                     // 0x0100(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SeasunAssetSetting">();
	}
	static class USeasunAssetSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<USeasunAssetSetting>();
	}
};
static_assert(alignof(USeasunAssetSetting) == 0x000008, "Wrong alignment on USeasunAssetSetting");
static_assert(sizeof(USeasunAssetSetting) == 0x000118, "Wrong size on USeasunAssetSetting");
static_assert(offsetof(USeasunAssetSetting, bCookOnlyAppData) == 0x000028, "Member 'USeasunAssetSetting::bCookOnlyAppData' has a wrong offset!");
static_assert(offsetof(USeasunAssetSetting, bCustomCookSplit) == 0x000029, "Member 'USeasunAssetSetting::bCustomCookSplit' has a wrong offset!");
static_assert(offsetof(USeasunAssetSetting, FilesInApp) == 0x000030, "Member 'USeasunAssetSetting::FilesInApp' has a wrong offset!");
static_assert(offsetof(USeasunAssetSetting, DirectoryInApp) == 0x000040, "Member 'USeasunAssetSetting::DirectoryInApp' has a wrong offset!");
static_assert(offsetof(USeasunAssetSetting, FilesInPaks) == 0x000050, "Member 'USeasunAssetSetting::FilesInPaks' has a wrong offset!");
static_assert(offsetof(USeasunAssetSetting, DirectoryInPaks) == 0x000060, "Member 'USeasunAssetSetting::DirectoryInPaks' has a wrong offset!");
static_assert(offsetof(USeasunAssetSetting, IgnoreFiles) == 0x000070, "Member 'USeasunAssetSetting::IgnoreFiles' has a wrong offset!");
static_assert(offsetof(USeasunAssetSetting, IgnoreDirectories) == 0x000080, "Member 'USeasunAssetSetting::IgnoreDirectories' has a wrong offset!");
static_assert(offsetof(USeasunAssetSetting, DefaultSplitMethod) == 0x000090, "Member 'USeasunAssetSetting::DefaultSplitMethod' has a wrong offset!");
static_assert(offsetof(USeasunAssetSetting, SpliteMethods) == 0x0000A8, "Member 'USeasunAssetSetting::SpliteMethods' has a wrong offset!");
static_assert(offsetof(USeasunAssetSetting, NonAssetSpliteMethos_APP) == 0x0000B8, "Member 'USeasunAssetSetting::NonAssetSpliteMethos_APP' has a wrong offset!");
static_assert(offsetof(USeasunAssetSetting, NonAssetSpliteMethos_OutAPP) == 0x0000C8, "Member 'USeasunAssetSetting::NonAssetSpliteMethos_OutAPP' has a wrong offset!");
static_assert(offsetof(USeasunAssetSetting, bSaveCookFile) == 0x0000D8, "Member 'USeasunAssetSetting::bSaveCookFile' has a wrong offset!");
static_assert(offsetof(USeasunAssetSetting, bCalCRC) == 0x0000D9, "Member 'USeasunAssetSetting::bCalCRC' has a wrong offset!");
static_assert(offsetof(USeasunAssetSetting, bGenerateFileOpenOrder) == 0x0000DA, "Member 'USeasunAssetSetting::bGenerateFileOpenOrder' has a wrong offset!");
static_assert(offsetof(USeasunAssetSetting, bCookSingleFile) == 0x0000DB, "Member 'USeasunAssetSetting::bCookSingleFile' has a wrong offset!");
static_assert(offsetof(USeasunAssetSetting, SingleFilePath) == 0x0000E0, "Member 'USeasunAssetSetting::SingleFilePath' has a wrong offset!");
static_assert(offsetof(USeasunAssetSetting, CookIgnoreClasses) == 0x0000F0, "Member 'USeasunAssetSetting::CookIgnoreClasses' has a wrong offset!");

// Class SeasunAsset.ResourceCollector
// 0x0030 (0x0058 - 0x0028)
class UResourceCollector final : public UObject
{
public:
	TArray<struct FFilePath>                      Files;                                             // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDirectoryPath>                 Dirs;                                              // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 CollectorName;                                     // 0x0048(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ResourceCollector">();
	}
	static class UResourceCollector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UResourceCollector>();
	}
};
static_assert(alignof(UResourceCollector) == 0x000008, "Wrong alignment on UResourceCollector");
static_assert(sizeof(UResourceCollector) == 0x000058, "Wrong size on UResourceCollector");
static_assert(offsetof(UResourceCollector, Files) == 0x000028, "Member 'UResourceCollector::Files' has a wrong offset!");
static_assert(offsetof(UResourceCollector, Dirs) == 0x000038, "Member 'UResourceCollector::Dirs' has a wrong offset!");
static_assert(offsetof(UResourceCollector, CollectorName) == 0x000048, "Member 'UResourceCollector::CollectorName' has a wrong offset!");

// Class SeasunAsset.ResourceSplitter
// 0x0020 (0x0048 - 0x0028)
class UResourceSplitter final : public UObject
{
public:
	TArray<class UResourceCollector*>             Collectors;                                        // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         CollectorPath;                                     // 0x0038(0x0010)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ResourceSplitter">();
	}
	static class UResourceSplitter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UResourceSplitter>();
	}
};
static_assert(alignof(UResourceSplitter) == 0x000008, "Wrong alignment on UResourceSplitter");
static_assert(sizeof(UResourceSplitter) == 0x000048, "Wrong size on UResourceSplitter");
static_assert(offsetof(UResourceSplitter, Collectors) == 0x000028, "Member 'UResourceSplitter::Collectors' has a wrong offset!");
static_assert(offsetof(UResourceSplitter, CollectorPath) == 0x000038, "Member 'UResourceSplitter::CollectorPath' has a wrong offset!");

}

