#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SeasunAnimGraph

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// Enum SeasunAnimGraph.EWeaponHoldType
// NumValues: 0x0004
enum class EWeaponHoldType : uint8
{
	WEAPONHOLD_INVALID                       = 0,
	WEAPONHOLD_RIGHT                         = 1,
	WEAPONHOLD_LEFT                          = 2,
	WEAPONHOLD_MAX                           = 3,
};

// Enum SeasunAnimGraph.ELeftHandCorrectionType
// NumValues: 0x0003
enum class ELeftHandCorrectionType : uint8
{
	ConstrainLeftHandToRightHand             = 0,
	ConstrainLeftHandToLeftWeapon            = 1,
	ELeftHandCorrectionType_MAX              = 2,
};

// Enum SeasunAnimGraph.ECustomPhysicState
// NumValues: 0x0005
enum class ECustomPhysicState : uint8
{
	Default                                  = 0,
	Falling                                  = 1,
	UI                                       = 2,
	Main                                     = 3,
	ECustomPhysicState_MAX                   = 4,
};

// Enum SeasunAnimGraph.ECustomPhysicCalcMode
// NumValues: 0x0005
enum class ECustomPhysicCalcMode : uint8
{
	Enable                                   = 0,
	OnlyHorizontalPlane                      = 1,
	OnlyVerticalPlane                        = 2,
	Disable                                  = 3,
	ECustomPhysicCalcMode_MAX                = 4,
};

// Enum SeasunAnimGraph.ECurveSequenceSlot
// NumValues: 0x0006
enum class ECurveSequenceSlot : uint8
{
	CurveSequenceInvalid                     = 0,
	CurveSquence_Recoil                      = 1,
	CurveSquence_PhysicalRecoil              = 2,
	CurveSquence_HitReact                    = 3,
	CurveSquence_AbnormalReact               = 4,
	ECurveSequenceSlot_MAX                   = 5,
};

// Enum SeasunAnimGraph.EAnimMappingWeaponType
// NumValues: 0x000F
enum class EAnimMappingWeaponType : uint8
{
	SubmachineGun                            = 0,
	ShotGun                                  = 1,
	AssaultRifle                             = 2,
	SniperRifle                              = 3,
	BoltSniper                               = 4,
	Pistal                                   = 5,
	EnergySubmachineGun                      = 6,
	EnergyShotGun                            = 7,
	EnergyAssaultRifle                       = 8,
	EnergySniperRifle                        = 9,
	EnergyBoltSniper                         = 10,
	EnergyPistal                             = 11,
	DefaultWeapon                            = 12,
	Max_AnimMappingWeaponType                = 13,
	EAnimMappingWeaponType_MAX               = 14,
};

// Enum SeasunAnimGraph.ECustomSimulationSpace
// NumValues: 0x0005
enum class ECustomSimulationSpace : uint8
{
	None                                     = 0,
	ComponentSpace                           = 1,
	WorldSpace                               = 2,
	BaseBoneSpace                            = 3,
	ECustomSimulationSpace_MAX               = 4,
};

// Enum SeasunAnimGraph.ECollisionLimitType
// NumValues: 0x0005
enum class ECollisionLimitType : uint8
{
	None                                     = 0,
	Spherical                                = 1,
	Capsule                                  = 2,
	Planar                                   = 3,
	ECollisionLimitType_MAX                  = 4,
};

// Enum SeasunAnimGraph.EStandardBone
// NumValues: 0x0004
enum class EStandardBone : uint8
{
	NONE                                     = 0,
	HEAD                                     = 1,
	NECK                                     = 2,
	EStandardBone_MAX                        = 3,
};

// Enum SeasunAnimGraph.ESkillAimBoneWeightType
// NumValues: 0x000A
enum class ESkillAimBoneWeightType : uint8
{
	BoneWeight_Default                       = 0,
	BoneWeight_Neck                          = 1,
	BoneWeight_Neck_1                        = 2,
	BoneWeight_Neck_2                        = 3,
	BoneWeight_Head                          = 4,
	BoneWeight_Spine_0                       = 5,
	BoneWeight_Spine_1                       = 6,
	BoneWeight_Spine_2                       = 7,
	BoneWeight_Spine_3                       = 8,
	BoneWeight_MAX                           = 9,
};

// Enum SeasunAnimGraph.ESkillAimType
// NumValues: 0x000A
enum class ESkillAimType : uint8
{
	SKILLAIM_Spine                           = 0,
	SKILLAIM_LeftHand                        = 1,
	SKILLAIM_RightHand                       = 2,
	SKILLAIM_LeftRightHand                   = 3,
	SKILLAIM_SpineLeftHand                   = 4,
	SKILLAIM_SpineRightHand                  = 5,
	SKILLAIM_SpineLeftRightHand              = 6,
	SKILLAIM_Bip                             = 7,
	SKILLAIM_BipSpineHands                   = 8,
	SKILLAIM_MAX                             = 9,
};

// Enum SeasunAnimGraph.ERecoilCurveType
// NumValues: 0x0005
enum class ERecoilCurveType : uint8
{
	Cloth                                    = 0,
	Hat                                      = 1,
	Hair                                     = 2,
	Weapon                                   = 3,
	ERecoilCurveType_MAX                     = 4,
};

// Enum SeasunAnimGraph.ECurveModifyTarget
// NumValues: 0x000A
enum class ECurveModifyTarget : uint8
{
	TranslationX                             = 0,
	TranslationY                             = 1,
	TranslationZ                             = 2,
	Pitch                                    = 3,
	Yaw                                      = 4,
	Roll                                     = 5,
	ScaleX                                   = 6,
	ScaleY                                   = 7,
	ScaleZ                                   = 8,
	MAX                                      = 9,
};

// Enum SeasunAnimGraph.ENewTransitionType
// NumValues: 0x0004
enum class ENewTransitionType : uint8
{
	NoTransition                             = 0,
	StanceChangeTransition                   = 1,
	OrientationChangeTransition              = 2,
	ENewTransitionType_MAX                   = 3,
};

// Enum SeasunAnimGraph.EStance
// NumValues: 0x0005
enum class EStance : uint8
{
	DefaultStance                            = 0,
	CrouchedStance                           = 1,
	CombatStance                             = 2,
	CombatRotStance                          = 3,
	EStance_MAX                              = 4,
};

// Enum SeasunAnimGraph.EMassPointType
// NumValues: 0x000A
enum class EMassPointType : uint8
{
	None                                     = 0,
	Gun                                      = 1,
	Shoulder                                 = 2,
	Spine                                    = 3,
	Pelvis                                   = 4,
	Head                                     = 5,
	Neck                                     = 6,
	SecondGun                                = 7,
	VirtualHead                              = 8,
	EMassPointType_MAX                       = 9,
};

// Enum SeasunAnimGraph.ERecoilCorrectionType
// NumValues: 0x0005
enum class ERecoilCorrectionType : uint8
{
	RightArm                                 = 0,
	LeftArm                                  = 1,
	BothArms                                 = 2,
	SeparateArm                              = 3,
	ERecoilCorrectionType_MAX                = 4,
};

// Enum SeasunAnimGraph.EWieldWeaponType
// NumValues: 0x0005
enum class EWieldWeaponType : uint8
{
	RightHand                                = 0,
	LeftHand                                 = 1,
	DualWielding                             = 2,
	Bow                                      = 3,
	EWieldWeaponType_MAX                     = 4,
};

// Enum SeasunAnimGraph.EAimOffsetArmCorrectionPolicy
// NumValues: 0x0004
enum class EAimOffsetArmCorrectionPolicy : uint8
{
	MainArmOnly                              = 0,
	BothArms                                 = 1,
	DualWielding                             = 2,
	EAimOffsetArmCorrectionPolicy_MAX        = 3,
};

// ScriptStruct SeasunAnimGraph.PhysAnimBodyState
// 0x0008 (0x0008 - 0x0000)
struct FPhysAnimBodyState final
{
public:
	EPhysicsType                                  PhysicsType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendWeight;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPhysAnimBodyState) == 0x000004, "Wrong alignment on FPhysAnimBodyState");
static_assert(sizeof(FPhysAnimBodyState) == 0x000008, "Wrong size on FPhysAnimBodyState");
static_assert(offsetof(FPhysAnimBodyState, PhysicsType) == 0x000000, "Member 'FPhysAnimBodyState::PhysicsType' has a wrong offset!");
static_assert(offsetof(FPhysAnimBodyState, BlendWeight) == 0x000004, "Member 'FPhysAnimBodyState::BlendWeight' has a wrong offset!");

// ScriptStruct SeasunAnimGraph.PhysAnimCharState
// 0x0050 (0x0050 - 0x0000)
struct FPhysAnimCharState final
{
public:
	TMap<int32, struct FPhysAnimBodyState>        BoneStates;                                        // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPhysAnimCharState) == 0x000008, "Wrong alignment on FPhysAnimCharState");
static_assert(sizeof(FPhysAnimCharState) == 0x000050, "Wrong size on FPhysAnimCharState");
static_assert(offsetof(FPhysAnimCharState, BoneStates) == 0x000000, "Member 'FPhysAnimCharState::BoneStates' has a wrong offset!");

// ScriptStruct SeasunAnimGraph.RecoilStrength
// 0x0030 (0x0030 - 0x0000)
struct FRecoilStrength final
{
public:
	struct FVector                                Impulse_Max;                                       // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Torque_Max;                                        // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Impulse_Min;                                       // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Torque_Min;                                        // 0x0024(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRecoilStrength) == 0x000004, "Wrong alignment on FRecoilStrength");
static_assert(sizeof(FRecoilStrength) == 0x000030, "Wrong size on FRecoilStrength");
static_assert(offsetof(FRecoilStrength, Impulse_Max) == 0x000000, "Member 'FRecoilStrength::Impulse_Max' has a wrong offset!");
static_assert(offsetof(FRecoilStrength, Torque_Max) == 0x00000C, "Member 'FRecoilStrength::Torque_Max' has a wrong offset!");
static_assert(offsetof(FRecoilStrength, Impulse_Min) == 0x000018, "Member 'FRecoilStrength::Impulse_Min' has a wrong offset!");
static_assert(offsetof(FRecoilStrength, Torque_Min) == 0x000024, "Member 'FRecoilStrength::Torque_Min' has a wrong offset!");

// ScriptStruct SeasunAnimGraph.MassPointSetup
// 0x0044 (0x0044 - 0x0000)
struct FMassPointSetup final
{
public:
	uint8                                         bHasLinearConstrain : 1;                           // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ImpulseScale;                                      // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LinearStiffness;                                   // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LinearDamping;                                     // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CriticalDampingFactor_Linear;                      // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PositionConstrain;                                 // 0x0014(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bHasAngularConstrain : 1;                          // 0x0020(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TorqueScale;                                       // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularStiffness;                                  // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularDamping;                                    // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CriticalDampingFactor_Angular;                     // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RotationConstrain;                                 // 0x0034(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x4];                                       // 0x0040(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassPointSetup) == 0x000004, "Wrong alignment on FMassPointSetup");
static_assert(sizeof(FMassPointSetup) == 0x000044, "Wrong size on FMassPointSetup");
static_assert(offsetof(FMassPointSetup, ImpulseScale) == 0x000004, "Member 'FMassPointSetup::ImpulseScale' has a wrong offset!");
static_assert(offsetof(FMassPointSetup, LinearStiffness) == 0x000008, "Member 'FMassPointSetup::LinearStiffness' has a wrong offset!");
static_assert(offsetof(FMassPointSetup, LinearDamping) == 0x00000C, "Member 'FMassPointSetup::LinearDamping' has a wrong offset!");
static_assert(offsetof(FMassPointSetup, CriticalDampingFactor_Linear) == 0x000010, "Member 'FMassPointSetup::CriticalDampingFactor_Linear' has a wrong offset!");
static_assert(offsetof(FMassPointSetup, PositionConstrain) == 0x000014, "Member 'FMassPointSetup::PositionConstrain' has a wrong offset!");
static_assert(offsetof(FMassPointSetup, TorqueScale) == 0x000024, "Member 'FMassPointSetup::TorqueScale' has a wrong offset!");
static_assert(offsetof(FMassPointSetup, AngularStiffness) == 0x000028, "Member 'FMassPointSetup::AngularStiffness' has a wrong offset!");
static_assert(offsetof(FMassPointSetup, AngularDamping) == 0x00002C, "Member 'FMassPointSetup::AngularDamping' has a wrong offset!");
static_assert(offsetof(FMassPointSetup, CriticalDampingFactor_Angular) == 0x000030, "Member 'FMassPointSetup::CriticalDampingFactor_Angular' has a wrong offset!");
static_assert(offsetof(FMassPointSetup, RotationConstrain) == 0x000034, "Member 'FMassPointSetup::RotationConstrain' has a wrong offset!");

// ScriptStruct SeasunAnimGraph.RecoilSetup
// 0x0098 (0x0098 - 0x0000)
struct FRecoilSetup final
{
public:
	struct FVector                                ImpulseLimit_Max;                                  // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TorqueLimit_Max;                                   // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ImpulseLimit_Min;                                  // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TorqueLimit_Min;                                   // 0x0024(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EMassPointType, struct FMassPointSetup>  MassPoints;                                        // 0x0030(0x0050)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FRecoilStrength>                RecoilSequence;                                    // 0x0080(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRecoilSetup) == 0x000008, "Wrong alignment on FRecoilSetup");
static_assert(sizeof(FRecoilSetup) == 0x000098, "Wrong size on FRecoilSetup");
static_assert(offsetof(FRecoilSetup, ImpulseLimit_Max) == 0x000000, "Member 'FRecoilSetup::ImpulseLimit_Max' has a wrong offset!");
static_assert(offsetof(FRecoilSetup, TorqueLimit_Max) == 0x00000C, "Member 'FRecoilSetup::TorqueLimit_Max' has a wrong offset!");
static_assert(offsetof(FRecoilSetup, ImpulseLimit_Min) == 0x000018, "Member 'FRecoilSetup::ImpulseLimit_Min' has a wrong offset!");
static_assert(offsetof(FRecoilSetup, TorqueLimit_Min) == 0x000024, "Member 'FRecoilSetup::TorqueLimit_Min' has a wrong offset!");
static_assert(offsetof(FRecoilSetup, MassPoints) == 0x000030, "Member 'FRecoilSetup::MassPoints' has a wrong offset!");
static_assert(offsetof(FRecoilSetup, RecoilSequence) == 0x000080, "Member 'FRecoilSetup::RecoilSequence' has a wrong offset!");

// ScriptStruct SeasunAnimGraph.CollisionLimitBase
// 0x0050 (0x0050 - 0x0000)
struct FCollisionLimitBase
{
public:
	struct FBoneReference                         DrivingBone;                                       // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                OffsetLocation;                                    // 0x0010(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               OffsetRotation;                                    // 0x001C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0xC];                                       // 0x0034(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  Rotation;                                          // 0x0040(0x0010)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCollisionLimitBase) == 0x000010, "Wrong alignment on FCollisionLimitBase");
static_assert(sizeof(FCollisionLimitBase) == 0x000050, "Wrong size on FCollisionLimitBase");
static_assert(offsetof(FCollisionLimitBase, DrivingBone) == 0x000000, "Member 'FCollisionLimitBase::DrivingBone' has a wrong offset!");
static_assert(offsetof(FCollisionLimitBase, OffsetLocation) == 0x000010, "Member 'FCollisionLimitBase::OffsetLocation' has a wrong offset!");
static_assert(offsetof(FCollisionLimitBase, OffsetRotation) == 0x00001C, "Member 'FCollisionLimitBase::OffsetRotation' has a wrong offset!");
static_assert(offsetof(FCollisionLimitBase, Location) == 0x000028, "Member 'FCollisionLimitBase::Location' has a wrong offset!");
static_assert(offsetof(FCollisionLimitBase, Rotation) == 0x000040, "Member 'FCollisionLimitBase::Rotation' has a wrong offset!");

// ScriptStruct SeasunAnimGraph.HitReactCurveSequenceContainer
// 0x0070 (0x0070 - 0x0000)
struct FHitReactCurveSequenceContainer final
{
public:
	TSet<class FName>                             HitBoneNames;                                      // 0x0000(0x0050)(Edit, NativeAccessSpecifierPublic)
	struct FVector2D                              HitDirectionRange;                                 // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UHitReactCondition>         CustomConditionClass;                              // 0x0058(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveSequenceAsset*                    CurveSequenceAsset;                                // 0x0060(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIngoreCaclHitDirection;                           // 0x0068(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHitReactCurveSequenceContainer) == 0x000008, "Wrong alignment on FHitReactCurveSequenceContainer");
static_assert(sizeof(FHitReactCurveSequenceContainer) == 0x000070, "Wrong size on FHitReactCurveSequenceContainer");
static_assert(offsetof(FHitReactCurveSequenceContainer, HitBoneNames) == 0x000000, "Member 'FHitReactCurveSequenceContainer::HitBoneNames' has a wrong offset!");
static_assert(offsetof(FHitReactCurveSequenceContainer, HitDirectionRange) == 0x000050, "Member 'FHitReactCurveSequenceContainer::HitDirectionRange' has a wrong offset!");
static_assert(offsetof(FHitReactCurveSequenceContainer, CustomConditionClass) == 0x000058, "Member 'FHitReactCurveSequenceContainer::CustomConditionClass' has a wrong offset!");
static_assert(offsetof(FHitReactCurveSequenceContainer, CurveSequenceAsset) == 0x000060, "Member 'FHitReactCurveSequenceContainer::CurveSequenceAsset' has a wrong offset!");
static_assert(offsetof(FHitReactCurveSequenceContainer, bIngoreCaclHitDirection) == 0x000068, "Member 'FHitReactCurveSequenceContainer::bIngoreCaclHitDirection' has a wrong offset!");

// ScriptStruct SeasunAnimGraph.KawaiiPhysicsSettings
// 0x0088 (0x0088 - 0x0000)
struct FKawaiiPhysicsSettings final
{
public:
	float                                         Damping;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DampingChangeFactor;                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WorldDampingLocation;                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WorldDampingRotation;                              // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WorldDampingChangeFactor;                          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Stiffness;                                         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StiffnessChangeFactor;                             // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LimitAngle;                                        // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              MoveToComponentPostionScaleRange;                  // 0x0024(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              MoveToComponentHorizontalOffsetPostionScaleRange;  // 0x002C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            DampingCurve;                                      // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            WorldDampingLocationCurve;                         // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            WorldDampingRotationCurve;                         // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            StiffnessCurve;                                    // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            RadiusCurve;                                       // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            LimitAngleCurve;                                   // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoneMovementScale;                                 // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBoneWaveEnableWave;                               // 0x006C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WaveDuration;                                      // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaveScale;                                         // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              BaseWaveScaleRange;                                // 0x0078(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKawaiiPhysicsLimitsDataAsset*          LimitsDataAssetAdditive;                           // 0x0080(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FKawaiiPhysicsSettings) == 0x000008, "Wrong alignment on FKawaiiPhysicsSettings");
static_assert(sizeof(FKawaiiPhysicsSettings) == 0x000088, "Wrong size on FKawaiiPhysicsSettings");
static_assert(offsetof(FKawaiiPhysicsSettings, Damping) == 0x000000, "Member 'FKawaiiPhysicsSettings::Damping' has a wrong offset!");
static_assert(offsetof(FKawaiiPhysicsSettings, DampingChangeFactor) == 0x000004, "Member 'FKawaiiPhysicsSettings::DampingChangeFactor' has a wrong offset!");
static_assert(offsetof(FKawaiiPhysicsSettings, WorldDampingLocation) == 0x000008, "Member 'FKawaiiPhysicsSettings::WorldDampingLocation' has a wrong offset!");
static_assert(offsetof(FKawaiiPhysicsSettings, WorldDampingRotation) == 0x00000C, "Member 'FKawaiiPhysicsSettings::WorldDampingRotation' has a wrong offset!");
static_assert(offsetof(FKawaiiPhysicsSettings, WorldDampingChangeFactor) == 0x000010, "Member 'FKawaiiPhysicsSettings::WorldDampingChangeFactor' has a wrong offset!");
static_assert(offsetof(FKawaiiPhysicsSettings, Stiffness) == 0x000014, "Member 'FKawaiiPhysicsSettings::Stiffness' has a wrong offset!");
static_assert(offsetof(FKawaiiPhysicsSettings, StiffnessChangeFactor) == 0x000018, "Member 'FKawaiiPhysicsSettings::StiffnessChangeFactor' has a wrong offset!");
static_assert(offsetof(FKawaiiPhysicsSettings, Radius) == 0x00001C, "Member 'FKawaiiPhysicsSettings::Radius' has a wrong offset!");
static_assert(offsetof(FKawaiiPhysicsSettings, LimitAngle) == 0x000020, "Member 'FKawaiiPhysicsSettings::LimitAngle' has a wrong offset!");
static_assert(offsetof(FKawaiiPhysicsSettings, MoveToComponentPostionScaleRange) == 0x000024, "Member 'FKawaiiPhysicsSettings::MoveToComponentPostionScaleRange' has a wrong offset!");
static_assert(offsetof(FKawaiiPhysicsSettings, MoveToComponentHorizontalOffsetPostionScaleRange) == 0x00002C, "Member 'FKawaiiPhysicsSettings::MoveToComponentHorizontalOffsetPostionScaleRange' has a wrong offset!");
static_assert(offsetof(FKawaiiPhysicsSettings, DampingCurve) == 0x000038, "Member 'FKawaiiPhysicsSettings::DampingCurve' has a wrong offset!");
static_assert(offsetof(FKawaiiPhysicsSettings, WorldDampingLocationCurve) == 0x000040, "Member 'FKawaiiPhysicsSettings::WorldDampingLocationCurve' has a wrong offset!");
static_assert(offsetof(FKawaiiPhysicsSettings, WorldDampingRotationCurve) == 0x000048, "Member 'FKawaiiPhysicsSettings::WorldDampingRotationCurve' has a wrong offset!");
static_assert(offsetof(FKawaiiPhysicsSettings, StiffnessCurve) == 0x000050, "Member 'FKawaiiPhysicsSettings::StiffnessCurve' has a wrong offset!");
static_assert(offsetof(FKawaiiPhysicsSettings, RadiusCurve) == 0x000058, "Member 'FKawaiiPhysicsSettings::RadiusCurve' has a wrong offset!");
static_assert(offsetof(FKawaiiPhysicsSettings, LimitAngleCurve) == 0x000060, "Member 'FKawaiiPhysicsSettings::LimitAngleCurve' has a wrong offset!");
static_assert(offsetof(FKawaiiPhysicsSettings, BoneMovementScale) == 0x000068, "Member 'FKawaiiPhysicsSettings::BoneMovementScale' has a wrong offset!");
static_assert(offsetof(FKawaiiPhysicsSettings, bBoneWaveEnableWave) == 0x00006C, "Member 'FKawaiiPhysicsSettings::bBoneWaveEnableWave' has a wrong offset!");
static_assert(offsetof(FKawaiiPhysicsSettings, WaveDuration) == 0x000070, "Member 'FKawaiiPhysicsSettings::WaveDuration' has a wrong offset!");
static_assert(offsetof(FKawaiiPhysicsSettings, WaveScale) == 0x000074, "Member 'FKawaiiPhysicsSettings::WaveScale' has a wrong offset!");
static_assert(offsetof(FKawaiiPhysicsSettings, BaseWaveScaleRange) == 0x000078, "Member 'FKawaiiPhysicsSettings::BaseWaveScaleRange' has a wrong offset!");
static_assert(offsetof(FKawaiiPhysicsSettings, LimitsDataAssetAdditive) == 0x000080, "Member 'FKawaiiPhysicsSettings::LimitsDataAssetAdditive' has a wrong offset!");

// ScriptStruct SeasunAnimGraph.BoneChainSetup
// 0x0068 (0x0068 - 0x0000)
struct FBoneChainSetup final
{
public:
	struct FBoneReference                         Bone;                                              // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UCurveFloat*>         Curves;                                            // 0x0018(0x0050)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBoneChainSetup) == 0x000008, "Wrong alignment on FBoneChainSetup");
static_assert(sizeof(FBoneChainSetup) == 0x000068, "Wrong size on FBoneChainSetup");
static_assert(offsetof(FBoneChainSetup, Bone) == 0x000000, "Member 'FBoneChainSetup::Bone' has a wrong offset!");
static_assert(offsetof(FBoneChainSetup, Weight) == 0x000010, "Member 'FBoneChainSetup::Weight' has a wrong offset!");
static_assert(offsetof(FBoneChainSetup, Curves) == 0x000018, "Member 'FBoneChainSetup::Curves' has a wrong offset!");

// ScriptStruct SeasunAnimGraph.SkillAimOffsetData
// 0x0160 (0x0160 - 0x0000)
struct FSkillAimOffsetData final
{
public:
	struct FVector2D                              PitchRange;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              YawRange;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<ESkillAimBoneWeightType, float>          NeckSetupWeight;                                   // 0x0010(0x0050)(Edit, NativeAccessSpecifierPublic)
	TMap<ESkillAimBoneWeightType, float>          SpineSetupWeight;                                  // 0x0060(0x0050)(Edit, NativeAccessSpecifierPublic)
	ESkillAimType                                 SkillAimType;                                      // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeFloatCurve                     SkillAimAlphaCurve;                                // 0x00B8(0x0088)(Edit, NativeAccessSpecifierPublic)
	float                                         CurrentAlphaValue;                                 // 0x0140(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BipSetupWeight;                                    // 0x0144(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bHasAfterSkill : 1;                                // 0x0148(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bHasBeforeSkill : 1;                               // 0x0148(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentCorrectionElpasedTime;                      // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalCorrectionDuration;                           // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendOutTime;                                      // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSkillBlendOut;                                 // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStartBlendOutTime;                                // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsValid;                                           // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15B[0x5];                                      // 0x015B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSkillAimOffsetData) == 0x000008, "Wrong alignment on FSkillAimOffsetData");
static_assert(sizeof(FSkillAimOffsetData) == 0x000160, "Wrong size on FSkillAimOffsetData");
static_assert(offsetof(FSkillAimOffsetData, PitchRange) == 0x000000, "Member 'FSkillAimOffsetData::PitchRange' has a wrong offset!");
static_assert(offsetof(FSkillAimOffsetData, YawRange) == 0x000008, "Member 'FSkillAimOffsetData::YawRange' has a wrong offset!");
static_assert(offsetof(FSkillAimOffsetData, NeckSetupWeight) == 0x000010, "Member 'FSkillAimOffsetData::NeckSetupWeight' has a wrong offset!");
static_assert(offsetof(FSkillAimOffsetData, SpineSetupWeight) == 0x000060, "Member 'FSkillAimOffsetData::SpineSetupWeight' has a wrong offset!");
static_assert(offsetof(FSkillAimOffsetData, SkillAimType) == 0x0000B0, "Member 'FSkillAimOffsetData::SkillAimType' has a wrong offset!");
static_assert(offsetof(FSkillAimOffsetData, SkillAimAlphaCurve) == 0x0000B8, "Member 'FSkillAimOffsetData::SkillAimAlphaCurve' has a wrong offset!");
static_assert(offsetof(FSkillAimOffsetData, CurrentAlphaValue) == 0x000140, "Member 'FSkillAimOffsetData::CurrentAlphaValue' has a wrong offset!");
static_assert(offsetof(FSkillAimOffsetData, BipSetupWeight) == 0x000144, "Member 'FSkillAimOffsetData::BipSetupWeight' has a wrong offset!");
static_assert(offsetof(FSkillAimOffsetData, CurrentCorrectionElpasedTime) == 0x00014C, "Member 'FSkillAimOffsetData::CurrentCorrectionElpasedTime' has a wrong offset!");
static_assert(offsetof(FSkillAimOffsetData, TotalCorrectionDuration) == 0x000150, "Member 'FSkillAimOffsetData::TotalCorrectionDuration' has a wrong offset!");
static_assert(offsetof(FSkillAimOffsetData, BlendOutTime) == 0x000154, "Member 'FSkillAimOffsetData::BlendOutTime' has a wrong offset!");
static_assert(offsetof(FSkillAimOffsetData, bUseSkillBlendOut) == 0x000158, "Member 'FSkillAimOffsetData::bUseSkillBlendOut' has a wrong offset!");
static_assert(offsetof(FSkillAimOffsetData, bStartBlendOutTime) == 0x000159, "Member 'FSkillAimOffsetData::bStartBlendOutTime' has a wrong offset!");
static_assert(offsetof(FSkillAimOffsetData, IsValid) == 0x00015A, "Member 'FSkillAimOffsetData::IsValid' has a wrong offset!");

// ScriptStruct SeasunAnimGraph.AnimNode_SkillAim
// 0x0248 (0x0310 - 0x00C8)
struct FAnimNode_SkillAim final : public FAnimNode_SkeletalControlBase
{
public:
	float                                         Pitch;                                             // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Yaw;                                               // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBoneChainSetup>                NeckSetup;                                         // 0x00D0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FBoneChainSetup>                SpineSetup;                                        // 0x00E0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FBoneChainSetup                        BipSetup;                                          // 0x00F0(0x0068)(Edit, NativeAccessSpecifierPublic)
	struct FBoneReference                         LeftShoulder;                                      // 0x0158(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         RightShoulder;                                     // 0x0168(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         LeftClavicle;                                      // 0x0178(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         RightClavicle;                                     // 0x0188(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                SkillTargetLocation;                               // 0x0198(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               MeshToComponent;                                   // 0x01A4(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FSkillAimOffsetData                    SkillAimOffsetData;                                // 0x01B0(0x0160)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAnimNode_SkillAim) == 0x000008, "Wrong alignment on FAnimNode_SkillAim");
static_assert(sizeof(FAnimNode_SkillAim) == 0x000310, "Wrong size on FAnimNode_SkillAim");
static_assert(offsetof(FAnimNode_SkillAim, Pitch) == 0x0000C8, "Member 'FAnimNode_SkillAim::Pitch' has a wrong offset!");
static_assert(offsetof(FAnimNode_SkillAim, Yaw) == 0x0000CC, "Member 'FAnimNode_SkillAim::Yaw' has a wrong offset!");
static_assert(offsetof(FAnimNode_SkillAim, NeckSetup) == 0x0000D0, "Member 'FAnimNode_SkillAim::NeckSetup' has a wrong offset!");
static_assert(offsetof(FAnimNode_SkillAim, SpineSetup) == 0x0000E0, "Member 'FAnimNode_SkillAim::SpineSetup' has a wrong offset!");
static_assert(offsetof(FAnimNode_SkillAim, BipSetup) == 0x0000F0, "Member 'FAnimNode_SkillAim::BipSetup' has a wrong offset!");
static_assert(offsetof(FAnimNode_SkillAim, LeftShoulder) == 0x000158, "Member 'FAnimNode_SkillAim::LeftShoulder' has a wrong offset!");
static_assert(offsetof(FAnimNode_SkillAim, RightShoulder) == 0x000168, "Member 'FAnimNode_SkillAim::RightShoulder' has a wrong offset!");
static_assert(offsetof(FAnimNode_SkillAim, LeftClavicle) == 0x000178, "Member 'FAnimNode_SkillAim::LeftClavicle' has a wrong offset!");
static_assert(offsetof(FAnimNode_SkillAim, RightClavicle) == 0x000188, "Member 'FAnimNode_SkillAim::RightClavicle' has a wrong offset!");
static_assert(offsetof(FAnimNode_SkillAim, SkillTargetLocation) == 0x000198, "Member 'FAnimNode_SkillAim::SkillTargetLocation' has a wrong offset!");
static_assert(offsetof(FAnimNode_SkillAim, MeshToComponent) == 0x0001A4, "Member 'FAnimNode_SkillAim::MeshToComponent' has a wrong offset!");
static_assert(offsetof(FAnimNode_SkillAim, SkillAimOffsetData) == 0x0001B0, "Member 'FAnimNode_SkillAim::SkillAimOffsetData' has a wrong offset!");

// ScriptStruct SeasunAnimGraph.GrounderLegDefinition
// 0x0080 (0x0080 - 0x0000)
struct FGrounderLegDefinition final
{
public:
	struct FBoneReference                         FootBone;                                          // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneSocketTarget                      KneeJointTarget;                                   // 0x0010(0x0060)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         MaxRoll_Ankle;                                     // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxPitch_Ankle;                                    // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTransition_HeightOffset;                        // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGrounderLegDefinition) == 0x000010, "Wrong alignment on FGrounderLegDefinition");
static_assert(sizeof(FGrounderLegDefinition) == 0x000080, "Wrong size on FGrounderLegDefinition");
static_assert(offsetof(FGrounderLegDefinition, FootBone) == 0x000000, "Member 'FGrounderLegDefinition::FootBone' has a wrong offset!");
static_assert(offsetof(FGrounderLegDefinition, KneeJointTarget) == 0x000010, "Member 'FGrounderLegDefinition::KneeJointTarget' has a wrong offset!");
static_assert(offsetof(FGrounderLegDefinition, MaxRoll_Ankle) == 0x000070, "Member 'FGrounderLegDefinition::MaxRoll_Ankle' has a wrong offset!");
static_assert(offsetof(FGrounderLegDefinition, MaxPitch_Ankle) == 0x000074, "Member 'FGrounderLegDefinition::MaxPitch_Ankle' has a wrong offset!");
static_assert(offsetof(FGrounderLegDefinition, MaxTransition_HeightOffset) == 0x000078, "Member 'FGrounderLegDefinition::MaxTransition_HeightOffset' has a wrong offset!");

// ScriptStruct SeasunAnimGraph.AnimNode_Grounder
// 0x00A8 (0x0170 - 0x00C8)
struct FAnimNode_Grounder final : public FAnimNode_SkeletalControlBase
{
public:
	struct FBoneReference                         PelvisBone;                                        // 0x00C8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FBoneReference>                 BonesAffectedByPelvis;                             // 0x00D8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGrounderLegDefinition>         LegDefinitions;                                    // 0x00E8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         InterpSpeed;                                       // 0x00F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidDistacne_Filter;                              // 0x00FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidAngle_Filter;                                 // 0x0100(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableKneeJointTarget;                            // 0x0104(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PelvisHeightOffset;                                // 0x0108(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10C[0x64];                                     // 0x010C(0x0064)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_Grounder) == 0x000008, "Wrong alignment on FAnimNode_Grounder");
static_assert(sizeof(FAnimNode_Grounder) == 0x000170, "Wrong size on FAnimNode_Grounder");
static_assert(offsetof(FAnimNode_Grounder, PelvisBone) == 0x0000C8, "Member 'FAnimNode_Grounder::PelvisBone' has a wrong offset!");
static_assert(offsetof(FAnimNode_Grounder, BonesAffectedByPelvis) == 0x0000D8, "Member 'FAnimNode_Grounder::BonesAffectedByPelvis' has a wrong offset!");
static_assert(offsetof(FAnimNode_Grounder, LegDefinitions) == 0x0000E8, "Member 'FAnimNode_Grounder::LegDefinitions' has a wrong offset!");
static_assert(offsetof(FAnimNode_Grounder, InterpSpeed) == 0x0000F8, "Member 'FAnimNode_Grounder::InterpSpeed' has a wrong offset!");
static_assert(offsetof(FAnimNode_Grounder, ValidDistacne_Filter) == 0x0000FC, "Member 'FAnimNode_Grounder::ValidDistacne_Filter' has a wrong offset!");
static_assert(offsetof(FAnimNode_Grounder, ValidAngle_Filter) == 0x000100, "Member 'FAnimNode_Grounder::ValidAngle_Filter' has a wrong offset!");
static_assert(offsetof(FAnimNode_Grounder, bEnableKneeJointTarget) == 0x000104, "Member 'FAnimNode_Grounder::bEnableKneeJointTarget' has a wrong offset!");
static_assert(offsetof(FAnimNode_Grounder, PelvisHeightOffset) == 0x000108, "Member 'FAnimNode_Grounder::PelvisHeightOffset' has a wrong offset!");

// ScriptStruct SeasunAnimGraph.PlanarLimit
// 0x0010 (0x0060 - 0x0050)
struct FPlanarLimit final : public FCollisionLimitBase
{
public:
	struct FPlane                                 Plane;                                             // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPlanarLimit) == 0x000010, "Wrong alignment on FPlanarLimit");
static_assert(sizeof(FPlanarLimit) == 0x000060, "Wrong size on FPlanarLimit");
static_assert(offsetof(FPlanarLimit, Plane) == 0x000050, "Member 'FPlanarLimit::Plane' has a wrong offset!");

// ScriptStruct SeasunAnimGraph.CapsuleLimit
// 0x0010 (0x0060 - 0x0050)
struct FCapsuleLimit final : public FCollisionLimitBase
{
public:
	float                                         Radius;                                            // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Length;                                            // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCapsuleLimit) == 0x000010, "Wrong alignment on FCapsuleLimit");
static_assert(sizeof(FCapsuleLimit) == 0x000060, "Wrong size on FCapsuleLimit");
static_assert(offsetof(FCapsuleLimit, Radius) == 0x000050, "Member 'FCapsuleLimit::Radius' has a wrong offset!");
static_assert(offsetof(FCapsuleLimit, Length) == 0x000054, "Member 'FCapsuleLimit::Length' has a wrong offset!");

// ScriptStruct SeasunAnimGraph.SphericalLimit
// 0x0010 (0x0060 - 0x0050)
struct FSphericalLimit final : public FCollisionLimitBase
{
public:
	float                                         Radius;                                            // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESphericalLimitType                           LimitType;                                         // 0x0054(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0xB];                                       // 0x0055(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSphericalLimit) == 0x000010, "Wrong alignment on FSphericalLimit");
static_assert(sizeof(FSphericalLimit) == 0x000060, "Wrong size on FSphericalLimit");
static_assert(offsetof(FSphericalLimit, Radius) == 0x000050, "Member 'FSphericalLimit::Radius' has a wrong offset!");
static_assert(offsetof(FSphericalLimit, LimitType) == 0x000054, "Member 'FSphericalLimit::LimitType' has a wrong offset!");

// ScriptStruct SeasunAnimGraph.AnimNode_AimOffset
// 0x0138 (0x0200 - 0x00C8)
struct FAnimNode_AimOffset final : public FAnimNode_SkeletalControlBase
{
public:
	float                                         Pitch;                                             // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Yaw;                                               // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              PitchRange;                                        // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              YawRange;                                          // 0x00D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBoneChainSetup>                NeckSetup;                                         // 0x00E0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FBoneChainSetup>                SpineSetup;                                        // 0x00F0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FRotator                               MeshToComponent;                                   // 0x0100(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ShootTargetLocation;                               // 0x010C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneSocketTarget                      WeaponBone_Left;                                   // 0x0120(0x0060)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneSocketTarget                      WeaponBone_Right;                                  // 0x0180(0x0060)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	EWieldWeaponType                              WieldWeaponType;                                   // 0x01E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WeaponRaiseAlpha;                                  // 0x01E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E8[0x18];                                     // 0x01E8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_AimOffset) == 0x000010, "Wrong alignment on FAnimNode_AimOffset");
static_assert(sizeof(FAnimNode_AimOffset) == 0x000200, "Wrong size on FAnimNode_AimOffset");
static_assert(offsetof(FAnimNode_AimOffset, Pitch) == 0x0000C8, "Member 'FAnimNode_AimOffset::Pitch' has a wrong offset!");
static_assert(offsetof(FAnimNode_AimOffset, Yaw) == 0x0000CC, "Member 'FAnimNode_AimOffset::Yaw' has a wrong offset!");
static_assert(offsetof(FAnimNode_AimOffset, PitchRange) == 0x0000D0, "Member 'FAnimNode_AimOffset::PitchRange' has a wrong offset!");
static_assert(offsetof(FAnimNode_AimOffset, YawRange) == 0x0000D8, "Member 'FAnimNode_AimOffset::YawRange' has a wrong offset!");
static_assert(offsetof(FAnimNode_AimOffset, NeckSetup) == 0x0000E0, "Member 'FAnimNode_AimOffset::NeckSetup' has a wrong offset!");
static_assert(offsetof(FAnimNode_AimOffset, SpineSetup) == 0x0000F0, "Member 'FAnimNode_AimOffset::SpineSetup' has a wrong offset!");
static_assert(offsetof(FAnimNode_AimOffset, MeshToComponent) == 0x000100, "Member 'FAnimNode_AimOffset::MeshToComponent' has a wrong offset!");
static_assert(offsetof(FAnimNode_AimOffset, ShootTargetLocation) == 0x00010C, "Member 'FAnimNode_AimOffset::ShootTargetLocation' has a wrong offset!");
static_assert(offsetof(FAnimNode_AimOffset, WeaponBone_Left) == 0x000120, "Member 'FAnimNode_AimOffset::WeaponBone_Left' has a wrong offset!");
static_assert(offsetof(FAnimNode_AimOffset, WeaponBone_Right) == 0x000180, "Member 'FAnimNode_AimOffset::WeaponBone_Right' has a wrong offset!");
static_assert(offsetof(FAnimNode_AimOffset, WieldWeaponType) == 0x0001E0, "Member 'FAnimNode_AimOffset::WieldWeaponType' has a wrong offset!");
static_assert(offsetof(FAnimNode_AimOffset, WeaponRaiseAlpha) == 0x0001E4, "Member 'FAnimNode_AimOffset::WeaponRaiseAlpha' has a wrong offset!");

// ScriptStruct SeasunAnimGraph.AnimNode_BlendWithRefPose
// 0x0088 (0x0098 - 0x0010)
struct FAnimNode_BlendWithRefPose final : public FAnimNode_Base
{
public:
	struct FPoseLink                              SourcePose;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPoseLink                              DestinationPose;                                   // 0x0020(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	class UAnimSequence*                          RefPose;                                           // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RefPoseCondition;                                  // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendCrossfadeValue;                               // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         BitPad_40_0 : 2;                                   // 0x0040(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
