#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SeasunAsset

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// Enum SeasunAsset.EPakSplitType
// NumValues: 0x0004
enum class EPakSplitType : uint8
{
	Pak                                      = 0,
	FolderPak                                = 1,
	FilePak                                  = 2,
	EPakSplitType_MAX                        = 3,
};

// Enum SeasunAsset.EResSplitStage
// NumValues: 0x0004
enum class EResSplitStage : uint8
{
	RESAPP                                   = 0,
	RESFIRSTCHAPTER                          = 1,
	RESAFTERFIRSTCHAPTER                     = 2,
	EResSplitStage_MAX                       = 3,
};

// ScriptStruct SeasunAsset.HotPatchCookBackupPak
// 0x0020 (0x0020 - 0x0000)
struct FHotPatchCookBackupPak final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Assets;                                            // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHotPatchCookBackupPak) == 0x000008, "Wrong alignment on FHotPatchCookBackupPak");
static_assert(sizeof(FHotPatchCookBackupPak) == 0x000020, "Wrong size on FHotPatchCookBackupPak");
static_assert(offsetof(FHotPatchCookBackupPak, Filename) == 0x000000, "Member 'FHotPatchCookBackupPak::Filename' has a wrong offset!");
static_assert(offsetof(FHotPatchCookBackupPak, Assets) == 0x000010, "Member 'FHotPatchCookBackupPak::Assets' has a wrong offset!");

// ScriptStruct SeasunAsset.HotPatchCookBackupSplit
// 0x0018 (0x0018 - 0x0000)
struct FHotPatchCookBackupSplit final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxIndex;                                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHotPatchCookBackupSplit) == 0x000008, "Wrong alignment on FHotPatchCookBackupSplit");
static_assert(sizeof(FHotPatchCookBackupSplit) == 0x000018, "Wrong size on FHotPatchCookBackupSplit");
static_assert(offsetof(FHotPatchCookBackupSplit, Filename) == 0x000000, "Member 'FHotPatchCookBackupSplit::Filename' has a wrong offset!");
static_assert(offsetof(FHotPatchCookBackupSplit, MaxIndex) == 0x000010, "Member 'FHotPatchCookBackupSplit::MaxIndex' has a wrong offset!");

// ScriptStruct SeasunAsset.HotPatchCookBackupHash
// 0x0020 (0x0020 - 0x0000)
struct FHotPatchCookBackupHash final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Hash;                                              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHotPatchCookBackupHash) == 0x000008, "Wrong alignment on FHotPatchCookBackupHash");
static_assert(sizeof(FHotPatchCookBackupHash) == 0x000020, "Wrong size on FHotPatchCookBackupHash");
static_assert(offsetof(FHotPatchCookBackupHash, Filename) == 0x000000, "Member 'FHotPatchCookBackupHash::Filename' has a wrong offset!");
static_assert(offsetof(FHotPatchCookBackupHash, Hash) == 0x000010, "Member 'FHotPatchCookBackupHash::Hash' has a wrong offset!");

// ScriptStruct SeasunAsset.HotPatchCookBackup
// 0x0030 (0x0030 - 0x0000)
struct FHotPatchCookBackup final
{
public:
	TArray<struct FHotPatchCookBackupPak>         Paks;                                              // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHotPatchCookBackupSplit>       PakSplits;                                         // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHotPatchCookBackupHash>        Hashes;                                            // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHotPatchCookBackup) == 0x000008, "Wrong alignment on FHotPatchCookBackup");
static_assert(sizeof(FHotPatchCookBackup) == 0x000030, "Wrong size on FHotPatchCookBackup");
static_assert(offsetof(FHotPatchCookBackup, Paks) == 0x000000, "Member 'FHotPatchCookBackup::Paks' has a wrong offset!");
static_assert(offsetof(FHotPatchCookBackup, PakSplits) == 0x000010, "Member 'FHotPatchCookBackup::PakSplits' has a wrong offset!");
static_assert(offsetof(FHotPatchCookBackup, Hashes) == 0x000020, "Member 'FHotPatchCookBackup::Hashes' has a wrong offset!");

// ScriptStruct SeasunAsset.AssetInfo
// 0x0038 (0x0038 - 0x0000)
struct FAssetInfo final
{
public:
	class FString                                 AssetPath;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetType;                                         // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AssetNumber;                                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         DependecyList;                                     // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAssetInfo) == 0x000008, "Wrong alignment on FAssetInfo");
static_assert(sizeof(FAssetInfo) == 0x000038, "Wrong size on FAssetInfo");
static_assert(offsetof(FAssetInfo, AssetPath) == 0x000000, "Member 'FAssetInfo::AssetPath' has a wrong offset!");
static_assert(offsetof(FAssetInfo, AssetType) == 0x000010, "Member 'FAssetInfo::AssetType' has a wrong offset!");
static_assert(offsetof(FAssetInfo, AssetNumber) == 0x000020, "Member 'FAssetInfo::AssetNumber' has a wrong offset!");
static_assert(offsetof(FAssetInfo, DependecyList) == 0x000028, "Member 'FAssetInfo::DependecyList' has a wrong offset!");

// ScriptStruct SeasunAsset.AssetInfoList
// 0x0010 (0x0010 - 0x0000)
struct FAssetInfoList final
{
public:
	TArray<struct FAssetInfo>                     AssetList;                                         // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAssetInfoList) == 0x000008, "Wrong alignment on FAssetInfoList");
static_assert(sizeof(FAssetInfoList) == 0x000010, "Wrong size on FAssetInfoList");
static_assert(offsetof(FAssetInfoList, AssetList) == 0x000000, "Member 'FAssetInfoList::AssetList' has a wrong offset!");

// ScriptStruct SeasunAsset.CookedAssetInfo
// 0x0018 (0x0018 - 0x0000)
struct FCookedAssetInfo final
{
public:
	class FString                                 AssetPath;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        CrcCode;                                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCookedAssetInfo) == 0x000008, "Wrong alignment on FCookedAssetInfo");
static_assert(sizeof(FCookedAssetInfo) == 0x000018, "Wrong size on FCookedAssetInfo");
static_assert(offsetof(FCookedAssetInfo, AssetPath) == 0x000000, "Member 'FCookedAssetInfo::AssetPath' has a wrong offset!");
static_assert(offsetof(FCookedAssetInfo, CrcCode) == 0x000010, "Member 'FCookedAssetInfo::CrcCode' has a wrong offset!");

// ScriptStruct SeasunAsset.CookedAssetInfoFile
// 0x0020 (0x0020 - 0x0000)
struct FCookedAssetInfoFile final
{
public:
	class FString                                 CookedTime;                                        // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCookedAssetInfo>               AssetsInfos;                                       // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCookedAssetInfoFile) == 0x000008, "Wrong alignment on FCookedAssetInfoFile");
static_assert(sizeof(FCookedAssetInfoFile) == 0x000020, "Wrong size on FCookedAssetInfoFile");
static_assert(offsetof(FCookedAssetInfoFile, CookedTime) == 0x000000, "Member 'FCookedAssetInfoFile::CookedTime' has a wrong offset!");
static_assert(offsetof(FCookedAssetInfoFile, AssetsInfos) == 0x000010, "Member 'FCookedAssetInfoFile::AssetsInfos' has a wrong offset!");

// ScriptStruct SeasunAsset.SeasunPakInfo
// 0x0050 (0x0050 - 0x0000)
struct FSeasunPakInfo final
{
public:
	TArray<class FString>                         Files;                                             // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         Dir;                                               // 0x0010(0x0010)(NativeAccessSpecifierPublic)
	class FString                                 RealPath;                                          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PakName;                                           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Size;                                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFixedPackage;                                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPakSplitType                                 SpliteType;                                        // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNonAsset;                                         // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSeasunPakInfo) == 0x000008, "Wrong alignment on FSeasunPakInfo");
static_assert(sizeof(FSeasunPakInfo) == 0x000050, "Wrong size on FSeasunPakInfo");
static_assert(offsetof(FSeasunPakInfo, Files) == 0x000000, "Member 'FSeasunPakInfo::Files' has a wrong offset!");
static_assert(offsetof(FSeasunPakInfo, Dir) == 0x000010, "Member 'FSeasunPakInfo::Dir' has a wrong offset!");
static_assert(offsetof(FSeasunPakInfo, RealPath) == 0x000020, "Member 'FSeasunPakInfo::RealPath' has a wrong offset!");
static_assert(offsetof(FSeasunPakInfo, PakName) == 0x000030, "Member 'FSeasunPakInfo::PakName' has a wrong offset!");
static_assert(offsetof(FSeasunPakInfo, Size) == 0x000040, "Member 'FSeasunPakInfo::Size' has a wrong offset!");
static_assert(offsetof(FSeasunPakInfo, bFixedPackage) == 0x000048, "Member 'FSeasunPakInfo::bFixedPackage' has a wrong offset!");
static_assert(offsetof(FSeasunPakInfo, SpliteType) == 0x000049, "Member 'FSeasunPakInfo::SpliteType' has a wrong offset!");
static_assert(offsetof(FSeasunPakInfo, bNonAsset) == 0x00004A, "Member 'FSeasunPakInfo::bNonAsset' has a wrong offset!");

// ScriptStruct SeasunAsset.PakManifest
// 0x0050 (0x0050 - 0x0000)
struct FPakManifest
{
public:
	struct FSeasunPakInfo                         PakInfo;                                           // 0x0000(0x0050)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FPakManifest) == 0x000008, "Wrong alignment on FPakManifest");
static_assert(sizeof(FPakManifest) == 0x000050, "Wrong size on FPakManifest");
static_assert(offsetof(FPakManifest, PakInfo) == 0x000000, "Member 'FPakManifest::PakInfo' has a wrong offset!");

// ScriptStruct SeasunAsset.IncPakManifest
// 0x0010 (0x0060 - 0x0050)
struct FIncPakManifest final : public FPakManifest
{
public:
	TArray<class FString>                         HistoryLongPackageName;                            // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FIncPakManifest) == 0x000008, "Wrong alignment on FIncPakManifest");
static_assert(sizeof(FIncPakManifest) == 0x000060, "Wrong size on FIncPakManifest");
static_assert(offsetof(FIncPakManifest, HistoryLongPackageName) == 0x000050, "Member 'FIncPakManifest::HistoryLongPackageName' has a wrong offset!");

// ScriptStruct SeasunAsset.ProjectCookManifest
// 0x0040 (0x0040 - 0x0000)
struct FProjectCookManifest final
{
public:
	class FString                                 DistribVersion;                                    // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPakManifest>                   InAppManifest;                                     // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPakManifest>                   OutAppManifest;                                    // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FIncPakManifest>                IncrementalManifest;                               // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FProjectCookManifest) == 0x000008, "Wrong alignment on FProjectCookManifest");
static_assert(sizeof(FProjectCookManifest) == 0x000040, "Wrong size on FProjectCookManifest");
static_assert(offsetof(FProjectCookManifest, DistribVersion) == 0x000000, "Member 'FProjectCookManifest::DistribVersion' has a wrong offset!");
static_assert(offsetof(FProjectCookManifest, InAppManifest) == 0x000010, "Member 'FProjectCookManifest::InAppManifest' has a wrong offset!");
static_assert(offsetof(FProjectCookManifest, OutAppManifest) == 0x000020, "Member 'FProjectCookManifest::OutAppManifest' has a wrong offset!");
static_assert(offsetof(FProjectCookManifest, IncrementalManifest) == 0x000030, "Member 'FProjectCookManifest::IncrementalManifest' has a wrong offset!");

// ScriptStruct SeasunAsset.DirectorySplitDesc
// 0x0018 (0x0018 - 0x0000)
struct FDirectorySplitDesc final
{
public:
	struct FDirectoryPath                         Directory;                                         // 0x0000(0x0010)(Edit, NativeAccessSpecifierPublic)
	EPakSplitType                                 SplitType;                                         // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SizeMB;                                            // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDirectorySplitDesc) == 0x000008, "Wrong alignment on FDirectorySplitDesc");
static_assert(sizeof(FDirectorySplitDesc) == 0x000018, "Wrong size on FDirectorySplitDesc");
static_assert(offsetof(FDirectorySplitDesc, Directory) == 0x000000, "Member 'FDirectorySplitDesc::Directory' has a wrong offset!");
static_assert(offsetof(FDirectorySplitDesc, SplitType) == 0x000010, "Member 'FDirectorySplitDesc::SplitType' has a wrong offset!");
static_assert(offsetof(FDirectorySplitDesc, SizeMB) == 0x000014, "Member 'FDirectorySplitDesc::SizeMB' has a wrong offset!");

// ScriptStruct SeasunAsset.DirCookAssets
// 0x0038 (0x0038 - 0x0000)
struct FDirCookAssets final
{
public:
	struct FDirectorySplitDesc                    Desc;                                              // 0x0000(0x0018)(NativeAccessSpecifierPublic)
	class FString                                 RealPath;                                          // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         AssetsList;                                        // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDirCookAssets) == 0x000008, "Wrong alignment on FDirCookAssets");
static_assert(sizeof(FDirCookAssets) == 0x000038, "Wrong size on FDirCookAssets");
static_assert(offsetof(FDirCookAssets, Desc) == 0x000000, "Member 'FDirCookAssets::Desc' has a wrong offset!");
static_assert(offsetof(FDirCookAssets, RealPath) == 0x000018, "Member 'FDirCookAssets::RealPath' has a wrong offset!");
static_assert(offsetof(FDirCookAssets, AssetsList) == 0x000028, "Member 'FDirCookAssets::AssetsList' has a wrong offset!");

// ScriptStruct SeasunAsset.SeasunPakInfos
// 0x0030 (0x0030 - 0x0000)
struct FSeasunPakInfos final
{
public:
	TArray<struct FSeasunPakInfo>                 InAppPaks;                                         // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSeasunPakInfo>                 OutAppPaks;                                        // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSeasunPakInfo>                 PatchPaks;                                         // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSeasunPakInfos) == 0x000008, "Wrong alignment on FSeasunPakInfos");
static_assert(sizeof(FSeasunPakInfos) == 0x000030, "Wrong size on FSeasunPakInfos");
static_assert(offsetof(FSeasunPakInfos, InAppPaks) == 0x000000, "Member 'FSeasunPakInfos::InAppPaks' has a wrong offset!");
static_assert(offsetof(FSeasunPakInfos, OutAppPaks) == 0x000010, "Member 'FSeasunPakInfos::OutAppPaks' has a wrong offset!");
static_assert(offsetof(FSeasunPakInfos, PatchPaks) == 0x000020, "Member 'FSeasunPakInfos::PatchPaks' has a wrong offset!");

// ScriptStruct SeasunAsset.DownloadPakDesc
// 0x0020 (0x0020 - 0x0000)
struct FDownloadPakDesc final
{
public:
	class FString                                 Pak;                                               // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        CRC;                                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDownloaded;                                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Size;                                              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDownloadPakDesc) == 0x000008, "Wrong alignment on FDownloadPakDesc");
static_assert(sizeof(FDownloadPakDesc) == 0x000020, "Wrong size on FDownloadPakDesc");
static_assert(offsetof(FDownloadPakDesc, Pak) == 0x000000, "Member 'FDownloadPakDesc::Pak' has a wrong offset!");
static_assert(offsetof(FDownloadPakDesc, CRC) == 0x000010, "Member 'FDownloadPakDesc::CRC' has a wrong offset!");
static_assert(offsetof(FDownloadPakDesc, Type) == 0x000014, "Member 'FDownloadPakDesc::Type' has a wrong offset!");
static_assert(offsetof(FDownloadPakDesc, bDownloaded) == 0x000018, "Member 'FDownloadPakDesc::bDownloaded' has a wrong offset!");
static_assert(offsetof(FDownloadPakDesc, Size) == 0x00001C, "Member 'FDownloadPakDesc::Size' has a wrong offset!");

// ScriptStruct SeasunAsset.SeasunPatchInfo
// 0x0030 (0x0030 - 0x0000)
struct FSeasunPatchInfo final
{
public:
	class FString                                 Version;                                           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProjectVersion;                                    // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDownloadPakDesc>               Paks;                                              // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSeasunPatchInfo) == 0x000008, "Wrong alignment on FSeasunPatchInfo");
static_assert(sizeof(FSeasunPatchInfo) == 0x000030, "Wrong size on FSeasunPatchInfo");
static_assert(offsetof(FSeasunPatchInfo, Version) == 0x000000, "Member 'FSeasunPatchInfo::Version' has a wrong offset!");
static_assert(offsetof(FSeasunPatchInfo, ProjectVersion) == 0x000010, "Member 'FSeasunPatchInfo::ProjectVersion' has a wrong offset!");
static_assert(offsetof(FSeasunPatchInfo, Paks) == 0x000020, "Member 'FSeasunPatchInfo::Paks' has a wrong offset!");

}

