#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SeasunVehicleOnline

#include "Basic.hpp"

#include "PhysXVehicles_classes.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class SeasunVehicleOnline.VehicleOnlineGameMode
// 0x0000 (0x0310 - 0x0310)
class AVehicleOnlineGameMode final : public AGameMode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleOnlineGameMode">();
	}
	static class AVehicleOnlineGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVehicleOnlineGameMode>();
	}
};
static_assert(alignof(AVehicleOnlineGameMode) == 0x000008, "Wrong alignment on AVehicleOnlineGameMode");
static_assert(sizeof(AVehicleOnlineGameMode) == 0x000310, "Wrong size on AVehicleOnlineGameMode");

// Class SeasunVehicleOnline.VehicleOnlineHud
// 0x0008 (0x0320 - 0x0318)
class AVehicleOnlineHud final : public AHUD
{
public:
	class UFont*                                  HUDFont;                                           // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleOnlineHud">();
	}
	static class AVehicleOnlineHud* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVehicleOnlineHud>();
	}
};
static_assert(alignof(AVehicleOnlineHud) == 0x000008, "Wrong alignment on AVehicleOnlineHud");
static_assert(sizeof(AVehicleOnlineHud) == 0x000320, "Wrong size on AVehicleOnlineHud");
static_assert(offsetof(AVehicleOnlineHud, HUDFont) == 0x000318, "Member 'AVehicleOnlineHud::HUDFont' has a wrong offset!");

// Class SeasunVehicleOnline.VehicleOnlinePawn
// 0x0098 (0x0330 - 0x0298)
class AVehicleOnlinePawn final : public AWheeledVehicle
{
public:
	class USpringArmComponent*                    SpringArm;                                         // 0x0298(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCameraComponent*                       Camera;                                            // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneComponent*                        InternalCameraBase;                                // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCameraComponent*                       InternalCamera;                                    // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextRenderComponent*                   InCarSpeed;                                        // 0x02B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextRenderComponent*                   InCarGear;                                         // 0x02C0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAudioComponent*                        EngineSoundComponent;                              // 0x02C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                   SpeedDisplayString;                                // 0x02D0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
	class FText                                   GearDisplayString;                                 // 0x02E8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
	struct FColor                                 GearDisplayColor;                                  // 0x0300(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 GearDisplayReverseColor;                           // 0x0304(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInCarCameraActive;                                // 0x0308(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInReverseGear;                                    // 0x0309(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30A[0x26];                                     // 0x030A(0x0026)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleOnlinePawn">();
	}
	static class AVehicleOnlinePawn* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVehicleOnlinePawn>();
	}
};
static_assert(alignof(AVehicleOnlinePawn) == 0x000008, "Wrong alignment on AVehicleOnlinePawn");
static_assert(sizeof(AVehicleOnlinePawn) == 0x000330, "Wrong size on AVehicleOnlinePawn");
static_assert(offsetof(AVehicleOnlinePawn, SpringArm) == 0x000298, "Member 'AVehicleOnlinePawn::SpringArm' has a wrong offset!");
static_assert(offsetof(AVehicleOnlinePawn, Camera) == 0x0002A0, "Member 'AVehicleOnlinePawn::Camera' has a wrong offset!");
static_assert(offsetof(AVehicleOnlinePawn, InternalCameraBase) == 0x0002A8, "Member 'AVehicleOnlinePawn::InternalCameraBase' has a wrong offset!");
static_assert(offsetof(AVehicleOnlinePawn, InternalCamera) == 0x0002B0, "Member 'AVehicleOnlinePawn::InternalCamera' has a wrong offset!");
static_assert(offsetof(AVehicleOnlinePawn, InCarSpeed) == 0x0002B8, "Member 'AVehicleOnlinePawn::InCarSpeed' has a wrong offset!");
static_assert(offsetof(AVehicleOnlinePawn, InCarGear) == 0x0002C0, "Member 'AVehicleOnlinePawn::InCarGear' has a wrong offset!");
static_assert(offsetof(AVehicleOnlinePawn, EngineSoundComponent) == 0x0002C8, "Member 'AVehicleOnlinePawn::EngineSoundComponent' has a wrong offset!");
static_assert(offsetof(AVehicleOnlinePawn, SpeedDisplayString) == 0x0002D0, "Member 'AVehicleOnlinePawn::SpeedDisplayString' has a wrong offset!");
static_assert(offsetof(AVehicleOnlinePawn, GearDisplayString) == 0x0002E8, "Member 'AVehicleOnlinePawn::GearDisplayString' has a wrong offset!");
static_assert(offsetof(AVehicleOnlinePawn, GearDisplayColor) == 0x000300, "Member 'AVehicleOnlinePawn::GearDisplayColor' has a wrong offset!");
static_assert(offsetof(AVehicleOnlinePawn, GearDisplayReverseColor) == 0x000304, "Member 'AVehicleOnlinePawn::GearDisplayReverseColor' has a wrong offset!");
static_assert(offsetof(AVehicleOnlinePawn, bInCarCameraActive) == 0x000308, "Member 'AVehicleOnlinePawn::bInCarCameraActive' has a wrong offset!");
static_assert(offsetof(AVehicleOnlinePawn, bInReverseGear) == 0x000309, "Member 'AVehicleOnlinePawn::bInReverseGear' has a wrong offset!");

// Class SeasunVehicleOnline.VehicleOnlineWheelFront
// 0x0000 (0x00F0 - 0x00F0)
class UVehicleOnlineWheelFront final : public UVehicleWheel
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleOnlineWheelFront">();
	}
	static class UVehicleOnlineWheelFront* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleOnlineWheelFront>();
	}
};
static_assert(alignof(UVehicleOnlineWheelFront) == 0x000008, "Wrong alignment on UVehicleOnlineWheelFront");
static_assert(sizeof(UVehicleOnlineWheelFront) == 0x0000F0, "Wrong size on UVehicleOnlineWheelFront");

// Class SeasunVehicleOnline.VehicleOnlineWheelRear
// 0x0000 (0x00F0 - 0x00F0)
class UVehicleOnlineWheelRear final : public UVehicleWheel
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleOnlineWheelRear">();
	}
	static class UVehicleOnlineWheelRear* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleOnlineWheelRear>();
	}
};
static_assert(alignof(UVehicleOnlineWheelRear) == 0x000008, "Wrong alignment on UVehicleOnlineWheelRear");
static_assert(sizeof(UVehicleOnlineWheelRear) == 0x0000F0, "Wrong size on UVehicleOnlineWheelRear");

}

