#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SeasunVehicle

#include "Basic.hpp"

#include "PhysicsControl_structs.hpp"
#include "PhysXVehicles_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum SeasunVehicle.EVehicleCameraType
// NumValues: 0x0004
enum class EVehicleCameraType : uint8
{
	FirstPersonCamera                        = 0,
	ThirdPersonCamera                        = 1,
	Switch                                   = 2,
	EVehicleCameraType_MAX                   = 3,
};

// Enum SeasunVehicle.EDiffMechanismType
// NumValues: 0x0002
enum class EDiffMechanismType : uint8
{
	Invalid                                  = 0,
	EDiffMechanismType_MAX                   = 1,
};

// Enum SeasunVehicle.ETGameVehicleType
// NumValues: 0x0003
enum class ETGameVehicleType : uint8
{
	Invalid                                  = 0,
	TwistCard                                = 1,
	ETGameVehicleType_MAX                    = 2,
};

// ScriptStruct SeasunVehicle.VehicleParamNameToSet
// 0x0010 (0x0010 - 0x0000)
struct FVehicleParamNameToSet final
{
public:
	TArray<class FName>                           ToSetParamName;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVehicleParamNameToSet) == 0x000008, "Wrong alignment on FVehicleParamNameToSet");
static_assert(sizeof(FVehicleParamNameToSet) == 0x000010, "Wrong size on FVehicleParamNameToSet");
static_assert(offsetof(FVehicleParamNameToSet, ToSetParamName) == 0x000000, "Member 'FVehicleParamNameToSet::ToSetParamName' has a wrong offset!");

// ScriptStruct SeasunVehicle.VehicleTemplateDiffMechanismSetting
// 0x001C (0x001C - 0x0000)
struct FVehicleTemplateDiffMechanismSetting final
{
public:
	EVehicleDifferential4W                        DifferentialType;                                  // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FrontRearSplit;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FrontLeftRightSplit;                               // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RearLeftRightSplit;                                // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CentreBias;                                        // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FrontBias;                                         // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RearBias;                                          // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVehicleTemplateDiffMechanismSetting) == 0x000004, "Wrong alignment on FVehicleTemplateDiffMechanismSetting");
static_assert(sizeof(FVehicleTemplateDiffMechanismSetting) == 0x00001C, "Wrong size on FVehicleTemplateDiffMechanismSetting");
static_assert(offsetof(FVehicleTemplateDiffMechanismSetting, DifferentialType) == 0x000000, "Member 'FVehicleTemplateDiffMechanismSetting::DifferentialType' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateDiffMechanismSetting, FrontRearSplit) == 0x000004, "Member 'FVehicleTemplateDiffMechanismSetting::FrontRearSplit' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateDiffMechanismSetting, FrontLeftRightSplit) == 0x000008, "Member 'FVehicleTemplateDiffMechanismSetting::FrontLeftRightSplit' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateDiffMechanismSetting, RearLeftRightSplit) == 0x00000C, "Member 'FVehicleTemplateDiffMechanismSetting::RearLeftRightSplit' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateDiffMechanismSetting, CentreBias) == 0x000010, "Member 'FVehicleTemplateDiffMechanismSetting::CentreBias' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateDiffMechanismSetting, FrontBias) == 0x000014, "Member 'FVehicleTemplateDiffMechanismSetting::FrontBias' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateDiffMechanismSetting, RearBias) == 0x000018, "Member 'FVehicleTemplateDiffMechanismSetting::RearBias' has a wrong offset!");

// ScriptStruct SeasunVehicle.VehicleMovementTypeInSet
// 0x0018 (0x0018 - 0x0000)
struct FVehicleMovementTypeInSet final
{
public:
	EPhysicsMovementType                          MovementType;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           SetNames;                                          // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVehicleMovementTypeInSet) == 0x000008, "Wrong alignment on FVehicleMovementTypeInSet");
static_assert(sizeof(FVehicleMovementTypeInSet) == 0x000018, "Wrong size on FVehicleMovementTypeInSet");
static_assert(offsetof(FVehicleMovementTypeInSet, MovementType) == 0x000000, "Member 'FVehicleMovementTypeInSet::MovementType' has a wrong offset!");
static_assert(offsetof(FVehicleMovementTypeInSet, SetNames) == 0x000008, "Member 'FVehicleMovementTypeInSet::SetNames' has a wrong offset!");

// ScriptStruct SeasunVehicle.VehicleControlDataInSet
// 0x0028 (0x0028 - 0x0000)
struct FVehicleControlDataInSet final
{
public:
	class FName                                   SetName;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPhysicsControlData                    ControlData;                                       // 0x0008(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVehicleControlDataInSet) == 0x000004, "Wrong alignment on FVehicleControlDataInSet");
static_assert(sizeof(FVehicleControlDataInSet) == 0x000028, "Wrong size on FVehicleControlDataInSet");
static_assert(offsetof(FVehicleControlDataInSet, SetName) == 0x000000, "Member 'FVehicleControlDataInSet::SetName' has a wrong offset!");
static_assert(offsetof(FVehicleControlDataInSet, ControlData) == 0x000008, "Member 'FVehicleControlDataInSet::ControlData' has a wrong offset!");

// ScriptStruct SeasunVehicle.VehicleTemplateEffect
// 0x00A0 (0x00A0 - 0x0000)
struct FVehicleTemplateEffect final
{
public:
	TSoftObjectPtr<class UNiagaraSystem>          ExhaustEffect;                                     // 0x0000(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UNiagaraSystem>          WhiffEffect;                                       // 0x0028(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UNiagaraSystem>          SlipperySmokeEffect;                               // 0x0050(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UNiagaraSystem>          SlipperyTyreEffect;                                // 0x0078(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVehicleTemplateEffect) == 0x000008, "Wrong alignment on FVehicleTemplateEffect");
static_assert(sizeof(FVehicleTemplateEffect) == 0x0000A0, "Wrong size on FVehicleTemplateEffect");
static_assert(offsetof(FVehicleTemplateEffect, ExhaustEffect) == 0x000000, "Member 'FVehicleTemplateEffect::ExhaustEffect' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateEffect, WhiffEffect) == 0x000028, "Member 'FVehicleTemplateEffect::WhiffEffect' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateEffect, SlipperySmokeEffect) == 0x000050, "Member 'FVehicleTemplateEffect::SlipperySmokeEffect' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateEffect, SlipperyTyreEffect) == 0x000078, "Member 'FVehicleTemplateEffect::SlipperyTyreEffect' has a wrong offset!");

// ScriptStruct SeasunVehicle.VehicleTemplateSound
// 0x0040 (0x0040 - 0x0000)
struct FVehicleTemplateSound final
{
public:
	class FString                                 ChangeGearSound;                                   // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ZeroSpeedBrakeSound;                               // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SpeedEffectSound;                                  // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SlipEffectSound;                                   // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVehicleTemplateSound) == 0x000008, "Wrong alignment on FVehicleTemplateSound");
static_assert(sizeof(FVehicleTemplateSound) == 0x000040, "Wrong size on FVehicleTemplateSound");
static_assert(offsetof(FVehicleTemplateSound, ChangeGearSound) == 0x000000, "Member 'FVehicleTemplateSound::ChangeGearSound' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateSound, ZeroSpeedBrakeSound) == 0x000010, "Member 'FVehicleTemplateSound::ZeroSpeedBrakeSound' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateSound, SpeedEffectSound) == 0x000020, "Member 'FVehicleTemplateSound::SpeedEffectSound' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateSound, SlipEffectSound) == 0x000030, "Member 'FVehicleTemplateSound::SlipEffectSound' has a wrong offset!");

// ScriptStruct SeasunVehicle.VehicleTemplateTPCameraDelay
// 0x0010 (0x0010 - 0x0000)
struct FVehicleTemplateTPCameraDelay final
{
public:
	bool                                          bCanDelay;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CameraDelayBlendSpd;                               // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraRotDelayBlendSpd;                            // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraMaxDelayDistance;                            // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVehicleTemplateTPCameraDelay) == 0x000004, "Wrong alignment on FVehicleTemplateTPCameraDelay");
static_assert(sizeof(FVehicleTemplateTPCameraDelay) == 0x000010, "Wrong size on FVehicleTemplateTPCameraDelay");
static_assert(offsetof(FVehicleTemplateTPCameraDelay, bCanDelay) == 0x000000, "Member 'FVehicleTemplateTPCameraDelay::bCanDelay' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateTPCameraDelay, CameraDelayBlendSpd) == 0x000004, "Member 'FVehicleTemplateTPCameraDelay::CameraDelayBlendSpd' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateTPCameraDelay, CameraRotDelayBlendSpd) == 0x000008, "Member 'FVehicleTemplateTPCameraDelay::CameraRotDelayBlendSpd' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateTPCameraDelay, CameraMaxDelayDistance) == 0x00000C, "Member 'FVehicleTemplateTPCameraDelay::CameraMaxDelayDistance' has a wrong offset!");

// ScriptStruct SeasunVehicle.VehicleTemplateThirdPersonCamera
// 0x0070 (0x0070 - 0x0000)
struct FVehicleTemplateThirdPersonCamera final
{
public:
	bool                                          bIsFixCamera;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ArmLength;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ArmDefaultPos;                                     // 0x0008(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ArmDefaultRot;                                     // 0x0014(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                CameraOffset;                                      // 0x0020(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CameraDefaultRot;                                  // 0x002C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UCurveFloat>             SpeedToFovCurve;                                   // 0x0038(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVehicleTemplateTPCameraDelay          ThirdPersonDelay;                                  // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVehicleTemplateThirdPersonCamera) == 0x000008, "Wrong alignment on FVehicleTemplateThirdPersonCamera");
static_assert(sizeof(FVehicleTemplateThirdPersonCamera) == 0x000070, "Wrong size on FVehicleTemplateThirdPersonCamera");
static_assert(offsetof(FVehicleTemplateThirdPersonCamera, bIsFixCamera) == 0x000000, "Member 'FVehicleTemplateThirdPersonCamera::bIsFixCamera' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateThirdPersonCamera, ArmLength) == 0x000004, "Member 'FVehicleTemplateThirdPersonCamera::ArmLength' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateThirdPersonCamera, ArmDefaultPos) == 0x000008, "Member 'FVehicleTemplateThirdPersonCamera::ArmDefaultPos' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateThirdPersonCamera, ArmDefaultRot) == 0x000014, "Member 'FVehicleTemplateThirdPersonCamera::ArmDefaultRot' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateThirdPersonCamera, CameraOffset) == 0x000020, "Member 'FVehicleTemplateThirdPersonCamera::CameraOffset' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateThirdPersonCamera, CameraDefaultRot) == 0x00002C, "Member 'FVehicleTemplateThirdPersonCamera::CameraDefaultRot' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateThirdPersonCamera, SpeedToFovCurve) == 0x000038, "Member 'FVehicleTemplateThirdPersonCamera::SpeedToFovCurve' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateThirdPersonCamera, ThirdPersonDelay) == 0x000060, "Member 'FVehicleTemplateThirdPersonCamera::ThirdPersonDelay' has a wrong offset!");

// ScriptStruct SeasunVehicle.VehicleTemplateFirstPersonCameraDelay
// 0x0008 (0x0008 - 0x0000)
struct FVehicleTemplateFirstPersonCameraDelay final
{
public:
	bool                                          bCanCameraRotateDelay;                             // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CameraRotDelayBlendSpd;                            // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVehicleTemplateFirstPersonCameraDelay) == 0x000004, "Wrong alignment on FVehicleTemplateFirstPersonCameraDelay");
static_assert(sizeof(FVehicleTemplateFirstPersonCameraDelay) == 0x000008, "Wrong size on FVehicleTemplateFirstPersonCameraDelay");
static_assert(offsetof(FVehicleTemplateFirstPersonCameraDelay, bCanCameraRotateDelay) == 0x000000, "Member 'FVehicleTemplateFirstPersonCameraDelay::bCanCameraRotateDelay' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateFirstPersonCameraDelay, CameraRotDelayBlendSpd) == 0x000004, "Member 'FVehicleTemplateFirstPersonCameraDelay::CameraRotDelayBlendSpd' has a wrong offset!");

// ScriptStruct SeasunVehicle.VehicleTemplateFirstPersonCamera
// 0x0030 (0x0030 - 0x0000)
struct FVehicleTemplateFirstPersonCamera final
{
public:
	bool                                          bIsFixCamera;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CameraRot;                                         // 0x0004(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                FirstCameraOffset;                                 // 0x0010(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               CameraDefaultRot;                                  // 0x001C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVehicleTemplateFirstPersonCameraDelay FirstPersonCameraDelay;                            // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVehicleTemplateFirstPersonCamera) == 0x000004, "Wrong alignment on FVehicleTemplateFirstPersonCamera");
static_assert(sizeof(FVehicleTemplateFirstPersonCamera) == 0x000030, "Wrong size on FVehicleTemplateFirstPersonCamera");
static_assert(offsetof(FVehicleTemplateFirstPersonCamera, bIsFixCamera) == 0x000000, "Member 'FVehicleTemplateFirstPersonCamera::bIsFixCamera' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateFirstPersonCamera, CameraRot) == 0x000004, "Member 'FVehicleTemplateFirstPersonCamera::CameraRot' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateFirstPersonCamera, FirstCameraOffset) == 0x000010, "Member 'FVehicleTemplateFirstPersonCamera::FirstCameraOffset' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateFirstPersonCamera, CameraDefaultRot) == 0x00001C, "Member 'FVehicleTemplateFirstPersonCamera::CameraDefaultRot' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateFirstPersonCamera, FirstPersonCameraDelay) == 0x000028, "Member 'FVehicleTemplateFirstPersonCamera::FirstPersonCameraDelay' has a wrong offset!");

// ScriptStruct SeasunVehicle.VehicleTemplateWheelSettings
// 0x0020 (0x0020 - 0x0000)
struct FVehicleTemplateWheelSettings final
{
public:
	TSubclassOf<class UVehicleWheel>              WheelClass;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                AdditionalOffset;                                  // 0x0010(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableSteering;                                  // 0x001C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVehicleTemplateWheelSettings) == 0x000008, "Wrong alignment on FVehicleTemplateWheelSettings");
static_assert(sizeof(FVehicleTemplateWheelSettings) == 0x000020, "Wrong size on FVehicleTemplateWheelSettings");
static_assert(offsetof(FVehicleTemplateWheelSettings, WheelClass) == 0x000000, "Member 'FVehicleTemplateWheelSettings::WheelClass' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateWheelSettings, BoneName) == 0x000008, "Member 'FVehicleTemplateWheelSettings::BoneName' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateWheelSettings, AdditionalOffset) == 0x000010, "Member 'FVehicleTemplateWheelSettings::AdditionalOffset' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateWheelSettings, bDisableSteering) == 0x00001C, "Member 'FVehicleTemplateWheelSettings::bDisableSteering' has a wrong offset!");

// ScriptStruct SeasunVehicle.VehicleTemplateBlueprintContent
// 0x0028 (0x0028 - 0x0000)
struct FVehicleTemplateBlueprintContent final
{
public:
	bool                                          bDeprecatedSpringOffsetMode;                       // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReverseAsBrake;                                   // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Mass;                                              // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVehicleTemplateWheelSettings>  WheelSetups;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         DragCoefficient;                                   // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChassisWidth;                                      // 0x001C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChassisHeight;                                     // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVehicleTemplateBlueprintContent) == 0x000008, "Wrong alignment on FVehicleTemplateBlueprintContent");
static_assert(sizeof(FVehicleTemplateBlueprintContent) == 0x000028, "Wrong size on FVehicleTemplateBlueprintContent");
static_assert(offsetof(FVehicleTemplateBlueprintContent, bDeprecatedSpringOffsetMode) == 0x000000, "Member 'FVehicleTemplateBlueprintContent::bDeprecatedSpringOffsetMode' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateBlueprintContent, bReverseAsBrake) == 0x000001, "Member 'FVehicleTemplateBlueprintContent::bReverseAsBrake' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateBlueprintContent, Mass) == 0x000004, "Member 'FVehicleTemplateBlueprintContent::Mass' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateBlueprintContent, WheelSetups) == 0x000008, "Member 'FVehicleTemplateBlueprintContent::WheelSetups' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateBlueprintContent, DragCoefficient) == 0x000018, "Member 'FVehicleTemplateBlueprintContent::DragCoefficient' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateBlueprintContent, ChassisWidth) == 0x00001C, "Member 'FVehicleTemplateBlueprintContent::ChassisWidth' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateBlueprintContent, ChassisHeight) == 0x000020, "Member 'FVehicleTemplateBlueprintContent::ChassisHeight' has a wrong offset!");

// ScriptStruct SeasunVehicle.VehicleTemplateModifySpd
// 0x000C (0x000C - 0x0000)
struct FVehicleTemplateModifySpd final
{
public:
	bool                                          bIsFixCamera;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AutoBrakeThresold;                                 // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WrongDirBrakeThreshold;                            // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVehicleTemplateModifySpd) == 0x000004, "Wrong alignment on FVehicleTemplateModifySpd");
static_assert(sizeof(FVehicleTemplateModifySpd) == 0x00000C, "Wrong size on FVehicleTemplateModifySpd");
static_assert(offsetof(FVehicleTemplateModifySpd, bIsFixCamera) == 0x000000, "Member 'FVehicleTemplateModifySpd::bIsFixCamera' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateModifySpd, AutoBrakeThresold) == 0x000004, "Member 'FVehicleTemplateModifySpd::AutoBrakeThresold' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateModifySpd, WrongDirBrakeThreshold) == 0x000008, "Member 'FVehicleTemplateModifySpd::WrongDirBrakeThreshold' has a wrong offset!");

// ScriptStruct SeasunVehicle.VehicleTemplateEngineSettings
// 0x0040 (0x0040 - 0x0000)
struct FVehicleTemplateEngineSettings final
{
public:
	TSoftObjectPtr<class UCurveFloat>             TorqueRotCurve;                                    // 0x0000(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRPM;                                            // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MOI;                                               // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DampingRateFullThrottle;                           // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DampingRateZeroThrottleClutchEngaged;              // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DampingRateZeroThrottleClutchDisengaged;           // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVehicleTemplateEngineSettings) == 0x000008, "Wrong alignment on FVehicleTemplateEngineSettings");
static_assert(sizeof(FVehicleTemplateEngineSettings) == 0x000040, "Wrong size on FVehicleTemplateEngineSettings");
static_assert(offsetof(FVehicleTemplateEngineSettings, TorqueRotCurve) == 0x000000, "Member 'FVehicleTemplateEngineSettings::TorqueRotCurve' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateEngineSettings, MaxRPM) == 0x000028, "Member 'FVehicleTemplateEngineSettings::MaxRPM' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateEngineSettings, MOI) == 0x00002C, "Member 'FVehicleTemplateEngineSettings::MOI' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateEngineSettings, DampingRateFullThrottle) == 0x000030, "Member 'FVehicleTemplateEngineSettings::DampingRateFullThrottle' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateEngineSettings, DampingRateZeroThrottleClutchEngaged) == 0x000034, "Member 'FVehicleTemplateEngineSettings::DampingRateZeroThrottleClutchEngaged' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateEngineSettings, DampingRateZeroThrottleClutchDisengaged) == 0x000038, "Member 'FVehicleTemplateEngineSettings::DampingRateZeroThrottleClutchDisengaged' has a wrong offset!");

// ScriptStruct SeasunVehicle.VehicleTemplateTransmissionData
// 0x0030 (0x0030 - 0x0000)
struct FVehicleTemplateTransmissionData final
{
public:
	bool                                          bUseGearAutoBox;                                   // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GearSwitchTime;                                    // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GearAutoBoxLatency;                                // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FinalRatio;                                        // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVehicleGearData>               ForwardGears;                                      // 0x0010(0x0010)(Edit, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	float                                         ReverseGearRatio;                                  // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NeutralGearUpRatio;                                // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClutchStrength;                                    // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVehicleTemplateTransmissionData) == 0x000008, "Wrong alignment on FVehicleTemplateTransmissionData");
static_assert(sizeof(FVehicleTemplateTransmissionData) == 0x000030, "Wrong size on FVehicleTemplateTransmissionData");
static_assert(offsetof(FVehicleTemplateTransmissionData, bUseGearAutoBox) == 0x000000, "Member 'FVehicleTemplateTransmissionData::bUseGearAutoBox' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateTransmissionData, GearSwitchTime) == 0x000004, "Member 'FVehicleTemplateTransmissionData::GearSwitchTime' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateTransmissionData, GearAutoBoxLatency) == 0x000008, "Member 'FVehicleTemplateTransmissionData::GearAutoBoxLatency' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateTransmissionData, FinalRatio) == 0x00000C, "Member 'FVehicleTemplateTransmissionData::FinalRatio' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateTransmissionData, ForwardGears) == 0x000010, "Member 'FVehicleTemplateTransmissionData::ForwardGears' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateTransmissionData, ReverseGearRatio) == 0x000020, "Member 'FVehicleTemplateTransmissionData::ReverseGearRatio' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateTransmissionData, NeutralGearUpRatio) == 0x000024, "Member 'FVehicleTemplateTransmissionData::NeutralGearUpRatio' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateTransmissionData, ClutchStrength) == 0x000028, "Member 'FVehicleTemplateTransmissionData::ClutchStrength' has a wrong offset!");

// ScriptStruct SeasunVehicle.VehicleTemplateInputsSettings
// 0x0020 (0x0020 - 0x0000)
struct FVehicleTemplateInputsSettings final
{
public:
	struct FVehicleInputRate                      ThrottleInputRate;                                 // 0x0000(0x0008)(Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FVehicleInputRate                      BrakeInputRate;                                    // 0x0008(0x0008)(Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FVehicleInputRate                      HandbrakeInputRate;                                // 0x0010(0x0008)(Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FVehicleInputRate                      SteeringInputRate;                                 // 0x0018(0x0008)(Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVehicleTemplateInputsSettings) == 0x000004, "Wrong alignment on FVehicleTemplateInputsSettings");
static_assert(sizeof(FVehicleTemplateInputsSettings) == 0x000020, "Wrong size on FVehicleTemplateInputsSettings");
static_assert(offsetof(FVehicleTemplateInputsSettings, ThrottleInputRate) == 0x000000, "Member 'FVehicleTemplateInputsSettings::ThrottleInputRate' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateInputsSettings, BrakeInputRate) == 0x000008, "Member 'FVehicleTemplateInputsSettings::BrakeInputRate' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateInputsSettings, HandbrakeInputRate) == 0x000010, "Member 'FVehicleTemplateInputsSettings::HandbrakeInputRate' has a wrong offset!");
static_assert(offsetof(FVehicleTemplateInputsSettings, SteeringInputRate) == 0x000018, "Member 'FVehicleTemplateInputsSettings::SteeringInputRate' has a wrong offset!");

// ScriptStruct SeasunVehicle.VehicleBlueprintParametersOverride
// 0x0110 (0x0110 - 0x0000)
struct FVehicleBlueprintParametersOverride final
{
public:
	struct FVehicleTemplateBlueprintContent       VehicleContent;                                    // 0x0000(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FVehicleTemplateModifySpd              VehicleModifySpd;                                  // 0x0028(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVehicleTemplateEngineSettings         EngineSettings;                                    // 0x0038(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FVehicleTemplateDiffMechanismSetting   DiffMechanismSetting;                              // 0x0078(0x001C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVehicleTemplateTransmissionData       TransmissionDataSettings;                          // 0x0098(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FVehicleTemplateInputsSettings         InputsSettings;                                    // 0x00C8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UCurveFloat>             SteeringCurve;                                     // 0x00E8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVehicleBlueprintParametersOverride) == 0x000008, "Wrong alignment on FVehicleBlueprintParametersOverride");
static_assert(sizeof(FVehicleBlueprintParametersOverride) == 0x000110, "Wrong size on FVehicleBlueprintParametersOverride");
static_assert(offsetof(FVehicleBlueprintParametersOverride, VehicleContent) == 0x000000, "Member 'FVehicleBlueprintParametersOverride::VehicleContent' has a wrong offset!");
static_assert(offsetof(FVehicleBlueprintParametersOverride, VehicleModifySpd) == 0x000028, "Member 'FVehicleBlueprintParametersOverride::VehicleModifySpd' has a wrong offset!");
static_assert(offsetof(FVehicleBlueprintParametersOverride, EngineSettings) == 0x000038, "Member 'FVehicleBlueprintParametersOverride::EngineSettings' has a wrong offset!");
static_assert(offsetof(FVehicleBlueprintParametersOverride, DiffMechanismSetting) == 0x000078, "Member 'FVehicleBlueprintParametersOverride::DiffMechanismSetting' has a wrong offset!");
static_assert(offsetof(FVehicleBlueprintParametersOverride, TransmissionDataSettings) == 0x000098, "Member 'FVehicleBlueprintParametersOverride::TransmissionDataSettings' has a wrong offset!");
static_assert(offsetof(FVehicleBlueprintParametersOverride, InputsSettings) == 0x0000C8, "Member 'FVehicleBlueprintParametersOverride::InputsSettings' has a wrong offset!");
static_assert(offsetof(FVehicleBlueprintParametersOverride, SteeringCurve) == 0x0000E8, "Member 'FVehicleBlueprintParametersOverride::SteeringCurve' has a wrong offset!");

// ScriptStruct SeasunVehicle.VehicleTemplate
// 0x0318 (0x0320 - 0x0008)
struct FVehicleTemplate final : public FTableRowBase
{
public:
	int32                                         ID;                                                // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Desc;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideByDataTable;                              // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETGameVehicleType                             VehicleType;                                       // 0x0021(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   VehicleBP;                                         // 0x0028(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   VehiclePreviewBP;                                  // 0x0050(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VehicleInteractionType;                            // 0x0078(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVehicleTemplateEffect                 VehicleTemplateEffect;                             // 0x0088(0x00A0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FVehicleTemplateSound                  VehicleTemplateSound;                              // 0x0128(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	EVehicleCameraType                            VehicleCameraType;                                 // 0x0168(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVehicleTemplateThirdPersonCamera      VehicleTemplateThirdPersonCamera;                  // 0x0170(0x0070)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FVehicleTemplateFirstPersonCamera      VehicleTemplateFirstPersonCamera;                  // 0x01E0(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FVehicleBlueprintParametersOverride    VehicleBlueprintParametersOverride;                // 0x0210(0x0110)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVehicleTemplate) == 0x000008, "Wrong alignment on FVehicleTemplate");
static_assert(sizeof(FVehicleTemplate) == 0x000320, "Wrong size on FVehicleTemplate");
static_assert(offsetof(FVehicleTemplate, ID) == 0x000008, "Member 'FVehicleTemplate::ID' has a wrong offset!");
static_assert(offsetof(FVehicleTemplate, Desc) == 0x000010, "Member 'FVehicleTemplate::Desc' has a wrong offset!");
static_assert(offsetof(FVehicleTemplate, bOverrideByDataTable) == 0x000020, "Member 'FVehicleTemplate::bOverrideByDataTable' has a wrong offset!");
static_assert(offsetof(FVehicleTemplate, VehicleType) == 0x000021, "Member 'FVehicleTemplate::VehicleType' has a wrong offset!");
static_assert(offsetof(FVehicleTemplate, VehicleBP) == 0x000028, "Member 'FVehicleTemplate::VehicleBP' has a wrong offset!");
static_assert(offsetof(FVehicleTemplate, VehiclePreviewBP) == 0x000050, "Member 'FVehicleTemplate::VehiclePreviewBP' has a wrong offset!");
static_assert(offsetof(FVehicleTemplate, VehicleInteractionType) == 0x000078, "Member 'FVehicleTemplate::VehicleInteractionType' has a wrong offset!");
static_assert(offsetof(FVehicleTemplate, VehicleTemplateEffect) == 0x000088, "Member 'FVehicleTemplate::VehicleTemplateEffect' has a wrong offset!");
static_assert(offsetof(FVehicleTemplate, VehicleTemplateSound) == 0x000128, "Member 'FVehicleTemplate::VehicleTemplateSound' has a wrong offset!");
static_assert(offsetof(FVehicleTemplate, VehicleCameraType) == 0x000168, "Member 'FVehicleTemplate::VehicleCameraType' has a wrong offset!");
static_assert(offsetof(FVehicleTemplate, VehicleTemplateThirdPersonCamera) == 0x000170, "Member 'FVehicleTemplate::VehicleTemplateThirdPersonCamera' has a wrong offset!");
static_assert(offsetof(FVehicleTemplate, VehicleTemplateFirstPersonCamera) == 0x0001E0, "Member 'FVehicleTemplate::VehicleTemplateFirstPersonCamera' has a wrong offset!");
static_assert(offsetof(FVehicleTemplate, VehicleBlueprintParametersOverride) == 0x000210, "Member 'FVehicleTemplate::VehicleBlueprintParametersOverride' has a wrong offset!");

// ScriptStruct SeasunVehicle.WheelShape
// 0x0030 (0x0030 - 0x0000)
struct FWheelShape final
{
public:
	TSoftObjectPtr<class UStaticMesh>             WheelMesh;                                         // 0x0000(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUsePhysicsAssetShape;                             // 0x0028(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoAdjustCollisionSize;                          // 0x0029(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FWheelShape) == 0x000008, "Wrong alignment on FWheelShape");
static_assert(sizeof(FWheelShape) == 0x000030, "Wrong size on FWheelShape");
static_assert(offsetof(FWheelShape, WheelMesh) == 0x000000, "Member 'FWheelShape::WheelMesh' has a wrong offset!");
static_assert(offsetof(FWheelShape, bUsePhysicsAssetShape) == 0x000028, "Member 'FWheelShape::bUsePhysicsAssetShape' has a wrong offset!");
static_assert(offsetof(FWheelShape, bAutoAdjustCollisionSize) == 0x000029, "Member 'FWheelShape::bAutoAdjustCollisionSize' has a wrong offset!");

// ScriptStruct SeasunVehicle.WheelSetting
// 0x0020 (0x0020 - 0x0000)
struct FWheelSetting final
{
public:
	struct FVector                                Offset;                                            // 0x0000(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShapeRadius;                                       // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShapeWidth;                                        // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mass;                                              // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DampingRate;                                       // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAffectedByHandBreak;                              // 0x001C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FWheelSetting) == 0x000004, "Wrong alignment on FWheelSetting");
static_assert(sizeof(FWheelSetting) == 0x000020, "Wrong size on FWheelSetting");
static_assert(offsetof(FWheelSetting, Offset) == 0x000000, "Member 'FWheelSetting::Offset' has a wrong offset!");
static_assert(offsetof(FWheelSetting, ShapeRadius) == 0x00000C, "Member 'FWheelSetting::ShapeRadius' has a wrong offset!");
static_assert(offsetof(FWheelSetting, ShapeWidth) == 0x000010, "Member 'FWheelSetting::ShapeWidth' has a wrong offset!");
static_assert(offsetof(FWheelSetting, Mass) == 0x000014, "Member 'FWheelSetting::Mass' has a wrong offset!");
static_assert(offsetof(FWheelSetting, DampingRate) == 0x000018, "Member 'FWheelSetting::DampingRate' has a wrong offset!");
static_assert(offsetof(FWheelSetting, bAffectedByHandBreak) == 0x00001C, "Member 'FWheelSetting::bAffectedByHandBreak' has a wrong offset!");

// ScriptStruct SeasunVehicle.WheelConfiguration
// 0x0038 (0x0038 - 0x0000)
struct FWheelConfiguration final
{
public:
	float                                         FrictionRange;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   PhysicalMaterial;                                  // 0x0008(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FrictionRangeOfPhysicalMaterial;                   // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FWheelConfiguration) == 0x000008, "Wrong alignment on FWheelConfiguration");
static_assert(sizeof(FWheelConfiguration) == 0x000038, "Wrong size on FWheelConfiguration");
static_assert(offsetof(FWheelConfiguration, FrictionRange) == 0x000000, "Member 'FWheelConfiguration::FrictionRange' has a wrong offset!");
static_assert(offsetof(FWheelConfiguration, PhysicalMaterial) == 0x000008, "Member 'FWheelConfiguration::PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(FWheelConfiguration, FrictionRangeOfPhysicalMaterial) == 0x000030, "Member 'FWheelConfiguration::FrictionRangeOfPhysicalMaterial' has a wrong offset!");

// ScriptStruct SeasunVehicle.Tire
// 0x0048 (0x0048 - 0x0000)
struct FTire final
{
public:
	struct FWheelConfiguration                    WheelConfiguration;                                // 0x0000(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	float                                         LatStiffMaxLoad;                                   // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LatStiffValue;                                     // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LongStiffValue;                                    // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTire) == 0x000008, "Wrong alignment on FTire");
static_assert(sizeof(FTire) == 0x000048, "Wrong size on FTire");
static_assert(offsetof(FTire, WheelConfiguration) == 0x000000, "Member 'FTire::WheelConfiguration' has a wrong offset!");
static_assert(offsetof(FTire, LatStiffMaxLoad) == 0x000038, "Member 'FTire::LatStiffMaxLoad' has a wrong offset!");
static_assert(offsetof(FTire, LatStiffValue) == 0x00003C, "Member 'FTire::LatStiffValue' has a wrong offset!");
static_assert(offsetof(FTire, LongStiffValue) == 0x000040, "Member 'FTire::LongStiffValue' has a wrong offset!");

// ScriptStruct SeasunVehicle.VehicleSuspension
// 0x0018 (0x0018 - 0x0000)
struct FVehicleSuspension final
{
public:
	float                                         SuspensionForceOffset;                             // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SuspensionMaxRaise;                                // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SuspensionMaxDrop;                                 // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SuspensionNaturalFrequency;                        // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SuspensionDampingRatio;                            // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWheelSweepType                               SweepType;                                         // 0x0014(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVehicleSuspension) == 0x000004, "Wrong alignment on FVehicleSuspension");
static_assert(sizeof(FVehicleSuspension) == 0x000018, "Wrong size on FVehicleSuspension");
static_assert(offsetof(FVehicleSuspension, SuspensionForceOffset) == 0x000000, "Member 'FVehicleSuspension::SuspensionForceOffset' has a wrong offset!");
static_assert(offsetof(FVehicleSuspension, SuspensionMaxRaise) == 0x000004, "Member 'FVehicleSuspension::SuspensionMaxRaise' has a wrong offset!");
static_assert(offsetof(FVehicleSuspension, SuspensionMaxDrop) == 0x000008, "Member 'FVehicleSuspension::SuspensionMaxDrop' has a wrong offset!");
static_assert(offsetof(FVehicleSuspension, SuspensionNaturalFrequency) == 0x00000C, "Member 'FVehicleSuspension::SuspensionNaturalFrequency' has a wrong offset!");
static_assert(offsetof(FVehicleSuspension, SuspensionDampingRatio) == 0x000010, "Member 'FVehicleSuspension::SuspensionDampingRatio' has a wrong offset!");
static_assert(offsetof(FVehicleSuspension, SweepType) == 0x000014, "Member 'FVehicleSuspension::SweepType' has a wrong offset!");

// ScriptStruct SeasunVehicle.VehicleBreak
// 0x0008 (0x0008 - 0x0000)
struct FVehicleBreak final
{
public:
	float                                         MaxBreakTorque;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxHandBreakTorque;                                // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVehicleBreak) == 0x000004, "Wrong alignment on FVehicleBreak");
static_assert(sizeof(FVehicleBreak) == 0x000008, "Wrong size on FVehicleBreak");
static_assert(offsetof(FVehicleBreak, MaxBreakTorque) == 0x000000, "Member 'FVehicleBreak::MaxBreakTorque' has a wrong offset!");
static_assert(offsetof(FVehicleBreak, MaxHandBreakTorque) == 0x000004, "Member 'FVehicleBreak::MaxHandBreakTorque' has a wrong offset!");

// ScriptStruct SeasunVehicle.WheelBlueprintParametersOverride
// 0x00C0 (0x00C0 - 0x0000)
struct FWheelBlueprintParametersOverride final
{
public:
	struct FWheelShape                            WheelShape;                                        // 0x0000(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FWheelSetting                          WheelSetting;                                      // 0x0030(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bSteerAtMaxAngle;                                  // 0x0050(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTire                                  Tire;                                              // 0x0058(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
