#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SeasunAccount

#include "Basic.hpp"

#include "SeasunAccount_structs.hpp"
#include "GameCore_structs.hpp"


namespace SDK::Params
{

// Function SeasunAccount.Account.ClearOthers
// 0x0004 (0x0004 - 0x0000)
struct Account_ClearOthers final
{
public:
	int32                                         LocalAccountId;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_ClearOthers) == 0x000004, "Wrong alignment on Account_ClearOthers");
static_assert(sizeof(Account_ClearOthers) == 0x000004, "Wrong size on Account_ClearOthers");
static_assert(offsetof(Account_ClearOthers, LocalAccountId) == 0x000000, "Member 'Account_ClearOthers::LocalAccountId' has a wrong offset!");

// Function SeasunAccount.Account.CloneCustomWeaponItem
// 0x0028 (0x0028 - 0x0000)
struct Account_CloneCustomWeaponItem final
{
public:
	class UWeaponItem*                            InItem;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewGrowupID;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewAppearID;                                       // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InLevel;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InBreak;                                           // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InEvolve;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponItem*                            ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_CloneCustomWeaponItem) == 0x000008, "Wrong alignment on Account_CloneCustomWeaponItem");
static_assert(sizeof(Account_CloneCustomWeaponItem) == 0x000028, "Wrong size on Account_CloneCustomWeaponItem");
static_assert(offsetof(Account_CloneCustomWeaponItem, InItem) == 0x000000, "Member 'Account_CloneCustomWeaponItem::InItem' has a wrong offset!");
static_assert(offsetof(Account_CloneCustomWeaponItem, NewGrowupID) == 0x000008, "Member 'Account_CloneCustomWeaponItem::NewGrowupID' has a wrong offset!");
static_assert(offsetof(Account_CloneCustomWeaponItem, NewAppearID) == 0x00000C, "Member 'Account_CloneCustomWeaponItem::NewAppearID' has a wrong offset!");
static_assert(offsetof(Account_CloneCustomWeaponItem, InLevel) == 0x000010, "Member 'Account_CloneCustomWeaponItem::InLevel' has a wrong offset!");
static_assert(offsetof(Account_CloneCustomWeaponItem, InBreak) == 0x000014, "Member 'Account_CloneCustomWeaponItem::InBreak' has a wrong offset!");
static_assert(offsetof(Account_CloneCustomWeaponItem, InEvolve) == 0x000018, "Member 'Account_CloneCustomWeaponItem::InEvolve' has a wrong offset!");
static_assert(offsetof(Account_CloneCustomWeaponItem, ReturnValue) == 0x000020, "Member 'Account_CloneCustomWeaponItem::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.CloneWeaponItem
// 0x0018 (0x0018 - 0x0000)
struct Account_CloneWeaponItem final
{
public:
	class UWeaponItem*                            InItem;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewGrowupID;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewAppearID;                                       // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWeaponItem*                            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_CloneWeaponItem) == 0x000008, "Wrong alignment on Account_CloneWeaponItem");
static_assert(sizeof(Account_CloneWeaponItem) == 0x000018, "Wrong size on Account_CloneWeaponItem");
static_assert(offsetof(Account_CloneWeaponItem, InItem) == 0x000000, "Member 'Account_CloneWeaponItem::InItem' has a wrong offset!");
static_assert(offsetof(Account_CloneWeaponItem, NewGrowupID) == 0x000008, "Member 'Account_CloneWeaponItem::NewGrowupID' has a wrong offset!");
static_assert(offsetof(Account_CloneWeaponItem, NewAppearID) == 0x00000C, "Member 'Account_CloneWeaponItem::NewAppearID' has a wrong offset!");
static_assert(offsetof(Account_CloneWeaponItem, ReturnValue) == 0x000010, "Member 'Account_CloneWeaponItem::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.Find
// 0x0010 (0x0010 - 0x0000)
struct Account_Find final
{
public:
	int32                                         LocalAccountId;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCheck;                                            // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccount*                               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_Find) == 0x000008, "Wrong alignment on Account_Find");
static_assert(sizeof(Account_Find) == 0x000010, "Wrong size on Account_Find");
static_assert(offsetof(Account_Find, LocalAccountId) == 0x000000, "Member 'Account_Find::LocalAccountId' has a wrong offset!");
static_assert(offsetof(Account_Find, bCheck) == 0x000004, "Member 'Account_Find::bCheck' has a wrong offset!");
static_assert(offsetof(Account_Find, ReturnValue) == 0x000008, "Member 'Account_Find::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.FindByPID
// 0x0010 (0x0010 - 0x0000)
struct Account_FindByPID final
{
public:
	int64                                         InPID;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAccount*                               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_FindByPID) == 0x000008, "Wrong alignment on Account_FindByPID");
static_assert(sizeof(Account_FindByPID) == 0x000010, "Wrong size on Account_FindByPID");
static_assert(offsetof(Account_FindByPID, InPID) == 0x000000, "Member 'Account_FindByPID::InPID' has a wrong offset!");
static_assert(offsetof(Account_FindByPID, ReturnValue) == 0x000008, "Member 'Account_FindByPID::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.Get
// 0x0010 (0x0010 - 0x0000)
struct Account_Get final
{
public:
	int32                                         LocalAccountId;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccount*                               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_Get) == 0x000008, "Wrong alignment on Account_Get");
static_assert(sizeof(Account_Get) == 0x000010, "Wrong size on Account_Get");
static_assert(offsetof(Account_Get, LocalAccountId) == 0x000000, "Member 'Account_Get::LocalAccountId' has a wrong offset!");
static_assert(offsetof(Account_Get, ReturnValue) == 0x000008, "Member 'Account_Get::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.GetAccountInfo
// 0x0020 (0x0020 - 0x0000)
struct Account_GetAccountInfo final
{
public:
	class FString                                 InProvider;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InToken;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_GetAccountInfo) == 0x000008, "Wrong alignment on Account_GetAccountInfo");
static_assert(sizeof(Account_GetAccountInfo) == 0x000020, "Wrong size on Account_GetAccountInfo");
static_assert(offsetof(Account_GetAccountInfo, InProvider) == 0x000000, "Member 'Account_GetAccountInfo::InProvider' has a wrong offset!");
static_assert(offsetof(Account_GetAccountInfo, InToken) == 0x000010, "Member 'Account_GetAccountInfo::InToken' has a wrong offset!");

// Function SeasunAccount.Account.GetOnlineMember
// 0x0010 (0x0010 - 0x0000)
struct Account_GetOnlineMember final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccount*                               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_GetOnlineMember) == 0x000008, "Wrong alignment on Account_GetOnlineMember");
static_assert(sizeof(Account_GetOnlineMember) == 0x000010, "Wrong size on Account_GetOnlineMember");
static_assert(offsetof(Account_GetOnlineMember, InIndex) == 0x000000, "Member 'Account_GetOnlineMember::InIndex' has a wrong offset!");
static_assert(offsetof(Account_GetOnlineMember, ReturnValue) == 0x000008, "Member 'Account_GetOnlineMember::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.GetOnlineTeamMemberCount
// 0x0004 (0x0004 - 0x0000)
struct Account_GetOnlineTeamMemberCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_GetOnlineTeamMemberCount) == 0x000004, "Wrong alignment on Account_GetOnlineTeamMemberCount");
static_assert(sizeof(Account_GetOnlineTeamMemberCount) == 0x000004, "Wrong size on Account_GetOnlineTeamMemberCount");
static_assert(offsetof(Account_GetOnlineTeamMemberCount, ReturnValue) == 0x000000, "Member 'Account_GetOnlineTeamMemberCount::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.SetDisableDebugWarning
// 0x0001 (0x0001 - 0x0000)
struct Account_SetDisableDebugWarning final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_SetDisableDebugWarning) == 0x000001, "Wrong alignment on Account_SetDisableDebugWarning");
static_assert(sizeof(Account_SetDisableDebugWarning) == 0x000001, "Wrong size on Account_SetDisableDebugWarning");
static_assert(offsetof(Account_SetDisableDebugWarning, Value) == 0x000000, "Member 'Account_SetDisableDebugWarning::Value' has a wrong offset!");

// Function SeasunAccount.Account.AccountId
// 0x0010 (0x0010 - 0x0000)
struct Account_AccountId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_AccountId) == 0x000008, "Wrong alignment on Account_AccountId");
static_assert(sizeof(Account_AccountId) == 0x000010, "Wrong size on Account_AccountId");
static_assert(offsetof(Account_AccountId, ReturnValue) == 0x000000, "Member 'Account_AccountId::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.AddBlacklist
// 0x0008 (0x0008 - 0x0000)
struct Account_AddBlacklist final
{
public:
	int64                                         PID;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_AddBlacklist) == 0x000008, "Wrong alignment on Account_AddBlacklist");
static_assert(sizeof(Account_AddBlacklist) == 0x000008, "Wrong size on Account_AddBlacklist");
static_assert(offsetof(Account_AddBlacklist, PID) == 0x000000, "Member 'Account_AddBlacklist::PID' has a wrong offset!");

// Function SeasunAccount.Account.AddCustomTeam
// 0x0018 (0x0018 - 0x0000)
struct Account_AddCustomTeam final
{
public:
	class FString                                 InTeamStr;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Account_AddCustomTeam) == 0x000008, "Wrong alignment on Account_AddCustomTeam");
static_assert(sizeof(Account_AddCustomTeam) == 0x000018, "Wrong size on Account_AddCustomTeam");
static_assert(offsetof(Account_AddCustomTeam, InTeamStr) == 0x000000, "Member 'Account_AddCustomTeam::InTeamStr' has a wrong offset!");
static_assert(offsetof(Account_AddCustomTeam, ReturnValue) == 0x000010, "Member 'Account_AddCustomTeam::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.AllFriendPieces
// 0x0010 (0x0010 - 0x0000)
struct Account_AllFriendPieces final
{
public:
	TArray<struct FFriendPieces>                  OutList;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_AllFriendPieces) == 0x000008, "Wrong alignment on Account_AllFriendPieces");
static_assert(sizeof(Account_AllFriendPieces) == 0x000010, "Wrong size on Account_AllFriendPieces");
static_assert(offsetof(Account_AllFriendPieces, OutList) == 0x000000, "Member 'Account_AllFriendPieces::OutList' has a wrong offset!");

// Function SeasunAccount.Account.Badges
// 0x0010 (0x0010 - 0x0000)
struct Account_Badges final
{
public:
	TArray<class UItem*>                          OutItems;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_Badges) == 0x000008, "Wrong alignment on Account_Badges");
static_assert(sizeof(Account_Badges) == 0x000010, "Wrong size on Account_Badges");
static_assert(offsetof(Account_Badges, OutItems) == 0x000000, "Member 'Account_Badges::OutItems' has a wrong offset!");

// Function SeasunAccount.Account.BuildTrialCharacters
// 0x0010 (0x0010 - 0x0000)
struct Account_BuildTrialCharacters final
{
public:
	int32                                         LocalAccountId;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         InItemId;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_BuildTrialCharacters) == 0x000008, "Wrong alignment on Account_BuildTrialCharacters");
static_assert(sizeof(Account_BuildTrialCharacters) == 0x000010, "Wrong size on Account_BuildTrialCharacters");
static_assert(offsetof(Account_BuildTrialCharacters, LocalAccountId) == 0x000000, "Member 'Account_BuildTrialCharacters::LocalAccountId' has a wrong offset!");
static_assert(offsetof(Account_BuildTrialCharacters, InItemId) == 0x000008, "Member 'Account_BuildTrialCharacters::InItemId' has a wrong offset!");

// Function SeasunAccount.Account.CallGS
// 0x0020 (0x0020 - 0x0000)
struct Account_CallGS final
{
public:
	class FString                                 InCommand;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InJSON;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_CallGS) == 0x000008, "Wrong alignment on Account_CallGS");
static_assert(sizeof(Account_CallGS) == 0x000020, "Wrong size on Account_CallGS");
static_assert(offsetof(Account_CallGS, InCommand) == 0x000000, "Member 'Account_CallGS::InCommand' has a wrong offset!");
static_assert(offsetof(Account_CallGS, InJSON) == 0x000010, "Member 'Account_CallGS::InJSON' has a wrong offset!");

// Function SeasunAccount.Account.ChangeWorldChannel
// 0x0004 (0x0004 - 0x0000)
struct Account_ChangeWorldChannel final
{
public:
	int32                                         InChannelID;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_ChangeWorldChannel) == 0x000004, "Wrong alignment on Account_ChangeWorldChannel");
static_assert(sizeof(Account_ChangeWorldChannel) == 0x000004, "Wrong size on Account_ChangeWorldChannel");
static_assert(offsetof(Account_ChangeWorldChannel, InChannelID) == 0x000000, "Member 'Account_ChangeWorldChannel::InChannelID' has a wrong offset!");

// Function SeasunAccount.Account.Channel
// 0x0010 (0x0010 - 0x0000)
struct Account_Channel final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_Channel) == 0x000008, "Wrong alignment on Account_Channel");
static_assert(sizeof(Account_Channel) == 0x000010, "Wrong size on Account_Channel");
static_assert(offsetof(Account_Channel, ReturnValue) == 0x000000, "Member 'Account_Channel::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.Charged
// 0x0004 (0x0004 - 0x0000)
struct Account_Charged final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_Charged) == 0x000004, "Wrong alignment on Account_Charged");
static_assert(sizeof(Account_Charged) == 0x000004, "Wrong size on Account_Charged");
static_assert(offsetof(Account_Charged, ReturnValue) == 0x000000, "Member 'Account_Charged::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.Connect
// 0x0018 (0x0018 - 0x0000)
struct Account_Connect final
{
public:
	class FString                                 InAddr;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPort;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Account_Connect) == 0x000008, "Wrong alignment on Account_Connect");
static_assert(sizeof(Account_Connect) == 0x000018, "Wrong size on Account_Connect");
static_assert(offsetof(Account_Connect, InAddr) == 0x000000, "Member 'Account_Connect::InAddr' has a wrong offset!");
static_assert(offsetof(Account_Connect, InPort) == 0x000010, "Member 'Account_Connect::InPort' has a wrong offset!");

// Function SeasunAccount.Account.CreateItem
// 0x0028 (0x0028 - 0x0000)
struct Account_CreateItem final
{
public:
	int32                                         G;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         D;                                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         P;                                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         L;                                                 // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InLevel;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAdd;                                              // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InSkinId;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsTrial;                                           // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UItem*                                  ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_CreateItem) == 0x000008, "Wrong alignment on Account_CreateItem");
static_assert(sizeof(Account_CreateItem) == 0x000028, "Wrong size on Account_CreateItem");
static_assert(offsetof(Account_CreateItem, G) == 0x000000, "Member 'Account_CreateItem::G' has a wrong offset!");
static_assert(offsetof(Account_CreateItem, D) == 0x000004, "Member 'Account_CreateItem::D' has a wrong offset!");
static_assert(offsetof(Account_CreateItem, P) == 0x000008, "Member 'Account_CreateItem::P' has a wrong offset!");
static_assert(offsetof(Account_CreateItem, L) == 0x00000C, "Member 'Account_CreateItem::L' has a wrong offset!");
static_assert(offsetof(Account_CreateItem, InLevel) == 0x000010, "Member 'Account_CreateItem::InLevel' has a wrong offset!");
static_assert(offsetof(Account_CreateItem, bAdd) == 0x000014, "Member 'Account_CreateItem::bAdd' has a wrong offset!");
static_assert(offsetof(Account_CreateItem, InSkinId) == 0x000018, "Member 'Account_CreateItem::InSkinId' has a wrong offset!");
static_assert(offsetof(Account_CreateItem, IsTrial) == 0x00001C, "Member 'Account_CreateItem::IsTrial' has a wrong offset!");
static_assert(offsetof(Account_CreateItem, ReturnValue) == 0x000020, "Member 'Account_CreateItem::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.CreateTime
// 0x0008 (0x0008 - 0x0000)
struct Account_CreateTime final
{
public:
	int64                                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_CreateTime) == 0x000008, "Wrong alignment on Account_CreateTime");
static_assert(sizeof(Account_CreateTime) == 0x000008, "Wrong size on Account_CreateTime");
static_assert(offsetof(Account_CreateTime, ReturnValue) == 0x000000, "Member 'Account_CreateTime::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.CreateTrainLineup
// 0x0018 (0x0018 - 0x0000)
struct Account_CreateTrainLineup final
{
public:
	int32                                         InLineupIndex;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int64>                                 InMems;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_CreateTrainLineup) == 0x000008, "Wrong alignment on Account_CreateTrainLineup");
static_assert(sizeof(Account_CreateTrainLineup) == 0x000018, "Wrong size on Account_CreateTrainLineup");
static_assert(offsetof(Account_CreateTrainLineup, InLineupIndex) == 0x000000, "Member 'Account_CreateTrainLineup::InLineupIndex' has a wrong offset!");
static_assert(offsetof(Account_CreateTrainLineup, InMems) == 0x000008, "Member 'Account_CreateTrainLineup::InMems' has a wrong offset!");

// Function SeasunAccount.Account.DealFriendRequest
// 0x0010 (0x0010 - 0x0000)
struct Account_DealFriendRequest final
{
public:
	int64                                         Friend;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Agree;                                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Account_DealFriendRequest) == 0x000008, "Wrong alignment on Account_DealFriendRequest");
static_assert(sizeof(Account_DealFriendRequest) == 0x000010, "Wrong size on Account_DealFriendRequest");
static_assert(offsetof(Account_DealFriendRequest, Friend) == 0x000000, "Member 'Account_DealFriendRequest::Friend' has a wrong offset!");
static_assert(offsetof(Account_DealFriendRequest, Agree) == 0x000008, "Member 'Account_DealFriendRequest::Agree' has a wrong offset!");

// Function SeasunAccount.Account.DebugCreateItem
// 0x0138 (0x0138 - 0x0000)
struct Account_DebugCreateItem final
{
public:
	struct FItemTemplate                          InTempate;                                         // 0x0000(0x0130)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UItem*                                  ReturnValue;                                       // 0x0130(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_DebugCreateItem) == 0x000008, "Wrong alignment on Account_DebugCreateItem");
static_assert(sizeof(Account_DebugCreateItem) == 0x000138, "Wrong size on Account_DebugCreateItem");
static_assert(offsetof(Account_DebugCreateItem, InTempate) == 0x000000, "Member 'Account_DebugCreateItem::InTempate' has a wrong offset!");
static_assert(offsetof(Account_DebugCreateItem, ReturnValue) == 0x000130, "Member 'Account_DebugCreateItem::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.DelMail
// 0x0008 (0x0008 - 0x0000)
struct Account_DelMail final
{
public:
	int64                                         InMailIndex;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_DelMail) == 0x000008, "Wrong alignment on Account_DelMail");
static_assert(sizeof(Account_DelMail) == 0x000008, "Wrong size on Account_DelMail");
static_assert(offsetof(Account_DelMail, InMailIndex) == 0x000000, "Member 'Account_DelMail::InMailIndex' has a wrong offset!");

// Function SeasunAccount.Account.Exp
// 0x0004 (0x0004 - 0x0000)
struct Account_Exp final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_Exp) == 0x000004, "Wrong alignment on Account_Exp");
static_assert(sizeof(Account_Exp) == 0x000004, "Wrong size on Account_Exp");
static_assert(offsetof(Account_Exp, ReturnValue) == 0x000000, "Member 'Account_Exp::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.FindBlacklist
// 0x0010 (0x0010 - 0x0000)
struct Account_FindBlacklist final
{
public:
	int64                                         PID;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayerProfile*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_FindBlacklist) == 0x000008, "Wrong alignment on Account_FindBlacklist");
static_assert(sizeof(Account_FindBlacklist) == 0x000010, "Wrong size on Account_FindBlacklist");
static_assert(offsetof(Account_FindBlacklist, PID) == 0x000000, "Member 'Account_FindBlacklist::PID' has a wrong offset!");
static_assert(offsetof(Account_FindBlacklist, ReturnValue) == 0x000008, "Member 'Account_FindBlacklist::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.FindPlayer
// 0x0008 (0x0008 - 0x0000)
struct Account_FindPlayer final
{
public:
	int64                                         PID;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_FindPlayer) == 0x000008, "Wrong alignment on Account_FindPlayer");
static_assert(sizeof(Account_FindPlayer) == 0x000008, "Wrong size on Account_FindPlayer");
static_assert(offsetof(Account_FindPlayer, PID) == 0x000000, "Member 'Account_FindPlayer::PID' has a wrong offset!");

// Function SeasunAccount.Account.FriendCount
// 0x0004 (0x0004 - 0x0000)
struct Account_FriendCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_FriendCount) == 0x000004, "Wrong alignment on Account_FriendCount");
static_assert(sizeof(Account_FriendCount) == 0x000004, "Wrong size on Account_FriendCount");
static_assert(offsetof(Account_FriendCount, ReturnValue) == 0x000000, "Member 'Account_FriendCount::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.FriendsCount
// 0x0004 (0x0004 - 0x0000)
struct Account_FriendsCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_FriendsCount) == 0x000004, "Wrong alignment on Account_FriendsCount");
static_assert(sizeof(Account_FriendsCount) == 0x000004, "Wrong size on Account_FriendsCount");
static_assert(offsetof(Account_FriendsCount, ReturnValue) == 0x000000, "Member 'Account_FriendsCount::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.GetAllMoneyList
// 0x0010 (0x0010 - 0x0000)
struct Account_GetAllMoneyList final
{
public:
	TArray<class FString>                         InList;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_GetAllMoneyList) == 0x000008, "Wrong alignment on Account_GetAllMoneyList");
static_assert(sizeof(Account_GetAllMoneyList) == 0x000010, "Wrong size on Account_GetAllMoneyList");
static_assert(offsetof(Account_GetAllMoneyList, InList) == 0x000000, "Member 'Account_GetAllMoneyList::InList' has a wrong offset!");

// Function SeasunAccount.Account.GetAreaID
// 0x0004 (0x0004 - 0x0000)
struct Account_GetAreaID final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_GetAreaID) == 0x000004, "Wrong alignment on Account_GetAreaID");
static_assert(sizeof(Account_GetAreaID) == 0x000004, "Wrong size on Account_GetAreaID");
static_assert(offsetof(Account_GetAreaID, ReturnValue) == 0x000000, "Member 'Account_GetAreaID::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.GetAttribute
// 0x0018 (0x0018 - 0x0000)
struct Account_GetAttribute final
{
public:
	int64                                         InGroup;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         InSubId;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_GetAttribute) == 0x000008, "Wrong alignment on Account_GetAttribute");
static_assert(sizeof(Account_GetAttribute) == 0x000018, "Wrong size on Account_GetAttribute");
static_assert(offsetof(Account_GetAttribute, InGroup) == 0x000000, "Member 'Account_GetAttribute::InGroup' has a wrong offset!");
static_assert(offsetof(Account_GetAttribute, InSubId) == 0x000008, "Member 'Account_GetAttribute::InSubId' has a wrong offset!");
static_assert(offsetof(Account_GetAttribute, ReturnValue) == 0x000010, "Member 'Account_GetAttribute::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.GetAttributeSigned
// 0x0018 (0x0018 - 0x0000)
struct Account_GetAttributeSigned final
{
public:
	int64                                         InGroup;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         InSubId;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_GetAttributeSigned) == 0x000008, "Wrong alignment on Account_GetAttributeSigned");
static_assert(sizeof(Account_GetAttributeSigned) == 0x000018, "Wrong size on Account_GetAttributeSigned");
static_assert(offsetof(Account_GetAttributeSigned, InGroup) == 0x000000, "Member 'Account_GetAttributeSigned::InGroup' has a wrong offset!");
static_assert(offsetof(Account_GetAttributeSigned, InSubId) == 0x000008, "Member 'Account_GetAttributeSigned::InSubId' has a wrong offset!");
static_assert(offsetof(Account_GetAttributeSigned, ReturnValue) == 0x000010, "Member 'Account_GetAttributeSigned::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.GetBlacklist
// 0x0010 (0x0010 - 0x0000)
struct Account_GetBlacklist final
{
public:
	TArray<class UPlayerProfile*>                 OutList;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_GetBlacklist) == 0x000008, "Wrong alignment on Account_GetBlacklist");
static_assert(sizeof(Account_GetBlacklist) == 0x000010, "Wrong size on Account_GetBlacklist");
static_assert(offsetof(Account_GetBlacklist, OutList) == 0x000000, "Member 'Account_GetBlacklist::OutList' has a wrong offset!");

// Function SeasunAccount.Account.GetCharacterCard
// 0x0010 (0x0010 - 0x0000)
struct Account_GetCharacterCard final
{
public:
	int64                                         ID_0;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCharacterCard*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_GetCharacterCard) == 0x000008, "Wrong alignment on Account_GetCharacterCard");
static_assert(sizeof(Account_GetCharacterCard) == 0x000010, "Wrong size on Account_GetCharacterCard");
static_assert(offsetof(Account_GetCharacterCard, ID_0) == 0x000000, "Member 'Account_GetCharacterCard::ID_0' has a wrong offset!");
static_assert(offsetof(Account_GetCharacterCard, ReturnValue) == 0x000008, "Member 'Account_GetCharacterCard::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.GetCharacterCards
// 0x0018 (0x0018 - 0x0000)
struct Account_GetCharacterCards final
{
public:
	TArray<class UCharacterCard*>                 OutItems;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          InContainTrial;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Account_GetCharacterCards) == 0x000008, "Wrong alignment on Account_GetCharacterCards");
static_assert(sizeof(Account_GetCharacterCards) == 0x000018, "Wrong size on Account_GetCharacterCards");
static_assert(offsetof(Account_GetCharacterCards, OutItems) == 0x000000, "Member 'Account_GetCharacterCards::OutItems' has a wrong offset!");
static_assert(offsetof(Account_GetCharacterCards, InContainTrial) == 0x000010, "Member 'Account_GetCharacterCards::InContainTrial' has a wrong offset!");

// Function SeasunAccount.Account.GetCharacterSkins
// 0x0018 (0x0018 - 0x0000)
struct Account_GetCharacterSkins final
{
public:
	TArray<class UItem*>                          OutItems;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          InContainTrial;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Account_GetCharacterSkins) == 0x000008, "Wrong alignment on Account_GetCharacterSkins");
static_assert(sizeof(Account_GetCharacterSkins) == 0x000018, "Wrong size on Account_GetCharacterSkins");
static_assert(offsetof(Account_GetCharacterSkins, OutItems) == 0x000000, "Member 'Account_GetCharacterSkins::OutItems' has a wrong offset!");
static_assert(offsetof(Account_GetCharacterSkins, InContainTrial) == 0x000010, "Member 'Account_GetCharacterSkins::InContainTrial' has a wrong offset!");

// Function SeasunAccount.Account.GetCustomRoster
// 0x0020 (0x0020 - 0x0000)
struct Account_GetCustomRoster final
{
public:
	class FString                                 InKey;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_GetCustomRoster) == 0x000008, "Wrong alignment on Account_GetCustomRoster");
static_assert(sizeof(Account_GetCustomRoster) == 0x000020, "Wrong size on Account_GetCustomRoster");
static_assert(offsetof(Account_GetCustomRoster, InKey) == 0x000000, "Member 'Account_GetCustomRoster::InKey' has a wrong offset!");
static_assert(offsetof(Account_GetCustomRoster, ReturnValue) == 0x000010, "Member 'Account_GetCustomRoster::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.GetCustomRosterList
// 0x0010 (0x0010 - 0x0000)
struct Account_GetCustomRosterList final
{
public:
	TArray<class FString>                         OutList;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_GetCustomRosterList) == 0x000008, "Wrong alignment on Account_GetCustomRosterList");
static_assert(sizeof(Account_GetCustomRosterList) == 0x000010, "Wrong size on Account_GetCustomRosterList");
static_assert(offsetof(Account_GetCustomRosterList, OutList) == 0x000000, "Member 'Account_GetCustomRosterList::OutList' has a wrong offset!");

// Function SeasunAccount.Account.GetDefaultItem
// 0x0020 (0x0020 - 0x0000)
struct Account_GetDefaultItem final
{
public:
	int32                                         G;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         D;                                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         P;                                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         L;                                                 // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         N;                                                 // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItem*                                  ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_GetDefaultItem) == 0x000008, "Wrong alignment on Account_GetDefaultItem");
static_assert(sizeof(Account_GetDefaultItem) == 0x000020, "Wrong size on Account_GetDefaultItem");
static_assert(offsetof(Account_GetDefaultItem, G) == 0x000000, "Member 'Account_GetDefaultItem::G' has a wrong offset!");
static_assert(offsetof(Account_GetDefaultItem, D) == 0x000004, "Member 'Account_GetDefaultItem::D' has a wrong offset!");
static_assert(offsetof(Account_GetDefaultItem, P) == 0x000008, "Member 'Account_GetDefaultItem::P' has a wrong offset!");
static_assert(offsetof(Account_GetDefaultItem, L) == 0x00000C, "Member 'Account_GetDefaultItem::L' has a wrong offset!");
static_assert(offsetof(Account_GetDefaultItem, N) == 0x000010, "Member 'Account_GetDefaultItem::N' has a wrong offset!");
static_assert(offsetof(Account_GetDefaultItem, ReturnValue) == 0x000018, "Member 'Account_GetDefaultItem::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.GetDefaultItemByTemplateID
// 0x0018 (0x0018 - 0x0000)
struct Account_GetDefaultItemByTemplateID final
{
public:
	int64                                         InTemplateID;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         N;                                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItem*                                  ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_GetDefaultItemByTemplateID) == 0x000008, "Wrong alignment on Account_GetDefaultItemByTemplateID");
static_assert(sizeof(Account_GetDefaultItemByTemplateID) == 0x000018, "Wrong size on Account_GetDefaultItemByTemplateID");
static_assert(offsetof(Account_GetDefaultItemByTemplateID, InTemplateID) == 0x000000, "Member 'Account_GetDefaultItemByTemplateID::InTemplateID' has a wrong offset!");
static_assert(offsetof(Account_GetDefaultItemByTemplateID, N) == 0x000008, "Member 'Account_GetDefaultItemByTemplateID::N' has a wrong offset!");
static_assert(offsetof(Account_GetDefaultItemByTemplateID, ReturnValue) == 0x000010, "Member 'Account_GetDefaultItemByTemplateID::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.GetFriend
// 0x0010 (0x0010 - 0x0000)
struct Account_GetFriend final
{
public:
	int64                                         PID;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayerProfile*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_GetFriend) == 0x000008, "Wrong alignment on Account_GetFriend");
static_assert(sizeof(Account_GetFriend) == 0x000010, "Wrong size on Account_GetFriend");
static_assert(offsetof(Account_GetFriend, PID) == 0x000000, "Member 'Account_GetFriend::PID' has a wrong offset!");
static_assert(offsetof(Account_GetFriend, ReturnValue) == 0x000008, "Member 'Account_GetFriend::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.GetFriendPieces
// 0x0020 (0x0020 - 0x0000)
struct Account_GetFriendPieces final
{
public:
	int64                                         Index_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFriendPieces                          ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_GetFriendPieces) == 0x000008, "Wrong alignment on Account_GetFriendPieces");
static_assert(sizeof(Account_GetFriendPieces) == 0x000020, "Wrong size on Account_GetFriendPieces");
static_assert(offsetof(Account_GetFriendPieces, Index_0) == 0x000000, "Member 'Account_GetFriendPieces::Index_0' has a wrong offset!");
static_assert(offsetof(Account_GetFriendPieces, ReturnValue) == 0x000008, "Member 'Account_GetFriendPieces::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.GetFriendRequest
// 0x0010 (0x0010 - 0x0000)
struct Account_GetFriendRequest final
{
public:
	int64                                         Friend;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayerProfile*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_GetFriendRequest) == 0x000008, "Wrong alignment on Account_GetFriendRequest");
static_assert(sizeof(Account_GetFriendRequest) == 0x000010, "Wrong size on Account_GetFriendRequest");
static_assert(offsetof(Account_GetFriendRequest, Friend) == 0x000000, "Member 'Account_GetFriendRequest::Friend' has a wrong offset!");
static_assert(offsetof(Account_GetFriendRequest, ReturnValue) == 0x000008, "Member 'Account_GetFriendRequest::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.GetFriendRequests
// 0x0010 (0x0010 - 0x0000)
struct Account_GetFriendRequests final
{
public:
	TArray<class UPlayerProfile*>                 OutList;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_GetFriendRequests) == 0x000008, "Wrong alignment on Account_GetFriendRequests");
static_assert(sizeof(Account_GetFriendRequests) == 0x000010, "Wrong size on Account_GetFriendRequests");
static_assert(offsetof(Account_GetFriendRequests, OutList) == 0x000000, "Member 'Account_GetFriendRequests::OutList' has a wrong offset!");

// Function SeasunAccount.Account.GetFriends
// 0x0010 (0x0010 - 0x0000)
struct Account_GetFriends final
{
public:
	TArray<class UPlayerProfile*>                 OutFriends;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_GetFriends) == 0x000008, "Wrong alignment on Account_GetFriends");
static_assert(sizeof(Account_GetFriends) == 0x000010, "Wrong size on Account_GetFriends");
static_assert(offsetof(Account_GetFriends, OutFriends) == 0x000000, "Member 'Account_GetFriends::OutFriends' has a wrong offset!");

// Function SeasunAccount.Account.GetGlobalAttr
// 0x0018 (0x0018 - 0x0000)
struct Account_GetGlobalAttr final
{
public:
	class FString                                 InKey;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_GetGlobalAttr) == 0x000008, "Wrong alignment on Account_GetGlobalAttr");
static_assert(sizeof(Account_GetGlobalAttr) == 0x000018, "Wrong size on Account_GetGlobalAttr");
static_assert(offsetof(Account_GetGlobalAttr, InKey) == 0x000000, "Member 'Account_GetGlobalAttr::InKey' has a wrong offset!");
static_assert(offsetof(Account_GetGlobalAttr, ReturnValue) == 0x000010, "Member 'Account_GetGlobalAttr::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.GetItemCount
// 0x0018 (0x0018 - 0x0000)
struct Account_GetItemCount final
{
public:
	int32                                         InG;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InD;                                               // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InP;                                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InL;                                               // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InContainTrial;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Account_GetItemCount) == 0x000004, "Wrong alignment on Account_GetItemCount");
static_assert(sizeof(Account_GetItemCount) == 0x000018, "Wrong size on Account_GetItemCount");
static_assert(offsetof(Account_GetItemCount, InG) == 0x000000, "Member 'Account_GetItemCount::InG' has a wrong offset!");
static_assert(offsetof(Account_GetItemCount, InD) == 0x000004, "Member 'Account_GetItemCount::InD' has a wrong offset!");
static_assert(offsetof(Account_GetItemCount, InP) == 0x000008, "Member 'Account_GetItemCount::InP' has a wrong offset!");
static_assert(offsetof(Account_GetItemCount, InL) == 0x00000C, "Member 'Account_GetItemCount::InL' has a wrong offset!");
static_assert(offsetof(Account_GetItemCount, InContainTrial) == 0x000010, "Member 'Account_GetItemCount::InContainTrial' has a wrong offset!");
static_assert(offsetof(Account_GetItemCount, ReturnValue) == 0x000014, "Member 'Account_GetItemCount::ReturnValue' has a wrong offset!");

// Function SeasunAccount.Account.GetItems
// 0x0018 (0x0018 - 0x0000)
struct Account_GetItems final
{
public:
	TArray<class UItem*>                          OutItems;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          InContainTrial;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Account_GetItems) == 0x000008, "Wrong alignment on Account_GetItems");
static_assert(sizeof(Account_GetItems) == 0x000018, "Wrong size on Account_GetItems");
static_assert(offsetof(Account_GetItems, OutItems) == 0x000000, "Member 'Account_GetItems::OutItems' has a wrong offset!");
static_assert(offsetof(Account_GetItems, InContainTrial) == 0x000010, "Member 'Account_GetItems::InContainTrial' has a wrong offset!");

// Function SeasunAccount.Account.GetItemsByGDPL
// 0x0028 (0x0028 - 0x0000)
struct Account_GetItemsByGDPL final
{
public:
	int32                                         InG;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InD;                                               // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InP;                                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InL;                                               // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UItem*>                          OutItems;                                          // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          InContainTrial;                                    // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Account_GetItemsByGDPL) == 0x000008, "Wrong alignment on Account_GetItemsByGDPL");
static_assert(sizeof(Account_GetItemsByGDPL) == 0x000028, "Wrong size on Account_GetItemsByGDPL");
static_assert(offsetof(Account_GetItemsByGDPL, InG) == 0x000000, "Member 'Account_GetItemsByGDPL::InG' has a wrong offset!");
static_assert(offsetof(Account_GetItemsByGDPL, InD) == 0x000004, "Member 'Account_GetItemsByGDPL::InD' has a wrong offset!");
