#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SeasunVehicle

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "PhysXVehicles_classes.hpp"
#include "SeasunVehicle_structs.hpp"
#include "PhysicsControl_structs.hpp"


namespace SDK
{

// Class SeasunVehicle.BaseWheeledMovementComponent
// 0x0000 (0x0410 - 0x0410)
class UBaseWheeledMovementComponent : public UWheeledVehicleMovementComponent4W
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseWheeledMovementComponent">();
	}
	static class UBaseWheeledMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseWheeledMovementComponent>();
	}
};
static_assert(alignof(UBaseWheeledMovementComponent) == 0x000008, "Wrong alignment on UBaseWheeledMovementComponent");
static_assert(sizeof(UBaseWheeledMovementComponent) == 0x000410, "Wrong size on UBaseWheeledMovementComponent");

// Class SeasunVehicle.BaseWheeledVehicle
// 0x0000 (0x0298 - 0x0298)
class ABaseWheeledVehicle : public AWheeledVehicle
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseWheeledVehicle">();
	}
	static class ABaseWheeledVehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABaseWheeledVehicle>();
	}
};
static_assert(alignof(ABaseWheeledVehicle) == 0x000008, "Wrong alignment on ABaseWheeledVehicle");
static_assert(sizeof(ABaseWheeledVehicle) == 0x000298, "Wrong size on ABaseWheeledVehicle");

// Class SeasunVehicle.VehiclePhysicsControlData
// 0x01A8 (0x01D8 - 0x0030)
class UVehiclePhysicsControlData final : public UDataAsset
{
public:
	class FName                                   ConstraintProfile;                                 // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPhysicsControlLimbSetupData>   LimbSetupData;                                     // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, struct FVehicleParamNameToSet> BodyModifiersToSet;                                // 0x0048(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FVehicleMovementTypeInSet>      MovementTypesInSet;                                // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, struct FVehicleParamNameToSet> ControlToSet;                                      // 0x00A8(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FVehicleControlDataInSet>       InSetControlData;                                  // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, struct FPhysicsControlMultiplier> ControlMultiplier;                                 // 0x0108(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FPhysicsControlData                    WorldSpaceControlData;                             // 0x0158(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsControlSettings                WorldSpaceControlSettings;                         // 0x0178(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEnableWorldSpaceControls;                         // 0x0190(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPhysicsControlData                    ParentSpaceControlData;                            // 0x0194(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsControlSettings                ParentSpaceControlSettings;                        // 0x01B4(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEnableParentSpaceControls;                        // 0x01CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPhysicsMovementType                          PhysicsMovementType;                               // 0x01CD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CE[0x2];                                      // 0x01CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GravityMultiplier;                                 // 0x01D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PhysicsBlendWeight;                                // 0x01D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehiclePhysicsControlData">();
	}
	static class UVehiclePhysicsControlData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehiclePhysicsControlData>();
	}
};
static_assert(alignof(UVehiclePhysicsControlData) == 0x000008, "Wrong alignment on UVehiclePhysicsControlData");
static_assert(sizeof(UVehiclePhysicsControlData) == 0x0001D8, "Wrong size on UVehiclePhysicsControlData");
static_assert(offsetof(UVehiclePhysicsControlData, ConstraintProfile) == 0x000030, "Member 'UVehiclePhysicsControlData::ConstraintProfile' has a wrong offset!");
static_assert(offsetof(UVehiclePhysicsControlData, LimbSetupData) == 0x000038, "Member 'UVehiclePhysicsControlData::LimbSetupData' has a wrong offset!");
static_assert(offsetof(UVehiclePhysicsControlData, BodyModifiersToSet) == 0x000048, "Member 'UVehiclePhysicsControlData::BodyModifiersToSet' has a wrong offset!");
static_assert(offsetof(UVehiclePhysicsControlData, MovementTypesInSet) == 0x000098, "Member 'UVehiclePhysicsControlData::MovementTypesInSet' has a wrong offset!");
static_assert(offsetof(UVehiclePhysicsControlData, ControlToSet) == 0x0000A8, "Member 'UVehiclePhysicsControlData::ControlToSet' has a wrong offset!");
static_assert(offsetof(UVehiclePhysicsControlData, InSetControlData) == 0x0000F8, "Member 'UVehiclePhysicsControlData::InSetControlData' has a wrong offset!");
static_assert(offsetof(UVehiclePhysicsControlData, ControlMultiplier) == 0x000108, "Member 'UVehiclePhysicsControlData::ControlMultiplier' has a wrong offset!");
static_assert(offsetof(UVehiclePhysicsControlData, WorldSpaceControlData) == 0x000158, "Member 'UVehiclePhysicsControlData::WorldSpaceControlData' has a wrong offset!");
static_assert(offsetof(UVehiclePhysicsControlData, WorldSpaceControlSettings) == 0x000178, "Member 'UVehiclePhysicsControlData::WorldSpaceControlSettings' has a wrong offset!");
static_assert(offsetof(UVehiclePhysicsControlData, bEnableWorldSpaceControls) == 0x000190, "Member 'UVehiclePhysicsControlData::bEnableWorldSpaceControls' has a wrong offset!");
static_assert(offsetof(UVehiclePhysicsControlData, ParentSpaceControlData) == 0x000194, "Member 'UVehiclePhysicsControlData::ParentSpaceControlData' has a wrong offset!");
static_assert(offsetof(UVehiclePhysicsControlData, ParentSpaceControlSettings) == 0x0001B4, "Member 'UVehiclePhysicsControlData::ParentSpaceControlSettings' has a wrong offset!");
static_assert(offsetof(UVehiclePhysicsControlData, bEnableParentSpaceControls) == 0x0001CC, "Member 'UVehiclePhysicsControlData::bEnableParentSpaceControls' has a wrong offset!");
static_assert(offsetof(UVehiclePhysicsControlData, PhysicsMovementType) == 0x0001CD, "Member 'UVehiclePhysicsControlData::PhysicsMovementType' has a wrong offset!");
static_assert(offsetof(UVehiclePhysicsControlData, GravityMultiplier) == 0x0001D0, "Member 'UVehiclePhysicsControlData::GravityMultiplier' has a wrong offset!");
static_assert(offsetof(UVehiclePhysicsControlData, PhysicsBlendWeight) == 0x0001D4, "Member 'UVehiclePhysicsControlData::PhysicsBlendWeight' has a wrong offset!");

// Class SeasunVehicle.DemoVehicle
// 0x0028 (0x02C0 - 0x0298)
class ADemoVehicle final : public AWheeledVehicle
{
public:
	class UDemoVehicleMovementComponent*          DemoMovementComponent;                             // 0x0298(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicsControlComponent*               PhysicsControlComponent;                           // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnablePhyx;                                       // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVehiclePhysicsControlData*             PhysicsControlData;                                // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DemoVehicle">();
	}
	static class ADemoVehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADemoVehicle>();
	}
};
static_assert(alignof(ADemoVehicle) == 0x000008, "Wrong alignment on ADemoVehicle");
static_assert(sizeof(ADemoVehicle) == 0x0002C0, "Wrong size on ADemoVehicle");
static_assert(offsetof(ADemoVehicle, DemoMovementComponent) == 0x000298, "Member 'ADemoVehicle::DemoMovementComponent' has a wrong offset!");
static_assert(offsetof(ADemoVehicle, SkeletalMeshComponent) == 0x0002A0, "Member 'ADemoVehicle::SkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(ADemoVehicle, PhysicsControlComponent) == 0x0002A8, "Member 'ADemoVehicle::PhysicsControlComponent' has a wrong offset!");
static_assert(offsetof(ADemoVehicle, bEnablePhyx) == 0x0002B0, "Member 'ADemoVehicle::bEnablePhyx' has a wrong offset!");
static_assert(offsetof(ADemoVehicle, PhysicsControlData) == 0x0002B8, "Member 'ADemoVehicle::PhysicsControlData' has a wrong offset!");

// Class SeasunVehicle.DemoVehicleMovementComponent
// 0x0008 (0x0418 - 0x0410)
class UDemoVehicleMovementComponent final : public UWheeledVehicleMovementComponent4W
{
public:
	float                                         RollLimit;                                         // 0x0410(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PitchLimit;                                        // 0x0414(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DemoVehicleMovementComponent">();
	}
	static class UDemoVehicleMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDemoVehicleMovementComponent>();
	}
};
static_assert(alignof(UDemoVehicleMovementComponent) == 0x000008, "Wrong alignment on UDemoVehicleMovementComponent");
static_assert(sizeof(UDemoVehicleMovementComponent) == 0x000418, "Wrong size on UDemoVehicleMovementComponent");
static_assert(offsetof(UDemoVehicleMovementComponent, RollLimit) == 0x000410, "Member 'UDemoVehicleMovementComponent::RollLimit' has a wrong offset!");
static_assert(offsetof(UDemoVehicleMovementComponent, PitchLimit) == 0x000414, "Member 'UDemoVehicleMovementComponent::PitchLimit' has a wrong offset!");

}

