#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SelfCheck_AiTargetIsVisibility

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function SelfCheck_AiTargetIsVisibility.SelfCheck_AiTargetIsVisibility_C.VisibilityTrace
// 0x00C0 (0x00C0 - 0x0000)
struct SelfCheck_AiTargetIsVisibility_C_VisibilityTrace final
{
public:
	struct FVector                                StartLoc;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EndLoc;                                            // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Ignore;                                            // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bLock;                                             // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x002C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SelfCheck_AiTargetIsVisibility_C_VisibilityTrace) == 0x000008, "Wrong alignment on SelfCheck_AiTargetIsVisibility_C_VisibilityTrace");
static_assert(sizeof(SelfCheck_AiTargetIsVisibility_C_VisibilityTrace) == 0x0000C0, "Wrong size on SelfCheck_AiTargetIsVisibility_C_VisibilityTrace");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_VisibilityTrace, StartLoc) == 0x000000, "Member 'SelfCheck_AiTargetIsVisibility_C_VisibilityTrace::StartLoc' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_VisibilityTrace, EndLoc) == 0x00000C, "Member 'SelfCheck_AiTargetIsVisibility_C_VisibilityTrace::EndLoc' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_VisibilityTrace, Ignore) == 0x000018, "Member 'SelfCheck_AiTargetIsVisibility_C_VisibilityTrace::Ignore' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_VisibilityTrace, bLock) == 0x000028, "Member 'SelfCheck_AiTargetIsVisibility_C_VisibilityTrace::bLock' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_VisibilityTrace, CallFunc_LineTraceSingle_OutHit) == 0x00002C, "Member 'SelfCheck_AiTargetIsVisibility_C_VisibilityTrace::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_VisibilityTrace, CallFunc_LineTraceSingle_ReturnValue) == 0x0000B8, "Member 'SelfCheck_AiTargetIsVisibility_C_VisibilityTrace::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");

// Function SelfCheck_AiTargetIsVisibility.SelfCheck_AiTargetIsVisibility_C.K2_CheckCondition
// 0x00D8 (0x00D8 - 0x0000)
struct SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          bBlock;                                            // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                StartLoc;                                          // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         CallFunc_GetLauncherOriginCharacter_ReturnValue;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetTargetActor_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAISkillTargets_bOk;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAISkillTargets                        CallFunc_GetAISkillTargets_ReturnValue;            // 0x0058(0x0010)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAISkillTarget                         CallFunc_Array_Get_Item;                           // 0x006C(0x0020)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCenterOfMass_ReturnValue;              // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm)
	bool                                          CallFunc_VisibilityTrace_Block;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x00B8(0x0010)(ReferenceParm)
	bool                                          CallFunc_VisibilityTrace_Block_1;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition) == 0x000008, "Wrong alignment on SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition");
static_assert(sizeof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition) == 0x0000D8, "Wrong size on SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, InCurLauncher) == 0x000000, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::InCurLauncher' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, InCurLauncherChara) == 0x000008, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::InCurLauncherChara' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, ReturnValue) == 0x000010, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, bBlock) == 0x000011, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::bBlock' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, StartLoc) == 0x000014, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::StartLoc' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, ___int_Array_Index_Variable) == 0x000020, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, ___int_Loop_Counter_Variable) == 0x000024, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, CallFunc_GetLauncherOriginCharacter_ReturnValue) == 0x000028, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::CallFunc_GetLauncherOriginCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, CallFunc_GetTargetActor_ReturnValue) == 0x000038, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::CallFunc_GetTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, K2Node_DynamicCast_AsGame_Character) == 0x000048, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, CallFunc_GetAISkillTargets_bOk) == 0x000051, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::CallFunc_GetAISkillTargets_bOk' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, CallFunc_GetAISkillTargets_ReturnValue) == 0x000058, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::CallFunc_GetAISkillTargets_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, CallFunc_Array_Get_Item) == 0x00006C, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, CallFunc_Array_Length_ReturnValue) == 0x00008C, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, CallFunc_GetCenterOfMass_ReturnValue) == 0x000094, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::CallFunc_GetCenterOfMass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, K2Node_MakeArray_Array) == 0x0000A0, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, CallFunc_VisibilityTrace_Block) == 0x0000B0, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::CallFunc_VisibilityTrace_Block' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, CallFunc_Not_PreBool_ReturnValue) == 0x0000B1, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000B2, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, K2Node_MakeArray_Array_1) == 0x0000B8, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, CallFunc_VisibilityTrace_Block_1) == 0x0000C8, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::CallFunc_VisibilityTrace_Block_1' has a wrong offset!");
static_assert(offsetof(SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000CC, "Member 'SelfCheck_AiTargetIsVisibility_C_K2_CheckCondition::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

}

