#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SelfCheck_SwitchState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SelfCheck_SwitchState.SelfCheck_SwitchState_C
// 0x0010 (0x0118 - 0x0108)
class USelfCheck_SwitchState_C final : public UCastConditionCheck
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          InEnter;                                           // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         KeepTime;                                          // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool PrepareCondition();
	bool ResetCondition();
	void K2_InitCondition();
	void BindEvent();
	void UnbindEvent();
	void PrepareSwitchCharacter(bool bEnter, class AGameCharacter* CurCharacter);
	void SwitchCharacter(bool bEnter);
	void OnDead(bool bDead, class UAbilityComponentBase* InLauncher, const struct FHealthChangeValue& HealthChangeData);
	void ExecuteUbergraph_SelfCheck_SwitchState(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SelfCheck_SwitchState_C">();
	}
	static class USelfCheck_SwitchState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USelfCheck_SwitchState_C>();
	}
};
static_assert(alignof(USelfCheck_SwitchState_C) == 0x000008, "Wrong alignment on USelfCheck_SwitchState_C");
static_assert(sizeof(USelfCheck_SwitchState_C) == 0x000118, "Wrong size on USelfCheck_SwitchState_C");
static_assert(offsetof(USelfCheck_SwitchState_C, UberGraphFrame) == 0x000108, "Member 'USelfCheck_SwitchState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USelfCheck_SwitchState_C, InEnter) == 0x000110, "Member 'USelfCheck_SwitchState_C::InEnter' has a wrong offset!");
static_assert(offsetof(USelfCheck_SwitchState_C, KeepTime) == 0x000114, "Member 'USelfCheck_SwitchState_C::KeepTime' has a wrong offset!");

}

