#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SelfCheck_OnSkillStart

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SelfCheck_OnSkillStart.SelfCheck_OnSkillStart_C
// 0x0020 (0x0128 - 0x0108)
class USelfCheck_OnSkillStart_C final : public UCastConditionCheck
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         SkillID;                                           // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SkillType;                                         // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SkillTimeType;                                     // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SkillTag;                                          // 0x011C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CheckType3(bool bStatr, int32 SkillID_0, bool* bCheck);
	void OnReceiveNotify(int32 SkillID_0, class UAbilityComponentBase* Ability, TArray<int32>& OriginSkillIDs);
	void BindEventToSkillStart(const class UAbilityComponentBase* Ability);
	void OnAbilityCastSkill(int32 SkillID_0, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void UnbindEventFromSkillStart(const class UAbilityComponentBase* Ability);
	void BindEventToSkillEnd(const class UAbilityComponentBase* Abilitys);
	void UnbindEventFromSkillEnd(const class UAbilityComponentBase* Abilitys);
	void K2_InitCondition();
	void OnSkillEnd(int32 SkillID_0, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void BindEventToSkillSuccess(const class UAbilityComponentBase* Abilitys);
	void UnbindEventFromSkillSuccess(const class UAbilityComponentBase* Abilitys);
	void OnAbilitySkillCastSuccess(int32 SkillID_0, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void K2_BindEvent(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void K2_UnbindEvent(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void ExecuteUbergraph_SelfCheck_OnSkillStart(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SelfCheck_OnSkillStart_C">();
	}
	static class USelfCheck_OnSkillStart_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USelfCheck_OnSkillStart_C>();
	}
};
static_assert(alignof(USelfCheck_OnSkillStart_C) == 0x000008, "Wrong alignment on USelfCheck_OnSkillStart_C");
static_assert(sizeof(USelfCheck_OnSkillStart_C) == 0x000128, "Wrong size on USelfCheck_OnSkillStart_C");
static_assert(offsetof(USelfCheck_OnSkillStart_C, UberGraphFrame) == 0x000108, "Member 'USelfCheck_OnSkillStart_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USelfCheck_OnSkillStart_C, SkillID) == 0x000110, "Member 'USelfCheck_OnSkillStart_C::SkillID' has a wrong offset!");
static_assert(offsetof(USelfCheck_OnSkillStart_C, SkillType) == 0x000114, "Member 'USelfCheck_OnSkillStart_C::SkillType' has a wrong offset!");
static_assert(offsetof(USelfCheck_OnSkillStart_C, SkillTimeType) == 0x000118, "Member 'USelfCheck_OnSkillStart_C::SkillTimeType' has a wrong offset!");
static_assert(offsetof(USelfCheck_OnSkillStart_C, SkillTag) == 0x00011C, "Member 'USelfCheck_OnSkillStart_C::SkillTag' has a wrong offset!");

}

