#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SelfCheck_IsInAbnormal

#include "Basic.hpp"


namespace SDK::Params
{

// Function SelfCheck_IsInAbnormal.SelfCheck_IsInAbnormal_C.K2_CheckCondition
// 0x0038 (0x0038 - 0x0000)
struct SelfCheck_IsInAbnormal_C_K2_CheckCondition final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         BlockTypeNames;                                    // 0x0018(0x0010)(Edit, BlueprintVisible)
	class UAbilityComponentBase*                  CallFunc_GetLauncherAbility_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInAbnormal_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SelfCheck_IsInAbnormal_C_K2_CheckCondition;

// Function SelfCheck_IsInAbnormal.SelfCheck_IsInAbnormal_C.ExecuteUbergraph_SelfCheck_IsInAbnormal
// 0x0008 (0x0008 - 0x0000)
struct SelfCheck_IsInAbnormal_C_ExecuteUbergraph_SelfCheck_IsInAbnormal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetParamboolValue_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SelfCheck_IsInAbnormal_C_ExecuteUbergraph_SelfCheck_IsInAbnormal;

}

