#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SelfCheck_SkillContinuityApplyTimes

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SelfCheck_SkillContinuityApplyTimes.SelfCheck_SkillContinuityApplyTimes_C
// 0x0040 (0x0148 - 0x0108)
class USelfCheck_SkillContinuityApplyTimes_C final : public UCastConditionCheck
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bNeedSameSkillWithPre;                             // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TriggerMinDeltaTime;                               // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TriggerTimes;                                      // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreSkillID;                                        // 0x011C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PreSkillTriggerTime;                               // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentTriggerTimes;                               // 0x0124(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ClearOnPass;                                       // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CheckSkillTypes;                                   // 0x0130(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bNotCheckSkillID;                                  // 0x0140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void IsSameSkill(int32 NewSkill, bool* Result);
	void IsSkillIndexCorrect(class UAbilityComponentBase* Ability, int32 SkillID, bool* Valid);
	void Clear();
	void OnReceiveNotify(int32 SkillID, class UAbilityComponentBase* Ability, TArray<int32>& OriginSkillIDs);
	void K2_InitCondition();
	void BindEventToSkillStart(const class UAbilityComponentBase* Ability);
	void OnAbilityCastSkill(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void UnbindEventFromSkillStart(const class UAbilityComponentBase* Ability);
	void K2_BindEvent(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void K2_UnbindEvent(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void ExecuteUbergraph_SelfCheck_SkillContinuityApplyTimes(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SelfCheck_SkillContinuityApplyTimes_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SelfCheck_SkillContinuityApplyTimes_C")
	}
	static class USelfCheck_SkillContinuityApplyTimes_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USelfCheck_SkillContinuityApplyTimes_C>();
	}
};
DUMPER7_ASSERTS_USelfCheck_SkillContinuityApplyTimes_C;

}

