#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SelfCheck_Mon108RandomAction

#include "Basic.hpp"


namespace SDK::Params
{

// Function SelfCheck_Mon108RandomAction.SelfCheck_Mon108RandomAction_C.ExecuteUbergraph_SelfCheck_Mon108RandomAction
// 0x0008 (0x0008 - 0x0000)
struct SelfCheck_Mon108RandomAction_C_ExecuteUbergraph_SelfCheck_Mon108RandomAction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SelfCheck_Mon108RandomAction_C_ExecuteUbergraph_SelfCheck_Mon108RandomAction) == 0x000004, "Wrong alignment on SelfCheck_Mon108RandomAction_C_ExecuteUbergraph_SelfCheck_Mon108RandomAction");
static_assert(sizeof(SelfCheck_Mon108RandomAction_C_ExecuteUbergraph_SelfCheck_Mon108RandomAction) == 0x000008, "Wrong size on SelfCheck_Mon108RandomAction_C_ExecuteUbergraph_SelfCheck_Mon108RandomAction");
static_assert(offsetof(SelfCheck_Mon108RandomAction_C_ExecuteUbergraph_SelfCheck_Mon108RandomAction, EntryPoint) == 0x000000, "Member 'SelfCheck_Mon108RandomAction_C_ExecuteUbergraph_SelfCheck_Mon108RandomAction::EntryPoint' has a wrong offset!");
static_assert(offsetof(SelfCheck_Mon108RandomAction_C_ExecuteUbergraph_SelfCheck_Mon108RandomAction, CallFunc_Conv_StringToInt_ReturnValue) == 0x000004, "Member 'SelfCheck_Mon108RandomAction_C_ExecuteUbergraph_SelfCheck_Mon108RandomAction::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");

// Function SelfCheck_Mon108RandomAction.SelfCheck_Mon108RandomAction_C.K2_CheckCondition
// 0x0038 (0x0038 - 0x0000)
struct SelfCheck_Mon108RandomAction_C_K2_CheckCondition final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAICharacter*                       K2Node_DynamicCast_AsGame_AICharacter;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Mon_108a_C*                         K2Node_DynamicCast_AsBP_Mon_108a;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SelfCheck_Mon108RandomAction_C_K2_CheckCondition) == 0x000008, "Wrong alignment on SelfCheck_Mon108RandomAction_C_K2_CheckCondition");
static_assert(sizeof(SelfCheck_Mon108RandomAction_C_K2_CheckCondition) == 0x000038, "Wrong size on SelfCheck_Mon108RandomAction_C_K2_CheckCondition");
static_assert(offsetof(SelfCheck_Mon108RandomAction_C_K2_CheckCondition, InCurLauncher) == 0x000000, "Member 'SelfCheck_Mon108RandomAction_C_K2_CheckCondition::InCurLauncher' has a wrong offset!");
static_assert(offsetof(SelfCheck_Mon108RandomAction_C_K2_CheckCondition, InCurLauncherChara) == 0x000008, "Member 'SelfCheck_Mon108RandomAction_C_K2_CheckCondition::InCurLauncherChara' has a wrong offset!");
static_assert(offsetof(SelfCheck_Mon108RandomAction_C_K2_CheckCondition, ReturnValue) == 0x000010, "Member 'SelfCheck_Mon108RandomAction_C_K2_CheckCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_Mon108RandomAction_C_K2_CheckCondition, K2Node_DynamicCast_AsGame_AICharacter) == 0x000018, "Member 'SelfCheck_Mon108RandomAction_C_K2_CheckCondition::K2Node_DynamicCast_AsGame_AICharacter' has a wrong offset!");
static_assert(offsetof(SelfCheck_Mon108RandomAction_C_K2_CheckCondition, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'SelfCheck_Mon108RandomAction_C_K2_CheckCondition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SelfCheck_Mon108RandomAction_C_K2_CheckCondition, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'SelfCheck_Mon108RandomAction_C_K2_CheckCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_Mon108RandomAction_C_K2_CheckCondition, K2Node_DynamicCast_AsBP_Mon_108a) == 0x000028, "Member 'SelfCheck_Mon108RandomAction_C_K2_CheckCondition::K2Node_DynamicCast_AsBP_Mon_108a' has a wrong offset!");
static_assert(offsetof(SelfCheck_Mon108RandomAction_C_K2_CheckCondition, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'SelfCheck_Mon108RandomAction_C_K2_CheckCondition::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SelfCheck_Mon108RandomAction_C_K2_CheckCondition, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000031, "Member 'SelfCheck_Mon108RandomAction_C_K2_CheckCondition::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

}

