#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SelfCheck_StartSwitch

#include "Basic.hpp"


namespace SDK::Params
{

// Function SelfCheck_StartSwitch.SelfCheck_StartSwitch_C.OnCharacterStartSwitch
// 0x0001 (0x0001 - 0x0000)
struct SelfCheck_StartSwitch_C_OnCharacterStartSwitch final
{
public:
	bool                                          bDeadSwitch_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SelfCheck_StartSwitch_C_OnCharacterStartSwitch) == 0x000001, "Wrong alignment on SelfCheck_StartSwitch_C_OnCharacterStartSwitch");
static_assert(sizeof(SelfCheck_StartSwitch_C_OnCharacterStartSwitch) == 0x000001, "Wrong size on SelfCheck_StartSwitch_C_OnCharacterStartSwitch");
static_assert(offsetof(SelfCheck_StartSwitch_C_OnCharacterStartSwitch, bDeadSwitch_0) == 0x000000, "Member 'SelfCheck_StartSwitch_C_OnCharacterStartSwitch::bDeadSwitch_0' has a wrong offset!");

// Function SelfCheck_StartSwitch.SelfCheck_StartSwitch_C.K2_BindEvent
// 0x0010 (0x0010 - 0x0000)
struct SelfCheck_StartSwitch_C_K2_BindEvent final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SelfCheck_StartSwitch_C_K2_BindEvent) == 0x000008, "Wrong alignment on SelfCheck_StartSwitch_C_K2_BindEvent");
static_assert(sizeof(SelfCheck_StartSwitch_C_K2_BindEvent) == 0x000010, "Wrong size on SelfCheck_StartSwitch_C_K2_BindEvent");
static_assert(offsetof(SelfCheck_StartSwitch_C_K2_BindEvent, InCurLauncher) == 0x000000, "Member 'SelfCheck_StartSwitch_C_K2_BindEvent::InCurLauncher' has a wrong offset!");
static_assert(offsetof(SelfCheck_StartSwitch_C_K2_BindEvent, InCurLauncherChara) == 0x000008, "Member 'SelfCheck_StartSwitch_C_K2_BindEvent::InCurLauncherChara' has a wrong offset!");

// Function SelfCheck_StartSwitch.SelfCheck_StartSwitch_C.K2_UnbindEvent
// 0x0010 (0x0010 - 0x0000)
struct SelfCheck_StartSwitch_C_K2_UnbindEvent final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SelfCheck_StartSwitch_C_K2_UnbindEvent) == 0x000008, "Wrong alignment on SelfCheck_StartSwitch_C_K2_UnbindEvent");
static_assert(sizeof(SelfCheck_StartSwitch_C_K2_UnbindEvent) == 0x000010, "Wrong size on SelfCheck_StartSwitch_C_K2_UnbindEvent");
static_assert(offsetof(SelfCheck_StartSwitch_C_K2_UnbindEvent, InCurLauncher) == 0x000000, "Member 'SelfCheck_StartSwitch_C_K2_UnbindEvent::InCurLauncher' has a wrong offset!");
static_assert(offsetof(SelfCheck_StartSwitch_C_K2_UnbindEvent, InCurLauncherChara) == 0x000008, "Member 'SelfCheck_StartSwitch_C_K2_UnbindEvent::InCurLauncherChara' has a wrong offset!");

// Function SelfCheck_StartSwitch.SelfCheck_StartSwitch_C.ExecuteUbergraph_SelfCheck_StartSwitch
// 0x0078 (0x0078 - 0x0000)
struct SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bDeadSwitch)>             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bDeadSwitch;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_Event_InCurLauncher_1;                      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_InCurLauncherChara_1;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_2;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_3;                   // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_Event_InCurLauncher;                        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_InCurLauncherChara;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player_1;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_4;                   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch) == 0x000008, "Wrong alignment on SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch");
static_assert(sizeof(SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch) == 0x000078, "Wrong size on SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch");
static_assert(offsetof(SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch, EntryPoint) == 0x000000, "Member 'SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch::EntryPoint' has a wrong offset!");
static_assert(offsetof(SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch, CallFunc_Contains_ReturnValue) == 0x000004, "Member 'SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch, CallFunc_Contains_ReturnValue_1) == 0x000028, "Member 'SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch, K2Node_CustomEvent_bDeadSwitch) == 0x000029, "Member 'SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch::K2Node_CustomEvent_bDeadSwitch' has a wrong offset!");
static_assert(offsetof(SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch, CallFunc_Not_PreBool_ReturnValue) == 0x00002A, "Member 'SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch, K2Node_Event_InCurLauncher_1) == 0x000030, "Member 'SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch::K2Node_Event_InCurLauncher_1' has a wrong offset!");
static_assert(offsetof(SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch, K2Node_Event_InCurLauncherChara_1) == 0x000038, "Member 'SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch::K2Node_Event_InCurLauncherChara_1' has a wrong offset!");
static_assert(offsetof(SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch, K2Node_DynamicCast_AsGame_Player) == 0x000040, "Member 'SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch::K2Node_DynamicCast_AsGame_Player' has a wrong offset!");
static_assert(offsetof(SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch, CallFunc_Contains_ReturnValue_2) == 0x000049, "Member 'SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch::CallFunc_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch, CallFunc_Contains_ReturnValue_3) == 0x00004A, "Member 'SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch::CallFunc_Contains_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x00004B, "Member 'SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch, CallFunc_Not_PreBool_ReturnValue_1) == 0x00004C, "Member 'SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch, K2Node_Event_InCurLauncher) == 0x000050, "Member 'SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch::K2Node_Event_InCurLauncher' has a wrong offset!");
static_assert(offsetof(SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch, K2Node_Event_InCurLauncherChara) == 0x000058, "Member 'SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch::K2Node_Event_InCurLauncherChara' has a wrong offset!");
static_assert(offsetof(SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch, CallFunc_BooleanAND_ReturnValue) == 0x000060, "Member 'SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch, K2Node_DynamicCast_AsGame_Player_1) == 0x000068, "Member 'SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch::K2Node_DynamicCast_AsGame_Player_1' has a wrong offset!");
static_assert(offsetof(SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch, CallFunc_Contains_ReturnValue_4) == 0x000071, "Member 'SelfCheck_StartSwitch_C_ExecuteUbergraph_SelfCheck_StartSwitch::CallFunc_Contains_ReturnValue_4' has a wrong offset!");

}

