#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SelfCheck_StartSwitch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SelfCheck_StartSwitch.SelfCheck_StartSwitch_C
// 0x0020 (0x0128 - 0x0108)
class USelfCheck_StartSwitch_C final : public UCastConditionCheck
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FString                                 Switch;                                            // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bDeadSwitch;                                       // 0x0120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void K2_InitCondition();
	void OnCharacterStartSwitch(bool bDeadSwitch_0);
	void OnCharacterStartQTE();
	void K2_BindEvent(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void K2_UnbindEvent(class UAbilityComponentBase* InCurLauncher, class AGameCharacter* InCurLauncherChara);
	void ExecuteUbergraph_SelfCheck_StartSwitch(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SelfCheck_StartSwitch_C">();
	}
	static class USelfCheck_StartSwitch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USelfCheck_StartSwitch_C>();
	}
};
static_assert(alignof(USelfCheck_StartSwitch_C) == 0x000008, "Wrong alignment on USelfCheck_StartSwitch_C");
static_assert(sizeof(USelfCheck_StartSwitch_C) == 0x000128, "Wrong size on USelfCheck_StartSwitch_C");
static_assert(offsetof(USelfCheck_StartSwitch_C, UberGraphFrame) == 0x000108, "Member 'USelfCheck_StartSwitch_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USelfCheck_StartSwitch_C, Switch) == 0x000110, "Member 'USelfCheck_StartSwitch_C::Switch' has a wrong offset!");
static_assert(offsetof(USelfCheck_StartSwitch_C, bDeadSwitch) == 0x000120, "Member 'USelfCheck_StartSwitch_C::bDeadSwitch' has a wrong offset!");

}

