#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SelfCheck_IsInSpecializationSkillBlock

#include "Basic.hpp"


namespace SDK::Params
{

// Function SelfCheck_IsInSpecializationSkillBlock.SelfCheck_IsInSpecializationSkillBlock_C.K2_CheckCondition
// 0x0048 (0x0048 - 0x0000)
struct SelfCheck_IsInSpecializationSkillBlock_C_K2_CheckCondition final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  ___object_Variable;                                // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAbilityCharacterInterface> K2Node_DynamicCast_AsAbility_Character_Interface;  // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  CallFunc_GetAbilityComponent_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInSpecializationSkillBlock_ReturnValue; // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SelfCheck_IsInSpecializationSkillBlock_C_K2_CheckCondition) == 0x000008, "Wrong alignment on SelfCheck_IsInSpecializationSkillBlock_C_K2_CheckCondition");
static_assert(sizeof(SelfCheck_IsInSpecializationSkillBlock_C_K2_CheckCondition) == 0x000048, "Wrong size on SelfCheck_IsInSpecializationSkillBlock_C_K2_CheckCondition");
static_assert(offsetof(SelfCheck_IsInSpecializationSkillBlock_C_K2_CheckCondition, InCurLauncher) == 0x000000, "Member 'SelfCheck_IsInSpecializationSkillBlock_C_K2_CheckCondition::InCurLauncher' has a wrong offset!");
static_assert(offsetof(SelfCheck_IsInSpecializationSkillBlock_C_K2_CheckCondition, InCurLauncherChara) == 0x000008, "Member 'SelfCheck_IsInSpecializationSkillBlock_C_K2_CheckCondition::InCurLauncherChara' has a wrong offset!");
static_assert(offsetof(SelfCheck_IsInSpecializationSkillBlock_C_K2_CheckCondition, ReturnValue) == 0x000010, "Member 'SelfCheck_IsInSpecializationSkillBlock_C_K2_CheckCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_IsInSpecializationSkillBlock_C_K2_CheckCondition, ___object_Variable) == 0x000018, "Member 'SelfCheck_IsInSpecializationSkillBlock_C_K2_CheckCondition::___object_Variable' has a wrong offset!");
static_assert(offsetof(SelfCheck_IsInSpecializationSkillBlock_C_K2_CheckCondition, K2Node_DynamicCast_AsAbility_Character_Interface) == 0x000020, "Member 'SelfCheck_IsInSpecializationSkillBlock_C_K2_CheckCondition::K2Node_DynamicCast_AsAbility_Character_Interface' has a wrong offset!");
static_assert(offsetof(SelfCheck_IsInSpecializationSkillBlock_C_K2_CheckCondition, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'SelfCheck_IsInSpecializationSkillBlock_C_K2_CheckCondition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SelfCheck_IsInSpecializationSkillBlock_C_K2_CheckCondition, CallFunc_GetAbilityComponent_ReturnValue) == 0x000038, "Member 'SelfCheck_IsInSpecializationSkillBlock_C_K2_CheckCondition::CallFunc_GetAbilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_IsInSpecializationSkillBlock_C_K2_CheckCondition, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'SelfCheck_IsInSpecializationSkillBlock_C_K2_CheckCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_IsInSpecializationSkillBlock_C_K2_CheckCondition, CallFunc_IsInSpecializationSkillBlock_ReturnValue) == 0x000041, "Member 'SelfCheck_IsInSpecializationSkillBlock_C_K2_CheckCondition::CallFunc_IsInSpecializationSkillBlock_ReturnValue' has a wrong offset!");

// Function SelfCheck_IsInSpecializationSkillBlock.SelfCheck_IsInSpecializationSkillBlock_C.ExecuteUbergraph_SelfCheck_IsInSpecializationSkillBlock
// 0x0008 (0x0008 - 0x0000)
struct SelfCheck_IsInSpecializationSkillBlock_C_ExecuteUbergraph_SelfCheck_IsInSpecializationSkillBlock final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetParamboolValue_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SelfCheck_IsInSpecializationSkillBlock_C_ExecuteUbergraph_SelfCheck_IsInSpecializationSkillBlock) == 0x000004, "Wrong alignment on SelfCheck_IsInSpecializationSkillBlock_C_ExecuteUbergraph_SelfCheck_IsInSpecializationSkillBlock");
static_assert(sizeof(SelfCheck_IsInSpecializationSkillBlock_C_ExecuteUbergraph_SelfCheck_IsInSpecializationSkillBlock) == 0x000008, "Wrong size on SelfCheck_IsInSpecializationSkillBlock_C_ExecuteUbergraph_SelfCheck_IsInSpecializationSkillBlock");
static_assert(offsetof(SelfCheck_IsInSpecializationSkillBlock_C_ExecuteUbergraph_SelfCheck_IsInSpecializationSkillBlock, EntryPoint) == 0x000000, "Member 'SelfCheck_IsInSpecializationSkillBlock_C_ExecuteUbergraph_SelfCheck_IsInSpecializationSkillBlock::EntryPoint' has a wrong offset!");
static_assert(offsetof(SelfCheck_IsInSpecializationSkillBlock_C_ExecuteUbergraph_SelfCheck_IsInSpecializationSkillBlock, CallFunc_GetParamboolValue_ReturnValue) == 0x000004, "Member 'SelfCheck_IsInSpecializationSkillBlock_C_ExecuteUbergraph_SelfCheck_IsInSpecializationSkillBlock::CallFunc_GetParamboolValue_ReturnValue' has a wrong offset!");

}

