#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SelfCheck_SwitchState

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function SelfCheck_SwitchState.SelfCheck_SwitchState_C.PrepareCondition
// 0x0001 (0x0001 - 0x0000)
struct SelfCheck_SwitchState_C_PrepareCondition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SelfCheck_SwitchState_C_PrepareCondition) == 0x000001, "Wrong alignment on SelfCheck_SwitchState_C_PrepareCondition");
static_assert(sizeof(SelfCheck_SwitchState_C_PrepareCondition) == 0x000001, "Wrong size on SelfCheck_SwitchState_C_PrepareCondition");
static_assert(offsetof(SelfCheck_SwitchState_C_PrepareCondition, ReturnValue) == 0x000000, "Member 'SelfCheck_SwitchState_C_PrepareCondition::ReturnValue' has a wrong offset!");

// Function SelfCheck_SwitchState.SelfCheck_SwitchState_C.ResetCondition
// 0x0001 (0x0001 - 0x0000)
struct SelfCheck_SwitchState_C_ResetCondition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SelfCheck_SwitchState_C_ResetCondition) == 0x000001, "Wrong alignment on SelfCheck_SwitchState_C_ResetCondition");
static_assert(sizeof(SelfCheck_SwitchState_C_ResetCondition) == 0x000001, "Wrong size on SelfCheck_SwitchState_C_ResetCondition");
static_assert(offsetof(SelfCheck_SwitchState_C_ResetCondition, ReturnValue) == 0x000000, "Member 'SelfCheck_SwitchState_C_ResetCondition::ReturnValue' has a wrong offset!");

// Function SelfCheck_SwitchState.SelfCheck_SwitchState_C.PrepareSwitchCharacter
// 0x0010 (0x0010 - 0x0000)
struct SelfCheck_SwitchState_C_PrepareSwitchCharacter final
{
public:
	bool                                          bEnter;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CurCharacter;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SelfCheck_SwitchState_C_PrepareSwitchCharacter) == 0x000008, "Wrong alignment on SelfCheck_SwitchState_C_PrepareSwitchCharacter");
static_assert(sizeof(SelfCheck_SwitchState_C_PrepareSwitchCharacter) == 0x000010, "Wrong size on SelfCheck_SwitchState_C_PrepareSwitchCharacter");
static_assert(offsetof(SelfCheck_SwitchState_C_PrepareSwitchCharacter, bEnter) == 0x000000, "Member 'SelfCheck_SwitchState_C_PrepareSwitchCharacter::bEnter' has a wrong offset!");
static_assert(offsetof(SelfCheck_SwitchState_C_PrepareSwitchCharacter, CurCharacter) == 0x000008, "Member 'SelfCheck_SwitchState_C_PrepareSwitchCharacter::CurCharacter' has a wrong offset!");

// Function SelfCheck_SwitchState.SelfCheck_SwitchState_C.SwitchCharacter
// 0x0001 (0x0001 - 0x0000)
struct SelfCheck_SwitchState_C_SwitchCharacter final
{
public:
	bool                                          bEnter;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SelfCheck_SwitchState_C_SwitchCharacter) == 0x000001, "Wrong alignment on SelfCheck_SwitchState_C_SwitchCharacter");
static_assert(sizeof(SelfCheck_SwitchState_C_SwitchCharacter) == 0x000001, "Wrong size on SelfCheck_SwitchState_C_SwitchCharacter");
static_assert(offsetof(SelfCheck_SwitchState_C_SwitchCharacter, bEnter) == 0x000000, "Member 'SelfCheck_SwitchState_C_SwitchCharacter::bEnter' has a wrong offset!");

// Function SelfCheck_SwitchState.SelfCheck_SwitchState_C.OnDead
// 0x01C0 (0x01C0 - 0x0000)
struct SelfCheck_SwitchState_C_OnDead final
{
public:
	bool                                          bDead;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  InLauncher;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     HealthChangeData;                                  // 0x0010(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(SelfCheck_SwitchState_C_OnDead) == 0x000008, "Wrong alignment on SelfCheck_SwitchState_C_OnDead");
static_assert(sizeof(SelfCheck_SwitchState_C_OnDead) == 0x0001C0, "Wrong size on SelfCheck_SwitchState_C_OnDead");
static_assert(offsetof(SelfCheck_SwitchState_C_OnDead, bDead) == 0x000000, "Member 'SelfCheck_SwitchState_C_OnDead::bDead' has a wrong offset!");
static_assert(offsetof(SelfCheck_SwitchState_C_OnDead, InLauncher) == 0x000008, "Member 'SelfCheck_SwitchState_C_OnDead::InLauncher' has a wrong offset!");
static_assert(offsetof(SelfCheck_SwitchState_C_OnDead, HealthChangeData) == 0x000010, "Member 'SelfCheck_SwitchState_C_OnDead::HealthChangeData' has a wrong offset!");

// Function SelfCheck_SwitchState.SelfCheck_SwitchState_C.ExecuteUbergraph_SelfCheck_SwitchState
// 0x0240 (0x0240 - 0x0000)
struct SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetLauncherOriginCharacter_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bDead, class UAbilityComponentBase* InLauncher, struct FHealthChangeValue& HealthChangeData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetParamfloatValue_ReturnValue;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bEnter_1;                       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_CustomEvent_CurCharacter;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEnter;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bDead;                          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_CustomEvent_InLauncher;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_CustomEvent_HealthChangeData;               // 0x0048(0x01B0)(ConstParm, ContainsInstancedReference)
	class AGameCharacter*                         CallFunc_GetLauncherOriginCharacter_ReturnValue_1; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponentBase*                  CallFunc_GetLauncherAbility_ReturnValue;           // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCurrentCharacter_ReturnValue;           // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20B[0x5];                                      // 0x020B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  CallFunc_GetLauncherAbility_ReturnValue_1;         // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetLauncherOriginCharacter_ReturnValue_2; // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bEnter, class AGameCharacter* CurCharacter)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0228(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState) == 0x000008, "Wrong alignment on SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState");
static_assert(sizeof(SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState) == 0x000240, "Wrong size on SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState");
static_assert(offsetof(SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState, EntryPoint) == 0x000000, "Member 'SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState::EntryPoint' has a wrong offset!");
static_assert(offsetof(SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState, CallFunc_GetLauncherOriginCharacter_ReturnValue) == 0x000008, "Member 'SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState::CallFunc_GetLauncherOriginCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState, CallFunc_GetParamfloatValue_ReturnValue) == 0x000024, "Member 'SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState::CallFunc_GetParamfloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState, K2Node_SwitchString_CmpSuccess) == 0x000028, "Member 'SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState, K2Node_CustomEvent_bEnter_1) == 0x000029, "Member 'SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState::K2Node_CustomEvent_bEnter_1' has a wrong offset!");
static_assert(offsetof(SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState, K2Node_CustomEvent_CurCharacter) == 0x000030, "Member 'SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState::K2Node_CustomEvent_CurCharacter' has a wrong offset!");
static_assert(offsetof(SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState, K2Node_CustomEvent_bEnter) == 0x000038, "Member 'SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState::K2Node_CustomEvent_bEnter' has a wrong offset!");
static_assert(offsetof(SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState, K2Node_CustomEvent_bDead) == 0x000039, "Member 'SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState::K2Node_CustomEvent_bDead' has a wrong offset!");
static_assert(offsetof(SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState, K2Node_CustomEvent_InLauncher) == 0x000040, "Member 'SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState::K2Node_CustomEvent_InLauncher' has a wrong offset!");
static_assert(offsetof(SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState, K2Node_CustomEvent_HealthChangeData) == 0x000048, "Member 'SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState::K2Node_CustomEvent_HealthChangeData' has a wrong offset!");
static_assert(offsetof(SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState, CallFunc_GetLauncherOriginCharacter_ReturnValue_1) == 0x0001F8, "Member 'SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState::CallFunc_GetLauncherOriginCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState, CallFunc_GetLauncherAbility_ReturnValue) == 0x000200, "Member 'SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState::CallFunc_GetLauncherAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState, CallFunc_IsValid_ReturnValue_1) == 0x000208, "Member 'SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState, CallFunc_IsValid_ReturnValue_2) == 0x000209, "Member 'SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState, CallFunc_IsCurrentCharacter_ReturnValue) == 0x00020A, "Member 'SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState::CallFunc_IsCurrentCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState, CallFunc_GetLauncherAbility_ReturnValue_1) == 0x000210, "Member 'SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState::CallFunc_GetLauncherAbility_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState, CallFunc_IsValid_ReturnValue_3) == 0x000218, "Member 'SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState, CallFunc_GetLauncherOriginCharacter_ReturnValue_2) == 0x000220, "Member 'SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState::CallFunc_GetLauncherOriginCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState, K2Node_CreateDelegate_OutputDelegate_1) == 0x000228, "Member 'SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState, CallFunc_IsValid_ReturnValue_4) == 0x000238, "Member 'SelfCheck_SwitchState_C_ExecuteUbergraph_SelfCheck_SwitchState::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");

}

