#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SelfCheck_OnSkillStart

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function SelfCheck_OnSkillStart.SelfCheck_OnSkillStart_C.CheckType3
// 0x000C (0x000C - 0x0000)
struct SelfCheck_OnSkillStart_C_CheckType3 final
{
public:
	bool                                          bStatr;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SkillID_0;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCheck;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SelfCheck_OnSkillStart_C_CheckType3) == 0x000004, "Wrong alignment on SelfCheck_OnSkillStart_C_CheckType3");
static_assert(sizeof(SelfCheck_OnSkillStart_C_CheckType3) == 0x00000C, "Wrong size on SelfCheck_OnSkillStart_C_CheckType3");
static_assert(offsetof(SelfCheck_OnSkillStart_C_CheckType3, bStatr) == 0x000000, "Member 'SelfCheck_OnSkillStart_C_CheckType3::bStatr' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_CheckType3, SkillID_0) == 0x000004, "Member 'SelfCheck_OnSkillStart_C_CheckType3::SkillID_0' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_CheckType3, bCheck) == 0x000008, "Member 'SelfCheck_OnSkillStart_C_CheckType3::bCheck' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_CheckType3, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000009, "Member 'SelfCheck_OnSkillStart_C_CheckType3::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_CheckType3, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00000A, "Member 'SelfCheck_OnSkillStart_C_CheckType3::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_CheckType3, CallFunc_Not_PreBool_ReturnValue) == 0x00000B, "Member 'SelfCheck_OnSkillStart_C_CheckType3::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function SelfCheck_OnSkillStart.SelfCheck_OnSkillStart_C.OnReceiveNotify
// 0x0770 (0x0770 - 0x0000)
struct SelfCheck_OnSkillStart_C_OnReceiveNotify final
{
public:
	int32                                         SkillID_0;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  Ability;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 OriginSkillIDs;                                    // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponent*                      K2Node_DynamicCast_AsAbility_Component;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSkillInfo                             CallFunc_K2_GetSkillInfoStatic_ReturnValue;        // 0x0038(0x0388)(ConstParm)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue_1;         // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x03C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x03C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CD[0x3];                                      // 0x03CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSkillInfo                             CallFunc_K2_GetSkillInfoStatic_ReturnValue_1;      // 0x03D8(0x0388)(ConstParm)
	bool                                          CallFunc_IsMasterSkill_ReturnValue;                // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0761(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_762[0x2];                                      // 0x0762(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0764(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMasterSkill_ReturnValue_1;              // 0x0768(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0769(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x076A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SelfCheck_OnSkillStart_C_OnReceiveNotify) == 0x000008, "Wrong alignment on SelfCheck_OnSkillStart_C_OnReceiveNotify");
static_assert(sizeof(SelfCheck_OnSkillStart_C_OnReceiveNotify) == 0x000770, "Wrong size on SelfCheck_OnSkillStart_C_OnReceiveNotify");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnReceiveNotify, SkillID_0) == 0x000000, "Member 'SelfCheck_OnSkillStart_C_OnReceiveNotify::SkillID_0' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnReceiveNotify, Ability) == 0x000008, "Member 'SelfCheck_OnSkillStart_C_OnReceiveNotify::Ability' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnReceiveNotify, OriginSkillIDs) == 0x000010, "Member 'SelfCheck_OnSkillStart_C_OnReceiveNotify::OriginSkillIDs' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnReceiveNotify, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'SelfCheck_OnSkillStart_C_OnReceiveNotify::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnReceiveNotify, K2Node_DynamicCast_AsAbility_Component) == 0x000028, "Member 'SelfCheck_OnSkillStart_C_OnReceiveNotify::K2Node_DynamicCast_AsAbility_Component' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnReceiveNotify, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'SelfCheck_OnSkillStart_C_OnReceiveNotify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnReceiveNotify, CallFunc_K2_GetSkillInfoStatic_ReturnValue) == 0x000038, "Member 'SelfCheck_OnSkillStart_C_OnReceiveNotify::CallFunc_K2_GetSkillInfoStatic_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnReceiveNotify, CallFunc_IsGameplayTagValid_ReturnValue) == 0x0003C0, "Member 'SelfCheck_OnSkillStart_C_OnReceiveNotify::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnReceiveNotify, CallFunc_IsGameplayTagValid_ReturnValue_1) == 0x0003C1, "Member 'SelfCheck_OnSkillStart_C_OnReceiveNotify::CallFunc_IsGameplayTagValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnReceiveNotify, CallFunc_Array_Contains_ReturnValue) == 0x0003C2, "Member 'SelfCheck_OnSkillStart_C_OnReceiveNotify::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnReceiveNotify, K2Node_SwitchInteger_CmpSuccess) == 0x0003C3, "Member 'SelfCheck_OnSkillStart_C_OnReceiveNotify::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnReceiveNotify, ___int_Loop_Counter_Variable) == 0x0003C4, "Member 'SelfCheck_OnSkillStart_C_OnReceiveNotify::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnReceiveNotify, ___int_Array_Index_Variable) == 0x0003C8, "Member 'SelfCheck_OnSkillStart_C_OnReceiveNotify::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnReceiveNotify, CallFunc_Less_IntInt_ReturnValue) == 0x0003CC, "Member 'SelfCheck_OnSkillStart_C_OnReceiveNotify::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnReceiveNotify, CallFunc_Array_Get_Item) == 0x0003D0, "Member 'SelfCheck_OnSkillStart_C_OnReceiveNotify::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnReceiveNotify, CallFunc_K2_GetSkillInfoStatic_ReturnValue_1) == 0x0003D8, "Member 'SelfCheck_OnSkillStart_C_OnReceiveNotify::CallFunc_K2_GetSkillInfoStatic_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnReceiveNotify, CallFunc_IsMasterSkill_ReturnValue) == 0x000760, "Member 'SelfCheck_OnSkillStart_C_OnReceiveNotify::CallFunc_IsMasterSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnReceiveNotify, CallFunc_Array_Contains_ReturnValue_1) == 0x000761, "Member 'SelfCheck_OnSkillStart_C_OnReceiveNotify::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnReceiveNotify, CallFunc_Add_IntInt_ReturnValue) == 0x000764, "Member 'SelfCheck_OnSkillStart_C_OnReceiveNotify::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnReceiveNotify, CallFunc_IsMasterSkill_ReturnValue_1) == 0x000768, "Member 'SelfCheck_OnSkillStart_C_OnReceiveNotify::CallFunc_IsMasterSkill_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnReceiveNotify, CallFunc_Greater_IntInt_ReturnValue) == 0x000769, "Member 'SelfCheck_OnSkillStart_C_OnReceiveNotify::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnReceiveNotify, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00076A, "Member 'SelfCheck_OnSkillStart_C_OnReceiveNotify::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function SelfCheck_OnSkillStart.SelfCheck_OnSkillStart_C.BindEventToSkillStart
// 0x0008 (0x0008 - 0x0000)
struct SelfCheck_OnSkillStart_C_BindEventToSkillStart final
{
public:
	const class UAbilityComponentBase*            Ability;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SelfCheck_OnSkillStart_C_BindEventToSkillStart) == 0x000008, "Wrong alignment on SelfCheck_OnSkillStart_C_BindEventToSkillStart");
static_assert(sizeof(SelfCheck_OnSkillStart_C_BindEventToSkillStart) == 0x000008, "Wrong size on SelfCheck_OnSkillStart_C_BindEventToSkillStart");
static_assert(offsetof(SelfCheck_OnSkillStart_C_BindEventToSkillStart, Ability) == 0x000000, "Member 'SelfCheck_OnSkillStart_C_BindEventToSkillStart::Ability' has a wrong offset!");

// Function SelfCheck_OnSkillStart.SelfCheck_OnSkillStart_C.OnAbilityCastSkill
// 0x0020 (0x0020 - 0x0000)
struct SelfCheck_OnSkillStart_C_OnAbilityCastSkill final
{
public:
	int32                                         SkillID_0;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OriginSkills;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UGameAbilityComponent*                  AbilityRef;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SelfCheck_OnSkillStart_C_OnAbilityCastSkill) == 0x000008, "Wrong alignment on SelfCheck_OnSkillStart_C_OnAbilityCastSkill");
static_assert(sizeof(SelfCheck_OnSkillStart_C_OnAbilityCastSkill) == 0x000020, "Wrong size on SelfCheck_OnSkillStart_C_OnAbilityCastSkill");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnAbilityCastSkill, SkillID_0) == 0x000000, "Member 'SelfCheck_OnSkillStart_C_OnAbilityCastSkill::SkillID_0' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnAbilityCastSkill, OriginSkills) == 0x000008, "Member 'SelfCheck_OnSkillStart_C_OnAbilityCastSkill::OriginSkills' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnAbilityCastSkill, AbilityRef) == 0x000018, "Member 'SelfCheck_OnSkillStart_C_OnAbilityCastSkill::AbilityRef' has a wrong offset!");

// Function SelfCheck_OnSkillStart.SelfCheck_OnSkillStart_C.UnbindEventFromSkillStart
// 0x0008 (0x0008 - 0x0000)
struct SelfCheck_OnSkillStart_C_UnbindEventFromSkillStart final
{
public:
	const class UAbilityComponentBase*            Ability;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SelfCheck_OnSkillStart_C_UnbindEventFromSkillStart) == 0x000008, "Wrong alignment on SelfCheck_OnSkillStart_C_UnbindEventFromSkillStart");
static_assert(sizeof(SelfCheck_OnSkillStart_C_UnbindEventFromSkillStart) == 0x000008, "Wrong size on SelfCheck_OnSkillStart_C_UnbindEventFromSkillStart");
static_assert(offsetof(SelfCheck_OnSkillStart_C_UnbindEventFromSkillStart, Ability) == 0x000000, "Member 'SelfCheck_OnSkillStart_C_UnbindEventFromSkillStart::Ability' has a wrong offset!");

// Function SelfCheck_OnSkillStart.SelfCheck_OnSkillStart_C.BindEventToSkillEnd
// 0x0008 (0x0008 - 0x0000)
struct SelfCheck_OnSkillStart_C_BindEventToSkillEnd final
{
public:
	const class UAbilityComponentBase*            Abilitys;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SelfCheck_OnSkillStart_C_BindEventToSkillEnd) == 0x000008, "Wrong alignment on SelfCheck_OnSkillStart_C_BindEventToSkillEnd");
static_assert(sizeof(SelfCheck_OnSkillStart_C_BindEventToSkillEnd) == 0x000008, "Wrong size on SelfCheck_OnSkillStart_C_BindEventToSkillEnd");
static_assert(offsetof(SelfCheck_OnSkillStart_C_BindEventToSkillEnd, Abilitys) == 0x000000, "Member 'SelfCheck_OnSkillStart_C_BindEventToSkillEnd::Abilitys' has a wrong offset!");

// Function SelfCheck_OnSkillStart.SelfCheck_OnSkillStart_C.UnbindEventFromSkillEnd
// 0x0008 (0x0008 - 0x0000)
struct SelfCheck_OnSkillStart_C_UnbindEventFromSkillEnd final
{
public:
	const class UAbilityComponentBase*            Abilitys;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SelfCheck_OnSkillStart_C_UnbindEventFromSkillEnd) == 0x000008, "Wrong alignment on SelfCheck_OnSkillStart_C_UnbindEventFromSkillEnd");
static_assert(sizeof(SelfCheck_OnSkillStart_C_UnbindEventFromSkillEnd) == 0x000008, "Wrong size on SelfCheck_OnSkillStart_C_UnbindEventFromSkillEnd");
static_assert(offsetof(SelfCheck_OnSkillStart_C_UnbindEventFromSkillEnd, Abilitys) == 0x000000, "Member 'SelfCheck_OnSkillStart_C_UnbindEventFromSkillEnd::Abilitys' has a wrong offset!");

// Function SelfCheck_OnSkillStart.SelfCheck_OnSkillStart_C.OnSkillEnd
// 0x0020 (0x0020 - 0x0000)
struct SelfCheck_OnSkillStart_C_OnSkillEnd final
{
public:
	int32                                         SkillID_0;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OriginSkills;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UGameAbilityComponent*                  AbilityRef;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SelfCheck_OnSkillStart_C_OnSkillEnd) == 0x000008, "Wrong alignment on SelfCheck_OnSkillStart_C_OnSkillEnd");
static_assert(sizeof(SelfCheck_OnSkillStart_C_OnSkillEnd) == 0x000020, "Wrong size on SelfCheck_OnSkillStart_C_OnSkillEnd");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnSkillEnd, SkillID_0) == 0x000000, "Member 'SelfCheck_OnSkillStart_C_OnSkillEnd::SkillID_0' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnSkillEnd, OriginSkills) == 0x000008, "Member 'SelfCheck_OnSkillStart_C_OnSkillEnd::OriginSkills' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnSkillEnd, AbilityRef) == 0x000018, "Member 'SelfCheck_OnSkillStart_C_OnSkillEnd::AbilityRef' has a wrong offset!");

// Function SelfCheck_OnSkillStart.SelfCheck_OnSkillStart_C.BindEventToSkillSuccess
// 0x0008 (0x0008 - 0x0000)
struct SelfCheck_OnSkillStart_C_BindEventToSkillSuccess final
{
public:
	const class UAbilityComponentBase*            Abilitys;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SelfCheck_OnSkillStart_C_BindEventToSkillSuccess) == 0x000008, "Wrong alignment on SelfCheck_OnSkillStart_C_BindEventToSkillSuccess");
static_assert(sizeof(SelfCheck_OnSkillStart_C_BindEventToSkillSuccess) == 0x000008, "Wrong size on SelfCheck_OnSkillStart_C_BindEventToSkillSuccess");
static_assert(offsetof(SelfCheck_OnSkillStart_C_BindEventToSkillSuccess, Abilitys) == 0x000000, "Member 'SelfCheck_OnSkillStart_C_BindEventToSkillSuccess::Abilitys' has a wrong offset!");

// Function SelfCheck_OnSkillStart.SelfCheck_OnSkillStart_C.UnbindEventFromSkillSuccess
// 0x0008 (0x0008 - 0x0000)
struct SelfCheck_OnSkillStart_C_UnbindEventFromSkillSuccess final
{
public:
	const class UAbilityComponentBase*            Abilitys;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SelfCheck_OnSkillStart_C_UnbindEventFromSkillSuccess) == 0x000008, "Wrong alignment on SelfCheck_OnSkillStart_C_UnbindEventFromSkillSuccess");
static_assert(sizeof(SelfCheck_OnSkillStart_C_UnbindEventFromSkillSuccess) == 0x000008, "Wrong size on SelfCheck_OnSkillStart_C_UnbindEventFromSkillSuccess");
static_assert(offsetof(SelfCheck_OnSkillStart_C_UnbindEventFromSkillSuccess, Abilitys) == 0x000000, "Member 'SelfCheck_OnSkillStart_C_UnbindEventFromSkillSuccess::Abilitys' has a wrong offset!");

// Function SelfCheck_OnSkillStart.SelfCheck_OnSkillStart_C.OnAbilitySkillCastSuccess
// 0x0020 (0x0020 - 0x0000)
struct SelfCheck_OnSkillStart_C_OnAbilitySkillCastSuccess final
{
public:
	int32                                         SkillID_0;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OriginSkills;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UGameAbilityComponent*                  AbilityRef;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SelfCheck_OnSkillStart_C_OnAbilitySkillCastSuccess) == 0x000008, "Wrong alignment on SelfCheck_OnSkillStart_C_OnAbilitySkillCastSuccess");
static_assert(sizeof(SelfCheck_OnSkillStart_C_OnAbilitySkillCastSuccess) == 0x000020, "Wrong size on SelfCheck_OnSkillStart_C_OnAbilitySkillCastSuccess");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnAbilitySkillCastSuccess, SkillID_0) == 0x000000, "Member 'SelfCheck_OnSkillStart_C_OnAbilitySkillCastSuccess::SkillID_0' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnAbilitySkillCastSuccess, OriginSkills) == 0x000008, "Member 'SelfCheck_OnSkillStart_C_OnAbilitySkillCastSuccess::OriginSkills' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_OnAbilitySkillCastSuccess, AbilityRef) == 0x000018, "Member 'SelfCheck_OnSkillStart_C_OnAbilitySkillCastSuccess::AbilityRef' has a wrong offset!");

// Function SelfCheck_OnSkillStart.SelfCheck_OnSkillStart_C.K2_BindEvent
// 0x0010 (0x0010 - 0x0000)
struct SelfCheck_OnSkillStart_C_K2_BindEvent final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SelfCheck_OnSkillStart_C_K2_BindEvent) == 0x000008, "Wrong alignment on SelfCheck_OnSkillStart_C_K2_BindEvent");
static_assert(sizeof(SelfCheck_OnSkillStart_C_K2_BindEvent) == 0x000010, "Wrong size on SelfCheck_OnSkillStart_C_K2_BindEvent");
static_assert(offsetof(SelfCheck_OnSkillStart_C_K2_BindEvent, InCurLauncher) == 0x000000, "Member 'SelfCheck_OnSkillStart_C_K2_BindEvent::InCurLauncher' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_K2_BindEvent, InCurLauncherChara) == 0x000008, "Member 'SelfCheck_OnSkillStart_C_K2_BindEvent::InCurLauncherChara' has a wrong offset!");

// Function SelfCheck_OnSkillStart.SelfCheck_OnSkillStart_C.K2_UnbindEvent
// 0x0010 (0x0010 - 0x0000)
struct SelfCheck_OnSkillStart_C_K2_UnbindEvent final
{
public:
	class UAbilityComponentBase*                  InCurLauncher;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         InCurLauncherChara;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SelfCheck_OnSkillStart_C_K2_UnbindEvent) == 0x000008, "Wrong alignment on SelfCheck_OnSkillStart_C_K2_UnbindEvent");
static_assert(sizeof(SelfCheck_OnSkillStart_C_K2_UnbindEvent) == 0x000010, "Wrong size on SelfCheck_OnSkillStart_C_K2_UnbindEvent");
static_assert(offsetof(SelfCheck_OnSkillStart_C_K2_UnbindEvent, InCurLauncher) == 0x000000, "Member 'SelfCheck_OnSkillStart_C_K2_UnbindEvent::InCurLauncher' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_K2_UnbindEvent, InCurLauncherChara) == 0x000008, "Member 'SelfCheck_OnSkillStart_C_K2_UnbindEvent::InCurLauncherChara' has a wrong offset!");

// Function SelfCheck_OnSkillStart.SelfCheck_OnSkillStart_C.ExecuteUbergraph_SelfCheck_OnSkillStart
// 0x0130 (0x0130 - 0x0000)
struct SelfCheck_OnSkillStart_C_ExecuteUbergraph_SelfCheck_OnSkillStart final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SkillID, TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           CallFunc_GetParamTagValue_ReturnValue;             // 0x0014(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetParamintValue_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSkillClassType_ReturnValue;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SkillID, TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	const class UAbilityComponentBase*            K2Node_CustomEvent_Ability_1;                      // 0x0038(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SkillID_2;                      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_CustomEvent_OriginSkills_2;                 // 0x0048(0x0010)(ConstParm, ReferenceParm)
	class UGameAbilityComponent*                  K2Node_CustomEvent_AbilityRef_2;                   // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UAbilityComponentBase*            K2Node_CustomEvent_Ability;                        // 0x0060(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponentBase*                  K2Node_DynamicCast_AsAbility_Component_Base;       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UAbilityComponentBase*            K2Node_CustomEvent_Abilitys_3;                     // 0x0078(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UAbilityComponentBase*            K2Node_CustomEvent_Abilitys_2;                     // 0x0080(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SkillID_1;                      // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_CustomEvent_OriginSkills_1;                 // 0x0090(0x0010)(ConstParm, ReferenceParm)
	class UGameAbilityComponent*                  K2Node_CustomEvent_AbilityRef_1;                   // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponentBase*                  K2Node_DynamicCast_AsAbility_Component_Base_1;     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 SkillID, TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00B4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UAbilityComponentBase*            K2Node_CustomEvent_Abilitys_1;                     // 0x00C8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UAbilityComponentBase*            K2Node_CustomEvent_Abilitys;                       // 0x00D0(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SkillID;                        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_CustomEvent_OriginSkills;                   // 0x00E0(0x0010)(ConstParm, ReferenceParm)
	class UGameAbilityComponent*                  K2Node_CustomEvent_AbilityRef;                     // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponentBase*                  K2Node_DynamicCast_AsAbility_Component_Base_2;     // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckType3_bCheck;                        // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_Event_InCurLauncher_1;                      // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_InCurLauncherChara_1;                 // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponentBase*                  K2Node_Event_InCurLauncher;                        // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_InCurLauncherChara;                   // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SelfCheck_OnSkillStart_C_ExecuteUbergraph_SelfCheck_OnSkillStart) == 0x000008, "Wrong alignment on SelfCheck_OnSkillStart_C_ExecuteUbergraph_SelfCheck_OnSkillStart");
static_assert(sizeof(SelfCheck_OnSkillStart_C_ExecuteUbergraph_SelfCheck_OnSkillStart) == 0x000130, "Wrong size on SelfCheck_OnSkillStart_C_ExecuteUbergraph_SelfCheck_OnSkillStart");
static_assert(offsetof(SelfCheck_OnSkillStart_C_ExecuteUbergraph_SelfCheck_OnSkillStart, EntryPoint) == 0x000000, "Member 'SelfCheck_OnSkillStart_C_ExecuteUbergraph_SelfCheck_OnSkillStart::EntryPoint' has a wrong offset!");
static_assert(offsetof(SelfCheck_OnSkillStart_C_ExecuteUbergraph_SelfCheck_OnSkillStart, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'SelfCheck_OnSkillStart_C_ExecuteUbergraph_SelfCheck_OnSkillStart::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
