#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ServerOnlySkill

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ServerOnlySkill.ServerOnlySkill_C
// 0x0030 (0x0A30 - 0x0A00)
class AServerOnlySkill_C final : public AGameServerSkill
{
public:
	class USkillCostComponent*                    SkillCost;                                         // 0x0A00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillEmitterComponent*                 SkillEmitter;                                      // 0x0A08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillCDComponent*                      SkillCD;                                           // 0x0A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillSelectorComponent*                SkillSelector;                                     // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ServerOnlySkill_C">();
	}
	static class AServerOnlySkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AServerOnlySkill_C>();
	}
};
static_assert(alignof(AServerOnlySkill_C) == 0x000010, "Wrong alignment on AServerOnlySkill_C");
static_assert(sizeof(AServerOnlySkill_C) == 0x000A30, "Wrong size on AServerOnlySkill_C");
static_assert(offsetof(AServerOnlySkill_C, SkillCost) == 0x000A00, "Member 'AServerOnlySkill_C::SkillCost' has a wrong offset!");
static_assert(offsetof(AServerOnlySkill_C, SkillEmitter) == 0x000A08, "Member 'AServerOnlySkill_C::SkillEmitter' has a wrong offset!");
static_assert(offsetof(AServerOnlySkill_C, SkillCD) == 0x000A10, "Member 'AServerOnlySkill_C::SkillCD' has a wrong offset!");
static_assert(offsetof(AServerOnlySkill_C, SkillSelector) == 0x000A18, "Member 'AServerOnlySkill_C::SkillSelector' has a wrong offset!");
static_assert(offsetof(AServerOnlySkill_C, DefaultSceneRoot) == 0x000A20, "Member 'AServerOnlySkill_C::DefaultSceneRoot' has a wrong offset!");

}

