#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ServerOnlySkill

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ServerOnlySkill.ServerOnlySkill_C
// 0x0030 (0x0A30 - 0x0A00)
class AServerOnlySkill_C final : public AGameServerSkill
{
public:
	class USkillCostComponent*                    SkillCost;                                         // 0x0A00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillEmitterComponent*                 SkillEmitter;                                      // 0x0A08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillCDComponent*                      SkillCD;                                           // 0x0A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkillSelectorComponent*                SkillSelector;                                     // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ServerOnlySkill_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ServerOnlySkill_C")
	}
	static class AServerOnlySkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AServerOnlySkill_C>();
	}
};
DUMPER7_ASSERTS_AServerOnlySkill_C;

}

