#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SetAIControlParamsEvent

#include "Basic.hpp"

#include "GameTask_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SetAIControlParamsEvent.SetAIControlParamsEvent_C
// 0x0010 (0x0168 - 0x0158)
class USetAIControlParamsEvent_C final : public UGameTaskEvent
{
public:
	int32                                         AIControlParamsID;                                 // 0x0158(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Tag;                                               // 0x015C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayTime;                                         // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GetMonstersByTag(TArray<class AGameCharacter*>* Monsters1);
	bool OnTrigger();

	class FString GetSpecialStaticDescription() const;
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SetAIControlParamsEvent_C">();
	}
	static class USetAIControlParamsEvent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USetAIControlParamsEvent_C>();
	}
};
static_assert(alignof(USetAIControlParamsEvent_C) == 0x000008, "Wrong alignment on USetAIControlParamsEvent_C");
static_assert(sizeof(USetAIControlParamsEvent_C) == 0x000168, "Wrong size on USetAIControlParamsEvent_C");
static_assert(offsetof(USetAIControlParamsEvent_C, AIControlParamsID) == 0x000158, "Member 'USetAIControlParamsEvent_C::AIControlParamsID' has a wrong offset!");
static_assert(offsetof(USetAIControlParamsEvent_C, Tag) == 0x00015C, "Member 'USetAIControlParamsEvent_C::Tag' has a wrong offset!");
static_assert(offsetof(USetAIControlParamsEvent_C, DelayTime) == 0x000164, "Member 'USetAIControlParamsEvent_C::DelayTime' has a wrong offset!");

}

