#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SetAIEvent

#include "Basic.hpp"


namespace SDK::Params
{

// Function SetAIEvent.SetAIEvent_C.GetSpecialStaticDescription
// 0x00D0 (0x00D0 - 0x0000)
struct SetAIEvent_C_GetSpecialStaticDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue_1;        // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(SetAIEvent_C_GetSpecialStaticDescription) == 0x000008, "Wrong alignment on SetAIEvent_C_GetSpecialStaticDescription");
static_assert(sizeof(SetAIEvent_C_GetSpecialStaticDescription) == 0x0000D0, "Wrong size on SetAIEvent_C_GetSpecialStaticDescription");
static_assert(offsetof(SetAIEvent_C_GetSpecialStaticDescription, ReturnValue) == 0x000000, "Member 'SetAIEvent_C_GetSpecialStaticDescription::ReturnValue' has a wrong offset!");
static_assert(offsetof(SetAIEvent_C_GetSpecialStaticDescription, CallFunc_Conv_IntToString_ReturnValue) == 0x000010, "Member 'SetAIEvent_C_GetSpecialStaticDescription::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetAIEvent_C_GetSpecialStaticDescription, CallFunc_GetObjectClass_ReturnValue) == 0x000020, "Member 'SetAIEvent_C_GetSpecialStaticDescription::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetAIEvent_C_GetSpecialStaticDescription, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'SetAIEvent_C_GetSpecialStaticDescription::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetAIEvent_C_GetSpecialStaticDescription, CallFunc_GetClassDisplayName_ReturnValue) == 0x000030, "Member 'SetAIEvent_C_GetSpecialStaticDescription::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetAIEvent_C_GetSpecialStaticDescription, CallFunc_SelectString_ReturnValue) == 0x000040, "Member 'SetAIEvent_C_GetSpecialStaticDescription::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetAIEvent_C_GetSpecialStaticDescription, CallFunc_GetObjectClass_ReturnValue_1) == 0x000050, "Member 'SetAIEvent_C_GetSpecialStaticDescription::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SetAIEvent_C_GetSpecialStaticDescription, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'SetAIEvent_C_GetSpecialStaticDescription::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SetAIEvent_C_GetSpecialStaticDescription, CallFunc_GetClassDisplayName_ReturnValue_1) == 0x000060, "Member 'SetAIEvent_C_GetSpecialStaticDescription::CallFunc_GetClassDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SetAIEvent_C_GetSpecialStaticDescription, CallFunc_SelectString_ReturnValue_1) == 0x000070, "Member 'SetAIEvent_C_GetSpecialStaticDescription::CallFunc_SelectString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SetAIEvent_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue) == 0x000080, "Member 'SetAIEvent_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetAIEvent_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000090, "Member 'SetAIEvent_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SetAIEvent_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000A0, "Member 'SetAIEvent_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SetAIEvent_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000B0, "Member 'SetAIEvent_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SetAIEvent_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000C0, "Member 'SetAIEvent_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");

}

