#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SetLevelPathEnd

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "GameTask_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SetLevelPathEnd.SetLevelPathEnd_C
// 0x0048 (0x01A0 - 0x0158)
class USetLevelPathEnd_C final : public UGameTaskEvent
{
public:
	class FString                                 ActorName;                                         // 0x0158(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	ELevelPathEndType                             ____;                                              // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FXMove_Speed;                                      // 0x016C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ZOffset;                                           // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinLife;                                           // 0x0174(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxLife;                                           // 0x0178(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Check;                                             // 0x017C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MultiType;                                         // 0x0180(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MultiTag;                                          // 0x0188(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         ExtendLineTraceLength;                             // 0x0198(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Tolerance;                                         // 0x019C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool OnTrigger();
	void Select_Goal_Actor(class AActor** GoalActor);

	class FString GetSpecialStaticDescription() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SetLevelPathEnd_C">();
	}
	static class USetLevelPathEnd_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USetLevelPathEnd_C>();
	}
};
static_assert(alignof(USetLevelPathEnd_C) == 0x000008, "Wrong alignment on USetLevelPathEnd_C");
static_assert(sizeof(USetLevelPathEnd_C) == 0x0001A0, "Wrong size on USetLevelPathEnd_C");
static_assert(offsetof(USetLevelPathEnd_C, ActorName) == 0x000158, "Member 'USetLevelPathEnd_C::ActorName' has a wrong offset!");
static_assert(offsetof(USetLevelPathEnd_C, ____) == 0x000168, "Member 'USetLevelPathEnd_C::____' has a wrong offset!");
static_assert(offsetof(USetLevelPathEnd_C, FXMove_Speed) == 0x00016C, "Member 'USetLevelPathEnd_C::FXMove_Speed' has a wrong offset!");
static_assert(offsetof(USetLevelPathEnd_C, ZOffset) == 0x000170, "Member 'USetLevelPathEnd_C::ZOffset' has a wrong offset!");
static_assert(offsetof(USetLevelPathEnd_C, MinLife) == 0x000174, "Member 'USetLevelPathEnd_C::MinLife' has a wrong offset!");
static_assert(offsetof(USetLevelPathEnd_C, MaxLife) == 0x000178, "Member 'USetLevelPathEnd_C::MaxLife' has a wrong offset!");
static_assert(offsetof(USetLevelPathEnd_C, Check) == 0x00017C, "Member 'USetLevelPathEnd_C::Check' has a wrong offset!");
static_assert(offsetof(USetLevelPathEnd_C, MultiType) == 0x000180, "Member 'USetLevelPathEnd_C::MultiType' has a wrong offset!");
static_assert(offsetof(USetLevelPathEnd_C, MultiTag) == 0x000188, "Member 'USetLevelPathEnd_C::MultiTag' has a wrong offset!");
static_assert(offsetof(USetLevelPathEnd_C, ExtendLineTraceLength) == 0x000198, "Member 'USetLevelPathEnd_C::ExtendLineTraceLength' has a wrong offset!");
static_assert(offsetof(USetLevelPathEnd_C, Tolerance) == 0x00019C, "Member 'USetLevelPathEnd_C::Tolerance' has a wrong offset!");

}

