#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShieldRecover

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function ShieldRecover.ShieldRecover_C.K2_ReceiveActive
// 0x0008 (0x0008 - 0x0000)
struct ShieldRecover_C_K2_ReceiveActive final
{
public:
	const class UObject*                          Instigator;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShieldRecover_C_K2_ReceiveActive) == 0x000008, "Wrong alignment on ShieldRecover_C_K2_ReceiveActive");
static_assert(sizeof(ShieldRecover_C_K2_ReceiveActive) == 0x000008, "Wrong size on ShieldRecover_C_K2_ReceiveActive");
static_assert(offsetof(ShieldRecover_C_K2_ReceiveActive, Instigator) == 0x000000, "Member 'ShieldRecover_C_K2_ReceiveActive::Instigator' has a wrong offset!");

// Function ShieldRecover.ShieldRecover_C.ExecuteUbergraph_ShieldRecover
// 0x00E8 (0x00E8 - 0x0000)
struct ShieldRecover_C_ExecuteUbergraph_ShieldRecover final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UObject*                          K2Node_Event_Instigator;                           // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponentBase*                  K2Node_DynamicCast_AsAbility_Component_Base;       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharacterCardGrowTemplate             CallFunc_K2_GetCardGrowTemplateData_ReturnValue;   // 0x0028(0x00B8)()
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShieldRecover_C_ExecuteUbergraph_ShieldRecover) == 0x000008, "Wrong alignment on ShieldRecover_C_ExecuteUbergraph_ShieldRecover");
static_assert(sizeof(ShieldRecover_C_ExecuteUbergraph_ShieldRecover) == 0x0000E8, "Wrong size on ShieldRecover_C_ExecuteUbergraph_ShieldRecover");
static_assert(offsetof(ShieldRecover_C_ExecuteUbergraph_ShieldRecover, EntryPoint) == 0x000000, "Member 'ShieldRecover_C_ExecuteUbergraph_ShieldRecover::EntryPoint' has a wrong offset!");
static_assert(offsetof(ShieldRecover_C_ExecuteUbergraph_ShieldRecover, CallFunc_GetOuterObject_ReturnValue) == 0x000008, "Member 'ShieldRecover_C_ExecuteUbergraph_ShieldRecover::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldRecover_C_ExecuteUbergraph_ShieldRecover, K2Node_Event_Instigator) == 0x000010, "Member 'ShieldRecover_C_ExecuteUbergraph_ShieldRecover::K2Node_Event_Instigator' has a wrong offset!");
static_assert(offsetof(ShieldRecover_C_ExecuteUbergraph_ShieldRecover, K2Node_DynamicCast_AsAbility_Component_Base) == 0x000018, "Member 'ShieldRecover_C_ExecuteUbergraph_ShieldRecover::K2Node_DynamicCast_AsAbility_Component_Base' has a wrong offset!");
static_assert(offsetof(ShieldRecover_C_ExecuteUbergraph_ShieldRecover, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ShieldRecover_C_ExecuteUbergraph_ShieldRecover::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ShieldRecover_C_ExecuteUbergraph_ShieldRecover, CallFunc_K2_GetCardGrowTemplateData_ReturnValue) == 0x000028, "Member 'ShieldRecover_C_ExecuteUbergraph_ShieldRecover::CallFunc_K2_GetCardGrowTemplateData_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldRecover_C_ExecuteUbergraph_ShieldRecover, CallFunc_Multiply_IntFloat_ReturnValue) == 0x0000E0, "Member 'ShieldRecover_C_ExecuteUbergraph_ShieldRecover::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");

}

