#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Six20504_1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function 620504_1.620504_1_C.OnSpawnSpecialEffect__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct Six20504_1_C_OnSpawnSpecialEffect__DelegateSignature final
{
public:
	struct FTransform                             Trans;                                             // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Six20504_1_C_OnSpawnSpecialEffect__DelegateSignature) == 0x000010, "Wrong alignment on Six20504_1_C_OnSpawnSpecialEffect__DelegateSignature");
static_assert(sizeof(Six20504_1_C_OnSpawnSpecialEffect__DelegateSignature) == 0x000030, "Wrong size on Six20504_1_C_OnSpawnSpecialEffect__DelegateSignature");
static_assert(offsetof(Six20504_1_C_OnSpawnSpecialEffect__DelegateSignature, Trans) == 0x000000, "Member 'Six20504_1_C_OnSpawnSpecialEffect__DelegateSignature::Trans' has a wrong offset!");

// Function 620504_1.620504_1_C.ExecuteUbergraph_620504_1
// 0x0060 (0x0060 - 0x0000)
struct Six20504_1_C_ExecuteUbergraph_620504_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Speed;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Gravity;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseComponent*                        CallFunc_PostEventAttachedActor_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Six20504_1_C_ExecuteUbergraph_620504_1) == 0x000010, "Wrong alignment on Six20504_1_C_ExecuteUbergraph_620504_1");
static_assert(sizeof(Six20504_1_C_ExecuteUbergraph_620504_1) == 0x000060, "Wrong size on Six20504_1_C_ExecuteUbergraph_620504_1");
static_assert(offsetof(Six20504_1_C_ExecuteUbergraph_620504_1, EntryPoint) == 0x000000, "Member 'Six20504_1_C_ExecuteUbergraph_620504_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(Six20504_1_C_ExecuteUbergraph_620504_1, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'Six20504_1_C_ExecuteUbergraph_620504_1::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Six20504_1_C_ExecuteUbergraph_620504_1, K2Node_Event_OtherActor) == 0x000008, "Member 'Six20504_1_C_ExecuteUbergraph_620504_1::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(Six20504_1_C_ExecuteUbergraph_620504_1, K2Node_CustomEvent_Speed) == 0x000010, "Member 'Six20504_1_C_ExecuteUbergraph_620504_1::K2Node_CustomEvent_Speed' has a wrong offset!");
static_assert(offsetof(Six20504_1_C_ExecuteUbergraph_620504_1, K2Node_CustomEvent_Gravity) == 0x000014, "Member 'Six20504_1_C_ExecuteUbergraph_620504_1::K2Node_CustomEvent_Gravity' has a wrong offset!");
static_assert(offsetof(Six20504_1_C_ExecuteUbergraph_620504_1, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'Six20504_1_C_ExecuteUbergraph_620504_1::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Six20504_1_C_ExecuteUbergraph_620504_1, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'Six20504_1_C_ExecuteUbergraph_620504_1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Six20504_1_C_ExecuteUbergraph_620504_1, CallFunc_PostEventAttachedActor_ReturnValue) == 0x000020, "Member 'Six20504_1_C_ExecuteUbergraph_620504_1::CallFunc_PostEventAttachedActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Six20504_1_C_ExecuteUbergraph_620504_1, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'Six20504_1_C_ExecuteUbergraph_620504_1::CallFunc_GetTransform_ReturnValue' has a wrong offset!");

// Function 620504_1.620504_1_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Six20504_1_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Six20504_1_C_ReceiveTick) == 0x000004, "Wrong alignment on Six20504_1_C_ReceiveTick");
static_assert(sizeof(Six20504_1_C_ReceiveTick) == 0x000004, "Wrong size on Six20504_1_C_ReceiveTick");
static_assert(offsetof(Six20504_1_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Six20504_1_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function 620504_1.620504_1_C.move1
// 0x0008 (0x0008 - 0x0000)
struct Six20504_1_C_Move1 final
{
public:
	float                                         Speed;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Gravity;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Six20504_1_C_Move1) == 0x000004, "Wrong alignment on Six20504_1_C_Move1");
static_assert(sizeof(Six20504_1_C_Move1) == 0x000008, "Wrong size on Six20504_1_C_Move1");
static_assert(offsetof(Six20504_1_C_Move1, Speed) == 0x000000, "Member 'Six20504_1_C_Move1::Speed' has a wrong offset!");
static_assert(offsetof(Six20504_1_C_Move1, Gravity) == 0x000004, "Member 'Six20504_1_C_Move1::Gravity' has a wrong offset!");

// Function 620504_1.620504_1_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct Six20504_1_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Six20504_1_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on Six20504_1_C_ReceiveActorBeginOverlap");
static_assert(sizeof(Six20504_1_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on Six20504_1_C_ReceiveActorBeginOverlap");
static_assert(offsetof(Six20504_1_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'Six20504_1_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

}

