#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Six20504_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass 620504_1.620504_1_C
// 0x0030 (0x0A00 - 0x09D0)
class ASix20504_1_C final : public ABullet
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Row;                                               // 0x09D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Y__Pitch_;                                         // 0x09DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Z__Yaw_;                                           // 0x09E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Z_Change;                                          // 0x09E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnSpawnSpecialEffect;                              // 0x09E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnSpawnSpecialEffect__DelegateSignature(const struct FTransform& Trans);
	void ExecuteUbergraph_620504_1(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void Move1(float Speed, float Gravity);
	void ReceiveBulletFire();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"620504_1_C">();
	}
	static class ASix20504_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASix20504_1_C>();
	}
};
static_assert(alignof(ASix20504_1_C) == 0x000010, "Wrong alignment on ASix20504_1_C");
static_assert(sizeof(ASix20504_1_C) == 0x000A00, "Wrong size on ASix20504_1_C");
static_assert(offsetof(ASix20504_1_C, UberGraphFrame) == 0x0009D0, "Member 'ASix20504_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASix20504_1_C, Row) == 0x0009D8, "Member 'ASix20504_1_C::Row' has a wrong offset!");
static_assert(offsetof(ASix20504_1_C, Y__Pitch_) == 0x0009DC, "Member 'ASix20504_1_C::Y__Pitch_' has a wrong offset!");
static_assert(offsetof(ASix20504_1_C, Z__Yaw_) == 0x0009E0, "Member 'ASix20504_1_C::Z__Yaw_' has a wrong offset!");
static_assert(offsetof(ASix20504_1_C, Z_Change) == 0x0009E4, "Member 'ASix20504_1_C::Z_Change' has a wrong offset!");
static_assert(offsetof(ASix20504_1_C, OnSpawnSpecialEffect) == 0x0009E8, "Member 'ASix20504_1_C::OnSpawnSpecialEffect' has a wrong offset!");

}

