#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sk10_01_bp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function sk10_01_bp.sk10_01_bp_C.SetCloudAndSkySun
// 0x00B0 (0x00B0 - 0x0000)
struct Sk10_01_bp_C_SetCloudAndSkySun final
{
public:
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_1;    // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_2;    // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_3;    // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_4;    // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_5;    // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_6;    // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_7;    // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_8;    // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_9;    // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sk10_01_bp_C_SetCloudAndSkySun) == 0x000004, "Wrong alignment on Sk10_01_bp_C_SetCloudAndSkySun");
static_assert(sizeof(Sk10_01_bp_C_SetCloudAndSkySun) == 0x0000B0, "Wrong size on Sk10_01_bp_C_SetCloudAndSkySun");
static_assert(offsetof(Sk10_01_bp_C_SetCloudAndSkySun, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000000, "Member 'Sk10_01_bp_C_SetCloudAndSkySun::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_SetCloudAndSkySun, CallFunc_Conv_ColorToLinearColor_ReturnValue_1) == 0x000010, "Member 'Sk10_01_bp_C_SetCloudAndSkySun::CallFunc_Conv_ColorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_SetCloudAndSkySun, CallFunc_Conv_ColorToLinearColor_ReturnValue_2) == 0x000020, "Member 'Sk10_01_bp_C_SetCloudAndSkySun::CallFunc_Conv_ColorToLinearColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_SetCloudAndSkySun, CallFunc_Conv_ColorToLinearColor_ReturnValue_3) == 0x000030, "Member 'Sk10_01_bp_C_SetCloudAndSkySun::CallFunc_Conv_ColorToLinearColor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_SetCloudAndSkySun, CallFunc_Conv_ColorToLinearColor_ReturnValue_4) == 0x000040, "Member 'Sk10_01_bp_C_SetCloudAndSkySun::CallFunc_Conv_ColorToLinearColor_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_SetCloudAndSkySun, CallFunc_Conv_ColorToLinearColor_ReturnValue_5) == 0x000050, "Member 'Sk10_01_bp_C_SetCloudAndSkySun::CallFunc_Conv_ColorToLinearColor_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_SetCloudAndSkySun, CallFunc_Conv_ColorToLinearColor_ReturnValue_6) == 0x000060, "Member 'Sk10_01_bp_C_SetCloudAndSkySun::CallFunc_Conv_ColorToLinearColor_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_SetCloudAndSkySun, CallFunc_Conv_ColorToLinearColor_ReturnValue_7) == 0x000070, "Member 'Sk10_01_bp_C_SetCloudAndSkySun::CallFunc_Conv_ColorToLinearColor_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_SetCloudAndSkySun, CallFunc_Conv_ColorToLinearColor_ReturnValue_8) == 0x000080, "Member 'Sk10_01_bp_C_SetCloudAndSkySun::CallFunc_Conv_ColorToLinearColor_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_SetCloudAndSkySun, CallFunc_Conv_ColorToLinearColor_ReturnValue_9) == 0x000090, "Member 'Sk10_01_bp_C_SetCloudAndSkySun::CallFunc_Conv_ColorToLinearColor_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_SetCloudAndSkySun, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000A0, "Member 'Sk10_01_bp_C_SetCloudAndSkySun::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_SetCloudAndSkySun, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000A4, "Member 'Sk10_01_bp_C_SetCloudAndSkySun::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_SetCloudAndSkySun, CallFunc_Abs_ReturnValue) == 0x0000A8, "Member 'Sk10_01_bp_C_SetCloudAndSkySun::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_SetCloudAndSkySun, CallFunc_SelectFloat_ReturnValue) == 0x0000AC, "Member 'Sk10_01_bp_C_SetCloudAndSkySun::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");

// Function sk10_01_bp.sk10_01_bp_C.SetSkyColorFromSunHeight
// 0x0038 (0x0038 - 0x0000)
struct Sk10_01_bp_C_SetSkyColorFromSunHeight final
{
public:
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetClampedLinearColorValue_ReturnValue;   // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetClampedLinearColorValue_ReturnValue_1; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetClampedLinearColorValue_ReturnValue_2; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sk10_01_bp_C_SetSkyColorFromSunHeight) == 0x000004, "Wrong alignment on Sk10_01_bp_C_SetSkyColorFromSunHeight");
static_assert(sizeof(Sk10_01_bp_C_SetSkyColorFromSunHeight) == 0x000038, "Wrong size on Sk10_01_bp_C_SetSkyColorFromSunHeight");
static_assert(offsetof(Sk10_01_bp_C_SetSkyColorFromSunHeight, CallFunc_Abs_ReturnValue) == 0x000000, "Member 'Sk10_01_bp_C_SetSkyColorFromSunHeight::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_SetSkyColorFromSunHeight, CallFunc_GetClampedLinearColorValue_ReturnValue) == 0x000004, "Member 'Sk10_01_bp_C_SetSkyColorFromSunHeight::CallFunc_GetClampedLinearColorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_SetSkyColorFromSunHeight, CallFunc_Lerp_ReturnValue) == 0x000014, "Member 'Sk10_01_bp_C_SetSkyColorFromSunHeight::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_SetSkyColorFromSunHeight, CallFunc_GetClampedLinearColorValue_ReturnValue_1) == 0x000018, "Member 'Sk10_01_bp_C_SetSkyColorFromSunHeight::CallFunc_GetClampedLinearColorValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_SetSkyColorFromSunHeight, CallFunc_GetClampedLinearColorValue_ReturnValue_2) == 0x000028, "Member 'Sk10_01_bp_C_SetSkyColorFromSunHeight::CallFunc_GetClampedLinearColorValue_ReturnValue_2' has a wrong offset!");

// Function sk10_01_bp.sk10_01_bp_C.NoneDirectionalAndSunSky
// 0x005C (0x005C - 0x0000)
struct Sk10_01_bp_C_NoneDirectionalAndSunSky final
{
public:
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sk10_01_bp_C_NoneDirectionalAndSunSky) == 0x000004, "Wrong alignment on Sk10_01_bp_C_NoneDirectionalAndSunSky");
static_assert(sizeof(Sk10_01_bp_C_NoneDirectionalAndSunSky) == 0x00005C, "Wrong size on Sk10_01_bp_C_NoneDirectionalAndSunSky");
static_assert(offsetof(Sk10_01_bp_C_NoneDirectionalAndSunSky, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000000, "Member 'Sk10_01_bp_C_NoneDirectionalAndSunSky::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_NoneDirectionalAndSunSky, CallFunc_MapRangeUnclamped_ReturnValue) == 0x00000C, "Member 'Sk10_01_bp_C_NoneDirectionalAndSunSky::CallFunc_MapRangeUnclamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_NoneDirectionalAndSunSky, CallFunc_BreakRotator_Roll) == 0x000010, "Member 'Sk10_01_bp_C_NoneDirectionalAndSunSky::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_NoneDirectionalAndSunSky, CallFunc_BreakRotator_Pitch) == 0x000014, "Member 'Sk10_01_bp_C_NoneDirectionalAndSunSky::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_NoneDirectionalAndSunSky, CallFunc_BreakRotator_Yaw) == 0x000018, "Member 'Sk10_01_bp_C_NoneDirectionalAndSunSky::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_NoneDirectionalAndSunSky, CallFunc_MakeRotator_ReturnValue) == 0x00001C, "Member 'Sk10_01_bp_C_NoneDirectionalAndSunSky::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_NoneDirectionalAndSunSky, CallFunc_Add_FloatFloat_ReturnValue) == 0x000028, "Member 'Sk10_01_bp_C_NoneDirectionalAndSunSky::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_NoneDirectionalAndSunSky, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x00002C, "Member 'Sk10_01_bp_C_NoneDirectionalAndSunSky::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_NoneDirectionalAndSunSky, CallFunc_FClamp_ReturnValue) == 0x000038, "Member 'Sk10_01_bp_C_NoneDirectionalAndSunSky::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_NoneDirectionalAndSunSky, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x00003C, "Member 'Sk10_01_bp_C_NoneDirectionalAndSunSky::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_NoneDirectionalAndSunSky, CallFunc_LinearColorLerp_ReturnValue) == 0x00004C, "Member 'Sk10_01_bp_C_NoneDirectionalAndSunSky::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");

// Function sk10_01_bp.sk10_01_bp_C.RefreshSkyMatFromSunSky
// 0x0074 (0x0074 - 0x0000)
struct Sk10_01_bp_C_RefreshSkyMatFromSunSky final
{
public:
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_2;   // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sk10_01_bp_C_RefreshSkyMatFromSunSky) == 0x000004, "Wrong alignment on Sk10_01_bp_C_RefreshSkyMatFromSunSky");
static_assert(sizeof(Sk10_01_bp_C_RefreshSkyMatFromSunSky) == 0x000074, "Wrong size on Sk10_01_bp_C_RefreshSkyMatFromSunSky");
static_assert(offsetof(Sk10_01_bp_C_RefreshSkyMatFromSunSky, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000000, "Member 'Sk10_01_bp_C_RefreshSkyMatFromSunSky::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_RefreshSkyMatFromSunSky, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000010, "Member 'Sk10_01_bp_C_RefreshSkyMatFromSunSky::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_RefreshSkyMatFromSunSky, CallFunc_GetForwardVector_ReturnValue) == 0x00001C, "Member 'Sk10_01_bp_C_RefreshSkyMatFromSunSky::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_RefreshSkyMatFromSunSky, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'Sk10_01_bp_C_RefreshSkyMatFromSunSky::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_RefreshSkyMatFromSunSky, CallFunc_Conv_VectorToLinearColor_ReturnValue_1) == 0x00002C, "Member 'Sk10_01_bp_C_RefreshSkyMatFromSunSky::CallFunc_Conv_VectorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_RefreshSkyMatFromSunSky, CallFunc_K2_GetComponentRotation_ReturnValue_1) == 0x00003C, "Member 'Sk10_01_bp_C_RefreshSkyMatFromSunSky::CallFunc_K2_GetComponentRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_RefreshSkyMatFromSunSky, CallFunc_BreakRotator_Roll) == 0x000048, "Member 'Sk10_01_bp_C_RefreshSkyMatFromSunSky::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_RefreshSkyMatFromSunSky, CallFunc_BreakRotator_Pitch) == 0x00004C, "Member 'Sk10_01_bp_C_RefreshSkyMatFromSunSky::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_RefreshSkyMatFromSunSky, CallFunc_BreakRotator_Yaw) == 0x000050, "Member 'Sk10_01_bp_C_RefreshSkyMatFromSunSky::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_RefreshSkyMatFromSunSky, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000054, "Member 'Sk10_01_bp_C_RefreshSkyMatFromSunSky::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_RefreshSkyMatFromSunSky, CallFunc_MapRangeUnclamped_ReturnValue) == 0x000060, "Member 'Sk10_01_bp_C_RefreshSkyMatFromSunSky::CallFunc_MapRangeUnclamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_RefreshSkyMatFromSunSky, CallFunc_Conv_VectorToLinearColor_ReturnValue_2) == 0x000064, "Member 'Sk10_01_bp_C_RefreshSkyMatFromSunSky::CallFunc_Conv_VectorToLinearColor_ReturnValue_2' has a wrong offset!");

// Function sk10_01_bp.sk10_01_bp_C.RefreshSkyMatFromDirectionalLight
// 0x0074 (0x0074 - 0x0000)
struct Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight final
{
public:
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_2;   // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight) == 0x000004, "Wrong alignment on Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight");
static_assert(sizeof(Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight) == 0x000074, "Wrong size on Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight");
static_assert(offsetof(Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000000, "Member 'Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight, CallFunc_GetForwardVector_ReturnValue) == 0x00000C, "Member 'Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000018, "Member 'Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight, CallFunc_Conv_VectorToLinearColor_ReturnValue_1) == 0x000028, "Member 'Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight::CallFunc_Conv_VectorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x00003C, "Member 'Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight, CallFunc_BreakRotator_Roll) == 0x000048, "Member 'Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight, CallFunc_BreakRotator_Pitch) == 0x00004C, "Member 'Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight, CallFunc_BreakRotator_Yaw) == 0x000050, "Member 'Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000054, "Member 'Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight, CallFunc_MapRangeUnclamped_ReturnValue) == 0x000060, "Member 'Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight::CallFunc_MapRangeUnclamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight, CallFunc_Conv_VectorToLinearColor_ReturnValue_2) == 0x000064, "Member 'Sk10_01_bp_C_RefreshSkyMatFromDirectionalLight::CallFunc_Conv_VectorToLinearColor_ReturnValue_2' has a wrong offset!");

// Function sk10_01_bp.sk10_01_bp_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct Sk10_01_bp_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sk10_01_bp_C_UserConstructionScript) == 0x000008, "Wrong alignment on Sk10_01_bp_C_UserConstructionScript");
static_assert(sizeof(Sk10_01_bp_C_UserConstructionScript) == 0x000008, "Wrong size on Sk10_01_bp_C_UserConstructionScript");
static_assert(offsetof(Sk10_01_bp_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'Sk10_01_bp_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function sk10_01_bp.sk10_01_bp_C.ê)b
// 0x0010 (0x0010 - 0x0000)
struct Sk10_01_bp_C____b final
{
public:
	struct FLinearColor                           TS_r_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sk10_01_bp_C____b) == 0x000004, "Wrong alignment on Sk10_01_bp_C____b");
static_assert(sizeof(Sk10_01_bp_C____b) == 0x000010, "Wrong size on Sk10_01_bp_C____b");
static_assert(offsetof(Sk10_01_bp_C____b, TS_r_0) == 0x000000, "Member 'Sk10_01_bp_C____b::TS_r_0' has a wrong offset!");

// Function sk10_01_bp.sk10_01_bp_C.ExecuteUbergraph_sk10_01_bp
// 0x0014 (0x0014 - 0x0000)
struct Sk10_01_bp_C_ExecuteUbergraph_sk10_01_bp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_____;                           // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sk10_01_bp_C_ExecuteUbergraph_sk10_01_bp) == 0x000004, "Wrong alignment on Sk10_01_bp_C_ExecuteUbergraph_sk10_01_bp");
static_assert(sizeof(Sk10_01_bp_C_ExecuteUbergraph_sk10_01_bp) == 0x000014, "Wrong size on Sk10_01_bp_C_ExecuteUbergraph_sk10_01_bp");
static_assert(offsetof(Sk10_01_bp_C_ExecuteUbergraph_sk10_01_bp, EntryPoint) == 0x000000, "Member 'Sk10_01_bp_C_ExecuteUbergraph_sk10_01_bp::EntryPoint' has a wrong offset!");
static_assert(offsetof(Sk10_01_bp_C_ExecuteUbergraph_sk10_01_bp, K2Node_CustomEvent_____) == 0x000004, "Member 'Sk10_01_bp_C_ExecuteUbergraph_sk10_01_bp::K2Node_CustomEvent_____' has a wrong offset!");

}

