#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkillSelectorBase

#include "Basic.hpp"

#include "Game_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass SkillSelectorBase.SkillSelectorBase_C
// 0x0070 (0x04F0 - 0x0480)
class ASkillSelectorBase_C : public ASkillSelector
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bNeedCancle;                                       // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491[0x3];                                      // 0x0491(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TargetLocation;                                    // 0x0494(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CurrentLockTarget;                                 // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset;                                            // 0x04A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              InputOffset;                                       // 0x04B4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MovePosition;                                      // 0x04BC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MoveRelative;                                      // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MappingMovePosition;                               // 0x04D0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impact_Point;                                      // 0x04DC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AimTraceOffset;                                    // 0x04E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ProjectToFeetLoc(const struct FVector& Value, struct FVector* Result);
	void FindFeetPoint();
	void MappingAttachToTarget();
	void FindFreeSelectorInitialLocation();
	void ProjectToGroundLoc(const struct FVector& Value, struct FVector* Result);
	void FindAutoAimTargetPoint();
	void FindCloestTarget(class AActor** LockTarget);
	void CalcParabolaLandPoint(const struct FVector& TargetLoc);
	void DrawParabola(const struct FVector& TargetLoc);
	void ReceiveTick(float DeltaSeconds);
	void OnReceiveInput(const struct FVector2D& Para, bool bDirection);
	void ExecuteUbergraph_SkillSelectorBase(int32 EntryPoint);
	void Reload_Can_Interrupt(class UAbilityComponent* InAbility, int32 CurSkillID, int32 NewSkillId, bool* bCanInterrupt);
	void FindCameraAimTargetPoint();
	void IsLockTargetValid(bool* IsValid);
	void FindFreeSelectorTargetPoint(float DeltaTime);
	void FindAreaMappingPoint();
	void ClampPointInRange(const struct FVector& TargetLocation_0, struct FVector* Result);
	void CalcParabolaPath(const struct FVector& TargetLoc);
	void ReceiveBeginPlay();
	void OnCastSkill(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void OnReceiveFinish();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SkillSelectorBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SkillSelectorBase_C")
	}
	static class ASkillSelectorBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASkillSelectorBase_C>();
	}
};
DUMPER7_ASSERTS_ASkillSelectorBase_C;

}

