#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkillSelector_LieTu_NormalSkill01

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SkillSelectorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SkillSelector_LieTu_NormalSkill01.SkillSelector_LieTu_NormalSkill01_C
// 0x0100 (0x05F0 - 0x04F0)
#pragma pack(push, 0x1)
class alignas(0x10) ASkillSelector_LieTu_NormalSkill01_C : public ASkillSelectorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_SkillSelector_LieTu_NormalSkill01_C; // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AGamePlayerController*                  PlayerController;                                  // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ViewportSize;                                      // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FBoneResult, class UFightModifierSpecialSignaItem*> TargetUIs;                       // 0x0508(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FSoftClassPath                         UIPath;                                            // 0x0558(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class AGameCharacter*>                 AllTarget;                                         // 0x0570(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AGameCharacter*>                 TmpTgarget;                                        // 0x0580(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         MaxTargetCountPerSearch;                           // 0x0590(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Tick_Interval;                                     // 0x0594(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBoneResult>                    AllPartResults;                                    // 0x0598(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         MaxTargetCount;                                    // 0x05A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ViewScaleXRange;                                   // 0x05AC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ViewScaleYRange;                                   // 0x05B4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxDistance;                                       // 0x05BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayTickTime;                                     // 0x05C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C4[0x4];                                      // 0x05C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         OrgUIPath;                                         // 0x05C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UFightModifierSpecialSignaItem*         TargetUI;                                          // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GetPartitionMainPart(const struct FBoneResult& PartitionResult, bool* IsValid, struct FBoneResult* BoneResult);
	void ReceiveDestroyed();
	void ReceiveTick(float DeltaSeconds);
	void GetPartMainBone(const struct FBoneResult& PartResult, bool* IsValid, struct FBoneResult* BoneResult, class AGameCharacter** GameCharacter);
	void GetAllTargetWithWeakResults(TArray<struct FBoneResult>* NewResults);
	void ReceiveBeginPlay();
	void GetAllQueryResults(TArray<struct FQueryResult>* OutResults);
	void GetPartitionMainBone(const struct FBoneResult& PartitionResult, bool* IsValid, struct FBoneResult* BoneResult, class AGameCharacter** GameCharacter);
	void GetPartMainBone__Overridden(const struct FBoneResult& PartResult, bool* IsValid, struct FBoneResult* BoneResult, class AGameCharacter** GameCharacter);
	TArray<struct FSoftObjectPath> OnGetAssetPath(int32 InId, TArray<int32>& CharacterIDs, TArray<int32>& SkillIDs);
	void GetRemainSelectTargetCount(int32* Count);
	void RemoveOutOfViewTarget();
	void TriggerUIEvent(const struct FBoneResult& Target, class FName EventName);
	void GetSortedPartitions(class AGameCharacter* GameCharacter, TArray<struct FBoneResult>* OutPartitions);
	void GetSortedGameCharacters(TArray<class AGameCharacter*>* OutCharacters);
	void GetPartitionMainPart__Overridden(const struct FBoneResult& PartitionResult, bool* IsValid, struct FBoneResult* BoneResult);
	void GetPartitionMainBone__Overridden(const struct FBoneResult& PartitionResult, bool* IsValid, struct FBoneResult* BoneResult, class AGameCharacter** GameCharacter);
	void GetAllQueryResults__Overridden(TArray<struct FQueryResult>* OutResults);
	void ShowUI(const struct FBoneResult& Part, bool bShow);
	void CheckTargetInView(class AGameCharacter* InTarget, const struct FBoneResult& BoneResult, bool* bInView);
	void GetAllTargetWithWeakResults__Overridden(TArray<struct FBoneResult>* NewResults);
	void ReceiveDestroyed__Overridden();
	void OnReceiveFinish();
	void ReceiveTick__Overridden(float DeltaSeconds);
	void ReceiveBeginPlay__Overridden();
	void ExecuteUbergraph_SkillSelector_LieTu_NormalSkill01(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SkillSelector_LieTu_NormalSkill01_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SkillSelector_LieTu_NormalSkill01_C")
	}
	static class ASkillSelector_LieTu_NormalSkill01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASkillSelector_LieTu_NormalSkill01_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ASkillSelector_LieTu_NormalSkill01_C;

}

