#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkillSelector_LieTu_NormalSkill01

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// LuaFunction SkillSelector_LieTu_NormalSkill01.SkillSelector_LieTu_NormalSkill01_C.GetPartitionMainPart
// 0x0058 (0x0058 - 0x0000)
struct SkillSelector_LieTu_NormalSkill01_C_GetPartitionMainPart final
{
public:
	struct FBoneResult                            PartitionResult;                                   // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          IsValid;                                           // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneResult                            BoneResult;                                        // 0x0030(0x0028)(Parm, OutParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SkillSelector_LieTu_NormalSkill01_C_GetPartitionMainPart;

// LuaFunction SkillSelector_LieTu_NormalSkill01.SkillSelector_LieTu_NormalSkill01_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct SkillSelector_LieTu_NormalSkill01_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SkillSelector_LieTu_NormalSkill01_C_ReceiveTick;

// Function SkillSelector_LieTu_NormalSkill01.SkillSelector_LieTu_NormalSkill01_C.TriggerUIEvent
// 0x0078 (0x0078 - 0x0000)
struct SkillSelector_LieTu_NormalSkill01_C_TriggerUIEvent final
{
public:
	struct FBoneResult                            Target;                                            // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class FName                                   EventName;                                         // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPartMainBone_IsValid;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneResult                            CallFunc_GetPartMainBone_BoneResult;               // 0x0038(0x0028)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class AGameCharacter*                         CallFunc_GetPartMainBone_GameCharacter;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFightModifierSpecialSigna*             CallFunc_GetSpecialSigna_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SkillSelector_LieTu_NormalSkill01_C_TriggerUIEvent;

// Function SkillSelector_LieTu_NormalSkill01.SkillSelector_LieTu_NormalSkill01_C.GetSortedGameCharacters
// 0x0010 (0x0010 - 0x0000)
struct SkillSelector_LieTu_NormalSkill01_C_GetSortedGameCharacters final
{
public:
	TArray<class AGameCharacter*>                 OutCharacters;                                     // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_SkillSelector_LieTu_NormalSkill01_C_GetSortedGameCharacters;

// Function SkillSelector_LieTu_NormalSkill01.SkillSelector_LieTu_NormalSkill01_C.GetPartitionMainBone__Overridden
// 0x0060 (0x0060 - 0x0000)
struct SkillSelector_LieTu_NormalSkill01_C_GetPartitionMainBone__Overridden final
{
public:
	struct FBoneResult                            PartitionResult;                                   // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          IsValid;                                           // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneResult                            BoneResult;                                        // 0x0030(0x0028)(Parm, OutParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class AGameCharacter*                         GameCharacter;                                     // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SkillSelector_LieTu_NormalSkill01_C_GetPartitionMainBone__Overridden;

// Function SkillSelector_LieTu_NormalSkill01.SkillSelector_LieTu_NormalSkill01_C.ShowUI
// 0x00B0 (0x00B0 - 0x0000)
struct SkillSelector_LieTu_NormalSkill01_C_ShowUI final
{
public:
	struct FBoneResult                            Part;                                              // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          bShow;                                             // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetPartMainBone_IsValid;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneResult                            CallFunc_GetPartMainBone_BoneResult;               // 0x0030(0x0028)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class AGameCharacter*                         CallFunc_GetPartMainBone_GameCharacter;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFightModifierSpecialSigna*             CallFunc_GetSpecialSigna_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBoneResult                            K2Node_MakeStruct_BoneResult;                      // 0x0070(0x0028)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFightModifierSpecialSignaItem*         CallFunc_ShowSpecialWidget_ReturnValue;            // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SkillSelector_LieTu_NormalSkill01_C_ShowUI;

// Function SkillSelector_LieTu_NormalSkill01.SkillSelector_LieTu_NormalSkill01_C.GetAllTargetWithWeakResults__Overridden
// 0x0020 (0x0020 - 0x0000)
struct SkillSelector_LieTu_NormalSkill01_C_GetAllTargetWithWeakResults__Overridden final
{
public:
	TArray<struct FBoneResult>                    NewResults;                                        // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<struct FBoneResult>                    Results;                                           // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
};
DUMPER7_ASSERTS_SkillSelector_LieTu_NormalSkill01_C_GetAllTargetWithWeakResults__Overridden;

// Function SkillSelector_LieTu_NormalSkill01.SkillSelector_LieTu_NormalSkill01_C.ReceiveTick__Overridden
// 0x0004 (0x0004 - 0x0000)
struct SkillSelector_LieTu_NormalSkill01_C_ReceiveTick__Overridden final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SkillSelector_LieTu_NormalSkill01_C_ReceiveTick__Overridden;

// Function SkillSelector_LieTu_NormalSkill01.SkillSelector_LieTu_NormalSkill01_C.ExecuteUbergraph_SkillSelector_LieTu_NormalSkill01
// 0x0098 (0x0098 - 0x0000)
struct SkillSelector_LieTu_NormalSkill01_C_ExecuteUbergraph_SkillSelector_LieTu_NormalSkill01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneResult                            CallFunc_Array_Get_Item;                           // 0x0020(0x0028)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FBoneResult                            CallFunc_Array_Get_Item_1;                         // 0x0048(0x0028)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftClassPath                         CallFunc_ReplaceEffectClassPath_ReturnValue;       // 0x0080(0x0018)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SkillSelector_LieTu_NormalSkill01_C_ExecuteUbergraph_SkillSelector_LieTu_NormalSkill01;

// LuaFunction SkillSelector_LieTu_NormalSkill01.SkillSelector_LieTu_NormalSkill01_C.GetAllTargetWithWeakResults
// 0x0020 (0x0020 - 0x0000)
struct SkillSelector_LieTu_NormalSkill01_C_GetAllTargetWithWeakResults final
{
public:
	TArray<struct FBoneResult>                    NewResults;                                        // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<struct FBoneResult>                    Results;                                           // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
};
DUMPER7_ASSERTS_SkillSelector_LieTu_NormalSkill01_C_GetAllTargetWithWeakResults;

// LuaFunction SkillSelector_LieTu_NormalSkill01.SkillSelector_LieTu_NormalSkill01_C.GetPartitionMainBone
// 0x0060 (0x0060 - 0x0000)
struct SkillSelector_LieTu_NormalSkill01_C_GetPartitionMainBone final
{
public:
	struct FBoneResult                            PartitionResult;                                   // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          IsValid;                                           // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneResult                            BoneResult;                                        // 0x0030(0x0028)(Parm, OutParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class AGameCharacter*                         GameCharacter;                                     // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SkillSelector_LieTu_NormalSkill01_C_GetPartitionMainBone;

// LuaFunction SkillSelector_LieTu_NormalSkill01.SkillSelector_LieTu_NormalSkill01_C.GetPartMainBone
// 0x0060 (0x0060 - 0x0000)
struct SkillSelector_LieTu_NormalSkill01_C_GetPartMainBone final
{
public:
	struct FBoneResult                            PartResult;                                        // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          IsValid;                                           // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneResult                            BoneResult;                                        // 0x0030(0x0028)(Parm, OutParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class AGameCharacter*                         GameCharacter;                                     // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SkillSelector_LieTu_NormalSkill01_C_GetPartMainBone;

// LuaFunction SkillSelector_LieTu_NormalSkill01.SkillSelector_LieTu_NormalSkill01_C.GetAllQueryResults
// 0x0028 (0x0028 - 0x0000)
struct SkillSelector_LieTu_NormalSkill01_C_GetAllQueryResults final
{
public:
	TArray<struct FQueryResult>                   OutResults;                                        // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	class AGameCharacter*                         GameCharacter;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FQueryResult>                   Results;                                           // 0x0018(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
};
DUMPER7_ASSERTS_SkillSelector_LieTu_NormalSkill01_C_GetAllQueryResults;

// Function SkillSelector_LieTu_NormalSkill01.SkillSelector_LieTu_NormalSkill01_C.GetPartMainBone__Overridden
// 0x0060 (0x0060 - 0x0000)
struct SkillSelector_LieTu_NormalSkill01_C_GetPartMainBone__Overridden final
{
public:
	struct FBoneResult                            PartResult;                                        // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          IsValid;                                           // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneResult                            BoneResult;                                        // 0x0030(0x0028)(Parm, OutParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class AGameCharacter*                         GameCharacter;                                     // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SkillSelector_LieTu_NormalSkill01_C_GetPartMainBone__Overridden;

// Function SkillSelector_LieTu_NormalSkill01.SkillSelector_LieTu_NormalSkill01_C.OnGetAssetPath
// 0x0050 (0x0050 - 0x0000)
struct SkillSelector_LieTu_NormalSkill01_C_OnGetAssetPath final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CharacterIDs;                                      // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 SkillIDs;                                          // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FSoftObjectPath>                ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ReturnParm)
	TArray<struct FSoftObjectPath>                OutPaths;                                          // 0x0038(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SkillSelector_LieTu_NormalSkill01_C_OnGetAssetPath;

// Function SkillSelector_LieTu_NormalSkill01.SkillSelector_LieTu_NormalSkill01_C.GetRemainSelectTargetCount
// 0x000C (0x000C - 0x0000)
struct SkillSelector_LieTu_NormalSkill01_C_GetRemainSelectTargetCount final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SkillSelector_LieTu_NormalSkill01_C_GetRemainSelectTargetCount;

// Function SkillSelector_LieTu_NormalSkill01.SkillSelector_LieTu_NormalSkill01_C.GetSortedPartitions
// 0x0018 (0x0018 - 0x0000)
struct SkillSelector_LieTu_NormalSkill01_C_GetSortedPartitions final
{
public:
	class AGameCharacter*                         GameCharacter;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBoneResult>                    OutPartitions;                                     // 0x0008(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_SkillSelector_LieTu_NormalSkill01_C_GetSortedPartitions;

// Function SkillSelector_LieTu_NormalSkill01.SkillSelector_LieTu_NormalSkill01_C.GetPartitionMainPart__Overridden
// 0x0058 (0x0058 - 0x0000)
struct SkillSelector_LieTu_NormalSkill01_C_GetPartitionMainPart__Overridden final
{
public:
	struct FBoneResult                            PartitionResult;                                   // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          IsValid;                                           // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneResult                            BoneResult;                                        // 0x0030(0x0028)(Parm, OutParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SkillSelector_LieTu_NormalSkill01_C_GetPartitionMainPart__Overridden;

// Function SkillSelector_LieTu_NormalSkill01.SkillSelector_LieTu_NormalSkill01_C.GetAllQueryResults__Overridden
// 0x0028 (0x0028 - 0x0000)
struct SkillSelector_LieTu_NormalSkill01_C_GetAllQueryResults__Overridden final
{
public:
	TArray<struct FQueryResult>                   OutResults;                                        // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	class AGameCharacter*                         GameCharacter;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FQueryResult>                   Results;                                           // 0x0018(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
};
DUMPER7_ASSERTS_SkillSelector_LieTu_NormalSkill01_C_GetAllQueryResults__Overridden;

// Function SkillSelector_LieTu_NormalSkill01.SkillSelector_LieTu_NormalSkill01_C.CheckTargetInView
// 0x0040 (0x0040 - 0x0000)
struct SkillSelector_LieTu_NormalSkill01_C_CheckTargetInView final
{
public:
	class AGameCharacter*                         InTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBoneResult                            BoneResult;                                        // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          bInView;                                           // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              WidgetPosition;                                    // 0x0034(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SkillSelector_LieTu_NormalSkill01_C_CheckTargetInView;

// Function SkillSelector_LieTu_NormalSkill01.SkillSelector_LieTu_NormalSkill01_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct SkillSelector_LieTu_NormalSkill01_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SkillSelector_LieTu_NormalSkill01_C_GetModuleName;

}

