#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkillMove_RushToGoal

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// LuaFunction SkillMove_RushToGoal.SkillMove_RushToGoal_C.OnMoveTickCheck
// 0x0004 (0x0004 - 0x0000)
struct SkillMove_RushToGoal_C_OnMoveTickCheck final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkillMove_RushToGoal_C_OnMoveTickCheck) == 0x000004, "Wrong alignment on SkillMove_RushToGoal_C_OnMoveTickCheck");
static_assert(sizeof(SkillMove_RushToGoal_C_OnMoveTickCheck) == 0x000004, "Wrong size on SkillMove_RushToGoal_C_OnMoveTickCheck");
static_assert(offsetof(SkillMove_RushToGoal_C_OnMoveTickCheck, DeltaTime) == 0x000000, "Member 'SkillMove_RushToGoal_C_OnMoveTickCheck::DeltaTime' has a wrong offset!");

// LuaFunction SkillMove_RushToGoal.SkillMove_RushToGoal_C.OnMoveBlock
// 0x008C (0x008C - 0x0000)
struct SkillMove_RushToGoal_C_OnMoveBlock final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x008C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkillMove_RushToGoal_C_OnMoveBlock) == 0x000004, "Wrong alignment on SkillMove_RushToGoal_C_OnMoveBlock");
static_assert(sizeof(SkillMove_RushToGoal_C_OnMoveBlock) == 0x00008C, "Wrong size on SkillMove_RushToGoal_C_OnMoveBlock");
static_assert(offsetof(SkillMove_RushToGoal_C_OnMoveBlock, HitResult) == 0x000000, "Member 'SkillMove_RushToGoal_C_OnMoveBlock::HitResult' has a wrong offset!");

// LuaFunction SkillMove_RushToGoal.SkillMove_RushToGoal_C.OnMoveEnd
// 0x0008 (0x0008 - 0x0000)
struct SkillMove_RushToGoal_C_OnMoveEnd final
{
public:
	class UBaseMovementComponent*                 Movement;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkillMove_RushToGoal_C_OnMoveEnd) == 0x000008, "Wrong alignment on SkillMove_RushToGoal_C_OnMoveEnd");
static_assert(sizeof(SkillMove_RushToGoal_C_OnMoveEnd) == 0x000008, "Wrong size on SkillMove_RushToGoal_C_OnMoveEnd");
static_assert(offsetof(SkillMove_RushToGoal_C_OnMoveEnd, Movement) == 0x000000, "Member 'SkillMove_RushToGoal_C_OnMoveEnd::Movement' has a wrong offset!");

// LuaFunction SkillMove_RushToGoal.SkillMove_RushToGoal_C.OnMoveStart
// 0x0010 (0x0010 - 0x0000)
struct SkillMove_RushToGoal_C_OnMoveStart final
{
public:
	class AActor*                                 Launcher;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBaseMovementComponent*                 Movement;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkillMove_RushToGoal_C_OnMoveStart) == 0x000008, "Wrong alignment on SkillMove_RushToGoal_C_OnMoveStart");
static_assert(sizeof(SkillMove_RushToGoal_C_OnMoveStart) == 0x000010, "Wrong size on SkillMove_RushToGoal_C_OnMoveStart");
static_assert(offsetof(SkillMove_RushToGoal_C_OnMoveStart, Launcher) == 0x000000, "Member 'SkillMove_RushToGoal_C_OnMoveStart::Launcher' has a wrong offset!");
static_assert(offsetof(SkillMove_RushToGoal_C_OnMoveStart, Movement) == 0x000008, "Member 'SkillMove_RushToGoal_C_OnMoveStart::Movement' has a wrong offset!");

// LuaFunction SkillMove_RushToGoal.SkillMove_RushToGoal_C.OnMoveTick
// 0x0018 (0x0018 - 0x0000)
struct SkillMove_RushToGoal_C_OnMoveTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Friction;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFluid;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BrakingDeceleration;                               // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBaseMovementComponent*                 Movement;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkillMove_RushToGoal_C_OnMoveTick) == 0x000008, "Wrong alignment on SkillMove_RushToGoal_C_OnMoveTick");
static_assert(sizeof(SkillMove_RushToGoal_C_OnMoveTick) == 0x000018, "Wrong size on SkillMove_RushToGoal_C_OnMoveTick");
static_assert(offsetof(SkillMove_RushToGoal_C_OnMoveTick, DeltaTime) == 0x000000, "Member 'SkillMove_RushToGoal_C_OnMoveTick::DeltaTime' has a wrong offset!");
static_assert(offsetof(SkillMove_RushToGoal_C_OnMoveTick, Friction) == 0x000004, "Member 'SkillMove_RushToGoal_C_OnMoveTick::Friction' has a wrong offset!");
static_assert(offsetof(SkillMove_RushToGoal_C_OnMoveTick, bFluid) == 0x000008, "Member 'SkillMove_RushToGoal_C_OnMoveTick::bFluid' has a wrong offset!");
static_assert(offsetof(SkillMove_RushToGoal_C_OnMoveTick, BrakingDeceleration) == 0x00000C, "Member 'SkillMove_RushToGoal_C_OnMoveTick::BrakingDeceleration' has a wrong offset!");
static_assert(offsetof(SkillMove_RushToGoal_C_OnMoveTick, Movement) == 0x000010, "Member 'SkillMove_RushToGoal_C_OnMoveTick::Movement' has a wrong offset!");

// LuaFunction SkillMove_RushToGoal.SkillMove_RushToGoal_C.IsUsedToAddVelocityInsteadOverride
// 0x0001 (0x0001 - 0x0000)
struct SkillMove_RushToGoal_C_IsUsedToAddVelocityInsteadOverride final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkillMove_RushToGoal_C_IsUsedToAddVelocityInsteadOverride) == 0x000001, "Wrong alignment on SkillMove_RushToGoal_C_IsUsedToAddVelocityInsteadOverride");
static_assert(sizeof(SkillMove_RushToGoal_C_IsUsedToAddVelocityInsteadOverride) == 0x000001, "Wrong size on SkillMove_RushToGoal_C_IsUsedToAddVelocityInsteadOverride");
static_assert(offsetof(SkillMove_RushToGoal_C_IsUsedToAddVelocityInsteadOverride, ReturnValue) == 0x000000, "Member 'SkillMove_RushToGoal_C_IsUsedToAddVelocityInsteadOverride::ReturnValue' has a wrong offset!");

// LuaFunction SkillMove_RushToGoal.SkillMove_RushToGoal_C.OnMoveTouchTargetCheck
// 0x0010 (0x0010 - 0x0000)
struct SkillMove_RushToGoal_C_OnMoveTouchTargetCheck final
{
public:
	class AActor*                                 InTarget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkillMove_RushToGoal_C_OnMoveTouchTargetCheck) == 0x000008, "Wrong alignment on SkillMove_RushToGoal_C_OnMoveTouchTargetCheck");
static_assert(sizeof(SkillMove_RushToGoal_C_OnMoveTouchTargetCheck) == 0x000010, "Wrong size on SkillMove_RushToGoal_C_OnMoveTouchTargetCheck");
static_assert(offsetof(SkillMove_RushToGoal_C_OnMoveTouchTargetCheck, InTarget) == 0x000000, "Member 'SkillMove_RushToGoal_C_OnMoveTouchTargetCheck::InTarget' has a wrong offset!");
static_assert(offsetof(SkillMove_RushToGoal_C_OnMoveTouchTargetCheck, ReturnValue) == 0x000008, "Member 'SkillMove_RushToGoal_C_OnMoveTouchTargetCheck::ReturnValue' has a wrong offset!");

// Function SkillMove_RushToGoal.SkillMove_RushToGoal_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct SkillMove_RushToGoal_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(SkillMove_RushToGoal_C_GetModuleName) == 0x000008, "Wrong alignment on SkillMove_RushToGoal_C_GetModuleName");
static_assert(sizeof(SkillMove_RushToGoal_C_GetModuleName) == 0x000010, "Wrong size on SkillMove_RushToGoal_C_GetModuleName");
static_assert(offsetof(SkillMove_RushToGoal_C_GetModuleName, ReturnValue) == 0x000000, "Member 'SkillMove_RushToGoal_C_GetModuleName::ReturnValue' has a wrong offset!");

}

