#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkillMove_RushToGoal

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// LuaFunction SkillMove_RushToGoal.SkillMove_RushToGoal_C.IsUsedToAddVelocityInsteadOverride
// 0x0001 (0x0001 - 0x0000)
struct SkillMove_RushToGoal_C_IsUsedToAddVelocityInsteadOverride final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkillMove_RushToGoal_C_IsUsedToAddVelocityInsteadOverride;

// LuaFunction SkillMove_RushToGoal.SkillMove_RushToGoal_C.OnMoveBlock
// 0x008C (0x008C - 0x0000)
struct SkillMove_RushToGoal_C_OnMoveBlock final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x008C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkillMove_RushToGoal_C_OnMoveBlock;

// LuaFunction SkillMove_RushToGoal.SkillMove_RushToGoal_C.OnMoveTouchTargetCheck
// 0x0010 (0x0010 - 0x0000)
struct SkillMove_RushToGoal_C_OnMoveTouchTargetCheck final
{
public:
	class AActor*                                 InTarget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkillMove_RushToGoal_C_OnMoveTouchTargetCheck;

// LuaFunction SkillMove_RushToGoal.SkillMove_RushToGoal_C.OnMoveEnd
// 0x0008 (0x0008 - 0x0000)
struct SkillMove_RushToGoal_C_OnMoveEnd final
{
public:
	class UBaseMovementComponent*                 Movement;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkillMove_RushToGoal_C_OnMoveEnd;

// LuaFunction SkillMove_RushToGoal.SkillMove_RushToGoal_C.OnMoveTickCheck
// 0x0004 (0x0004 - 0x0000)
struct SkillMove_RushToGoal_C_OnMoveTickCheck final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkillMove_RushToGoal_C_OnMoveTickCheck;

// LuaFunction SkillMove_RushToGoal.SkillMove_RushToGoal_C.OnMoveStart
// 0x0010 (0x0010 - 0x0000)
struct SkillMove_RushToGoal_C_OnMoveStart final
{
public:
	class AActor*                                 Launcher;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBaseMovementComponent*                 Movement;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkillMove_RushToGoal_C_OnMoveStart;

// LuaFunction SkillMove_RushToGoal.SkillMove_RushToGoal_C.OnMoveTick
// 0x0018 (0x0018 - 0x0000)
struct SkillMove_RushToGoal_C_OnMoveTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Friction;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFluid;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BrakingDeceleration;                               // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBaseMovementComponent*                 Movement;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkillMove_RushToGoal_C_OnMoveTick;

// Function SkillMove_RushToGoal.SkillMove_RushToGoal_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct SkillMove_RushToGoal_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SkillMove_RushToGoal_C_GetModuleName;

}

