#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkillMove_DragToGoal_Update

#include "Basic.hpp"


namespace SDK::Params
{

// LuaFunction SkillMove_DragToGoal_Update.SkillMove_DragToGoal_Update_C.IsUsedToAddVelocityInsteadOverride
// 0x0001 (0x0001 - 0x0000)
struct SkillMove_DragToGoal_Update_C_IsUsedToAddVelocityInsteadOverride final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkillMove_DragToGoal_Update_C_IsUsedToAddVelocityInsteadOverride;

// LuaFunction SkillMove_DragToGoal_Update.SkillMove_DragToGoal_Update_C.OnMoveEnd
// 0x0008 (0x0008 - 0x0000)
struct SkillMove_DragToGoal_Update_C_OnMoveEnd final
{
public:
	class UBaseMovementComponent*                 Movement;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkillMove_DragToGoal_Update_C_OnMoveEnd;

// LuaFunction SkillMove_DragToGoal_Update.SkillMove_DragToGoal_Update_C.OnMoveStart
// 0x0010 (0x0010 - 0x0000)
struct SkillMove_DragToGoal_Update_C_OnMoveStart final
{
public:
	class AActor*                                 Launcher;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBaseMovementComponent*                 Movement;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkillMove_DragToGoal_Update_C_OnMoveStart;

// LuaFunction SkillMove_DragToGoal_Update.SkillMove_DragToGoal_Update_C.OnMoveTick
// 0x0018 (0x0018 - 0x0000)
struct SkillMove_DragToGoal_Update_C_OnMoveTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Friction;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFluid;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BrakingDeceleration;                               // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBaseMovementComponent*                 Movement;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkillMove_DragToGoal_Update_C_OnMoveTick;

// Function SkillMove_DragToGoal_Update.SkillMove_DragToGoal_Update_C.ReceiveActorBeginOverlap_1
// 0x0008 (0x0008 - 0x0000)
struct SkillMove_DragToGoal_Update_C_ReceiveActorBeginOverlap_1 final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SkillMove_DragToGoal_Update_C_ReceiveActorBeginOverlap_1;

// Function SkillMove_DragToGoal_Update.SkillMove_DragToGoal_Update_C.ReceiveTick_1
// 0x0004 (0x0004 - 0x0000)
struct SkillMove_DragToGoal_Update_C_ReceiveTick_1 final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SkillMove_DragToGoal_Update_C_ReceiveTick_1;

// Function SkillMove_DragToGoal_Update.SkillMove_DragToGoal_Update_C.ExecuteUbergraph_SkillMove_DragToGoal_Update
// 0x0010 (0x0010 - 0x0000)
struct SkillMove_DragToGoal_Update_C_ExecuteUbergraph_SkillMove_DragToGoal_Update final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SkillMove_DragToGoal_Update_C_ExecuteUbergraph_SkillMove_DragToGoal_Update;

// Function SkillMove_DragToGoal_Update.SkillMove_DragToGoal_Update_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct SkillMove_DragToGoal_Update_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SkillMove_DragToGoal_Update_C_GetModuleName;

}

