#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkillMove_Teleport

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SkillMove_Teleport.SkillMove_Teleport_C
// 0x0020 (0x01F8 - 0x01D8)
class USkillMove_Teleport_C final : public USkillMove
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Illusion;                                          // 0x01E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                IllusinStart;                                      // 0x01E8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnMoveEnd(class UBaseMovementComponent* Movement);
	void OnMoveStart(class AActor* Launcher, class UBaseMovementComponent* Movement);
	void ExecuteUbergraph_SkillMove_Teleport(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SkillMove_Teleport_C">();
	}
	static class USkillMove_Teleport_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkillMove_Teleport_C>();
	}
};
static_assert(alignof(USkillMove_Teleport_C) == 0x000008, "Wrong alignment on USkillMove_Teleport_C");
static_assert(sizeof(USkillMove_Teleport_C) == 0x0001F8, "Wrong size on USkillMove_Teleport_C");
static_assert(offsetof(USkillMove_Teleport_C, UberGraphFrame) == 0x0001D8, "Member 'USkillMove_Teleport_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USkillMove_Teleport_C, Illusion) == 0x0001E0, "Member 'USkillMove_Teleport_C::Illusion' has a wrong offset!");
static_assert(offsetof(USkillMove_Teleport_C, IllusinStart) == 0x0001E8, "Member 'USkillMove_Teleport_C::IllusinStart' has a wrong offset!");

}

