#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkillMove_Jump

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SkillMove_Jump.SkillMove_Jump_C
// 0x0018 (0x01F8 - 0x01E0)
class USkillMove_Jump_C final : public USkillMove
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         JumpCostTime;                                      // 0x01E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ActiveTime;                                        // 0x01EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         JumpGravity;                                       // 0x01F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Gravity;                                           // 0x01F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnMoveTickCheck(float DeltaTime);
	void OnMoveTick(float DeltaTime, float Friction, bool bFluid, float BrakingDeceleration, class UBaseMovementComponent* Movement);
	bool IsUsedToAddVelocityInsteadOverride();
	void OnMoveEnd(class UBaseMovementComponent* Movement);
	void OnMoveStart(class AActor* Launcher, class UBaseMovementComponent* Movement);
	void ReceiveBeginPlay_1();
	void ReceiveActorBeginOverlap_1(class AActor* OtherActor);
	void ReceiveTick_1(float DeltaSeconds);
	void ExecuteUbergraph_SkillMove_Jump(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SkillMove_Jump_C">();
	}
	static class USkillMove_Jump_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkillMove_Jump_C>();
	}
};
static_assert(alignof(USkillMove_Jump_C) == 0x000008, "Wrong alignment on USkillMove_Jump_C");
static_assert(sizeof(USkillMove_Jump_C) == 0x0001F8, "Wrong size on USkillMove_Jump_C");
static_assert(offsetof(USkillMove_Jump_C, UberGraphFrame) == 0x0001E0, "Member 'USkillMove_Jump_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USkillMove_Jump_C, JumpCostTime) == 0x0001E8, "Member 'USkillMove_Jump_C::JumpCostTime' has a wrong offset!");
static_assert(offsetof(USkillMove_Jump_C, ActiveTime) == 0x0001EC, "Member 'USkillMove_Jump_C::ActiveTime' has a wrong offset!");
static_assert(offsetof(USkillMove_Jump_C, JumpGravity) == 0x0001F0, "Member 'USkillMove_Jump_C::JumpGravity' has a wrong offset!");
static_assert(offsetof(USkillMove_Jump_C, Gravity) == 0x0001F4, "Member 'USkillMove_Jump_C::Gravity' has a wrong offset!");

}

