#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkillStorage_Accessory

#include "Basic.hpp"


namespace SDK::Params
{

// Function SkillStorage_Accessory.SkillStorage_Accessory_C.ReceiveActiveSkill
// 0x0001 (0x0001 - 0x0000)
struct SkillStorage_Accessory_C_ReceiveActiveSkill final
{
public:
	bool                                          bIsClient;                                         // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SkillStorage_Accessory_C_ReceiveActiveSkill) == 0x000001, "Wrong alignment on SkillStorage_Accessory_C_ReceiveActiveSkill");
static_assert(sizeof(SkillStorage_Accessory_C_ReceiveActiveSkill) == 0x000001, "Wrong size on SkillStorage_Accessory_C_ReceiveActiveSkill");
static_assert(offsetof(SkillStorage_Accessory_C_ReceiveActiveSkill, bIsClient) == 0x000000, "Member 'SkillStorage_Accessory_C_ReceiveActiveSkill::bIsClient' has a wrong offset!");

// Function SkillStorage_Accessory.SkillStorage_Accessory_C.ReceiveEndStorageProgress
// 0x0008 (0x0008 - 0x0000)
struct SkillStorage_Accessory_C_ReceiveEndStorageProgress final
{
public:
	bool                                          bIsClient;                                         // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Position;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillStorage_Accessory_C_ReceiveEndStorageProgress) == 0x000004, "Wrong alignment on SkillStorage_Accessory_C_ReceiveEndStorageProgress");
static_assert(sizeof(SkillStorage_Accessory_C_ReceiveEndStorageProgress) == 0x000008, "Wrong size on SkillStorage_Accessory_C_ReceiveEndStorageProgress");
static_assert(offsetof(SkillStorage_Accessory_C_ReceiveEndStorageProgress, bIsClient) == 0x000000, "Member 'SkillStorage_Accessory_C_ReceiveEndStorageProgress::bIsClient' has a wrong offset!");
static_assert(offsetof(SkillStorage_Accessory_C_ReceiveEndStorageProgress, Position) == 0x000004, "Member 'SkillStorage_Accessory_C_ReceiveEndStorageProgress::Position' has a wrong offset!");

// Function SkillStorage_Accessory.SkillStorage_Accessory_C.ExecuteUbergraph_SkillStorage_Accessory
// 0x0080 (0x0080 - 0x0000)
struct SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameSkill*                             K2Node_DynamicCast_As____;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_K2_GetSkillId_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACharacterAccessory*>            CallFunc_GetCharacterAccessories_OutCharacterAccessories; // 0x0048(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterAccessory*                    CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAccessory_ChracterSkill*               K2Node_DynamicCast_AsAccessory_Chracter_Skill;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsClient_1;                          // 0x0079(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsClient;                            // 0x007A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Position;                             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory) == 0x000008, "Wrong alignment on SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory");
static_assert(sizeof(SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory) == 0x000080, "Wrong size on SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory");
static_assert(offsetof(SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory, EntryPoint) == 0x000000, "Member 'SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory::EntryPoint' has a wrong offset!");
static_assert(offsetof(SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory, K2Node_DynamicCast_As____) == 0x000010, "Member 'SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory::K2Node_DynamicCast_As____' has a wrong offset!");
static_assert(offsetof(SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory, ___int_Array_Index_Variable) == 0x00001C, "Member 'SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory, CallFunc_K2_GetSkillId_ReturnValue) == 0x000020, "Member 'SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory::CallFunc_K2_GetSkillId_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory, CallFunc_GetOwner_ReturnValue_1) == 0x000028, "Member 'SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory, ___int_Loop_Counter_Variable) == 0x000030, "Member 'SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory, K2Node_DynamicCast_AsGame_Character) == 0x000038, "Member 'SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory, CallFunc_GetCharacterAccessories_OutCharacterAccessories) == 0x000048, "Member 'SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory::CallFunc_GetCharacterAccessories_OutCharacterAccessories' has a wrong offset!");
static_assert(offsetof(SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory, CallFunc_Array_Get_Item) == 0x000060, "Member 'SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory, K2Node_DynamicCast_AsAccessory_Chracter_Skill) == 0x000068, "Member 'SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory::K2Node_DynamicCast_AsAccessory_Chracter_Skill' has a wrong offset!");
static_assert(offsetof(SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory, K2Node_Event_bIsClient_1) == 0x000079, "Member 'SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory::K2Node_Event_bIsClient_1' has a wrong offset!");
static_assert(offsetof(SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory, K2Node_Event_bIsClient) == 0x00007A, "Member 'SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory::K2Node_Event_bIsClient' has a wrong offset!");
static_assert(offsetof(SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory, K2Node_Event_Position) == 0x00007C, "Member 'SkillStorage_Accessory_C_ExecuteUbergraph_SkillStorage_Accessory::K2Node_Event_Position' has a wrong offset!");

}

