#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkillSelector_Girl023_Skill03

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SkillSelector_Girl023_Skill01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SkillSelector_Girl023_Skill03.SkillSelector_Girl023_Skill03_C
// 0x0370 (0x0CD0 - 0x0960)
class ASkillSelector_Girl023_Skill03_C final : public ASkillSelector_Girl023_Skill01_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_SkillSelector_Girl023_Skill03_C;    // 0x0960(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FLinearColor                           Alpha_Refine_T_1_Start_Skill03;                    // 0x0968(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Alpha_Refine_T_1_End_Skill03;                      // 0x0978(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Alpha_Refine_T_1_Finish_Skill03;                   // 0x0988(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color__Lower_Start_Skill03;                        // 0x0998(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color__Lower_End_Skill03;                          // 0x09A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color__Middle_Start_Skill03;                       // 0x09B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color__Middle_End_Skill03;                         // 0x09C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color__Upper_Start_Skill03;                        // 0x09D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color__Upper_End_Skill03;                          // 0x09E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, struct FLinearColor>              AlphaRefine_t1_Start_3;                            // 0x09F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, struct FLinearColor>              Color__Lower_Start_3;                              // 0x0A48(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, struct FLinearColor>              Color__Middle_Start_3;                             // 0x0A98(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, struct FLinearColor>              Color__Upper_Start_3;                              // 0x0AE8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, struct FLinearColor>              AlphaRefine_t1_End_3;                              // 0x0B38(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, struct FLinearColor>              Color__Lower_End_3;                                // 0x0B88(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, struct FLinearColor>              Color__Middle_End_3;                               // 0x0BD8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, struct FLinearColor>              Color__Upper_End_3;                                // 0x0C28(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, struct FLinearColor>              AlphaRefine_t1_Finish_3;                           // 0x0C78(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ReceiveDestroyed();
	void OnReceiveFinish();
	void BPReceiveBeginPlay();
	void ExecuteUbergraph_SkillSelector_Girl023_Skill03(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SkillSelector_Girl023_Skill03_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SkillSelector_Girl023_Skill03_C")
	}
	static class ASkillSelector_Girl023_Skill03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASkillSelector_Girl023_Skill03_C>();
	}
};
DUMPER7_ASSERTS_ASkillSelector_Girl023_Skill03_C;

}

