#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkillMove_SkillNormalMove

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// LuaFunction SkillMove_SkillNormalMove.SkillMove_SkillNormalMove_C.OnMoveEnd
// 0x0008 (0x0008 - 0x0000)
struct SkillMove_SkillNormalMove_C_OnMoveEnd final
{
public:
	class UBaseMovementComponent*                 Movement;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkillMove_SkillNormalMove_C_OnMoveEnd) == 0x000008, "Wrong alignment on SkillMove_SkillNormalMove_C_OnMoveEnd");
static_assert(sizeof(SkillMove_SkillNormalMove_C_OnMoveEnd) == 0x000008, "Wrong size on SkillMove_SkillNormalMove_C_OnMoveEnd");
static_assert(offsetof(SkillMove_SkillNormalMove_C_OnMoveEnd, Movement) == 0x000000, "Member 'SkillMove_SkillNormalMove_C_OnMoveEnd::Movement' has a wrong offset!");

// LuaFunction SkillMove_SkillNormalMove.SkillMove_SkillNormalMove_C.IsUsedToAddVelocityInsteadOverride
// 0x0001 (0x0001 - 0x0000)
struct SkillMove_SkillNormalMove_C_IsUsedToAddVelocityInsteadOverride final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkillMove_SkillNormalMove_C_IsUsedToAddVelocityInsteadOverride) == 0x000001, "Wrong alignment on SkillMove_SkillNormalMove_C_IsUsedToAddVelocityInsteadOverride");
static_assert(sizeof(SkillMove_SkillNormalMove_C_IsUsedToAddVelocityInsteadOverride) == 0x000001, "Wrong size on SkillMove_SkillNormalMove_C_IsUsedToAddVelocityInsteadOverride");
static_assert(offsetof(SkillMove_SkillNormalMove_C_IsUsedToAddVelocityInsteadOverride, ReturnValue) == 0x000000, "Member 'SkillMove_SkillNormalMove_C_IsUsedToAddVelocityInsteadOverride::ReturnValue' has a wrong offset!");

// LuaFunction SkillMove_SkillNormalMove.SkillMove_SkillNormalMove_C.OnMoveStart
// 0x0010 (0x0010 - 0x0000)
struct SkillMove_SkillNormalMove_C_OnMoveStart final
{
public:
	class AActor*                                 Launcher;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBaseMovementComponent*                 Movement;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkillMove_SkillNormalMove_C_OnMoveStart) == 0x000008, "Wrong alignment on SkillMove_SkillNormalMove_C_OnMoveStart");
static_assert(sizeof(SkillMove_SkillNormalMove_C_OnMoveStart) == 0x000010, "Wrong size on SkillMove_SkillNormalMove_C_OnMoveStart");
static_assert(offsetof(SkillMove_SkillNormalMove_C_OnMoveStart, Launcher) == 0x000000, "Member 'SkillMove_SkillNormalMove_C_OnMoveStart::Launcher' has a wrong offset!");
static_assert(offsetof(SkillMove_SkillNormalMove_C_OnMoveStart, Movement) == 0x000008, "Member 'SkillMove_SkillNormalMove_C_OnMoveStart::Movement' has a wrong offset!");

// LuaFunction SkillMove_SkillNormalMove.SkillMove_SkillNormalMove_C.OnMoveTickCheck
// 0x0004 (0x0004 - 0x0000)
struct SkillMove_SkillNormalMove_C_OnMoveTickCheck final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkillMove_SkillNormalMove_C_OnMoveTickCheck) == 0x000004, "Wrong alignment on SkillMove_SkillNormalMove_C_OnMoveTickCheck");
static_assert(sizeof(SkillMove_SkillNormalMove_C_OnMoveTickCheck) == 0x000004, "Wrong size on SkillMove_SkillNormalMove_C_OnMoveTickCheck");
static_assert(offsetof(SkillMove_SkillNormalMove_C_OnMoveTickCheck, DeltaTime) == 0x000000, "Member 'SkillMove_SkillNormalMove_C_OnMoveTickCheck::DeltaTime' has a wrong offset!");

// LuaFunction SkillMove_SkillNormalMove.SkillMove_SkillNormalMove_C.OnMoveTick
// 0x0018 (0x0018 - 0x0000)
struct SkillMove_SkillNormalMove_C_OnMoveTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Friction;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFluid;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BrakingDeceleration;                               // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBaseMovementComponent*                 Movement;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkillMove_SkillNormalMove_C_OnMoveTick) == 0x000008, "Wrong alignment on SkillMove_SkillNormalMove_C_OnMoveTick");
static_assert(sizeof(SkillMove_SkillNormalMove_C_OnMoveTick) == 0x000018, "Wrong size on SkillMove_SkillNormalMove_C_OnMoveTick");
static_assert(offsetof(SkillMove_SkillNormalMove_C_OnMoveTick, DeltaTime) == 0x000000, "Member 'SkillMove_SkillNormalMove_C_OnMoveTick::DeltaTime' has a wrong offset!");
static_assert(offsetof(SkillMove_SkillNormalMove_C_OnMoveTick, Friction) == 0x000004, "Member 'SkillMove_SkillNormalMove_C_OnMoveTick::Friction' has a wrong offset!");
static_assert(offsetof(SkillMove_SkillNormalMove_C_OnMoveTick, bFluid) == 0x000008, "Member 'SkillMove_SkillNormalMove_C_OnMoveTick::bFluid' has a wrong offset!");
static_assert(offsetof(SkillMove_SkillNormalMove_C_OnMoveTick, BrakingDeceleration) == 0x00000C, "Member 'SkillMove_SkillNormalMove_C_OnMoveTick::BrakingDeceleration' has a wrong offset!");
static_assert(offsetof(SkillMove_SkillNormalMove_C_OnMoveTick, Movement) == 0x000010, "Member 'SkillMove_SkillNormalMove_C_OnMoveTick::Movement' has a wrong offset!");

// Function SkillMove_SkillNormalMove.SkillMove_SkillNormalMove_C.OnGetAssetPath
// 0x0088 (0x0088 - 0x0000)
struct SkillMove_SkillNormalMove_C_OnGetAssetPath final
{
public:
	TArray<struct FParamInfo>                     InParamInfo;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 CharacterIDs;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 SkillIDs;                                          // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 ModifierIDs;                                       // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 EmitterIDs;                                        // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FSoftObjectPath>                ReturnValue;                                       // 0x0050(0x0010)(Parm, OutParm, ReturnParm)
	struct FSoftObjectPath                        CallFunc_MakeSoftObjectPath_ReturnValue;           // 0x0060(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FSoftObjectPath>                K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
};
static_assert(alignof(SkillMove_SkillNormalMove_C_OnGetAssetPath) == 0x000008, "Wrong alignment on SkillMove_SkillNormalMove_C_OnGetAssetPath");
static_assert(sizeof(SkillMove_SkillNormalMove_C_OnGetAssetPath) == 0x000088, "Wrong size on SkillMove_SkillNormalMove_C_OnGetAssetPath");
static_assert(offsetof(SkillMove_SkillNormalMove_C_OnGetAssetPath, InParamInfo) == 0x000000, "Member 'SkillMove_SkillNormalMove_C_OnGetAssetPath::InParamInfo' has a wrong offset!");
static_assert(offsetof(SkillMove_SkillNormalMove_C_OnGetAssetPath, CharacterIDs) == 0x000010, "Member 'SkillMove_SkillNormalMove_C_OnGetAssetPath::CharacterIDs' has a wrong offset!");
static_assert(offsetof(SkillMove_SkillNormalMove_C_OnGetAssetPath, SkillIDs) == 0x000020, "Member 'SkillMove_SkillNormalMove_C_OnGetAssetPath::SkillIDs' has a wrong offset!");
static_assert(offsetof(SkillMove_SkillNormalMove_C_OnGetAssetPath, ModifierIDs) == 0x000030, "Member 'SkillMove_SkillNormalMove_C_OnGetAssetPath::ModifierIDs' has a wrong offset!");
static_assert(offsetof(SkillMove_SkillNormalMove_C_OnGetAssetPath, EmitterIDs) == 0x000040, "Member 'SkillMove_SkillNormalMove_C_OnGetAssetPath::EmitterIDs' has a wrong offset!");
static_assert(offsetof(SkillMove_SkillNormalMove_C_OnGetAssetPath, ReturnValue) == 0x000050, "Member 'SkillMove_SkillNormalMove_C_OnGetAssetPath::ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillMove_SkillNormalMove_C_OnGetAssetPath, CallFunc_MakeSoftObjectPath_ReturnValue) == 0x000060, "Member 'SkillMove_SkillNormalMove_C_OnGetAssetPath::CallFunc_MakeSoftObjectPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillMove_SkillNormalMove_C_OnGetAssetPath, K2Node_MakeArray_Array) == 0x000078, "Member 'SkillMove_SkillNormalMove_C_OnGetAssetPath::K2Node_MakeArray_Array' has a wrong offset!");

// Function SkillMove_SkillNormalMove.SkillMove_SkillNormalMove_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct SkillMove_SkillNormalMove_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(SkillMove_SkillNormalMove_C_GetModuleName) == 0x000008, "Wrong alignment on SkillMove_SkillNormalMove_C_GetModuleName");
static_assert(sizeof(SkillMove_SkillNormalMove_C_GetModuleName) == 0x000010, "Wrong size on SkillMove_SkillNormalMove_C_GetModuleName");
static_assert(offsetof(SkillMove_SkillNormalMove_C_GetModuleName, ReturnValue) == 0x000000, "Member 'SkillMove_SkillNormalMove_C_GetModuleName::ReturnValue' has a wrong offset!");

}

