#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkillMove_DragToGoal_Update

#include "Basic.hpp"


namespace SDK::Params
{

// Function SkillMove_DragToGoal_Update.SkillMove_DragToGoal_Update_C.ReceiveActorBeginOverlap_1
// 0x0008 (0x0008 - 0x0000)
struct SkillMove_DragToGoal_Update_C_ReceiveActorBeginOverlap_1 final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillMove_DragToGoal_Update_C_ReceiveActorBeginOverlap_1) == 0x000008, "Wrong alignment on SkillMove_DragToGoal_Update_C_ReceiveActorBeginOverlap_1");
static_assert(sizeof(SkillMove_DragToGoal_Update_C_ReceiveActorBeginOverlap_1) == 0x000008, "Wrong size on SkillMove_DragToGoal_Update_C_ReceiveActorBeginOverlap_1");
static_assert(offsetof(SkillMove_DragToGoal_Update_C_ReceiveActorBeginOverlap_1, OtherActor) == 0x000000, "Member 'SkillMove_DragToGoal_Update_C_ReceiveActorBeginOverlap_1::OtherActor' has a wrong offset!");

// Function SkillMove_DragToGoal_Update.SkillMove_DragToGoal_Update_C.ReceiveTick_1
// 0x0004 (0x0004 - 0x0000)
struct SkillMove_DragToGoal_Update_C_ReceiveTick_1 final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillMove_DragToGoal_Update_C_ReceiveTick_1) == 0x000004, "Wrong alignment on SkillMove_DragToGoal_Update_C_ReceiveTick_1");
static_assert(sizeof(SkillMove_DragToGoal_Update_C_ReceiveTick_1) == 0x000004, "Wrong size on SkillMove_DragToGoal_Update_C_ReceiveTick_1");
static_assert(offsetof(SkillMove_DragToGoal_Update_C_ReceiveTick_1, DeltaSeconds) == 0x000000, "Member 'SkillMove_DragToGoal_Update_C_ReceiveTick_1::DeltaSeconds' has a wrong offset!");

// Function SkillMove_DragToGoal_Update.SkillMove_DragToGoal_Update_C.ExecuteUbergraph_SkillMove_DragToGoal_Update
// 0x0010 (0x0010 - 0x0000)
struct SkillMove_DragToGoal_Update_C_ExecuteUbergraph_SkillMove_DragToGoal_Update final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillMove_DragToGoal_Update_C_ExecuteUbergraph_SkillMove_DragToGoal_Update) == 0x000008, "Wrong alignment on SkillMove_DragToGoal_Update_C_ExecuteUbergraph_SkillMove_DragToGoal_Update");
static_assert(sizeof(SkillMove_DragToGoal_Update_C_ExecuteUbergraph_SkillMove_DragToGoal_Update) == 0x000010, "Wrong size on SkillMove_DragToGoal_Update_C_ExecuteUbergraph_SkillMove_DragToGoal_Update");
static_assert(offsetof(SkillMove_DragToGoal_Update_C_ExecuteUbergraph_SkillMove_DragToGoal_Update, EntryPoint) == 0x000000, "Member 'SkillMove_DragToGoal_Update_C_ExecuteUbergraph_SkillMove_DragToGoal_Update::EntryPoint' has a wrong offset!");
static_assert(offsetof(SkillMove_DragToGoal_Update_C_ExecuteUbergraph_SkillMove_DragToGoal_Update, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'SkillMove_DragToGoal_Update_C_ExecuteUbergraph_SkillMove_DragToGoal_Update::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(SkillMove_DragToGoal_Update_C_ExecuteUbergraph_SkillMove_DragToGoal_Update, K2Node_Event_OtherActor) == 0x000008, "Member 'SkillMove_DragToGoal_Update_C_ExecuteUbergraph_SkillMove_DragToGoal_Update::K2Node_Event_OtherActor' has a wrong offset!");

// LuaFunction SkillMove_DragToGoal_Update.SkillMove_DragToGoal_Update_C.OnMoveStart
// 0x0010 (0x0010 - 0x0000)
struct SkillMove_DragToGoal_Update_C_OnMoveStart final
{
public:
	class AActor*                                 Launcher;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBaseMovementComponent*                 Movement;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkillMove_DragToGoal_Update_C_OnMoveStart) == 0x000008, "Wrong alignment on SkillMove_DragToGoal_Update_C_OnMoveStart");
static_assert(sizeof(SkillMove_DragToGoal_Update_C_OnMoveStart) == 0x000010, "Wrong size on SkillMove_DragToGoal_Update_C_OnMoveStart");
static_assert(offsetof(SkillMove_DragToGoal_Update_C_OnMoveStart, Launcher) == 0x000000, "Member 'SkillMove_DragToGoal_Update_C_OnMoveStart::Launcher' has a wrong offset!");
static_assert(offsetof(SkillMove_DragToGoal_Update_C_OnMoveStart, Movement) == 0x000008, "Member 'SkillMove_DragToGoal_Update_C_OnMoveStart::Movement' has a wrong offset!");

// LuaFunction SkillMove_DragToGoal_Update.SkillMove_DragToGoal_Update_C.OnMoveEnd
// 0x0008 (0x0008 - 0x0000)
struct SkillMove_DragToGoal_Update_C_OnMoveEnd final
{
public:
	class UBaseMovementComponent*                 Movement;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkillMove_DragToGoal_Update_C_OnMoveEnd) == 0x000008, "Wrong alignment on SkillMove_DragToGoal_Update_C_OnMoveEnd");
static_assert(sizeof(SkillMove_DragToGoal_Update_C_OnMoveEnd) == 0x000008, "Wrong size on SkillMove_DragToGoal_Update_C_OnMoveEnd");
static_assert(offsetof(SkillMove_DragToGoal_Update_C_OnMoveEnd, Movement) == 0x000000, "Member 'SkillMove_DragToGoal_Update_C_OnMoveEnd::Movement' has a wrong offset!");

// LuaFunction SkillMove_DragToGoal_Update.SkillMove_DragToGoal_Update_C.IsUsedToAddVelocityInsteadOverride
// 0x0001 (0x0001 - 0x0000)
struct SkillMove_DragToGoal_Update_C_IsUsedToAddVelocityInsteadOverride final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkillMove_DragToGoal_Update_C_IsUsedToAddVelocityInsteadOverride) == 0x000001, "Wrong alignment on SkillMove_DragToGoal_Update_C_IsUsedToAddVelocityInsteadOverride");
static_assert(sizeof(SkillMove_DragToGoal_Update_C_IsUsedToAddVelocityInsteadOverride) == 0x000001, "Wrong size on SkillMove_DragToGoal_Update_C_IsUsedToAddVelocityInsteadOverride");
static_assert(offsetof(SkillMove_DragToGoal_Update_C_IsUsedToAddVelocityInsteadOverride, ReturnValue) == 0x000000, "Member 'SkillMove_DragToGoal_Update_C_IsUsedToAddVelocityInsteadOverride::ReturnValue' has a wrong offset!");

// LuaFunction SkillMove_DragToGoal_Update.SkillMove_DragToGoal_Update_C.OnMoveTick
// 0x0018 (0x0018 - 0x0000)
struct SkillMove_DragToGoal_Update_C_OnMoveTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Friction;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFluid;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BrakingDeceleration;                               // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBaseMovementComponent*                 Movement;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkillMove_DragToGoal_Update_C_OnMoveTick) == 0x000008, "Wrong alignment on SkillMove_DragToGoal_Update_C_OnMoveTick");
static_assert(sizeof(SkillMove_DragToGoal_Update_C_OnMoveTick) == 0x000018, "Wrong size on SkillMove_DragToGoal_Update_C_OnMoveTick");
static_assert(offsetof(SkillMove_DragToGoal_Update_C_OnMoveTick, DeltaTime) == 0x000000, "Member 'SkillMove_DragToGoal_Update_C_OnMoveTick::DeltaTime' has a wrong offset!");
static_assert(offsetof(SkillMove_DragToGoal_Update_C_OnMoveTick, Friction) == 0x000004, "Member 'SkillMove_DragToGoal_Update_C_OnMoveTick::Friction' has a wrong offset!");
static_assert(offsetof(SkillMove_DragToGoal_Update_C_OnMoveTick, bFluid) == 0x000008, "Member 'SkillMove_DragToGoal_Update_C_OnMoveTick::bFluid' has a wrong offset!");
static_assert(offsetof(SkillMove_DragToGoal_Update_C_OnMoveTick, BrakingDeceleration) == 0x00000C, "Member 'SkillMove_DragToGoal_Update_C_OnMoveTick::BrakingDeceleration' has a wrong offset!");
static_assert(offsetof(SkillMove_DragToGoal_Update_C_OnMoveTick, Movement) == 0x000010, "Member 'SkillMove_DragToGoal_Update_C_OnMoveTick::Movement' has a wrong offset!");

// Function SkillMove_DragToGoal_Update.SkillMove_DragToGoal_Update_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct SkillMove_DragToGoal_Update_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(SkillMove_DragToGoal_Update_C_GetModuleName) == 0x000008, "Wrong alignment on SkillMove_DragToGoal_Update_C_GetModuleName");
static_assert(sizeof(SkillMove_DragToGoal_Update_C_GetModuleName) == 0x000010, "Wrong size on SkillMove_DragToGoal_Update_C_GetModuleName");
static_assert(offsetof(SkillMove_DragToGoal_Update_C_GetModuleName, ReturnValue) == 0x000000, "Member 'SkillMove_DragToGoal_Update_C_GetModuleName::ReturnValue' has a wrong offset!");

}

