#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkillMove_RelativeDirectionMove

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SkillMove_RelativeDirectionMove.SkillMove_RelativeDirectionMove_C
// 0x0020 (0x0208 - 0x01E8)
class USkillMove_RelativeDirectionMove_C final : public USkillMove
{
public:
	float                                         CurrentSpeed;                                      // 0x01E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Acceleration;                                      // 0x01EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxSpeed;                                          // 0x01F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotateSpeed;                                       // 0x01F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Direction;                                         // 0x01F8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTickUpdateDirection;                              // 0x0204(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	bool IsUsedToAddVelocityInsteadOverride();
	float AngleBetweenVectors(const struct FVector& v1, const struct FVector& v2);
	void OnMoveTick(float DeltaTime, float Friction, bool bFluid, float BrakingDeceleration, class UBaseMovementComponent* Movement);
	void OnMoveStart(class AActor* Launcher, class UBaseMovementComponent* Movement);
	void OnMoveEnd(class UBaseMovementComponent* Movement);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SkillMove_RelativeDirectionMove_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SkillMove_RelativeDirectionMove_C")
	}
	static class USkillMove_RelativeDirectionMove_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkillMove_RelativeDirectionMove_C>();
	}
};
DUMPER7_ASSERTS_USkillMove_RelativeDirectionMove_C;

}

