#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkillMove_DragToLoc_Update

#include "Basic.hpp"


namespace SDK::Params
{

// LuaFunction SkillMove_DragToLoc_Update.SkillMove_DragToLoc_Update_C.OnMoveTick
// 0x0018 (0x0018 - 0x0000)
struct SkillMove_DragToLoc_Update_C_OnMoveTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Friction;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFluid;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BrakingDeceleration;                               // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBaseMovementComponent*                 Movement;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkillMove_DragToLoc_Update_C_OnMoveTick;

// LuaFunction SkillMove_DragToLoc_Update.SkillMove_DragToLoc_Update_C.OnMoveStart
// 0x0010 (0x0010 - 0x0000)
struct SkillMove_DragToLoc_Update_C_OnMoveStart final
{
public:
	class AActor*                                 Launcher;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBaseMovementComponent*                 Movement;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkillMove_DragToLoc_Update_C_OnMoveStart;

// LuaFunction SkillMove_DragToLoc_Update.SkillMove_DragToLoc_Update_C.IsUsedToAddVelocityInsteadOverride
// 0x0001 (0x0001 - 0x0000)
struct SkillMove_DragToLoc_Update_C_IsUsedToAddVelocityInsteadOverride final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkillMove_DragToLoc_Update_C_IsUsedToAddVelocityInsteadOverride;

// LuaFunction SkillMove_DragToLoc_Update.SkillMove_DragToLoc_Update_C.OnMoveEnd
// 0x0008 (0x0008 - 0x0000)
struct SkillMove_DragToLoc_Update_C_OnMoveEnd final
{
public:
	class UBaseMovementComponent*                 Movement;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkillMove_DragToLoc_Update_C_OnMoveEnd;

// Function SkillMove_DragToLoc_Update.SkillMove_DragToLoc_Update_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct SkillMove_DragToLoc_Update_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SkillMove_DragToLoc_Update_C_GetModuleName;

}

