#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SM_Boss_101

#include "Basic.hpp"

#include "SMSystem_structs.hpp"
#include "SMSystem_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SM_Boss_101.SM_Boss_101_C
// 0x3188 (0x37D0 - 0x0648)
class USM_Boss_101_C final : public USMInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0648(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SM_Boss_101_SM_Boss_101_C;                         // 0x0650(0x01A8)()
	struct FSMTransition                          SM_Boss_101_SM_Boss_101_C_0;                       // 0x07F8(0x01A8)()
	struct FSMTransition                          SM_Boss_101_SM_Boss_101_C_1;                       // 0x09A0(0x01A8)()
	struct FSMTransition                          SM_Boss_101_SM_Boss_101_C_2;                       // 0x0B48(0x01A8)()
	struct FSMTransition                          SM_Boss_101_SM_Boss_101_C_3;                       // 0x0CF0(0x01A8)()
	struct FSMTransition                          SM_Boss_101_SM_Boss_101_C_4;                       // 0x0E98(0x01A8)()
	struct FSMTransition                          SM_Boss_101_SM_Boss_101_C_5;                       // 0x1040(0x01A8)()
	struct FSMTransition                          SM_Boss_101_SM_Boss_101_C_6;                       // 0x11E8(0x01A8)()
	struct FSMTransition                          SM_Boss_101_SM_Boss_101_C_7;                       // 0x1390(0x01A8)()
	struct FSMTransition                          SM_Boss_101_SM_Boss_101_C_8;                       // 0x1538(0x01A8)()
	struct FSMState                               SM_Boss_101_SM_Boss_101_C_9;                       // 0x16E0(0x01C8)()
	struct FSMConduit                             SM_Boss_101_SM_Boss_101_C_10;                      // 0x18A8(0x01B8)()
	struct FSMState                               SM_Boss_101_SM_Boss_101_C_11;                      // 0x1A60(0x01C8)()
	struct FSMState                               SM_Boss_101_SM_Boss_101_C_12;                      // 0x1C28(0x01C8)()
	struct FSMTransition                          SM_Boss_101_SM_Boss_101_C_13;                      // 0x1DF0(0x01A8)()
	struct FSMTransition                          SM_Boss_101_SM_Boss_101_C_14;                      // 0x1F98(0x01A8)()
	struct FSMTransition                          SM_Boss_101_SM_Boss_101_C_15;                      // 0x2140(0x01A8)()
	struct FSMTransition                          SM_Boss_101_SM_Boss_101_C_16;                      // 0x22E8(0x01A8)()
	struct FSMTransition                          SM_Boss_101_SM_Boss_101_C_17;                      // 0x2490(0x01A8)()
	struct FSMTransition                          SM_Boss_101_SM_Boss_101_C_18;                      // 0x2638(0x01A8)()
	struct FSMTransition                          SM_Boss_101_SM_Boss_101_C_19;                      // 0x27E0(0x01A8)()
	struct FSMTransition                          SM_Boss_101_SM_Boss_101_C_20;                      // 0x2988(0x01A8)()
	struct FSMConduit                             SM_Boss_101_SM_Boss_101_C_21;                      // 0x2B30(0x01B8)()
	struct FSMState                               SM_Boss_101_SM_Boss_101_C_22;                      // 0x2CE8(0x01C8)()
	struct FSMState                               SM_Boss_101_SM_Boss_101_C_23;                      // 0x2EB0(0x01C8)()
	struct FSMState                               SM_Boss_101_SM_Boss_101_C_24;                      // 0x3078(0x01C8)()
	struct FSMState                               SM_Boss_101_SM_Boss_101_C_25;                      // 0x3240(0x01C8)()
	struct FSMStateMachine                        SM_Boss_101_SM_Boss_101_C_26;                      // 0x3408(0x03C0)()
	bool                                          bAbnormal;                                         // 0x37C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_SM_Boss_101(int32 EntryPoint);
	void Func_SM_Boss_101_SM_Boss_101_C_26();
	void Func_SM_Boss_101_SM_Boss_101_C_25();
	void Func_SM_Boss_101_SM_Boss_101_C_24();
	void Func_SM_Boss_101_SM_Boss_101_C_23();
	void Func_SM_Boss_101_SM_Boss_101_C_22();
	void Func_SM_Boss_101_SM_Boss_101_C_21();
	void Func_SM_Boss_101_SM_Boss_101_C_20();
	void Func_SM_Boss_101_SM_Boss_101_C_19();
	void Func_SM_Boss_101_SM_Boss_101_C_18();
	void Func_SM_Boss_101_SM_Boss_101_C_17();
	void Func_SM_Boss_101_SM_Boss_101_C_16();
	void Func_SM_Boss_101_SM_Boss_101_C_15();
	void Func_SM_Boss_101_SM_Boss_101_C_14();
	void Func_SM_Boss_101_SM_Boss_101_C_13();
	void Func_SM_Boss_101_SM_Boss_101_C_12();
	void Func_SM_Boss_101_SM_Boss_101_C_11();
	void Func_SM_Boss_101_SM_Boss_101_C_10();
	void Func_SM_Boss_101_SM_Boss_101_C_9();
	void Func_SM_Boss_101_SM_Boss_101_C_8();
	void Func_SM_Boss_101_SM_Boss_101_C_7();
	void Func_SM_Boss_101_SM_Boss_101_C_6();
	void Func_SM_Boss_101_SM_Boss_101_C_5();
	void Func_SM_Boss_101_SM_Boss_101_C_4();
	void Func_SM_Boss_101_SM_Boss_101_C_3();
	void Func_SM_Boss_101_SM_Boss_101_C_2();
	void Func_SM_Boss_101_SM_Boss_101_C_1();
	void Func_SM_Boss_101_SM_Boss_101_C_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SM_Boss_101_C">();
	}
	static class USM_Boss_101_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USM_Boss_101_C>();
	}
};
static_assert(alignof(USM_Boss_101_C) == 0x000008, "Wrong alignment on USM_Boss_101_C");
static_assert(sizeof(USM_Boss_101_C) == 0x0037D0, "Wrong size on USM_Boss_101_C");
static_assert(offsetof(USM_Boss_101_C, UberGraphFrame) == 0x000648, "Member 'USM_Boss_101_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C) == 0x000650, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_0) == 0x0007F8, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_0' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_1) == 0x0009A0, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_1' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_2) == 0x000B48, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_2' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_3) == 0x000CF0, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_3' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_4) == 0x000E98, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_4' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_5) == 0x001040, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_5' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_6) == 0x0011E8, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_6' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_7) == 0x001390, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_7' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_8) == 0x001538, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_8' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_9) == 0x0016E0, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_9' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_10) == 0x0018A8, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_10' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_11) == 0x001A60, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_11' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_12) == 0x001C28, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_12' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_13) == 0x001DF0, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_13' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_14) == 0x001F98, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_14' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_15) == 0x002140, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_15' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_16) == 0x0022E8, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_16' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_17) == 0x002490, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_17' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_18) == 0x002638, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_18' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_19) == 0x0027E0, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_19' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_20) == 0x002988, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_20' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_21) == 0x002B30, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_21' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_22) == 0x002CE8, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_22' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_23) == 0x002EB0, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_23' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_24) == 0x003078, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_24' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_25) == 0x003240, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_25' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, SM_Boss_101_SM_Boss_101_C_26) == 0x003408, "Member 'USM_Boss_101_C::SM_Boss_101_SM_Boss_101_C_26' has a wrong offset!");
static_assert(offsetof(USM_Boss_101_C, bAbnormal) == 0x0037C8, "Member 'USM_Boss_101_C::bAbnormal' has a wrong offset!");

}

