#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SM_BaseMonster_Abnormal

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function SM_BaseMonster_Abnormal.SM_BaseMonster_Abnormal_C.OnStateMachineUpdate
// 0x0004 (0x0004 - 0x0000)
struct SM_BaseMonster_Abnormal_C_OnStateMachineUpdate final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SM_BaseMonster_Abnormal_C_OnStateMachineUpdate) == 0x000004, "Wrong alignment on SM_BaseMonster_Abnormal_C_OnStateMachineUpdate");
static_assert(sizeof(SM_BaseMonster_Abnormal_C_OnStateMachineUpdate) == 0x000004, "Wrong size on SM_BaseMonster_Abnormal_C_OnStateMachineUpdate");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_OnStateMachineUpdate, DeltaSeconds) == 0x000000, "Member 'SM_BaseMonster_Abnormal_C_OnStateMachineUpdate::DeltaSeconds' has a wrong offset!");

// Function SM_BaseMonster_Abnormal.SM_BaseMonster_Abnormal_C.ExecuteUbergraph_SM_BaseMonster_Abnormal
// 0x00A0 (0x00A0 - 0x0000)
struct SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbnormalInfo                          CallFunc_GetCurrentAbnormalInfo_Info;              // 0x0008(0x0060)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInAbnormal_ReturnValue;                 // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInAbnormal_ReturnValue_1;               // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F[0x1];                                       // 0x007F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetContext_ReturnValue;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal) == 0x000008, "Wrong alignment on SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal");
static_assert(sizeof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal) == 0x0000A0, "Wrong size on SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, EntryPoint) == 0x000000, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::EntryPoint' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, CallFunc_GetCurrentAbnormalInfo_Info) == 0x000008, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::CallFunc_GetCurrentAbnormalInfo_Info' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, CallFunc_MakeLiteralByte_ReturnValue) == 0x000068, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000069, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, CallFunc_Not_PreBool_ReturnValue) == 0x00006A, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00006B, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00006C, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00006D, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, CallFunc_Not_PreBool_ReturnValue_1) == 0x00006E, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00006F, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, CallFunc_Not_PreBool_ReturnValue_2) == 0x000070, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000071, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000072, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, CallFunc_Not_PreBool_ReturnValue_3) == 0x000073, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, CallFunc_IsInAbnormal_ReturnValue) == 0x000074, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::CallFunc_IsInAbnormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x000075, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, CallFunc_Not_PreBool_ReturnValue_4) == 0x000076, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x000077, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000078, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, CallFunc_EqualEqual_ByteByte_ReturnValue_7) == 0x000079, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::CallFunc_EqualEqual_ByteByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, CallFunc_IsInAbnormal_ReturnValue_1) == 0x00007A, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::CallFunc_IsInAbnormal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x00007B, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x00007C, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x00007D, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, CallFunc_MakeLiteralBool_ReturnValue) == 0x00007E, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, K2Node_Event_DeltaSeconds) == 0x000080, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, CallFunc_GetContext_ReturnValue) == 0x000088, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, K2Node_DynamicCast_AsGame_Character) == 0x000090, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'SM_BaseMonster_Abnormal_C_ExecuteUbergraph_SM_BaseMonster_Abnormal::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

