#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SM_HighLevelNpc_Common

#include "Basic.hpp"

#include "SMSystem_structs.hpp"
#include "SMSystem_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SM_HighLevelNpc_Common.SM_HighLevelNpc_Common_C
// 0x17C8 (0x1E10 - 0x0648)
class USM_HighLevelNpc_Common_C final : public USMInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0648(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C;   // 0x0650(0x01A8)()
	struct FSMTransition                          SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_0; // 0x07F8(0x01A8)()
	struct FSMTransition                          SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_1; // 0x09A0(0x01A8)()
	struct FSMTransition                          SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_2; // 0x0B48(0x01A8)()
	struct FSMTransition                          SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_3; // 0x0CF0(0x01A8)()
	struct FSMTransition                          SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_4; // 0x0E98(0x01A8)()
	struct FSMTransition                          SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_5; // 0x1040(0x01A8)()
	struct FSMTransition                          SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_6; // 0x11E8(0x01A8)()
	struct FSMTransition                          SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_7; // 0x1390(0x01A8)()
	struct FSMState                               SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_8; // 0x1538(0x01C8)()
	struct FSMState                               SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_9; // 0x1700(0x01C8)()
	struct FSMState                               SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_10; // 0x18C8(0x01C8)()
	struct FSMConduit                             SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_11; // 0x1A90(0x01B8)()
	struct FSMState                               SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_12; // 0x1C48(0x01C8)()

public:
	void Func_SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_0();
	void Func_SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_1();
	void Func_SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_2();
	void Func_SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_3();
	void Func_SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_4();
	void Func_SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_5();
	void Func_SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_6();
	void Func_SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_7();
	void Func_SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_8();
	void Func_SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_9();
	void Func_SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_10();
	void Func_SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_11();
	void Func_SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_12();
	void Func_SM_HighLevelNpc_Common_SM_HighLevelNpc_Common_C_13();
	void ExecuteUbergraph_SM_HighLevelNpc_Common(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SM_HighLevelNpc_Common_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SM_HighLevelNpc_Common_C")
	}
	static class USM_HighLevelNpc_Common_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USM_HighLevelNpc_Common_C>();
	}
};
DUMPER7_ASSERTS_USM_HighLevelNpc_Common_C;

}

