#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SM_Mon_109

#include "Basic.hpp"

#include "SMSystem_structs.hpp"
#include "SMSystem_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SM_Mon_109.SM_Mon_109_C
// 0x20A8 (0x26F0 - 0x0648)
class USM_Mon_109_C final : public USMInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0648(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SM_Mon_109_SM_Mon_109_C;                           // 0x0650(0x01A8)()
	struct FSMTransition                          SM_Mon_109_SM_Mon_109_C_0;                         // 0x07F8(0x01A8)()
	struct FSMTransition                          SM_Mon_109_SM_Mon_109_C_1;                         // 0x09A0(0x01A8)()
	struct FSMTransition                          SM_Mon_109_SM_Mon_109_C_2;                         // 0x0B48(0x01A8)()
	struct FSMTransition                          SM_Mon_109_SM_Mon_109_C_3;                         // 0x0CF0(0x01A8)()
	struct FSMTransition                          SM_Mon_109_SM_Mon_109_C_4;                         // 0x0E98(0x01A8)()
	struct FSMTransition                          SM_Mon_109_SM_Mon_109_C_5;                         // 0x1040(0x01A8)()
	struct FSMTransition                          SM_Mon_109_SM_Mon_109_C_6;                         // 0x11E8(0x01A8)()
	struct FSMTransition                          SM_Mon_109_SM_Mon_109_C_7;                         // 0x1390(0x01A8)()
	struct FSMTransition                          SM_Mon_109_SM_Mon_109_C_8;                         // 0x1538(0x01A8)()
	struct FSMState                               SM_Mon_109_SM_Mon_109_C_9;                         // 0x16E0(0x01C8)()
	struct FSMConduit                             SM_Mon_109_SM_Mon_109_C_10;                        // 0x18A8(0x01B8)()
	struct FSMState                               SM_Mon_109_SM_Mon_109_C_11;                        // 0x1A60(0x01C8)()
	struct FSMState                               SM_Mon_109_SM_Mon_109_C_12;                        // 0x1C28(0x01C8)()
	struct FSMTransition                          SM_Mon_109_SM_Mon_109_C_13;                        // 0x1DF0(0x01A8)()
	struct FSMState                               SM_Mon_109_SM_Mon_109_C_14;                        // 0x1F98(0x01C8)()
	struct FSMState                               SM_Mon_109_SM_Mon_109_C_15;                        // 0x2160(0x01C8)()
	struct FSMStateMachine                        SM_Mon_109_SM_Mon_109_C_16;                        // 0x2328(0x03C0)()
	bool                                          bAbnormal;                                         // 0x26E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void Func_SM_Mon_109_SM_Mon_109_C_0();
	void Func_SM_Mon_109_SM_Mon_109_C_1();
	void Func_SM_Mon_109_SM_Mon_109_C_2();
	void Func_SM_Mon_109_SM_Mon_109_C_3();
	void Func_SM_Mon_109_SM_Mon_109_C_4();
	void Func_SM_Mon_109_SM_Mon_109_C_5();
	void Func_SM_Mon_109_SM_Mon_109_C_6();
	void Func_SM_Mon_109_SM_Mon_109_C_7();
	void Func_SM_Mon_109_SM_Mon_109_C_8();
	void Func_SM_Mon_109_SM_Mon_109_C_9();
	void Func_SM_Mon_109_SM_Mon_109_C_10();
	void Func_SM_Mon_109_SM_Mon_109_C_11();
	void Func_SM_Mon_109_SM_Mon_109_C_12();
	void Func_SM_Mon_109_SM_Mon_109_C_13();
	void Func_SM_Mon_109_SM_Mon_109_C_14();
	void Func_SM_Mon_109_SM_Mon_109_C_15();
	void Func_SM_Mon_109_SM_Mon_109_C_16();
	void OnStateMachineUpdate(float DeltaSeconds);
	void ExecuteUbergraph_SM_Mon_109(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SM_Mon_109_C">();
	}
	static class USM_Mon_109_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USM_Mon_109_C>();
	}
};
static_assert(alignof(USM_Mon_109_C) == 0x000008, "Wrong alignment on USM_Mon_109_C");
static_assert(sizeof(USM_Mon_109_C) == 0x0026F0, "Wrong size on USM_Mon_109_C");
static_assert(offsetof(USM_Mon_109_C, UberGraphFrame) == 0x000648, "Member 'USM_Mon_109_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USM_Mon_109_C, SM_Mon_109_SM_Mon_109_C) == 0x000650, "Member 'USM_Mon_109_C::SM_Mon_109_SM_Mon_109_C' has a wrong offset!");
static_assert(offsetof(USM_Mon_109_C, SM_Mon_109_SM_Mon_109_C_0) == 0x0007F8, "Member 'USM_Mon_109_C::SM_Mon_109_SM_Mon_109_C_0' has a wrong offset!");
static_assert(offsetof(USM_Mon_109_C, SM_Mon_109_SM_Mon_109_C_1) == 0x0009A0, "Member 'USM_Mon_109_C::SM_Mon_109_SM_Mon_109_C_1' has a wrong offset!");
static_assert(offsetof(USM_Mon_109_C, SM_Mon_109_SM_Mon_109_C_2) == 0x000B48, "Member 'USM_Mon_109_C::SM_Mon_109_SM_Mon_109_C_2' has a wrong offset!");
static_assert(offsetof(USM_Mon_109_C, SM_Mon_109_SM_Mon_109_C_3) == 0x000CF0, "Member 'USM_Mon_109_C::SM_Mon_109_SM_Mon_109_C_3' has a wrong offset!");
static_assert(offsetof(USM_Mon_109_C, SM_Mon_109_SM_Mon_109_C_4) == 0x000E98, "Member 'USM_Mon_109_C::SM_Mon_109_SM_Mon_109_C_4' has a wrong offset!");
static_assert(offsetof(USM_Mon_109_C, SM_Mon_109_SM_Mon_109_C_5) == 0x001040, "Member 'USM_Mon_109_C::SM_Mon_109_SM_Mon_109_C_5' has a wrong offset!");
static_assert(offsetof(USM_Mon_109_C, SM_Mon_109_SM_Mon_109_C_6) == 0x0011E8, "Member 'USM_Mon_109_C::SM_Mon_109_SM_Mon_109_C_6' has a wrong offset!");
static_assert(offsetof(USM_Mon_109_C, SM_Mon_109_SM_Mon_109_C_7) == 0x001390, "Member 'USM_Mon_109_C::SM_Mon_109_SM_Mon_109_C_7' has a wrong offset!");
static_assert(offsetof(USM_Mon_109_C, SM_Mon_109_SM_Mon_109_C_8) == 0x001538, "Member 'USM_Mon_109_C::SM_Mon_109_SM_Mon_109_C_8' has a wrong offset!");
static_assert(offsetof(USM_Mon_109_C, SM_Mon_109_SM_Mon_109_C_9) == 0x0016E0, "Member 'USM_Mon_109_C::SM_Mon_109_SM_Mon_109_C_9' has a wrong offset!");
static_assert(offsetof(USM_Mon_109_C, SM_Mon_109_SM_Mon_109_C_10) == 0x0018A8, "Member 'USM_Mon_109_C::SM_Mon_109_SM_Mon_109_C_10' has a wrong offset!");
static_assert(offsetof(USM_Mon_109_C, SM_Mon_109_SM_Mon_109_C_11) == 0x001A60, "Member 'USM_Mon_109_C::SM_Mon_109_SM_Mon_109_C_11' has a wrong offset!");
static_assert(offsetof(USM_Mon_109_C, SM_Mon_109_SM_Mon_109_C_12) == 0x001C28, "Member 'USM_Mon_109_C::SM_Mon_109_SM_Mon_109_C_12' has a wrong offset!");
static_assert(offsetof(USM_Mon_109_C, SM_Mon_109_SM_Mon_109_C_13) == 0x001DF0, "Member 'USM_Mon_109_C::SM_Mon_109_SM_Mon_109_C_13' has a wrong offset!");
static_assert(offsetof(USM_Mon_109_C, SM_Mon_109_SM_Mon_109_C_14) == 0x001F98, "Member 'USM_Mon_109_C::SM_Mon_109_SM_Mon_109_C_14' has a wrong offset!");
static_assert(offsetof(USM_Mon_109_C, SM_Mon_109_SM_Mon_109_C_15) == 0x002160, "Member 'USM_Mon_109_C::SM_Mon_109_SM_Mon_109_C_15' has a wrong offset!");
static_assert(offsetof(USM_Mon_109_C, SM_Mon_109_SM_Mon_109_C_16) == 0x002328, "Member 'USM_Mon_109_C::SM_Mon_109_SM_Mon_109_C_16' has a wrong offset!");
static_assert(offsetof(USM_Mon_109_C, bAbnormal) == 0x0026E8, "Member 'USM_Mon_109_C::bAbnormal' has a wrong offset!");

}

