#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SM_Mon_002

#include "Basic.hpp"


namespace SDK::Params
{

// Function SM_Mon_002.SM_Mon_002_C.ExecuteUbergraph_SM_Mon_002
// 0x0028 (0x0028 - 0x0000)
struct SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetStateEventId_ReturnValue;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetStateEventId_ReturnValue_1;            // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetStateEventId_ReturnValue_2;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetStateEventId_ReturnValue_3;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetStateEventId_ReturnValue_4;            // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetStateEventId_ReturnValue_5;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetStateEventId_ReturnValue_6;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetStateEventId_ReturnValue_7;            // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetStateEventId_ReturnValue_8;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_10;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_11;           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_12;           // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002) == 0x000004, "Wrong alignment on SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002");
static_assert(sizeof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002) == 0x000028, "Wrong size on SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, EntryPoint) == 0x000000, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::EntryPoint' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000006, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000007, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000008, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_GetStateEventId_ReturnValue) == 0x000009, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_GetStateEventId_ReturnValue' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x00000A, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_GetStateEventId_ReturnValue_1) == 0x00000B, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_GetStateEventId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_GetStateEventId_ReturnValue_2) == 0x00000C, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_GetStateEventId_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_GetStateEventId_ReturnValue_3) == 0x00000D, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_GetStateEventId_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x00000E, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_GetStateEventId_ReturnValue_4) == 0x00000F, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_GetStateEventId_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_GetStateEventId_ReturnValue_5) == 0x000010, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_GetStateEventId_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000011, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_GetStateEventId_ReturnValue_6) == 0x000012, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_GetStateEventId_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000013, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000014, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_Not_PreBool_ReturnValue) == 0x000015, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_GetStateEventId_ReturnValue_7) == 0x000016, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_GetStateEventId_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x000017, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000018, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000019, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_GetStateEventId_ReturnValue_8) == 0x00001A, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_GetStateEventId_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_MakeLiteralByte_ReturnValue_9) == 0x00001B, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_MakeLiteralByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x00001C, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_Not_PreBool_ReturnValue_1) == 0x00001D, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x00001E, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_Not_PreBool_ReturnValue_2) == 0x00001F, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_MakeLiteralByte_ReturnValue_10) == 0x000020, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_MakeLiteralByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_MakeLiteralBool_ReturnValue) == 0x000021, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x000022, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_Not_PreBool_ReturnValue_3) == 0x000023, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_MakeLiteralByte_ReturnValue_11) == 0x000024, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_MakeLiteralByte_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_MakeLiteralByte_ReturnValue_12) == 0x000025, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_MakeLiteralByte_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_EqualEqual_ByteByte_ReturnValue_7) == 0x000026, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_EqualEqual_ByteByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002, CallFunc_EqualEqual_ByteByte_ReturnValue_8) == 0x000027, "Member 'SM_Mon_002_C_ExecuteUbergraph_SM_Mon_002::CallFunc_EqualEqual_ByteByte_ReturnValue_8' has a wrong offset!");

}

