#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMC_BaseMonster

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function SMC_BaseMonster.SMC_BaseMonster_C.OnDie
// 0x01C0 (0x01C0 - 0x0000)
struct SMC_BaseMonster_C_OnDie final
{
public:
	class AGameCharacter*                         Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         Killer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     HealthChangeValue;                                 // 0x0010(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(SMC_BaseMonster_C_OnDie) == 0x000008, "Wrong alignment on SMC_BaseMonster_C_OnDie");
static_assert(sizeof(SMC_BaseMonster_C_OnDie) == 0x0001C0, "Wrong size on SMC_BaseMonster_C_OnDie");
static_assert(offsetof(SMC_BaseMonster_C_OnDie, Character) == 0x000000, "Member 'SMC_BaseMonster_C_OnDie::Character' has a wrong offset!");
static_assert(offsetof(SMC_BaseMonster_C_OnDie, Killer) == 0x000008, "Member 'SMC_BaseMonster_C_OnDie::Killer' has a wrong offset!");
static_assert(offsetof(SMC_BaseMonster_C_OnDie, HealthChangeValue) == 0x000010, "Member 'SMC_BaseMonster_C_OnDie::HealthChangeValue' has a wrong offset!");

// Function SMC_BaseMonster.SMC_BaseMonster_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct SMC_BaseMonster_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SMC_BaseMonster_C_ReceiveTick) == 0x000004, "Wrong alignment on SMC_BaseMonster_C_ReceiveTick");
static_assert(sizeof(SMC_BaseMonster_C_ReceiveTick) == 0x000004, "Wrong size on SMC_BaseMonster_C_ReceiveTick");
static_assert(offsetof(SMC_BaseMonster_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'SMC_BaseMonster_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function SMC_BaseMonster.SMC_BaseMonster_C.OnAIHasNewTarget
// 0x0008 (0x0008 - 0x0000)
struct SMC_BaseMonster_C_OnAIHasNewTarget final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SMC_BaseMonster_C_OnAIHasNewTarget) == 0x000008, "Wrong alignment on SMC_BaseMonster_C_OnAIHasNewTarget");
static_assert(sizeof(SMC_BaseMonster_C_OnAIHasNewTarget) == 0x000008, "Wrong size on SMC_BaseMonster_C_OnAIHasNewTarget");
static_assert(offsetof(SMC_BaseMonster_C_OnAIHasNewTarget, Target) == 0x000000, "Member 'SMC_BaseMonster_C_OnAIHasNewTarget::Target' has a wrong offset!");

// Function SMC_BaseMonster.SMC_BaseMonster_C.ExecuteUbergraph_SMC_BaseMonster
// 0x0230 (0x0230 - 0x0000)
struct SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AGameCharacter* Character, class AGameCharacter* Killer, struct FHealthChangeValue& HealthChangeValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_SetStateEventId_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* Target)>         K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStateEventId_ReturnValue_1;            // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_CustomEvent_Character;                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_CustomEvent_Killer;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_CustomEvent_HealthChangeValue;              // 0x0048(0x01B0)(ConstParm, ContainsInstancedReference)
	class UAbilityComponent*                      CallFunc_GetComponentByClass_ReturnValue;          // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStateEventId_ReturnValue_2;            // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_203[0x1];                                      // 0x0203(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Target;                         // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameAIController*                      K2Node_DynamicCast_AsGame_AIController;            // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster) == 0x000008, "Wrong alignment on SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster");
static_assert(sizeof(SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster) == 0x000230, "Wrong size on SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster");
static_assert(offsetof(SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster, EntryPoint) == 0x000000, "Member 'SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster::EntryPoint' has a wrong offset!");
static_assert(offsetof(SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster, CallFunc_SetStateEventId_ReturnValue) == 0x000018, "Member 'SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster::CallFunc_SetStateEventId_ReturnValue' has a wrong offset!");
static_assert(offsetof(SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00002C, "Member 'SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster, ___bool_Has_Been_Initd_Variable) == 0x00002D, "Member 'SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster, CallFunc_SetStateEventId_ReturnValue_1) == 0x00002E, "Member 'SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster::CallFunc_SetStateEventId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster, ___bool_IsClosed_Variable) == 0x00002F, "Member 'SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster, CallFunc_GetOwner_ReturnValue) == 0x000030, "Member 'SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster, K2Node_CustomEvent_Character) == 0x000038, "Member 'SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster, K2Node_CustomEvent_Killer) == 0x000040, "Member 'SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster::K2Node_CustomEvent_Killer' has a wrong offset!");
static_assert(offsetof(SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster, K2Node_CustomEvent_HealthChangeValue) == 0x000048, "Member 'SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster::K2Node_CustomEvent_HealthChangeValue' has a wrong offset!");
static_assert(offsetof(SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster, CallFunc_GetComponentByClass_ReturnValue) == 0x0001F8, "Member 'SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000200, "Member 'SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster, CallFunc_IsValid_ReturnValue) == 0x000201, "Member 'SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster, CallFunc_SetStateEventId_ReturnValue_2) == 0x000202, "Member 'SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster::CallFunc_SetStateEventId_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster, K2Node_Event_DeltaSeconds) == 0x000204, "Member 'SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster, CallFunc_GetOwner_ReturnValue_1) == 0x000208, "Member 'SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster, K2Node_CustomEvent_Target) == 0x000210, "Member 'SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster, CallFunc_GetAIController_ReturnValue) == 0x000218, "Member 'SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster, K2Node_DynamicCast_AsGame_AIController) == 0x000220, "Member 'SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster::K2Node_DynamicCast_AsGame_AIController' has a wrong offset!");
static_assert(offsetof(SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster, K2Node_DynamicCast_bSuccess) == 0x000228, "Member 'SMC_BaseMonster_C_ExecuteUbergraph_SMC_BaseMonster::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

