#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMExtendedRuntime

#include "Basic.hpp"

#include "SMSystem_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// ScriptStruct SMExtendedRuntime.SMTextSerializer
// 0x0010 (0x0010 - 0x0000)
struct FSMTextSerializer final
{
public:
	TArray<class FName>                           ToTextFunctionNames;                               // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMTextSerializer) == 0x000008, "Wrong alignment on FSMTextSerializer");
static_assert(sizeof(FSMTextSerializer) == 0x000010, "Wrong size on FSMTextSerializer");
static_assert(offsetof(FSMTextSerializer, ToTextFunctionNames) == 0x000000, "Member 'FSMTextSerializer::ToTextFunctionNames' has a wrong offset!");

// ScriptStruct SMExtendedRuntime.SMTextNodeWidgetInfo
// 0x0A78 (0x0A78 - 0x0000)
struct FSMTextNodeWidgetInfo final : public FSMTextDisplayWidgetInfo
{
public:
	struct FInlineEditableTextBlockStyle          EditableTextStyle;                                 // 0x0000(0x0A70)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         WrapTextAt;                                        // 0x0A70(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A74[0x4];                                      // 0x0A74(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMTextNodeWidgetInfo) == 0x000008, "Wrong alignment on FSMTextNodeWidgetInfo");
static_assert(sizeof(FSMTextNodeWidgetInfo) == 0x000A78, "Wrong size on FSMTextNodeWidgetInfo");
static_assert(offsetof(FSMTextNodeWidgetInfo, EditableTextStyle) == 0x000000, "Member 'FSMTextNodeWidgetInfo::EditableTextStyle' has a wrong offset!");
static_assert(offsetof(FSMTextNodeWidgetInfo, WrapTextAt) == 0x000A70, "Member 'FSMTextNodeWidgetInfo::WrapTextAt' has a wrong offset!");

// ScriptStruct SMExtendedRuntime.SMTextGraphProperty
// 0x0AA0 (0x0BB0 - 0x0110)
struct FSMTextGraphProperty final : public FSMGraphProperty_Base
{
public:
	class FText                                   Result;                                            // 0x0110(0x0018)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSMTextSerializer                      TextSerializer;                                    // 0x0128(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSMTextNodeWidgetInfo                  WidgetInfo;                                        // 0x0138(0x0A78)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMTextGraphProperty) == 0x000008, "Wrong alignment on FSMTextGraphProperty");
static_assert(sizeof(FSMTextGraphProperty) == 0x000BB0, "Wrong size on FSMTextGraphProperty");
static_assert(offsetof(FSMTextGraphProperty, Result) == 0x000110, "Member 'FSMTextGraphProperty::Result' has a wrong offset!");
static_assert(offsetof(FSMTextGraphProperty, TextSerializer) == 0x000128, "Member 'FSMTextGraphProperty::TextSerializer' has a wrong offset!");
static_assert(offsetof(FSMTextGraphProperty, WidgetInfo) == 0x000138, "Member 'FSMTextGraphProperty::WidgetInfo' has a wrong offset!");

// ScriptStruct SMExtendedRuntime.SMTextGraphProperty_Runtime
// 0x0028 (0x0078 - 0x0050)
struct FSMTextGraphProperty_Runtime final : public FSMGraphProperty_Base_Runtime
{
public:
	class FText                                   Result;                                            // 0x0050(0x0018)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSMTextSerializer                      TextSerializer;                                    // 0x0068(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMTextGraphProperty_Runtime) == 0x000008, "Wrong alignment on FSMTextGraphProperty_Runtime");
static_assert(sizeof(FSMTextGraphProperty_Runtime) == 0x000078, "Wrong size on FSMTextGraphProperty_Runtime");
static_assert(offsetof(FSMTextGraphProperty_Runtime, Result) == 0x000050, "Member 'FSMTextGraphProperty_Runtime::Result' has a wrong offset!");
static_assert(offsetof(FSMTextGraphProperty_Runtime, TextSerializer) == 0x000068, "Member 'FSMTextGraphProperty_Runtime::TextSerializer' has a wrong offset!");

}

