#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum SMSystem.ESMNetworkConfigurationType
// NumValues: 0x0004
enum class ESMNetworkConfigurationType : uint8
{
	SM_Client                                = 0,
	SM_Server                                = 1,
	SM_ClientAndServer                       = 2,
	SM_MAX                                   = 3,
};

// Enum SMSystem.ESMBlackboardMask
// NumValues: 0x0006
enum class ESMBlackboardMask : uint8
{
	All                                      = 0,
	First8Bit                                = 1,
	Second8Bit                               = 2,
	Third8Bit                                = 3,
	Fourth8Bit                               = 4,
	ESMBlackboardMask_MAX                    = 5,
};

// Enum SMSystem.ESMTransactionType
// NumValues: 0x0003
enum class ESMTransactionType : uint8
{
	SM_Transition                            = 0,
	SM_State                                 = 1,
	SM_MAX                                   = 2,
};

// Enum SMSystem.ESMConditionalEvaluationType
// NumValues: 0x0005
enum class ESMConditionalEvaluationType : uint8
{
	SM_Graph                                 = 0,
	SM_NodeInstance                          = 1,
	SM_AlwaysFalse                           = 2,
	SM_AlwaysTrue                            = 3,
	SM_MAX                                   = 4,
};

// ScriptStruct SMSystem.SMInfo_Base
// 0x0060 (0x0060 - 0x0000)
struct FSMInfo_Base
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NodeName;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  Guid;                                              // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  OwnerGuid;                                         // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  NodeGuid;                                          // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  OwnerNodeGuid;                                     // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USMNodeInstance*                        NodeInstance;                                      // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMInfo_Base) == 0x000008, "Wrong alignment on FSMInfo_Base");
static_assert(sizeof(FSMInfo_Base) == 0x000060, "Wrong size on FSMInfo_Base");
static_assert(offsetof(FSMInfo_Base, NodeName) == 0x000008, "Member 'FSMInfo_Base::NodeName' has a wrong offset!");
static_assert(offsetof(FSMInfo_Base, Guid) == 0x000018, "Member 'FSMInfo_Base::Guid' has a wrong offset!");
static_assert(offsetof(FSMInfo_Base, OwnerGuid) == 0x000028, "Member 'FSMInfo_Base::OwnerGuid' has a wrong offset!");
static_assert(offsetof(FSMInfo_Base, NodeGuid) == 0x000038, "Member 'FSMInfo_Base::NodeGuid' has a wrong offset!");
static_assert(offsetof(FSMInfo_Base, OwnerNodeGuid) == 0x000048, "Member 'FSMInfo_Base::OwnerNodeGuid' has a wrong offset!");
static_assert(offsetof(FSMInfo_Base, NodeInstance) == 0x000058, "Member 'FSMInfo_Base::NodeInstance' has a wrong offset!");

// ScriptStruct SMSystem.SMTransitionInfo
// 0x0030 (0x0090 - 0x0060)
struct FSMTransitionInfo final : public FSMInfo_Base
{
public:
	struct FGuid                                  FromStateGuid;                                     // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ToStateGuid;                                       // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0080(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0xC];                                       // 0x0084(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMTransitionInfo) == 0x000008, "Wrong alignment on FSMTransitionInfo");
static_assert(sizeof(FSMTransitionInfo) == 0x000090, "Wrong size on FSMTransitionInfo");
static_assert(offsetof(FSMTransitionInfo, FromStateGuid) == 0x000060, "Member 'FSMTransitionInfo::FromStateGuid' has a wrong offset!");
static_assert(offsetof(FSMTransitionInfo, ToStateGuid) == 0x000070, "Member 'FSMTransitionInfo::ToStateGuid' has a wrong offset!");
static_assert(offsetof(FSMTransitionInfo, Priority) == 0x000080, "Member 'FSMTransitionInfo::Priority' has a wrong offset!");

// ScriptStruct SMSystem.SMStateInfo
// 0x0020 (0x0080 - 0x0060)
struct FSMStateInfo final : public FSMInfo_Base
{
public:
	TArray<struct FSMTransitionInfo>              OutgoingTransitions;                               // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bIsEndState;                                       // 0x0070(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0xF];                                       // 0x0071(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMStateInfo) == 0x000008, "Wrong alignment on FSMStateInfo");
static_assert(sizeof(FSMStateInfo) == 0x000080, "Wrong size on FSMStateInfo");
static_assert(offsetof(FSMStateInfo, OutgoingTransitions) == 0x000060, "Member 'FSMStateInfo::OutgoingTransitions' has a wrong offset!");
static_assert(offsetof(FSMStateInfo, bIsEndState) == 0x000070, "Member 'FSMStateInfo::bIsEndState' has a wrong offset!");

// ScriptStruct SMSystem.SMExposedFunctionHandler
// 0x0020 (0x0020 - 0x0000)
struct FSMExposedFunctionHandler final
{
public:
	class FName                                   BoundFunction;                                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFunction*                              Function;                                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UObject*                                OwnerObject;                                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMExposedFunctionHandler) == 0x000008, "Wrong alignment on FSMExposedFunctionHandler");
static_assert(sizeof(FSMExposedFunctionHandler) == 0x000020, "Wrong size on FSMExposedFunctionHandler");
static_assert(offsetof(FSMExposedFunctionHandler, BoundFunction) == 0x000000, "Member 'FSMExposedFunctionHandler::BoundFunction' has a wrong offset!");
static_assert(offsetof(FSMExposedFunctionHandler, Function) == 0x000008, "Member 'FSMExposedFunctionHandler::Function' has a wrong offset!");
static_assert(offsetof(FSMExposedFunctionHandler, OwnerObject) == 0x000010, "Member 'FSMExposedFunctionHandler::OwnerObject' has a wrong offset!");

// ScriptStruct SMSystem.SMNodeClassRule
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FSMNodeClassRule
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIncludeChildren;                                  // 0x0008(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNOT;                                              // 0x0009(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMNodeClassRule) == 0x000008, "Wrong alignment on FSMNodeClassRule");
static_assert(sizeof(FSMNodeClassRule) == 0x000010, "Wrong size on FSMNodeClassRule");
static_assert(offsetof(FSMNodeClassRule, bIncludeChildren) == 0x000008, "Member 'FSMNodeClassRule::bIncludeChildren' has a wrong offset!");
static_assert(offsetof(FSMNodeClassRule, bNOT) == 0x000009, "Member 'FSMNodeClassRule::bNOT' has a wrong offset!");

// ScriptStruct SMSystem.SMGraphProperty_Base_Runtime
// 0x0050 (0x0050 - 0x0000)
struct FSMGraphProperty_Base_Runtime
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMExposedFunctionHandler              GraphEvaluator;                                    // 0x0008(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  Guid;                                              // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  OwnerGuid;                                         // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
static_assert(alignof(FSMGraphProperty_Base_Runtime) == 0x000008, "Wrong alignment on FSMGraphProperty_Base_Runtime");
static_assert(sizeof(FSMGraphProperty_Base_Runtime) == 0x000050, "Wrong size on FSMGraphProperty_Base_Runtime");
static_assert(offsetof(FSMGraphProperty_Base_Runtime, GraphEvaluator) == 0x000008, "Member 'FSMGraphProperty_Base_Runtime::GraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMGraphProperty_Base_Runtime, Guid) == 0x000030, "Member 'FSMGraphProperty_Base_Runtime::Guid' has a wrong offset!");
static_assert(offsetof(FSMGraphProperty_Base_Runtime, OwnerGuid) == 0x000040, "Member 'FSMGraphProperty_Base_Runtime::OwnerGuid' has a wrong offset!");

// ScriptStruct SMSystem.SMNode_Base
// 0x0108 (0x0108 - 0x0000)
struct FSMNode_Base
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMExposedFunctionHandler              GraphEvaluator;                                    // 0x0008(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         TimeInState;                                       // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInEndState;                                     // 0x002C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasUpdated;                                       // 0x002D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSMExposedFunctionHandler>      TransitionInitializedGraphEvaluators;              // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSMExposedFunctionHandler>      TransitionShutdownGraphEvaluators;                 // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         DuplicateId;                                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  Guid;                                              // 0x0054(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  OwnerGuid;                                         // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  PathGuid;                                          // 0x0074(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_84[0xC];                                       // 0x0084(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NodeName;                                          // 0x0090(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   TemplateName;                                      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FName>                           StackTemplateNames;                                // 0x00A8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class USMNodeInstance*>                StackNodeInstances;                                // 0x00B8(0x0010)(BlueprintVisible, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class USMInstance*                            OwningInstance;                                    // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USMNodeInstance*                        NodeInstance;                                      // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D8[0x10];                                      // 0x00D8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSMGraphProperty_Base_Runtime>  VariableGraphProperties;                           // 0x00E8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UClass*                                 NodeInstanceClass;                                 // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_100[0x8];                                      // 0x0100(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMNode_Base) == 0x000008, "Wrong alignment on FSMNode_Base");
static_assert(sizeof(FSMNode_Base) == 0x000108, "Wrong size on FSMNode_Base");
static_assert(offsetof(FSMNode_Base, GraphEvaluator) == 0x000008, "Member 'FSMNode_Base::GraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, TimeInState) == 0x000028, "Member 'FSMNode_Base::TimeInState' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, bIsInEndState) == 0x00002C, "Member 'FSMNode_Base::bIsInEndState' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, bHasUpdated) == 0x00002D, "Member 'FSMNode_Base::bHasUpdated' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, TransitionInitializedGraphEvaluators) == 0x000030, "Member 'FSMNode_Base::TransitionInitializedGraphEvaluators' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, TransitionShutdownGraphEvaluators) == 0x000040, "Member 'FSMNode_Base::TransitionShutdownGraphEvaluators' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, DuplicateId) == 0x000050, "Member 'FSMNode_Base::DuplicateId' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, Guid) == 0x000054, "Member 'FSMNode_Base::Guid' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, OwnerGuid) == 0x000064, "Member 'FSMNode_Base::OwnerGuid' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, PathGuid) == 0x000074, "Member 'FSMNode_Base::PathGuid' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, NodeName) == 0x000090, "Member 'FSMNode_Base::NodeName' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, TemplateName) == 0x0000A0, "Member 'FSMNode_Base::TemplateName' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, StackTemplateNames) == 0x0000A8, "Member 'FSMNode_Base::StackTemplateNames' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, StackNodeInstances) == 0x0000B8, "Member 'FSMNode_Base::StackNodeInstances' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, OwningInstance) == 0x0000C8, "Member 'FSMNode_Base::OwningInstance' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, NodeInstance) == 0x0000D0, "Member 'FSMNode_Base::NodeInstance' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, VariableGraphProperties) == 0x0000E8, "Member 'FSMNode_Base::VariableGraphProperties' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, NodeInstanceClass) == 0x0000F8, "Member 'FSMNode_Base::NodeInstanceClass' has a wrong offset!");

// ScriptStruct SMSystem.SMGraphProperty_Runtime
// 0x0000 (0x0050 - 0x0050)
struct FSMGraphProperty_Runtime final : public FSMGraphProperty_Base_Runtime
{
};
static_assert(alignof(FSMGraphProperty_Runtime) == 0x000008, "Wrong alignment on FSMGraphProperty_Runtime");
static_assert(sizeof(FSMGraphProperty_Runtime) == 0x000050, "Wrong size on FSMGraphProperty_Runtime");

// ScriptStruct SMSystem.SMState_Base
// 0x0080 (0x0188 - 0x0108)
struct FSMState_Base : public FSMNode_Base
{
public:
	uint8                                         bIsRootNode : 1;                                   // 0x0108(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAlwaysUpdate : 1;                                 // 0x0108(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEvalTransitionsOnStart : 1;                       // 0x0108(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDisableTickTransitionEvaluation : 1;              // 0x0108(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bStayActiveOnStateChange : 1;                      // 0x0108(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAllowParallelReentry : 1;                         // 0x0108(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMExposedFunctionHandler              OnRootStateMachineStartedGraphEvaluator;           // 0x0110(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	struct FSMExposedFunctionHandler              OnRootStateMachineStoppedGraphEvaluator;           // 0x0130(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_150[0x38];                                     // 0x0150(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMState_Base) == 0x000008, "Wrong alignment on FSMState_Base");
static_assert(sizeof(FSMState_Base) == 0x000188, "Wrong size on FSMState_Base");
static_assert(offsetof(FSMState_Base, OnRootStateMachineStartedGraphEvaluator) == 0x000110, "Member 'FSMState_Base::OnRootStateMachineStartedGraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMState_Base, OnRootStateMachineStoppedGraphEvaluator) == 0x000130, "Member 'FSMState_Base::OnRootStateMachineStoppedGraphEvaluator' has a wrong offset!");

// ScriptStruct SMSystem.SMConduit
// 0x0030 (0x01B8 - 0x0188)
struct FSMConduit final : public FSMState_Base
{
public:
	uint8                                         bCanEnterTransition : 1;                           // 0x0188(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanEvaluate : 1;                                  // 0x0188(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEvalWithTransitions : 1;                          // 0x0188(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMExposedFunctionHandler              ConduitEnteredGraphEvaluator;                      // 0x0190(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B0[0x8];                                      // 0x01B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMConduit) == 0x000008, "Wrong alignment on FSMConduit");
static_assert(sizeof(FSMConduit) == 0x0001B8, "Wrong size on FSMConduit");
static_assert(offsetof(FSMConduit, ConduitEnteredGraphEvaluator) == 0x000190, "Member 'FSMConduit::ConduitEnteredGraphEvaluator' has a wrong offset!");

// ScriptStruct SMSystem.SMGraphProperty_Base
// 0x00C0 (0x0110 - 0x0050)
struct FSMGraphProperty_Base : public FSMGraphProperty_Base_Runtime
{
public:
	class FName                                   VariableName;                                      // 0x0050(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FEdGraphPinType                        VariableType;                                      // 0x0058(0x0058)(NoDestructor, NativeAccessSpecifierPublic)
	struct FMemberReference                       MemberReference;                                   // 0x00B0(0x0038)(NativeAccessSpecifierPublic)
	bool                                          bIsInArray;                                        // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  GuidUnmodified;                                    // 0x00EC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  TemplateGuid;                                      // 0x00FC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         GuidIndex;                                         // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
static_assert(alignof(FSMGraphProperty_Base) == 0x000008, "Wrong alignment on FSMGraphProperty_Base");
static_assert(sizeof(FSMGraphProperty_Base) == 0x000110, "Wrong size on FSMGraphProperty_Base");
static_assert(offsetof(FSMGraphProperty_Base, VariableName) == 0x000050, "Member 'FSMGraphProperty_Base::VariableName' has a wrong offset!");
static_assert(offsetof(FSMGraphProperty_Base, VariableType) == 0x000058, "Member 'FSMGraphProperty_Base::VariableType' has a wrong offset!");
static_assert(offsetof(FSMGraphProperty_Base, MemberReference) == 0x0000B0, "Member 'FSMGraphProperty_Base::MemberReference' has a wrong offset!");
static_assert(offsetof(FSMGraphProperty_Base, bIsInArray) == 0x0000E8, "Member 'FSMGraphProperty_Base::bIsInArray' has a wrong offset!");
static_assert(offsetof(FSMGraphProperty_Base, GuidUnmodified) == 0x0000EC, "Member 'FSMGraphProperty_Base::GuidUnmodified' has a wrong offset!");
static_assert(offsetof(FSMGraphProperty_Base, TemplateGuid) == 0x0000FC, "Member 'FSMGraphProperty_Base::TemplateGuid' has a wrong offset!");
static_assert(offsetof(FSMGraphProperty_Base, GuidIndex) == 0x00010C, "Member 'FSMGraphProperty_Base::GuidIndex' has a wrong offset!");

// ScriptStruct SMSystem.SMGraphProperty
// 0x0000 (0x0110 - 0x0110)
struct FSMGraphProperty final : public FSMGraphProperty_Base
{
};
static_assert(alignof(FSMGraphProperty) == 0x000008, "Wrong alignment on FSMGraphProperty");
static_assert(sizeof(FSMGraphProperty) == 0x000110, "Wrong size on FSMGraphProperty");

// ScriptStruct SMSystem.SMDebugStateMachine
// 0x0001 (0x0001 - 0x0000)
struct FSMDebugStateMachine final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMDebugStateMachine) == 0x000001, "Wrong alignment on FSMDebugStateMachine");
static_assert(sizeof(FSMDebugStateMachine) == 0x000001, "Wrong size on FSMDebugStateMachine");

// ScriptStruct SMSystem.SMNetworkedTransaction
// 0x0040 (0x0040 - 0x0000)
struct FSMNetworkedTransaction final
{
public:
	struct FGuid                                  StateMachineGuid;                                  // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  BaseGuid;                                          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  TransactionGuid;                                   // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              Timestamp;                                         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         TransactionType : 1;                               // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsActive : 1;                                     // 0x0038(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMNetworkedTransaction) == 0x000008, "Wrong alignment on FSMNetworkedTransaction");
static_assert(sizeof(FSMNetworkedTransaction) == 0x000040, "Wrong size on FSMNetworkedTransaction");
static_assert(offsetof(FSMNetworkedTransaction, StateMachineGuid) == 0x000000, "Member 'FSMNetworkedTransaction::StateMachineGuid' has a wrong offset!");
static_assert(offsetof(FSMNetworkedTransaction, BaseGuid) == 0x000010, "Member 'FSMNetworkedTransaction::BaseGuid' has a wrong offset!");
static_assert(offsetof(FSMNetworkedTransaction, TransactionGuid) == 0x000020, "Member 'FSMNetworkedTransaction::TransactionGuid' has a wrong offset!");
static_assert(offsetof(FSMNetworkedTransaction, Timestamp) == 0x000030, "Member 'FSMNetworkedTransaction::Timestamp' has a wrong offset!");

// ScriptStruct SMSystem.SMNodeDescription
// 0x0038 (0x0038 - 0x0000)
struct FSMNodeDescription final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Category;                                          // 0x0008(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0020(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMNodeDescription) == 0x000008, "Wrong alignment on FSMNodeDescription");
static_assert(sizeof(FSMNodeDescription) == 0x000038, "Wrong size on FSMNodeDescription");
static_assert(offsetof(FSMNodeDescription, Name) == 0x000000, "Member 'FSMNodeDescription::Name' has a wrong offset!");
static_assert(offsetof(FSMNodeDescription, Category) == 0x000008, "Member 'FSMNodeDescription::Category' has a wrong offset!");
static_assert(offsetof(FSMNodeDescription, Description) == 0x000020, "Member 'FSMNodeDescription::Description' has a wrong offset!");

// ScriptStruct SMSystem.SMConnectionValidator
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FSMConnectionValidator
{
};
#pragma pack(pop)
static_assert(alignof(FSMConnectionValidator) == 0x000001, "Wrong alignment on FSMConnectionValidator");
static_assert(sizeof(FSMConnectionValidator) == 0x000001, "Wrong size on FSMConnectionValidator");

// ScriptStruct SMSystem.SMStateClassRule
// 0x0028 (0x0038 - 0x0010)
struct FSMStateClassRule final : public FSMNodeClassRule
{
public:
	TSoftClassPtr<class UClass>                   StateClass;                                        // 0x0010(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMStateClassRule) == 0x000008, "Wrong alignment on FSMStateClassRule");
static_assert(sizeof(FSMStateClassRule) == 0x000038, "Wrong size on FSMStateClassRule");
static_assert(offsetof(FSMStateClassRule, StateClass) == 0x000010, "Member 'FSMStateClassRule::StateClass' has a wrong offset!");

// ScriptStruct SMSystem.SMStateMachineNodePlacementValidator
// 0x0018 (0x0018 - 0x0000)
struct FSMStateMachineNodePlacementValidator final : public FSMConnectionValidator
{
public:
	TArray<struct FSMStateClassRule>              AllowedStates;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bAllowReferences;                                  // 0x0010(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowParents;                                     // 0x0011(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMStateMachineNodePlacementValidator) == 0x000008, "Wrong alignment on FSMStateMachineNodePlacementValidator");
static_assert(sizeof(FSMStateMachineNodePlacementValidator) == 0x000018, "Wrong size on FSMStateMachineNodePlacementValidator");
static_assert(offsetof(FSMStateMachineNodePlacementValidator, AllowedStates) == 0x000000, "Member 'FSMStateMachineNodePlacementValidator::AllowedStates' has a wrong offset!");
static_assert(offsetof(FSMStateMachineNodePlacementValidator, bAllowReferences) == 0x000010, "Member 'FSMStateMachineNodePlacementValidator::bAllowReferences' has a wrong offset!");
static_assert(offsetof(FSMStateMachineNodePlacementValidator, bAllowParents) == 0x000011, "Member 'FSMStateMachineNodePlacementValidator::bAllowParents' has a wrong offset!");

// ScriptStruct SMSystem.SMStateMachineClassRule
// 0x0028 (0x0038 - 0x0010)
struct FSMStateMachineClassRule final : public FSMNodeClassRule
{
public:
	TSoftClassPtr<class UClass>                   StateMachineClass;                                 // 0x0010(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMStateMachineClassRule) == 0x000008, "Wrong alignment on FSMStateMachineClassRule");
static_assert(sizeof(FSMStateMachineClassRule) == 0x000038, "Wrong size on FSMStateMachineClassRule");
static_assert(offsetof(FSMStateMachineClassRule, StateMachineClass) == 0x000010, "Member 'FSMStateMachineClassRule::StateMachineClass' has a wrong offset!");

// ScriptStruct SMSystem.SMStateConnectionValidator
// 0x0030 (0x0030 - 0x0000)
struct FSMStateConnectionValidator final : public FSMConnectionValidator
{
public:
	TArray<struct FSMStateClassRule>              AllowedInboundStates;                              // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FSMStateClassRule>              AllowedOutboundStates;                             // 0x0010(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FSMStateMachineClassRule>       AllowedInStateMachines;                            // 0x0020(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMStateConnectionValidator) == 0x000008, "Wrong alignment on FSMStateConnectionValidator");
static_assert(sizeof(FSMStateConnectionValidator) == 0x000030, "Wrong size on FSMStateConnectionValidator");
static_assert(offsetof(FSMStateConnectionValidator, AllowedInboundStates) == 0x000000, "Member 'FSMStateConnectionValidator::AllowedInboundStates' has a wrong offset!");
static_assert(offsetof(FSMStateConnectionValidator, AllowedOutboundStates) == 0x000010, "Member 'FSMStateConnectionValidator::AllowedOutboundStates' has a wrong offset!");
static_assert(offsetof(FSMStateConnectionValidator, AllowedInStateMachines) == 0x000020, "Member 'FSMStateConnectionValidator::AllowedInStateMachines' has a wrong offset!");

// ScriptStruct SMSystem.SMNodeConnectionRule
// 0x00A8 (0x00A8 - 0x0000)
struct FSMNodeConnectionRule final
{
public:
	struct FSMStateClassRule                      FromState;                                         // 0x0000(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSMStateClassRule                      ToState;                                           // 0x0038(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSMStateMachineClassRule               InStateMachine;                                    // 0x0070(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMNodeConnectionRule) == 0x000008, "Wrong alignment on FSMNodeConnectionRule");
static_assert(sizeof(FSMNodeConnectionRule) == 0x0000A8, "Wrong size on FSMNodeConnectionRule");
static_assert(offsetof(FSMNodeConnectionRule, FromState) == 0x000000, "Member 'FSMNodeConnectionRule::FromState' has a wrong offset!");
static_assert(offsetof(FSMNodeConnectionRule, ToState) == 0x000038, "Member 'FSMNodeConnectionRule::ToState' has a wrong offset!");
static_assert(offsetof(FSMNodeConnectionRule, InStateMachine) == 0x000070, "Member 'FSMNodeConnectionRule::InStateMachine' has a wrong offset!");

// ScriptStruct SMSystem.SMTransitionConnectionValidator
// 0x0010 (0x0010 - 0x0000)
struct FSMTransitionConnectionValidator final : public FSMConnectionValidator
{
public:
	TArray<struct FSMNodeConnectionRule>          AllowedConnections;                                // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMTransitionConnectionValidator) == 0x000008, "Wrong alignment on FSMTransitionConnectionValidator");
static_assert(sizeof(FSMTransitionConnectionValidator) == 0x000010, "Wrong size on FSMTransitionConnectionValidator");
static_assert(offsetof(FSMTransitionConnectionValidator, AllowedConnections) == 0x000000, "Member 'FSMTransitionConnectionValidator::AllowedConnections' has a wrong offset!");

// ScriptStruct SMSystem.SMNodeWidgetInfo
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FSMNodeWidgetInfo
{
};
#pragma pack(pop)
static_assert(alignof(FSMNodeWidgetInfo) == 0x000001, "Wrong alignment on FSMNodeWidgetInfo");
static_assert(sizeof(FSMNodeWidgetInfo) == 0x000001, "Wrong size on FSMNodeWidgetInfo");

// ScriptStruct SMSystem.SMTextDisplayWidgetInfo
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FSMTextDisplayWidgetInfo : public FSMNodeWidgetInfo
{
};
#pragma pack(pop)
static_assert(alignof(FSMTextDisplayWidgetInfo) == 0x000001, "Wrong alignment on FSMTextDisplayWidgetInfo");
static_assert(sizeof(FSMTextDisplayWidgetInfo) == 0x000001, "Wrong size on FSMTextDisplayWidgetInfo");

// ScriptStruct SMSystem.SMState
// 0x0040 (0x01C8 - 0x0188)
struct FSMState final : public FSMState_Base
{
public:
	struct FSMExposedFunctionHandler              UpdateStateGraphEvaluator;                         // 0x0188(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	struct FSMExposedFunctionHandler              EndStateGraphEvaluator;                            // 0x01A8(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMState) == 0x000008, "Wrong alignment on FSMState");
static_assert(sizeof(FSMState) == 0x0001C8, "Wrong size on FSMState");
static_assert(offsetof(FSMState, UpdateStateGraphEvaluator) == 0x000188, "Member 'FSMState::UpdateStateGraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMState, EndStateGraphEvaluator) == 0x0001A8, "Member 'FSMState::EndStateGraphEvaluator' has a wrong offset!");

// ScriptStruct SMSystem.SMStateMachine
// 0x0238 (0x03C0 - 0x0188)
struct FSMStateMachine final : public FSMState_Base
{
public:
	bool                                          bHasAdditionalLogic;                               // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReuseCurrentState;                                // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyReuseIfNotEndState;                           // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowIndependentTick;                             // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCallReferenceTickOnManualUpdate;                  // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReuseReference;                                   // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWaitForEndState;                                  // 0x018E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18F[0x1];                                      // 0x018F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMExposedFunctionHandler              UpdateStateGraphEvaluator;                         // 0x0190(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	struct FSMExposedFunctionHandler              EndStateGraphEvaluator;                            // 0x01B0(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D0[0x28];                                     // 0x01D0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGuid, struct FSMNetworkedTransaction> PreviousTransactions;                              // 0x01F8(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_248[0x140];                                    // 0x0248(0x0140)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ReferencedStateMachineClass;                       // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ReferencedTemplateName;                            // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USMInstance*                            ReferencedStateMachine;                            // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USMInstance*                            IsReferencedByInstance;                            // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A8[0x18];                                     // 0x03A8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMStateMachine) == 0x000008, "Wrong alignment on FSMStateMachine");
static_assert(sizeof(FSMStateMachine) == 0x0003C0, "Wrong size on FSMStateMachine");
static_assert(offsetof(FSMStateMachine, bHasAdditionalLogic) == 0x000188, "Member 'FSMStateMachine::bHasAdditionalLogic' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, bReuseCurrentState) == 0x000189, "Member 'FSMStateMachine::bReuseCurrentState' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, bOnlyReuseIfNotEndState) == 0x00018A, "Member 'FSMStateMachine::bOnlyReuseIfNotEndState' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, bAllowIndependentTick) == 0x00018B, "Member 'FSMStateMachine::bAllowIndependentTick' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, bCallReferenceTickOnManualUpdate) == 0x00018C, "Member 'FSMStateMachine::bCallReferenceTickOnManualUpdate' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, bReuseReference) == 0x00018D, "Member 'FSMStateMachine::bReuseReference' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, bWaitForEndState) == 0x00018E, "Member 'FSMStateMachine::bWaitForEndState' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, UpdateStateGraphEvaluator) == 0x000190, "Member 'FSMStateMachine::UpdateStateGraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, EndStateGraphEvaluator) == 0x0001B0, "Member 'FSMStateMachine::EndStateGraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, PreviousTransactions) == 0x0001F8, "Member 'FSMStateMachine::PreviousTransactions' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, ReferencedStateMachineClass) == 0x000388, "Member 'FSMStateMachine::ReferencedStateMachineClass' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, ReferencedTemplateName) == 0x000390, "Member 'FSMStateMachine::ReferencedTemplateName' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, ReferencedStateMachine) == 0x000398, "Member 'FSMStateMachine::ReferencedStateMachine' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, IsReferencedByInstance) == 0x0003A0, "Member 'FSMStateMachine::IsReferencedByInstance' has a wrong offset!");

// ScriptStruct SMSystem.SMTransition
// 0x00A0 (0x01A8 - 0x0108)
struct FSMTransition final : public FSMNode_Base
{
public:
	struct FSMExposedFunctionHandler              TransitionEnteredGraphEvaluator;                   // 0x0108(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	struct FSMExposedFunctionHandler              TransitionPreEvaluateGraphEvaluator;               // 0x0128(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	struct FSMExposedFunctionHandler              TransitionPostEvaluateGraphEvaluator;              // 0x0148(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0168(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bCanEnterTransition : 1;                           // 0x016C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanEnterTransitionFromEvent : 1;                  // 0x016C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsEvaluating : 1;                                 // 0x016C(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanEvaluate : 1;                                  // 0x016C(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanEvaluateFromEvent : 1;                         // 0x016C(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bRunParallel : 1;                                  // 0x016C(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEvalIfNextStateActive : 1;                        // 0x016C(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanEvalWithStartState : 1;                        // 0x016C(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAlwaysFalse : 1;                                  // 0x016D(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_16E[0x2];                                      // 0x016E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  FromGuid;                                          // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ToGuid;                                            // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESMConditionalEvaluationType                  ConditionalEvaluationType;                         // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_191[0x17];                                     // 0x0191(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMTransition) == 0x000008, "Wrong alignment on FSMTransition");
static_assert(sizeof(FSMTransition) == 0x0001A8, "Wrong size on FSMTransition");
static_assert(offsetof(FSMTransition, TransitionEnteredGraphEvaluator) == 0x000108, "Member 'FSMTransition::TransitionEnteredGraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMTransition, TransitionPreEvaluateGraphEvaluator) == 0x000128, "Member 'FSMTransition::TransitionPreEvaluateGraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMTransition, TransitionPostEvaluateGraphEvaluator) == 0x000148, "Member 'FSMTransition::TransitionPostEvaluateGraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMTransition, Priority) == 0x000168, "Member 'FSMTransition::Priority' has a wrong offset!");
static_assert(offsetof(FSMTransition, FromGuid) == 0x000170, "Member 'FSMTransition::FromGuid' has a wrong offset!");
