#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK::Params
{

// Function SMSystem.SMNodeInstance.GetContext
// 0x0008 (0x0008 - 0x0000)
struct SMNodeInstance_GetContext final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMNodeInstance_GetContext) == 0x000008, "Wrong alignment on SMNodeInstance_GetContext");
static_assert(sizeof(SMNodeInstance_GetContext) == 0x000008, "Wrong size on SMNodeInstance_GetContext");
static_assert(offsetof(SMNodeInstance_GetContext, ReturnValue) == 0x000000, "Member 'SMNodeInstance_GetContext::ReturnValue' has a wrong offset!");

// Function SMSystem.SMNodeInstance.GetGuid
// 0x0010 (0x0010 - 0x0000)
struct SMNodeInstance_GetGuid final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMNodeInstance_GetGuid) == 0x000004, "Wrong alignment on SMNodeInstance_GetGuid");
static_assert(sizeof(SMNodeInstance_GetGuid) == 0x000010, "Wrong size on SMNodeInstance_GetGuid");
static_assert(offsetof(SMNodeInstance_GetGuid, ReturnValue) == 0x000000, "Member 'SMNodeInstance_GetGuid::ReturnValue' has a wrong offset!");

// Function SMSystem.SMNodeInstance.GetNodeIcon
// 0x0008 (0x0008 - 0x0000)
struct SMNodeInstance_GetNodeIcon final
{
public:
	class UTexture2D*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMNodeInstance_GetNodeIcon) == 0x000008, "Wrong alignment on SMNodeInstance_GetNodeIcon");
static_assert(sizeof(SMNodeInstance_GetNodeIcon) == 0x000008, "Wrong size on SMNodeInstance_GetNodeIcon");
static_assert(offsetof(SMNodeInstance_GetNodeIcon, ReturnValue) == 0x000000, "Member 'SMNodeInstance_GetNodeIcon::ReturnValue' has a wrong offset!");

// Function SMSystem.SMNodeInstance.GetNodeIconSize
// 0x0008 (0x0008 - 0x0000)
struct SMNodeInstance_GetNodeIconSize final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMNodeInstance_GetNodeIconSize) == 0x000004, "Wrong alignment on SMNodeInstance_GetNodeIconSize");
static_assert(sizeof(SMNodeInstance_GetNodeIconSize) == 0x000008, "Wrong size on SMNodeInstance_GetNodeIconSize");
static_assert(offsetof(SMNodeInstance_GetNodeIconSize, ReturnValue) == 0x000000, "Member 'SMNodeInstance_GetNodeIconSize::ReturnValue' has a wrong offset!");

// Function SMSystem.SMNodeInstance.GetNodeIconTintColor
// 0x0010 (0x0010 - 0x0000)
struct SMNodeInstance_GetNodeIconTintColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMNodeInstance_GetNodeIconTintColor) == 0x000004, "Wrong alignment on SMNodeInstance_GetNodeIconTintColor");
static_assert(sizeof(SMNodeInstance_GetNodeIconTintColor) == 0x000010, "Wrong size on SMNodeInstance_GetNodeIconTintColor");
static_assert(offsetof(SMNodeInstance_GetNodeIconTintColor, ReturnValue) == 0x000000, "Member 'SMNodeInstance_GetNodeIconTintColor::ReturnValue' has a wrong offset!");

// Function SMSystem.SMNodeInstance.GetNodeName
// 0x0010 (0x0010 - 0x0000)
struct SMNodeInstance_GetNodeName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMNodeInstance_GetNodeName) == 0x000008, "Wrong alignment on SMNodeInstance_GetNodeName");
static_assert(sizeof(SMNodeInstance_GetNodeName) == 0x000010, "Wrong size on SMNodeInstance_GetNodeName");
static_assert(offsetof(SMNodeInstance_GetNodeName, ReturnValue) == 0x000000, "Member 'SMNodeInstance_GetNodeName::ReturnValue' has a wrong offset!");

// Function SMSystem.SMNodeInstance.GetOwningStateMachineNodeInstance
// 0x0008 (0x0008 - 0x0000)
struct SMNodeInstance_GetOwningStateMachineNodeInstance final
{
public:
	class USMStateMachineInstance*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMNodeInstance_GetOwningStateMachineNodeInstance) == 0x000008, "Wrong alignment on SMNodeInstance_GetOwningStateMachineNodeInstance");
static_assert(sizeof(SMNodeInstance_GetOwningStateMachineNodeInstance) == 0x000008, "Wrong size on SMNodeInstance_GetOwningStateMachineNodeInstance");
static_assert(offsetof(SMNodeInstance_GetOwningStateMachineNodeInstance, ReturnValue) == 0x000000, "Member 'SMNodeInstance_GetOwningStateMachineNodeInstance::ReturnValue' has a wrong offset!");

// Function SMSystem.SMNodeInstance.GetStateMachineInstance
// 0x0010 (0x0010 - 0x0000)
struct SMNodeInstance_GetStateMachineInstance final
{
public:
	bool                                          bTopMostInstance;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USMInstance*                            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMNodeInstance_GetStateMachineInstance) == 0x000008, "Wrong alignment on SMNodeInstance_GetStateMachineInstance");
static_assert(sizeof(SMNodeInstance_GetStateMachineInstance) == 0x000010, "Wrong size on SMNodeInstance_GetStateMachineInstance");
static_assert(offsetof(SMNodeInstance_GetStateMachineInstance, bTopMostInstance) == 0x000000, "Member 'SMNodeInstance_GetStateMachineInstance::bTopMostInstance' has a wrong offset!");
static_assert(offsetof(SMNodeInstance_GetStateMachineInstance, ReturnValue) == 0x000008, "Member 'SMNodeInstance_GetStateMachineInstance::ReturnValue' has a wrong offset!");

// Function SMSystem.SMNodeInstance.GetTimeInState
// 0x0004 (0x0004 - 0x0000)
struct SMNodeInstance_GetTimeInState final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMNodeInstance_GetTimeInState) == 0x000004, "Wrong alignment on SMNodeInstance_GetTimeInState");
static_assert(sizeof(SMNodeInstance_GetTimeInState) == 0x000004, "Wrong size on SMNodeInstance_GetTimeInState");
static_assert(offsetof(SMNodeInstance_GetTimeInState, ReturnValue) == 0x000000, "Member 'SMNodeInstance_GetTimeInState::ReturnValue' has a wrong offset!");

// Function SMSystem.SMNodeInstance.HasUpdated
// 0x0001 (0x0001 - 0x0000)
struct SMNodeInstance_HasUpdated final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMNodeInstance_HasUpdated) == 0x000001, "Wrong alignment on SMNodeInstance_HasUpdated");
static_assert(sizeof(SMNodeInstance_HasUpdated) == 0x000001, "Wrong size on SMNodeInstance_HasUpdated");
static_assert(offsetof(SMNodeInstance_HasUpdated, ReturnValue) == 0x000000, "Member 'SMNodeInstance_HasUpdated::ReturnValue' has a wrong offset!");

// Function SMSystem.SMNodeInstance.IsActive
// 0x0001 (0x0001 - 0x0000)
struct SMNodeInstance_IsActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMNodeInstance_IsActive) == 0x000001, "Wrong alignment on SMNodeInstance_IsActive");
static_assert(sizeof(SMNodeInstance_IsActive) == 0x000001, "Wrong size on SMNodeInstance_IsActive");
static_assert(offsetof(SMNodeInstance_IsActive, ReturnValue) == 0x000000, "Member 'SMNodeInstance_IsActive::ReturnValue' has a wrong offset!");

// Function SMSystem.SMNodeInstance.IsInEndState
// 0x0001 (0x0001 - 0x0000)
struct SMNodeInstance_IsInEndState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMNodeInstance_IsInEndState) == 0x000001, "Wrong alignment on SMNodeInstance_IsInEndState");
static_assert(sizeof(SMNodeInstance_IsInEndState) == 0x000001, "Wrong size on SMNodeInstance_IsInEndState");
static_assert(offsetof(SMNodeInstance_IsInEndState, ReturnValue) == 0x000000, "Member 'SMNodeInstance_IsInEndState::ReturnValue' has a wrong offset!");

// Function SMSystem.SMStateInstance_Base.OnStateUpdate
// 0x0004 (0x0004 - 0x0000)
struct SMStateInstance_Base_OnStateUpdate final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMStateInstance_Base_OnStateUpdate) == 0x000004, "Wrong alignment on SMStateInstance_Base_OnStateUpdate");
static_assert(sizeof(SMStateInstance_Base_OnStateUpdate) == 0x000004, "Wrong size on SMStateInstance_Base_OnStateUpdate");
static_assert(offsetof(SMStateInstance_Base_OnStateUpdate, DeltaSeconds) == 0x000000, "Member 'SMStateInstance_Base_OnStateUpdate::DeltaSeconds' has a wrong offset!");

// Function SMSystem.SMStateInstance_Base.SetActive
// 0x0001 (0x0001 - 0x0000)
struct SMStateInstance_Base_SetActive final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMStateInstance_Base_SetActive) == 0x000001, "Wrong alignment on SMStateInstance_Base_SetActive");
static_assert(sizeof(SMStateInstance_Base_SetActive) == 0x000001, "Wrong size on SMStateInstance_Base_SetActive");
static_assert(offsetof(SMStateInstance_Base_SetActive, bValue) == 0x000000, "Member 'SMStateInstance_Base_SetActive::bValue' has a wrong offset!");

// Function SMSystem.SMStateInstance_Base.SwitchToLinkedState
// 0x0010 (0x0010 - 0x0000)
struct SMStateInstance_Base_SwitchToLinkedState final
{
public:
	class USMStateInstance_Base*                  NextStateInstance;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequireTransitionToPass;                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SMStateInstance_Base_SwitchToLinkedState) == 0x000008, "Wrong alignment on SMStateInstance_Base_SwitchToLinkedState");
static_assert(sizeof(SMStateInstance_Base_SwitchToLinkedState) == 0x000010, "Wrong size on SMStateInstance_Base_SwitchToLinkedState");
static_assert(offsetof(SMStateInstance_Base_SwitchToLinkedState, NextStateInstance) == 0x000000, "Member 'SMStateInstance_Base_SwitchToLinkedState::NextStateInstance' has a wrong offset!");
static_assert(offsetof(SMStateInstance_Base_SwitchToLinkedState, bRequireTransitionToPass) == 0x000008, "Member 'SMStateInstance_Base_SwitchToLinkedState::bRequireTransitionToPass' has a wrong offset!");
static_assert(offsetof(SMStateInstance_Base_SwitchToLinkedState, ReturnValue) == 0x000009, "Member 'SMStateInstance_Base_SwitchToLinkedState::ReturnValue' has a wrong offset!");

// Function SMSystem.SMStateInstance_Base.GetIncomingTransitions
// 0x0018 (0x0018 - 0x0000)
struct SMStateInstance_Base_GetIncomingTransitions final
{
public:
	TArray<class USMTransitionInstance*>          Transitions;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bExcludeAlwaysFalse;                               // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SMStateInstance_Base_GetIncomingTransitions) == 0x000008, "Wrong alignment on SMStateInstance_Base_GetIncomingTransitions");
static_assert(sizeof(SMStateInstance_Base_GetIncomingTransitions) == 0x000018, "Wrong size on SMStateInstance_Base_GetIncomingTransitions");
static_assert(offsetof(SMStateInstance_Base_GetIncomingTransitions, Transitions) == 0x000000, "Member 'SMStateInstance_Base_GetIncomingTransitions::Transitions' has a wrong offset!");
static_assert(offsetof(SMStateInstance_Base_GetIncomingTransitions, bExcludeAlwaysFalse) == 0x000010, "Member 'SMStateInstance_Base_GetIncomingTransitions::bExcludeAlwaysFalse' has a wrong offset!");
static_assert(offsetof(SMStateInstance_Base_GetIncomingTransitions, ReturnValue) == 0x000011, "Member 'SMStateInstance_Base_GetIncomingTransitions::ReturnValue' has a wrong offset!");

// Function SMSystem.SMStateInstance_Base.GetNextStateByTransitionIndex
// 0x0010 (0x0010 - 0x0000)
struct SMStateInstance_Base_GetNextStateByTransitionIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USMStateInstance_Base*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMStateInstance_Base_GetNextStateByTransitionIndex) == 0x000008, "Wrong alignment on SMStateInstance_Base_GetNextStateByTransitionIndex");
static_assert(sizeof(SMStateInstance_Base_GetNextStateByTransitionIndex) == 0x000010, "Wrong size on SMStateInstance_Base_GetNextStateByTransitionIndex");
static_assert(offsetof(SMStateInstance_Base_GetNextStateByTransitionIndex, Index_0) == 0x000000, "Member 'SMStateInstance_Base_GetNextStateByTransitionIndex::Index_0' has a wrong offset!");
static_assert(offsetof(SMStateInstance_Base_GetNextStateByTransitionIndex, ReturnValue) == 0x000008, "Member 'SMStateInstance_Base_GetNextStateByTransitionIndex::ReturnValue' has a wrong offset!");

// Function SMSystem.SMStateInstance_Base.GetOutgoingTransitions
// 0x0018 (0x0018 - 0x0000)
struct SMStateInstance_Base_GetOutgoingTransitions final
{
public:
	TArray<class USMTransitionInstance*>          Transitions;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bExcludeAlwaysFalse;                               // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SMStateInstance_Base_GetOutgoingTransitions) == 0x000008, "Wrong alignment on SMStateInstance_Base_GetOutgoingTransitions");
static_assert(sizeof(SMStateInstance_Base_GetOutgoingTransitions) == 0x000018, "Wrong size on SMStateInstance_Base_GetOutgoingTransitions");
static_assert(offsetof(SMStateInstance_Base_GetOutgoingTransitions, Transitions) == 0x000000, "Member 'SMStateInstance_Base_GetOutgoingTransitions::Transitions' has a wrong offset!");
static_assert(offsetof(SMStateInstance_Base_GetOutgoingTransitions, bExcludeAlwaysFalse) == 0x000010, "Member 'SMStateInstance_Base_GetOutgoingTransitions::bExcludeAlwaysFalse' has a wrong offset!");
static_assert(offsetof(SMStateInstance_Base_GetOutgoingTransitions, ReturnValue) == 0x000011, "Member 'SMStateInstance_Base_GetOutgoingTransitions::ReturnValue' has a wrong offset!");

// Function SMSystem.SMStateInstance_Base.GetStateInfo
// 0x0080 (0x0080 - 0x0000)
struct SMStateInstance_Base_GetStateInfo final
{
public:
	struct FSMStateInfo                           State;                                             // 0x0000(0x0080)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMStateInstance_Base_GetStateInfo) == 0x000008, "Wrong alignment on SMStateInstance_Base_GetStateInfo");
static_assert(sizeof(SMStateInstance_Base_GetStateInfo) == 0x000080, "Wrong size on SMStateInstance_Base_GetStateInfo");
static_assert(offsetof(SMStateInstance_Base_GetStateInfo, State) == 0x000000, "Member 'SMStateInstance_Base_GetStateInfo::State' has a wrong offset!");

// Function SMSystem.SMStateInstance_Base.GetTransitionByIndex
// 0x0010 (0x0010 - 0x0000)
struct SMStateInstance_Base_GetTransitionByIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USMTransitionInstance*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMStateInstance_Base_GetTransitionByIndex) == 0x000008, "Wrong alignment on SMStateInstance_Base_GetTransitionByIndex");
static_assert(sizeof(SMStateInstance_Base_GetTransitionByIndex) == 0x000010, "Wrong size on SMStateInstance_Base_GetTransitionByIndex");
static_assert(offsetof(SMStateInstance_Base_GetTransitionByIndex, Index_0) == 0x000000, "Member 'SMStateInstance_Base_GetTransitionByIndex::Index_0' has a wrong offset!");
static_assert(offsetof(SMStateInstance_Base_GetTransitionByIndex, ReturnValue) == 0x000008, "Member 'SMStateInstance_Base_GetTransitionByIndex::ReturnValue' has a wrong offset!");

// Function SMSystem.SMStateInstance_Base.GetTransitionToTake
// 0x0008 (0x0008 - 0x0000)
struct SMStateInstance_Base_GetTransitionToTake final
{
public:
	class USMTransitionInstance*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMStateInstance_Base_GetTransitionToTake) == 0x000008, "Wrong alignment on SMStateInstance_Base_GetTransitionToTake");
static_assert(sizeof(SMStateInstance_Base_GetTransitionToTake) == 0x000008, "Wrong size on SMStateInstance_Base_GetTransitionToTake");
static_assert(offsetof(SMStateInstance_Base_GetTransitionToTake, ReturnValue) == 0x000000, "Member 'SMStateInstance_Base_GetTransitionToTake::ReturnValue' has a wrong offset!");

// Function SMSystem.SMStateInstance_Base.IsStateMachine
// 0x0001 (0x0001 - 0x0000)
struct SMStateInstance_Base_IsStateMachine final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMStateInstance_Base_IsStateMachine) == 0x000001, "Wrong alignment on SMStateInstance_Base_IsStateMachine");
static_assert(sizeof(SMStateInstance_Base_IsStateMachine) == 0x000001, "Wrong size on SMStateInstance_Base_IsStateMachine");
static_assert(offsetof(SMStateInstance_Base_IsStateMachine, ReturnValue) == 0x000000, "Member 'SMStateInstance_Base_IsStateMachine::ReturnValue' has a wrong offset!");

// Function SMSystem.SMConduitInstance.SetCanEvaluate
// 0x0001 (0x0001 - 0x0000)
struct SMConduitInstance_SetCanEvaluate final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMConduitInstance_SetCanEvaluate) == 0x000001, "Wrong alignment on SMConduitInstance_SetCanEvaluate");
static_assert(sizeof(SMConduitInstance_SetCanEvaluate) == 0x000001, "Wrong size on SMConduitInstance_SetCanEvaluate");
static_assert(offsetof(SMConduitInstance_SetCanEvaluate, bValue) == 0x000000, "Member 'SMConduitInstance_SetCanEvaluate::bValue' has a wrong offset!");

// Function SMSystem.SMConduitInstance.CanEnterTransition
// 0x0001 (0x0001 - 0x0000)
struct SMConduitInstance_CanEnterTransition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMConduitInstance_CanEnterTransition) == 0x000001, "Wrong alignment on SMConduitInstance_CanEnterTransition");
static_assert(sizeof(SMConduitInstance_CanEnterTransition) == 0x000001, "Wrong size on SMConduitInstance_CanEnterTransition");
static_assert(offsetof(SMConduitInstance_CanEnterTransition, ReturnValue) == 0x000000, "Member 'SMConduitInstance_CanEnterTransition::ReturnValue' has a wrong offset!");

// Function SMSystem.SMConduitInstance.GetCanEvaluate
// 0x0001 (0x0001 - 0x0000)
struct SMConduitInstance_GetCanEvaluate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMConduitInstance_GetCanEvaluate) == 0x000001, "Wrong alignment on SMConduitInstance_GetCanEvaluate");
static_assert(sizeof(SMConduitInstance_GetCanEvaluate) == 0x000001, "Wrong size on SMConduitInstance_GetCanEvaluate");
static_assert(offsetof(SMConduitInstance_GetCanEvaluate, ReturnValue) == 0x000000, "Member 'SMConduitInstance_GetCanEvaluate::ReturnValue' has a wrong offset!");

// Function SMSystem.SMInstance.GetBlackboardState
// 0x0002 (0x0002 - 0x0000)
struct SMInstance_GetBlackboardState final
{
public:
	ESMBlackboardMask                             Mask;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_GetBlackboardState) == 0x000001, "Wrong alignment on SMInstance_GetBlackboardState");
static_assert(sizeof(SMInstance_GetBlackboardState) == 0x000002, "Wrong size on SMInstance_GetBlackboardState");
static_assert(offsetof(SMInstance_GetBlackboardState, Mask) == 0x000000, "Member 'SMInstance_GetBlackboardState::Mask' has a wrong offset!");
static_assert(offsetof(SMInstance_GetBlackboardState, ReturnValue) == 0x000001, "Member 'SMInstance_GetBlackboardState::ReturnValue' has a wrong offset!");

// Function SMSystem.SMInstance.GetMasterReferenceOwner
// 0x0008 (0x0008 - 0x0000)
struct SMInstance_GetMasterReferenceOwner final
{
public:
	class USMInstance*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_GetMasterReferenceOwner) == 0x000008, "Wrong alignment on SMInstance_GetMasterReferenceOwner");
static_assert(sizeof(SMInstance_GetMasterReferenceOwner) == 0x000008, "Wrong size on SMInstance_GetMasterReferenceOwner");
static_assert(offsetof(SMInstance_GetMasterReferenceOwner, ReturnValue) == 0x000000, "Member 'SMInstance_GetMasterReferenceOwner::ReturnValue' has a wrong offset!");

// Function SMSystem.SMInstance.Initialize
// 0x0008 (0x0008 - 0x0000)
struct SMInstance_Initialize final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_Initialize) == 0x000008, "Wrong alignment on SMInstance_Initialize");
static_assert(sizeof(SMInstance_Initialize) == 0x000008, "Wrong size on SMInstance_Initialize");
static_assert(offsetof(SMInstance_Initialize, Context) == 0x000000, "Member 'SMInstance_Initialize::Context' has a wrong offset!");

// Function SMSystem.SMInstance.Internal_EventCleanup
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_Internal_EventCleanup final
{
public:
	struct FGuid                                  NodeGuid;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_Internal_EventCleanup) == 0x000004, "Wrong alignment on SMInstance_Internal_EventCleanup");
static_assert(sizeof(SMInstance_Internal_EventCleanup) == 0x000010, "Wrong size on SMInstance_Internal_EventCleanup");
static_assert(offsetof(SMInstance_Internal_EventCleanup, NodeGuid) == 0x000000, "Member 'SMInstance_Internal_EventCleanup::NodeGuid' has a wrong offset!");

// Function SMSystem.SMInstance.Internal_Update
// 0x0004 (0x0004 - 0x0000)
struct SMInstance_Internal_Update final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_Internal_Update) == 0x000004, "Wrong alignment on SMInstance_Internal_Update");
static_assert(sizeof(SMInstance_Internal_Update) == 0x000004, "Wrong size on SMInstance_Internal_Update");
static_assert(offsetof(SMInstance_Internal_Update, DeltaSeconds) == 0x000000, "Member 'SMInstance_Internal_Update::DeltaSeconds' has a wrong offset!");

// Function SMSystem.SMInstance.LoadFromMultipleStates
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_LoadFromMultipleStates final
{
public:
	TArray<struct FGuid>                          FromGuids;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_LoadFromMultipleStates) == 0x000008, "Wrong alignment on SMInstance_LoadFromMultipleStates");
static_assert(sizeof(SMInstance_LoadFromMultipleStates) == 0x000010, "Wrong size on SMInstance_LoadFromMultipleStates");
static_assert(offsetof(SMInstance_LoadFromMultipleStates, FromGuids) == 0x000000, "Member 'SMInstance_LoadFromMultipleStates::FromGuids' has a wrong offset!");

// Function SMSystem.SMInstance.LoadFromState
// 0x0014 (0x0014 - 0x0000)
struct SMInstance_LoadFromState final
{
public:
	struct FGuid                                  FromGuid;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllParents;                                       // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SMInstance_LoadFromState) == 0x000004, "Wrong alignment on SMInstance_LoadFromState");
static_assert(sizeof(SMInstance_LoadFromState) == 0x000014, "Wrong size on SMInstance_LoadFromState");
static_assert(offsetof(SMInstance_LoadFromState, FromGuid) == 0x000000, "Member 'SMInstance_LoadFromState::FromGuid' has a wrong offset!");
static_assert(offsetof(SMInstance_LoadFromState, bAllParents) == 0x000010, "Member 'SMInstance_LoadFromState::bAllParents' has a wrong offset!");

// Function SMSystem.SMInstance.OnStateMachineStateChanged
// 0x0100 (0x0100 - 0x0000)
struct SMInstance_OnStateMachineStateChanged final
{
public:
	struct FSMStateInfo                           ToState;                                           // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSMStateInfo                           FromState;                                         // 0x0080(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_OnStateMachineStateChanged) == 0x000008, "Wrong alignment on SMInstance_OnStateMachineStateChanged");
static_assert(sizeof(SMInstance_OnStateMachineStateChanged) == 0x000100, "Wrong size on SMInstance_OnStateMachineStateChanged");
static_assert(offsetof(SMInstance_OnStateMachineStateChanged, ToState) == 0x000000, "Member 'SMInstance_OnStateMachineStateChanged::ToState' has a wrong offset!");
static_assert(offsetof(SMInstance_OnStateMachineStateChanged, FromState) == 0x000080, "Member 'SMInstance_OnStateMachineStateChanged::FromState' has a wrong offset!");

// Function SMSystem.SMInstance.OnStateMachineTransitionTaken
// 0x0090 (0x0090 - 0x0000)
struct SMInstance_OnStateMachineTransitionTaken final
{
public:
	struct FSMTransitionInfo                      Transition;                                        // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_OnStateMachineTransitionTaken) == 0x000008, "Wrong alignment on SMInstance_OnStateMachineTransitionTaken");
static_assert(sizeof(SMInstance_OnStateMachineTransitionTaken) == 0x000090, "Wrong size on SMInstance_OnStateMachineTransitionTaken");
static_assert(offsetof(SMInstance_OnStateMachineTransitionTaken, Transition) == 0x000000, "Member 'SMInstance_OnStateMachineTransitionTaken::Transition' has a wrong offset!");

// Function SMSystem.SMInstance.OnStateMachineUpdate
// 0x0004 (0x0004 - 0x0000)
struct SMInstance_OnStateMachineUpdate final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_OnStateMachineUpdate) == 0x000004, "Wrong alignment on SMInstance_OnStateMachineUpdate");
static_assert(sizeof(SMInstance_OnStateMachineUpdate) == 0x000004, "Wrong size on SMInstance_OnStateMachineUpdate");
static_assert(offsetof(SMInstance_OnStateMachineUpdate, DeltaSeconds) == 0x000000, "Member 'SMInstance_OnStateMachineUpdate::DeltaSeconds' has a wrong offset!");

// Function SMSystem.SMInstance.ProcessTransition
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_ProcessTransition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_ProcessTransition) == 0x000001, "Wrong alignment on SMInstance_ProcessTransition");
static_assert(sizeof(SMInstance_ProcessTransition) == 0x000001, "Wrong size on SMInstance_ProcessTransition");
static_assert(offsetof(SMInstance_ProcessTransition, ReturnValue) == 0x000000, "Member 'SMInstance_ProcessTransition::ReturnValue' has a wrong offset!");

// Function SMSystem.SMInstance.SetAutoManageTime
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_SetAutoManageTime final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_SetAutoManageTime) == 0x000001, "Wrong alignment on SMInstance_SetAutoManageTime");
static_assert(sizeof(SMInstance_SetAutoManageTime) == 0x000001, "Wrong size on SMInstance_SetAutoManageTime");
static_assert(offsetof(SMInstance_SetAutoManageTime, Value) == 0x000000, "Member 'SMInstance_SetAutoManageTime::Value' has a wrong offset!");

// Function SMSystem.SMInstance.SetBlackboardState
// 0x0002 (0x0002 - 0x0000)
struct SMInstance_SetBlackboardState final
{
public:
	uint8                                         Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESMBlackboardMask                             Mask;                                              // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_SetBlackboardState) == 0x000001, "Wrong alignment on SMInstance_SetBlackboardState");
static_assert(sizeof(SMInstance_SetBlackboardState) == 0x000002, "Wrong size on SMInstance_SetBlackboardState");
static_assert(offsetof(SMInstance_SetBlackboardState, Value) == 0x000000, "Member 'SMInstance_SetBlackboardState::Value' has a wrong offset!");
static_assert(offsetof(SMInstance_SetBlackboardState, Mask) == 0x000001, "Member 'SMInstance_SetBlackboardState::Mask' has a wrong offset!");

// Function SMSystem.SMInstance.SetCanEverTick
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_SetCanEverTick final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_SetCanEverTick) == 0x000001, "Wrong alignment on SMInstance_SetCanEverTick");
static_assert(sizeof(SMInstance_SetCanEverTick) == 0x000001, "Wrong size on SMInstance_SetCanEverTick");
static_assert(offsetof(SMInstance_SetCanEverTick, Value) == 0x000000, "Member 'SMInstance_SetCanEverTick::Value' has a wrong offset!");

// Function SMSystem.SMInstance.SetCanTickWhenPaused
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_SetCanTickWhenPaused final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_SetCanTickWhenPaused) == 0x000001, "Wrong alignment on SMInstance_SetCanTickWhenPaused");
static_assert(sizeof(SMInstance_SetCanTickWhenPaused) == 0x000001, "Wrong size on SMInstance_SetCanTickWhenPaused");
static_assert(offsetof(SMInstance_SetCanTickWhenPaused, Value) == 0x000000, "Member 'SMInstance_SetCanTickWhenPaused::Value' has a wrong offset!");

// Function SMSystem.SMInstance.SetContext
// 0x0008 (0x0008 - 0x0000)
struct SMInstance_SetContext final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_SetContext) == 0x000008, "Wrong alignment on SMInstance_SetContext");
static_assert(sizeof(SMInstance_SetContext) == 0x000008, "Wrong size on SMInstance_SetContext");
static_assert(offsetof(SMInstance_SetContext, Context) == 0x000000, "Member 'SMInstance_SetContext::Context' has a wrong offset!");

// Function SMSystem.SMInstance.SetCurrentStateId
// 0x0002 (0x0002 - 0x0000)
struct SMInstance_SetCurrentStateId final
{
public:
	uint8                                         CurrentStateId;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_SetCurrentStateId) == 0x000001, "Wrong alignment on SMInstance_SetCurrentStateId");
static_assert(sizeof(SMInstance_SetCurrentStateId) == 0x000002, "Wrong size on SMInstance_SetCurrentStateId");
static_assert(offsetof(SMInstance_SetCurrentStateId, CurrentStateId) == 0x000000, "Member 'SMInstance_SetCurrentStateId::CurrentStateId' has a wrong offset!");
static_assert(offsetof(SMInstance_SetCurrentStateId, ReturnValue) == 0x000001, "Member 'SMInstance_SetCurrentStateId::ReturnValue' has a wrong offset!");

// Function SMSystem.SMInstance.SetStateEvent
// 0x0003 (0x0003 - 0x0000)
struct SMInstance_SetStateEvent final
{
public:
	uint8                                         StateEventId;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreTransitionCheck;                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_SetStateEvent) == 0x000001, "Wrong alignment on SMInstance_SetStateEvent");
static_assert(sizeof(SMInstance_SetStateEvent) == 0x000003, "Wrong size on SMInstance_SetStateEvent");
static_assert(offsetof(SMInstance_SetStateEvent, StateEventId) == 0x000000, "Member 'SMInstance_SetStateEvent::StateEventId' has a wrong offset!");
static_assert(offsetof(SMInstance_SetStateEvent, bIgnoreTransitionCheck) == 0x000001, "Member 'SMInstance_SetStateEvent::bIgnoreTransitionCheck' has a wrong offset!");
static_assert(offsetof(SMInstance_SetStateEvent, ReturnValue) == 0x000002, "Member 'SMInstance_SetStateEvent::ReturnValue' has a wrong offset!");

// Function SMSystem.SMInstance.SetStateMachineClass
// 0x0008 (0x0008 - 0x0000)
struct SMInstance_SetStateMachineClass final
{
public:
	TSubclassOf<class USMStateMachineInstance>    NewStateMachineClass;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_SetStateMachineClass) == 0x000008, "Wrong alignment on SMInstance_SetStateMachineClass");
static_assert(sizeof(SMInstance_SetStateMachineClass) == 0x000008, "Wrong size on SMInstance_SetStateMachineClass");
static_assert(offsetof(SMInstance_SetStateMachineClass, NewStateMachineClass) == 0x000000, "Member 'SMInstance_SetStateMachineClass::NewStateMachineClass' has a wrong offset!");

// Function SMSystem.SMInstance.SetStopOnEndState
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_SetStopOnEndState final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_SetStopOnEndState) == 0x000001, "Wrong alignment on SMInstance_SetStopOnEndState");
static_assert(sizeof(SMInstance_SetStopOnEndState) == 0x000001, "Wrong size on SMInstance_SetStopOnEndState");
static_assert(offsetof(SMInstance_SetStopOnEndState, Value) == 0x000000, "Member 'SMInstance_SetStopOnEndState::Value' has a wrong offset!");

// Function SMSystem.SMInstance.SetTickInterval
// 0x0004 (0x0004 - 0x0000)
struct SMInstance_SetTickInterval final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_SetTickInterval) == 0x000004, "Wrong alignment on SMInstance_SetTickInterval");
static_assert(sizeof(SMInstance_SetTickInterval) == 0x000004, "Wrong size on SMInstance_SetTickInterval");
static_assert(offsetof(SMInstance_SetTickInterval, Value) == 0x000000, "Member 'SMInstance_SetTickInterval::Value' has a wrong offset!");

// Function SMSystem.SMInstance.SetTickOnManualUpdate
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_SetTickOnManualUpdate final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_SetTickOnManualUpdate) == 0x000001, "Wrong alignment on SMInstance_SetTickOnManualUpdate");
static_assert(sizeof(SMInstance_SetTickOnManualUpdate) == 0x000001, "Wrong size on SMInstance_SetTickOnManualUpdate");
static_assert(offsetof(SMInstance_SetTickOnManualUpdate, Value) == 0x000000, "Member 'SMInstance_SetTickOnManualUpdate::Value' has a wrong offset!");

// Function SMSystem.SMInstance.StartWithNewContext
// 0x0008 (0x0008 - 0x0000)
struct SMInstance_StartWithNewContext final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_StartWithNewContext) == 0x000008, "Wrong alignment on SMInstance_StartWithNewContext");
static_assert(sizeof(SMInstance_StartWithNewContext) == 0x000008, "Wrong size on SMInstance_StartWithNewContext");
static_assert(offsetof(SMInstance_StartWithNewContext, Context) == 0x000000, "Member 'SMInstance_StartWithNewContext::Context' has a wrong offset!");

// Function SMSystem.SMInstance.Tick
// 0x0004 (0x0004 - 0x0000)
struct SMInstance_Tick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_Tick) == 0x000004, "Wrong alignment on SMInstance_Tick");
static_assert(sizeof(SMInstance_Tick) == 0x000004, "Wrong size on SMInstance_Tick");
static_assert(offsetof(SMInstance_Tick, DeltaTime) == 0x000000, "Member 'SMInstance_Tick::DeltaTime' has a wrong offset!");

// Function SMSystem.SMInstance.Update
// 0x0004 (0x0004 - 0x0000)
struct SMInstance_Update final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_Update) == 0x000004, "Wrong alignment on SMInstance_Update");
static_assert(sizeof(SMInstance_Update) == 0x000004, "Wrong size on SMInstance_Update");
static_assert(offsetof(SMInstance_Update, DeltaSeconds) == 0x000000, "Member 'SMInstance_Update::DeltaSeconds' has a wrong offset!");

// Function SMSystem.SMInstance.CanAutoManageTime
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_CanAutoManageTime final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_CanAutoManageTime) == 0x000001, "Wrong alignment on SMInstance_CanAutoManageTime");
static_assert(sizeof(SMInstance_CanAutoManageTime) == 0x000001, "Wrong size on SMInstance_CanAutoManageTime");
static_assert(offsetof(SMInstance_CanAutoManageTime, ReturnValue) == 0x000000, "Member 'SMInstance_CanAutoManageTime::ReturnValue' has a wrong offset!");

// Function SMSystem.SMInstance.CanEverTick
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_CanEverTick final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_CanEverTick) == 0x000001, "Wrong alignment on SMInstance_CanEverTick");
static_assert(sizeof(SMInstance_CanEverTick) == 0x000001, "Wrong size on SMInstance_CanEverTick");
static_assert(offsetof(SMInstance_CanEverTick, ReturnValue) == 0x000000, "Member 'SMInstance_CanEverTick::ReturnValue' has a wrong offset!");

// Function SMSystem.SMInstance.CanTickOnManualUpdate
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_CanTickOnManualUpdate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_CanTickOnManualUpdate) == 0x000001, "Wrong alignment on SMInstance_CanTickOnManualUpdate");
static_assert(sizeof(SMInstance_CanTickOnManualUpdate) == 0x000001, "Wrong size on SMInstance_CanTickOnManualUpdate");
static_assert(offsetof(SMInstance_CanTickOnManualUpdate, ReturnValue) == 0x000000, "Member 'SMInstance_CanTickOnManualUpdate::ReturnValue' has a wrong offset!");

// Function SMSystem.SMInstance.GetActiveStateGuid
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_GetActiveStateGuid final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_GetActiveStateGuid) == 0x000004, "Wrong alignment on SMInstance_GetActiveStateGuid");
static_assert(sizeof(SMInstance_GetActiveStateGuid) == 0x000010, "Wrong size on SMInstance_GetActiveStateGuid");
static_assert(offsetof(SMInstance_GetActiveStateGuid, ReturnValue) == 0x000000, "Member 'SMInstance_GetActiveStateGuid::ReturnValue' has a wrong offset!");

// Function SMSystem.SMInstance.GetActiveStateInstance
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_GetActiveStateInstance final
{
public:
	bool                                          bCheckNested;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USMStateInstance_Base*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_GetActiveStateInstance) == 0x000008, "Wrong alignment on SMInstance_GetActiveStateInstance");
static_assert(sizeof(SMInstance_GetActiveStateInstance) == 0x000010, "Wrong size on SMInstance_GetActiveStateInstance");
static_assert(offsetof(SMInstance_GetActiveStateInstance, bCheckNested) == 0x000000, "Member 'SMInstance_GetActiveStateInstance::bCheckNested' has a wrong offset!");
static_assert(offsetof(SMInstance_GetActiveStateInstance, ReturnValue) == 0x000008, "Member 'SMInstance_GetActiveStateInstance::ReturnValue' has a wrong offset!");

// Function SMSystem.SMInstance.GetActiveStateName
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_GetActiveStateName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_GetActiveStateName) == 0x000008, "Wrong alignment on SMInstance_GetActiveStateName");
static_assert(sizeof(SMInstance_GetActiveStateName) == 0x000010, "Wrong size on SMInstance_GetActiveStateName");
static_assert(offsetof(SMInstance_GetActiveStateName, ReturnValue) == 0x000000, "Member 'SMInstance_GetActiveStateName::ReturnValue' has a wrong offset!");

// Function SMSystem.SMInstance.GetAllActiveStateGuids
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_GetAllActiveStateGuids final
{
public:
	TArray<struct FGuid>                          ActiveGuids;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_GetAllActiveStateGuids) == 0x000008, "Wrong alignment on SMInstance_GetAllActiveStateGuids");
static_assert(sizeof(SMInstance_GetAllActiveStateGuids) == 0x000010, "Wrong size on SMInstance_GetAllActiveStateGuids");
static_assert(offsetof(SMInstance_GetAllActiveStateGuids, ActiveGuids) == 0x000000, "Member 'SMInstance_GetAllActiveStateGuids::ActiveGuids' has a wrong offset!");

// Function SMSystem.SMInstance.GetAllActiveStateInstances
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_GetAllActiveStateInstances final
{
public:
	TArray<class USMStateInstance_Base*>          ActiveStateInstances;                              // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_GetAllActiveStateInstances) == 0x000008, "Wrong alignment on SMInstance_GetAllActiveStateInstances");
static_assert(sizeof(SMInstance_GetAllActiveStateInstances) == 0x000010, "Wrong size on SMInstance_GetAllActiveStateInstances");
static_assert(offsetof(SMInstance_GetAllActiveStateInstances, ActiveStateInstances) == 0x000000, "Member 'SMInstance_GetAllActiveStateInstances::ActiveStateInstances' has a wrong offset!");

// Function SMSystem.SMInstance.GetAllCurrentStateGuids
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_GetAllCurrentStateGuids final
{
public:
	TArray<struct FGuid>                          ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_GetAllCurrentStateGuids) == 0x000008, "Wrong alignment on SMInstance_GetAllCurrentStateGuids");
static_assert(sizeof(SMInstance_GetAllCurrentStateGuids) == 0x000010, "Wrong size on SMInstance_GetAllCurrentStateGuids");
static_assert(offsetof(SMInstance_GetAllCurrentStateGuids, ReturnValue) == 0x000000, "Member 'SMInstance_GetAllCurrentStateGuids::ReturnValue' has a wrong offset!");

// Function SMSystem.SMInstance.GetAllReferencedInstances
// 0x0018 (0x0018 - 0x0000)
struct SMInstance_GetAllReferencedInstances final
{
public:
	bool                                          bIncludeChildren;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USMInstance*>                    ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_GetAllReferencedInstances) == 0x000008, "Wrong alignment on SMInstance_GetAllReferencedInstances");
static_assert(sizeof(SMInstance_GetAllReferencedInstances) == 0x000018, "Wrong size on SMInstance_GetAllReferencedInstances");
static_assert(offsetof(SMInstance_GetAllReferencedInstances, bIncludeChildren) == 0x000000, "Member 'SMInstance_GetAllReferencedInstances::bIncludeChildren' has a wrong offset!");
static_assert(offsetof(SMInstance_GetAllReferencedInstances, ReturnValue) == 0x000008, "Member 'SMInstance_GetAllReferencedInstances::ReturnValue' has a wrong offset!");

// Function SMSystem.SMInstance.GetAllStateInstances
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_GetAllStateInstances final
{
public:
	TArray<class USMStateInstance_Base*>          StateInstances;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_GetAllStateInstances) == 0x000008, "Wrong alignment on SMInstance_GetAllStateInstances");
static_assert(sizeof(SMInstance_GetAllStateInstances) == 0x000010, "Wrong size on SMInstance_GetAllStateInstances");
static_assert(offsetof(SMInstance_GetAllStateInstances, StateInstances) == 0x000000, "Member 'SMInstance_GetAllStateInstances::StateInstances' has a wrong offset!");

// Function SMSystem.SMInstance.GetAllTransitionInstances
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_GetAllTransitionInstances final
{
public:
	TArray<class USMTransitionInstance*>          TransitionInstances;                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_GetAllTransitionInstances) == 0x000008, "Wrong alignment on SMInstance_GetAllTransitionInstances");
static_assert(sizeof(SMInstance_GetAllTransitionInstances) == 0x000010, "Wrong size on SMInstance_GetAllTransitionInstances");
static_assert(offsetof(SMInstance_GetAllTransitionInstances, TransitionInstances) == 0x000000, "Member 'SMInstance_GetAllTransitionInstances::TransitionInstances' has a wrong offset!");

// Function SMSystem.SMInstance.GetComponentOwner
// 0x0008 (0x0008 - 0x0000)
struct SMInstance_GetComponentOwner final
{
public:
	class USMStateMachineComponent*               ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_GetComponentOwner) == 0x000008, "Wrong alignment on SMInstance_GetComponentOwner");
static_assert(sizeof(SMInstance_GetComponentOwner) == 0x000008, "Wrong size on SMInstance_GetComponentOwner");
static_assert(offsetof(SMInstance_GetComponentOwner, ReturnValue) == 0x000000, "Member 'SMInstance_GetComponentOwner::ReturnValue' has a wrong offset!");

// Function SMSystem.SMInstance.GetContext
// 0x0008 (0x0008 - 0x0000)
struct SMInstance_GetContext final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_GetContext) == 0x000008, "Wrong alignment on SMInstance_GetContext");
static_assert(sizeof(SMInstance_GetContext) == 0x000008, "Wrong size on SMInstance_GetContext");
static_assert(offsetof(SMInstance_GetContext, ReturnValue) == 0x000000, "Member 'SMInstance_GetContext::ReturnValue' has a wrong offset!");

// Function SMSystem.SMInstance.GetCurrentStateId
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_GetCurrentStateId final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_GetCurrentStateId) == 0x000001, "Wrong alignment on SMInstance_GetCurrentStateId");
static_assert(sizeof(SMInstance_GetCurrentStateId) == 0x000001, "Wrong size on SMInstance_GetCurrentStateId");
static_assert(offsetof(SMInstance_GetCurrentStateId, ReturnValue) == 0x000000, "Member 'SMInstance_GetCurrentStateId::ReturnValue' has a wrong offset!");

// Function SMSystem.SMInstance.GetNestedActiveStateGuid
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_GetNestedActiveStateGuid final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_GetNestedActiveStateGuid) == 0x000004, "Wrong alignment on SMInstance_GetNestedActiveStateGuid");
static_assert(sizeof(SMInstance_GetNestedActiveStateGuid) == 0x000010, "Wrong size on SMInstance_GetNestedActiveStateGuid");
static_assert(offsetof(SMInstance_GetNestedActiveStateGuid, ReturnValue) == 0x000000, "Member 'SMInstance_GetNestedActiveStateGuid::ReturnValue' has a wrong offset!");

// Function SMSystem.SMInstance.GetNestedActiveStateName
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_GetNestedActiveStateName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SMInstance_GetNestedActiveStateName) == 0x000008, "Wrong alignment on SMInstance_GetNestedActiveStateName");
static_assert(sizeof(SMInstance_GetNestedActiveStateName) == 0x000010, "Wrong size on SMInstance_GetNestedActiveStateName");
static_assert(offsetof(SMInstance_GetNestedActiveStateName, ReturnValue) == 0x000000, "Member 'SMInstance_GetNestedActiveStateName::ReturnValue' has a wrong offset!");

// Function SMSystem.SMInstance.GetReferencedInstanceByGuid
// 0x0018 (0x0018 - 0x0000)
struct SMInstance_GetReferencedInstanceByGuid final
{
public:
