#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Snow_Str

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Snow_Str.Snow_Str
// 0x0060 (0x0060 - 0x0000)
struct FSnow_Str final
{
public:
	struct FLinearColor                           ___r_19_30C0BCCF4C7028B57B05BFA9A5F7719A;          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           GI_r_22_C0E462464C19B54B60BCC09ED30CF0FB;          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           _I_r_24_1F0E0D794906B94D453991AAD6399CF6;          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___25_BAE9E1834A63504A702520A525C9485C;            // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _____44_DF488FD9481BA0B7725295B5E661A61D;          // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _____43_BBDAE82D4A25B31621A39D86449E68C2;          // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Minus__r_52_9FE71F3048C62F2C953FEA87D9A53E3D;      // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GI___35_717A35A643937BCC76AA5CA6638C300B;          // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _____28_2C88C46A406D36D50D40E38ED6ED499F;          // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _I___27_EBD194BF473152C3A2768D9D50C40765;          // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __I6__55_8DA99E054E14D35578111B9779062D25;         // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __I___53_00FD55DD47F78C76160272921D071ABD;         // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Roughness_31_477916944E6C4B0515633299B1104D7D;     // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Normal_58_DAEABA89440CC261FA633DA81FFE86C1;        // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AO_33_A8D45074483B1CD856F1F7A5B283BC3C;            // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSnow_Str) == 0x000004, "Wrong alignment on FSnow_Str");
static_assert(sizeof(FSnow_Str) == 0x000060, "Wrong size on FSnow_Str");
static_assert(offsetof(FSnow_Str, ___r_19_30C0BCCF4C7028B57B05BFA9A5F7719A) == 0x000000, "Member 'FSnow_Str::___r_19_30C0BCCF4C7028B57B05BFA9A5F7719A' has a wrong offset!");
static_assert(offsetof(FSnow_Str, GI_r_22_C0E462464C19B54B60BCC09ED30CF0FB) == 0x000010, "Member 'FSnow_Str::GI_r_22_C0E462464C19B54B60BCC09ED30CF0FB' has a wrong offset!");
static_assert(offsetof(FSnow_Str, _I_r_24_1F0E0D794906B94D453991AAD6399CF6) == 0x000020, "Member 'FSnow_Str::_I_r_24_1F0E0D794906B94D453991AAD6399CF6' has a wrong offset!");
static_assert(offsetof(FSnow_Str, ___25_BAE9E1834A63504A702520A525C9485C) == 0x000030, "Member 'FSnow_Str::___25_BAE9E1834A63504A702520A525C9485C' has a wrong offset!");
static_assert(offsetof(FSnow_Str, _____44_DF488FD9481BA0B7725295B5E661A61D) == 0x000034, "Member 'FSnow_Str::_____44_DF488FD9481BA0B7725295B5E661A61D' has a wrong offset!");
static_assert(offsetof(FSnow_Str, _____43_BBDAE82D4A25B31621A39D86449E68C2) == 0x000038, "Member 'FSnow_Str::_____43_BBDAE82D4A25B31621A39D86449E68C2' has a wrong offset!");
static_assert(offsetof(FSnow_Str, Minus__r_52_9FE71F3048C62F2C953FEA87D9A53E3D) == 0x00003C, "Member 'FSnow_Str::Minus__r_52_9FE71F3048C62F2C953FEA87D9A53E3D' has a wrong offset!");
static_assert(offsetof(FSnow_Str, GI___35_717A35A643937BCC76AA5CA6638C300B) == 0x000040, "Member 'FSnow_Str::GI___35_717A35A643937BCC76AA5CA6638C300B' has a wrong offset!");
static_assert(offsetof(FSnow_Str, _____28_2C88C46A406D36D50D40E38ED6ED499F) == 0x000044, "Member 'FSnow_Str::_____28_2C88C46A406D36D50D40E38ED6ED499F' has a wrong offset!");
static_assert(offsetof(FSnow_Str, _I___27_EBD194BF473152C3A2768D9D50C40765) == 0x000048, "Member 'FSnow_Str::_I___27_EBD194BF473152C3A2768D9D50C40765' has a wrong offset!");
static_assert(offsetof(FSnow_Str, __I6__55_8DA99E054E14D35578111B9779062D25) == 0x00004C, "Member 'FSnow_Str::__I6__55_8DA99E054E14D35578111B9779062D25' has a wrong offset!");
static_assert(offsetof(FSnow_Str, __I___53_00FD55DD47F78C76160272921D071ABD) == 0x000050, "Member 'FSnow_Str::__I___53_00FD55DD47F78C76160272921D071ABD' has a wrong offset!");
static_assert(offsetof(FSnow_Str, Roughness_31_477916944E6C4B0515633299B1104D7D) == 0x000054, "Member 'FSnow_Str::Roughness_31_477916944E6C4B0515633299B1104D7D' has a wrong offset!");
static_assert(offsetof(FSnow_Str, Normal_58_DAEABA89440CC261FA633DA81FFE86C1) == 0x000058, "Member 'FSnow_Str::Normal_58_DAEABA89440CC261FA633DA81FFE86C1' has a wrong offset!");
static_assert(offsetof(FSnow_Str, AO_33_A8D45074483B1CD856F1F7A5B283BC3C) == 0x00005C, "Member 'FSnow_Str::AO_33_A8D45074483B1CD856F1F7A5B283BC3C' has a wrong offset!");

}

