#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpawnMonsterByStruct

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function SpawnMonsterByStruct.SpawnMonsterByStruct_C.ExecuteUbergraph_SpawnMonsterByStruct
// 0x0270 (0x0270 - 0x0000)
struct SpawnMonsterByStruct_C_ExecuteUbergraph_SpawnMonsterByStruct final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpawnNpcByStruct                      K2Node_CustomEvent_InStruct;                       // 0x0008(0x0118)()
	TDelegate<void(const struct FSpawnNpcByStruct& InStruct)> K2Node_CreateDelegate_OutputDelegate;              // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	struct FSpawnNpcByStruct                      K2Node_CustomEvent_InTemplate;                     // 0x0130(0x0118)()
	class FString                                 K2Node_CustomEvent_PointName;                      // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPreLoadNpcByStructSubSystem*           CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_PreLoadSpawnStructWithCallBackAndHandle_ReturnValue; // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpawnMonsterByStruct_C_ExecuteUbergraph_SpawnMonsterByStruct) == 0x000008, "Wrong alignment on SpawnMonsterByStruct_C_ExecuteUbergraph_SpawnMonsterByStruct");
static_assert(sizeof(SpawnMonsterByStruct_C_ExecuteUbergraph_SpawnMonsterByStruct) == 0x000270, "Wrong size on SpawnMonsterByStruct_C_ExecuteUbergraph_SpawnMonsterByStruct");
static_assert(offsetof(SpawnMonsterByStruct_C_ExecuteUbergraph_SpawnMonsterByStruct, EntryPoint) == 0x000000, "Member 'SpawnMonsterByStruct_C_ExecuteUbergraph_SpawnMonsterByStruct::EntryPoint' has a wrong offset!");
static_assert(offsetof(SpawnMonsterByStruct_C_ExecuteUbergraph_SpawnMonsterByStruct, K2Node_CustomEvent_InStruct) == 0x000008, "Member 'SpawnMonsterByStruct_C_ExecuteUbergraph_SpawnMonsterByStruct::K2Node_CustomEvent_InStruct' has a wrong offset!");
static_assert(offsetof(SpawnMonsterByStruct_C_ExecuteUbergraph_SpawnMonsterByStruct, K2Node_CreateDelegate_OutputDelegate) == 0x000120, "Member 'SpawnMonsterByStruct_C_ExecuteUbergraph_SpawnMonsterByStruct::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SpawnMonsterByStruct_C_ExecuteUbergraph_SpawnMonsterByStruct, K2Node_CustomEvent_InTemplate) == 0x000130, "Member 'SpawnMonsterByStruct_C_ExecuteUbergraph_SpawnMonsterByStruct::K2Node_CustomEvent_InTemplate' has a wrong offset!");
static_assert(offsetof(SpawnMonsterByStruct_C_ExecuteUbergraph_SpawnMonsterByStruct, K2Node_CustomEvent_PointName) == 0x000248, "Member 'SpawnMonsterByStruct_C_ExecuteUbergraph_SpawnMonsterByStruct::K2Node_CustomEvent_PointName' has a wrong offset!");
static_assert(offsetof(SpawnMonsterByStruct_C_ExecuteUbergraph_SpawnMonsterByStruct, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000258, "Member 'SpawnMonsterByStruct_C_ExecuteUbergraph_SpawnMonsterByStruct::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnMonsterByStruct_C_ExecuteUbergraph_SpawnMonsterByStruct, CallFunc_IsValid_ReturnValue) == 0x000260, "Member 'SpawnMonsterByStruct_C_ExecuteUbergraph_SpawnMonsterByStruct::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnMonsterByStruct_C_ExecuteUbergraph_SpawnMonsterByStruct, CallFunc_PreLoadSpawnStructWithCallBackAndHandle_ReturnValue) == 0x000268, "Member 'SpawnMonsterByStruct_C_ExecuteUbergraph_SpawnMonsterByStruct::CallFunc_PreLoadSpawnStructWithCallBackAndHandle_ReturnValue' has a wrong offset!");

// Function SpawnMonsterByStruct.SpawnMonsterByStruct_C.CustomEvent_0
// 0x0118 (0x0118 - 0x0000)
struct SpawnMonsterByStruct_C_CustomEvent_0 final
{
public:
	struct FSpawnNpcByStruct                      InStruct;                                          // 0x0000(0x0118)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(SpawnMonsterByStruct_C_CustomEvent_0) == 0x000008, "Wrong alignment on SpawnMonsterByStruct_C_CustomEvent_0");
static_assert(sizeof(SpawnMonsterByStruct_C_CustomEvent_0) == 0x000118, "Wrong size on SpawnMonsterByStruct_C_CustomEvent_0");
static_assert(offsetof(SpawnMonsterByStruct_C_CustomEvent_0, InStruct) == 0x000000, "Member 'SpawnMonsterByStruct_C_CustomEvent_0::InStruct' has a wrong offset!");

// Function SpawnMonsterByStruct.SpawnMonsterByStruct_C.PreLoadBeforeDo
// 0x0128 (0x0128 - 0x0000)
struct SpawnMonsterByStruct_C_PreLoadBeforeDo final
{
public:
	struct FSpawnNpcByStruct                      InTemplate;                                        // 0x0000(0x0118)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 PointName;                                         // 0x0118(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(SpawnMonsterByStruct_C_PreLoadBeforeDo) == 0x000008, "Wrong alignment on SpawnMonsterByStruct_C_PreLoadBeforeDo");
static_assert(sizeof(SpawnMonsterByStruct_C_PreLoadBeforeDo) == 0x000128, "Wrong size on SpawnMonsterByStruct_C_PreLoadBeforeDo");
static_assert(offsetof(SpawnMonsterByStruct_C_PreLoadBeforeDo, InTemplate) == 0x000000, "Member 'SpawnMonsterByStruct_C_PreLoadBeforeDo::InTemplate' has a wrong offset!");
static_assert(offsetof(SpawnMonsterByStruct_C_PreLoadBeforeDo, PointName) == 0x000118, "Member 'SpawnMonsterByStruct_C_PreLoadBeforeDo::PointName' has a wrong offset!");

// Function SpawnMonsterByStruct.SpawnMonsterByStruct_C.TrySpawn__Overridden
// 0x0001 (0x0001 - 0x0000)
struct SpawnMonsterByStruct_C_TrySpawn__Overridden final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpawnMonsterByStruct_C_TrySpawn__Overridden) == 0x000001, "Wrong alignment on SpawnMonsterByStruct_C_TrySpawn__Overridden");
static_assert(sizeof(SpawnMonsterByStruct_C_TrySpawn__Overridden) == 0x000001, "Wrong size on SpawnMonsterByStruct_C_TrySpawn__Overridden");
static_assert(offsetof(SpawnMonsterByStruct_C_TrySpawn__Overridden, ReturnValue) == 0x000000, "Member 'SpawnMonsterByStruct_C_TrySpawn__Overridden::ReturnValue' has a wrong offset!");

// Function SpawnMonsterByStruct.SpawnMonsterByStruct_C.Do__Overridden
// 0x0118 (0x0118 - 0x0000)
struct SpawnMonsterByStruct_C_Do__Overridden final
{
public:
	struct FSpawnNpcByStruct                      InTemplate;                                        // 0x0000(0x0118)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(SpawnMonsterByStruct_C_Do__Overridden) == 0x000008, "Wrong alignment on SpawnMonsterByStruct_C_Do__Overridden");
static_assert(sizeof(SpawnMonsterByStruct_C_Do__Overridden) == 0x000118, "Wrong size on SpawnMonsterByStruct_C_Do__Overridden");
static_assert(offsetof(SpawnMonsterByStruct_C_Do__Overridden, InTemplate) == 0x000000, "Member 'SpawnMonsterByStruct_C_Do__Overridden::InTemplate' has a wrong offset!");

// LuaFunction SpawnMonsterByStruct.SpawnMonsterByStruct_C.Do
// 0x0118 (0x0118 - 0x0000)
struct SpawnMonsterByStruct_C_Do final
{
public:
	struct FSpawnNpcByStruct                      InTemplate;                                        // 0x0000(0x0118)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(SpawnMonsterByStruct_C_Do) == 0x000008, "Wrong alignment on SpawnMonsterByStruct_C_Do");
static_assert(sizeof(SpawnMonsterByStruct_C_Do) == 0x000118, "Wrong size on SpawnMonsterByStruct_C_Do");
static_assert(offsetof(SpawnMonsterByStruct_C_Do, InTemplate) == 0x000000, "Member 'SpawnMonsterByStruct_C_Do::InTemplate' has a wrong offset!");

// LuaFunction SpawnMonsterByStruct.SpawnMonsterByStruct_C.GetUniqueMonsId
// 0x0010 (0x0010 - 0x0000)
struct SpawnMonsterByStruct_C_GetUniqueMonsId final
{
public:
	TArray<int32>                                 MonsterIdArray;                                    // 0x0000(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpawnMonsterByStruct_C_GetUniqueMonsId) == 0x000008, "Wrong alignment on SpawnMonsterByStruct_C_GetUniqueMonsId");
static_assert(sizeof(SpawnMonsterByStruct_C_GetUniqueMonsId) == 0x000010, "Wrong size on SpawnMonsterByStruct_C_GetUniqueMonsId");
static_assert(offsetof(SpawnMonsterByStruct_C_GetUniqueMonsId, MonsterIdArray) == 0x000000, "Member 'SpawnMonsterByStruct_C_GetUniqueMonsId::MonsterIdArray' has a wrong offset!");

// LuaFunction SpawnMonsterByStruct.SpawnMonsterByStruct_C.GetSpawnNum
// 0x0004 (0x0004 - 0x0000)
struct SpawnMonsterByStruct_C_GetSpawnNum final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpawnMonsterByStruct_C_GetSpawnNum) == 0x000004, "Wrong alignment on SpawnMonsterByStruct_C_GetSpawnNum");
static_assert(sizeof(SpawnMonsterByStruct_C_GetSpawnNum) == 0x000004, "Wrong size on SpawnMonsterByStruct_C_GetSpawnNum");
static_assert(offsetof(SpawnMonsterByStruct_C_GetSpawnNum, ReturnValue) == 0x000000, "Member 'SpawnMonsterByStruct_C_GetSpawnNum::ReturnValue' has a wrong offset!");

// LuaFunction SpawnMonsterByStruct.SpawnMonsterByStruct_C.GetTagArray
// 0x0030 (0x0030 - 0x0000)
struct SpawnMonsterByStruct_C_GetTagArray final
{
public:
	TArray<class FString>                         TagArray;                                          // 0x0000(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	TArray<bool>                                  BSpArray;                                          // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	TArray<int32>                                 FirstIDArray;                                      // 0x0020(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpawnMonsterByStruct_C_GetTagArray) == 0x000008, "Wrong alignment on SpawnMonsterByStruct_C_GetTagArray");
static_assert(sizeof(SpawnMonsterByStruct_C_GetTagArray) == 0x000030, "Wrong size on SpawnMonsterByStruct_C_GetTagArray");
static_assert(offsetof(SpawnMonsterByStruct_C_GetTagArray, TagArray) == 0x000000, "Member 'SpawnMonsterByStruct_C_GetTagArray::TagArray' has a wrong offset!");
static_assert(offsetof(SpawnMonsterByStruct_C_GetTagArray, BSpArray) == 0x000010, "Member 'SpawnMonsterByStruct_C_GetTagArray::BSpArray' has a wrong offset!");
static_assert(offsetof(SpawnMonsterByStruct_C_GetTagArray, FirstIDArray) == 0x000020, "Member 'SpawnMonsterByStruct_C_GetTagArray::FirstIDArray' has a wrong offset!");

// LuaFunction SpawnMonsterByStruct.SpawnMonsterByStruct_C.TrySpawn
// 0x0001 (0x0001 - 0x0000)
struct SpawnMonsterByStruct_C_TrySpawn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpawnMonsterByStruct_C_TrySpawn) == 0x000001, "Wrong alignment on SpawnMonsterByStruct_C_TrySpawn");
static_assert(sizeof(SpawnMonsterByStruct_C_TrySpawn) == 0x000001, "Wrong size on SpawnMonsterByStruct_C_TrySpawn");
static_assert(offsetof(SpawnMonsterByStruct_C_TrySpawn, ReturnValue) == 0x000000, "Member 'SpawnMonsterByStruct_C_TrySpawn::ReturnValue' has a wrong offset!");

// Function SpawnMonsterByStruct.SpawnMonsterByStruct_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct SpawnMonsterByStruct_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(SpawnMonsterByStruct_C_GetModuleName) == 0x000008, "Wrong alignment on SpawnMonsterByStruct_C_GetModuleName");
static_assert(sizeof(SpawnMonsterByStruct_C_GetModuleName) == 0x000010, "Wrong size on SpawnMonsterByStruct_C_GetModuleName");
static_assert(offsetof(SpawnMonsterByStruct_C_GetModuleName, ReturnValue) == 0x000000, "Member 'SpawnMonsterByStruct_C_GetModuleName::ReturnValue' has a wrong offset!");

}

