#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpawnMonsterByStruct

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "GameTask_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SpawnMonsterByStruct.SpawnMonsterByStruct_C
// 0x0030 (0x0190 - 0x0160)
class USpawnMonsterByStruct_C final : public UGameTaskEvent_SpawnMonByStruct
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0160(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FSpawnNpcByStruct>              MonsterStructs;                                    // 0x0168(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                          bSummon;                                           // 0x0178(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bRandom;                                           // 0x0179(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWeightRandom;                                     // 0x017A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bRandomDistinct;                                   // 0x017B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         RandomTimes;                                       // 0x017C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IntervalTime;                                      // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAsync;                                           // 0x0184(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsDynamicLevel;                                    // 0x0185(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bPal;                                              // 0x0186(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UnLoadAfterSpawn;                                  // 0x0187(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         IntervalInGroup;                                   // 0x0188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SpawnMonsterByStruct(int32 EntryPoint);
	void CustomEvent_0(const struct FSpawnNpcByStruct& InStruct);
	void PreLoadBeforeDo(const struct FSpawnNpcByStruct& InTemplate, const class FString& PointName);
	bool TrySpawn__Overridden();
	void Do__Overridden(const struct FSpawnNpcByStruct& InTemplate);
	int32 GetSpawnNum();
	void GetTagArray(TArray<class FString>* TagArray, TArray<bool>* BSpArray, TArray<int32>* FirstIDArray);
	void GetUniqueMonsId(TArray<int32>* MonsterIdArray);
	bool TrySpawn();
	void Do(const struct FSpawnNpcByStruct& InTemplate);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SpawnMonsterByStruct_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnMonsterByStruct_C")
	}
	static class USpawnMonsterByStruct_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnMonsterByStruct_C>();
	}
};
DUMPER7_ASSERTS_USpawnMonsterByStruct_C;

}

