#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpawnMonsterByStruct

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Engine_structs.hpp"
#include "GameTask_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SpawnMonsterByStruct.SpawnMonsterByStruct_C
// 0x0030 (0x0190 - 0x0160)
class USpawnMonsterByStruct_C final : public UGameTaskEvent_SpawnMonByStruct
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0160(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FSpawnNpcByStruct>              MonsterStructs;                                    // 0x0168(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                          bSummon;                                           // 0x0178(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bRandom;                                           // 0x0179(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWeightRandom;                                     // 0x017A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bRandomDistinct;                                   // 0x017B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         RandomTimes;                                       // 0x017C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IntervalTime;                                      // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAsync;                                           // 0x0184(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsDynamicLevel;                                    // 0x0185(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bPal;                                              // 0x0186(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UnLoadAfterSpawn;                                  // 0x0187(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         IntervalInGroup;                                   // 0x0188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SpawnMonsterByStruct(int32 EntryPoint);
	void CustomEvent_0(const struct FSpawnNpcByStruct& InStruct);
	void PreLoadBeforeDo(const struct FSpawnNpcByStruct& InTemplate, const class FString& PointName);
	bool TrySpawn__Overridden();
	void Do__Overridden(const struct FSpawnNpcByStruct& InTemplate);
	void Do(const struct FSpawnNpcByStruct& InTemplate);
	void GetUniqueMonsId(TArray<int32>* MonsterIdArray);
	int32 GetSpawnNum();
	void GetTagArray(TArray<class FString>* TagArray, TArray<bool>* BSpArray, TArray<int32>* FirstIDArray);
	bool TrySpawn();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpawnMonsterByStruct_C">();
	}
	static class USpawnMonsterByStruct_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnMonsterByStruct_C>();
	}
};
static_assert(alignof(USpawnMonsterByStruct_C) == 0x000008, "Wrong alignment on USpawnMonsterByStruct_C");
static_assert(sizeof(USpawnMonsterByStruct_C) == 0x000190, "Wrong size on USpawnMonsterByStruct_C");
static_assert(offsetof(USpawnMonsterByStruct_C, UberGraphFrame) == 0x000160, "Member 'USpawnMonsterByStruct_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USpawnMonsterByStruct_C, MonsterStructs) == 0x000168, "Member 'USpawnMonsterByStruct_C::MonsterStructs' has a wrong offset!");
static_assert(offsetof(USpawnMonsterByStruct_C, bSummon) == 0x000178, "Member 'USpawnMonsterByStruct_C::bSummon' has a wrong offset!");
static_assert(offsetof(USpawnMonsterByStruct_C, bRandom) == 0x000179, "Member 'USpawnMonsterByStruct_C::bRandom' has a wrong offset!");
static_assert(offsetof(USpawnMonsterByStruct_C, bWeightRandom) == 0x00017A, "Member 'USpawnMonsterByStruct_C::bWeightRandom' has a wrong offset!");
static_assert(offsetof(USpawnMonsterByStruct_C, bRandomDistinct) == 0x00017B, "Member 'USpawnMonsterByStruct_C::bRandomDistinct' has a wrong offset!");
static_assert(offsetof(USpawnMonsterByStruct_C, RandomTimes) == 0x00017C, "Member 'USpawnMonsterByStruct_C::RandomTimes' has a wrong offset!");
static_assert(offsetof(USpawnMonsterByStruct_C, IntervalTime) == 0x000180, "Member 'USpawnMonsterByStruct_C::IntervalTime' has a wrong offset!");
static_assert(offsetof(USpawnMonsterByStruct_C, IsAsync) == 0x000184, "Member 'USpawnMonsterByStruct_C::IsAsync' has a wrong offset!");
static_assert(offsetof(USpawnMonsterByStruct_C, IsDynamicLevel) == 0x000185, "Member 'USpawnMonsterByStruct_C::IsDynamicLevel' has a wrong offset!");
static_assert(offsetof(USpawnMonsterByStruct_C, bPal) == 0x000186, "Member 'USpawnMonsterByStruct_C::bPal' has a wrong offset!");
static_assert(offsetof(USpawnMonsterByStruct_C, UnLoadAfterSpawn) == 0x000187, "Member 'USpawnMonsterByStruct_C::UnLoadAfterSpawn' has a wrong offset!");
static_assert(offsetof(USpawnMonsterByStruct_C, IntervalInGroup) == 0x000188, "Member 'USpawnMonsterByStruct_C::IntervalInGroup' has a wrong offset!");

}

