#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpawnMonsterByPointEvent

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "GameTask_structs.hpp"


namespace SDK::Params
{

// LuaFunction SpawnMonsterByPointEvent.SpawnMonsterByPointEvent_C.Do
// 0x0088 (0x0088 - 0x0000)
struct SpawnMonsterByPointEvent_C_Do final
{
public:
	struct FActiveSpawnersTemplate                InTemplate;                                        // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_SpawnMonsterByPointEvent_C_Do;

// LuaFunction SpawnMonsterByPointEvent.SpawnMonsterByPointEvent_C.TrySpawn
// 0x0001 (0x0001 - 0x0000)
struct SpawnMonsterByPointEvent_C_TrySpawn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnMonsterByPointEvent_C_TrySpawn;

// Function SpawnMonsterByPointEvent.SpawnMonsterByPointEvent_C.Do__Overridden
// 0x0088 (0x0088 - 0x0000)
struct SpawnMonsterByPointEvent_C_Do__Overridden final
{
public:
	struct FActiveSpawnersTemplate                InTemplate;                                        // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_SpawnMonsterByPointEvent_C_Do__Overridden;

// Function SpawnMonsterByPointEvent.SpawnMonsterByPointEvent_C.GetSpawnNum
// 0x00B0 (0x00B0 - 0x0000)
struct SpawnMonsterByPointEvent_C_GetSpawnNum final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameTaskActor*                         CallFunc_GetGameTaskActor_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELevelType                                    CallFunc_GetLevelType_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveSpawnersTemplate                CallFunc_GetActiveSpawnersTemplate_ReturnValue;    // 0x0018(0x0088)(ConstParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SpawnMonsterByPointEvent_C_GetSpawnNum;

// Function SpawnMonsterByPointEvent.SpawnMonsterByPointEvent_C.PreLoadBeforeDo
// 0x0088 (0x0088 - 0x0000)
struct SpawnMonsterByPointEvent_C_PreLoadBeforeDo final
{
public:
	struct FActiveSpawnersTemplate                InTemplate;                                        // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_SpawnMonsterByPointEvent_C_PreLoadBeforeDo;

// Function SpawnMonsterByPointEvent.SpawnMonsterByPointEvent_C.CustomEvent_0
// 0x0088 (0x0088 - 0x0000)
struct SpawnMonsterByPointEvent_C_CustomEvent_0 final
{
public:
	struct FActiveSpawnersTemplate                InStruct;                                          // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_SpawnMonsterByPointEvent_C_CustomEvent_0;

// Function SpawnMonsterByPointEvent.SpawnMonsterByPointEvent_C.ExecuteUbergraph_SpawnMonsterByPointEvent
// 0x0138 (0x0138 - 0x0000)
struct SpawnMonsterByPointEvent_C_ExecuteUbergraph_SpawnMonsterByPointEvent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveSpawnersTemplate                K2Node_CustomEvent_InStruct;                       // 0x0008(0x0088)()
	TDelegate<void(const struct FActiveSpawnersTemplate& InStruct)> K2Node_CreateDelegate_OutputDelegate; // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	struct FActiveSpawnersTemplate                K2Node_CustomEvent_InTemplate;                     // 0x00A0(0x0088)()
	class UPreLoadNpcByStructSubSystem*           CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SpawnMonsterByPointEvent_C_ExecuteUbergraph_SpawnMonsterByPointEvent;

// Function SpawnMonsterByPointEvent.SpawnMonsterByPointEvent_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct SpawnMonsterByPointEvent_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SpawnMonsterByPointEvent_C_GetModuleName;

// Function SpawnMonsterByPointEvent.SpawnMonsterByPointEvent_C.GetSpecialStaticDescription
// 0x0050 (0x0050 - 0x0000)
struct SpawnMonsterByPointEvent_C_GetSpecialStaticDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SpawnMonsterByPointEvent_C_GetSpecialStaticDescription;

}

