#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SPCRJointDynamics

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum SPCRJointDynamics.SurfaceColliderType
// NumValues: 0x0004
enum class ESurfaceColliderType : uint8
{
	SPCR_OFF                                 = 0,
	SPCR_PUSH                                = 1,
	SPCR_PULL                                = 2,
	SPCR_MAX                                 = 3,
};

// ScriptStruct SPCRJointDynamics.SPCRJointPair
// 0x0020 (0x0020 - 0x0000)
struct FSPCRJointPair final
{
public:
	struct FBoneReference                         RootBone;                                          // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         EndBone;                                           // 0x0010(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSPCRJointPair) == 0x000004, "Wrong alignment on FSPCRJointPair");
static_assert(sizeof(FSPCRJointPair) == 0x000020, "Wrong size on FSPCRJointPair");
static_assert(offsetof(FSPCRJointPair, RootBone) == 0x000000, "Member 'FSPCRJointPair::RootBone' has a wrong offset!");
static_assert(offsetof(FSPCRJointPair, EndBone) == 0x000010, "Member 'FSPCRJointPair::EndBone' has a wrong offset!");

// ScriptStruct SPCRJointDynamics.SPCRCurve
// 0x0010 (0x0010 - 0x0000)
struct FSPCRCurve final
{
public:
	class UCurveFloat*                            Curve;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Power;                                             // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSPCRCurve) == 0x000008, "Wrong alignment on FSPCRCurve");
static_assert(sizeof(FSPCRCurve) == 0x000010, "Wrong size on FSPCRCurve");
static_assert(offsetof(FSPCRCurve, Curve) == 0x000000, "Member 'FSPCRCurve::Curve' has a wrong offset!");
static_assert(offsetof(FSPCRCurve, Power) == 0x000008, "Member 'FSPCRCurve::Power' has a wrong offset!");

// ScriptStruct SPCRJointDynamics.SPCRCurveZero
// 0x0010 (0x0010 - 0x0000)
struct FSPCRCurveZero final
{
public:
	class UCurveFloat*                            Curve;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Power;                                             // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSPCRCurveZero) == 0x000008, "Wrong alignment on FSPCRCurveZero");
static_assert(sizeof(FSPCRCurveZero) == 0x000010, "Wrong size on FSPCRCurveZero");
static_assert(offsetof(FSPCRCurveZero, Curve) == 0x000000, "Member 'FSPCRCurveZero::Curve' has a wrong offset!");
static_assert(offsetof(FSPCRCurveZero, Power) == 0x000008, "Member 'FSPCRCurveZero::Power' has a wrong offset!");

// ScriptStruct SPCRJointDynamics.SPCRJointDynamicsBody
// 0x0080 (0x0080 - 0x0000)
struct FSPCRJointDynamicsBody final
{
public:
	struct FBoneReference                         TargetBone;                                        // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             Transform;                                         // 0x0010(0x0030)(Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Friction;                                          // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  Rotation;                                          // 0x0060(0x0010)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	ESurfaceColliderType                          SurfaceColliderType;                               // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0xF];                                       // 0x0071(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSPCRJointDynamicsBody) == 0x000010, "Wrong alignment on FSPCRJointDynamicsBody");
static_assert(sizeof(FSPCRJointDynamicsBody) == 0x000080, "Wrong size on FSPCRJointDynamicsBody");
static_assert(offsetof(FSPCRJointDynamicsBody, TargetBone) == 0x000000, "Member 'FSPCRJointDynamicsBody::TargetBone' has a wrong offset!");
static_assert(offsetof(FSPCRJointDynamicsBody, Transform) == 0x000010, "Member 'FSPCRJointDynamicsBody::Transform' has a wrong offset!");
static_assert(offsetof(FSPCRJointDynamicsBody, Height) == 0x000040, "Member 'FSPCRJointDynamicsBody::Height' has a wrong offset!");
static_assert(offsetof(FSPCRJointDynamicsBody, Radius) == 0x000044, "Member 'FSPCRJointDynamicsBody::Radius' has a wrong offset!");
static_assert(offsetof(FSPCRJointDynamicsBody, Friction) == 0x000048, "Member 'FSPCRJointDynamicsBody::Friction' has a wrong offset!");
static_assert(offsetof(FSPCRJointDynamicsBody, Location) == 0x00004C, "Member 'FSPCRJointDynamicsBody::Location' has a wrong offset!");
static_assert(offsetof(FSPCRJointDynamicsBody, Rotation) == 0x000060, "Member 'FSPCRJointDynamicsBody::Rotation' has a wrong offset!");
static_assert(offsetof(FSPCRJointDynamicsBody, SurfaceColliderType) == 0x000070, "Member 'FSPCRJointDynamicsBody::SurfaceColliderType' has a wrong offset!");

// ScriptStruct SPCRJointDynamics.AnimNode_SPCRJointDynamics
// 0x0240 (0x0308 - 0x00C8)
struct FAnimNode_SPCRJointDynamics final : public FAnimNode_SkeletalControlBase
{
public:
	TArray<struct FSPCRJointPair>                 JointPairs;                                        // 0x00C8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         VirtualBoneLength;                                 // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FixedPointIndex;                                   // 0x00DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Structural_Vertical_StepCount;                     // 0x00E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bJointLoop;                                        // 0x00E4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStructural_Vertical;                              // 0x00E5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStructural_Vertical_Collision;                    // 0x00E6(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E7[0x1];                                       // 0x00E7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSPCRCurve                             Structural_Vertical_Shrink;                        // 0x00E8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FSPCRCurve                             Structural_Vertical_Stretch;                       // 0x00F8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bStructural_Horizontal;                            // 0x0108(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStructural_Horizontal_Collision;                  // 0x0109(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSPCRCurve                             Structural_Horizontal_Shrink;                      // 0x0110(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FSPCRCurve                             Structural_Horizontal_Stretch;                     // 0x0120(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bShear;                                            // 0x0130(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShear_Collision;                                  // 0x0131(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSPCRCurve                             Shear_Shrink;                                      // 0x0138(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FSPCRCurve                             Shear_Stretch;                                     // 0x0148(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bBending_Vertical;                                 // 0x0158(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSPCRCurve                             Bending_Vertical_Shrink;                           // 0x0160(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FSPCRCurve                             Bending_Vertical_Stretch;                          // 0x0170(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bBending_Horizontal;                               // 0x0180(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSPCRCurve                             Bending_Horizontal_Shrink;                         // 0x0188(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FSPCRCurve                             Bending_Horizontal_Stretch;                        // 0x0198(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         MaxIterations;                                     // 0x01A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CollisionSubInterations;                           // 0x01AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CollisionLOD;                                      // 0x01B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceLengthLimit;                                 // 0x01B4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSPCRCurveZero                         Resistance;                                        // 0x01B8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FSPCRCurveZero                         Hardness;                                          // 0x01C8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Gravity;                                           // 0x01D8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSPCRCurve                             GravityCurve;                                      // 0x01E8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseDrag;                                          // 0x01F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DragCoefficient;                                   // 0x01FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSPCRCurve                             DragCurve;                                         // 0x0200(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseLift;                                          // 0x0210(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LiftCoefficient;                                   // 0x0214(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSPCRCurve                             LiftCurve;                                         // 0x0218(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                WindForce;                                         // 0x0228(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindForceSpeed;                                    // 0x0234(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSurfaceCollision;                              // 0x0238(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WriteID;                                           // 0x023C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 ReadID;                                            // 0x0240(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSPCRJointDynamicsBody>         Bodies;                                            // 0x0250(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class USPCRJointDynamicsComponent*            JointDynamicsComponent;                            // 0x0260(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLimitAngle;                                       // 0x0268(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AngleLimitInDegree;                                // 0x026C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSPCRCurve                             LimitCurve;                                        // 0x0270(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bLimitFromRoot;                                    // 0x0280(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugDrawConstraints;                             // 0x0281(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugDrawColliders;                               // 0x0282(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugDrawSurfaceCollision;                        // 0x0283(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_284[0x84];                                     // 0x0284(0x0084)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_SPCRJointDynamics) == 0x000008, "Wrong alignment on FAnimNode_SPCRJointDynamics");
static_assert(sizeof(FAnimNode_SPCRJointDynamics) == 0x000308, "Wrong size on FAnimNode_SPCRJointDynamics");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, JointPairs) == 0x0000C8, "Member 'FAnimNode_SPCRJointDynamics::JointPairs' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, VirtualBoneLength) == 0x0000D8, "Member 'FAnimNode_SPCRJointDynamics::VirtualBoneLength' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, FixedPointIndex) == 0x0000DC, "Member 'FAnimNode_SPCRJointDynamics::FixedPointIndex' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, Structural_Vertical_StepCount) == 0x0000E0, "Member 'FAnimNode_SPCRJointDynamics::Structural_Vertical_StepCount' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, bJointLoop) == 0x0000E4, "Member 'FAnimNode_SPCRJointDynamics::bJointLoop' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, bStructural_Vertical) == 0x0000E5, "Member 'FAnimNode_SPCRJointDynamics::bStructural_Vertical' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, bStructural_Vertical_Collision) == 0x0000E6, "Member 'FAnimNode_SPCRJointDynamics::bStructural_Vertical_Collision' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, Structural_Vertical_Shrink) == 0x0000E8, "Member 'FAnimNode_SPCRJointDynamics::Structural_Vertical_Shrink' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, Structural_Vertical_Stretch) == 0x0000F8, "Member 'FAnimNode_SPCRJointDynamics::Structural_Vertical_Stretch' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, bStructural_Horizontal) == 0x000108, "Member 'FAnimNode_SPCRJointDynamics::bStructural_Horizontal' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, bStructural_Horizontal_Collision) == 0x000109, "Member 'FAnimNode_SPCRJointDynamics::bStructural_Horizontal_Collision' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, Structural_Horizontal_Shrink) == 0x000110, "Member 'FAnimNode_SPCRJointDynamics::Structural_Horizontal_Shrink' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, Structural_Horizontal_Stretch) == 0x000120, "Member 'FAnimNode_SPCRJointDynamics::Structural_Horizontal_Stretch' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, bShear) == 0x000130, "Member 'FAnimNode_SPCRJointDynamics::bShear' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, bShear_Collision) == 0x000131, "Member 'FAnimNode_SPCRJointDynamics::bShear_Collision' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, Shear_Shrink) == 0x000138, "Member 'FAnimNode_SPCRJointDynamics::Shear_Shrink' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, Shear_Stretch) == 0x000148, "Member 'FAnimNode_SPCRJointDynamics::Shear_Stretch' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, bBending_Vertical) == 0x000158, "Member 'FAnimNode_SPCRJointDynamics::bBending_Vertical' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, Bending_Vertical_Shrink) == 0x000160, "Member 'FAnimNode_SPCRJointDynamics::Bending_Vertical_Shrink' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, Bending_Vertical_Stretch) == 0x000170, "Member 'FAnimNode_SPCRJointDynamics::Bending_Vertical_Stretch' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, bBending_Horizontal) == 0x000180, "Member 'FAnimNode_SPCRJointDynamics::bBending_Horizontal' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, Bending_Horizontal_Shrink) == 0x000188, "Member 'FAnimNode_SPCRJointDynamics::Bending_Horizontal_Shrink' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, Bending_Horizontal_Stretch) == 0x000198, "Member 'FAnimNode_SPCRJointDynamics::Bending_Horizontal_Stretch' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, MaxIterations) == 0x0001A8, "Member 'FAnimNode_SPCRJointDynamics::MaxIterations' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, CollisionSubInterations) == 0x0001AC, "Member 'FAnimNode_SPCRJointDynamics::CollisionSubInterations' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, CollisionLOD) == 0x0001B0, "Member 'FAnimNode_SPCRJointDynamics::CollisionLOD' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, bForceLengthLimit) == 0x0001B4, "Member 'FAnimNode_SPCRJointDynamics::bForceLengthLimit' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, Resistance) == 0x0001B8, "Member 'FAnimNode_SPCRJointDynamics::Resistance' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, Hardness) == 0x0001C8, "Member 'FAnimNode_SPCRJointDynamics::Hardness' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, Gravity) == 0x0001D8, "Member 'FAnimNode_SPCRJointDynamics::Gravity' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, GravityCurve) == 0x0001E8, "Member 'FAnimNode_SPCRJointDynamics::GravityCurve' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, bUseDrag) == 0x0001F8, "Member 'FAnimNode_SPCRJointDynamics::bUseDrag' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, DragCoefficient) == 0x0001FC, "Member 'FAnimNode_SPCRJointDynamics::DragCoefficient' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, DragCurve) == 0x000200, "Member 'FAnimNode_SPCRJointDynamics::DragCurve' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, bUseLift) == 0x000210, "Member 'FAnimNode_SPCRJointDynamics::bUseLift' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, LiftCoefficient) == 0x000214, "Member 'FAnimNode_SPCRJointDynamics::LiftCoefficient' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, LiftCurve) == 0x000218, "Member 'FAnimNode_SPCRJointDynamics::LiftCurve' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, WindForce) == 0x000228, "Member 'FAnimNode_SPCRJointDynamics::WindForce' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, WindForceSpeed) == 0x000234, "Member 'FAnimNode_SPCRJointDynamics::WindForceSpeed' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, bUseSurfaceCollision) == 0x000238, "Member 'FAnimNode_SPCRJointDynamics::bUseSurfaceCollision' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, WriteID) == 0x00023C, "Member 'FAnimNode_SPCRJointDynamics::WriteID' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, ReadID) == 0x000240, "Member 'FAnimNode_SPCRJointDynamics::ReadID' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, Bodies) == 0x000250, "Member 'FAnimNode_SPCRJointDynamics::Bodies' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, JointDynamicsComponent) == 0x000260, "Member 'FAnimNode_SPCRJointDynamics::JointDynamicsComponent' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, bLimitAngle) == 0x000268, "Member 'FAnimNode_SPCRJointDynamics::bLimitAngle' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, AngleLimitInDegree) == 0x00026C, "Member 'FAnimNode_SPCRJointDynamics::AngleLimitInDegree' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, LimitCurve) == 0x000270, "Member 'FAnimNode_SPCRJointDynamics::LimitCurve' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, bLimitFromRoot) == 0x000280, "Member 'FAnimNode_SPCRJointDynamics::bLimitFromRoot' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, bDebugDrawConstraints) == 0x000281, "Member 'FAnimNode_SPCRJointDynamics::bDebugDrawConstraints' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, bDebugDrawColliders) == 0x000282, "Member 'FAnimNode_SPCRJointDynamics::bDebugDrawColliders' has a wrong offset!");
static_assert(offsetof(FAnimNode_SPCRJointDynamics, bDebugDrawSurfaceCollision) == 0x000283, "Member 'FAnimNode_SPCRJointDynamics::bDebugDrawSurfaceCollision' has a wrong offset!");

// ScriptStruct SPCRJointDynamics.SPCRCollider
// 0x005C (0x005C - 0x0000)
struct alignas(0x04) FSPCRCollider final
{
public:
	uint8                                         Pad_0[0x5C];                                       // 0x0000(0x005C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSPCRCollider) == 0x000004, "Wrong alignment on FSPCRCollider");
static_assert(sizeof(FSPCRCollider) == 0x00005C, "Wrong size on FSPCRCollider");

}

