#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpinePlugin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SpinePlugin.SpineBoneDriverComponent.BeforeUpdateWorldTransform
// 0x0008 (0x0008 - 0x0000)
struct SpineBoneDriverComponent_BeforeUpdateWorldTransform final
{
public:
	class USpineSkeletonComponent*                Skeleton;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineBoneDriverComponent_BeforeUpdateWorldTransform) == 0x000008, "Wrong alignment on SpineBoneDriverComponent_BeforeUpdateWorldTransform");
static_assert(sizeof(SpineBoneDriverComponent_BeforeUpdateWorldTransform) == 0x000008, "Wrong size on SpineBoneDriverComponent_BeforeUpdateWorldTransform");
static_assert(offsetof(SpineBoneDriverComponent_BeforeUpdateWorldTransform, Skeleton) == 0x000000, "Member 'SpineBoneDriverComponent_BeforeUpdateWorldTransform::Skeleton' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetAlpha
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetAlpha final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetAlpha) == 0x000004, "Wrong alignment on TrackEntry_GetAlpha");
static_assert(sizeof(TrackEntry_GetAlpha) == 0x000004, "Wrong size on TrackEntry_GetAlpha");
static_assert(offsetof(TrackEntry_GetAlpha, ReturnValue) == 0x000000, "Member 'TrackEntry_GetAlpha::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.getAnimationDuration
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetAnimationDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetAnimationDuration) == 0x000004, "Wrong alignment on TrackEntry_GetAnimationDuration");
static_assert(sizeof(TrackEntry_GetAnimationDuration) == 0x000004, "Wrong size on TrackEntry_GetAnimationDuration");
static_assert(offsetof(TrackEntry_GetAnimationDuration, ReturnValue) == 0x000000, "Member 'TrackEntry_GetAnimationDuration::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetAnimationEnd
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetAnimationEnd final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetAnimationEnd) == 0x000004, "Wrong alignment on TrackEntry_GetAnimationEnd");
static_assert(sizeof(TrackEntry_GetAnimationEnd) == 0x000004, "Wrong size on TrackEntry_GetAnimationEnd");
static_assert(offsetof(TrackEntry_GetAnimationEnd, ReturnValue) == 0x000000, "Member 'TrackEntry_GetAnimationEnd::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetAnimationLast
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetAnimationLast final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetAnimationLast) == 0x000004, "Wrong alignment on TrackEntry_GetAnimationLast");
static_assert(sizeof(TrackEntry_GetAnimationLast) == 0x000004, "Wrong size on TrackEntry_GetAnimationLast");
static_assert(offsetof(TrackEntry_GetAnimationLast, ReturnValue) == 0x000000, "Member 'TrackEntry_GetAnimationLast::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.getAnimationName
// 0x0010 (0x0010 - 0x0000)
struct TrackEntry_GetAnimationName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetAnimationName) == 0x000008, "Wrong alignment on TrackEntry_GetAnimationName");
static_assert(sizeof(TrackEntry_GetAnimationName) == 0x000010, "Wrong size on TrackEntry_GetAnimationName");
static_assert(offsetof(TrackEntry_GetAnimationName, ReturnValue) == 0x000000, "Member 'TrackEntry_GetAnimationName::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetAnimationStart
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetAnimationStart final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetAnimationStart) == 0x000004, "Wrong alignment on TrackEntry_GetAnimationStart");
static_assert(sizeof(TrackEntry_GetAnimationStart) == 0x000004, "Wrong size on TrackEntry_GetAnimationStart");
static_assert(offsetof(TrackEntry_GetAnimationStart, ReturnValue) == 0x000000, "Member 'TrackEntry_GetAnimationStart::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetAttachmentThreshold
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetAttachmentThreshold final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetAttachmentThreshold) == 0x000004, "Wrong alignment on TrackEntry_GetAttachmentThreshold");
static_assert(sizeof(TrackEntry_GetAttachmentThreshold) == 0x000004, "Wrong size on TrackEntry_GetAttachmentThreshold");
static_assert(offsetof(TrackEntry_GetAttachmentThreshold, ReturnValue) == 0x000000, "Member 'TrackEntry_GetAttachmentThreshold::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetDelay
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetDelay final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetDelay) == 0x000004, "Wrong alignment on TrackEntry_GetDelay");
static_assert(sizeof(TrackEntry_GetDelay) == 0x000004, "Wrong size on TrackEntry_GetDelay");
static_assert(offsetof(TrackEntry_GetDelay, ReturnValue) == 0x000000, "Member 'TrackEntry_GetDelay::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetDrawOrderThreshold
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetDrawOrderThreshold final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetDrawOrderThreshold) == 0x000004, "Wrong alignment on TrackEntry_GetDrawOrderThreshold");
static_assert(sizeof(TrackEntry_GetDrawOrderThreshold) == 0x000004, "Wrong size on TrackEntry_GetDrawOrderThreshold");
static_assert(offsetof(TrackEntry_GetDrawOrderThreshold, ReturnValue) == 0x000000, "Member 'TrackEntry_GetDrawOrderThreshold::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetEventThreshold
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetEventThreshold final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetEventThreshold) == 0x000004, "Wrong alignment on TrackEntry_GetEventThreshold");
static_assert(sizeof(TrackEntry_GetEventThreshold) == 0x000004, "Wrong size on TrackEntry_GetEventThreshold");
static_assert(offsetof(TrackEntry_GetEventThreshold, ReturnValue) == 0x000000, "Member 'TrackEntry_GetEventThreshold::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetLoop
// 0x0001 (0x0001 - 0x0000)
struct TrackEntry_GetLoop final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetLoop) == 0x000001, "Wrong alignment on TrackEntry_GetLoop");
static_assert(sizeof(TrackEntry_GetLoop) == 0x000001, "Wrong size on TrackEntry_GetLoop");
static_assert(offsetof(TrackEntry_GetLoop, ReturnValue) == 0x000000, "Member 'TrackEntry_GetLoop::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetMixDuration
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetMixDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetMixDuration) == 0x000004, "Wrong alignment on TrackEntry_GetMixDuration");
static_assert(sizeof(TrackEntry_GetMixDuration) == 0x000004, "Wrong size on TrackEntry_GetMixDuration");
static_assert(offsetof(TrackEntry_GetMixDuration, ReturnValue) == 0x000000, "Member 'TrackEntry_GetMixDuration::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetMixTime
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetMixTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetMixTime) == 0x000004, "Wrong alignment on TrackEntry_GetMixTime");
static_assert(sizeof(TrackEntry_GetMixTime) == 0x000004, "Wrong size on TrackEntry_GetMixTime");
static_assert(offsetof(TrackEntry_GetMixTime, ReturnValue) == 0x000000, "Member 'TrackEntry_GetMixTime::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetTimeScale
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetTimeScale final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetTimeScale) == 0x000004, "Wrong alignment on TrackEntry_GetTimeScale");
static_assert(sizeof(TrackEntry_GetTimeScale) == 0x000004, "Wrong size on TrackEntry_GetTimeScale");
static_assert(offsetof(TrackEntry_GetTimeScale, ReturnValue) == 0x000000, "Member 'TrackEntry_GetTimeScale::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetTrackEnd
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetTrackEnd final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetTrackEnd) == 0x000004, "Wrong alignment on TrackEntry_GetTrackEnd");
static_assert(sizeof(TrackEntry_GetTrackEnd) == 0x000004, "Wrong size on TrackEntry_GetTrackEnd");
static_assert(offsetof(TrackEntry_GetTrackEnd, ReturnValue) == 0x000000, "Member 'TrackEntry_GetTrackEnd::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetTrackIndex
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetTrackIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetTrackIndex) == 0x000004, "Wrong alignment on TrackEntry_GetTrackIndex");
static_assert(sizeof(TrackEntry_GetTrackIndex) == 0x000004, "Wrong size on TrackEntry_GetTrackIndex");
static_assert(offsetof(TrackEntry_GetTrackIndex, ReturnValue) == 0x000000, "Member 'TrackEntry_GetTrackIndex::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetTrackTime
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetTrackTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetTrackTime) == 0x000004, "Wrong alignment on TrackEntry_GetTrackTime");
static_assert(sizeof(TrackEntry_GetTrackTime) == 0x000004, "Wrong size on TrackEntry_GetTrackTime");
static_assert(offsetof(TrackEntry_GetTrackTime, ReturnValue) == 0x000000, "Member 'TrackEntry_GetTrackTime::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.isValidAnimation
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_IsValidAnimation final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_IsValidAnimation) == 0x000004, "Wrong alignment on TrackEntry_IsValidAnimation");
static_assert(sizeof(TrackEntry_IsValidAnimation) == 0x000004, "Wrong size on TrackEntry_IsValidAnimation");
static_assert(offsetof(TrackEntry_IsValidAnimation, ReturnValue) == 0x000000, "Member 'TrackEntry_IsValidAnimation::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetAlpha
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetAlpha final
{
public:
	float                                         Alpha;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetAlpha) == 0x000004, "Wrong alignment on TrackEntry_SetAlpha");
static_assert(sizeof(TrackEntry_SetAlpha) == 0x000004, "Wrong size on TrackEntry_SetAlpha");
static_assert(offsetof(TrackEntry_SetAlpha, Alpha) == 0x000000, "Member 'TrackEntry_SetAlpha::Alpha' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetAnimationEnd
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetAnimationEnd final
{
public:
	float                                         AnimationEnd_0;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetAnimationEnd) == 0x000004, "Wrong alignment on TrackEntry_SetAnimationEnd");
static_assert(sizeof(TrackEntry_SetAnimationEnd) == 0x000004, "Wrong size on TrackEntry_SetAnimationEnd");
static_assert(offsetof(TrackEntry_SetAnimationEnd, AnimationEnd_0) == 0x000000, "Member 'TrackEntry_SetAnimationEnd::AnimationEnd_0' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetAnimationLast
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetAnimationLast final
{
public:
	float                                         AnimationLast;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetAnimationLast) == 0x000004, "Wrong alignment on TrackEntry_SetAnimationLast");
static_assert(sizeof(TrackEntry_SetAnimationLast) == 0x000004, "Wrong size on TrackEntry_SetAnimationLast");
static_assert(offsetof(TrackEntry_SetAnimationLast, AnimationLast) == 0x000000, "Member 'TrackEntry_SetAnimationLast::AnimationLast' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetAnimationStart
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetAnimationStart final
{
public:
	float                                         AnimationStart_0;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetAnimationStart) == 0x000004, "Wrong alignment on TrackEntry_SetAnimationStart");
static_assert(sizeof(TrackEntry_SetAnimationStart) == 0x000004, "Wrong size on TrackEntry_SetAnimationStart");
static_assert(offsetof(TrackEntry_SetAnimationStart, AnimationStart_0) == 0x000000, "Member 'TrackEntry_SetAnimationStart::AnimationStart_0' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetAttachmentThreshold
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetAttachmentThreshold final
{
public:
	float                                         AttachmentThreshold;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetAttachmentThreshold) == 0x000004, "Wrong alignment on TrackEntry_SetAttachmentThreshold");
static_assert(sizeof(TrackEntry_SetAttachmentThreshold) == 0x000004, "Wrong size on TrackEntry_SetAttachmentThreshold");
static_assert(offsetof(TrackEntry_SetAttachmentThreshold, AttachmentThreshold) == 0x000000, "Member 'TrackEntry_SetAttachmentThreshold::AttachmentThreshold' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetDelay
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetDelay final
{
public:
	float                                         Delay;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetDelay) == 0x000004, "Wrong alignment on TrackEntry_SetDelay");
static_assert(sizeof(TrackEntry_SetDelay) == 0x000004, "Wrong size on TrackEntry_SetDelay");
static_assert(offsetof(TrackEntry_SetDelay, Delay) == 0x000000, "Member 'TrackEntry_SetDelay::Delay' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetDrawOrderThreshold
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetDrawOrderThreshold final
{
public:
	float                                         DrawOrderThreshold;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetDrawOrderThreshold) == 0x000004, "Wrong alignment on TrackEntry_SetDrawOrderThreshold");
static_assert(sizeof(TrackEntry_SetDrawOrderThreshold) == 0x000004, "Wrong size on TrackEntry_SetDrawOrderThreshold");
static_assert(offsetof(TrackEntry_SetDrawOrderThreshold, DrawOrderThreshold) == 0x000000, "Member 'TrackEntry_SetDrawOrderThreshold::DrawOrderThreshold' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetEventThreshold
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetEventThreshold final
{
public:
	float                                         EventThreshold;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetEventThreshold) == 0x000004, "Wrong alignment on TrackEntry_SetEventThreshold");
static_assert(sizeof(TrackEntry_SetEventThreshold) == 0x000004, "Wrong size on TrackEntry_SetEventThreshold");
static_assert(offsetof(TrackEntry_SetEventThreshold, EventThreshold) == 0x000000, "Member 'TrackEntry_SetEventThreshold::EventThreshold' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetLoop
// 0x0001 (0x0001 - 0x0000)
struct TrackEntry_SetLoop final
{
public:
	bool                                          Loop;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetLoop) == 0x000001, "Wrong alignment on TrackEntry_SetLoop");
static_assert(sizeof(TrackEntry_SetLoop) == 0x000001, "Wrong size on TrackEntry_SetLoop");
static_assert(offsetof(TrackEntry_SetLoop, Loop) == 0x000000, "Member 'TrackEntry_SetLoop::Loop' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetMixDuration
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetMixDuration final
{
public:
	float                                         MixDuration;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetMixDuration) == 0x000004, "Wrong alignment on TrackEntry_SetMixDuration");
static_assert(sizeof(TrackEntry_SetMixDuration) == 0x000004, "Wrong size on TrackEntry_SetMixDuration");
static_assert(offsetof(TrackEntry_SetMixDuration, MixDuration) == 0x000000, "Member 'TrackEntry_SetMixDuration::MixDuration' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetMixTime
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetMixTime final
{
public:
	float                                         MixTime;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetMixTime) == 0x000004, "Wrong alignment on TrackEntry_SetMixTime");
static_assert(sizeof(TrackEntry_SetMixTime) == 0x000004, "Wrong size on TrackEntry_SetMixTime");
static_assert(offsetof(TrackEntry_SetMixTime, MixTime) == 0x000000, "Member 'TrackEntry_SetMixTime::MixTime' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetTimeScale
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetTimeScale final
{
public:
	float                                         TimeScale;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetTimeScale) == 0x000004, "Wrong alignment on TrackEntry_SetTimeScale");
static_assert(sizeof(TrackEntry_SetTimeScale) == 0x000004, "Wrong size on TrackEntry_SetTimeScale");
static_assert(offsetof(TrackEntry_SetTimeScale, TimeScale) == 0x000000, "Member 'TrackEntry_SetTimeScale::TimeScale' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetTrackEnd
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetTrackEnd final
{
public:
	float                                         TrackEnd;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetTrackEnd) == 0x000004, "Wrong alignment on TrackEntry_SetTrackEnd");
static_assert(sizeof(TrackEntry_SetTrackEnd) == 0x000004, "Wrong size on TrackEntry_SetTrackEnd");
static_assert(offsetof(TrackEntry_SetTrackEnd, TrackEnd) == 0x000000, "Member 'TrackEntry_SetTrackEnd::TrackEnd' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetTrackTime
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetTrackTime final
{
public:
	float                                         TrackTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetTrackTime) == 0x000004, "Wrong alignment on TrackEntry_SetTrackTime");
static_assert(sizeof(TrackEntry_SetTrackTime) == 0x000004, "Wrong size on TrackEntry_SetTrackTime");
static_assert(offsetof(TrackEntry_SetTrackTime, TrackTime) == 0x000000, "Member 'TrackEntry_SetTrackTime::TrackTime' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.ActivateBone
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonComponent_ActivateBone final
{
public:
	class FString                                 BoneName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActivate;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SpineSkeletonComponent_ActivateBone) == 0x000008, "Wrong alignment on SpineSkeletonComponent_ActivateBone");
static_assert(sizeof(SpineSkeletonComponent_ActivateBone) == 0x000018, "Wrong size on SpineSkeletonComponent_ActivateBone");
static_assert(offsetof(SpineSkeletonComponent_ActivateBone, BoneName) == 0x000000, "Member 'SpineSkeletonComponent_ActivateBone::BoneName' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_ActivateBone, bActivate) == 0x000010, "Member 'SpineSkeletonComponent_ActivateBone::bActivate' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.getAnimationDuration
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonComponent_GetAnimationDuration final
{
public:
	class FString                                 AnimationName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SpineSkeletonComponent_GetAnimationDuration) == 0x000008, "Wrong alignment on SpineSkeletonComponent_GetAnimationDuration");
static_assert(sizeof(SpineSkeletonComponent_GetAnimationDuration) == 0x000018, "Wrong size on SpineSkeletonComponent_GetAnimationDuration");
static_assert(offsetof(SpineSkeletonComponent_GetAnimationDuration, AnimationName) == 0x000000, "Member 'SpineSkeletonComponent_GetAnimationDuration::AnimationName' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_GetAnimationDuration, ReturnValue) == 0x000010, "Member 'SpineSkeletonComponent_GetAnimationDuration::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.GetAnimations
// 0x0010 (0x0010 - 0x0000)
struct SpineSkeletonComponent_GetAnimations final
{
public:
	TArray<class FString>                         Animations;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonComponent_GetAnimations) == 0x000008, "Wrong alignment on SpineSkeletonComponent_GetAnimations");
static_assert(sizeof(SpineSkeletonComponent_GetAnimations) == 0x000010, "Wrong size on SpineSkeletonComponent_GetAnimations");
static_assert(offsetof(SpineSkeletonComponent_GetAnimations, Animations) == 0x000000, "Member 'SpineSkeletonComponent_GetAnimations::Animations' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.GetBones
// 0x0010 (0x0010 - 0x0000)
struct SpineSkeletonComponent_GetBones final
{
public:
	TArray<class FString>                         Bones;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonComponent_GetBones) == 0x000008, "Wrong alignment on SpineSkeletonComponent_GetBones");
static_assert(sizeof(SpineSkeletonComponent_GetBones) == 0x000010, "Wrong size on SpineSkeletonComponent_GetBones");
static_assert(offsetof(SpineSkeletonComponent_GetBones, Bones) == 0x000000, "Member 'SpineSkeletonComponent_GetBones::Bones' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.GetBoneWorldTransform
// 0x0040 (0x0040 - 0x0000)
struct SpineSkeletonComponent_GetBoneWorldTransform final
{
public:
	class FString                                 BoneName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonComponent_GetBoneWorldTransform) == 0x000010, "Wrong alignment on SpineSkeletonComponent_GetBoneWorldTransform");
static_assert(sizeof(SpineSkeletonComponent_GetBoneWorldTransform) == 0x000040, "Wrong size on SpineSkeletonComponent_GetBoneWorldTransform");
static_assert(offsetof(SpineSkeletonComponent_GetBoneWorldTransform, BoneName) == 0x000000, "Member 'SpineSkeletonComponent_GetBoneWorldTransform::BoneName' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_GetBoneWorldTransform, ReturnValue) == 0x000010, "Member 'SpineSkeletonComponent_GetBoneWorldTransform::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.GetScaleX
// 0x0004 (0x0004 - 0x0000)
struct SpineSkeletonComponent_GetScaleX final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonComponent_GetScaleX) == 0x000004, "Wrong alignment on SpineSkeletonComponent_GetScaleX");
static_assert(sizeof(SpineSkeletonComponent_GetScaleX) == 0x000004, "Wrong size on SpineSkeletonComponent_GetScaleX");
static_assert(offsetof(SpineSkeletonComponent_GetScaleX, ReturnValue) == 0x000000, "Member 'SpineSkeletonComponent_GetScaleX::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.GetScaleY
// 0x0004 (0x0004 - 0x0000)
struct SpineSkeletonComponent_GetScaleY final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonComponent_GetScaleY) == 0x000004, "Wrong alignment on SpineSkeletonComponent_GetScaleY");
static_assert(sizeof(SpineSkeletonComponent_GetScaleY) == 0x000004, "Wrong size on SpineSkeletonComponent_GetScaleY");
static_assert(offsetof(SpineSkeletonComponent_GetScaleY, ReturnValue) == 0x000000, "Member 'SpineSkeletonComponent_GetScaleY::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.GetSkins
// 0x0010 (0x0010 - 0x0000)
struct SpineSkeletonComponent_GetSkins final
{
public:
	TArray<class FString>                         Skins;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonComponent_GetSkins) == 0x000008, "Wrong alignment on SpineSkeletonComponent_GetSkins");
static_assert(sizeof(SpineSkeletonComponent_GetSkins) == 0x000010, "Wrong size on SpineSkeletonComponent_GetSkins");
static_assert(offsetof(SpineSkeletonComponent_GetSkins, Skins) == 0x000000, "Member 'SpineSkeletonComponent_GetSkins::Skins' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.GetSlots
// 0x0010 (0x0010 - 0x0000)
struct SpineSkeletonComponent_GetSlots final
{
public:
	TArray<class FString>                         Slots;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonComponent_GetSlots) == 0x000008, "Wrong alignment on SpineSkeletonComponent_GetSlots");
static_assert(sizeof(SpineSkeletonComponent_GetSlots) == 0x000010, "Wrong size on SpineSkeletonComponent_GetSlots");
static_assert(offsetof(SpineSkeletonComponent_GetSlots, Slots) == 0x000000, "Member 'SpineSkeletonComponent_GetSlots::Slots' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.HasAnimation
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonComponent_HasAnimation final
{
public:
	class FString                                 AnimationName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SpineSkeletonComponent_HasAnimation) == 0x000008, "Wrong alignment on SpineSkeletonComponent_HasAnimation");
static_assert(sizeof(SpineSkeletonComponent_HasAnimation) == 0x000018, "Wrong size on SpineSkeletonComponent_HasAnimation");
static_assert(offsetof(SpineSkeletonComponent_HasAnimation, AnimationName) == 0x000000, "Member 'SpineSkeletonComponent_HasAnimation::AnimationName' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_HasAnimation, ReturnValue) == 0x000010, "Member 'SpineSkeletonComponent_HasAnimation::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.HasBone
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonComponent_HasBone final
{
public:
	class FString                                 BoneName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SpineSkeletonComponent_HasBone) == 0x000008, "Wrong alignment on SpineSkeletonComponent_HasBone");
static_assert(sizeof(SpineSkeletonComponent_HasBone) == 0x000018, "Wrong size on SpineSkeletonComponent_HasBone");
static_assert(offsetof(SpineSkeletonComponent_HasBone, BoneName) == 0x000000, "Member 'SpineSkeletonComponent_HasBone::BoneName' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_HasBone, ReturnValue) == 0x000010, "Member 'SpineSkeletonComponent_HasBone::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.HasSkin
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonComponent_HasSkin final
{
public:
	class FString                                 SkinName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SpineSkeletonComponent_HasSkin) == 0x000008, "Wrong alignment on SpineSkeletonComponent_HasSkin");
static_assert(sizeof(SpineSkeletonComponent_HasSkin) == 0x000018, "Wrong size on SpineSkeletonComponent_HasSkin");
static_assert(offsetof(SpineSkeletonComponent_HasSkin, SkinName) == 0x000000, "Member 'SpineSkeletonComponent_HasSkin::SkinName' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_HasSkin, ReturnValue) == 0x000010, "Member 'SpineSkeletonComponent_HasSkin::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.HasSlot
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonComponent_HasSlot final
{
public:
	class FString                                 SlotName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SpineSkeletonComponent_HasSlot) == 0x000008, "Wrong alignment on SpineSkeletonComponent_HasSlot");
static_assert(sizeof(SpineSkeletonComponent_HasSlot) == 0x000018, "Wrong size on SpineSkeletonComponent_HasSlot");
static_assert(offsetof(SpineSkeletonComponent_HasSlot, SlotName) == 0x000000, "Member 'SpineSkeletonComponent_HasSlot::SlotName' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_HasSlot, ReturnValue) == 0x000010, "Member 'SpineSkeletonComponent_HasSlot::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.SetAttachment
// 0x0028 (0x0028 - 0x0000)
struct SpineSkeletonComponent_SetAttachment final
{
public:
	class FString                                 SlotName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AttachmentName;                                    // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SpineSkeletonComponent_SetAttachment) == 0x000008, "Wrong alignment on SpineSkeletonComponent_SetAttachment");
static_assert(sizeof(SpineSkeletonComponent_SetAttachment) == 0x000028, "Wrong size on SpineSkeletonComponent_SetAttachment");
static_assert(offsetof(SpineSkeletonComponent_SetAttachment, SlotName) == 0x000000, "Member 'SpineSkeletonComponent_SetAttachment::SlotName' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_SetAttachment, AttachmentName) == 0x000010, "Member 'SpineSkeletonComponent_SetAttachment::AttachmentName' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_SetAttachment, ReturnValue) == 0x000020, "Member 'SpineSkeletonComponent_SetAttachment::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.SetBoneWorldPosition
// 0x0020 (0x0020 - 0x0000)
struct SpineSkeletonComponent_SetBoneWorldPosition final
{
public:
	class FString                                 BoneName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0010(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SpineSkeletonComponent_SetBoneWorldPosition) == 0x000008, "Wrong alignment on SpineSkeletonComponent_SetBoneWorldPosition");
static_assert(sizeof(SpineSkeletonComponent_SetBoneWorldPosition) == 0x000020, "Wrong size on SpineSkeletonComponent_SetBoneWorldPosition");
static_assert(offsetof(SpineSkeletonComponent_SetBoneWorldPosition, BoneName) == 0x000000, "Member 'SpineSkeletonComponent_SetBoneWorldPosition::BoneName' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_SetBoneWorldPosition, Position) == 0x000010, "Member 'SpineSkeletonComponent_SetBoneWorldPosition::Position' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.SetScale
// 0x0004 (0x0004 - 0x0000)
struct SpineSkeletonComponent_SetScale final
{
public:
	float                                         InScale;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonComponent_SetScale) == 0x000004, "Wrong alignment on SpineSkeletonComponent_SetScale");
static_assert(sizeof(SpineSkeletonComponent_SetScale) == 0x000004, "Wrong size on SpineSkeletonComponent_SetScale");
static_assert(offsetof(SpineSkeletonComponent_SetScale, InScale) == 0x000000, "Member 'SpineSkeletonComponent_SetScale::InScale' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.SetScaleX
// 0x0004 (0x0004 - 0x0000)
struct SpineSkeletonComponent_SetScaleX final
{
public:
	float                                         ScaleX;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonComponent_SetScaleX) == 0x000004, "Wrong alignment on SpineSkeletonComponent_SetScaleX");
static_assert(sizeof(SpineSkeletonComponent_SetScaleX) == 0x000004, "Wrong size on SpineSkeletonComponent_SetScaleX");
static_assert(offsetof(SpineSkeletonComponent_SetScaleX, ScaleX) == 0x000000, "Member 'SpineSkeletonComponent_SetScaleX::ScaleX' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.SetScaleY
// 0x0004 (0x0004 - 0x0000)
struct SpineSkeletonComponent_SetScaleY final
{
public:
	float                                         ScaleY;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonComponent_SetScaleY) == 0x000004, "Wrong alignment on SpineSkeletonComponent_SetScaleY");
static_assert(sizeof(SpineSkeletonComponent_SetScaleY) == 0x000004, "Wrong size on SpineSkeletonComponent_SetScaleY");
static_assert(offsetof(SpineSkeletonComponent_SetScaleY, ScaleY) == 0x000000, "Member 'SpineSkeletonComponent_SetScaleY::ScaleY' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.SetSkin
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonComponent_SetSkin final
{
public:
	class FString                                 SkinName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SpineSkeletonComponent_SetSkin) == 0x000008, "Wrong alignment on SpineSkeletonComponent_SetSkin");
static_assert(sizeof(SpineSkeletonComponent_SetSkin) == 0x000018, "Wrong size on SpineSkeletonComponent_SetSkin");
static_assert(offsetof(SpineSkeletonComponent_SetSkin, SkinName) == 0x000000, "Member 'SpineSkeletonComponent_SetSkin::SkinName' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_SetSkin, ReturnValue) == 0x000010, "Member 'SpineSkeletonComponent_SetSkin::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.SetSkins
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonComponent_SetSkins final
{
public:
	TArray<class FString>                         SkinNames;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SpineSkeletonComponent_SetSkins) == 0x000008, "Wrong alignment on SpineSkeletonComponent_SetSkins");
static_assert(sizeof(SpineSkeletonComponent_SetSkins) == 0x000018, "Wrong size on SpineSkeletonComponent_SetSkins");
static_assert(offsetof(SpineSkeletonComponent_SetSkins, SkinNames) == 0x000000, "Member 'SpineSkeletonComponent_SetSkins::SkinNames' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_SetSkins, ReturnValue) == 0x000010, "Member 'SpineSkeletonComponent_SetSkins::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonAnimationComponent.AddAnimation
// 0x0028 (0x0028 - 0x0000)
struct SpineSkeletonAnimationComponent_AddAnimation final
{
public:
	int32                                         TrackIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AnimationName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Loop;                                              // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Delay;                                             // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTrackEntry*                            ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonAnimationComponent_AddAnimation) == 0x000008, "Wrong alignment on SpineSkeletonAnimationComponent_AddAnimation");
static_assert(sizeof(SpineSkeletonAnimationComponent_AddAnimation) == 0x000028, "Wrong size on SpineSkeletonAnimationComponent_AddAnimation");
static_assert(offsetof(SpineSkeletonAnimationComponent_AddAnimation, TrackIndex) == 0x000000, "Member 'SpineSkeletonAnimationComponent_AddAnimation::TrackIndex' has a wrong offset!");
static_assert(offsetof(SpineSkeletonAnimationComponent_AddAnimation, AnimationName) == 0x000008, "Member 'SpineSkeletonAnimationComponent_AddAnimation::AnimationName' has a wrong offset!");
static_assert(offsetof(SpineSkeletonAnimationComponent_AddAnimation, Loop) == 0x000018, "Member 'SpineSkeletonAnimationComponent_AddAnimation::Loop' has a wrong offset!");
static_assert(offsetof(SpineSkeletonAnimationComponent_AddAnimation, Delay) == 0x00001C, "Member 'SpineSkeletonAnimationComponent_AddAnimation::Delay' has a wrong offset!");
static_assert(offsetof(SpineSkeletonAnimationComponent_AddAnimation, ReturnValue) == 0x000020, "Member 'SpineSkeletonAnimationComponent_AddAnimation::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonAnimationComponent.AddEmptyAnimation
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonAnimationComponent_AddEmptyAnimation final
{
public:
	int32                                         TrackIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MixDuration;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTrackEntry*                            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonAnimationComponent_AddEmptyAnimation) == 0x000008, "Wrong alignment on SpineSkeletonAnimationComponent_AddEmptyAnimation");
static_assert(sizeof(SpineSkeletonAnimationComponent_AddEmptyAnimation) == 0x000018, "Wrong size on SpineSkeletonAnimationComponent_AddEmptyAnimation");
static_assert(offsetof(SpineSkeletonAnimationComponent_AddEmptyAnimation, TrackIndex) == 0x000000, "Member 'SpineSkeletonAnimationComponent_AddEmptyAnimation::TrackIndex' has a wrong offset!");
static_assert(offsetof(SpineSkeletonAnimationComponent_AddEmptyAnimation, MixDuration) == 0x000004, "Member 'SpineSkeletonAnimationComponent_AddEmptyAnimation::MixDuration' has a wrong offset!");
static_assert(offsetof(SpineSkeletonAnimationComponent_AddEmptyAnimation, Delay) == 0x000008, "Member 'SpineSkeletonAnimationComponent_AddEmptyAnimation::Delay' has a wrong offset!");
static_assert(offsetof(SpineSkeletonAnimationComponent_AddEmptyAnimation, ReturnValue) == 0x000010, "Member 'SpineSkeletonAnimationComponent_AddEmptyAnimation::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonAnimationComponent.ClearTrack
// 0x0004 (0x0004 - 0x0000)
struct SpineSkeletonAnimationComponent_ClearTrack final
{
public:
	int32                                         TrackIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonAnimationComponent_ClearTrack) == 0x000004, "Wrong alignment on SpineSkeletonAnimationComponent_ClearTrack");
static_assert(sizeof(SpineSkeletonAnimationComponent_ClearTrack) == 0x000004, "Wrong size on SpineSkeletonAnimationComponent_ClearTrack");
static_assert(offsetof(SpineSkeletonAnimationComponent_ClearTrack, TrackIndex) == 0x000000, "Member 'SpineSkeletonAnimationComponent_ClearTrack::TrackIndex' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonAnimationComponent.GetCurrent
// 0x0010 (0x0010 - 0x0000)
struct SpineSkeletonAnimationComponent_GetCurrent final
{
public:
	int32                                         TrackIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTrackEntry*                            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonAnimationComponent_GetCurrent) == 0x000008, "Wrong alignment on SpineSkeletonAnimationComponent_GetCurrent");
static_assert(sizeof(SpineSkeletonAnimationComponent_GetCurrent) == 0x000010, "Wrong size on SpineSkeletonAnimationComponent_GetCurrent");
static_assert(offsetof(SpineSkeletonAnimationComponent_GetCurrent, TrackIndex) == 0x000000, "Member 'SpineSkeletonAnimationComponent_GetCurrent::TrackIndex' has a wrong offset!");
static_assert(offsetof(SpineSkeletonAnimationComponent_GetCurrent, ReturnValue) == 0x000008, "Member 'SpineSkeletonAnimationComponent_GetCurrent::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonAnimationComponent.GetTimeScale
// 0x0004 (0x0004 - 0x0000)
struct SpineSkeletonAnimationComponent_GetTimeScale final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonAnimationComponent_GetTimeScale) == 0x000004, "Wrong alignment on SpineSkeletonAnimationComponent_GetTimeScale");
static_assert(sizeof(SpineSkeletonAnimationComponent_GetTimeScale) == 0x000004, "Wrong size on SpineSkeletonAnimationComponent_GetTimeScale");
static_assert(offsetof(SpineSkeletonAnimationComponent_GetTimeScale, ReturnValue) == 0x000000, "Member 'SpineSkeletonAnimationComponent_GetTimeScale::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonAnimationComponent.SetAnimation
// 0x0028 (0x0028 - 0x0000)
struct SpineSkeletonAnimationComponent_SetAnimation final
{
public:
	int32                                         TrackIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AnimationName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Loop;                                              // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTrackEntry*                            ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonAnimationComponent_SetAnimation) == 0x000008, "Wrong alignment on SpineSkeletonAnimationComponent_SetAnimation");
static_assert(sizeof(SpineSkeletonAnimationComponent_SetAnimation) == 0x000028, "Wrong size on SpineSkeletonAnimationComponent_SetAnimation");
static_assert(offsetof(SpineSkeletonAnimationComponent_SetAnimation, TrackIndex) == 0x000000, "Member 'SpineSkeletonAnimationComponent_SetAnimation::TrackIndex' has a wrong offset!");
static_assert(offsetof(SpineSkeletonAnimationComponent_SetAnimation, AnimationName) == 0x000008, "Member 'SpineSkeletonAnimationComponent_SetAnimation::AnimationName' has a wrong offset!");
static_assert(offsetof(SpineSkeletonAnimationComponent_SetAnimation, Loop) == 0x000018, "Member 'SpineSkeletonAnimationComponent_SetAnimation::Loop' has a wrong offset!");
static_assert(offsetof(SpineSkeletonAnimationComponent_SetAnimation, ReturnValue) == 0x000020, "Member 'SpineSkeletonAnimationComponent_SetAnimation::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonAnimationComponent.SetAutoPlay
// 0x0001 (0x0001 - 0x0000)
struct SpineSkeletonAnimationComponent_SetAutoPlay final
{
public:
	bool                                          bInAutoPlays;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonAnimationComponent_SetAutoPlay) == 0x000001, "Wrong alignment on SpineSkeletonAnimationComponent_SetAutoPlay");
static_assert(sizeof(SpineSkeletonAnimationComponent_SetAutoPlay) == 0x000001, "Wrong size on SpineSkeletonAnimationComponent_SetAutoPlay");
static_assert(offsetof(SpineSkeletonAnimationComponent_SetAutoPlay, bInAutoPlays) == 0x000000, "Member 'SpineSkeletonAnimationComponent_SetAutoPlay::bInAutoPlays' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonAnimationComponent.SetEmptyAnimation
// 0x0010 (0x0010 - 0x0000)
struct SpineSkeletonAnimationComponent_SetEmptyAnimation final
{
public:
	int32                                         TrackIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MixDuration;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTrackEntry*                            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonAnimationComponent_SetEmptyAnimation) == 0x000008, "Wrong alignment on SpineSkeletonAnimationComponent_SetEmptyAnimation");
static_assert(sizeof(SpineSkeletonAnimationComponent_SetEmptyAnimation) == 0x000010, "Wrong size on SpineSkeletonAnimationComponent_SetEmptyAnimation");
static_assert(offsetof(SpineSkeletonAnimationComponent_SetEmptyAnimation, TrackIndex) == 0x000000, "Member 'SpineSkeletonAnimationComponent_SetEmptyAnimation::TrackIndex' has a wrong offset!");
static_assert(offsetof(SpineSkeletonAnimationComponent_SetEmptyAnimation, MixDuration) == 0x000004, "Member 'SpineSkeletonAnimationComponent_SetEmptyAnimation::MixDuration' has a wrong offset!");
static_assert(offsetof(SpineSkeletonAnimationComponent_SetEmptyAnimation, ReturnValue) == 0x000008, "Member 'SpineSkeletonAnimationComponent_SetEmptyAnimation::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonAnimationComponent.SetPlaybackTime
// 0x0008 (0x0008 - 0x0000)
struct SpineSkeletonAnimationComponent_SetPlaybackTime final
{
public:
	float                                         InPlaybackTime;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCallDelegates;                                    // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
