#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpinePlugin

#include "Basic.hpp"

#include "MovieScene_structs.hpp"


namespace SDK
{

// ScriptStruct SpinePlugin.SpineEvent
// 0x0030 (0x0030 - 0x0000)
struct FSpineEvent final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StringValue;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IntValue;                                          // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloatValue;                                        // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSpineEvent) == 0x000008, "Wrong alignment on FSpineEvent");
static_assert(sizeof(FSpineEvent) == 0x000030, "Wrong size on FSpineEvent");
static_assert(offsetof(FSpineEvent, Name) == 0x000000, "Member 'FSpineEvent::Name' has a wrong offset!");
static_assert(offsetof(FSpineEvent, StringValue) == 0x000010, "Member 'FSpineEvent::StringValue' has a wrong offset!");
static_assert(offsetof(FSpineEvent, IntValue) == 0x000020, "Member 'FSpineEvent::IntValue' has a wrong offset!");
static_assert(offsetof(FSpineEvent, FloatValue) == 0x000024, "Member 'FSpineEvent::FloatValue' has a wrong offset!");
static_assert(offsetof(FSpineEvent, Time) == 0x000028, "Member 'FSpineEvent::Time' has a wrong offset!");

// ScriptStruct SpinePlugin.SpineAnimationStateMixData
// 0x0028 (0x0028 - 0x0000)
struct FSpineAnimationStateMixData final
{
public:
	class FString                                 From;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 To;                                                // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mix;                                               // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSpineAnimationStateMixData) == 0x000008, "Wrong alignment on FSpineAnimationStateMixData");
static_assert(sizeof(FSpineAnimationStateMixData) == 0x000028, "Wrong size on FSpineAnimationStateMixData");
static_assert(offsetof(FSpineAnimationStateMixData, From) == 0x000000, "Member 'FSpineAnimationStateMixData::From' has a wrong offset!");
static_assert(offsetof(FSpineAnimationStateMixData, To) == 0x000010, "Member 'FSpineAnimationStateMixData::To' has a wrong offset!");
static_assert(offsetof(FSpineAnimationStateMixData, Mix) == 0x000020, "Member 'FSpineAnimationStateMixData::Mix' has a wrong offset!");

// ScriptStruct SpinePlugin.SpineWidgetEvalTemplate
// 0x0008 (0x0028 - 0x0020)
struct FSpineWidgetEvalTemplate final : public FMovieSceneEvalTemplate
{
public:
	class USpineWidgetSection*                    Section;                                           // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSpineWidgetEvalTemplate) == 0x000008, "Wrong alignment on FSpineWidgetEvalTemplate");
static_assert(sizeof(FSpineWidgetEvalTemplate) == 0x000028, "Wrong size on FSpineWidgetEvalTemplate");
static_assert(offsetof(FSpineWidgetEvalTemplate, Section) == 0x000020, "Member 'FSpineWidgetEvalTemplate::Section' has a wrong offset!");

// ScriptStruct SpinePlugin.SpineWidgetScalarParameterNameAndCurve
// 0x00A8 (0x00A8 - 0x0000)
struct FSpineWidgetScalarParameterNameAndCurve final
{
public:
	class FName                                   ParameterName;                                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneFloatChannel                ParameterCurve;                                    // 0x0008(0x00A0)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FSpineWidgetScalarParameterNameAndCurve) == 0x000008, "Wrong alignment on FSpineWidgetScalarParameterNameAndCurve");
static_assert(sizeof(FSpineWidgetScalarParameterNameAndCurve) == 0x0000A8, "Wrong size on FSpineWidgetScalarParameterNameAndCurve");
static_assert(offsetof(FSpineWidgetScalarParameterNameAndCurve, ParameterName) == 0x000000, "Member 'FSpineWidgetScalarParameterNameAndCurve::ParameterName' has a wrong offset!");
static_assert(offsetof(FSpineWidgetScalarParameterNameAndCurve, ParameterCurve) == 0x000008, "Member 'FSpineWidgetScalarParameterNameAndCurve::ParameterCurve' has a wrong offset!");

}

