#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: St_previewLgiht

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct st_previewLgiht.st_previewLgiht
// 0x0018 (0x0018 - 0x0000)
struct FSt_previewLgiht final
{
public:
	float                                         LightIntensity_11_BF0C3F754ECD6DF908943C967F10BB42; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LightColor_12_98DD917B47ECC4ACCBAD619C5996E39C;    // 0x0004(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightRadius_13_025838364639495B85C04894C4EAC4A0;   // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSt_previewLgiht) == 0x000004, "Wrong alignment on FSt_previewLgiht");
static_assert(sizeof(FSt_previewLgiht) == 0x000018, "Wrong size on FSt_previewLgiht");
static_assert(offsetof(FSt_previewLgiht, LightIntensity_11_BF0C3F754ECD6DF908943C967F10BB42) == 0x000000, "Member 'FSt_previewLgiht::LightIntensity_11_BF0C3F754ECD6DF908943C967F10BB42' has a wrong offset!");
static_assert(offsetof(FSt_previewLgiht, LightColor_12_98DD917B47ECC4ACCBAD619C5996E39C) == 0x000004, "Member 'FSt_previewLgiht::LightColor_12_98DD917B47ECC4ACCBAD619C5996E39C' has a wrong offset!");
static_assert(offsetof(FSt_previewLgiht, LightRadius_13_025838364639495B85C04894C4EAC4A0) == 0x000014, "Member 'FSt_previewLgiht::LightRadius_13_025838364639495B85C04894C4EAC4A0' has a wrong offset!");

}

