#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: State_DisOutControllableNotBreathless

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function State_DisOutControllableNotBreathless.State_DisOutControllableNotBreathless_C.ExecuteUbergraph_State_DisOutControllableNotBreathless
// 0x0020 (0x0020 - 0x0000)
struct State_DisOutControllableNotBreathless_C_ExecuteUbergraph_State_DisOutControllableNotBreathless final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParamInfo>                     K2Node_Event_Info;                                 // 0x0008(0x0010)(ConstParm, ReferenceParm)
	const class UGameAbilityComponent*            K2Node_Event_lpInstigator;                         // 0x0018(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(State_DisOutControllableNotBreathless_C_ExecuteUbergraph_State_DisOutControllableNotBreathless) == 0x000008, "Wrong alignment on State_DisOutControllableNotBreathless_C_ExecuteUbergraph_State_DisOutControllableNotBreathless");
static_assert(sizeof(State_DisOutControllableNotBreathless_C_ExecuteUbergraph_State_DisOutControllableNotBreathless) == 0x000020, "Wrong size on State_DisOutControllableNotBreathless_C_ExecuteUbergraph_State_DisOutControllableNotBreathless");
static_assert(offsetof(State_DisOutControllableNotBreathless_C_ExecuteUbergraph_State_DisOutControllableNotBreathless, EntryPoint) == 0x000000, "Member 'State_DisOutControllableNotBreathless_C_ExecuteUbergraph_State_DisOutControllableNotBreathless::EntryPoint' has a wrong offset!");
static_assert(offsetof(State_DisOutControllableNotBreathless_C_ExecuteUbergraph_State_DisOutControllableNotBreathless, K2Node_Event_Info) == 0x000008, "Member 'State_DisOutControllableNotBreathless_C_ExecuteUbergraph_State_DisOutControllableNotBreathless::K2Node_Event_Info' has a wrong offset!");
static_assert(offsetof(State_DisOutControllableNotBreathless_C_ExecuteUbergraph_State_DisOutControllableNotBreathless, K2Node_Event_lpInstigator) == 0x000018, "Member 'State_DisOutControllableNotBreathless_C_ExecuteUbergraph_State_DisOutControllableNotBreathless::K2Node_Event_lpInstigator' has a wrong offset!");

// Function State_DisOutControllableNotBreathless.State_DisOutControllableNotBreathless_C.K2_ReceiveInitialize
// 0x0018 (0x0018 - 0x0000)
struct State_DisOutControllableNotBreathless_C_K2_ReceiveInitialize final
{
public:
	TArray<struct FParamInfo>                     Info;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	const class UGameAbilityComponent*            LpInstigator;                                      // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(State_DisOutControllableNotBreathless_C_K2_ReceiveInitialize) == 0x000008, "Wrong alignment on State_DisOutControllableNotBreathless_C_K2_ReceiveInitialize");
static_assert(sizeof(State_DisOutControllableNotBreathless_C_K2_ReceiveInitialize) == 0x000018, "Wrong size on State_DisOutControllableNotBreathless_C_K2_ReceiveInitialize");
static_assert(offsetof(State_DisOutControllableNotBreathless_C_K2_ReceiveInitialize, Info) == 0x000000, "Member 'State_DisOutControllableNotBreathless_C_K2_ReceiveInitialize::Info' has a wrong offset!");
static_assert(offsetof(State_DisOutControllableNotBreathless_C_K2_ReceiveInitialize, LpInstigator) == 0x000010, "Member 'State_DisOutControllableNotBreathless_C_K2_ReceiveInitialize::LpInstigator' has a wrong offset!");

}

