#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SunSky

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SunSky.SunSky_C
// 0x0078 (0x02A0 - 0x0228)
class ASunSky_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkyAtmosphereComponent*                SkyAtmosphere;                                     // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             DirectionalLight;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     SkyLight;                                          // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CompassMesh;                                       // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Latitude;                                          // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Longitude;                                         // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Year;                                              // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Month;                                             // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	int32                                         Day;                                               // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         TimeZone;                                          // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseDaylightSavingTime;                             // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NorthOffset;                                       // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Elevation;                                         // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CorrectedElevation;                                // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Azimuth;                                           // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SolarTime;                                         // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	int32                                         DSTStartMonth;                                     // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	int32                                         DSTStartDay;                                       // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	int32                                         DSTEndMonth;                                       // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	int32                                         DSTEndDay;                                         // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	int32                                         DSTSwitchHour;                                     // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         HashVal;                                           // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void IsDST(bool DSTEnable, int32 DSTStartMonth_0, int32 DSTStartDay_0, int32 DSTEndMonth_0, int32 DSTEndDay_0, int32 DSTSwitchHour_0, bool* IsDST_0);
	void GetHMSFromSolarTime(float SolarTime_0, int32* Hour, int32* Minute, int32* Second);
	void UpdateSun();
	void UserConstructionScript();
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_SunSky(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SunSky_C">();
	}
	static class ASunSky_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASunSky_C>();
	}
};
static_assert(alignof(ASunSky_C) == 0x000008, "Wrong alignment on ASunSky_C");
static_assert(sizeof(ASunSky_C) == 0x0002A0, "Wrong size on ASunSky_C");
static_assert(offsetof(ASunSky_C, UberGraphFrame) == 0x000228, "Member 'ASunSky_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASunSky_C, SkyAtmosphere) == 0x000230, "Member 'ASunSky_C::SkyAtmosphere' has a wrong offset!");
static_assert(offsetof(ASunSky_C, DirectionalLight) == 0x000238, "Member 'ASunSky_C::DirectionalLight' has a wrong offset!");
static_assert(offsetof(ASunSky_C, SkyLight) == 0x000240, "Member 'ASunSky_C::SkyLight' has a wrong offset!");
static_assert(offsetof(ASunSky_C, CompassMesh) == 0x000248, "Member 'ASunSky_C::CompassMesh' has a wrong offset!");
static_assert(offsetof(ASunSky_C, Scene) == 0x000250, "Member 'ASunSky_C::Scene' has a wrong offset!");
static_assert(offsetof(ASunSky_C, Latitude) == 0x000258, "Member 'ASunSky_C::Latitude' has a wrong offset!");
static_assert(offsetof(ASunSky_C, Longitude) == 0x00025C, "Member 'ASunSky_C::Longitude' has a wrong offset!");
static_assert(offsetof(ASunSky_C, Year) == 0x000260, "Member 'ASunSky_C::Year' has a wrong offset!");
static_assert(offsetof(ASunSky_C, Month) == 0x000264, "Member 'ASunSky_C::Month' has a wrong offset!");
static_assert(offsetof(ASunSky_C, Day) == 0x000268, "Member 'ASunSky_C::Day' has a wrong offset!");
static_assert(offsetof(ASunSky_C, TimeZone) == 0x00026C, "Member 'ASunSky_C::TimeZone' has a wrong offset!");
static_assert(offsetof(ASunSky_C, UseDaylightSavingTime) == 0x000270, "Member 'ASunSky_C::UseDaylightSavingTime' has a wrong offset!");
static_assert(offsetof(ASunSky_C, NorthOffset) == 0x000274, "Member 'ASunSky_C::NorthOffset' has a wrong offset!");
static_assert(offsetof(ASunSky_C, Elevation) == 0x000278, "Member 'ASunSky_C::Elevation' has a wrong offset!");
static_assert(offsetof(ASunSky_C, CorrectedElevation) == 0x00027C, "Member 'ASunSky_C::CorrectedElevation' has a wrong offset!");
static_assert(offsetof(ASunSky_C, Azimuth) == 0x000280, "Member 'ASunSky_C::Azimuth' has a wrong offset!");
static_assert(offsetof(ASunSky_C, SolarTime) == 0x000284, "Member 'ASunSky_C::SolarTime' has a wrong offset!");
static_assert(offsetof(ASunSky_C, DSTStartMonth) == 0x000288, "Member 'ASunSky_C::DSTStartMonth' has a wrong offset!");
static_assert(offsetof(ASunSky_C, DSTStartDay) == 0x00028C, "Member 'ASunSky_C::DSTStartDay' has a wrong offset!");
static_assert(offsetof(ASunSky_C, DSTEndMonth) == 0x000290, "Member 'ASunSky_C::DSTEndMonth' has a wrong offset!");
static_assert(offsetof(ASunSky_C, DSTEndDay) == 0x000294, "Member 'ASunSky_C::DSTEndDay' has a wrong offset!");
static_assert(offsetof(ASunSky_C, DSTSwitchHour) == 0x000298, "Member 'ASunSky_C::DSTSwitchHour' has a wrong offset!");
static_assert(offsetof(ASunSky_C, HashVal) == 0x00029C, "Member 'ASunSky_C::HashVal' has a wrong offset!");

}

