#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SupplyGenerator

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SupplyGenerator.SupplyGenerator_C.IsStillValid
// 0x0002 (0x0002 - 0x0000)
struct SupplyGenerator_C_IsStillValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SupplyGenerator_C_IsStillValid) == 0x000001, "Wrong alignment on SupplyGenerator_C_IsStillValid");
static_assert(sizeof(SupplyGenerator_C_IsStillValid) == 0x000002, "Wrong size on SupplyGenerator_C_IsStillValid");
static_assert(offsetof(SupplyGenerator_C_IsStillValid, ReturnValue) == 0x000000, "Member 'SupplyGenerator_C_IsStillValid::ReturnValue' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_IsStillValid, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'SupplyGenerator_C_IsStillValid::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function SupplyGenerator.SupplyGenerator_C.IsDS
// 0x0003 (0x0003 - 0x0000)
struct SupplyGenerator_C_IsDS final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SupplyGenerator_C_IsDS) == 0x000001, "Wrong alignment on SupplyGenerator_C_IsDS");
static_assert(sizeof(SupplyGenerator_C_IsDS) == 0x000003, "Wrong size on SupplyGenerator_C_IsDS");
static_assert(offsetof(SupplyGenerator_C_IsDS, Result) == 0x000000, "Member 'SupplyGenerator_C_IsDS::Result' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_IsDS, CallFunc_HasAuthority_ReturnValue) == 0x000001, "Member 'SupplyGenerator_C_IsDS::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_IsDS, CallFunc_IsDedicatedServer_ReturnValue) == 0x000002, "Member 'SupplyGenerator_C_IsDS::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function SupplyGenerator.SupplyGenerator_C.Play Wwise
// 0x0018 (0x0018 - 0x0000)
struct SupplyGenerator_C_Play_Wwise final
{
public:
	class FString                                 WwiseName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UWwiseComponent*                        CallFunc_PostEventAttachedActor_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SupplyGenerator_C_Play_Wwise) == 0x000008, "Wrong alignment on SupplyGenerator_C_Play_Wwise");
static_assert(sizeof(SupplyGenerator_C_Play_Wwise) == 0x000018, "Wrong size on SupplyGenerator_C_Play_Wwise");
static_assert(offsetof(SupplyGenerator_C_Play_Wwise, WwiseName) == 0x000000, "Member 'SupplyGenerator_C_Play_Wwise::WwiseName' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_Play_Wwise, CallFunc_PostEventAttachedActor_ReturnValue) == 0x000010, "Member 'SupplyGenerator_C_Play_Wwise::CallFunc_PostEventAttachedActor_ReturnValue' has a wrong offset!");

// Function SupplyGenerator.SupplyGenerator_C.PlayLastingEffect
// 0x0038 (0x0038 - 0x0000)
struct SupplyGenerator_C_PlayLastingEffect final
{
public:
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_2;                   // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SupplyGenerator_C_PlayLastingEffect) == 0x000004, "Wrong alignment on SupplyGenerator_C_PlayLastingEffect");
static_assert(sizeof(SupplyGenerator_C_PlayLastingEffect) == 0x000038, "Wrong size on SupplyGenerator_C_PlayLastingEffect");
static_assert(offsetof(SupplyGenerator_C_PlayLastingEffect, K2Node_MakeStruct_LinearColor) == 0x000000, "Member 'SupplyGenerator_C_PlayLastingEffect::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_PlayLastingEffect, K2Node_MakeStruct_LinearColor_1) == 0x000010, "Member 'SupplyGenerator_C_PlayLastingEffect::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_PlayLastingEffect, K2Node_MakeStruct_LinearColor_2) == 0x000020, "Member 'SupplyGenerator_C_PlayLastingEffect::K2Node_MakeStruct_LinearColor_2' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_PlayLastingEffect, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000030, "Member 'SupplyGenerator_C_PlayLastingEffect::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_PlayLastingEffect, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000031, "Member 'SupplyGenerator_C_PlayLastingEffect::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_PlayLastingEffect, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000032, "Member 'SupplyGenerator_C_PlayLastingEffect::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_PlayLastingEffect, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x000033, "Member 'SupplyGenerator_C_PlayLastingEffect::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_PlayLastingEffect, CallFunc_BooleanOR_ReturnValue) == 0x000034, "Member 'SupplyGenerator_C_PlayLastingEffect::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function SupplyGenerator.SupplyGenerator_C.ClearDrop
// 0x0060 (0x0060 - 0x0000)
struct SupplyGenerator_C_ClearDrop final
{
public:
	bool                                          CallFunc_IsDS_Result;                              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDS_Result_1;                            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_2;                   // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SupplyGenerator_C_ClearDrop) == 0x000008, "Wrong alignment on SupplyGenerator_C_ClearDrop");
static_assert(sizeof(SupplyGenerator_C_ClearDrop) == 0x000060, "Wrong size on SupplyGenerator_C_ClearDrop");
static_assert(offsetof(SupplyGenerator_C_ClearDrop, CallFunc_IsDS_Result) == 0x000000, "Member 'SupplyGenerator_C_ClearDrop::CallFunc_IsDS_Result' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_ClearDrop, CallFunc_IsDS_Result_1) == 0x000001, "Member 'SupplyGenerator_C_ClearDrop::CallFunc_IsDS_Result_1' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_ClearDrop, K2Node_MakeStruct_LinearColor) == 0x000004, "Member 'SupplyGenerator_C_ClearDrop::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_ClearDrop, K2Node_MakeStruct_LinearColor_1) == 0x000014, "Member 'SupplyGenerator_C_ClearDrop::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_ClearDrop, K2Node_MakeStruct_LinearColor_2) == 0x000024, "Member 'SupplyGenerator_C_ClearDrop::K2Node_MakeStruct_LinearColor_2' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_ClearDrop, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000034, "Member 'SupplyGenerator_C_ClearDrop::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_ClearDrop, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000035, "Member 'SupplyGenerator_C_ClearDrop::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_ClearDrop, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000036, "Member 'SupplyGenerator_C_ClearDrop::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_ClearDrop, CallFunc_BooleanOR_ReturnValue) == 0x000037, "Member 'SupplyGenerator_C_ClearDrop::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_ClearDrop, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x000038, "Member 'SupplyGenerator_C_ClearDrop::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_ClearDrop, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x000039, "Member 'SupplyGenerator_C_ClearDrop::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_ClearDrop, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00003C, "Member 'SupplyGenerator_C_ClearDrop::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_ClearDrop, CallFunc_BooleanOR_ReturnValue_1) == 0x000048, "Member 'SupplyGenerator_C_ClearDrop::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_ClearDrop, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00004C, "Member 'SupplyGenerator_C_ClearDrop::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_ClearDrop, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000058, "Member 'SupplyGenerator_C_ClearDrop::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

// Function SupplyGenerator.SupplyGenerator_C.Spawn Drop
// 0x00C0 (0x00C0 - 0x0000)
struct SupplyGenerator_C_Spawn_Drop final
{
public:
	int32                                         DropId;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelDropBase*                         Drop_0;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelDropsManager*                     CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0xC];                                       // 0x0074(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	class ALevelDropBase*                         CallFunc_SpawnDropByID_ReturnValue;                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SupplyGenerator_C_Spawn_Drop) == 0x000010, "Wrong alignment on SupplyGenerator_C_Spawn_Drop");
static_assert(sizeof(SupplyGenerator_C_Spawn_Drop) == 0x0000C0, "Wrong size on SupplyGenerator_C_Spawn_Drop");
static_assert(offsetof(SupplyGenerator_C_Spawn_Drop, DropId) == 0x000000, "Member 'SupplyGenerator_C_Spawn_Drop::DropId' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_Spawn_Drop, Drop_0) == 0x000008, "Member 'SupplyGenerator_C_Spawn_Drop::Drop_0' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_Spawn_Drop, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000010, "Member 'SupplyGenerator_C_Spawn_Drop::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_Spawn_Drop, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'SupplyGenerator_C_Spawn_Drop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_Spawn_Drop, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000020, "Member 'SupplyGenerator_C_Spawn_Drop::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_Spawn_Drop, CallFunc_BreakTransform_Location) == 0x000050, "Member 'SupplyGenerator_C_Spawn_Drop::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_Spawn_Drop, CallFunc_BreakTransform_Rotation) == 0x00005C, "Member 'SupplyGenerator_C_Spawn_Drop::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_Spawn_Drop, CallFunc_BreakTransform_Scale) == 0x000068, "Member 'SupplyGenerator_C_Spawn_Drop::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_Spawn_Drop, CallFunc_MakeTransform_ReturnValue) == 0x000080, "Member 'SupplyGenerator_C_Spawn_Drop::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_Spawn_Drop, CallFunc_SpawnDropByID_ReturnValue) == 0x0000B0, "Member 'SupplyGenerator_C_Spawn_Drop::CallFunc_SpawnDropByID_ReturnValue' has a wrong offset!");

// Function SupplyGenerator.SupplyGenerator_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct SupplyGenerator_C_UserConstructionScript final
{
public:
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_DynamicCast_As____;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SupplyGenerator_C_UserConstructionScript) == 0x000008, "Wrong alignment on SupplyGenerator_C_UserConstructionScript");
static_assert(sizeof(SupplyGenerator_C_UserConstructionScript) == 0x000020, "Wrong size on SupplyGenerator_C_UserConstructionScript");
static_assert(offsetof(SupplyGenerator_C_UserConstructionScript, CallFunc_GetMaterial_ReturnValue) == 0x000000, "Member 'SupplyGenerator_C_UserConstructionScript::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_UserConstructionScript, K2Node_DynamicCast_As____) == 0x000008, "Member 'SupplyGenerator_C_UserConstructionScript::K2Node_DynamicCast_As____' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'SupplyGenerator_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000018, "Member 'SupplyGenerator_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function SupplyGenerator.SupplyGenerator_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct SupplyGenerator_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SupplyGenerator_C_ReceiveTick) == 0x000004, "Wrong alignment on SupplyGenerator_C_ReceiveTick");
static_assert(sizeof(SupplyGenerator_C_ReceiveTick) == 0x000004, "Wrong size on SupplyGenerator_C_ReceiveTick");
static_assert(offsetof(SupplyGenerator_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'SupplyGenerator_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function SupplyGenerator.SupplyGenerator_C.ReSpawn
// 0x0001 (0x0001 - 0x0000)
struct SupplyGenerator_C_ReSpawn final
{
public:
	bool                                          IsValid;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SupplyGenerator_C_ReSpawn) == 0x000001, "Wrong alignment on SupplyGenerator_C_ReSpawn");
static_assert(sizeof(SupplyGenerator_C_ReSpawn) == 0x000001, "Wrong size on SupplyGenerator_C_ReSpawn");
static_assert(offsetof(SupplyGenerator_C_ReSpawn, IsValid) == 0x000000, "Member 'SupplyGenerator_C_ReSpawn::IsValid' has a wrong offset!");

// Function SupplyGenerator.SupplyGenerator_C.ExecuteUbergraph_SupplyGenerator
// 0x00A0 (0x00A0 - 0x0000)
struct SupplyGenerator_C_ExecuteUbergraph_SupplyGenerator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStandalone_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelDropBase*                         CallFunc_Spawn_Drop_Drop;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsValid;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADrop_BlueprintBase_C*                  K2Node_DynamicCast_AsDrop_Blueprint_Base;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SupplyGenerator_C_ExecuteUbergraph_SupplyGenerator) == 0x000008, "Wrong alignment on SupplyGenerator_C_ExecuteUbergraph_SupplyGenerator");
static_assert(sizeof(SupplyGenerator_C_ExecuteUbergraph_SupplyGenerator) == 0x0000A0, "Wrong size on SupplyGenerator_C_ExecuteUbergraph_SupplyGenerator");
static_assert(offsetof(SupplyGenerator_C_ExecuteUbergraph_SupplyGenerator, EntryPoint) == 0x000000, "Member 'SupplyGenerator_C_ExecuteUbergraph_SupplyGenerator::EntryPoint' has a wrong offset!");
static_assert(offsetof(SupplyGenerator_C_ExecuteUbergraph_SupplyGenerator, CallFunc_IsStandalone_ReturnValue) == 0x000004, "Member 'SupplyGenerator_C_ExecuteUbergraph_SupplyGenerator::CallFunc_IsStandalone_ReturnValue' has a wrong offset!");
