#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SwitchMgr

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SwitchMgr.SwitchMgr_C
// 0x0030 (0x0258 - 0x0228)
class ASwitchMgr_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Height_1;                                          // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Height_2;                                          // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         TargetPoints;                                      // 0x0240(0x0010)(Edit, BlueprintVisible)
	float                                         SwitchCoolDown;                                    // 0x0250(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsWaitSkillRelease;                                // 0x0254(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void OnSwitchEvent__Overridden();
	void SwitchForce__Overridden();
	void ReceiveTick__Overridden(float DeltaSeconds);
	void OnBind__Overridden();
	void ExecuteUbergraph_SwitchMgr(int32 EntryPoint);
	void OnSwitchEvent();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void OnBind();
	void SwitchForce();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SwitchMgr_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SwitchMgr_C")
	}
	static class ASwitchMgr_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASwitchMgr_C>();
	}
};
DUMPER7_ASSERTS_ASwitchMgr_C;

}

