#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SwitchMgr

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SwitchMgr.SwitchMgr_C
// 0x0030 (0x0258 - 0x0228)
class ASwitchMgr_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Height_1;                                          // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Height_2;                                          // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         TargetPoints;                                      // 0x0240(0x0010)(Edit, BlueprintVisible)
	float                                         SwitchCoolDown;                                    // 0x0250(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsWaitSkillRelease;                                // 0x0254(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void OnSwitchEvent__Overridden();
	void OnBind__Overridden();
	void SwitchForce__Overridden();
	void ReceiveTick__Overridden(float DeltaSeconds);
	void ExecuteUbergraph_SwitchMgr(int32 EntryPoint);
	void OnBind();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void OnSwitchEvent();
	void ReceiveBeginPlay();
	void SwitchForce();
	void ReceiveTick(float DeltaSeconds);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SwitchMgr_C">();
	}
	static class ASwitchMgr_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASwitchMgr_C>();
	}
};
static_assert(alignof(ASwitchMgr_C) == 0x000008, "Wrong alignment on ASwitchMgr_C");
static_assert(sizeof(ASwitchMgr_C) == 0x000258, "Wrong size on ASwitchMgr_C");
static_assert(offsetof(ASwitchMgr_C, UberGraphFrame) == 0x000228, "Member 'ASwitchMgr_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASwitchMgr_C, DefaultSceneRoot) == 0x000230, "Member 'ASwitchMgr_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ASwitchMgr_C, Height_1) == 0x000238, "Member 'ASwitchMgr_C::Height_1' has a wrong offset!");
static_assert(offsetof(ASwitchMgr_C, Height_2) == 0x00023C, "Member 'ASwitchMgr_C::Height_2' has a wrong offset!");
static_assert(offsetof(ASwitchMgr_C, TargetPoints) == 0x000240, "Member 'ASwitchMgr_C::TargetPoints' has a wrong offset!");
static_assert(offsetof(ASwitchMgr_C, SwitchCoolDown) == 0x000250, "Member 'ASwitchMgr_C::SwitchCoolDown' has a wrong offset!");
static_assert(offsetof(ASwitchMgr_C, IsWaitSkillRelease) == 0x000254, "Member 'ASwitchMgr_C::IsWaitSkillRelease' has a wrong offset!");

}

