#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SwitchMgr

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SwitchMgr.SwitchMgr_C.ReceiveTick__Overridden
// 0x0004 (0x0004 - 0x0000)
struct SwitchMgr_C_ReceiveTick__Overridden final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SwitchMgr_C_ReceiveTick__Overridden) == 0x000004, "Wrong alignment on SwitchMgr_C_ReceiveTick__Overridden");
static_assert(sizeof(SwitchMgr_C_ReceiveTick__Overridden) == 0x000004, "Wrong size on SwitchMgr_C_ReceiveTick__Overridden");
static_assert(offsetof(SwitchMgr_C_ReceiveTick__Overridden, DeltaSeconds) == 0x000000, "Member 'SwitchMgr_C_ReceiveTick__Overridden::DeltaSeconds' has a wrong offset!");

// Function SwitchMgr.SwitchMgr_C.ExecuteUbergraph_SwitchMgr
// 0x0008 (0x0008 - 0x0000)
struct SwitchMgr_C_ExecuteUbergraph_SwitchMgr final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SwitchMgr_C_ExecuteUbergraph_SwitchMgr) == 0x000004, "Wrong alignment on SwitchMgr_C_ExecuteUbergraph_SwitchMgr");
static_assert(sizeof(SwitchMgr_C_ExecuteUbergraph_SwitchMgr) == 0x000008, "Wrong size on SwitchMgr_C_ExecuteUbergraph_SwitchMgr");
static_assert(offsetof(SwitchMgr_C_ExecuteUbergraph_SwitchMgr, EntryPoint) == 0x000000, "Member 'SwitchMgr_C_ExecuteUbergraph_SwitchMgr::EntryPoint' has a wrong offset!");
static_assert(offsetof(SwitchMgr_C_ExecuteUbergraph_SwitchMgr, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'SwitchMgr_C_ExecuteUbergraph_SwitchMgr::K2Node_Event_DeltaSeconds' has a wrong offset!");

// LuaFunction SwitchMgr.SwitchMgr_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct SwitchMgr_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SwitchMgr_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on SwitchMgr_C_ReceiveEndPlay");
static_assert(sizeof(SwitchMgr_C_ReceiveEndPlay) == 0x000001, "Wrong size on SwitchMgr_C_ReceiveEndPlay");
static_assert(offsetof(SwitchMgr_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'SwitchMgr_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// LuaFunction SwitchMgr.SwitchMgr_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct SwitchMgr_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SwitchMgr_C_ReceiveTick) == 0x000004, "Wrong alignment on SwitchMgr_C_ReceiveTick");
static_assert(sizeof(SwitchMgr_C_ReceiveTick) == 0x000004, "Wrong size on SwitchMgr_C_ReceiveTick");
static_assert(offsetof(SwitchMgr_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'SwitchMgr_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function SwitchMgr.SwitchMgr_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct SwitchMgr_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(SwitchMgr_C_GetModuleName) == 0x000008, "Wrong alignment on SwitchMgr_C_GetModuleName");
static_assert(sizeof(SwitchMgr_C_GetModuleName) == 0x000010, "Wrong size on SwitchMgr_C_GetModuleName");
static_assert(offsetof(SwitchMgr_C_GetModuleName, ReturnValue) == 0x000000, "Member 'SwitchMgr_C_GetModuleName::ReturnValue' has a wrong offset!");

}

