#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SwitchMgr

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SwitchMgr.SwitchMgr_C.ReceiveTick__Overridden
// 0x0004 (0x0004 - 0x0000)
struct SwitchMgr_C_ReceiveTick__Overridden final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SwitchMgr_C_ReceiveTick__Overridden;

// Function SwitchMgr.SwitchMgr_C.ExecuteUbergraph_SwitchMgr
// 0x0008 (0x0008 - 0x0000)
struct SwitchMgr_C_ExecuteUbergraph_SwitchMgr final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SwitchMgr_C_ExecuteUbergraph_SwitchMgr;

// LuaFunction SwitchMgr.SwitchMgr_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct SwitchMgr_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SwitchMgr_C_ReceiveEndPlay;

// LuaFunction SwitchMgr.SwitchMgr_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct SwitchMgr_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SwitchMgr_C_ReceiveTick;

// Function SwitchMgr.SwitchMgr_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct SwitchMgr_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SwitchMgr_C_GetModuleName;

}

