#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TargetTrigger

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// LuaFunction TargetTrigger.TargetTrigger_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct TargetTrigger_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TargetTrigger_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on TargetTrigger_C_ReceiveActorBeginOverlap");
static_assert(sizeof(TargetTrigger_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on TargetTrigger_C_ReceiveActorBeginOverlap");
static_assert(offsetof(TargetTrigger_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'TargetTrigger_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// LuaFunction TargetTrigger.TargetTrigger_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct TargetTrigger_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TargetTrigger_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on TargetTrigger_C_ReceiveActorEndOverlap");
static_assert(sizeof(TargetTrigger_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on TargetTrigger_C_ReceiveActorEndOverlap");
static_assert(offsetof(TargetTrigger_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'TargetTrigger_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// LuaFunction TargetTrigger.TargetTrigger_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct TargetTrigger_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TargetTrigger_C_ReceiveTick) == 0x000004, "Wrong alignment on TargetTrigger_C_ReceiveTick");
static_assert(sizeof(TargetTrigger_C_ReceiveTick) == 0x000004, "Wrong size on TargetTrigger_C_ReceiveTick");
static_assert(offsetof(TargetTrigger_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'TargetTrigger_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// LuaFunction TargetTrigger.TargetTrigger_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct TargetTrigger_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TargetTrigger_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on TargetTrigger_C_ReceiveEndPlay");
static_assert(sizeof(TargetTrigger_C_ReceiveEndPlay) == 0x000001, "Wrong size on TargetTrigger_C_ReceiveEndPlay");
static_assert(offsetof(TargetTrigger_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'TargetTrigger_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function TargetTrigger.TargetTrigger_C.SetEffectSize
// 0x0270 (0x0270 - 0x0000)
struct TargetTrigger_C_SetEffectSize final
{
public:
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0014(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x00B0(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x014C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_3;  // 0x01E4(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(TargetTrigger_C_SetEffectSize) == 0x000004, "Wrong alignment on TargetTrigger_C_SetEffectSize");
static_assert(sizeof(TargetTrigger_C_SetEffectSize) == 0x000270, "Wrong size on TargetTrigger_C_SetEffectSize");
static_assert(offsetof(TargetTrigger_C_SetEffectSize, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000000, "Member 'TargetTrigger_C_SetEffectSize::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_SetEffectSize, CallFunc_MakeVector_ReturnValue) == 0x000004, "Member 'TargetTrigger_C_SetEffectSize::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_SetEffectSize, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'TargetTrigger_C_SetEffectSize::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_SetEffectSize, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000014, "Member 'TargetTrigger_C_SetEffectSize::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_SetEffectSize, CallFunc_MakeVector_ReturnValue_1) == 0x0000A0, "Member 'TargetTrigger_C_SetEffectSize::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_SetEffectSize, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x0000AC, "Member 'TargetTrigger_C_SetEffectSize::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_SetEffectSize, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x0000B0, "Member 'TargetTrigger_C_SetEffectSize::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_SetEffectSize, CallFunc_MakeVector_ReturnValue_2) == 0x00013C, "Member 'TargetTrigger_C_SetEffectSize::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_SetEffectSize, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000148, "Member 'TargetTrigger_C_SetEffectSize::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_SetEffectSize, CallFunc_K2_SetRelativeLocation_SweepHitResult_2) == 0x00014C, "Member 'TargetTrigger_C_SetEffectSize::CallFunc_K2_SetRelativeLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_SetEffectSize, CallFunc_MakeVector_ReturnValue_3) == 0x0001D8, "Member 'TargetTrigger_C_SetEffectSize::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_SetEffectSize, CallFunc_K2_SetRelativeLocation_SweepHitResult_3) == 0x0001E4, "Member 'TargetTrigger_C_SetEffectSize::CallFunc_K2_SetRelativeLocation_SweepHitResult_3' has a wrong offset!");

// Function TargetTrigger.TargetTrigger_C.Set Border with New Niagara
// 0x0028 (0x0028 - 0x0000)
struct TargetTrigger_C_Set_Border_with_New_Niagara final
{
public:
	class UNiagaraSystem*                         NewNiagara;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TargetTrigger_C_Set_Border_with_New_Niagara) == 0x000008, "Wrong alignment on TargetTrigger_C_Set_Border_with_New_Niagara");
static_assert(sizeof(TargetTrigger_C_Set_Border_with_New_Niagara) == 0x000028, "Wrong size on TargetTrigger_C_Set_Border_with_New_Niagara");
static_assert(offsetof(TargetTrigger_C_Set_Border_with_New_Niagara, NewNiagara) == 0x000000, "Member 'TargetTrigger_C_Set_Border_with_New_Niagara::NewNiagara' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_Set_Border_with_New_Niagara, ___int_Array_Index_Variable) == 0x000008, "Member 'TargetTrigger_C_Set_Border_with_New_Niagara::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_Set_Border_with_New_Niagara, ___int_Loop_Counter_Variable) == 0x00000C, "Member 'TargetTrigger_C_Set_Border_with_New_Niagara::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_Set_Border_with_New_Niagara, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'TargetTrigger_C_Set_Border_with_New_Niagara::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_Set_Border_with_New_Niagara, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'TargetTrigger_C_Set_Border_with_New_Niagara::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_Set_Border_with_New_Niagara, CallFunc_Array_Get_Item) == 0x000018, "Member 'TargetTrigger_C_Set_Border_with_New_Niagara::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_Set_Border_with_New_Niagara, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'TargetTrigger_C_Set_Border_with_New_Niagara::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function TargetTrigger.TargetTrigger_C.Set Dissolve
// 0x0028 (0x0028 - 0x0000)
struct TargetTrigger_C_Set_Dissolve final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TargetTrigger_C_Set_Dissolve) == 0x000008, "Wrong alignment on TargetTrigger_C_Set_Dissolve");
static_assert(sizeof(TargetTrigger_C_Set_Dissolve) == 0x000028, "Wrong size on TargetTrigger_C_Set_Dissolve");
static_assert(offsetof(TargetTrigger_C_Set_Dissolve, Value) == 0x000000, "Member 'TargetTrigger_C_Set_Dissolve::Value' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_Set_Dissolve, ___int_Array_Index_Variable) == 0x000004, "Member 'TargetTrigger_C_Set_Dissolve::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_Set_Dissolve, ___int_Loop_Counter_Variable) == 0x000008, "Member 'TargetTrigger_C_Set_Dissolve::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_Set_Dissolve, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'TargetTrigger_C_Set_Dissolve::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_Set_Dissolve, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'TargetTrigger_C_Set_Dissolve::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_Set_Dissolve, CallFunc_Array_Get_Item) == 0x000018, "Member 'TargetTrigger_C_Set_Dissolve::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_Set_Dissolve, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'TargetTrigger_C_Set_Dissolve::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function TargetTrigger.TargetTrigger_C.SetBorderLength
// 0x0008 (0x0008 - 0x0000)
struct TargetTrigger_C_SetBorderLength final
{
public:
	int32                                         X;                                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Y;                                                 // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TargetTrigger_C_SetBorderLength) == 0x000004, "Wrong alignment on TargetTrigger_C_SetBorderLength");
static_assert(sizeof(TargetTrigger_C_SetBorderLength) == 0x000008, "Wrong size on TargetTrigger_C_SetBorderLength");
static_assert(offsetof(TargetTrigger_C_SetBorderLength, X) == 0x000000, "Member 'TargetTrigger_C_SetBorderLength::X' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_SetBorderLength, Y) == 0x000004, "Member 'TargetTrigger_C_SetBorderLength::Y' has a wrong offset!");

// Function TargetTrigger.TargetTrigger_C.Set View Distance
// 0x0030 (0x0030 - 0x0000)
struct TargetTrigger_C_Set_View_Distance final
{
public:
	TArray<class UNiagaraComponent*>              Borders_0;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TargetTrigger_C_Set_View_Distance) == 0x000008, "Wrong alignment on TargetTrigger_C_Set_View_Distance");
static_assert(sizeof(TargetTrigger_C_Set_View_Distance) == 0x000030, "Wrong size on TargetTrigger_C_Set_View_Distance");
static_assert(offsetof(TargetTrigger_C_Set_View_Distance, Borders_0) == 0x000000, "Member 'TargetTrigger_C_Set_View_Distance::Borders_0' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_Set_View_Distance, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'TargetTrigger_C_Set_View_Distance::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_Set_View_Distance, ___int_Array_Index_Variable) == 0x000014, "Member 'TargetTrigger_C_Set_View_Distance::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_Set_View_Distance, ___int_Loop_Counter_Variable) == 0x000018, "Member 'TargetTrigger_C_Set_View_Distance::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_Set_View_Distance, CallFunc_Array_Get_Item) == 0x000020, "Member 'TargetTrigger_C_Set_View_Distance::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_Set_View_Distance, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'TargetTrigger_C_Set_View_Distance::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_Set_View_Distance, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'TargetTrigger_C_Set_View_Distance::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function TargetTrigger.TargetTrigger_C.UserConstructionScript
// 0x0028 (0x0028 - 0x0000)
struct TargetTrigger_C_UserConstructionScript final
{
public:
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNiagaraComponent*>              K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(TargetTrigger_C_UserConstructionScript) == 0x000008, "Wrong alignment on TargetTrigger_C_UserConstructionScript");
static_assert(sizeof(TargetTrigger_C_UserConstructionScript) == 0x000028, "Wrong size on TargetTrigger_C_UserConstructionScript");
static_assert(offsetof(TargetTrigger_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000000, "Member 'TargetTrigger_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000004, "Member 'TargetTrigger_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'TargetTrigger_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000018, "Member 'TargetTrigger_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");

// Function TargetTrigger.TargetTrigger_C.ExecuteUbergraph_TargetTrigger
// 0x0068 (0x0068 - 0x0000)
struct TargetTrigger_C_ExecuteUbergraph_TargetTrigger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFXSystemComponent*>             CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFXSystemComponent*>             CallFunc_K2_GetComponentsByClass_ReturnValue_1;    // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TargetTrigger_C_ExecuteUbergraph_TargetTrigger) == 0x000008, "Wrong alignment on TargetTrigger_C_ExecuteUbergraph_TargetTrigger");
static_assert(sizeof(TargetTrigger_C_ExecuteUbergraph_TargetTrigger) == 0x000068, "Wrong size on TargetTrigger_C_ExecuteUbergraph_TargetTrigger");
static_assert(offsetof(TargetTrigger_C_ExecuteUbergraph_TargetTrigger, EntryPoint) == 0x000000, "Member 'TargetTrigger_C_ExecuteUbergraph_TargetTrigger::EntryPoint' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_ExecuteUbergraph_TargetTrigger, ___int_Array_Index_Variable) == 0x000004, "Member 'TargetTrigger_C_ExecuteUbergraph_TargetTrigger::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_ExecuteUbergraph_TargetTrigger, ___int_Loop_Counter_Variable) == 0x000008, "Member 'TargetTrigger_C_ExecuteUbergraph_TargetTrigger::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_ExecuteUbergraph_TargetTrigger, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'TargetTrigger_C_ExecuteUbergraph_TargetTrigger::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_ExecuteUbergraph_TargetTrigger, ___int_Array_Index_Variable_1) == 0x000010, "Member 'TargetTrigger_C_ExecuteUbergraph_TargetTrigger::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_ExecuteUbergraph_TargetTrigger, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000018, "Member 'TargetTrigger_C_ExecuteUbergraph_TargetTrigger::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_ExecuteUbergraph_TargetTrigger, ___int_Loop_Counter_Variable_1) == 0x000028, "Member 'TargetTrigger_C_ExecuteUbergraph_TargetTrigger::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_ExecuteUbergraph_TargetTrigger, CallFunc_Array_Get_Item) == 0x000030, "Member 'TargetTrigger_C_ExecuteUbergraph_TargetTrigger::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_ExecuteUbergraph_TargetTrigger, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'TargetTrigger_C_ExecuteUbergraph_TargetTrigger::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_ExecuteUbergraph_TargetTrigger, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'TargetTrigger_C_ExecuteUbergraph_TargetTrigger::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_ExecuteUbergraph_TargetTrigger, CallFunc_K2_GetComponentsByClass_ReturnValue_1) == 0x000040, "Member 'TargetTrigger_C_ExecuteUbergraph_TargetTrigger::CallFunc_K2_GetComponentsByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_ExecuteUbergraph_TargetTrigger, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'TargetTrigger_C_ExecuteUbergraph_TargetTrigger::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_ExecuteUbergraph_TargetTrigger, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'TargetTrigger_C_ExecuteUbergraph_TargetTrigger::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_ExecuteUbergraph_TargetTrigger, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'TargetTrigger_C_ExecuteUbergraph_TargetTrigger::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TargetTrigger_C_ExecuteUbergraph_TargetTrigger, CallFunc_Less_IntInt_ReturnValue_1) == 0x000064, "Member 'TargetTrigger_C_ExecuteUbergraph_TargetTrigger::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function TargetTrigger.TargetTrigger_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct TargetTrigger_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(TargetTrigger_C_GetModuleName) == 0x000008, "Wrong alignment on TargetTrigger_C_GetModuleName");
static_assert(sizeof(TargetTrigger_C_GetModuleName) == 0x000010, "Wrong size on TargetTrigger_C_GetModuleName");
static_assert(offsetof(TargetTrigger_C_GetModuleName, ReturnValue) == 0x000000, "Member 'TargetTrigger_C_GetModuleName::ReturnValue' has a wrong offset!");

}

