#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TargetTrigger

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TargetTrigger.TargetTrigger_C
// 0x00D8 (0x0300 - 0x0228)
class ATargetTrigger_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Down;                                              // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Up;                                                // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Right;                                             // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Left;                                              // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TriggerBox;                                        // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 Tag;                                               // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               SpawnInstence;                                     // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABaseMonster_C*>                 EnterMonsters;                                     // 0x0278(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AGamePlayer*>                    EnterPlayers;                                      // 0x0288(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UNiagaraComponent*                      AreaEffect;                                        // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Target;                                            // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ViewDistance;                                      // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      LeftBorder;                                        // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      RightBorder;                                       // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      UpBorder;                                          // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      DownBorder;                                        // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              Borders;                                           // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         ScaleX;                                            // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ScaleY;                                            // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         RedBorder;                                         // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         BlueBorder;                                        // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRed;                                             // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OffsetZ;                                           // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void SetEffectSize();
	void Set_Border_with_New_Niagara(class UNiagaraSystem* NewNiagara);
	void Set_Dissolve(int32 Value);
	void SetBorderLength(int32 X, int32 Y);
	void Set_View_Distance(TArray<class UNiagaraComponent*>& Borders_0);
	void UserConstructionScript();
	void ChangeBorderColor();
	void OnActive();
	void OnDeactive();
	void OnSafeToDanger();
	void OnDangerToSafe();
	void ExecuteUbergraph_TargetTrigger(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TargetTrigger_C">();
	}
	static class ATargetTrigger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATargetTrigger_C>();
	}
};
static_assert(alignof(ATargetTrigger_C) == 0x000008, "Wrong alignment on ATargetTrigger_C");
static_assert(sizeof(ATargetTrigger_C) == 0x000300, "Wrong size on ATargetTrigger_C");
static_assert(offsetof(ATargetTrigger_C, UberGraphFrame) == 0x000228, "Member 'ATargetTrigger_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATargetTrigger_C, Down) == 0x000230, "Member 'ATargetTrigger_C::Down' has a wrong offset!");
static_assert(offsetof(ATargetTrigger_C, Up) == 0x000238, "Member 'ATargetTrigger_C::Up' has a wrong offset!");
static_assert(offsetof(ATargetTrigger_C, Right) == 0x000240, "Member 'ATargetTrigger_C::Right' has a wrong offset!");
static_assert(offsetof(ATargetTrigger_C, Left) == 0x000248, "Member 'ATargetTrigger_C::Left' has a wrong offset!");
static_assert(offsetof(ATargetTrigger_C, TriggerBox) == 0x000250, "Member 'ATargetTrigger_C::TriggerBox' has a wrong offset!");
static_assert(offsetof(ATargetTrigger_C, DefaultSceneRoot) == 0x000258, "Member 'ATargetTrigger_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ATargetTrigger_C, Tag) == 0x000260, "Member 'ATargetTrigger_C::Tag' has a wrong offset!");
static_assert(offsetof(ATargetTrigger_C, SpawnInstence) == 0x000270, "Member 'ATargetTrigger_C::SpawnInstence' has a wrong offset!");
static_assert(offsetof(ATargetTrigger_C, EnterMonsters) == 0x000278, "Member 'ATargetTrigger_C::EnterMonsters' has a wrong offset!");
static_assert(offsetof(ATargetTrigger_C, EnterPlayers) == 0x000288, "Member 'ATargetTrigger_C::EnterPlayers' has a wrong offset!");
static_assert(offsetof(ATargetTrigger_C, AreaEffect) == 0x000298, "Member 'ATargetTrigger_C::AreaEffect' has a wrong offset!");
static_assert(offsetof(ATargetTrigger_C, Target) == 0x0002A0, "Member 'ATargetTrigger_C::Target' has a wrong offset!");
static_assert(offsetof(ATargetTrigger_C, ViewDistance) == 0x0002A8, "Member 'ATargetTrigger_C::ViewDistance' has a wrong offset!");
static_assert(offsetof(ATargetTrigger_C, LeftBorder) == 0x0002B0, "Member 'ATargetTrigger_C::LeftBorder' has a wrong offset!");
static_assert(offsetof(ATargetTrigger_C, RightBorder) == 0x0002B8, "Member 'ATargetTrigger_C::RightBorder' has a wrong offset!");
static_assert(offsetof(ATargetTrigger_C, UpBorder) == 0x0002C0, "Member 'ATargetTrigger_C::UpBorder' has a wrong offset!");
static_assert(offsetof(ATargetTrigger_C, DownBorder) == 0x0002C8, "Member 'ATargetTrigger_C::DownBorder' has a wrong offset!");
static_assert(offsetof(ATargetTrigger_C, Borders) == 0x0002D0, "Member 'ATargetTrigger_C::Borders' has a wrong offset!");
static_assert(offsetof(ATargetTrigger_C, ScaleX) == 0x0002E0, "Member 'ATargetTrigger_C::ScaleX' has a wrong offset!");
static_assert(offsetof(ATargetTrigger_C, ScaleY) == 0x0002E4, "Member 'ATargetTrigger_C::ScaleY' has a wrong offset!");
static_assert(offsetof(ATargetTrigger_C, RedBorder) == 0x0002E8, "Member 'ATargetTrigger_C::RedBorder' has a wrong offset!");
static_assert(offsetof(ATargetTrigger_C, BlueBorder) == 0x0002F0, "Member 'ATargetTrigger_C::BlueBorder' has a wrong offset!");
static_assert(offsetof(ATargetTrigger_C, IsRed) == 0x0002F8, "Member 'ATargetTrigger_C::IsRed' has a wrong offset!");
static_assert(offsetof(ATargetTrigger_C, OffsetZ) == 0x0002FC, "Member 'ATargetTrigger_C::OffsetZ' has a wrong offset!");

}

