#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TaskFinishEvent

#include "Basic.hpp"


namespace SDK::Params
{

// Function TaskFinishEvent.TaskFinishEvent_C.OnTrigger
// 0x0018 (0x0018 - 0x0000)
struct TaskFinishEvent_C_OnTrigger final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameTaskActor*                         CallFunc_GetGameTaskActor_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TaskFinishEvent_C_OnTrigger) == 0x000008, "Wrong alignment on TaskFinishEvent_C_OnTrigger");
static_assert(sizeof(TaskFinishEvent_C_OnTrigger) == 0x000018, "Wrong size on TaskFinishEvent_C_OnTrigger");
static_assert(offsetof(TaskFinishEvent_C_OnTrigger, ReturnValue) == 0x000000, "Member 'TaskFinishEvent_C_OnTrigger::ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskFinishEvent_C_OnTrigger, CallFunc_GetGameTaskActor_ReturnValue) == 0x000008, "Member 'TaskFinishEvent_C_OnTrigger::CallFunc_GetGameTaskActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskFinishEvent_C_OnTrigger, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'TaskFinishEvent_C_OnTrigger::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

