#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TaskTriggerExecute

#include "Basic.hpp"

#include "GameTask_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TaskTriggerExecute.TaskTriggerExecute_C
// 0x0030 (0x0230 - 0x0200)
class UTaskTriggerExecute_C final : public UGameTask_Execute
{
public:
	class FString                                 AreaTriggerGroup;                                  // 0x0200(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CheckNpcTag;                                       // 0x0210(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bCheckPlayer;                                      // 0x0220(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCheckMonster;                                     // 0x0221(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          MultiType;                                         // 0x0222(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCheckFrindlySummon;                               // 0x0223(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          FinishByCount;                                     // 0x0224(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NeedCount;                                         // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseEndOverlap;                                    // 0x022C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void GetTriggers(TArray<class AAreaTrigger_C*>* Find);
	void OnTick(float DeltaTime);
	void OnActive();
	void OnActive_Client();
	class FString GetDescription();
	void OnUpdate_Client(int32 Param1, int32 Param2, int32 Param3, int32 Param4, int32 Param5);
	void OnCountDown_Client();
	void OnEnd_Client();
	void OnEnd();

	class FString GetSpecialStaticDescription() const;
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("TaskTriggerExecute_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TaskTriggerExecute_C")
	}
	static class UTaskTriggerExecute_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTaskTriggerExecute_C>();
	}
};
DUMPER7_ASSERTS_UTaskTriggerExecute_C;

}

