#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TaskTriggerExecute

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TaskTriggerExecute.TaskTriggerExecute_C.GetTriggers
// 0x0148 (0x0148 - 0x0000)
struct TaskTriggerExecute_C_GetTriggers final
{
public:
	TArray<class AAreaTrigger_C*>                 Find;                                              // 0x0000(0x0010)(Parm, OutParm)
	class AGameTaskActor*                         TaskActor;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AAreaTrigger_C*>                 Results;                                           // 0x0018(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         ___int_Array_Index_Variable;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0090(0x0040)(HasGetValueTypeHash)
	class AGameTaskActor*                         CallFunc_GetGameTaskActor_ReturnValue;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AAreaTrigger_C*>                 CallFunc_GetAllActorsOfClass_OutActors;            // 0x0120(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAreaTrigger_C*                         CallFunc_Array_Get_Item;                           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x2];                                      // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TaskTriggerExecute_C_GetTriggers) == 0x000008, "Wrong alignment on TaskTriggerExecute_C_GetTriggers");
static_assert(sizeof(TaskTriggerExecute_C_GetTriggers) == 0x000148, "Wrong size on TaskTriggerExecute_C_GetTriggers");
static_assert(offsetof(TaskTriggerExecute_C_GetTriggers, Find) == 0x000000, "Member 'TaskTriggerExecute_C_GetTriggers::Find' has a wrong offset!");
static_assert(offsetof(TaskTriggerExecute_C_GetTriggers, TaskActor) == 0x000010, "Member 'TaskTriggerExecute_C_GetTriggers::TaskActor' has a wrong offset!");
static_assert(offsetof(TaskTriggerExecute_C_GetTriggers, Results) == 0x000018, "Member 'TaskTriggerExecute_C_GetTriggers::Results' has a wrong offset!");
static_assert(offsetof(TaskTriggerExecute_C_GetTriggers, ___int_Array_Index_Variable) == 0x000028, "Member 'TaskTriggerExecute_C_GetTriggers::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TaskTriggerExecute_C_GetTriggers, ___int_Loop_Counter_Variable) == 0x00002C, "Member 'TaskTriggerExecute_C_GetTriggers::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TaskTriggerExecute_C_GetTriggers, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'TaskTriggerExecute_C_GetTriggers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskTriggerExecute_C_GetTriggers, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'TaskTriggerExecute_C_GetTriggers::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskTriggerExecute_C_GetTriggers, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'TaskTriggerExecute_C_GetTriggers::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(TaskTriggerExecute_C_GetTriggers, K2Node_MakeStruct_FormatArgumentData_1) == 0x000090, "Member 'TaskTriggerExecute_C_GetTriggers::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(TaskTriggerExecute_C_GetTriggers, CallFunc_GetGameTaskActor_ReturnValue) == 0x0000D0, "Member 'TaskTriggerExecute_C_GetTriggers::CallFunc_GetGameTaskActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskTriggerExecute_C_GetTriggers, K2Node_MakeArray_Array) == 0x0000D8, "Member 'TaskTriggerExecute_C_GetTriggers::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TaskTriggerExecute_C_GetTriggers, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'TaskTriggerExecute_C_GetTriggers::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskTriggerExecute_C_GetTriggers, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'TaskTriggerExecute_C_GetTriggers::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskTriggerExecute_C_GetTriggers, CallFunc_Conv_TextToString_ReturnValue) == 0x000108, "Member 'TaskTriggerExecute_C_GetTriggers::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskTriggerExecute_C_GetTriggers, CallFunc_BooleanAND_ReturnValue) == 0x000118, "Member 'TaskTriggerExecute_C_GetTriggers::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskTriggerExecute_C_GetTriggers, CallFunc_GetAllActorsOfClass_OutActors) == 0x000120, "Member 'TaskTriggerExecute_C_GetTriggers::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(TaskTriggerExecute_C_GetTriggers, CallFunc_Array_Length_ReturnValue) == 0x000130, "Member 'TaskTriggerExecute_C_GetTriggers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskTriggerExecute_C_GetTriggers, CallFunc_Array_Get_Item) == 0x000138, "Member 'TaskTriggerExecute_C_GetTriggers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TaskTriggerExecute_C_GetTriggers, CallFunc_Less_IntInt_ReturnValue) == 0x000140, "Member 'TaskTriggerExecute_C_GetTriggers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskTriggerExecute_C_GetTriggers, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000141, "Member 'TaskTriggerExecute_C_GetTriggers::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskTriggerExecute_C_GetTriggers, CallFunc_Array_Add_ReturnValue) == 0x000144, "Member 'TaskTriggerExecute_C_GetTriggers::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// LuaFunction TaskTriggerExecute.TaskTriggerExecute_C.OnTick
// 0x0004 (0x0004 - 0x0000)
struct TaskTriggerExecute_C_OnTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TaskTriggerExecute_C_OnTick) == 0x000004, "Wrong alignment on TaskTriggerExecute_C_OnTick");
static_assert(sizeof(TaskTriggerExecute_C_OnTick) == 0x000004, "Wrong size on TaskTriggerExecute_C_OnTick");
static_assert(offsetof(TaskTriggerExecute_C_OnTick, DeltaTime) == 0x000000, "Member 'TaskTriggerExecute_C_OnTick::DeltaTime' has a wrong offset!");

// LuaFunction TaskTriggerExecute.TaskTriggerExecute_C.GetDescription
// 0x0010 (0x0010 - 0x0000)
struct TaskTriggerExecute_C_GetDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TaskTriggerExecute_C_GetDescription) == 0x000008, "Wrong alignment on TaskTriggerExecute_C_GetDescription");
static_assert(sizeof(TaskTriggerExecute_C_GetDescription) == 0x000010, "Wrong size on TaskTriggerExecute_C_GetDescription");
static_assert(offsetof(TaskTriggerExecute_C_GetDescription, ReturnValue) == 0x000000, "Member 'TaskTriggerExecute_C_GetDescription::ReturnValue' has a wrong offset!");

// LuaFunction TaskTriggerExecute.TaskTriggerExecute_C.OnUpdate_Client
// 0x0014 (0x0014 - 0x0000)
struct TaskTriggerExecute_C_OnUpdate_Client final
{
public:
	int32                                         Param1;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param2;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param3;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param4;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param5;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TaskTriggerExecute_C_OnUpdate_Client) == 0x000004, "Wrong alignment on TaskTriggerExecute_C_OnUpdate_Client");
static_assert(sizeof(TaskTriggerExecute_C_OnUpdate_Client) == 0x000014, "Wrong size on TaskTriggerExecute_C_OnUpdate_Client");
static_assert(offsetof(TaskTriggerExecute_C_OnUpdate_Client, Param1) == 0x000000, "Member 'TaskTriggerExecute_C_OnUpdate_Client::Param1' has a wrong offset!");
static_assert(offsetof(TaskTriggerExecute_C_OnUpdate_Client, Param2) == 0x000004, "Member 'TaskTriggerExecute_C_OnUpdate_Client::Param2' has a wrong offset!");
static_assert(offsetof(TaskTriggerExecute_C_OnUpdate_Client, Param3) == 0x000008, "Member 'TaskTriggerExecute_C_OnUpdate_Client::Param3' has a wrong offset!");
static_assert(offsetof(TaskTriggerExecute_C_OnUpdate_Client, Param4) == 0x00000C, "Member 'TaskTriggerExecute_C_OnUpdate_Client::Param4' has a wrong offset!");
static_assert(offsetof(TaskTriggerExecute_C_OnUpdate_Client, Param5) == 0x000010, "Member 'TaskTriggerExecute_C_OnUpdate_Client::Param5' has a wrong offset!");

// Function TaskTriggerExecute.TaskTriggerExecute_C.GetSpecialStaticDescription
// 0x0020 (0x0020 - 0x0000)
struct TaskTriggerExecute_C_GetSpecialStaticDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(TaskTriggerExecute_C_GetSpecialStaticDescription) == 0x000008, "Wrong alignment on TaskTriggerExecute_C_GetSpecialStaticDescription");
static_assert(sizeof(TaskTriggerExecute_C_GetSpecialStaticDescription) == 0x000020, "Wrong size on TaskTriggerExecute_C_GetSpecialStaticDescription");
static_assert(offsetof(TaskTriggerExecute_C_GetSpecialStaticDescription, ReturnValue) == 0x000000, "Member 'TaskTriggerExecute_C_GetSpecialStaticDescription::ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskTriggerExecute_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue) == 0x000010, "Member 'TaskTriggerExecute_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function TaskTriggerExecute.TaskTriggerExecute_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct TaskTriggerExecute_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(TaskTriggerExecute_C_GetModuleName) == 0x000008, "Wrong alignment on TaskTriggerExecute_C_GetModuleName");
static_assert(sizeof(TaskTriggerExecute_C_GetModuleName) == 0x000010, "Wrong size on TaskTriggerExecute_C_GetModuleName");
static_assert(offsetof(TaskTriggerExecute_C_GetModuleName, ReturnValue) == 0x000000, "Member 'TaskTriggerExecute_C_GetModuleName::ReturnValue' has a wrong offset!");

}

