#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TaskFinishEvent

#include "Basic.hpp"

#include "GameTask_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TaskFinishEvent.TaskFinishEvent_C
// 0x0008 (0x0160 - 0x0158)
class UTaskFinishEvent_C final : public UGameTaskEvent
{
public:
	bool                                          bDestroyAI;                                        // 0x0158(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPlayFinishAnim;                                   // 0x0159(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15A[0x2];                                      // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayerPerformDelay;                                // 0x015C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool OnTrigger();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TaskFinishEvent_C">();
	}
	static class UTaskFinishEvent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTaskFinishEvent_C>();
	}
};
static_assert(alignof(UTaskFinishEvent_C) == 0x000008, "Wrong alignment on UTaskFinishEvent_C");
static_assert(sizeof(UTaskFinishEvent_C) == 0x000160, "Wrong size on UTaskFinishEvent_C");
static_assert(offsetof(UTaskFinishEvent_C, bDestroyAI) == 0x000158, "Member 'UTaskFinishEvent_C::bDestroyAI' has a wrong offset!");
static_assert(offsetof(UTaskFinishEvent_C, bPlayFinishAnim) == 0x000159, "Member 'UTaskFinishEvent_C::bPlayFinishAnim' has a wrong offset!");
static_assert(offsetof(UTaskFinishEvent_C, PlayerPerformDelay) == 0x00015C, "Member 'UTaskFinishEvent_C::PlayerPerformDelay' has a wrong offset!");

}

