#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TaskTriggerExecute

#include "Basic.hpp"

#include "GameTask_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TaskTriggerExecute.TaskTriggerExecute_C
// 0x0030 (0x0230 - 0x0200)
class UTaskTriggerExecute_C final : public UGameTask_Execute
{
public:
	class FString                                 AreaTriggerGroup;                                  // 0x0200(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CheckNpcTag;                                       // 0x0210(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bCheckPlayer;                                      // 0x0220(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCheckMonster;                                     // 0x0221(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          MultiType;                                         // 0x0222(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCheckFrindlySummon;                               // 0x0223(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          FinishByCount;                                     // 0x0224(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NeedCount;                                         // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseEndOverlap;                                    // 0x022C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void GetTriggers(TArray<class AAreaTrigger_C*>* Find);
	void OnCountDown_Client();
	void OnActive();
	void OnActive_Client();
	void OnTick(float DeltaTime);
	void OnEnd();
	class FString GetDescription();
	void OnEnd_Client();
	void OnUpdate_Client(int32 Param1, int32 Param2, int32 Param3, int32 Param4, int32 Param5);

	class FString GetSpecialStaticDescription() const;
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TaskTriggerExecute_C">();
	}
	static class UTaskTriggerExecute_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTaskTriggerExecute_C>();
	}
};
static_assert(alignof(UTaskTriggerExecute_C) == 0x000008, "Wrong alignment on UTaskTriggerExecute_C");
static_assert(sizeof(UTaskTriggerExecute_C) == 0x000230, "Wrong size on UTaskTriggerExecute_C");
static_assert(offsetof(UTaskTriggerExecute_C, AreaTriggerGroup) == 0x000200, "Member 'UTaskTriggerExecute_C::AreaTriggerGroup' has a wrong offset!");
static_assert(offsetof(UTaskTriggerExecute_C, CheckNpcTag) == 0x000210, "Member 'UTaskTriggerExecute_C::CheckNpcTag' has a wrong offset!");
static_assert(offsetof(UTaskTriggerExecute_C, bCheckPlayer) == 0x000220, "Member 'UTaskTriggerExecute_C::bCheckPlayer' has a wrong offset!");
static_assert(offsetof(UTaskTriggerExecute_C, bCheckMonster) == 0x000221, "Member 'UTaskTriggerExecute_C::bCheckMonster' has a wrong offset!");
static_assert(offsetof(UTaskTriggerExecute_C, MultiType) == 0x000222, "Member 'UTaskTriggerExecute_C::MultiType' has a wrong offset!");
static_assert(offsetof(UTaskTriggerExecute_C, bCheckFrindlySummon) == 0x000223, "Member 'UTaskTriggerExecute_C::bCheckFrindlySummon' has a wrong offset!");
static_assert(offsetof(UTaskTriggerExecute_C, FinishByCount) == 0x000224, "Member 'UTaskTriggerExecute_C::FinishByCount' has a wrong offset!");
static_assert(offsetof(UTaskTriggerExecute_C, NeedCount) == 0x000228, "Member 'UTaskTriggerExecute_C::NeedCount' has a wrong offset!");
static_assert(offsetof(UTaskTriggerExecute_C, bUseEndOverlap) == 0x00022C, "Member 'UTaskTriggerExecute_C::bUseEndOverlap' has a wrong offset!");

}

