#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_progress_component

#include "Basic.hpp"


namespace SDK::Params
{

// Function task_progress_component.task_progress_component_C.ExecuteUbergraph_task_progress_component
// 0x0038 (0x0038 - 0x0000)
struct Task_progress_component_C_ExecuteUbergraph_task_progress_component final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUw_task_target_progress_C*             K2Node_DynamicCast_AsUw_Task_Target_Progress;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATargetTrigger_C*                       K2Node_DynamicCast_AsTarget_Trigger;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Task_progress_component_C_ExecuteUbergraph_task_progress_component) == 0x000008, "Wrong alignment on Task_progress_component_C_ExecuteUbergraph_task_progress_component");
static_assert(sizeof(Task_progress_component_C_ExecuteUbergraph_task_progress_component) == 0x000038, "Wrong size on Task_progress_component_C_ExecuteUbergraph_task_progress_component");
static_assert(offsetof(Task_progress_component_C_ExecuteUbergraph_task_progress_component, EntryPoint) == 0x000000, "Member 'Task_progress_component_C_ExecuteUbergraph_task_progress_component::EntryPoint' has a wrong offset!");
static_assert(offsetof(Task_progress_component_C_ExecuteUbergraph_task_progress_component, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000008, "Member 'Task_progress_component_C_ExecuteUbergraph_task_progress_component::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_progress_component_C_ExecuteUbergraph_task_progress_component, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'Task_progress_component_C_ExecuteUbergraph_task_progress_component::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_progress_component_C_ExecuteUbergraph_task_progress_component, K2Node_DynamicCast_AsUw_Task_Target_Progress) == 0x000018, "Member 'Task_progress_component_C_ExecuteUbergraph_task_progress_component::K2Node_DynamicCast_AsUw_Task_Target_Progress' has a wrong offset!");
static_assert(offsetof(Task_progress_component_C_ExecuteUbergraph_task_progress_component, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Task_progress_component_C_ExecuteUbergraph_task_progress_component::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Task_progress_component_C_ExecuteUbergraph_task_progress_component, K2Node_DynamicCast_AsTarget_Trigger) == 0x000028, "Member 'Task_progress_component_C_ExecuteUbergraph_task_progress_component::K2Node_DynamicCast_AsTarget_Trigger' has a wrong offset!");
static_assert(offsetof(Task_progress_component_C_ExecuteUbergraph_task_progress_component, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'Task_progress_component_C_ExecuteUbergraph_task_progress_component::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

