#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeleportPlayerEvent

#include "Basic.hpp"


namespace SDK::Params
{

// Function TeleportPlayerEvent.TeleportPlayerEvent_C.OnTrigger__Overridden
// 0x0001 (0x0001 - 0x0000)
struct TeleportPlayerEvent_C_OnTrigger__Overridden final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TeleportPlayerEvent_C_OnTrigger__Overridden) == 0x000001, "Wrong alignment on TeleportPlayerEvent_C_OnTrigger__Overridden");
static_assert(sizeof(TeleportPlayerEvent_C_OnTrigger__Overridden) == 0x000001, "Wrong size on TeleportPlayerEvent_C_OnTrigger__Overridden");
static_assert(offsetof(TeleportPlayerEvent_C_OnTrigger__Overridden, ReturnValue) == 0x000000, "Member 'TeleportPlayerEvent_C_OnTrigger__Overridden::ReturnValue' has a wrong offset!");

// LuaFunction TeleportPlayerEvent.TeleportPlayerEvent_C.OnTrigger
// 0x0001 (0x0001 - 0x0000)
struct TeleportPlayerEvent_C_OnTrigger final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TeleportPlayerEvent_C_OnTrigger) == 0x000001, "Wrong alignment on TeleportPlayerEvent_C_OnTrigger");
static_assert(sizeof(TeleportPlayerEvent_C_OnTrigger) == 0x000001, "Wrong size on TeleportPlayerEvent_C_OnTrigger");
static_assert(offsetof(TeleportPlayerEvent_C_OnTrigger, ReturnValue) == 0x000000, "Member 'TeleportPlayerEvent_C_OnTrigger::ReturnValue' has a wrong offset!");

// Function TeleportPlayerEvent.TeleportPlayerEvent_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct TeleportPlayerEvent_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(TeleportPlayerEvent_C_GetModuleName) == 0x000008, "Wrong alignment on TeleportPlayerEvent_C_GetModuleName");
static_assert(sizeof(TeleportPlayerEvent_C_GetModuleName) == 0x000010, "Wrong size on TeleportPlayerEvent_C_GetModuleName");
static_assert(offsetof(TeleportPlayerEvent_C_GetModuleName, ReturnValue) == 0x000000, "Member 'TeleportPlayerEvent_C_GetModuleName::ReturnValue' has a wrong offset!");

}

