#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Test_910101

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Test_910101.Test_910101_C
// 0x0020 (0x09F0 - 0x09D0)
class ATest_910101_C final : public ABullet
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         SumYaw;                                            // 0x09D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Num;                                               // 0x09DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CalYaw;                                            // 0x09E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LoopCount;                                         // 0x09E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GetTarget();
	void GetRot(const struct FVector& Location, int32 Min, int32 Max, struct FTransform* Rot);
	void ReceiveBulletFire();
	void UseSpiralMove(const struct FVector& VelocityDirection, float MoveSpeed, float RotateTime, const struct FVector& SpiralCenter, const struct FVector& ForwardVector, float SpiralSpeed);
	void UseNaturallyMove(float Speed, float Acceleration);
	void UseNaturallyMoveWithGravity(float Speed, float GravityScale);
	void UseHomingMove(const struct FVector& VelocityDirection, float MoveSpeed, float Acceleration, float AngularSpeed, class AActor* Target, float StopHomingDelay, float VelocityDuration);
	void ExecuteUbergraph_Test_910101(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Test_910101_C">();
	}
	static class ATest_910101_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATest_910101_C>();
	}
};
static_assert(alignof(ATest_910101_C) == 0x000010, "Wrong alignment on ATest_910101_C");
static_assert(sizeof(ATest_910101_C) == 0x0009F0, "Wrong size on ATest_910101_C");
static_assert(offsetof(ATest_910101_C, UberGraphFrame) == 0x0009D0, "Member 'ATest_910101_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATest_910101_C, SumYaw) == 0x0009D8, "Member 'ATest_910101_C::SumYaw' has a wrong offset!");
static_assert(offsetof(ATest_910101_C, Num) == 0x0009DC, "Member 'ATest_910101_C::Num' has a wrong offset!");
static_assert(offsetof(ATest_910101_C, CalYaw) == 0x0009E0, "Member 'ATest_910101_C::CalYaw' has a wrong offset!");
static_assert(offsetof(ATest_910101_C, LoopCount) == 0x0009E4, "Member 'ATest_910101_C::LoopCount' has a wrong offset!");

}

