#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TGameToolsRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"
#include "TGameToolsRuntime_structs.hpp"


namespace SDK
{

// Class TGameToolsRuntime.CharacterMeshData
// 0x0010 (0x0040 - 0x0030)
class UCharacterMeshData final : public UPrimaryDataAsset
{
public:
	TArray<struct FTransform>                     MeshTransform;                                     // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CharacterMeshData">();
	}
	static class UCharacterMeshData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterMeshData>();
	}
};
static_assert(alignof(UCharacterMeshData) == 0x000008, "Wrong alignment on UCharacterMeshData");
static_assert(sizeof(UCharacterMeshData) == 0x000040, "Wrong size on UCharacterMeshData");
static_assert(offsetof(UCharacterMeshData, MeshTransform) == 0x000030, "Member 'UCharacterMeshData::MeshTransform' has a wrong offset!");

// Class TGameToolsRuntime.DarkZoneFogData
// 0x00E8 (0x0118 - 0x0030)
class UDarkZoneFogData final : public UPrimaryDataAsset
{
public:
	class FString                                 DarkZoneFogDescribe;                               // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DarkZoneFogIndex;                                  // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDarkZoneFogConfig                     DarkZoneConfigFog_Main;                            // 0x0048(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDarkZoneSnowConfig                    DarkZoneConfigSnow_Main;                           // 0x0098(0x0080)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	struct FDarkZoneFogConfig LerpDarkZoneDataFog(const struct FDarkZoneFogConfig& A, const struct FDarkZoneFogConfig& B, const float Alpha);
	struct FDarkZoneSnowConfig LerpDarkZoneDataSnow(const struct FDarkZoneSnowConfig& A, const struct FDarkZoneSnowConfig& B, const float Alpha);
	void MarkaDataAssetDirty(class UPrimaryDataAsset* DarkZoneConfig);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DarkZoneFogData">();
	}
	static class UDarkZoneFogData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDarkZoneFogData>();
	}
};
static_assert(alignof(UDarkZoneFogData) == 0x000008, "Wrong alignment on UDarkZoneFogData");
static_assert(sizeof(UDarkZoneFogData) == 0x000118, "Wrong size on UDarkZoneFogData");
static_assert(offsetof(UDarkZoneFogData, DarkZoneFogDescribe) == 0x000030, "Member 'UDarkZoneFogData::DarkZoneFogDescribe' has a wrong offset!");
static_assert(offsetof(UDarkZoneFogData, DarkZoneFogIndex) == 0x000040, "Member 'UDarkZoneFogData::DarkZoneFogIndex' has a wrong offset!");
static_assert(offsetof(UDarkZoneFogData, DarkZoneConfigFog_Main) == 0x000048, "Member 'UDarkZoneFogData::DarkZoneConfigFog_Main' has a wrong offset!");
static_assert(offsetof(UDarkZoneFogData, DarkZoneConfigSnow_Main) == 0x000098, "Member 'UDarkZoneFogData::DarkZoneConfigSnow_Main' has a wrong offset!");

// Class TGameToolsRuntime.PerfabActor
// 0x0008 (0x0230 - 0x0228)
class APerfabActor final : public AActor
{
public:
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PerfabActor">();
	}
	static class APerfabActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APerfabActor>();
	}
};
static_assert(alignof(APerfabActor) == 0x000008, "Wrong alignment on APerfabActor");
static_assert(sizeof(APerfabActor) == 0x000230, "Wrong size on APerfabActor");

// Class TGameToolsRuntime.TGameTextureRuntimeLib
// 0x0000 (0x0028 - 0x0028)
class UTGameTextureRuntimeLib final : public UBlueprintFunctionLibrary
{
public:
	static float ComputeColorPercentage(class UTextureRenderTarget2D* RTMask, class UTextureRenderTarget2D* RT, const struct FVector2D& StartPos, const struct FVector2D& EndPos, const struct FLinearColor& ThresholdColor, float Threshold);
	static float NewComputeColorPercentage(class UTextureRenderTarget2D* RTMask, class UTextureRenderTarget2D* RT, const struct FVector2D& StartPos, const struct FVector2D& EndPos, const struct FLinearColor& ThresholdColor, float Threshold);
	static void StartComputeColorPercentage();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TGameTextureRuntimeLib">();
	}
	static class UTGameTextureRuntimeLib* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTGameTextureRuntimeLib>();
	}
};
static_assert(alignof(UTGameTextureRuntimeLib) == 0x000008, "Wrong alignment on UTGameTextureRuntimeLib");
static_assert(sizeof(UTGameTextureRuntimeLib) == 0x000028, "Wrong size on UTGameTextureRuntimeLib");

}

