#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TGameToolsRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct TGameToolsRuntime.DarkZoneSnowConfig
// 0x0078 (0x0080 - 0x0008)
struct FDarkZoneSnowConfig final : public FTableRowBase
{
public:
	float                                         OpenSnow;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           SnowColor;                                         // 0x000C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FluorescentColors;                                 // 0x001C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FlashColor;                                        // 0x002C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistributionRange;                                 // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EnhancedPollution;                                 // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistributionTransition;                            // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TopRange;                                          // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TopTransition;                                     // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransitionUV;                                      // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TexUV;                                             // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlashUV;                                           // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CenterColor;                                       // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FluorescenceIntensity;                             // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DetailParticle;                                    // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlashIntensity;                                    // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EmissiveScale;                                     // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EmissiveRange;                                     // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Roughness;                                         // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Normal;                                            // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AO;                                                // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDarkZoneSnowConfig) == 0x000008, "Wrong alignment on FDarkZoneSnowConfig");
static_assert(sizeof(FDarkZoneSnowConfig) == 0x000080, "Wrong size on FDarkZoneSnowConfig");
static_assert(offsetof(FDarkZoneSnowConfig, OpenSnow) == 0x000008, "Member 'FDarkZoneSnowConfig::OpenSnow' has a wrong offset!");
static_assert(offsetof(FDarkZoneSnowConfig, SnowColor) == 0x00000C, "Member 'FDarkZoneSnowConfig::SnowColor' has a wrong offset!");
static_assert(offsetof(FDarkZoneSnowConfig, FluorescentColors) == 0x00001C, "Member 'FDarkZoneSnowConfig::FluorescentColors' has a wrong offset!");
static_assert(offsetof(FDarkZoneSnowConfig, FlashColor) == 0x00002C, "Member 'FDarkZoneSnowConfig::FlashColor' has a wrong offset!");
static_assert(offsetof(FDarkZoneSnowConfig, DistributionRange) == 0x00003C, "Member 'FDarkZoneSnowConfig::DistributionRange' has a wrong offset!");
static_assert(offsetof(FDarkZoneSnowConfig, EnhancedPollution) == 0x000040, "Member 'FDarkZoneSnowConfig::EnhancedPollution' has a wrong offset!");
static_assert(offsetof(FDarkZoneSnowConfig, DistributionTransition) == 0x000044, "Member 'FDarkZoneSnowConfig::DistributionTransition' has a wrong offset!");
static_assert(offsetof(FDarkZoneSnowConfig, TopRange) == 0x000048, "Member 'FDarkZoneSnowConfig::TopRange' has a wrong offset!");
static_assert(offsetof(FDarkZoneSnowConfig, TopTransition) == 0x00004C, "Member 'FDarkZoneSnowConfig::TopTransition' has a wrong offset!");
static_assert(offsetof(FDarkZoneSnowConfig, TransitionUV) == 0x000050, "Member 'FDarkZoneSnowConfig::TransitionUV' has a wrong offset!");
static_assert(offsetof(FDarkZoneSnowConfig, TexUV) == 0x000054, "Member 'FDarkZoneSnowConfig::TexUV' has a wrong offset!");
static_assert(offsetof(FDarkZoneSnowConfig, FlashUV) == 0x000058, "Member 'FDarkZoneSnowConfig::FlashUV' has a wrong offset!");
static_assert(offsetof(FDarkZoneSnowConfig, CenterColor) == 0x00005C, "Member 'FDarkZoneSnowConfig::CenterColor' has a wrong offset!");
static_assert(offsetof(FDarkZoneSnowConfig, FluorescenceIntensity) == 0x000060, "Member 'FDarkZoneSnowConfig::FluorescenceIntensity' has a wrong offset!");
static_assert(offsetof(FDarkZoneSnowConfig, DetailParticle) == 0x000064, "Member 'FDarkZoneSnowConfig::DetailParticle' has a wrong offset!");
static_assert(offsetof(FDarkZoneSnowConfig, FlashIntensity) == 0x000068, "Member 'FDarkZoneSnowConfig::FlashIntensity' has a wrong offset!");
static_assert(offsetof(FDarkZoneSnowConfig, EmissiveScale) == 0x00006C, "Member 'FDarkZoneSnowConfig::EmissiveScale' has a wrong offset!");
static_assert(offsetof(FDarkZoneSnowConfig, EmissiveRange) == 0x000070, "Member 'FDarkZoneSnowConfig::EmissiveRange' has a wrong offset!");
static_assert(offsetof(FDarkZoneSnowConfig, Roughness) == 0x000074, "Member 'FDarkZoneSnowConfig::Roughness' has a wrong offset!");
static_assert(offsetof(FDarkZoneSnowConfig, Normal) == 0x000078, "Member 'FDarkZoneSnowConfig::Normal' has a wrong offset!");
static_assert(offsetof(FDarkZoneSnowConfig, AO) == 0x00007C, "Member 'FDarkZoneSnowConfig::AO' has a wrong offset!");

// ScriptStruct TGameToolsRuntime.DarkZoneFogConfig
// 0x0048 (0x0050 - 0x0008)
struct FDarkZoneFogConfig final : public FTableRowBase
{
public:
	struct FLinearColor                           FogColor1st;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogDesity1st;                                      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogHeightFallOff1st;                               // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogMaxOpacity1st;                                  // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartDistance1st;                                  // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FogColor2st;                                       // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogDensity2st;                                     // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogHeightMax2st;                                   // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogHeightMin2st;                                   // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogHeightFade2st;                                  // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogHeightOffset2st;                                // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDarkZoneFogConfig) == 0x000008, "Wrong alignment on FDarkZoneFogConfig");
static_assert(sizeof(FDarkZoneFogConfig) == 0x000050, "Wrong size on FDarkZoneFogConfig");
static_assert(offsetof(FDarkZoneFogConfig, FogColor1st) == 0x000008, "Member 'FDarkZoneFogConfig::FogColor1st' has a wrong offset!");
static_assert(offsetof(FDarkZoneFogConfig, FogDesity1st) == 0x000018, "Member 'FDarkZoneFogConfig::FogDesity1st' has a wrong offset!");
static_assert(offsetof(FDarkZoneFogConfig, FogHeightFallOff1st) == 0x00001C, "Member 'FDarkZoneFogConfig::FogHeightFallOff1st' has a wrong offset!");
static_assert(offsetof(FDarkZoneFogConfig, FogMaxOpacity1st) == 0x000020, "Member 'FDarkZoneFogConfig::FogMaxOpacity1st' has a wrong offset!");
static_assert(offsetof(FDarkZoneFogConfig, StartDistance1st) == 0x000024, "Member 'FDarkZoneFogConfig::StartDistance1st' has a wrong offset!");
static_assert(offsetof(FDarkZoneFogConfig, FogColor2st) == 0x000028, "Member 'FDarkZoneFogConfig::FogColor2st' has a wrong offset!");
static_assert(offsetof(FDarkZoneFogConfig, FogDensity2st) == 0x000038, "Member 'FDarkZoneFogConfig::FogDensity2st' has a wrong offset!");
static_assert(offsetof(FDarkZoneFogConfig, FogHeightMax2st) == 0x00003C, "Member 'FDarkZoneFogConfig::FogHeightMax2st' has a wrong offset!");
static_assert(offsetof(FDarkZoneFogConfig, FogHeightMin2st) == 0x000040, "Member 'FDarkZoneFogConfig::FogHeightMin2st' has a wrong offset!");
static_assert(offsetof(FDarkZoneFogConfig, FogHeightFade2st) == 0x000044, "Member 'FDarkZoneFogConfig::FogHeightFade2st' has a wrong offset!");
static_assert(offsetof(FDarkZoneFogConfig, FogHeightOffset2st) == 0x000048, "Member 'FDarkZoneFogConfig::FogHeightOffset2st' has a wrong offset!");

}

