#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TGameToolsRuntime

#include "Basic.hpp"

#include "TGameToolsRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TGameToolsRuntime.DarkZoneFogData.LerpDarkZoneDataFog
// 0x00F8 (0x00F8 - 0x0000)
struct DarkZoneFogData_LerpDarkZoneDataFog final
{
public:
	struct FDarkZoneFogConfig                     A;                                                 // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FDarkZoneFogConfig                     B;                                                 // 0x0050(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Alpha;                                             // 0x00A0(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDarkZoneFogConfig                     ReturnValue;                                       // 0x00A8(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneFogData_LerpDarkZoneDataFog) == 0x000008, "Wrong alignment on DarkZoneFogData_LerpDarkZoneDataFog");
static_assert(sizeof(DarkZoneFogData_LerpDarkZoneDataFog) == 0x0000F8, "Wrong size on DarkZoneFogData_LerpDarkZoneDataFog");
static_assert(offsetof(DarkZoneFogData_LerpDarkZoneDataFog, A) == 0x000000, "Member 'DarkZoneFogData_LerpDarkZoneDataFog::A' has a wrong offset!");
static_assert(offsetof(DarkZoneFogData_LerpDarkZoneDataFog, B) == 0x000050, "Member 'DarkZoneFogData_LerpDarkZoneDataFog::B' has a wrong offset!");
static_assert(offsetof(DarkZoneFogData_LerpDarkZoneDataFog, Alpha) == 0x0000A0, "Member 'DarkZoneFogData_LerpDarkZoneDataFog::Alpha' has a wrong offset!");
static_assert(offsetof(DarkZoneFogData_LerpDarkZoneDataFog, ReturnValue) == 0x0000A8, "Member 'DarkZoneFogData_LerpDarkZoneDataFog::ReturnValue' has a wrong offset!");

// Function TGameToolsRuntime.DarkZoneFogData.LerpDarkZoneDataSnow
// 0x0188 (0x0188 - 0x0000)
struct DarkZoneFogData_LerpDarkZoneDataSnow final
{
public:
	struct FDarkZoneSnowConfig                    A;                                                 // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FDarkZoneSnowConfig                    B;                                                 // 0x0080(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Alpha;                                             // 0x0100(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDarkZoneSnowConfig                    ReturnValue;                                       // 0x0108(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneFogData_LerpDarkZoneDataSnow) == 0x000008, "Wrong alignment on DarkZoneFogData_LerpDarkZoneDataSnow");
static_assert(sizeof(DarkZoneFogData_LerpDarkZoneDataSnow) == 0x000188, "Wrong size on DarkZoneFogData_LerpDarkZoneDataSnow");
static_assert(offsetof(DarkZoneFogData_LerpDarkZoneDataSnow, A) == 0x000000, "Member 'DarkZoneFogData_LerpDarkZoneDataSnow::A' has a wrong offset!");
static_assert(offsetof(DarkZoneFogData_LerpDarkZoneDataSnow, B) == 0x000080, "Member 'DarkZoneFogData_LerpDarkZoneDataSnow::B' has a wrong offset!");
static_assert(offsetof(DarkZoneFogData_LerpDarkZoneDataSnow, Alpha) == 0x000100, "Member 'DarkZoneFogData_LerpDarkZoneDataSnow::Alpha' has a wrong offset!");
static_assert(offsetof(DarkZoneFogData_LerpDarkZoneDataSnow, ReturnValue) == 0x000108, "Member 'DarkZoneFogData_LerpDarkZoneDataSnow::ReturnValue' has a wrong offset!");

// Function TGameToolsRuntime.DarkZoneFogData.MarkaDataAssetDirty
// 0x0008 (0x0008 - 0x0000)
struct DarkZoneFogData_MarkaDataAssetDirty final
{
public:
	class UPrimaryDataAsset*                      DarkZoneConfig;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkZoneFogData_MarkaDataAssetDirty) == 0x000008, "Wrong alignment on DarkZoneFogData_MarkaDataAssetDirty");
static_assert(sizeof(DarkZoneFogData_MarkaDataAssetDirty) == 0x000008, "Wrong size on DarkZoneFogData_MarkaDataAssetDirty");
static_assert(offsetof(DarkZoneFogData_MarkaDataAssetDirty, DarkZoneConfig) == 0x000000, "Member 'DarkZoneFogData_MarkaDataAssetDirty::DarkZoneConfig' has a wrong offset!");

// Function TGameToolsRuntime.TGameTextureRuntimeLib.ComputeColorPercentage
// 0x0038 (0x0038 - 0x0000)
struct TGameTextureRuntimeLib_ComputeColorPercentage final
{
public:
	class UTextureRenderTarget2D*                 RTMask;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 RT;                                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              StartPos;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              EndPos;                                            // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ThresholdColor;                                    // 0x0020(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Threshold;                                         // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0034(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TGameTextureRuntimeLib_ComputeColorPercentage) == 0x000008, "Wrong alignment on TGameTextureRuntimeLib_ComputeColorPercentage");
static_assert(sizeof(TGameTextureRuntimeLib_ComputeColorPercentage) == 0x000038, "Wrong size on TGameTextureRuntimeLib_ComputeColorPercentage");
static_assert(offsetof(TGameTextureRuntimeLib_ComputeColorPercentage, RTMask) == 0x000000, "Member 'TGameTextureRuntimeLib_ComputeColorPercentage::RTMask' has a wrong offset!");
static_assert(offsetof(TGameTextureRuntimeLib_ComputeColorPercentage, RT) == 0x000008, "Member 'TGameTextureRuntimeLib_ComputeColorPercentage::RT' has a wrong offset!");
static_assert(offsetof(TGameTextureRuntimeLib_ComputeColorPercentage, StartPos) == 0x000010, "Member 'TGameTextureRuntimeLib_ComputeColorPercentage::StartPos' has a wrong offset!");
static_assert(offsetof(TGameTextureRuntimeLib_ComputeColorPercentage, EndPos) == 0x000018, "Member 'TGameTextureRuntimeLib_ComputeColorPercentage::EndPos' has a wrong offset!");
static_assert(offsetof(TGameTextureRuntimeLib_ComputeColorPercentage, ThresholdColor) == 0x000020, "Member 'TGameTextureRuntimeLib_ComputeColorPercentage::ThresholdColor' has a wrong offset!");
static_assert(offsetof(TGameTextureRuntimeLib_ComputeColorPercentage, Threshold) == 0x000030, "Member 'TGameTextureRuntimeLib_ComputeColorPercentage::Threshold' has a wrong offset!");
static_assert(offsetof(TGameTextureRuntimeLib_ComputeColorPercentage, ReturnValue) == 0x000034, "Member 'TGameTextureRuntimeLib_ComputeColorPercentage::ReturnValue' has a wrong offset!");

// Function TGameToolsRuntime.TGameTextureRuntimeLib.NewComputeColorPercentage
// 0x0038 (0x0038 - 0x0000)
struct TGameTextureRuntimeLib_NewComputeColorPercentage final
{
public:
	class UTextureRenderTarget2D*                 RTMask;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 RT;                                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              StartPos;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              EndPos;                                            // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ThresholdColor;                                    // 0x0020(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Threshold;                                         // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0034(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TGameTextureRuntimeLib_NewComputeColorPercentage) == 0x000008, "Wrong alignment on TGameTextureRuntimeLib_NewComputeColorPercentage");
static_assert(sizeof(TGameTextureRuntimeLib_NewComputeColorPercentage) == 0x000038, "Wrong size on TGameTextureRuntimeLib_NewComputeColorPercentage");
static_assert(offsetof(TGameTextureRuntimeLib_NewComputeColorPercentage, RTMask) == 0x000000, "Member 'TGameTextureRuntimeLib_NewComputeColorPercentage::RTMask' has a wrong offset!");
static_assert(offsetof(TGameTextureRuntimeLib_NewComputeColorPercentage, RT) == 0x000008, "Member 'TGameTextureRuntimeLib_NewComputeColorPercentage::RT' has a wrong offset!");
static_assert(offsetof(TGameTextureRuntimeLib_NewComputeColorPercentage, StartPos) == 0x000010, "Member 'TGameTextureRuntimeLib_NewComputeColorPercentage::StartPos' has a wrong offset!");
static_assert(offsetof(TGameTextureRuntimeLib_NewComputeColorPercentage, EndPos) == 0x000018, "Member 'TGameTextureRuntimeLib_NewComputeColorPercentage::EndPos' has a wrong offset!");
static_assert(offsetof(TGameTextureRuntimeLib_NewComputeColorPercentage, ThresholdColor) == 0x000020, "Member 'TGameTextureRuntimeLib_NewComputeColorPercentage::ThresholdColor' has a wrong offset!");
static_assert(offsetof(TGameTextureRuntimeLib_NewComputeColorPercentage, Threshold) == 0x000030, "Member 'TGameTextureRuntimeLib_NewComputeColorPercentage::Threshold' has a wrong offset!");
static_assert(offsetof(TGameTextureRuntimeLib_NewComputeColorPercentage, ReturnValue) == 0x000034, "Member 'TGameTextureRuntimeLib_NewComputeColorPercentage::ReturnValue' has a wrong offset!");

}

