#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TimerExecute

#include "Basic.hpp"


namespace SDK::Params
{

// LuaFunction TimerExecute.TimerExecute_C.GetDescription
// 0x0010 (0x0010 - 0x0000)
struct TimerExecute_C_GetDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TimerExecute_C_GetDescription;

// Function TimerExecute.TimerExecute_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct TimerExecute_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TimerExecute_C_GetModuleName;

// Function TimerExecute.TimerExecute_C.GetSpecialStaticDescription
// 0x0030 (0x0030 - 0x0000)
struct TimerExecute_C_GetSpecialStaticDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TimerExecute_C_GetSpecialStaticDescription;

}

