#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TimerExecute

#include "Basic.hpp"


namespace SDK::Params
{

// LuaFunction TimerExecute.TimerExecute_C.GetDescription
// 0x0010 (0x0010 - 0x0000)
struct TimerExecute_C_GetDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TimerExecute_C_GetDescription) == 0x000008, "Wrong alignment on TimerExecute_C_GetDescription");
static_assert(sizeof(TimerExecute_C_GetDescription) == 0x000010, "Wrong size on TimerExecute_C_GetDescription");
static_assert(offsetof(TimerExecute_C_GetDescription, ReturnValue) == 0x000000, "Member 'TimerExecute_C_GetDescription::ReturnValue' has a wrong offset!");

// Function TimerExecute.TimerExecute_C.GetSpecialStaticDescription
// 0x0030 (0x0030 - 0x0000)
struct TimerExecute_C_GetSpecialStaticDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(TimerExecute_C_GetSpecialStaticDescription) == 0x000008, "Wrong alignment on TimerExecute_C_GetSpecialStaticDescription");
static_assert(sizeof(TimerExecute_C_GetSpecialStaticDescription) == 0x000030, "Wrong size on TimerExecute_C_GetSpecialStaticDescription");
static_assert(offsetof(TimerExecute_C_GetSpecialStaticDescription, ReturnValue) == 0x000000, "Member 'TimerExecute_C_GetSpecialStaticDescription::ReturnValue' has a wrong offset!");
static_assert(offsetof(TimerExecute_C_GetSpecialStaticDescription, CallFunc_Conv_FloatToString_ReturnValue) == 0x000010, "Member 'TimerExecute_C_GetSpecialStaticDescription::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(TimerExecute_C_GetSpecialStaticDescription, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'TimerExecute_C_GetSpecialStaticDescription::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function TimerExecute.TimerExecute_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct TimerExecute_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(TimerExecute_C_GetModuleName) == 0x000008, "Wrong alignment on TimerExecute_C_GetModuleName");
static_assert(sizeof(TimerExecute_C_GetModuleName) == 0x000010, "Wrong size on TimerExecute_C_GetModuleName");
static_assert(offsetof(TimerExecute_C_GetModuleName, ReturnValue) == 0x000000, "Member 'TimerExecute_C_GetModuleName::ReturnValue' has a wrong offset!");

}

