#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tools_fun

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CollisionType_Enum_structs.hpp"


namespace SDK::Params
{

// Function Tools_fun.Tools_fun_C.RotationDistanceSpline
// 0x0128 (0x0128 - 0x0000)
struct Tools_fun_C_RotationDistanceSpline final
{
public:
	bool                                          FlipMesh;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          RottationWithSpline;                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ScaleWithSpline;                                   // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   SplineMeshComponent;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       Spline;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PointIndex;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Distance;                                          // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue; // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue_1; // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue; // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue_1; // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue_2; // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue_2; // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue_3; // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue_3; // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x011C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tools_fun_C_RotationDistanceSpline) == 0x000008, "Wrong alignment on Tools_fun_C_RotationDistanceSpline");
static_assert(sizeof(Tools_fun_C_RotationDistanceSpline) == 0x000128, "Wrong size on Tools_fun_C_RotationDistanceSpline");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, FlipMesh) == 0x000000, "Member 'Tools_fun_C_RotationDistanceSpline::FlipMesh' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, RottationWithSpline) == 0x000001, "Member 'Tools_fun_C_RotationDistanceSpline::RottationWithSpline' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, ScaleWithSpline) == 0x000002, "Member 'Tools_fun_C_RotationDistanceSpline::ScaleWithSpline' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, SplineMeshComponent) == 0x000008, "Member 'Tools_fun_C_RotationDistanceSpline::SplineMeshComponent' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, Spline) == 0x000010, "Member 'Tools_fun_C_RotationDistanceSpline::Spline' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, PointIndex) == 0x000018, "Member 'Tools_fun_C_RotationDistanceSpline::PointIndex' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, Distance) == 0x00001C, "Member 'Tools_fun_C_RotationDistanceSpline::Distance' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, __WorldContext) == 0x000020, "Member 'Tools_fun_C_RotationDistanceSpline::__WorldContext' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000028, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue) == 0x000030, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x00003C, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_BreakVector_X) == 0x000040, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_BreakVector_Y) == 0x000044, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_BreakVector_Z) == 0x000048, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue_1) == 0x00004C, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_MakeVector2D_ReturnValue) == 0x000058, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_BreakVector_X_1) == 0x000060, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_BreakVector_Y_1) == 0x000064, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_BreakVector_Z_1) == 0x000068, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_MakeVector2D_ReturnValue_1) == 0x00006C, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue) == 0x000074, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_BreakRotator_Roll) == 0x000080, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_BreakRotator_Pitch) == 0x000084, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_BreakRotator_Yaw) == 0x000088, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue_1) == 0x00008C, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000098, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_BreakRotator_Roll_1) == 0x00009C, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_BreakRotator_Pitch_1) == 0x0000A0, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_BreakRotator_Yaw_1) == 0x0000A4, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0000A8, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue_2) == 0x0000AC, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_BreakVector_X_2) == 0x0000B8, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_BreakVector_Y_2) == 0x0000BC, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_BreakVector_Z_2) == 0x0000C0, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue_2) == 0x0000C4, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_MakeVector2D_ReturnValue_2) == 0x0000D0, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_BreakRotator_Roll_2) == 0x0000D8, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_BreakRotator_Pitch_2) == 0x0000DC, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_BreakRotator_Yaw_2) == 0x0000E0, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x0000E4, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue_3) == 0x0000E8, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_BreakRotator_Roll_3) == 0x0000F4, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_BreakRotator_Roll_3' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_BreakRotator_Pitch_3) == 0x0000F8, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_BreakRotator_Pitch_3' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_BreakRotator_Yaw_3) == 0x0000FC, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_BreakRotator_Yaw_3' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue_3) == 0x000100, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x00010C, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_BreakVector_X_3) == 0x000110, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_BreakVector_Y_3) == 0x000114, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_BreakVector_Z_3) == 0x000118, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationDistanceSpline, CallFunc_MakeVector2D_ReturnValue_3) == 0x00011C, "Member 'Tools_fun_C_RotationDistanceSpline::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");

// Function Tools_fun.Tools_fun_C.RotationWithSplinePoint
// 0x0120 (0x0120 - 0x0000)
struct Tools_fun_C_RotationWithSplinePoint final
{
public:
	bool                                          FlipMesh;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          RottationWithSpline;                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ScaleWithSpline;                                   // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   SplineMeshComponent;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       Spline;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PointIndex;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaleAtSplinePoint_ReturnValue;        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetRotationAtSplinePoint_ReturnValue;     // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaleAtSplinePoint_ReturnValue_1;      // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaleAtSplinePoint_ReturnValue_2;      // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetRotationAtSplinePoint_ReturnValue_1;   // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaleAtSplinePoint_ReturnValue_3;      // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetRotationAtSplinePoint_ReturnValue_2;   // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetRotationAtSplinePoint_ReturnValue_3;   // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tools_fun_C_RotationWithSplinePoint) == 0x000008, "Wrong alignment on Tools_fun_C_RotationWithSplinePoint");
static_assert(sizeof(Tools_fun_C_RotationWithSplinePoint) == 0x000120, "Wrong size on Tools_fun_C_RotationWithSplinePoint");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, FlipMesh) == 0x000000, "Member 'Tools_fun_C_RotationWithSplinePoint::FlipMesh' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, RottationWithSpline) == 0x000001, "Member 'Tools_fun_C_RotationWithSplinePoint::RottationWithSpline' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, ScaleWithSpline) == 0x000002, "Member 'Tools_fun_C_RotationWithSplinePoint::ScaleWithSpline' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, SplineMeshComponent) == 0x000008, "Member 'Tools_fun_C_RotationWithSplinePoint::SplineMeshComponent' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, Spline) == 0x000010, "Member 'Tools_fun_C_RotationWithSplinePoint::Spline' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, PointIndex) == 0x000018, "Member 'Tools_fun_C_RotationWithSplinePoint::PointIndex' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, __WorldContext) == 0x000020, "Member 'Tools_fun_C_RotationWithSplinePoint::__WorldContext' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_GetScaleAtSplinePoint_ReturnValue) == 0x000028, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_GetScaleAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_GetRotationAtSplinePoint_ReturnValue) == 0x000034, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_GetRotationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_BreakVector_X) == 0x000040, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_BreakVector_Y) == 0x000044, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_BreakVector_Z) == 0x000048, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_BreakRotator_Roll) == 0x00004C, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_BreakRotator_Pitch) == 0x000050, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_BreakRotator_Yaw) == 0x000054, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_MakeVector2D_ReturnValue) == 0x000058, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000060, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_GetScaleAtSplinePoint_ReturnValue_1) == 0x000068, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_GetScaleAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_GetScaleAtSplinePoint_ReturnValue_2) == 0x000074, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_GetScaleAtSplinePoint_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_BreakVector_X_1) == 0x000080, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_BreakVector_Y_1) == 0x000084, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_BreakVector_Z_1) == 0x000088, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_BreakVector_X_2) == 0x00008C, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_BreakVector_Y_2) == 0x000090, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_BreakVector_Z_2) == 0x000094, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_MakeVector2D_ReturnValue_1) == 0x000098, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_MakeVector2D_ReturnValue_2) == 0x0000A0, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_GetRotationAtSplinePoint_ReturnValue_1) == 0x0000A8, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_GetRotationAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000B4, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_BreakRotator_Roll_1) == 0x0000B8, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_BreakRotator_Pitch_1) == 0x0000BC, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_BreakRotator_Yaw_1) == 0x0000C0, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_GetScaleAtSplinePoint_ReturnValue_3) == 0x0000C4, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_GetScaleAtSplinePoint_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0000D0, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_BreakVector_X_3) == 0x0000D4, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_BreakVector_Y_3) == 0x0000D8, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_BreakVector_Z_3) == 0x0000DC, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_MakeVector2D_ReturnValue_3) == 0x0000E0, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_GetRotationAtSplinePoint_ReturnValue_2) == 0x0000E8, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_GetRotationAtSplinePoint_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_BreakRotator_Roll_2) == 0x0000F4, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_BreakRotator_Pitch_2) == 0x0000F8, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_BreakRotator_Yaw_2) == 0x0000FC, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_GetRotationAtSplinePoint_ReturnValue_3) == 0x000100, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_GetRotationAtSplinePoint_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x00010C, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_BreakRotator_Roll_3) == 0x000110, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_BreakRotator_Roll_3' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_BreakRotator_Pitch_3) == 0x000114, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_BreakRotator_Pitch_3' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_BreakRotator_Yaw_3) == 0x000118, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_BreakRotator_Yaw_3' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_RotationWithSplinePoint, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x00011C, "Member 'Tools_fun_C_RotationWithSplinePoint::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");

// Function Tools_fun.Tools_fun_C.Initialize the fog
// 0x0040 (0x0040 - 0x0000)
struct Tools_fun_C_Initialize_the_fog final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APostFog_bp_C*>                  CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APostFog_bp_C*                          CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOverlappingActor_ReturnValue;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tools_fun_C_Initialize_the_fog) == 0x000008, "Wrong alignment on Tools_fun_C_Initialize_the_fog");
static_assert(sizeof(Tools_fun_C_Initialize_the_fog) == 0x000040, "Wrong size on Tools_fun_C_Initialize_the_fog");
static_assert(offsetof(Tools_fun_C_Initialize_the_fog, __WorldContext) == 0x000000, "Member 'Tools_fun_C_Initialize_the_fog::__WorldContext' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_Initialize_the_fog, CallFunc_GetAllActorsOfClass_OutActors) == 0x000008, "Member 'Tools_fun_C_Initialize_the_fog::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_Initialize_the_fog, CallFunc_GetPlayerPawn_ReturnValue) == 0x000018, "Member 'Tools_fun_C_Initialize_the_fog::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_Initialize_the_fog, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'Tools_fun_C_Initialize_the_fog::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_Initialize_the_fog, ___int_Array_Index_Variable) == 0x000024, "Member 'Tools_fun_C_Initialize_the_fog::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_Initialize_the_fog, ___int_Loop_Counter_Variable) == 0x000028, "Member 'Tools_fun_C_Initialize_the_fog::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_Initialize_the_fog, CallFunc_Array_Get_Item) == 0x000030, "Member 'Tools_fun_C_Initialize_the_fog::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_Initialize_the_fog, CallFunc_IsOverlappingActor_ReturnValue) == 0x000038, "Member 'Tools_fun_C_Initialize_the_fog::CallFunc_IsOverlappingActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_Initialize_the_fog, CallFunc_Less_IntInt_ReturnValue) == 0x000039, "Member 'Tools_fun_C_Initialize_the_fog::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_Initialize_the_fog, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'Tools_fun_C_Initialize_the_fog::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function Tools_fun.Tools_fun_C.InShadow
// 0x0028 (0x0028 - 0x0000)
struct Tools_fun_C_InShadow final
{
public:
	class UPrimitiveComponent*                    __;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UMaterialInterface*                     __P_;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Shadow;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tools_fun_C_InShadow) == 0x000008, "Wrong alignment on Tools_fun_C_InShadow");
static_assert(sizeof(Tools_fun_C_InShadow) == 0x000028, "Wrong size on Tools_fun_C_InShadow");
static_assert(offsetof(Tools_fun_C_InShadow, __) == 0x000000, "Member 'Tools_fun_C_InShadow::__' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_InShadow, __P_) == 0x000008, "Member 'Tools_fun_C_InShadow::__P_' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_InShadow, Shadow) == 0x000010, "Member 'Tools_fun_C_InShadow::Shadow' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_InShadow, __WorldContext) == 0x000018, "Member 'Tools_fun_C_InShadow::__WorldContext' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_InShadow, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'Tools_fun_C_InShadow::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function Tools_fun.Tools_fun_C.CollisionType
// 0x0020 (0x0020 - 0x0000)
struct Tools_fun_C_CollisionType final
{
public:
	ECollisionType_Enum                           CollisionType_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TypeName;                                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Tools_fun_C_CollisionType) == 0x000008, "Wrong alignment on Tools_fun_C_CollisionType");
static_assert(sizeof(Tools_fun_C_CollisionType) == 0x000020, "Wrong size on Tools_fun_C_CollisionType");
static_assert(offsetof(Tools_fun_C_CollisionType, CollisionType_0) == 0x000000, "Member 'Tools_fun_C_CollisionType::CollisionType_0' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_CollisionType, __WorldContext) == 0x000008, "Member 'Tools_fun_C_CollisionType::__WorldContext' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_CollisionType, TypeName) == 0x000010, "Member 'Tools_fun_C_CollisionType::TypeName' has a wrong offset!");
static_assert(offsetof(Tools_fun_C_CollisionType, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'Tools_fun_C_CollisionType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

