#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TPS_Survivors

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "ChessMap_classes.hpp"


namespace SDK
{

// Class TPS_Survivors.TPS_SurvivorsGameMode
// 0x0100 (0x0408 - 0x0308)
class ATPS_SurvivorsGameMode final : public AGameMode
{
public:
	class AChessMapActor*                         ChessMapActor;                                     // 0x0308(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_310[0xB8];                                     // 0x0310(0x00B8)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivorsPlayerController*             PlayerController;                                  // 0x03C8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ASurvivorsCameraFollow*                 CameraFollow;                                      // 0x03D0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ASurvivorsMapGridGenerator*             MapGridGenerator;                                  // 0x03D8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E0[0x28];                                     // 0x03E0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void LuaStartPlay();
	void StartGame(const class FString& InDlcId, int32 InMapId, int32 InRegionId, const class FString& InDataPath);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TPS_SurvivorsGameMode">();
	}
	static class ATPS_SurvivorsGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATPS_SurvivorsGameMode>();
	}
};
static_assert(alignof(ATPS_SurvivorsGameMode) == 0x000008, "Wrong alignment on ATPS_SurvivorsGameMode");
static_assert(sizeof(ATPS_SurvivorsGameMode) == 0x000408, "Wrong size on ATPS_SurvivorsGameMode");
static_assert(offsetof(ATPS_SurvivorsGameMode, ChessMapActor) == 0x000308, "Member 'ATPS_SurvivorsGameMode::ChessMapActor' has a wrong offset!");
static_assert(offsetof(ATPS_SurvivorsGameMode, PlayerController) == 0x0003C8, "Member 'ATPS_SurvivorsGameMode::PlayerController' has a wrong offset!");
static_assert(offsetof(ATPS_SurvivorsGameMode, CameraFollow) == 0x0003D0, "Member 'ATPS_SurvivorsGameMode::CameraFollow' has a wrong offset!");
static_assert(offsetof(ATPS_SurvivorsGameMode, MapGridGenerator) == 0x0003D8, "Member 'ATPS_SurvivorsGameMode::MapGridGenerator' has a wrong offset!");

// Class TPS_Survivors.SurvivorsCameraFollow
// 0x0020 (0x0240 - 0x0220)
class ASurvivorsCameraFollow final : public AActor
{
public:
	class AActor*                                 Target;                                            // 0x0220(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASurvivorsPlayer*                       SurvivorsPlayer;                                   // 0x0228(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_230[0x10];                                     // 0x0230(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ResetCamera();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SurvivorsCameraFollow">();
	}
	static class ASurvivorsCameraFollow* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASurvivorsCameraFollow>();
	}
};
static_assert(alignof(ASurvivorsCameraFollow) == 0x000008, "Wrong alignment on ASurvivorsCameraFollow");
static_assert(sizeof(ASurvivorsCameraFollow) == 0x000240, "Wrong size on ASurvivorsCameraFollow");
static_assert(offsetof(ASurvivorsCameraFollow, Target) == 0x000220, "Member 'ASurvivorsCameraFollow::Target' has a wrong offset!");
static_assert(offsetof(ASurvivorsCameraFollow, SurvivorsPlayer) == 0x000228, "Member 'ASurvivorsCameraFollow::SurvivorsPlayer' has a wrong offset!");

// Class TPS_Survivors.SurvivorsCameraManager
// 0x0000 (0x2810 - 0x2810)
class ASurvivorsCameraManager final : public APlayerCameraManager
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SurvivorsCameraManager">();
	}
	static class ASurvivorsCameraManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASurvivorsCameraManager>();
	}
};
static_assert(alignof(ASurvivorsCameraManager) == 0x000010, "Wrong alignment on ASurvivorsCameraManager");
static_assert(sizeof(ASurvivorsCameraManager) == 0x002810, "Wrong size on ASurvivorsCameraManager");

// Class TPS_Survivors.SurvivorsCharacter
// 0x0000 (0x04F0 - 0x04F0)
class ASurvivorsCharacter : public AChessFlowNpcBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SurvivorsCharacter">();
	}
	static class ASurvivorsCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASurvivorsCharacter>();
	}
};
static_assert(alignof(ASurvivorsCharacter) == 0x000010, "Wrong alignment on ASurvivorsCharacter");
static_assert(sizeof(ASurvivorsCharacter) == 0x0004F0, "Wrong size on ASurvivorsCharacter");

// Class TPS_Survivors.SurvivorsMapGridGenerator
// 0x0020 (0x0240 - 0x0220)
class ASurvivorsMapGridGenerator final : public AActor
{
public:
	int32                                         Width;                                             // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Length;                                            // 0x0224(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GridSize;                                          // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Blocks;                                            // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	void Refresh();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SurvivorsMapGridGenerator">();
	}
	static class ASurvivorsMapGridGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASurvivorsMapGridGenerator>();
	}
};
static_assert(alignof(ASurvivorsMapGridGenerator) == 0x000008, "Wrong alignment on ASurvivorsMapGridGenerator");
static_assert(sizeof(ASurvivorsMapGridGenerator) == 0x000240, "Wrong size on ASurvivorsMapGridGenerator");
static_assert(offsetof(ASurvivorsMapGridGenerator, Width) == 0x000220, "Member 'ASurvivorsMapGridGenerator::Width' has a wrong offset!");
static_assert(offsetof(ASurvivorsMapGridGenerator, Length) == 0x000224, "Member 'ASurvivorsMapGridGenerator::Length' has a wrong offset!");
static_assert(offsetof(ASurvivorsMapGridGenerator, GridSize) == 0x000228, "Member 'ASurvivorsMapGridGenerator::GridSize' has a wrong offset!");
static_assert(offsetof(ASurvivorsMapGridGenerator, Blocks) == 0x000230, "Member 'ASurvivorsMapGridGenerator::Blocks' has a wrong offset!");

// Class TPS_Survivors.SurvivorsMonster
// 0x0000 (0x04F0 - 0x04F0)
class ASurvivorsMonster final : public ASurvivorsCharacter
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SurvivorsMonster">();
	}
	static class ASurvivorsMonster* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASurvivorsMonster>();
	}
};
static_assert(alignof(ASurvivorsMonster) == 0x000010, "Wrong alignment on ASurvivorsMonster");
static_assert(sizeof(ASurvivorsMonster) == 0x0004F0, "Wrong size on ASurvivorsMonster");

// Class TPS_Survivors.SurvivorsPlayer
// 0x0020 (0x0510 - 0x04F0)
class ASurvivorsPlayer final : public ASurvivorsCharacter
{
public:
	class ASurvivorsPlayerController*             PlayerController;                                  // 0x04F0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AChessBullet*>                   Bullets;                                           // 0x04F8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_508[0x8];                                      // 0x0508(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DebugFire();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SurvivorsPlayer">();
	}
	static class ASurvivorsPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASurvivorsPlayer>();
	}
};
static_assert(alignof(ASurvivorsPlayer) == 0x000010, "Wrong alignment on ASurvivorsPlayer");
static_assert(sizeof(ASurvivorsPlayer) == 0x000510, "Wrong size on ASurvivorsPlayer");
static_assert(offsetof(ASurvivorsPlayer, PlayerController) == 0x0004F0, "Member 'ASurvivorsPlayer::PlayerController' has a wrong offset!");
static_assert(offsetof(ASurvivorsPlayer, Bullets) == 0x0004F8, "Member 'ASurvivorsPlayer::Bullets' has a wrong offset!");

// Class TPS_Survivors.SurvivorsPlayerController
// 0x0010 (0x0580 - 0x0570)
class ASurvivorsPlayerController final : public APlayerController
{
public:
	class ASurvivorsPlayer*                       CurrentChar;                                       // 0x0570(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATPS_SurvivorsGameMode*                 GameMode;                                          // 0x0578(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void MoveForward(float Value);
	void MoveRight(float Value);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SurvivorsPlayerController">();
	}
	static class ASurvivorsPlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASurvivorsPlayerController>();
	}
};
static_assert(alignof(ASurvivorsPlayerController) == 0x000008, "Wrong alignment on ASurvivorsPlayerController");
static_assert(sizeof(ASurvivorsPlayerController) == 0x000580, "Wrong size on ASurvivorsPlayerController");
static_assert(offsetof(ASurvivorsPlayerController, CurrentChar) == 0x000570, "Member 'ASurvivorsPlayerController::CurrentChar' has a wrong offset!");
static_assert(offsetof(ASurvivorsPlayerController, GameMode) == 0x000578, "Member 'ASurvivorsPlayerController::GameMode' has a wrong offset!");

// Class TPS_Survivors.TPS_SurvivorsSystem
// 0x0010 (0x0040 - 0x0030)
class UTPS_SurvivorsSystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TPS_SurvivorsSystem">();
	}
	static class UTPS_SurvivorsSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTPS_SurvivorsSystem>();
	}
};
static_assert(alignof(UTPS_SurvivorsSystem) == 0x000008, "Wrong alignment on UTPS_SurvivorsSystem");
static_assert(sizeof(UTPS_SurvivorsSystem) == 0x000040, "Wrong size on UTPS_SurvivorsSystem");

}

