#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_girl023_Skill03

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trap_girl023_Skill03.Trap_girl023_skill03_C
// 0x0020 (0x17D0 - 0x17B0)
class ATrap_girl023_skill03_C final : public ATrap
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x17B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraSystem*                         FloorFX;                                           // 0x17B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         FireFX;                                            // 0x17C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FX_Scale;                                          // 0x17C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinPercentage;                                     // 0x17CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Trap_girl023_skill03(int32 EntryPoint);
	void Client_OnActive();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Trap_girl023_skill03_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Trap_girl023_skill03_C")
	}
	static class ATrap_girl023_skill03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_girl023_skill03_C>();
	}
};
DUMPER7_ASSERTS_ATrap_girl023_skill03_C;

}

