#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Girl014b_Skill04_01

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function Trap_Girl014b_Skill04_01.Trap_Girl014b_Skill04_01_C.OwnerDead
// 0x01C0 (0x01C0 - 0x0000)
struct Trap_Girl014b_Skill04_01_C_OwnerDead final
{
public:
	bool                                          bDead;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  InLauncher;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     HealthChangeData;                                  // 0x0010(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(Trap_Girl014b_Skill04_01_C_OwnerDead) == 0x000008, "Wrong alignment on Trap_Girl014b_Skill04_01_C_OwnerDead");
static_assert(sizeof(Trap_Girl014b_Skill04_01_C_OwnerDead) == 0x0001C0, "Wrong size on Trap_Girl014b_Skill04_01_C_OwnerDead");
static_assert(offsetof(Trap_Girl014b_Skill04_01_C_OwnerDead, bDead) == 0x000000, "Member 'Trap_Girl014b_Skill04_01_C_OwnerDead::bDead' has a wrong offset!");
static_assert(offsetof(Trap_Girl014b_Skill04_01_C_OwnerDead, InLauncher) == 0x000008, "Member 'Trap_Girl014b_Skill04_01_C_OwnerDead::InLauncher' has a wrong offset!");
static_assert(offsetof(Trap_Girl014b_Skill04_01_C_OwnerDead, HealthChangeData) == 0x000010, "Member 'Trap_Girl014b_Skill04_01_C_OwnerDead::HealthChangeData' has a wrong offset!");

// Function Trap_Girl014b_Skill04_01.Trap_Girl014b_Skill04_01_C.BP_OnTrapLeave
// 0x0001 (0x0001 - 0x0000)
struct Trap_Girl014b_Skill04_01_C_BP_OnTrapLeave final
{
public:
	bool                                          bDead;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Girl014b_Skill04_01_C_BP_OnTrapLeave) == 0x000001, "Wrong alignment on Trap_Girl014b_Skill04_01_C_BP_OnTrapLeave");
static_assert(sizeof(Trap_Girl014b_Skill04_01_C_BP_OnTrapLeave) == 0x000001, "Wrong size on Trap_Girl014b_Skill04_01_C_BP_OnTrapLeave");
static_assert(offsetof(Trap_Girl014b_Skill04_01_C_BP_OnTrapLeave, bDead) == 0x000000, "Member 'Trap_Girl014b_Skill04_01_C_BP_OnTrapLeave::bDead' has a wrong offset!");

// Function Trap_Girl014b_Skill04_01.Trap_Girl014b_Skill04_01_C.ExecuteUbergraph_Trap_Girl014b_Skill04_01
// 0x0548 (0x0548 - 0x0000)
struct Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseComponent*                        CallFunc_PostEventAttachedActor_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable;                                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bDead, class UAbilityComponentBase* InLauncher, struct FHealthChangeValue& HealthChangeData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetSkillLevel_SkillLevel;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSkillLevel_FixLevel;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bDead;                          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  K2Node_CustomEvent_InLauncher;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_CustomEvent_HealthChangeData;               // 0x0040(0x01B0)(ConstParm, ContainsInstancedReference)
	class UNiagaraComponent*                      CallFunc_SpawnNiagaraAttachedPath_ReturnValue;     // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnNiagaraAttachedPath_ReturnValue_1;   // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDead;                                // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseComponent*                        CallFunc_PostEventAttachedActor_ReturnValue_1;     // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseComponent*                        CallFunc_PostEventAttachedActor_ReturnValue_2;     // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharacterSkinTemplate                 CallFunc_GetPiFuSkinTemplate_ReturnValue;          // 0x0228(0x0310)(ConstParm)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseComponent*                        CallFunc_PostEventAttachedActor_ReturnValue_3;     // 0x0540(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01) == 0x000008, "Wrong alignment on Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01");
static_assert(sizeof(Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01) == 0x000548, "Wrong size on Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01");
static_assert(offsetof(Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01, EntryPoint) == 0x000000, "Member 'Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01, CallFunc_PostEventAttachedActor_ReturnValue) == 0x000008, "Member 'Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01::CallFunc_PostEventAttachedActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01, ___int_Variable) == 0x000010, "Member 'Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01::___int_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01, CallFunc_GetSkillLevel_SkillLevel) == 0x000024, "Member 'Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01::CallFunc_GetSkillLevel_SkillLevel' has a wrong offset!");
static_assert(offsetof(Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01, CallFunc_GetSkillLevel_FixLevel) == 0x000028, "Member 'Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01::CallFunc_GetSkillLevel_FixLevel' has a wrong offset!");
static_assert(offsetof(Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01, K2Node_CustomEvent_bDead) == 0x000031, "Member 'Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01::K2Node_CustomEvent_bDead' has a wrong offset!");
static_assert(offsetof(Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01, K2Node_CustomEvent_InLauncher) == 0x000038, "Member 'Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01::K2Node_CustomEvent_InLauncher' has a wrong offset!");
static_assert(offsetof(Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01, K2Node_CustomEvent_HealthChangeData) == 0x000040, "Member 'Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01::K2Node_CustomEvent_HealthChangeData' has a wrong offset!");
static_assert(offsetof(Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01, CallFunc_SpawnNiagaraAttachedPath_ReturnValue) == 0x0001F0, "Member 'Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01::CallFunc_SpawnNiagaraAttachedPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01, CallFunc_SpawnNiagaraAttachedPath_ReturnValue_1) == 0x0001F8, "Member 'Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01::CallFunc_SpawnNiagaraAttachedPath_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01, K2Node_Event_bDead) == 0x000200, "Member 'Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01::K2Node_Event_bDead' has a wrong offset!");
static_assert(offsetof(Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01, CallFunc_PostEventAttachedActor_ReturnValue_1) == 0x000208, "Member 'Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01::CallFunc_PostEventAttachedActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01, CallFunc_IsValid_ReturnValue) == 0x000210, "Member 'Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01, CallFunc_PostEventAttachedActor_ReturnValue_2) == 0x000218, "Member 'Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01::CallFunc_PostEventAttachedActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01, CallFunc_IsValid_ReturnValue_1) == 0x000220, "Member 'Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01, CallFunc_GetPiFuSkinTemplate_ReturnValue) == 0x000228, "Member 'Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01::CallFunc_GetPiFuSkinTemplate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01, K2Node_SwitchInteger_CmpSuccess) == 0x000538, "Member 'Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01, CallFunc_PostEventAttachedActor_ReturnValue_3) == 0x000540, "Member 'Trap_Girl014b_Skill04_01_C_ExecuteUbergraph_Trap_Girl014b_Skill04_01::CallFunc_PostEventAttachedActor_ReturnValue_3' has a wrong offset!");

}

