#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Mon_005_Skill01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trap_Mon_005_Skill01.Trap_Mon_005_Skill01_C
// 0x00A0 (0x1790 - 0x16F0)
class ATrap_Mon_005_Skill01_C final : public ATrap
{
public:
	uint8                                         Pad_16E8[0x8];                                     // 0x16E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x16F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UProjectileMovementComponent*           ProjectileMovement;                                // 0x16F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x1700(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_0AC96F6543A0F09ED5F8D690C3CA8FC6; // 0x1708(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_0AC96F6543A0F09ED5F8D690C3CA8FC6; // 0x170C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_170D[0x3];                                     // 0x170D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x1710(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timer_Track3_AEC6D8C041856DD96996AFA738CB87E9;     // 0x1718(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timer_Track2_AEC6D8C041856DD96996AFA738CB87E9;     // 0x171C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timer_Track1_AEC6D8C041856DD96996AFA738CB87E9;     // 0x1720(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timer__Direction_AEC6D8C041856DD96996AFA738CB87E9; // 0x1724(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1725[0x3];                                     // 0x1725(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timer;                                             // 0x1728(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location1;                                         // 0x1730(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location2;                                         // 0x173C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBombed;                                           // 0x1748(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1749[0x7];                                     // 0x1749(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               TailParticle;                                      // 0x1750(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x1758(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_175C[0x4];                                     // 0x175C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           WarningTimer1;                                     // 0x1760(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           WarningTimer2;                                     // 0x1768(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           WarningTimer3;                                     // 0x1770(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         WarningID;                                         // 0x1778(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Color;                                             // 0x177C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Trap_Mon_005_Skill01(int32 EntryPoint);
	void WarningEffect();
	void StopTimer();
	void StartTimer();
	void OnRecycle();
	void Client_OnActive();
	void Server_OnActive();
	void ReceiveBeginPlay();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void Timer__UpdateFunc();
	void Timer__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_Mon_005_Skill01_C">();
	}
	static class ATrap_Mon_005_Skill01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_Mon_005_Skill01_C>();
	}
};
static_assert(alignof(ATrap_Mon_005_Skill01_C) == 0x000010, "Wrong alignment on ATrap_Mon_005_Skill01_C");
static_assert(sizeof(ATrap_Mon_005_Skill01_C) == 0x001790, "Wrong size on ATrap_Mon_005_Skill01_C");
static_assert(offsetof(ATrap_Mon_005_Skill01_C, UberGraphFrame) == 0x0016F0, "Member 'ATrap_Mon_005_Skill01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_005_Skill01_C, ProjectileMovement) == 0x0016F8, "Member 'ATrap_Mon_005_Skill01_C::ProjectileMovement' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_005_Skill01_C, SkeletalMesh) == 0x001700, "Member 'ATrap_Mon_005_Skill01_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_005_Skill01_C, Timeline_0_NewTrack_0_0AC96F6543A0F09ED5F8D690C3CA8FC6) == 0x001708, "Member 'ATrap_Mon_005_Skill01_C::Timeline_0_NewTrack_0_0AC96F6543A0F09ED5F8D690C3CA8FC6' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_005_Skill01_C, Timeline_0__Direction_0AC96F6543A0F09ED5F8D690C3CA8FC6) == 0x00170C, "Member 'ATrap_Mon_005_Skill01_C::Timeline_0__Direction_0AC96F6543A0F09ED5F8D690C3CA8FC6' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_005_Skill01_C, Timeline_0) == 0x001710, "Member 'ATrap_Mon_005_Skill01_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_005_Skill01_C, Timer_Track3_AEC6D8C041856DD96996AFA738CB87E9) == 0x001718, "Member 'ATrap_Mon_005_Skill01_C::Timer_Track3_AEC6D8C041856DD96996AFA738CB87E9' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_005_Skill01_C, Timer_Track2_AEC6D8C041856DD96996AFA738CB87E9) == 0x00171C, "Member 'ATrap_Mon_005_Skill01_C::Timer_Track2_AEC6D8C041856DD96996AFA738CB87E9' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_005_Skill01_C, Timer_Track1_AEC6D8C041856DD96996AFA738CB87E9) == 0x001720, "Member 'ATrap_Mon_005_Skill01_C::Timer_Track1_AEC6D8C041856DD96996AFA738CB87E9' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_005_Skill01_C, Timer__Direction_AEC6D8C041856DD96996AFA738CB87E9) == 0x001724, "Member 'ATrap_Mon_005_Skill01_C::Timer__Direction_AEC6D8C041856DD96996AFA738CB87E9' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_005_Skill01_C, Timer) == 0x001728, "Member 'ATrap_Mon_005_Skill01_C::Timer' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_005_Skill01_C, Location1) == 0x001730, "Member 'ATrap_Mon_005_Skill01_C::Location1' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_005_Skill01_C, Location2) == 0x00173C, "Member 'ATrap_Mon_005_Skill01_C::Location2' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_005_Skill01_C, bBombed) == 0x001748, "Member 'ATrap_Mon_005_Skill01_C::bBombed' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_005_Skill01_C, TailParticle) == 0x001750, "Member 'ATrap_Mon_005_Skill01_C::TailParticle' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_005_Skill01_C, Count) == 0x001758, "Member 'ATrap_Mon_005_Skill01_C::Count' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_005_Skill01_C, WarningTimer1) == 0x001760, "Member 'ATrap_Mon_005_Skill01_C::WarningTimer1' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_005_Skill01_C, WarningTimer2) == 0x001768, "Member 'ATrap_Mon_005_Skill01_C::WarningTimer2' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_005_Skill01_C, WarningTimer3) == 0x001770, "Member 'ATrap_Mon_005_Skill01_C::WarningTimer3' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_005_Skill01_C, WarningID) == 0x001778, "Member 'ATrap_Mon_005_Skill01_C::WarningID' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_005_Skill01_C, Color) == 0x00177C, "Member 'ATrap_Mon_005_Skill01_C::Color' has a wrong offset!");

}

