#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Girl008_Skill03

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trap_Girl008_Skill03.Trap_Girl008_Skill03_C
// 0x0040 (0x1700 - 0x16C0)
class ATrap_Girl008_Skill03_C : public ATrap
{
public:
	uint8                                         Pad_16B8[0x8];                                     // 0x16B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x16C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow1;                                            // 0x16C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Box*                  AbilityCollision_Box;                              // 0x16D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           Projectile_Movement;                               // 0x16D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x16E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Start;                                             // 0x16E4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaYaw;                                          // 0x16F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultSpeed;                                      // 0x16F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RealSpeed;                                         // 0x16F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayTime;                                         // 0x16FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Server_OnActive();
	void Client_OnActive();
	void ExecuteUbergraph_Trap_Girl008_Skill03(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_Girl008_Skill03_C">();
	}
	static class ATrap_Girl008_Skill03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_Girl008_Skill03_C>();
	}
};
static_assert(alignof(ATrap_Girl008_Skill03_C) == 0x000010, "Wrong alignment on ATrap_Girl008_Skill03_C");
static_assert(sizeof(ATrap_Girl008_Skill03_C) == 0x001700, "Wrong size on ATrap_Girl008_Skill03_C");
static_assert(offsetof(ATrap_Girl008_Skill03_C, UberGraphFrame) == 0x0016C0, "Member 'ATrap_Girl008_Skill03_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_Girl008_Skill03_C, Arrow1) == 0x0016C8, "Member 'ATrap_Girl008_Skill03_C::Arrow1' has a wrong offset!");
static_assert(offsetof(ATrap_Girl008_Skill03_C, AbilityCollision_Box) == 0x0016D0, "Member 'ATrap_Girl008_Skill03_C::AbilityCollision_Box' has a wrong offset!");
static_assert(offsetof(ATrap_Girl008_Skill03_C, Projectile_Movement) == 0x0016D8, "Member 'ATrap_Girl008_Skill03_C::Projectile_Movement' has a wrong offset!");
static_assert(offsetof(ATrap_Girl008_Skill03_C, Count) == 0x0016E0, "Member 'ATrap_Girl008_Skill03_C::Count' has a wrong offset!");
static_assert(offsetof(ATrap_Girl008_Skill03_C, Start) == 0x0016E4, "Member 'ATrap_Girl008_Skill03_C::Start' has a wrong offset!");
static_assert(offsetof(ATrap_Girl008_Skill03_C, DeltaYaw) == 0x0016F0, "Member 'ATrap_Girl008_Skill03_C::DeltaYaw' has a wrong offset!");
static_assert(offsetof(ATrap_Girl008_Skill03_C, DefaultSpeed) == 0x0016F4, "Member 'ATrap_Girl008_Skill03_C::DefaultSpeed' has a wrong offset!");
static_assert(offsetof(ATrap_Girl008_Skill03_C, RealSpeed) == 0x0016F8, "Member 'ATrap_Girl008_Skill03_C::RealSpeed' has a wrong offset!");
static_assert(offsetof(ATrap_Girl008_Skill03_C, DelayTime) == 0x0016FC, "Member 'ATrap_Girl008_Skill03_C::DelayTime' has a wrong offset!");

}

