#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_special_5000099

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trap_special_5000099.Trap_special_5000099_C
// 0x0030 (0x16F0 - 0x16C0)
class ATrap_special_5000099_C final : public ATrap
{
public:
	uint8                                         Pad_16B8[0x8];                                     // 0x16B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x16C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Scene1;                                            // 0x16C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        EndParticle;                                       // 0x16D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HotStart;                                          // 0x16D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16D9[0x7];                                     // 0x16D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      Skill;                                             // 0x16E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CastNiagara;                                       // 0x16E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Client_OnActive();
	void BP_ClientPlayTrapEndExhibition();
	void ExecuteUbergraph_Trap_special_5000099(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_special_5000099_C">();
	}
	static class ATrap_special_5000099_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_special_5000099_C>();
	}
};
static_assert(alignof(ATrap_special_5000099_C) == 0x000010, "Wrong alignment on ATrap_special_5000099_C");
static_assert(sizeof(ATrap_special_5000099_C) == 0x0016F0, "Wrong size on ATrap_special_5000099_C");
static_assert(offsetof(ATrap_special_5000099_C, UberGraphFrame) == 0x0016C0, "Member 'ATrap_special_5000099_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_special_5000099_C, Scene1) == 0x0016C8, "Member 'ATrap_special_5000099_C::Scene1' has a wrong offset!");
static_assert(offsetof(ATrap_special_5000099_C, EndParticle) == 0x0016D0, "Member 'ATrap_special_5000099_C::EndParticle' has a wrong offset!");
static_assert(offsetof(ATrap_special_5000099_C, HotStart) == 0x0016D8, "Member 'ATrap_special_5000099_C::HotStart' has a wrong offset!");
static_assert(offsetof(ATrap_special_5000099_C, Skill) == 0x0016E0, "Member 'ATrap_special_5000099_C::Skill' has a wrong offset!");
static_assert(offsetof(ATrap_special_5000099_C, CastNiagara) == 0x0016E8, "Member 'ATrap_special_5000099_C::CastNiagara' has a wrong offset!");

}

