#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Boss_203_Stage01_Break

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trap_Boss_203_Stage01_Break.Trap_Boss_203_Stage01_Break_C
// 0x0050 (0x17C0 - 0x1770)
class ATrap_Boss_203_Stage01_Break_C final : public ATrap
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1770(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 AssistAimCube;                                     // 0x1778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x1780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDamagePointLock_C*                     DamagePointLock;                                   // 0x1788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x1790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      E_boss301_test_skill05_self_01_p;                  // 0x1798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        TrapSocket;                                        // 0x17A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BulletParticle;                                    // 0x17A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Boss_203_C*                         OwnerBoss203;                                      // 0x17B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OwnerCastSpecificSkill(int32 SkillID, const TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef);
	void Server_OnActive();
	void HideWeakPoint();
	void ShowWeakPoint();
	void Destruct();
	void ReceiveBeginPlay();
	void BP_OnDead(class UAbilityComponentBase* Killer);
	void OwnerSpecificSkillEnd(int32 SkillID);
	void Client_OnActive();
	void ExecuteUbergraph_Trap_Boss_203_Stage01_Break(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_Boss_203_Stage01_Break_C">();
	}
	static class ATrap_Boss_203_Stage01_Break_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_Boss_203_Stage01_Break_C>();
	}
};
static_assert(alignof(ATrap_Boss_203_Stage01_Break_C) == 0x000010, "Wrong alignment on ATrap_Boss_203_Stage01_Break_C");
static_assert(sizeof(ATrap_Boss_203_Stage01_Break_C) == 0x0017C0, "Wrong size on ATrap_Boss_203_Stage01_Break_C");
static_assert(offsetof(ATrap_Boss_203_Stage01_Break_C, UberGraphFrame) == 0x001770, "Member 'ATrap_Boss_203_Stage01_Break_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_Boss_203_Stage01_Break_C, AssistAimCube) == 0x001778, "Member 'ATrap_Boss_203_Stage01_Break_C::AssistAimCube' has a wrong offset!");
static_assert(offsetof(ATrap_Boss_203_Stage01_Break_C, StaticMesh) == 0x001780, "Member 'ATrap_Boss_203_Stage01_Break_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ATrap_Boss_203_Stage01_Break_C, DamagePointLock) == 0x001788, "Member 'ATrap_Boss_203_Stage01_Break_C::DamagePointLock' has a wrong offset!");
static_assert(offsetof(ATrap_Boss_203_Stage01_Break_C, Sphere) == 0x001790, "Member 'ATrap_Boss_203_Stage01_Break_C::Sphere' has a wrong offset!");
static_assert(offsetof(ATrap_Boss_203_Stage01_Break_C, E_boss301_test_skill05_self_01_p) == 0x001798, "Member 'ATrap_Boss_203_Stage01_Break_C::E_boss301_test_skill05_self_01_p' has a wrong offset!");
static_assert(offsetof(ATrap_Boss_203_Stage01_Break_C, TrapSocket) == 0x0017A0, "Member 'ATrap_Boss_203_Stage01_Break_C::TrapSocket' has a wrong offset!");
static_assert(offsetof(ATrap_Boss_203_Stage01_Break_C, BulletParticle) == 0x0017A8, "Member 'ATrap_Boss_203_Stage01_Break_C::BulletParticle' has a wrong offset!");
static_assert(offsetof(ATrap_Boss_203_Stage01_Break_C, OwnerBoss203) == 0x0017B0, "Member 'ATrap_Boss_203_Stage01_Break_C::OwnerBoss203' has a wrong offset!");

}

