#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Mon_106_Skill01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trap_Mon_106_Skill01.Trap_Mon_106_Skill01_C
// 0x0050 (0x1740 - 0x16F0)
class ATrap_Mon_106_Skill01_C final : public ATrap
{
public:
	uint8                                         Pad_16E8[0x8];                                     // 0x16E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x16F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      E_mon106_skill01_buff02_p;                         // 0x16F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Sphere*               WarningBox;                                        // 0x1700(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x1708(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timer_Track1_06713DBF4DF467D0C16EBEB8CC6FB407;     // 0x1710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timer__Direction_06713DBF4DF467D0C16EBEB8CC6FB407; // 0x1714(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1715[0x3];                                     // 0x1715(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timer;                                             // 0x1718(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location1;                                         // 0x1720(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location2;                                         // 0x172C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBombed;                                           // 0x1738(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void Timer__FinishedFunc();
	void OnDie(class AGameCharacter* Who, class AGameCharacter* Killer, const struct FHealthChangeValue& HealthChangeValue);
	void Server_OnActive();
	void ExecuteUbergraph_Trap_Mon_106_Skill01(int32 EntryPoint);
	void Timer__UpdateFunc();
	void ReceiveBeginPlay();
	void TrapEffect();
	void Client_OnActive();
	void BP_ClientPlayTrapEndExhibition();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_Mon_106_Skill01_C">();
	}
	static class ATrap_Mon_106_Skill01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_Mon_106_Skill01_C>();
	}
};
static_assert(alignof(ATrap_Mon_106_Skill01_C) == 0x000010, "Wrong alignment on ATrap_Mon_106_Skill01_C");
static_assert(sizeof(ATrap_Mon_106_Skill01_C) == 0x001740, "Wrong size on ATrap_Mon_106_Skill01_C");
static_assert(offsetof(ATrap_Mon_106_Skill01_C, UberGraphFrame) == 0x0016F0, "Member 'ATrap_Mon_106_Skill01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_106_Skill01_C, E_mon106_skill01_buff02_p) == 0x0016F8, "Member 'ATrap_Mon_106_Skill01_C::E_mon106_skill01_buff02_p' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_106_Skill01_C, WarningBox) == 0x001700, "Member 'ATrap_Mon_106_Skill01_C::WarningBox' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_106_Skill01_C, Sphere) == 0x001708, "Member 'ATrap_Mon_106_Skill01_C::Sphere' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_106_Skill01_C, Timer_Track1_06713DBF4DF467D0C16EBEB8CC6FB407) == 0x001710, "Member 'ATrap_Mon_106_Skill01_C::Timer_Track1_06713DBF4DF467D0C16EBEB8CC6FB407' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_106_Skill01_C, Timer__Direction_06713DBF4DF467D0C16EBEB8CC6FB407) == 0x001714, "Member 'ATrap_Mon_106_Skill01_C::Timer__Direction_06713DBF4DF467D0C16EBEB8CC6FB407' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_106_Skill01_C, Timer) == 0x001718, "Member 'ATrap_Mon_106_Skill01_C::Timer' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_106_Skill01_C, Location1) == 0x001720, "Member 'ATrap_Mon_106_Skill01_C::Location1' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_106_Skill01_C, Location2) == 0x00172C, "Member 'ATrap_Mon_106_Skill01_C::Location2' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_106_Skill01_C, bBombed) == 0x001738, "Member 'ATrap_Mon_106_Skill01_C::bBombed' has a wrong offset!");

}

