#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Girl014b_Skill04_02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trap_Girl014b_Skill04_02.Trap_Girl014b_Skill04_02_C
// 0x0070 (0x17E0 - 0x1770)
class ATrap_Girl014b_Skill04_02_C final : public ATrap
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1770(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAbilityCollision_Capsual*              AbilityCollision_Capsual;                          // 0x1778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SkillInterval_Logic;                               // 0x1780(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkillInterval;                                     // 0x1784(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Delta_Seconds;                                     // 0x1788(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_178C[0x4];                                     // 0x178C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      ArrowRain;                                         // 0x1790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OriginPoint;                                       // 0x1798(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomX;                                           // 0x17A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomY;                                           // 0x17A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17AC[0x4];                                     // 0x17AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        E_girl014b_skill04_02;                             // 0x17B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        E_girl014b_skill04_08;                             // 0x17C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void Server_OnActive();
	void Client_OnActive();
	void BP_ClientPlayTrapEndExhibition();
	void OnRecycle();
	void ExecuteUbergraph_Trap_Girl014b_Skill04_02(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_Girl014b_Skill04_02_C">();
	}
	static class ATrap_Girl014b_Skill04_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_Girl014b_Skill04_02_C>();
	}
};
static_assert(alignof(ATrap_Girl014b_Skill04_02_C) == 0x000010, "Wrong alignment on ATrap_Girl014b_Skill04_02_C");
static_assert(sizeof(ATrap_Girl014b_Skill04_02_C) == 0x0017E0, "Wrong size on ATrap_Girl014b_Skill04_02_C");
static_assert(offsetof(ATrap_Girl014b_Skill04_02_C, UberGraphFrame) == 0x001770, "Member 'ATrap_Girl014b_Skill04_02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_Girl014b_Skill04_02_C, AbilityCollision_Capsual) == 0x001778, "Member 'ATrap_Girl014b_Skill04_02_C::AbilityCollision_Capsual' has a wrong offset!");
static_assert(offsetof(ATrap_Girl014b_Skill04_02_C, SkillInterval_Logic) == 0x001780, "Member 'ATrap_Girl014b_Skill04_02_C::SkillInterval_Logic' has a wrong offset!");
static_assert(offsetof(ATrap_Girl014b_Skill04_02_C, SkillInterval) == 0x001784, "Member 'ATrap_Girl014b_Skill04_02_C::SkillInterval' has a wrong offset!");
static_assert(offsetof(ATrap_Girl014b_Skill04_02_C, Delta_Seconds) == 0x001788, "Member 'ATrap_Girl014b_Skill04_02_C::Delta_Seconds' has a wrong offset!");
static_assert(offsetof(ATrap_Girl014b_Skill04_02_C, ArrowRain) == 0x001790, "Member 'ATrap_Girl014b_Skill04_02_C::ArrowRain' has a wrong offset!");
static_assert(offsetof(ATrap_Girl014b_Skill04_02_C, OriginPoint) == 0x001798, "Member 'ATrap_Girl014b_Skill04_02_C::OriginPoint' has a wrong offset!");
static_assert(offsetof(ATrap_Girl014b_Skill04_02_C, RandomX) == 0x0017A4, "Member 'ATrap_Girl014b_Skill04_02_C::RandomX' has a wrong offset!");
static_assert(offsetof(ATrap_Girl014b_Skill04_02_C, RandomY) == 0x0017A8, "Member 'ATrap_Girl014b_Skill04_02_C::RandomY' has a wrong offset!");
static_assert(offsetof(ATrap_Girl014b_Skill04_02_C, E_girl014b_skill04_02) == 0x0017B0, "Member 'ATrap_Girl014b_Skill04_02_C::E_girl014b_skill04_02' has a wrong offset!");
static_assert(offsetof(ATrap_Girl014b_Skill04_02_C, E_girl014b_skill04_08) == 0x0017C8, "Member 'ATrap_Girl014b_Skill04_02_C::E_girl014b_skill04_08' has a wrong offset!");

}

