#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Mon_005_Skill01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Trap_Mon_005_Skill01.Trap_Mon_005_Skill01_C.ExecuteUbergraph_Trap_Mon_005_Skill01
// 0x0268 (0x0268 - 0x0000)
struct Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseComponent*                        CallFunc_PostEventAttachedActor_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x003C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x00CC(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddCircleWarning_ReturnValue;             // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddActorWorldOffset_SweepHitResult;    // 0x018C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_GetSkillLevel_ReturnValue;                // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseComponent*                        CallFunc_PostEventAttachedActor_ReturnValue_1;     // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClient_ReturnValue;                     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnGameEmitterAtLocation_ReturnValue;   // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnGameEmitterAttached_ReturnValue;     // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStandalone_ReturnValue;                 // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0245(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0246(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0247(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x0248(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0254(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01) == 0x000008, "Wrong alignment on Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01");
static_assert(sizeof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01) == 0x000268, "Wrong size on Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, EntryPoint) == 0x000000, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_PostEventAttachedActor_ReturnValue) == 0x000008, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_PostEventAttachedActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_Lerp_ReturnValue) == 0x000010, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_RLerp_ReturnValue) == 0x000014, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_VLerp_ReturnValue) == 0x000020, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_BreakVector_X) == 0x000030, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_BreakVector_Y) == 0x000034, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_BreakVector_Z) == 0x000038, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x00003C, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000C8, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0000CC, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_MakeVector_ReturnValue) == 0x000158, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000164, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_AddCircleWarning_ReturnValue) == 0x000170, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_AddCircleWarning_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000178, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000180, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_K2_AddActorWorldOffset_SweepHitResult) == 0x00018C, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_K2_AddActorWorldOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_GetSkillLevel_ReturnValue) == 0x000218, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_GetSkillLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_PostEventAttachedActor_ReturnValue_1) == 0x000220, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_PostEventAttachedActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_IsClient_ReturnValue) == 0x000228, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_IsClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_SpawnGameEmitterAtLocation_ReturnValue) == 0x000230, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_SpawnGameEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_SpawnGameEmitterAttached_ReturnValue) == 0x000238, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_SpawnGameEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_IsStandalone_ReturnValue) == 0x000240, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_IsStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_IsServer_ReturnValue) == 0x000241, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_Not_PreBool_ReturnValue) == 0x000242, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_BooleanOR_ReturnValue) == 0x000243, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_IsServer_ReturnValue_1) == 0x000244, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_IsDedicatedServer_ReturnValue) == 0x000245, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, ___bool_Has_Been_Initd_Variable) == 0x000246, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, ___bool_IsClosed_Variable) == 0x000247, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_GetSocketRotation_ReturnValue) == 0x000248, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_GetSocketRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_GetSocketLocation_ReturnValue) == 0x000254, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x000260, "Member 'Trap_Mon_005_Skill01_C_ExecuteUbergraph_Trap_Mon_005_Skill01::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");

}

