#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Laser

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trap_Laser.Trap_Laser_C
// 0x0060 (0x17D0 - 0x1770)
class ATrap_Laser_C final : public ATrap
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1770(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        BeamStart;                                         // 0x1778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCollision_Capsual*              AbilityCollision_Capsual;                          // 0x1780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        beamend;                                           // 0x1788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWwiseComponent*                        SoundEvent;                                        // 0x1790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Wwise;                                             // 0x1798(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Out_Id;                                            // 0x17A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         beam;                                              // 0x17AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BeamEndWorldPos;                                   // 0x17B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Out_Index;                                         // 0x17BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OutId_Laser;                                       // 0x17C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OutIndex_Laser;                                    // 0x17C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_ClientPlayTrapEndExhibition();
	void ReceiveTick(float DeltaSeconds);
	void Init(const struct FVector& Pos);
	void Client_OnActive();
	void ExecuteUbergraph_Trap_Laser(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_Laser_C">();
	}
	static class ATrap_Laser_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_Laser_C>();
	}
};
static_assert(alignof(ATrap_Laser_C) == 0x000010, "Wrong alignment on ATrap_Laser_C");
static_assert(sizeof(ATrap_Laser_C) == 0x0017D0, "Wrong size on ATrap_Laser_C");
static_assert(offsetof(ATrap_Laser_C, UberGraphFrame) == 0x001770, "Member 'ATrap_Laser_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_Laser_C, BeamStart) == 0x001778, "Member 'ATrap_Laser_C::BeamStart' has a wrong offset!");
static_assert(offsetof(ATrap_Laser_C, AbilityCollision_Capsual) == 0x001780, "Member 'ATrap_Laser_C::AbilityCollision_Capsual' has a wrong offset!");
static_assert(offsetof(ATrap_Laser_C, beamend) == 0x001788, "Member 'ATrap_Laser_C::beamend' has a wrong offset!");
static_assert(offsetof(ATrap_Laser_C, SoundEvent) == 0x001790, "Member 'ATrap_Laser_C::SoundEvent' has a wrong offset!");
static_assert(offsetof(ATrap_Laser_C, Wwise) == 0x001798, "Member 'ATrap_Laser_C::Wwise' has a wrong offset!");
static_assert(offsetof(ATrap_Laser_C, Out_Id) == 0x0017A8, "Member 'ATrap_Laser_C::Out_Id' has a wrong offset!");
static_assert(offsetof(ATrap_Laser_C, beam) == 0x0017AC, "Member 'ATrap_Laser_C::beam' has a wrong offset!");
static_assert(offsetof(ATrap_Laser_C, BeamEndWorldPos) == 0x0017B0, "Member 'ATrap_Laser_C::BeamEndWorldPos' has a wrong offset!");
static_assert(offsetof(ATrap_Laser_C, Out_Index) == 0x0017BC, "Member 'ATrap_Laser_C::Out_Index' has a wrong offset!");
static_assert(offsetof(ATrap_Laser_C, OutId_Laser) == 0x0017C0, "Member 'ATrap_Laser_C::OutId_Laser' has a wrong offset!");
static_assert(offsetof(ATrap_Laser_C, OutIndex_Laser) == 0x0017C4, "Member 'ATrap_Laser_C::OutIndex_Laser' has a wrong offset!");

}

