#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Mon_109_Skill01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Trap_Mon_109_Skill01.Trap_Mon_109_Skill01_C.ExecuteUbergraph_Trap_Mon_109_Skill01
// 0x0410 (0x0410 - 0x0000)
struct Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x002C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x00DC(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_2;     // 0x0174(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_2;           // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0230(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x023C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x0248(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSkillLevel_ReturnValue;                // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClient_ReturnValue;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_3;     // 0x0268(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_4;     // 0x02F4(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_5;     // 0x0380(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01) == 0x000008, "Wrong alignment on Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01");
static_assert(sizeof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01) == 0x000410, "Wrong size on Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01");
static_assert(offsetof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01, EntryPoint) == 0x000000, "Member 'Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000004, "Member 'Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01, CallFunc_GetForwardVector_ReturnValue) == 0x000020, "Member 'Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x00002C, "Member 'Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000B8, "Member 'Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C4, "Member 'Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01, CallFunc_GetSocketLocation_ReturnValue) == 0x0000D0, "Member 'Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x0000DC, "Member 'Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01, CallFunc_GetForwardVector_ReturnValue_1) == 0x000168, "Member 'Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01, CallFunc_K2_SetWorldLocation_SweepHitResult_2) == 0x000174, "Member 'Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01::CallFunc_K2_SetWorldLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000200, "Member 'Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01, CallFunc_GetForwardVector_ReturnValue_2) == 0x00020C, "Member 'Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01::CallFunc_GetForwardVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000218, "Member 'Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x000224, "Member 'Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000230, "Member 'Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01, CallFunc_GetSocketLocation_ReturnValue_1) == 0x00023C, "Member 'Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01, CallFunc_GetSocketLocation_ReturnValue_2) == 0x000248, "Member 'Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01::CallFunc_GetSocketLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01, CallFunc_GetSkillLevel_ReturnValue) == 0x000254, "Member 'Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01::CallFunc_GetSkillLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01, CallFunc_IsClient_ReturnValue) == 0x000258, "Member 'Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01::CallFunc_IsClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00025C, "Member 'Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01, CallFunc_K2_SetWorldLocation_SweepHitResult_3) == 0x000268, "Member 'Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01::CallFunc_K2_SetWorldLocation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01, CallFunc_K2_SetWorldLocation_SweepHitResult_4) == 0x0002F4, "Member 'Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01::CallFunc_K2_SetWorldLocation_SweepHitResult_4' has a wrong offset!");
static_assert(offsetof(Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01, CallFunc_K2_SetWorldLocation_SweepHitResult_5) == 0x000380, "Member 'Trap_Mon_109_Skill01_C_ExecuteUbergraph_Trap_Mon_109_Skill01::CallFunc_K2_SetWorldLocation_SweepHitResult_5' has a wrong offset!");

}

