#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap001_LowHealth

#include "Basic.hpp"


namespace SDK::Params
{

// Function Trap001_LowHealth.Trap001_LowHealth_C.Execute_Server
// 0x0010 (0x0010 - 0x0000)
struct Trap001_LowHealth_C_Execute_Server final
{
public:
	class AActor*                                 InteractPlayer;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 InteractActor;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap001_LowHealth_C_Execute_Server) == 0x000008, "Wrong alignment on Trap001_LowHealth_C_Execute_Server");
static_assert(sizeof(Trap001_LowHealth_C_Execute_Server) == 0x000010, "Wrong size on Trap001_LowHealth_C_Execute_Server");
static_assert(offsetof(Trap001_LowHealth_C_Execute_Server, InteractPlayer) == 0x000000, "Member 'Trap001_LowHealth_C_Execute_Server::InteractPlayer' has a wrong offset!");
static_assert(offsetof(Trap001_LowHealth_C_Execute_Server, InteractActor) == 0x000008, "Member 'Trap001_LowHealth_C_Execute_Server::InteractActor' has a wrong offset!");

// Function Trap001_LowHealth.Trap001_LowHealth_C.ExecuteUbergraph_Trap001_LowHealth
// 0x0098 (0x0098 - 0x0000)
struct Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACanInteractActor*                      CallFunc_GetOwnerCanInteractActor_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACanInteractActor*                      CallFunc_GetOwnerCanInteractActor_ReturnValue_1;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UPrimitiveComponent*>            CallFunc_GetComponentsByTag_ReturnValue;           // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            CallFunc_GetComponentsByTag_ReturnValue_1;         // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_InteractPlayer;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InteractActor;                        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsAlive_ReturnValue;                   // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth) == 0x000008, "Wrong alignment on Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth");
static_assert(sizeof(Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth) == 0x000098, "Wrong size on Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth");
static_assert(offsetof(Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth, EntryPoint) == 0x000000, "Member 'Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth, ___int_Array_Index_Variable) == 0x000004, "Member 'Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth, ___int_Loop_Counter_Variable) == 0x000008, "Member 'Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth, ___int_Array_Index_Variable_1) == 0x000010, "Member 'Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth, CallFunc_GetOwnerCanInteractActor_ReturnValue) == 0x000018, "Member 'Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth::CallFunc_GetOwnerCanInteractActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth, CallFunc_GetOwnerCanInteractActor_ReturnValue_1) == 0x000020, "Member 'Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth::CallFunc_GetOwnerCanInteractActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth, CallFunc_GetComponentsByTag_ReturnValue) == 0x000028, "Member 'Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth, ___int_Loop_Counter_Variable_1) == 0x000038, "Member 'Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth, CallFunc_Array_Get_Item) == 0x000040, "Member 'Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth, CallFunc_Add_IntInt_ReturnValue_1) == 0x000048, "Member 'Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth, CallFunc_GetComponentsByTag_ReturnValue_1) == 0x000058, "Member 'Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth::CallFunc_GetComponentsByTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth, CallFunc_Less_IntInt_ReturnValue_1) == 0x000074, "Member 'Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth, K2Node_Event_InteractPlayer) == 0x000078, "Member 'Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth::K2Node_Event_InteractPlayer' has a wrong offset!");
static_assert(offsetof(Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth, K2Node_Event_InteractActor) == 0x000080, "Member 'Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth::K2Node_Event_InteractActor' has a wrong offset!");
static_assert(offsetof(Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth, K2Node_DynamicCast_AsGame_Character) == 0x000088, "Member 'Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth, CallFunc_K2_IsAlive_ReturnValue) == 0x000091, "Member 'Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth::CallFunc_K2_IsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth, CallFunc_IsValid_ReturnValue) == 0x000092, "Member 'Trap001_LowHealth_C_ExecuteUbergraph_Trap001_LowHealth::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

