#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Mon_118_Skill01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Trap_Mon_118_Skill01.Trap_Mon_118_Skill01_C.ExecuteUbergraph_Trap_Mon_118_Skill01
// 0x0068 (0x0068 - 0x0000)
struct Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseComponent*                        CallFunc_PostEventAttachedActor_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseComponent*                        CallFunc_PostEventAttachedActor_ReturnValue_1;     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_2;      // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSkillLevel_ReturnValue;                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01) == 0x000008, "Wrong alignment on Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01");
static_assert(sizeof(Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01) == 0x000068, "Wrong size on Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01");
static_assert(offsetof(Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01, EntryPoint) == 0x000000, "Member 'Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01, CallFunc_PostEventAttachedActor_ReturnValue) == 0x000008, "Member 'Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01::CallFunc_PostEventAttachedActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000010, "Member 'Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01, CallFunc_PostEventAttachedActor_ReturnValue_1) == 0x000018, "Member 'Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01::CallFunc_PostEventAttachedActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x000030, "Member 'Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01, CallFunc_BreakVector_X) == 0x000038, "Member 'Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01, CallFunc_BreakVector_Y) == 0x00003C, "Member 'Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01, CallFunc_BreakVector_Z) == 0x000040, "Member 'Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01, CallFunc_IsValid_ReturnValue_1) == 0x000044, "Member 'Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01, CallFunc_Add_FloatFloat_ReturnValue) == 0x000048, "Member 'Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01, CallFunc_MakeVector_ReturnValue) == 0x00004C, "Member 'Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01, CallFunc_SpawnSystemAtLocation_ReturnValue_2) == 0x000058, "Member 'Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01::CallFunc_SpawnSystemAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01, CallFunc_GetSkillLevel_ReturnValue) == 0x000060, "Member 'Trap_Mon_118_Skill01_C_ExecuteUbergraph_Trap_Mon_118_Skill01::CallFunc_GetSkillLevel_ReturnValue' has a wrong offset!");

}

