#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Girl008_Skill03

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Trap_Girl008_Skill03.Trap_Girl008_Skill03_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Trap_Girl008_Skill03_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Girl008_Skill03_C_ReceiveTick) == 0x000004, "Wrong alignment on Trap_Girl008_Skill03_C_ReceiveTick");
static_assert(sizeof(Trap_Girl008_Skill03_C_ReceiveTick) == 0x000004, "Wrong size on Trap_Girl008_Skill03_C_ReceiveTick");
static_assert(offsetof(Trap_Girl008_Skill03_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Trap_Girl008_Skill03_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Trap_Girl008_Skill03.Trap_Girl008_Skill03_C.ExecuteUbergraph_Trap_Girl008_Skill03
// 0x0148 (0x0148 - 0x0000)
struct Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseComponent*                        CallFunc_PostEventAtLocation_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_DegCos_ReturnValue;                       // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddActorWorldRotation_SweepHitResult;  // 0x0090(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable;                                   // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnGameNiagaraAtLocation_ReturnValue;   // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03) == 0x000008, "Wrong alignment on Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03");
static_assert(sizeof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03) == 0x000148, "Wrong size on Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, EntryPoint) == 0x000000, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00000C, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000018, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, CallFunc_BreakVector_X) == 0x000024, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, CallFunc_BreakVector_Y) == 0x000028, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, CallFunc_BreakVector_Z) == 0x00002C, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000030, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000034, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, CallFunc_MakeVector_ReturnValue) == 0x000038, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, CallFunc_PostEventAtLocation_ReturnValue) == 0x000048, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, CallFunc_MakeVector_ReturnValue_1) == 0x000050, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x00005C, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, CallFunc_BooleanAND_ReturnValue) == 0x000064, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, CallFunc_GetActorForwardVector_ReturnValue) == 0x000068, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, CallFunc_GetActorForwardVector_ReturnValue_1) == 0x000074, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::CallFunc_GetActorForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, CallFunc_MakeRotator_ReturnValue) == 0x000080, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, CallFunc_DegCos_ReturnValue) == 0x00008C, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::CallFunc_DegCos_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, CallFunc_K2_AddActorWorldRotation_SweepHitResult) == 0x000090, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::CallFunc_K2_AddActorWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00011C, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000120, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x00012C, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, ___int_Variable) == 0x000138, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::___int_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03, CallFunc_SpawnGameNiagaraAtLocation_ReturnValue) == 0x000140, "Member 'Trap_Girl008_Skill03_C_ExecuteUbergraph_Trap_Girl008_Skill03::CallFunc_SpawnGameNiagaraAtLocation_ReturnValue' has a wrong offset!");

}

