#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Mon_106_Skill01

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Trap_Mon_106_Skill01.Trap_Mon_106_Skill01_C.OnDie
// 0x01C0 (0x01C0 - 0x0000)
struct Trap_Mon_106_Skill01_C_OnDie final
{
public:
	class AGameCharacter*                         Who;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         Killer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     HealthChangeValue;                                 // 0x0010(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(Trap_Mon_106_Skill01_C_OnDie) == 0x000008, "Wrong alignment on Trap_Mon_106_Skill01_C_OnDie");
static_assert(sizeof(Trap_Mon_106_Skill01_C_OnDie) == 0x0001C0, "Wrong size on Trap_Mon_106_Skill01_C_OnDie");
static_assert(offsetof(Trap_Mon_106_Skill01_C_OnDie, Who) == 0x000000, "Member 'Trap_Mon_106_Skill01_C_OnDie::Who' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_OnDie, Killer) == 0x000008, "Member 'Trap_Mon_106_Skill01_C_OnDie::Killer' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_OnDie, HealthChangeValue) == 0x000010, "Member 'Trap_Mon_106_Skill01_C_OnDie::HealthChangeValue' has a wrong offset!");

// Function Trap_Mon_106_Skill01.Trap_Mon_106_Skill01_C.ExecuteUbergraph_Trap_Mon_106_Skill01
// 0x02F8 (0x02F8 - 0x0000)
struct Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseComponent*                        CallFunc_PostEventAttachedActor_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSkillLevel_ReturnValue;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_Event_Who;                                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_Event_Killer;                               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHealthChangeValue                     K2Node_Event_HealthChangeValue;                    // 0x0058(0x01B0)(ConstParm, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClient_ReturnValue;                     // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClient_ReturnValue_1;                   // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseComponent*                        CallFunc_PostEventAttachedActor_ReturnValue_1;     // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClient_ReturnValue_2;                   // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_252[0x2];                                      // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0254(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0260(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnGameEmitterAtLocation_ReturnValue;   // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01) == 0x000008, "Wrong alignment on Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01");
static_assert(sizeof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01) == 0x0002F8, "Wrong size on Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, EntryPoint) == 0x000000, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, CallFunc_PostEventAttachedActor_ReturnValue) == 0x000008, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::CallFunc_PostEventAttachedActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, ___bool_Has_Been_Initd_Variable) == 0x000010, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, ___bool_IsClosed_Variable) == 0x000011, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000014, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, CallFunc_BreakVector_X) == 0x000024, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, CallFunc_BreakVector_Y) == 0x000028, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, CallFunc_BreakVector_Z) == 0x00002C, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000030, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, CallFunc_MakeVector_ReturnValue) == 0x000034, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, CallFunc_GetSkillLevel_ReturnValue) == 0x000040, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::CallFunc_GetSkillLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, K2Node_Event_Who) == 0x000048, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::K2Node_Event_Who' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, K2Node_Event_Killer) == 0x000050, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::K2Node_Event_Killer' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, K2Node_Event_HealthChangeValue) == 0x000058, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::K2Node_Event_HealthChangeValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000208, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, CallFunc_IsClient_ReturnValue) == 0x000214, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::CallFunc_IsClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, CallFunc_Add_VectorVector_ReturnValue) == 0x000218, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000228, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, CallFunc_IsClient_ReturnValue_1) == 0x000230, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::CallFunc_IsClient_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000234, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x000240, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, CallFunc_PostEventAttachedActor_ReturnValue_1) == 0x000248, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::CallFunc_PostEventAttachedActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, CallFunc_IsClient_ReturnValue_2) == 0x000250, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::CallFunc_IsClient_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000251, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, CallFunc_VLerp_ReturnValue) == 0x000254, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000260, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01, CallFunc_SpawnGameEmitterAtLocation_ReturnValue) == 0x0002F0, "Member 'Trap_Mon_106_Skill01_C_ExecuteUbergraph_Trap_Mon_106_Skill01::CallFunc_SpawnGameEmitterAtLocation_ReturnValue' has a wrong offset!");

}

