#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Girl014b_Skill04_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trap_Girl014b_Skill04_01.Trap_Girl014b_Skill04_01_C
// 0x0060 (0x17D0 - 0x1770)
class ATrap_Girl014b_Skill04_01_C final : public ATrap
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1770(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAbilityCollision_Sphere*               AbilityCollision_Sphere;                           // 0x1778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         ReleaseCount;                                      // 0x1780(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReleaseMaxCount;                                   // 0x1784(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NewVar_0;                                          // 0x1788(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NewVar_1;                                          // 0x1790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        E_girl014b_skill04_06;                             // 0x1798(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        E_girl014b_skill04_04_p;                           // 0x17B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          End;                                               // 0x17C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void Server_OnActive();
	void Client_OnActive();
	void BP_ClientPlayTrapEndExhibition();
	void OwnerDead(bool bDead, class UAbilityComponentBase* InLauncher, const struct FHealthChangeValue& HealthChangeData);
	void BP_OnTrapLeave(bool bDead);
	void ExecuteUbergraph_Trap_Girl014b_Skill04_01(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_Girl014b_Skill04_01_C">();
	}
	static class ATrap_Girl014b_Skill04_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_Girl014b_Skill04_01_C>();
	}
};
static_assert(alignof(ATrap_Girl014b_Skill04_01_C) == 0x000010, "Wrong alignment on ATrap_Girl014b_Skill04_01_C");
static_assert(sizeof(ATrap_Girl014b_Skill04_01_C) == 0x0017D0, "Wrong size on ATrap_Girl014b_Skill04_01_C");
static_assert(offsetof(ATrap_Girl014b_Skill04_01_C, UberGraphFrame) == 0x001770, "Member 'ATrap_Girl014b_Skill04_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_Girl014b_Skill04_01_C, AbilityCollision_Sphere) == 0x001778, "Member 'ATrap_Girl014b_Skill04_01_C::AbilityCollision_Sphere' has a wrong offset!");
static_assert(offsetof(ATrap_Girl014b_Skill04_01_C, ReleaseCount) == 0x001780, "Member 'ATrap_Girl014b_Skill04_01_C::ReleaseCount' has a wrong offset!");
static_assert(offsetof(ATrap_Girl014b_Skill04_01_C, ReleaseMaxCount) == 0x001784, "Member 'ATrap_Girl014b_Skill04_01_C::ReleaseMaxCount' has a wrong offset!");
static_assert(offsetof(ATrap_Girl014b_Skill04_01_C, NewVar_0) == 0x001788, "Member 'ATrap_Girl014b_Skill04_01_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(ATrap_Girl014b_Skill04_01_C, NewVar_1) == 0x001790, "Member 'ATrap_Girl014b_Skill04_01_C::NewVar_1' has a wrong offset!");
static_assert(offsetof(ATrap_Girl014b_Skill04_01_C, E_girl014b_skill04_06) == 0x001798, "Member 'ATrap_Girl014b_Skill04_01_C::E_girl014b_skill04_06' has a wrong offset!");
static_assert(offsetof(ATrap_Girl014b_Skill04_01_C, E_girl014b_skill04_04_p) == 0x0017B0, "Member 'ATrap_Girl014b_Skill04_01_C::E_girl014b_skill04_04_p' has a wrong offset!");
static_assert(offsetof(ATrap_Girl014b_Skill04_01_C, End) == 0x0017C8, "Member 'ATrap_Girl014b_Skill04_01_C::End' has a wrong offset!");

}

