#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Mon_109_Skill01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trap_Mon_109_Skill01.Trap_Mon_109_Skill01_C
// 0x0050 (0x1740 - 0x16F0)
class ATrap_Mon_109_Skill01_C final : public ATrap
{
public:
	uint8                                         Pad_16E8[0x8];                                     // 0x16E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x16F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        TrapSocketL;                                       // 0x16F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        TrapSocketR;                                       // 0x1700(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        TrapSocket;                                        // 0x1708(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x1710(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocationR;                                         // 0x171C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocationL;                                         // 0x1728(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Distance;                                          // 0x1734(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TrapLoopTimer;                                     // 0x1738(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void Update();
	void Server_OnActive();
	void Client_OnActive();
	void BP_ClientPlayTrapEndExhibition();
	void ExecuteUbergraph_Trap_Mon_109_Skill01(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_Mon_109_Skill01_C">();
	}
	static class ATrap_Mon_109_Skill01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_Mon_109_Skill01_C>();
	}
};
static_assert(alignof(ATrap_Mon_109_Skill01_C) == 0x000010, "Wrong alignment on ATrap_Mon_109_Skill01_C");
static_assert(sizeof(ATrap_Mon_109_Skill01_C) == 0x001740, "Wrong size on ATrap_Mon_109_Skill01_C");
static_assert(offsetof(ATrap_Mon_109_Skill01_C, UberGraphFrame) == 0x0016F0, "Member 'ATrap_Mon_109_Skill01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_109_Skill01_C, TrapSocketL) == 0x0016F8, "Member 'ATrap_Mon_109_Skill01_C::TrapSocketL' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_109_Skill01_C, TrapSocketR) == 0x001700, "Member 'ATrap_Mon_109_Skill01_C::TrapSocketR' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_109_Skill01_C, TrapSocket) == 0x001708, "Member 'ATrap_Mon_109_Skill01_C::TrapSocket' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_109_Skill01_C, Location) == 0x001710, "Member 'ATrap_Mon_109_Skill01_C::Location' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_109_Skill01_C, LocationR) == 0x00171C, "Member 'ATrap_Mon_109_Skill01_C::LocationR' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_109_Skill01_C, LocationL) == 0x001728, "Member 'ATrap_Mon_109_Skill01_C::LocationL' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_109_Skill01_C, Distance) == 0x001734, "Member 'ATrap_Mon_109_Skill01_C::Distance' has a wrong offset!");
static_assert(offsetof(ATrap_Mon_109_Skill01_C, TrapLoopTimer) == 0x001738, "Member 'ATrap_Mon_109_Skill01_C::TrapLoopTimer' has a wrong offset!");

}

