#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Boss_203_Stage01_Break

#include "Basic.hpp"


namespace SDK::Params
{

// Function Trap_Boss_203_Stage01_Break.Trap_Boss_203_Stage01_Break_C.OwnerCastSpecificSkill
// 0x0020 (0x0020 - 0x0000)
struct Trap_Boss_203_Stage01_Break_C_OwnerCastSpecificSkill final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OriginSkills;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UGameAbilityComponent*                  AbilityRef;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Boss_203_Stage01_Break_C_OwnerCastSpecificSkill) == 0x000008, "Wrong alignment on Trap_Boss_203_Stage01_Break_C_OwnerCastSpecificSkill");
static_assert(sizeof(Trap_Boss_203_Stage01_Break_C_OwnerCastSpecificSkill) == 0x000020, "Wrong size on Trap_Boss_203_Stage01_Break_C_OwnerCastSpecificSkill");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_OwnerCastSpecificSkill, SkillID) == 0x000000, "Member 'Trap_Boss_203_Stage01_Break_C_OwnerCastSpecificSkill::SkillID' has a wrong offset!");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_OwnerCastSpecificSkill, OriginSkills) == 0x000008, "Member 'Trap_Boss_203_Stage01_Break_C_OwnerCastSpecificSkill::OriginSkills' has a wrong offset!");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_OwnerCastSpecificSkill, AbilityRef) == 0x000018, "Member 'Trap_Boss_203_Stage01_Break_C_OwnerCastSpecificSkill::AbilityRef' has a wrong offset!");

// Function Trap_Boss_203_Stage01_Break.Trap_Boss_203_Stage01_Break_C.BP_OnDead
// 0x0008 (0x0008 - 0x0000)
struct Trap_Boss_203_Stage01_Break_C_BP_OnDead final
{
public:
	class UAbilityComponentBase*                  Killer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Boss_203_Stage01_Break_C_BP_OnDead) == 0x000008, "Wrong alignment on Trap_Boss_203_Stage01_Break_C_BP_OnDead");
static_assert(sizeof(Trap_Boss_203_Stage01_Break_C_BP_OnDead) == 0x000008, "Wrong size on Trap_Boss_203_Stage01_Break_C_BP_OnDead");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_BP_OnDead, Killer) == 0x000000, "Member 'Trap_Boss_203_Stage01_Break_C_BP_OnDead::Killer' has a wrong offset!");

// Function Trap_Boss_203_Stage01_Break.Trap_Boss_203_Stage01_Break_C.OwnerSpecificSkillEnd
// 0x0004 (0x0004 - 0x0000)
struct Trap_Boss_203_Stage01_Break_C_OwnerSpecificSkillEnd final
{
public:
	int32                                         SkillID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Boss_203_Stage01_Break_C_OwnerSpecificSkillEnd) == 0x000004, "Wrong alignment on Trap_Boss_203_Stage01_Break_C_OwnerSpecificSkillEnd");
static_assert(sizeof(Trap_Boss_203_Stage01_Break_C_OwnerSpecificSkillEnd) == 0x000004, "Wrong size on Trap_Boss_203_Stage01_Break_C_OwnerSpecificSkillEnd");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_OwnerSpecificSkillEnd, SkillID) == 0x000000, "Member 'Trap_Boss_203_Stage01_Break_C_OwnerSpecificSkillEnd::SkillID' has a wrong offset!");

// Function Trap_Boss_203_Stage01_Break.Trap_Boss_203_Stage01_Break_C.ExecuteUbergraph_Trap_Boss_203_Stage01_Break
// 0x0090 (0x0090 - 0x0000)
struct Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SkillID, TArray<int32>& OriginSkills, class UGameAbilityComponent* AbilityRef)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 SkillID)>                K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Boss_203_C*                         K2Node_DynamicCast_AsBP_Boss_203;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponentBase*                  K2Node_Event_Killer;                               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_SkillID_1;                      // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_CustomEvent_OriginSkills;                   // 0x0058(0x0010)(ConstParm, ReferenceParm)
	class UGameAbilityComponent*                  K2Node_CustomEvent_AbilityRef;                     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_SkillID;                        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnGameEmitterAttached_ReturnValue;     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsDead_ReturnValue;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsClient_ReturnValue;                     // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break) == 0x000008, "Wrong alignment on Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break");
static_assert(sizeof(Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break) == 0x000090, "Wrong size on Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break, EntryPoint) == 0x000000, "Member 'Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break, K2Node_DynamicCast_AsBP_Boss_203) == 0x000028, "Member 'Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break::K2Node_DynamicCast_AsBP_Boss_203' has a wrong offset!");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000034, "Member 'Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break, K2Node_Event_Killer) == 0x000038, "Member 'Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break::K2Node_Event_Killer' has a wrong offset!");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break, K2Node_DynamicCast_AsGame_Player) == 0x000048, "Member 'Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break::K2Node_DynamicCast_AsGame_Player' has a wrong offset!");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break, K2Node_CustomEvent_SkillID_1) == 0x000054, "Member 'Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break::K2Node_CustomEvent_SkillID_1' has a wrong offset!");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break, K2Node_CustomEvent_OriginSkills) == 0x000058, "Member 'Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break::K2Node_CustomEvent_OriginSkills' has a wrong offset!");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break, K2Node_CustomEvent_AbilityRef) == 0x000068, "Member 'Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break::K2Node_CustomEvent_AbilityRef' has a wrong offset!");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000071, "Member 'Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break, K2Node_CustomEvent_SkillID) == 0x000074, "Member 'Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break::K2Node_CustomEvent_SkillID' has a wrong offset!");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000078, "Member 'Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break, CallFunc_SpawnGameEmitterAttached_ReturnValue) == 0x000080, "Member 'Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break::CallFunc_SpawnGameEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break, CallFunc_K2_IsDead_ReturnValue) == 0x000088, "Member 'Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break::CallFunc_K2_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break, CallFunc_Not_PreBool_ReturnValue) == 0x000089, "Member 'Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break, CallFunc_IsClient_ReturnValue) == 0x00008A, "Member 'Trap_Boss_203_Stage01_Break_C_ExecuteUbergraph_Trap_Boss_203_Stage01_Break::CallFunc_IsClient_ReturnValue' has a wrong offset!");

}

