#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Girl02_Skill03

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Trap_Girl02_Skill03.Trap_Girl02_Skill03_C.GetSpawnLocAndRot
// 0x0178 (0x0178 - 0x0000)
struct Trap_Girl02_Skill03_C_GetSpawnLocAndRot final
{
public:
	struct FVector                                Loc;                                               // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rot;                                               // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Z;                                                 // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RandLoc;                                           // 0x001C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable;                                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         ___object_Variable;                                // 0x0080(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_CapsuleTraceSingle_OutHit;                // 0x00C0(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_CapsuleTraceSingle_ReturnValue;           // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot) == 0x000008, "Wrong alignment on Trap_Girl02_Skill03_C_GetSpawnLocAndRot");
static_assert(sizeof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot) == 0x000178, "Wrong size on Trap_Girl02_Skill03_C_GetSpawnLocAndRot");
static_assert(offsetof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot, Loc) == 0x000000, "Member 'Trap_Girl02_Skill03_C_GetSpawnLocAndRot::Loc' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot, Rot) == 0x00000C, "Member 'Trap_Girl02_Skill03_C_GetSpawnLocAndRot::Rot' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot, Z) == 0x000018, "Member 'Trap_Girl02_Skill03_C_GetSpawnLocAndRot::Z' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot, RandLoc) == 0x00001C, "Member 'Trap_Girl02_Skill03_C_GetSpawnLocAndRot::RandLoc' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot, CallFunc_RandomFloatInRange_ReturnValue) == 0x000028, "Member 'Trap_Girl02_Skill03_C_GetSpawnLocAndRot::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot, CallFunc_MakeVector_ReturnValue) == 0x00002C, "Member 'Trap_Girl02_Skill03_C_GetSpawnLocAndRot::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot, CallFunc_RandomUnitVector_ReturnValue) == 0x000038, "Member 'Trap_Girl02_Skill03_C_GetSpawnLocAndRot::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000044, "Member 'Trap_Girl02_Skill03_C_GetSpawnLocAndRot::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot, ___int_Variable) == 0x000050, "Member 'Trap_Girl02_Skill03_C_GetSpawnLocAndRot::___int_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot, CallFunc_Normal_ReturnValue) == 0x000054, "Member 'Trap_Girl02_Skill03_C_GetSpawnLocAndRot::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000060, "Member 'Trap_Girl02_Skill03_C_GetSpawnLocAndRot::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00006C, "Member 'Trap_Girl02_Skill03_C_GetSpawnLocAndRot::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'Trap_Girl02_Skill03_C_GetSpawnLocAndRot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000074, "Member 'Trap_Girl02_Skill03_C_GetSpawnLocAndRot::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot, ___object_Variable) == 0x000080, "Member 'Trap_Girl02_Skill03_C_GetSpawnLocAndRot::___object_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000090, "Member 'Trap_Girl02_Skill03_C_GetSpawnLocAndRot::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot, CallFunc_Add_VectorVector_ReturnValue) == 0x00009C, "Member 'Trap_Girl02_Skill03_C_GetSpawnLocAndRot::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000A8, "Member 'Trap_Girl02_Skill03_C_GetSpawnLocAndRot::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000B4, "Member 'Trap_Girl02_Skill03_C_GetSpawnLocAndRot::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot, CallFunc_CapsuleTraceSingle_OutHit) == 0x0000C0, "Member 'Trap_Girl02_Skill03_C_GetSpawnLocAndRot::CallFunc_CapsuleTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot, CallFunc_CapsuleTraceSingle_ReturnValue) == 0x00014C, "Member 'Trap_Girl02_Skill03_C_GetSpawnLocAndRot::CallFunc_CapsuleTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000150, "Member 'Trap_Girl02_Skill03_C_GetSpawnLocAndRot::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot, CallFunc_Normal_ReturnValue_1) == 0x00015C, "Member 'Trap_Girl02_Skill03_C_GetSpawnLocAndRot::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_GetSpawnLocAndRot, CallFunc_MakeRotFromX_ReturnValue) == 0x000168, "Member 'Trap_Girl02_Skill03_C_GetSpawnLocAndRot::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");

// Function Trap_Girl02_Skill03.Trap_Girl02_Skill03_C.OnEmitterApplyMagic_Event_0
// 0x0028 (0x0028 - 0x0000)
struct Trap_Girl02_Skill03_C_OnEmitterApplyMagic_Event_0 final
{
public:
	int32                                         EmitterID;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ApplyTarget;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OriginLocation;                                    // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x001C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Girl02_Skill03_C_OnEmitterApplyMagic_Event_0) == 0x000008, "Wrong alignment on Trap_Girl02_Skill03_C_OnEmitterApplyMagic_Event_0");
static_assert(sizeof(Trap_Girl02_Skill03_C_OnEmitterApplyMagic_Event_0) == 0x000028, "Wrong size on Trap_Girl02_Skill03_C_OnEmitterApplyMagic_Event_0");
static_assert(offsetof(Trap_Girl02_Skill03_C_OnEmitterApplyMagic_Event_0, EmitterID) == 0x000000, "Member 'Trap_Girl02_Skill03_C_OnEmitterApplyMagic_Event_0::EmitterID' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_OnEmitterApplyMagic_Event_0, ApplyTarget) == 0x000008, "Member 'Trap_Girl02_Skill03_C_OnEmitterApplyMagic_Event_0::ApplyTarget' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_OnEmitterApplyMagic_Event_0, OriginLocation) == 0x000010, "Member 'Trap_Girl02_Skill03_C_OnEmitterApplyMagic_Event_0::OriginLocation' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_OnEmitterApplyMagic_Event_0, BoneName) == 0x00001C, "Member 'Trap_Girl02_Skill03_C_OnEmitterApplyMagic_Event_0::BoneName' has a wrong offset!");

// Function Trap_Girl02_Skill03.Trap_Girl02_Skill03_C.ExecuteUbergraph_Trap_Girl02_Skill03
// 0x0030 (0x0030 - 0x0000)
struct Trap_Girl02_Skill03_C_ExecuteUbergraph_Trap_Girl02_Skill03 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_EmitterID;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_ApplyTarget;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_OriginLocation;                 // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSkillLevel_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClient_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Girl02_Skill03_C_ExecuteUbergraph_Trap_Girl02_Skill03) == 0x000008, "Wrong alignment on Trap_Girl02_Skill03_C_ExecuteUbergraph_Trap_Girl02_Skill03");
static_assert(sizeof(Trap_Girl02_Skill03_C_ExecuteUbergraph_Trap_Girl02_Skill03) == 0x000030, "Wrong size on Trap_Girl02_Skill03_C_ExecuteUbergraph_Trap_Girl02_Skill03");
static_assert(offsetof(Trap_Girl02_Skill03_C_ExecuteUbergraph_Trap_Girl02_Skill03, EntryPoint) == 0x000000, "Member 'Trap_Girl02_Skill03_C_ExecuteUbergraph_Trap_Girl02_Skill03::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_ExecuteUbergraph_Trap_Girl02_Skill03, K2Node_CustomEvent_EmitterID) == 0x000004, "Member 'Trap_Girl02_Skill03_C_ExecuteUbergraph_Trap_Girl02_Skill03::K2Node_CustomEvent_EmitterID' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_ExecuteUbergraph_Trap_Girl02_Skill03, K2Node_CustomEvent_ApplyTarget) == 0x000008, "Member 'Trap_Girl02_Skill03_C_ExecuteUbergraph_Trap_Girl02_Skill03::K2Node_CustomEvent_ApplyTarget' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_ExecuteUbergraph_Trap_Girl02_Skill03, K2Node_CustomEvent_OriginLocation) == 0x000010, "Member 'Trap_Girl02_Skill03_C_ExecuteUbergraph_Trap_Girl02_Skill03::K2Node_CustomEvent_OriginLocation' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_ExecuteUbergraph_Trap_Girl02_Skill03, K2Node_CustomEvent_BoneName) == 0x00001C, "Member 'Trap_Girl02_Skill03_C_ExecuteUbergraph_Trap_Girl02_Skill03::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_ExecuteUbergraph_Trap_Girl02_Skill03, CallFunc_GetSkillLevel_ReturnValue) == 0x000024, "Member 'Trap_Girl02_Skill03_C_ExecuteUbergraph_Trap_Girl02_Skill03::CallFunc_GetSkillLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl02_Skill03_C_ExecuteUbergraph_Trap_Girl02_Skill03, CallFunc_IsClient_ReturnValue) == 0x000028, "Member 'Trap_Girl02_Skill03_C_ExecuteUbergraph_Trap_Girl02_Skill03::CallFunc_IsClient_ReturnValue' has a wrong offset!");

}

