#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Scene_ExplosiveMagnet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Trap_Scene_ExplosiveMagnet.Trap_Scene_ExplosiveMagnet_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct Trap_Scene_ExplosiveMagnet_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Scene_ExplosiveMagnet_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on Trap_Scene_ExplosiveMagnet_C_ReceiveEndPlay");
static_assert(sizeof(Trap_Scene_ExplosiveMagnet_C_ReceiveEndPlay) == 0x000001, "Wrong size on Trap_Scene_ExplosiveMagnet_C_ReceiveEndPlay");
static_assert(offsetof(Trap_Scene_ExplosiveMagnet_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'Trap_Scene_ExplosiveMagnet_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function Trap_Scene_ExplosiveMagnet.Trap_Scene_ExplosiveMagnet_C.ExecuteUbergraph_Trap_Scene_ExplosiveMagnet
// 0x0038 (0x0038 - 0x0000)
struct Trap_Scene_ExplosiveMagnet_C_ExecuteUbergraph_Trap_Scene_ExplosiveMagnet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnGameNiagaraAtLocation_ReturnValue;   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Scene_ExplosiveMagnet_C_ExecuteUbergraph_Trap_Scene_ExplosiveMagnet) == 0x000008, "Wrong alignment on Trap_Scene_ExplosiveMagnet_C_ExecuteUbergraph_Trap_Scene_ExplosiveMagnet");
static_assert(sizeof(Trap_Scene_ExplosiveMagnet_C_ExecuteUbergraph_Trap_Scene_ExplosiveMagnet) == 0x000038, "Wrong size on Trap_Scene_ExplosiveMagnet_C_ExecuteUbergraph_Trap_Scene_ExplosiveMagnet");
static_assert(offsetof(Trap_Scene_ExplosiveMagnet_C_ExecuteUbergraph_Trap_Scene_ExplosiveMagnet, EntryPoint) == 0x000000, "Member 'Trap_Scene_ExplosiveMagnet_C_ExecuteUbergraph_Trap_Scene_ExplosiveMagnet::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Scene_ExplosiveMagnet_C_ExecuteUbergraph_Trap_Scene_ExplosiveMagnet, K2Node_Event_EndPlayReason) == 0x000004, "Member 'Trap_Scene_ExplosiveMagnet_C_ExecuteUbergraph_Trap_Scene_ExplosiveMagnet::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(Trap_Scene_ExplosiveMagnet_C_ExecuteUbergraph_Trap_Scene_ExplosiveMagnet, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'Trap_Scene_ExplosiveMagnet_C_ExecuteUbergraph_Trap_Scene_ExplosiveMagnet::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Scene_ExplosiveMagnet_C_ExecuteUbergraph_Trap_Scene_ExplosiveMagnet, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000014, "Member 'Trap_Scene_ExplosiveMagnet_C_ExecuteUbergraph_Trap_Scene_ExplosiveMagnet::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Scene_ExplosiveMagnet_C_ExecuteUbergraph_Trap_Scene_ExplosiveMagnet, CallFunc_Add_VectorVector_ReturnValue) == 0x000020, "Member 'Trap_Scene_ExplosiveMagnet_C_ExecuteUbergraph_Trap_Scene_ExplosiveMagnet::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Scene_ExplosiveMagnet_C_ExecuteUbergraph_Trap_Scene_ExplosiveMagnet, CallFunc_SpawnGameNiagaraAtLocation_ReturnValue) == 0x000030, "Member 'Trap_Scene_ExplosiveMagnet_C_ExecuteUbergraph_Trap_Scene_ExplosiveMagnet::CallFunc_SpawnGameNiagaraAtLocation_ReturnValue' has a wrong offset!");

}

