#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Girl002a_Skill03

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Trap_Girl002a_Skill03.Trap_Girl002a_Skill03_C.ExecuteUbergraph_Trap_Girl002a_Skill03
// 0x00B0 (0x00B0 - 0x0000)
struct Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseSystemManager*                    CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseComponent*                        CallFunc_PostEventAttachedActor_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSkillLevel_ReturnValue;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_GetPiFuGDPL_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClient_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_FindWwiseReplacePathString_ReturnValue;   // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UWwiseComponent*                        CallFunc_PostEventAttachedActor_ReturnValue_1;     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0xC];                                       // 0x0064(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GameSpawnActorFromClassPath_ReturnValue;  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03) == 0x000010, "Wrong alignment on Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03");
static_assert(sizeof(Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03) == 0x0000B0, "Wrong size on Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03");
static_assert(offsetof(Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03, EntryPoint) == 0x000000, "Member 'Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000008, "Member 'Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000010, "Member 'Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03, CallFunc_PostEventAttachedActor_ReturnValue) == 0x000020, "Member 'Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03::CallFunc_PostEventAttachedActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03, CallFunc_GetSkillLevel_ReturnValue) == 0x000028, "Member 'Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03::CallFunc_GetSkillLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03, CallFunc_GetPiFuGDPL_ReturnValue) == 0x000030, "Member 'Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03::CallFunc_GetPiFuGDPL_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03, CallFunc_IsClient_ReturnValue) == 0x000038, "Member 'Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03::CallFunc_IsClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03, CallFunc_FindWwiseReplacePathString_ReturnValue) == 0x000040, "Member 'Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03::CallFunc_FindWwiseReplacePathString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03, CallFunc_PostEventAttachedActor_ReturnValue_1) == 0x000050, "Member 'Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03::CallFunc_PostEventAttachedActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000058, "Member 'Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03, CallFunc_GameSpawnActorFromClassPath_ReturnValue) == 0x0000A0, "Member 'Trap_Girl002a_Skill03_C_ExecuteUbergraph_Trap_Girl002a_Skill03::CallFunc_GameSpawnActorFromClassPath_ReturnValue' has a wrong offset!");

}

