#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Girl006a_Skill04

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Trap_Girl006a_Skill04.Trap_Girl006a_Skill04_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Trap_Girl006a_Skill04_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Girl006a_Skill04_C_ReceiveTick) == 0x000004, "Wrong alignment on Trap_Girl006a_Skill04_C_ReceiveTick");
static_assert(sizeof(Trap_Girl006a_Skill04_C_ReceiveTick) == 0x000004, "Wrong size on Trap_Girl006a_Skill04_C_ReceiveTick");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Trap_Girl006a_Skill04_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Trap_Girl006a_Skill04.Trap_Girl006a_Skill04_C.ExecuteUbergraph_Trap_Girl006a_Skill04
// 0x0120 (0x0120 - 0x0000)
struct Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0xC];                                       // 0x0064(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVectorValue_ReturnValue;               // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_5;             // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_6;             // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_7;             // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnGameNiagaraAtLocation_ReturnValue;   // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnGameNiagaraAtLocation_ReturnValue_1; // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04) == 0x000010, "Wrong alignment on Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04");
static_assert(sizeof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04) == 0x000120, "Wrong size on Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, EntryPoint) == 0x000000, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_MakeRotator_ReturnValue) == 0x000004, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00002C, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000038, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_BreakVector_X) == 0x000044, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_BreakVector_Y) == 0x000048, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_BreakVector_Z) == 0x00004C, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_Add_FloatFloat_ReturnValue) == 0x000050, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000054, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_GetVectorValue_ReturnValue) == 0x0000A0, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_GetVectorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_BreakTransform_Location) == 0x0000AC, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_BreakTransform_Rotation) == 0x0000B8, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_BreakTransform_Scale) == 0x0000C4, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_BreakRotator_Roll) == 0x0000D0, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_BreakRotator_Pitch) == 0x0000D4, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_BreakRotator_Yaw) == 0x0000D8, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x0000DC, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x0000E0, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000E4, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_Add_FloatFloat_ReturnValue_4) == 0x0000E8, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_Add_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_Add_FloatFloat_ReturnValue_5) == 0x0000EC, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_Add_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_Add_FloatFloat_ReturnValue_6) == 0x0000F0, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_Add_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0000F4, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_Add_FloatFloat_ReturnValue_7) == 0x0000F8, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_Add_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_SpawnGameNiagaraAtLocation_ReturnValue) == 0x000100, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_SpawnGameNiagaraAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000108, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_MakeRotator_ReturnValue_1) == 0x00010C, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04, CallFunc_SpawnGameNiagaraAtLocation_ReturnValue_1) == 0x000118, "Member 'Trap_Girl006a_Skill04_C_ExecuteUbergraph_Trap_Girl006a_Skill04::CallFunc_SpawnGameNiagaraAtLocation_ReturnValue_1' has a wrong offset!");

}

