#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TreasureBoxBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TreasureBoxBase.TreasureBoxBase_C
// 0x0080 (0x0380 - 0x0300)
class ATreasureBoxBase_C final : public AGameInteractorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        GuideNavPos;                                       // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        GuideUIPos;                                        // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUMGDataBaseComponent*                  UMGDataBase;                                       // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 BoxTag;                                            // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UParticleSystem*                        ActiveEffect;                                      // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        OpenEffect;                                        // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeScale;                                         // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOnlyUnlockMove_Shoot;                             // 0x034C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCanInteractOnce;                                  // 0x034D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCanInteract;                                      // 0x034E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34F[0x1];                                      // 0x034F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 InteractWidgetClass;                               // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           UITimerHandle;                                     // 0x0358(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class FString                                 CustomKey;                                         // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class AGamePlayerController*                  PlayerCache;                                       // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayInteractAnim;                                  // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bClearInteractState;                               // 0x0379(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_TreasureBoxBase(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnActive_Change();
	void OnActive_Client();
	void ReceiveEndPlay__Overridden(EEndPlayReason EndPlayReason);
	void Client_OnStopInteracted(class AGamePlayer* Player);
	void Client_OnFinish();
	void Interact_End();
	void StopInteract();
	void ReceiveTick(float DeltaSeconds);
	void Server_OnFinish();
	void Server_OnInteracting();
	void Client_OnInteracting();
	void GetUMG(class Ubox_tag_component_C** UMG);
	void BoxOpenFinish__Overridden();
	void GetInteractionWidgetLua__Overridden(class UUserWidget** Widget);
	void GetInteractionWidget(class UUw_task_interaction_progress_C** Interaction);
	void Stop_Interaction();
	void TriggerHandle__Overridden(bool bIsBeginOverlap, class AActor* OtherActor);
	void InInteracting(bool* bInteracting);
	void ClientStopInteracton(class AGamePlayer* Player);
	void OnActiveChange__Overridden();
	void GetInteractionWidgetLua(class UUserWidget** Widget);
	void BoxOpenFinish();
	void TriggerHandle(bool bIsBeginOverlap, class AActor* OtherActor);
	void OnActiveChange();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void OnTrigger_Client(bool bIsBeginOverlap, class AActor* OtherActor);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TreasureBoxBase_C">();
	}
	static class ATreasureBoxBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATreasureBoxBase_C>();
	}
};
static_assert(alignof(ATreasureBoxBase_C) == 0x000008, "Wrong alignment on ATreasureBoxBase_C");
static_assert(sizeof(ATreasureBoxBase_C) == 0x000380, "Wrong size on ATreasureBoxBase_C");
static_assert(offsetof(ATreasureBoxBase_C, UberGraphFrame) == 0x000300, "Member 'ATreasureBoxBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATreasureBoxBase_C, GuideNavPos) == 0x000308, "Member 'ATreasureBoxBase_C::GuideNavPos' has a wrong offset!");
static_assert(offsetof(ATreasureBoxBase_C, GuideUIPos) == 0x000310, "Member 'ATreasureBoxBase_C::GuideUIPos' has a wrong offset!");
static_assert(offsetof(ATreasureBoxBase_C, UMGDataBase) == 0x000318, "Member 'ATreasureBoxBase_C::UMGDataBase' has a wrong offset!");
static_assert(offsetof(ATreasureBoxBase_C, DefaultSceneRoot) == 0x000320, "Member 'ATreasureBoxBase_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ATreasureBoxBase_C, BoxTag) == 0x000328, "Member 'ATreasureBoxBase_C::BoxTag' has a wrong offset!");
static_assert(offsetof(ATreasureBoxBase_C, ActiveEffect) == 0x000338, "Member 'ATreasureBoxBase_C::ActiveEffect' has a wrong offset!");
static_assert(offsetof(ATreasureBoxBase_C, OpenEffect) == 0x000340, "Member 'ATreasureBoxBase_C::OpenEffect' has a wrong offset!");
static_assert(offsetof(ATreasureBoxBase_C, TimeScale) == 0x000348, "Member 'ATreasureBoxBase_C::TimeScale' has a wrong offset!");
static_assert(offsetof(ATreasureBoxBase_C, bOnlyUnlockMove_Shoot) == 0x00034C, "Member 'ATreasureBoxBase_C::bOnlyUnlockMove_Shoot' has a wrong offset!");
static_assert(offsetof(ATreasureBoxBase_C, bCanInteractOnce) == 0x00034D, "Member 'ATreasureBoxBase_C::bCanInteractOnce' has a wrong offset!");
static_assert(offsetof(ATreasureBoxBase_C, bCanInteract) == 0x00034E, "Member 'ATreasureBoxBase_C::bCanInteract' has a wrong offset!");
static_assert(offsetof(ATreasureBoxBase_C, InteractWidgetClass) == 0x000350, "Member 'ATreasureBoxBase_C::InteractWidgetClass' has a wrong offset!");
static_assert(offsetof(ATreasureBoxBase_C, UITimerHandle) == 0x000358, "Member 'ATreasureBoxBase_C::UITimerHandle' has a wrong offset!");
static_assert(offsetof(ATreasureBoxBase_C, CustomKey) == 0x000360, "Member 'ATreasureBoxBase_C::CustomKey' has a wrong offset!");
static_assert(offsetof(ATreasureBoxBase_C, PlayerCache) == 0x000370, "Member 'ATreasureBoxBase_C::PlayerCache' has a wrong offset!");
static_assert(offsetof(ATreasureBoxBase_C, PlayInteractAnim) == 0x000378, "Member 'ATreasureBoxBase_C::PlayInteractAnim' has a wrong offset!");
static_assert(offsetof(ATreasureBoxBase_C, bClearInteractState) == 0x000379, "Member 'ATreasureBoxBase_C::bClearInteractState' has a wrong offset!");

}

