#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TreasureBoxBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TreasureBoxBase.TreasureBoxBase_C
// 0x0080 (0x0380 - 0x0300)
class ATreasureBoxBase_C : public AGameInteractorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        GuideNavPos;                                       // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        GuideUIPos;                                        // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUMGDataBaseComponent*                  UMGDataBase;                                       // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 BoxTag;                                            // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UParticleSystem*                        ActiveEffect;                                      // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        OpenEffect;                                        // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeScale;                                         // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOnlyUnlockMove_Shoot;                             // 0x034C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCanInteractOnce;                                  // 0x034D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCanInteract;                                      // 0x034E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34F[0x1];                                      // 0x034F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 InteractWidgetClass;                               // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           UITimerHandle;                                     // 0x0358(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class FString                                 CustomKey;                                         // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class AGamePlayerController*                  PlayerCache;                                       // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayInteractAnim;                                  // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bClearInteractState;                               // 0x0379(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void OnActiveChange__Overridden();
	void ClientStopInteracton(class AGamePlayer* Player);
	void InInteracting(bool* bInteracting);
	void TriggerHandle__Overridden(bool bIsBeginOverlap, class AActor* OtherActor);
	void Stop_Interaction();
	void GetInteractionWidget(class Uuw_task_interaction_progress_C** Interaction);
	void GetInteractionWidgetLua__Overridden(class UUserWidget** Widget);
	void BoxOpenFinish__Overridden();
	void GetUMG(class Ubox_tag_component_C** UMG);
	void Client_OnInteracting();
	void Server_OnInteracting();
	void Server_OnFinish();
	void ReceiveTick(float DeltaSeconds);
	void StopInteract();
	void Interact_End();
	void Client_OnFinish();
	void Client_OnStopInteracted(class AGamePlayer* Player);
	void ReceiveEndPlay__Overridden(EEndPlayReason EndPlayReason);
	void OnActive_Client();
	void OnActive_Change();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_TreasureBoxBase(int32 EntryPoint);
	void OnActiveChange();
	void GetInteractionWidgetLua(class UUserWidget** Widget);
	void BoxOpenFinish();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void TriggerHandle(bool bIsBeginOverlap, class AActor* OtherActor);
	void OnTrigger_Client(bool bIsBeginOverlap, class AActor* OtherActor);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("TreasureBoxBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TreasureBoxBase_C")
	}
	static class ATreasureBoxBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATreasureBoxBase_C>();
	}
};
DUMPER7_ASSERTS_ATreasureBoxBase_C;

}

