#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TwostFogOringin_Str

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct 2stFogOringin_Str.2stFogOringin_Str
// 0x0024 (0x0024 - 0x0000)
struct FTwostFogOringin_Str final
{
public:
	float                                         Ori2stFogHeightFade_58_6687ECC244FD6AC4009D3FAE8CE9E0D4; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Ori2stFogDensity_61_596A1B3E40EEF19E9B81629D60150EB7; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Ori2stFogHeightMax_59_1FDEB4084846588AE20742806E5C5E3C; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Ori2stFogHeightMin_60_7AF476264396A5FCF659C8AD2BCB4721; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Ori2stFogHeightOffset_62_B0D37F6B4AEB01071E97E0963A85C119; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Ori2stFogColor_65_F0E32F5B4C8C0065801EDDA8FFB5AB33; // 0x0014(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FTwostFogOringin_Str) == 0x000004, "Wrong alignment on FTwostFogOringin_Str");
static_assert(sizeof(FTwostFogOringin_Str) == 0x000024, "Wrong size on FTwostFogOringin_Str");
static_assert(offsetof(FTwostFogOringin_Str, Ori2stFogHeightFade_58_6687ECC244FD6AC4009D3FAE8CE9E0D4) == 0x000000, "Member 'FTwostFogOringin_Str::Ori2stFogHeightFade_58_6687ECC244FD6AC4009D3FAE8CE9E0D4' has a wrong offset!");
static_assert(offsetof(FTwostFogOringin_Str, Ori2stFogDensity_61_596A1B3E40EEF19E9B81629D60150EB7) == 0x000004, "Member 'FTwostFogOringin_Str::Ori2stFogDensity_61_596A1B3E40EEF19E9B81629D60150EB7' has a wrong offset!");
static_assert(offsetof(FTwostFogOringin_Str, Ori2stFogHeightMax_59_1FDEB4084846588AE20742806E5C5E3C) == 0x000008, "Member 'FTwostFogOringin_Str::Ori2stFogHeightMax_59_1FDEB4084846588AE20742806E5C5E3C' has a wrong offset!");
static_assert(offsetof(FTwostFogOringin_Str, Ori2stFogHeightMin_60_7AF476264396A5FCF659C8AD2BCB4721) == 0x00000C, "Member 'FTwostFogOringin_Str::Ori2stFogHeightMin_60_7AF476264396A5FCF659C8AD2BCB4721' has a wrong offset!");
static_assert(offsetof(FTwostFogOringin_Str, Ori2stFogHeightOffset_62_B0D37F6B4AEB01071E97E0963A85C119) == 0x000010, "Member 'FTwostFogOringin_Str::Ori2stFogHeightOffset_62_B0D37F6B4AEB01071E97E0963A85C119' has a wrong offset!");
static_assert(offsetof(FTwostFogOringin_Str, Ori2stFogColor_65_F0E32F5B4C8C0065801EDDA8FFB5AB33) == 0x000014, "Member 'FTwostFogOringin_Str::Ori2stFogColor_65_F0E32F5B4C8C0065801EDDA8FFB5AB33' has a wrong offset!");

}

