#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TwostFogInSide_Str

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct 2stFogInSide_Str.2stFogInSide_Str
// 0x0024 (0x0024 - 0x0000)
struct FTwostFogInSide_Str final
{
public:
	struct FLinearColor                           TwostFogColor_10_10A8C169403BF9323A8352A0CABF2570; // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogDensity_19_5A7B97A44B74856A173B9B91BC195F8F; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogHeightMax_15_C2139FEA4C262DB3595E47BB44610C31; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogHeightMin_17_02132B054CA6346ACC15D79762DEA58D; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogHeightFade_13_2CE96AB74093C71775CD1C833A64D18C; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwostFogHeightOffset_21_F2148D6045391D7E3CC25388DD73AC4E; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FTwostFogInSide_Str) == 0x000004, "Wrong alignment on FTwostFogInSide_Str");
static_assert(sizeof(FTwostFogInSide_Str) == 0x000024, "Wrong size on FTwostFogInSide_Str");
static_assert(offsetof(FTwostFogInSide_Str, TwostFogColor_10_10A8C169403BF9323A8352A0CABF2570) == 0x000000, "Member 'FTwostFogInSide_Str::TwostFogColor_10_10A8C169403BF9323A8352A0CABF2570' has a wrong offset!");
static_assert(offsetof(FTwostFogInSide_Str, TwostFogDensity_19_5A7B97A44B74856A173B9B91BC195F8F) == 0x000010, "Member 'FTwostFogInSide_Str::TwostFogDensity_19_5A7B97A44B74856A173B9B91BC195F8F' has a wrong offset!");
static_assert(offsetof(FTwostFogInSide_Str, TwostFogHeightMax_15_C2139FEA4C262DB3595E47BB44610C31) == 0x000014, "Member 'FTwostFogInSide_Str::TwostFogHeightMax_15_C2139FEA4C262DB3595E47BB44610C31' has a wrong offset!");
static_assert(offsetof(FTwostFogInSide_Str, TwostFogHeightMin_17_02132B054CA6346ACC15D79762DEA58D) == 0x000018, "Member 'FTwostFogInSide_Str::TwostFogHeightMin_17_02132B054CA6346ACC15D79762DEA58D' has a wrong offset!");
static_assert(offsetof(FTwostFogInSide_Str, TwostFogHeightFade_13_2CE96AB74093C71775CD1C833A64D18C) == 0x00001C, "Member 'FTwostFogInSide_Str::TwostFogHeightFade_13_2CE96AB74093C71775CD1C833A64D18C' has a wrong offset!");
static_assert(offsetof(FTwostFogInSide_Str, TwostFogHeightOffset_21_F2148D6045391D7E3CC25388DD73AC4E) == 0x000020, "Member 'FTwostFogInSide_Str::TwostFogHeightOffset_21_F2148D6045391D7E3CC25388DD73AC4E' has a wrong offset!");

}

