#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_pause

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_pause.umg_pause_C
// 0x0198 (0x0548 - 0x03B0)
class UUmg_pause_C final : public ULuaWidget
{
public:
	class UWidgetAnimation*                       AllEnter;                                          // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCustomButton*                          BtnBossRefresh;                                    // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton*                          BtnBuff;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton*                          BtnBuff_1;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton*                          BtnBuffIntro;                                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton*                          BtnDark;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton*                          BtnGiveUp;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton*                          BtnGiveUp_1;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton*                          BtnGiveUp_2;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton*                          BtnLevelinfo;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton*                          BtnMowLevelInfo;                                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton*                          BtnMowSkill;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton*                          BtnOnhook;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton*                          BtnRes;                                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton*                          BtnReturn;                                         // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton*                          BtnSetUp;                                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgOnhook1;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgOnhook2;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgPause;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Line1;                                             // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Line2;                                             // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelArchiveExit;                                  // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelBossRefresh;                                  // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelBuff;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelBuffIntro;                                    // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelDark;                                         // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelGiveUp;                                       // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelLevelInfo;                                    // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelMowLevelInfo;                                 // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelMowSkill;                                     // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelOnhook;                                       // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelPartyBuff;                                    // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelRes;                                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelSetUp;                                        // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelTryRoleSkill;                                 // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomTextBlock*                       Text;                                              // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomTextBlock*                       TxtArchiveExit;                                    // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomTextBlock*                       TxtBossChallengeRefresh;                           // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomTextBlock*                       TxtBuffIntroBtn;                                   // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomTextBlock*                       TxtDarkRiki;                                       // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomTextBlock*                       TxtFightOnlineBuff;                                // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomTextBlock*                       TxtFightOnlineBuff_1;                              // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomTextBlock*                       TxtFightOnlineRes;                                 // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomTextBlock*                       TxtGiveUp;                                         // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomTextBlock*                       TxtLevelinfo;                                      // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomTextBlock*                       TxtMowLevelInfo;                                   // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomTextBlock*                       TxtMowSkill;                                       // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtOnhook;                                         // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomTextBlock*                       TxtReturn;                                         // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomTextBlock*                       TxtSet;                                            // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomTextBlock*                       TxtTrySkillBtn;                                    // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Destruct();

	class FString GetModuleName() const;
	void WidgetGeometryReadyFrame(int32 Frame) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_pause_C">();
	}
	static class UUmg_pause_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_pause_C>();
	}
};
static_assert(alignof(UUmg_pause_C) == 0x000008, "Wrong alignment on UUmg_pause_C");
static_assert(sizeof(UUmg_pause_C) == 0x000548, "Wrong size on UUmg_pause_C");
static_assert(offsetof(UUmg_pause_C, AllEnter) == 0x0003B0, "Member 'UUmg_pause_C::AllEnter' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, BtnBossRefresh) == 0x0003B8, "Member 'UUmg_pause_C::BtnBossRefresh' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, BtnBuff) == 0x0003C0, "Member 'UUmg_pause_C::BtnBuff' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, BtnBuff_1) == 0x0003C8, "Member 'UUmg_pause_C::BtnBuff_1' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, BtnBuffIntro) == 0x0003D0, "Member 'UUmg_pause_C::BtnBuffIntro' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, BtnDark) == 0x0003D8, "Member 'UUmg_pause_C::BtnDark' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, BtnGiveUp) == 0x0003E0, "Member 'UUmg_pause_C::BtnGiveUp' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, BtnGiveUp_1) == 0x0003E8, "Member 'UUmg_pause_C::BtnGiveUp_1' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, BtnGiveUp_2) == 0x0003F0, "Member 'UUmg_pause_C::BtnGiveUp_2' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, BtnLevelinfo) == 0x0003F8, "Member 'UUmg_pause_C::BtnLevelinfo' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, BtnMowLevelInfo) == 0x000400, "Member 'UUmg_pause_C::BtnMowLevelInfo' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, BtnMowSkill) == 0x000408, "Member 'UUmg_pause_C::BtnMowSkill' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, BtnOnhook) == 0x000410, "Member 'UUmg_pause_C::BtnOnhook' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, BtnRes) == 0x000418, "Member 'UUmg_pause_C::BtnRes' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, BtnReturn) == 0x000420, "Member 'UUmg_pause_C::BtnReturn' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, BtnSetUp) == 0x000428, "Member 'UUmg_pause_C::BtnSetUp' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, ImgOnhook1) == 0x000430, "Member 'UUmg_pause_C::ImgOnhook1' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, ImgOnhook2) == 0x000438, "Member 'UUmg_pause_C::ImgOnhook2' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, ImgPause) == 0x000440, "Member 'UUmg_pause_C::ImgPause' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, Line1) == 0x000448, "Member 'UUmg_pause_C::Line1' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, Line2) == 0x000450, "Member 'UUmg_pause_C::Line2' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, PanelArchiveExit) == 0x000458, "Member 'UUmg_pause_C::PanelArchiveExit' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, PanelBossRefresh) == 0x000460, "Member 'UUmg_pause_C::PanelBossRefresh' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, PanelBuff) == 0x000468, "Member 'UUmg_pause_C::PanelBuff' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, PanelBuffIntro) == 0x000470, "Member 'UUmg_pause_C::PanelBuffIntro' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, PanelDark) == 0x000478, "Member 'UUmg_pause_C::PanelDark' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, PanelGiveUp) == 0x000480, "Member 'UUmg_pause_C::PanelGiveUp' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, PanelLevelInfo) == 0x000488, "Member 'UUmg_pause_C::PanelLevelInfo' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, PanelMowLevelInfo) == 0x000490, "Member 'UUmg_pause_C::PanelMowLevelInfo' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, PanelMowSkill) == 0x000498, "Member 'UUmg_pause_C::PanelMowSkill' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, PanelOnhook) == 0x0004A0, "Member 'UUmg_pause_C::PanelOnhook' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, PanelPartyBuff) == 0x0004A8, "Member 'UUmg_pause_C::PanelPartyBuff' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, PanelRes) == 0x0004B0, "Member 'UUmg_pause_C::PanelRes' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, PanelSetUp) == 0x0004B8, "Member 'UUmg_pause_C::PanelSetUp' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, PanelTryRoleSkill) == 0x0004C0, "Member 'UUmg_pause_C::PanelTryRoleSkill' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, Text) == 0x0004C8, "Member 'UUmg_pause_C::Text' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, TxtArchiveExit) == 0x0004D0, "Member 'UUmg_pause_C::TxtArchiveExit' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, TxtBossChallengeRefresh) == 0x0004D8, "Member 'UUmg_pause_C::TxtBossChallengeRefresh' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, TxtBuffIntroBtn) == 0x0004E0, "Member 'UUmg_pause_C::TxtBuffIntroBtn' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, TxtDarkRiki) == 0x0004E8, "Member 'UUmg_pause_C::TxtDarkRiki' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, TxtFightOnlineBuff) == 0x0004F0, "Member 'UUmg_pause_C::TxtFightOnlineBuff' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, TxtFightOnlineBuff_1) == 0x0004F8, "Member 'UUmg_pause_C::TxtFightOnlineBuff_1' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, TxtFightOnlineRes) == 0x000500, "Member 'UUmg_pause_C::TxtFightOnlineRes' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, TxtGiveUp) == 0x000508, "Member 'UUmg_pause_C::TxtGiveUp' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, TxtLevelinfo) == 0x000510, "Member 'UUmg_pause_C::TxtLevelinfo' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, TxtMowLevelInfo) == 0x000518, "Member 'UUmg_pause_C::TxtMowLevelInfo' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, TxtMowSkill) == 0x000520, "Member 'UUmg_pause_C::TxtMowSkill' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, TxtOnhook) == 0x000528, "Member 'UUmg_pause_C::TxtOnhook' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, TxtReturn) == 0x000530, "Member 'UUmg_pause_C::TxtReturn' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, TxtSet) == 0x000538, "Member 'UUmg_pause_C::TxtSet' has a wrong offset!");
static_assert(offsetof(UUmg_pause_C, TxtTrySkillBtn) == 0x000540, "Member 'UUmg_pause_C::TxtTrySkillBtn' has a wrong offset!");

}

