#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_camerasetting

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function umg_camerasetting.umg_camerasetting_C.GetArmLength
// 0x0038 (0x0038 - 0x0000)
struct Umg_camerasetting_C_GetArmLength final
{
public:
	float                                         Length;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_camerasetting_C_GetArmLength) == 0x000008, "Wrong alignment on Umg_camerasetting_C_GetArmLength");
static_assert(sizeof(Umg_camerasetting_C_GetArmLength) == 0x000038, "Wrong size on Umg_camerasetting_C_GetArmLength");
static_assert(offsetof(Umg_camerasetting_C_GetArmLength, Length) == 0x000000, "Member 'Umg_camerasetting_C_GetArmLength::Length' has a wrong offset!");
static_assert(offsetof(Umg_camerasetting_C_GetArmLength, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'Umg_camerasetting_C_GetArmLength::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_camerasetting_C_GetArmLength, CallFunc_Conv_TextToString_ReturnValue) == 0x000020, "Member 'Umg_camerasetting_C_GetArmLength::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_camerasetting_C_GetArmLength, CallFunc_Conv_StringToFloat_ReturnValue) == 0x000030, "Member 'Umg_camerasetting_C_GetArmLength::CallFunc_Conv_StringToFloat_ReturnValue' has a wrong offset!");

// Function umg_camerasetting.umg_camerasetting_C.UpdateData
// 0x0010 (0x0010 - 0x0000)
struct Umg_camerasetting_C_UpdateData final
{
public:
	float                                         CallFunc_GetArmLength_Length;                      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetXYZ_Local;                             // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_camerasetting_C_UpdateData) == 0x000004, "Wrong alignment on Umg_camerasetting_C_UpdateData");
static_assert(sizeof(Umg_camerasetting_C_UpdateData) == 0x000010, "Wrong size on Umg_camerasetting_C_UpdateData");
static_assert(offsetof(Umg_camerasetting_C_UpdateData, CallFunc_GetArmLength_Length) == 0x000000, "Member 'Umg_camerasetting_C_UpdateData::CallFunc_GetArmLength_Length' has a wrong offset!");
static_assert(offsetof(Umg_camerasetting_C_UpdateData, CallFunc_GetXYZ_Local) == 0x000004, "Member 'Umg_camerasetting_C_UpdateData::CallFunc_GetXYZ_Local' has a wrong offset!");

// Function umg_camerasetting.umg_camerasetting_C.GetXYZ
// 0x00A0 (0x00A0 - 0x0000)
struct Umg_camerasetting_C_GetXYZ final
{
public:
	struct FVector                                Local;                                             // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0010(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0028(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue;           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_1;         // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_2;                    // 0x0068(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_2;         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_camerasetting_C_GetXYZ) == 0x000008, "Wrong alignment on Umg_camerasetting_C_GetXYZ");
static_assert(sizeof(Umg_camerasetting_C_GetXYZ) == 0x0000A0, "Wrong size on Umg_camerasetting_C_GetXYZ");
static_assert(offsetof(Umg_camerasetting_C_GetXYZ, Local) == 0x000000, "Member 'Umg_camerasetting_C_GetXYZ::Local' has a wrong offset!");
static_assert(offsetof(Umg_camerasetting_C_GetXYZ, CallFunc_GetText_ReturnValue) == 0x000010, "Member 'Umg_camerasetting_C_GetXYZ::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_camerasetting_C_GetXYZ, CallFunc_GetText_ReturnValue_1) == 0x000028, "Member 'Umg_camerasetting_C_GetXYZ::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_camerasetting_C_GetXYZ, CallFunc_Conv_TextToString_ReturnValue) == 0x000040, "Member 'Umg_camerasetting_C_GetXYZ::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_camerasetting_C_GetXYZ, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000050, "Member 'Umg_camerasetting_C_GetXYZ::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_camerasetting_C_GetXYZ, CallFunc_Conv_StringToFloat_ReturnValue) == 0x000060, "Member 'Umg_camerasetting_C_GetXYZ::CallFunc_Conv_StringToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_camerasetting_C_GetXYZ, CallFunc_Conv_StringToFloat_ReturnValue_1) == 0x000064, "Member 'Umg_camerasetting_C_GetXYZ::CallFunc_Conv_StringToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_camerasetting_C_GetXYZ, CallFunc_GetText_ReturnValue_2) == 0x000068, "Member 'Umg_camerasetting_C_GetXYZ::CallFunc_GetText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_camerasetting_C_GetXYZ, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000080, "Member 'Umg_camerasetting_C_GetXYZ::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_camerasetting_C_GetXYZ, CallFunc_Conv_StringToFloat_ReturnValue_2) == 0x000090, "Member 'Umg_camerasetting_C_GetXYZ::CallFunc_Conv_StringToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_camerasetting_C_GetXYZ, CallFunc_MakeVector_ReturnValue) == 0x000094, "Member 'Umg_camerasetting_C_GetXYZ::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function umg_camerasetting.umg_camerasetting_C.Get_FovNum_Text_0
// 0x0020 (0x0020 - 0x0000)
struct Umg_camerasetting_C_Get_FovNum_Text_0 final
{
public:
	int32                                         Count_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(Umg_camerasetting_C_Get_FovNum_Text_0) == 0x000008, "Wrong alignment on Umg_camerasetting_C_Get_FovNum_Text_0");
static_assert(sizeof(Umg_camerasetting_C_Get_FovNum_Text_0) == 0x000020, "Wrong size on Umg_camerasetting_C_Get_FovNum_Text_0");
static_assert(offsetof(Umg_camerasetting_C_Get_FovNum_Text_0, Count_0) == 0x000000, "Member 'Umg_camerasetting_C_Get_FovNum_Text_0::Count_0' has a wrong offset!");
static_assert(offsetof(Umg_camerasetting_C_Get_FovNum_Text_0, ReturnValue) == 0x000008, "Member 'Umg_camerasetting_C_Get_FovNum_Text_0::ReturnValue' has a wrong offset!");

// Function umg_camerasetting.umg_camerasetting_C.Update
// 0x11F0 (0x11F0 - 0x0000)
struct Umg_camerasetting_C_Update final
{
public:
	float                                         CallFunc_Array_Get_Item;                           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_1;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_2;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharacterAtrributeTemplate            CallFunc_GetCharacterAttributeTemplate_ReturnValue; // 0x0010(0x0B50)()
	struct FCameraInfo                            K2Node_MakeStruct_CameraInfo;                      // 0x0B60(0x00F0)()
	struct FCameraInfo                            K2Node_MakeStruct_CameraInfo_1;                    // 0x0C50(0x00F0)()
	struct FCameraInfo                            K2Node_MakeStruct_CameraInfo_2;                    // 0x0D40(0x00F0)()
	struct FChangeCameraSetting                   K2Node_MakeStruct_ChangeCameraSetting;             // 0x0E30(0x03C0)()
};
static_assert(alignof(Umg_camerasetting_C_Update) == 0x000008, "Wrong alignment on Umg_camerasetting_C_Update");
static_assert(sizeof(Umg_camerasetting_C_Update) == 0x0011F0, "Wrong size on Umg_camerasetting_C_Update");
static_assert(offsetof(Umg_camerasetting_C_Update, CallFunc_Array_Get_Item) == 0x000000, "Member 'Umg_camerasetting_C_Update::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_camerasetting_C_Update, CallFunc_Array_Get_Item_1) == 0x000004, "Member 'Umg_camerasetting_C_Update::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Umg_camerasetting_C_Update, CallFunc_Array_Get_Item_2) == 0x000008, "Member 'Umg_camerasetting_C_Update::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Umg_camerasetting_C_Update, CallFunc_GetCharacterAttributeTemplate_ReturnValue) == 0x000010, "Member 'Umg_camerasetting_C_Update::CallFunc_GetCharacterAttributeTemplate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_camerasetting_C_Update, K2Node_MakeStruct_CameraInfo) == 0x000B60, "Member 'Umg_camerasetting_C_Update::K2Node_MakeStruct_CameraInfo' has a wrong offset!");
static_assert(offsetof(Umg_camerasetting_C_Update, K2Node_MakeStruct_CameraInfo_1) == 0x000C50, "Member 'Umg_camerasetting_C_Update::K2Node_MakeStruct_CameraInfo_1' has a wrong offset!");
static_assert(offsetof(Umg_camerasetting_C_Update, K2Node_MakeStruct_CameraInfo_2) == 0x000D40, "Member 'Umg_camerasetting_C_Update::K2Node_MakeStruct_CameraInfo_2' has a wrong offset!");
static_assert(offsetof(Umg_camerasetting_C_Update, K2Node_MakeStruct_ChangeCameraSetting) == 0x000E30, "Member 'Umg_camerasetting_C_Update::K2Node_MakeStruct_ChangeCameraSetting' has a wrong offset!");

// Function umg_camerasetting.umg_camerasetting_C.BndEvt__LengthNum_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Umg_camerasetting_C_BndEvt__LengthNum_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Umg_camerasetting_C_BndEvt__LengthNum_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Umg_camerasetting_C_BndEvt__LengthNum_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(Umg_camerasetting_C_BndEvt__LengthNum_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on Umg_camerasetting_C_BndEvt__LengthNum_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(Umg_camerasetting_C_BndEvt__LengthNum_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'Umg_camerasetting_C_BndEvt__LengthNum_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function umg_camerasetting.umg_camerasetting_C.BndEvt__FovNum_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Umg_camerasetting_C_BndEvt__FovNum_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Umg_camerasetting_C_BndEvt__FovNum_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Umg_camerasetting_C_BndEvt__FovNum_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(Umg_camerasetting_C_BndEvt__FovNum_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on Umg_camerasetting_C_BndEvt__FovNum_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(Umg_camerasetting_C_BndEvt__FovNum_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'Umg_camerasetting_C_BndEvt__FovNum_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function umg_camerasetting.umg_camerasetting_C.BndEvt__Chooese_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Umg_camerasetting_C_BndEvt__Chooese_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_camerasetting_C_BndEvt__Chooese_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Umg_camerasetting_C_BndEvt__Chooese_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(Umg_camerasetting_C_BndEvt__Chooese_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on Umg_camerasetting_C_BndEvt__Chooese_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(Umg_camerasetting_C_BndEvt__Chooese_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'Umg_camerasetting_C_BndEvt__Chooese_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(Umg_camerasetting_C_BndEvt__Chooese_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'Umg_camerasetting_C_BndEvt__Chooese_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function umg_camerasetting.umg_camerasetting_C.Tick
// 0x003C (0x003C - 0x0000)
struct Umg_camerasetting_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_camerasetting_C_Tick) == 0x000004, "Wrong alignment on Umg_camerasetting_C_Tick");
static_assert(sizeof(Umg_camerasetting_C_Tick) == 0x00003C, "Wrong size on Umg_camerasetting_C_Tick");
static_assert(offsetof(Umg_camerasetting_C_Tick, MyGeometry) == 0x000000, "Member 'Umg_camerasetting_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_camerasetting_C_Tick, InDeltaTime) == 0x000038, "Member 'Umg_camerasetting_C_Tick::InDeltaTime' has a wrong offset!");

// Function umg_camerasetting.umg_camerasetting_C.BndEvt__X_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Umg_camerasetting_C_BndEvt__X_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Umg_camerasetting_C_BndEvt__X_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Umg_camerasetting_C_BndEvt__X_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(Umg_camerasetting_C_BndEvt__X_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on Umg_camerasetting_C_BndEvt__X_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(Umg_camerasetting_C_BndEvt__X_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'Umg_camerasetting_C_BndEvt__X_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function umg_camerasetting.umg_camerasetting_C.BndEvt__Y_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Umg_camerasetting_C_BndEvt__Y_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Umg_camerasetting_C_BndEvt__Y_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Umg_camerasetting_C_BndEvt__Y_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(Umg_camerasetting_C_BndEvt__Y_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on Umg_camerasetting_C_BndEvt__Y_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(Umg_camerasetting_C_BndEvt__Y_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'Umg_camerasetting_C_BndEvt__Y_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function umg_camerasetting.umg_camerasetting_C.BndEvt__Z_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Umg_camerasetting_C_BndEvt__Z_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Umg_camerasetting_C_BndEvt__Z_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Umg_camerasetting_C_BndEvt__Z_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(Umg_camerasetting_C_BndEvt__Z_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on Umg_camerasetting_C_BndEvt__Z_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(Umg_camerasetting_C_BndEvt__Z_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'Umg_camerasetting_C_BndEvt__Z_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function umg_camerasetting.umg_camerasetting_C.ExecuteUbergraph_umg_camerasetting
// 0x0E68 (0x0E68 - 0x0000)
struct Umg_camerasetting_C_ExecuteUbergraph_umg_camerasetting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameController_C*                   K2Node_DynamicCast_AsBP_Game_Controller;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_4;                 // 0x0040(0x0018)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text_3;                 // 0x0068(0x0018)(ConstParm)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue;           // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_1;         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter_C*                       K2Node_DynamicCast_AsBase_Character;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Array_Get_Item_1;                         // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_2;                         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x00C0(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_1;           // 0x00D8(0x0018)()
	float                                         CallFunc_Array_Get_Item_3;                         // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_2;           // 0x00F8(0x0018)()
	class FString                                 CallFunc_GetOptionAtIndex_ReturnValue;             // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Array_Get_Item_4;                         // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_3;           // 0x0128(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0140(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0168(0x0018)()
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_2;         // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_3;         // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_2;                    // 0x01A0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_3;                    // 0x01C8(0x0018)()
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_4;         // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_5;          // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_5;         // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A[0x2];                                      // 0x021A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x021C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCharacterAtrributeTemplate            CallFunc_GetCharacterAttributeTemplate_ReturnValue; // 0x0258(0x0B50)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0DA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA9[0x7];                                      // 0x0DA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_1;         // 0x0DB0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text_2;                 // 0x0DC0(0x0018)(ConstParm)
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0DD8(0x0018)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_6;          // 0x0DF0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_7;          // 0x0E00(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_6;         // 0x0E10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_7;         // 0x0E14(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0E18(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0E24(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0E30(0x0018)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_8;          // 0x0E48(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_8;         // 0x0E58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0E5C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_camerasetting_C_ExecuteUbergraph_umg_camerasetting) == 0x000008, "Wrong alignment on Umg_camerasetting_C_ExecuteUbergraph_umg_camerasetting");
static_assert(sizeof(Umg_camerasetting_C_ExecuteUbergraph_umg_camerasetting) == 0x000E68, "Wrong size on Umg_camerasetting_C_ExecuteUbergraph_umg_camerasetting");
static_assert(offsetof(Umg_camerasetting_C_ExecuteUbergraph_umg_camerasetting, EntryPoint) == 0x000000, "Member 'Umg_camerasetting_C_ExecuteUbergraph_umg_camerasetting::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_camerasetting_C_ExecuteUbergraph_umg_camerasetting, CallFunc_BreakVector_X) == 0x000004, "Member 'Umg_camerasetting_C_ExecuteUbergraph_umg_camerasetting::CallFunc_BreakVector_X' has a wrong offset!");
