#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: umg_common_connection

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_common_connection.umg_common_connection_C
// 0x0038 (0x03E8 - 0x03B0)
class Uumg_common_connection_C final : public ULuaWidget
{
public:
	class UWidgetAnimation*                       ALLloop;                                           // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AllEnter;                                          // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCircularThrobber*                      CircularThrobber_100;                              // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image;                                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Mask;                                              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Panel;                                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelWait;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Destruct();

	class FString GetModuleName() const;
	void WidgetGeometryReadyFrame(int32 Frame) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("umg_common_connection_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"umg_common_connection_C")
	}
	static class Uumg_common_connection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uumg_common_connection_C>();
	}
};
DUMPER7_ASSERTS_Uumg_common_connection_C;

}

