#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_common_bg_detail

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_common_bg_detail.umg_common_bg_detail_C
// 0x0048 (0x02C8 - 0x0280)
class UUmg_common_bg_detail_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       AllEnter;                                          // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         BG;                                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         BG_1;                                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         BG_2;                                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         BG_3;                                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        BgBlur;                                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton*                          BtnClose;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Whit1;                                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Whit2;                                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_common_bg_detail_C">();
	}
	static class UUmg_common_bg_detail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_common_bg_detail_C>();
	}
};
static_assert(alignof(UUmg_common_bg_detail_C) == 0x000008, "Wrong alignment on UUmg_common_bg_detail_C");
static_assert(sizeof(UUmg_common_bg_detail_C) == 0x0002C8, "Wrong size on UUmg_common_bg_detail_C");
static_assert(offsetof(UUmg_common_bg_detail_C, AllEnter) == 0x000280, "Member 'UUmg_common_bg_detail_C::AllEnter' has a wrong offset!");
static_assert(offsetof(UUmg_common_bg_detail_C, BG) == 0x000288, "Member 'UUmg_common_bg_detail_C::BG' has a wrong offset!");
static_assert(offsetof(UUmg_common_bg_detail_C, BG_1) == 0x000290, "Member 'UUmg_common_bg_detail_C::BG_1' has a wrong offset!");
static_assert(offsetof(UUmg_common_bg_detail_C, BG_2) == 0x000298, "Member 'UUmg_common_bg_detail_C::BG_2' has a wrong offset!");
static_assert(offsetof(UUmg_common_bg_detail_C, BG_3) == 0x0002A0, "Member 'UUmg_common_bg_detail_C::BG_3' has a wrong offset!");
static_assert(offsetof(UUmg_common_bg_detail_C, BgBlur) == 0x0002A8, "Member 'UUmg_common_bg_detail_C::BgBlur' has a wrong offset!");
static_assert(offsetof(UUmg_common_bg_detail_C, BtnClose) == 0x0002B0, "Member 'UUmg_common_bg_detail_C::BtnClose' has a wrong offset!");
static_assert(offsetof(UUmg_common_bg_detail_C, Whit1) == 0x0002B8, "Member 'UUmg_common_bg_detail_C::Whit1' has a wrong offset!");
static_assert(offsetof(UUmg_common_bg_detail_C, Whit2) == 0x0002C0, "Member 'UUmg_common_bg_detail_C::Whit2' has a wrong offset!");

}

