#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_fight_Damage

#include "Basic.hpp"

#include "Game_classes.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_fight_Damage.umg_fight_Damage_C
// 0x00B0 (0x03F8 - 0x0348)
class UUmg_fight_Damage_C final : public UUserWidgetAnimation
{
public:
	class UUw_fight_damage_num_base_C*            Damage;                                            // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       RootCanvasPanel;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUmg_camerasetting_C*                   CameraSetting;                                     // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Exclude;                                           // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bHide;                                             // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bHideAll;                                          // 0x0371(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_372[0x6];                                      // 0x0372(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UWidget*, ESlateVisibility>        Cache;                                             // 0x0378(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class FString>                         Exclude2;                                          // 0x03C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         TempExclude;                                       // 0x03D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector2D                              ___O__;                                            // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_fight_C*                           Fight;                                             // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_fight_Damage_C">();
	}
	static class UUmg_fight_Damage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_fight_Damage_C>();
	}
};
static_assert(alignof(UUmg_fight_Damage_C) == 0x000008, "Wrong alignment on UUmg_fight_Damage_C");
static_assert(sizeof(UUmg_fight_Damage_C) == 0x0003F8, "Wrong size on UUmg_fight_Damage_C");
static_assert(offsetof(UUmg_fight_Damage_C, Damage) == 0x000348, "Member 'UUmg_fight_Damage_C::Damage' has a wrong offset!");
static_assert(offsetof(UUmg_fight_Damage_C, RootCanvasPanel) == 0x000350, "Member 'UUmg_fight_Damage_C::RootCanvasPanel' has a wrong offset!");
static_assert(offsetof(UUmg_fight_Damage_C, CameraSetting) == 0x000358, "Member 'UUmg_fight_Damage_C::CameraSetting' has a wrong offset!");
static_assert(offsetof(UUmg_fight_Damage_C, Exclude) == 0x000360, "Member 'UUmg_fight_Damage_C::Exclude' has a wrong offset!");
static_assert(offsetof(UUmg_fight_Damage_C, bHide) == 0x000370, "Member 'UUmg_fight_Damage_C::bHide' has a wrong offset!");
static_assert(offsetof(UUmg_fight_Damage_C, bHideAll) == 0x000371, "Member 'UUmg_fight_Damage_C::bHideAll' has a wrong offset!");
static_assert(offsetof(UUmg_fight_Damage_C, Cache) == 0x000378, "Member 'UUmg_fight_Damage_C::Cache' has a wrong offset!");
static_assert(offsetof(UUmg_fight_Damage_C, Exclude2) == 0x0003C8, "Member 'UUmg_fight_Damage_C::Exclude2' has a wrong offset!");
static_assert(offsetof(UUmg_fight_Damage_C, TempExclude) == 0x0003D8, "Member 'UUmg_fight_Damage_C::TempExclude' has a wrong offset!");
static_assert(offsetof(UUmg_fight_Damage_C, ___O__) == 0x0003E8, "Member 'UUmg_fight_Damage_C::___O__' has a wrong offset!");
static_assert(offsetof(UUmg_fight_Damage_C, Fight) == 0x0003F0, "Member 'UUmg_fight_Damage_C::Fight' has a wrong offset!");

}

