#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_common_connection

#include "Basic.hpp"


namespace SDK::Params
{

// LuaFunction umg_common_connection.umg_common_connection_C.WidgetGeometryReadyFrame
// 0x0004 (0x0004 - 0x0000)
struct Umg_common_connection_C_WidgetGeometryReadyFrame final
{
public:
	int32                                         Frame;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Umg_common_connection_C_WidgetGeometryReadyFrame) == 0x000004, "Wrong alignment on Umg_common_connection_C_WidgetGeometryReadyFrame");
static_assert(sizeof(Umg_common_connection_C_WidgetGeometryReadyFrame) == 0x000004, "Wrong size on Umg_common_connection_C_WidgetGeometryReadyFrame");
static_assert(offsetof(Umg_common_connection_C_WidgetGeometryReadyFrame, Frame) == 0x000000, "Member 'Umg_common_connection_C_WidgetGeometryReadyFrame::Frame' has a wrong offset!");

// Function umg_common_connection.umg_common_connection_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Umg_common_connection_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Umg_common_connection_C_GetModuleName) == 0x000008, "Wrong alignment on Umg_common_connection_C_GetModuleName");
static_assert(sizeof(Umg_common_connection_C_GetModuleName) == 0x000010, "Wrong size on Umg_common_connection_C_GetModuleName");
static_assert(offsetof(Umg_common_connection_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Umg_common_connection_C_GetModuleName::ReturnValue' has a wrong offset!");

}

