#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_fight

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function umg_fight.umg_fight_C.Get_TxtOnlineNum_Text_0
// 0x0070 (0x0070 - 0x0000)
struct Umg_fight_C_Get_TxtOnlineNum_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayerState*                       K2Node_DynamicCast_AsGame_Player_State;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMultiLevelPoint_ReturnValue;           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
};
static_assert(alignof(Umg_fight_C_Get_TxtOnlineNum_Text_0) == 0x000008, "Wrong alignment on Umg_fight_C_Get_TxtOnlineNum_Text_0");
static_assert(sizeof(Umg_fight_C_Get_TxtOnlineNum_Text_0) == 0x000070, "Wrong size on Umg_fight_C_Get_TxtOnlineNum_Text_0");
static_assert(offsetof(Umg_fight_C_Get_TxtOnlineNum_Text_0, ReturnValue) == 0x000000, "Member 'Umg_fight_C_Get_TxtOnlineNum_Text_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Get_TxtOnlineNum_Text_0, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'Umg_fight_C_Get_TxtOnlineNum_Text_0::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Get_TxtOnlineNum_Text_0, K2Node_DynamicCast_AsGame_Player_State) == 0x000020, "Member 'Umg_fight_C_Get_TxtOnlineNum_Text_0::K2Node_DynamicCast_AsGame_Player_State' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Get_TxtOnlineNum_Text_0, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Umg_fight_C_Get_TxtOnlineNum_Text_0::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Get_TxtOnlineNum_Text_0, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'Umg_fight_C_Get_TxtOnlineNum_Text_0::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Get_TxtOnlineNum_Text_0, CallFunc_GetMultiLevelPoint_ReturnValue) == 0x00002C, "Member 'Umg_fight_C_Get_TxtOnlineNum_Text_0::CallFunc_GetMultiLevelPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Get_TxtOnlineNum_Text_0, CallFunc_Conv_IntToString_ReturnValue) == 0x000030, "Member 'Umg_fight_C_Get_TxtOnlineNum_Text_0::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Get_TxtOnlineNum_Text_0, CallFunc_HasAuthority_ReturnValue) == 0x000040, "Member 'Umg_fight_C_Get_TxtOnlineNum_Text_0::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Get_TxtOnlineNum_Text_0, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'Umg_fight_C_Get_TxtOnlineNum_Text_0::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Get_TxtOnlineNum_Text_0, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'Umg_fight_C_Get_TxtOnlineNum_Text_0::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function umg_fight.umg_fight_C.HideHP
// 0x0038 (0x0038 - 0x0000)
struct Umg_fight_C_HideHP final
{
public:
	bool                                          bHide_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UHPWidgetBase*>                  CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHPWidgetBase*                          CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_fight_C_HideHP) == 0x000008, "Wrong alignment on Umg_fight_C_HideHP");
static_assert(sizeof(Umg_fight_C_HideHP) == 0x000038, "Wrong size on Umg_fight_C_HideHP");
static_assert(offsetof(Umg_fight_C_HideHP, bHide_0) == 0x000000, "Member 'Umg_fight_C_HideHP::bHide_0' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_HideHP, ___int_Array_Index_Variable) == 0x000004, "Member 'Umg_fight_C_HideHP::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_HideHP, ___int_Loop_Counter_Variable) == 0x000008, "Member 'Umg_fight_C_HideHP::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_HideHP, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Umg_fight_C_HideHP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_HideHP, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000010, "Member 'Umg_fight_C_HideHP::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_HideHP, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'Umg_fight_C_HideHP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_HideHP, CallFunc_Array_Get_Item) == 0x000028, "Member 'Umg_fight_C_HideHP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_HideHP, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'Umg_fight_C_HideHP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function umg_fight.umg_fight_C.IsContain
// 0x0038 (0x0038 - 0x0000)
struct Umg_fight_C_IsContain final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bContain;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsContain_bContain;                       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_fight_C_IsContain) == 0x000008, "Wrong alignment on Umg_fight_C_IsContain");
static_assert(sizeof(Umg_fight_C_IsContain) == 0x000038, "Wrong size on Umg_fight_C_IsContain");
static_assert(offsetof(Umg_fight_C_IsContain, InWidget) == 0x000000, "Member 'Umg_fight_C_IsContain::InWidget' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_IsContain, bContain) == 0x000008, "Member 'Umg_fight_C_IsContain::bContain' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_IsContain, CallFunc_GetParent_ReturnValue) == 0x000010, "Member 'Umg_fight_C_IsContain::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_IsContain, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'Umg_fight_C_IsContain::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_IsContain, CallFunc_IsContain_bContain) == 0x000019, "Member 'Umg_fight_C_IsContain::CallFunc_IsContain_bContain' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_IsContain, CallFunc_GetDisplayName_ReturnValue) == 0x000020, "Member 'Umg_fight_C_IsContain::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_IsContain, CallFunc_Array_Contains_ReturnValue) == 0x000030, "Member 'Umg_fight_C_IsContain::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function umg_fight.umg_fight_C.SetWidgetVisbility
// 0x0020 (0x0020 - 0x0000)
struct Umg_fight_C_SetWidgetVisbility final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_Map_Find_Value;                           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_fight_C_SetWidgetVisbility) == 0x000008, "Wrong alignment on Umg_fight_C_SetWidgetVisbility");
static_assert(sizeof(Umg_fight_C_SetWidgetVisbility) == 0x000020, "Wrong size on Umg_fight_C_SetWidgetVisbility");
static_assert(offsetof(Umg_fight_C_SetWidgetVisbility, Widget) == 0x000000, "Member 'Umg_fight_C_SetWidgetVisbility::Widget' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_SetWidgetVisbility, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'Umg_fight_C_SetWidgetVisbility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_SetWidgetVisbility, CallFunc_Map_Find_Value) == 0x000009, "Member 'Umg_fight_C_SetWidgetVisbility::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_SetWidgetVisbility, CallFunc_Map_Find_ReturnValue) == 0x00000A, "Member 'Umg_fight_C_SetWidgetVisbility::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_SetWidgetVisbility, CallFunc_GetParent_ReturnValue) == 0x000010, "Member 'Umg_fight_C_SetWidgetVisbility::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_SetWidgetVisbility, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'Umg_fight_C_SetWidgetVisbility::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function umg_fight.umg_fight_C.DisablePrint
// 0x0010 (0x0010 - 0x0000)
struct Umg_fight_C_DisablePrint final
{
public:
	bool                                          bDisable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_fight_C_DisablePrint) == 0x000008, "Wrong alignment on Umg_fight_C_DisablePrint");
static_assert(sizeof(Umg_fight_C_DisablePrint) == 0x000010, "Wrong size on Umg_fight_C_DisablePrint");
static_assert(offsetof(Umg_fight_C_DisablePrint, bDisable) == 0x000000, "Member 'Umg_fight_C_DisablePrint::bDisable' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_DisablePrint, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'Umg_fight_C_DisablePrint::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

// Function umg_fight.umg_fight_C.Hide
// 0x00B0 (0x00B0 - 0x0000)
struct Umg_fight_C_Hide final
{
public:
	bool                                          bAll;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHide_0;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_2;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_2;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_Map_Keys_Keys;                            // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_Map_Keys_Keys_1;                          // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	ESlateVisibility                              CallFunc_Map_Find_Value;                           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsContain_bContain;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_Map_Keys_Keys_2;                          // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_Map_Find_Value_1;                         // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A3[0x1];                                       // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_fight_C_Hide) == 0x000008, "Wrong alignment on Umg_fight_C_Hide");
static_assert(sizeof(Umg_fight_C_Hide) == 0x0000B0, "Wrong size on Umg_fight_C_Hide");
static_assert(offsetof(Umg_fight_C_Hide, bAll) == 0x000000, "Member 'Umg_fight_C_Hide::bAll' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, bHide_0) == 0x000001, "Member 'Umg_fight_C_Hide::bHide_0' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'Umg_fight_C_Hide::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, ___int_Array_Index_Variable) == 0x000004, "Member 'Umg_fight_C_Hide::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, ___int_Loop_Counter_Variable) == 0x000008, "Member 'Umg_fight_C_Hide::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Umg_fight_C_Hide::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, ___int_Loop_Counter_Variable_1) == 0x000010, "Member 'Umg_fight_C_Hide::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, ___int_Array_Index_Variable_1) == 0x000014, "Member 'Umg_fight_C_Hide::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'Umg_fight_C_Hide::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, ___int_Loop_Counter_Variable_2) == 0x00001C, "Member 'Umg_fight_C_Hide::___int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, CallFunc_Add_IntInt_ReturnValue_2) == 0x000020, "Member 'Umg_fight_C_Hide::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, ___int_Array_Index_Variable_2) == 0x000024, "Member 'Umg_fight_C_Hide::___int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, CallFunc_Map_Keys_Keys) == 0x000028, "Member 'Umg_fight_C_Hide::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, CallFunc_Array_Get_Item) == 0x000038, "Member 'Umg_fight_C_Hide::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, CallFunc_Map_Keys_Keys_1) == 0x000040, "Member 'Umg_fight_C_Hide::CallFunc_Map_Keys_Keys_1' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, CallFunc_Map_Find_Value) == 0x000050, "Member 'Umg_fight_C_Hide::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, CallFunc_Map_Find_ReturnValue) == 0x000051, "Member 'Umg_fight_C_Hide::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'Umg_fight_C_Hide::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'Umg_fight_C_Hide::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'Umg_fight_C_Hide::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, CallFunc_IsContain_bContain) == 0x000068, "Member 'Umg_fight_C_Hide::CallFunc_IsContain_bContain' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, CallFunc_Less_IntInt_ReturnValue) == 0x000069, "Member 'Umg_fight_C_Hide::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, CallFunc_GetDisplayName_ReturnValue) == 0x000070, "Member 'Umg_fight_C_Hide::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, CallFunc_Map_Keys_Keys_2) == 0x000080, "Member 'Umg_fight_C_Hide::CallFunc_Map_Keys_Keys_2' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, CallFunc_Array_Contains_ReturnValue) == 0x000090, "Member 'Umg_fight_C_Hide::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, CallFunc_Array_Get_Item_2) == 0x000098, "Member 'Umg_fight_C_Hide::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, CallFunc_IsValid_ReturnValue_1) == 0x0000A0, "Member 'Umg_fight_C_Hide::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, CallFunc_Map_Find_Value_1) == 0x0000A1, "Member 'Umg_fight_C_Hide::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, CallFunc_Map_Find_ReturnValue_1) == 0x0000A2, "Member 'Umg_fight_C_Hide::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, CallFunc_Array_Length_ReturnValue_1) == 0x0000A4, "Member 'Umg_fight_C_Hide::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, CallFunc_Array_Length_ReturnValue_2) == 0x0000A8, "Member 'Umg_fight_C_Hide::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000AC, "Member 'Umg_fight_C_Hide::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_Hide, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000AD, "Member 'Umg_fight_C_Hide::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function umg_fight.umg_fight_C.AddHide
// 0x0038 (0x0038 - 0x0000)
struct Umg_fight_C_AddHide final
{
public:
	int32                                         ___int_Array_Index_Variable;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllWidget_OutWidgets;                  // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_fight_C_AddHide) == 0x000008, "Wrong alignment on Umg_fight_C_AddHide");
static_assert(sizeof(Umg_fight_C_AddHide) == 0x000038, "Wrong size on Umg_fight_C_AddHide");
static_assert(offsetof(Umg_fight_C_AddHide, ___int_Array_Index_Variable) == 0x000000, "Member 'Umg_fight_C_AddHide::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_AddHide, ___int_Loop_Counter_Variable) == 0x000004, "Member 'Umg_fight_C_AddHide::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_AddHide, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Umg_fight_C_AddHide::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_AddHide, CallFunc_GetAllWidget_OutWidgets) == 0x000010, "Member 'Umg_fight_C_AddHide::CallFunc_GetAllWidget_OutWidgets' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_AddHide, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'Umg_fight_C_AddHide::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_AddHide, CallFunc_Array_Get_Item) == 0x000028, "Member 'Umg_fight_C_AddHide::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_AddHide, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'Umg_fight_C_AddHide::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_AddHide, CallFunc_GetVisibility_ReturnValue) == 0x000031, "Member 'Umg_fight_C_AddHide::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");

// Function umg_fight.umg_fight_C.CustomEvent_2
// 0x0020 (0x0020 - 0x0000)
struct Umg_fight_C_CustomEvent_2 final
{
public:
	struct FQTESwitchParam                        SwitchParam;                                       // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(Umg_fight_C_CustomEvent_2) == 0x000008, "Wrong alignment on Umg_fight_C_CustomEvent_2");
static_assert(sizeof(Umg_fight_C_CustomEvent_2) == 0x000020, "Wrong size on Umg_fight_C_CustomEvent_2");
static_assert(offsetof(Umg_fight_C_CustomEvent_2, SwitchParam) == 0x000000, "Member 'Umg_fight_C_CustomEvent_2::SwitchParam' has a wrong offset!");

// Function umg_fight.umg_fight_C.ExecuteUbergraph_umg_fight
// 0x00E8 (0x00E8 - 0x0000)
struct Umg_fight_C_ExecuteUbergraph_umg_fight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(struct FQTESwitchParam& SwitchParam)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQTESwitchParam                        K2Node_CustomEvent_SwitchParam;                    // 0x0040(0x0020)(ConstParm, NoDestructor)
	class AGamePlayerController*                  K2Node_DynamicCast_AsGame_Player_Controller;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player_1;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayer*                            K2Node_DynamicCast_AsGame_Player_2;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_camerasetting_C*                   CallFunc_Create_ReturnValue;                       // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayerController*                  K2Node_DynamicCast_AsGame_Player_Controller_1;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_fight_C_ExecuteUbergraph_umg_fight) == 0x000008, "Wrong alignment on Umg_fight_C_ExecuteUbergraph_umg_fight");
static_assert(sizeof(Umg_fight_C_ExecuteUbergraph_umg_fight) == 0x0000E8, "Wrong size on Umg_fight_C_ExecuteUbergraph_umg_fight");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, EntryPoint) == 0x000000, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, CallFunc_IsVisible_ReturnValue) == 0x000034, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, CallFunc_Not_PreBool_ReturnValue) == 0x000035, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, CallFunc_Not_PreBool_ReturnValue_1) == 0x000036, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, CallFunc_GetOwningPlayer_ReturnValue) == 0x000038, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, K2Node_CustomEvent_SwitchParam) == 0x000040, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::K2Node_CustomEvent_SwitchParam' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, K2Node_DynamicCast_AsGame_Player_Controller) == 0x000060, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::K2Node_DynamicCast_AsGame_Player_Controller' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, K2Node_DynamicCast_AsGame_Player) == 0x000070, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::K2Node_DynamicCast_AsGame_Player' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000079, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, K2Node_DynamicCast_AsGame_Player_1) == 0x000080, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::K2Node_DynamicCast_AsGame_Player_1' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, K2Node_DynamicCast_bSuccess_2) == 0x000088, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, K2Node_DynamicCast_AsGame_Player_2) == 0x000090, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::K2Node_DynamicCast_AsGame_Player_2' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, K2Node_DynamicCast_bSuccess_3) == 0x000098, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, CallFunc_IsEditor_ReturnValue) == 0x000099, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::CallFunc_IsEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x0000A0, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, CallFunc_Create_ReturnValue) == 0x0000A8, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, K2Node_DynamicCast_AsGame_Character) == 0x0000B8, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, K2Node_DynamicCast_bSuccess_4) == 0x0000C0, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, CallFunc_GetController_ReturnValue) == 0x0000C8, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, CallFunc_IsValid_ReturnValue_1) == 0x0000D0, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, K2Node_DynamicCast_AsGame_Player_Controller_1) == 0x0000D8, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::K2Node_DynamicCast_AsGame_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_ExecuteUbergraph_umg_fight, K2Node_DynamicCast_bSuccess_5) == 0x0000E0, "Member 'Umg_fight_C_ExecuteUbergraph_umg_fight::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");

// LuaFunction umg_fight.umg_fight_C.GetFightPartShow
// 0x0002 (0x0002 - 0x0000)
struct Umg_fight_C_GetFightPartShow final
{
public:
	EFightWidgetPart                              InPart;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Umg_fight_C_GetFightPartShow) == 0x000001, "Wrong alignment on Umg_fight_C_GetFightPartShow");
static_assert(sizeof(Umg_fight_C_GetFightPartShow) == 0x000002, "Wrong size on Umg_fight_C_GetFightPartShow");
static_assert(offsetof(Umg_fight_C_GetFightPartShow, InPart) == 0x000000, "Member 'Umg_fight_C_GetFightPartShow::InPart' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_GetFightPartShow, ReturnValue) == 0x000001, "Member 'Umg_fight_C_GetFightPartShow::ReturnValue' has a wrong offset!");

// LuaFunction umg_fight.umg_fight_C.ShowSkillSelector
// 0x0004 (0x0004 - 0x0000)
struct Umg_fight_C_ShowSkillSelector final
{
public:
	int32                                         SkillIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Umg_fight_C_ShowSkillSelector) == 0x000004, "Wrong alignment on Umg_fight_C_ShowSkillSelector");
static_assert(sizeof(Umg_fight_C_ShowSkillSelector) == 0x000004, "Wrong size on Umg_fight_C_ShowSkillSelector");
static_assert(offsetof(Umg_fight_C_ShowSkillSelector, SkillIndex) == 0x000000, "Member 'Umg_fight_C_ShowSkillSelector::SkillIndex' has a wrong offset!");

// LuaFunction umg_fight.umg_fight_C.UpdateInteractionProgress
// 0x0004 (0x0004 - 0x0000)
struct Umg_fight_C_UpdateInteractionProgress final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Umg_fight_C_UpdateInteractionProgress) == 0x000004, "Wrong alignment on Umg_fight_C_UpdateInteractionProgress");
static_assert(sizeof(Umg_fight_C_UpdateInteractionProgress) == 0x000004, "Wrong size on Umg_fight_C_UpdateInteractionProgress");
static_assert(offsetof(Umg_fight_C_UpdateInteractionProgress, InValue) == 0x000000, "Member 'Umg_fight_C_UpdateInteractionProgress::InValue' has a wrong offset!");

// LuaFunction umg_fight.umg_fight_C.ShowOrHideCross
// 0x0001 (0x0001 - 0x0000)
struct Umg_fight_C_ShowOrHideCross final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Umg_fight_C_ShowOrHideCross) == 0x000001, "Wrong alignment on Umg_fight_C_ShowOrHideCross");
static_assert(sizeof(Umg_fight_C_ShowOrHideCross) == 0x000001, "Wrong size on Umg_fight_C_ShowOrHideCross");
static_assert(offsetof(Umg_fight_C_ShowOrHideCross, bShow) == 0x000000, "Member 'Umg_fight_C_ShowOrHideCross::bShow' has a wrong offset!");

// LuaFunction umg_fight.umg_fight_C.CheckFightPartShow
// 0x0003 (0x0003 - 0x0000)
struct Umg_fight_C_CheckFightPartShow final
{
public:
	EFightWidgetPart                              InPart;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFightWidgetPartHideReason                    InReason;                                          // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Umg_fight_C_CheckFightPartShow) == 0x000001, "Wrong alignment on Umg_fight_C_CheckFightPartShow");
static_assert(sizeof(Umg_fight_C_CheckFightPartShow) == 0x000003, "Wrong size on Umg_fight_C_CheckFightPartShow");
static_assert(offsetof(Umg_fight_C_CheckFightPartShow, InPart) == 0x000000, "Member 'Umg_fight_C_CheckFightPartShow::InPart' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_CheckFightPartShow, InReason) == 0x000001, "Member 'Umg_fight_C_CheckFightPartShow::InReason' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_CheckFightPartShow, ReturnValue) == 0x000002, "Member 'Umg_fight_C_CheckFightPartShow::ReturnValue' has a wrong offset!");

// LuaFunction umg_fight.umg_fight_C.SetFightPartShow
// 0x0004 (0x0004 - 0x0000)
struct Umg_fight_C_SetFightPartShow final
{
public:
	EFightWidgetPart                              InPart;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFightWidgetPartHideReason                    InReason;                                          // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShow;                                             // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bForce;                                            // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Umg_fight_C_SetFightPartShow) == 0x000001, "Wrong alignment on Umg_fight_C_SetFightPartShow");
static_assert(sizeof(Umg_fight_C_SetFightPartShow) == 0x000004, "Wrong size on Umg_fight_C_SetFightPartShow");
static_assert(offsetof(Umg_fight_C_SetFightPartShow, InPart) == 0x000000, "Member 'Umg_fight_C_SetFightPartShow::InPart' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_SetFightPartShow, InReason) == 0x000001, "Member 'Umg_fight_C_SetFightPartShow::InReason' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_SetFightPartShow, bShow) == 0x000002, "Member 'Umg_fight_C_SetFightPartShow::bShow' has a wrong offset!");
static_assert(offsetof(Umg_fight_C_SetFightPartShow, bForce) == 0x000003, "Member 'Umg_fight_C_SetFightPartShow::bForce' has a wrong offset!");

// LuaFunction umg_fight.umg_fight_C.HideSkillSelector
// 0x0004 (0x0004 - 0x0000)
struct Umg_fight_C_HideSkillSelector final
{
public:
	int32                                         SkillIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Umg_fight_C_HideSkillSelector) == 0x000004, "Wrong alignment on Umg_fight_C_HideSkillSelector");
static_assert(sizeof(Umg_fight_C_HideSkillSelector) == 0x000004, "Wrong size on Umg_fight_C_HideSkillSelector");
static_assert(offsetof(Umg_fight_C_HideSkillSelector, SkillIndex) == 0x000000, "Member 'Umg_fight_C_HideSkillSelector::SkillIndex' has a wrong offset!");

// Function umg_fight.umg_fight_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Umg_fight_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Umg_fight_C_GetModuleName) == 0x000008, "Wrong alignment on Umg_fight_C_GetModuleName");
static_assert(sizeof(Umg_fight_C_GetModuleName) == 0x000010, "Wrong size on Umg_fight_C_GetModuleName");
static_assert(offsetof(Umg_fight_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Umg_fight_C_GetModuleName::ReturnValue' has a wrong offset!");

// LuaFunction umg_fight.umg_fight_C.WidgetGeometryReadyFrame
// 0x0004 (0x0004 - 0x0000)
struct Umg_fight_C_WidgetGeometryReadyFrame final
{
public:
	int32                                         Frame;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Umg_fight_C_WidgetGeometryReadyFrame) == 0x000004, "Wrong alignment on Umg_fight_C_WidgetGeometryReadyFrame");
static_assert(sizeof(Umg_fight_C_WidgetGeometryReadyFrame) == 0x000004, "Wrong size on Umg_fight_C_WidgetGeometryReadyFrame");
static_assert(offsetof(Umg_fight_C_WidgetGeometryReadyFrame, Frame) == 0x000000, "Member 'Umg_fight_C_WidgetGeometryReadyFrame::Frame' has a wrong offset!");

}

