#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UniversalCameraPlugin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum UniversalCameraPlugin.ETargetMod
// NumValues: 0x0007
enum class ETargetMod : uint8
{
	TargetMod_None                           = 0,
	TargetMod_CustomValue                    = 1,
	TargetMod_Spline                         = 2,
	TargetMod_Actor                          = 3,
	TargetMod_Socket                         = 4,
	TargetMod_SceneComponent                 = 5,
	TargetMod_MAX                            = 6,
};

// Enum UniversalCameraPlugin.ERotationLimitMode
// NumValues: 0x0003
enum class ERotationLimitMode : uint8
{
	Circle                                   = 0,
	AxisClamp                                = 1,
	ERotationLimitMode_MAX                   = 2,
};

// Enum UniversalCameraPlugin.EEnabledFeatures
// NumValues: 0x0010
enum class EEnabledFeatures : uint16
{
	None                                     = 0,
	Movement                                 = 1,
	Rotation                                 = 2,
	Zoom                                     = 4,
	EdgeScrolling                            = 8,
	ScreenSliding                            = 16,
	OriginCollisions                         = 32,
	SpringArmCollisions                      = 64,
	TerrainHeightAdaptation                  = 128,
	LagMovement                              = 256,
	LagOffset                                = 512,
	LagRotation                              = 1024,
	LagZoom                                  = 2048,
	FollowTarget                             = 4096,
	PreciseMouseDrag                         = 8192,
	EEnabledFeatures_MAX                     = 8193,
};

// Enum UniversalCameraPlugin.EPreciseMouseDragMode
// NumValues: 0x0003
enum class EPreciseMouseDragMode : uint8
{
	Plane                                    = 0,
	TraceToGround                            = 1,
	EPreciseMouseDragMode_MAX                = 2,
};

// Enum UniversalCameraPlugin.EStopFollowingReason
// NumValues: 0x0004
enum class EStopFollowingReason : uint8
{
	StopFollowingReason_Manual               = 0,
	StopFollowingReason_InvalidTarget        = 1,
	StopFollowingReason_DisabledFeature      = 2,
	StopFollowingReason_MAX                  = 3,
};

// Enum UniversalCameraPlugin.ELocationConstrainType
// NumValues: 0x0004
enum class ELocationConstrainType : uint8
{
	NoConstrain                              = 0,
	Sphere                                   = 1,
	Raw                                      = 2,
	ELocationConstrainType_MAX               = 3,
};

// Enum UniversalCameraPlugin.EConstrainType
// NumValues: 0x0004
enum class EConstrainType : uint8
{
	NoConstrain                              = 0,
	MaxDistance                              = 1,
	CustomConstrain                          = 2,
	EConstrainType_MAX                       = 3,
};

// Enum UniversalCameraPlugin.EScreenSlidingType
// NumValues: 0x0008
enum class EScreenSlidingType : uint8
{
	ScreenSliding_None                       = 0,
	SlideCamera                              = 1,
	SlideTargetOffset                        = 2,
	SlideSocketOffset                        = 3,
	SlideYaw                                 = 4,
	SlidePitch                               = 5,
	SlideYawAndPitch                         = 6,
	EScreenSlidingType_MAX                   = 7,
};

// Enum UniversalCameraPlugin.ESimplifiedMovementDirection
// NumValues: 0x000A
enum class ESimplifiedMovementDirection : uint8
{
	MovementDirection_None                   = 0,
	Direction_RightBackward                  = 1,
	Direction_Right                          = 2,
	Direction_RightForward                   = 3,
	Direction_Forward                        = 4,
	Direction_LeftForward                    = 5,
	Direction_Left                           = 6,
	Direction_LeftBackward                   = 7,
	Direction_Backward                       = 8,
	ESimplifiedMovementDirection_MAX         = 9,
};

// Enum UniversalCameraPlugin.EEdgeScrollMode
// NumValues: 0x0004
enum class EEdgeScrollMode : uint8
{
	ScrollMovement                           = 0,
	ScrollTargetOffset                       = 1,
	ScrollSocketOffset                       = 2,
	EEdgeScrollMode_MAX                      = 3,
};

// ScriptStruct UniversalCameraPlugin.TravelSpeedSettings
// 0x000C (0x000C - 0x0000)
struct FTravelSpeedSettings final
{
public:
	bool                                          UseSpeed;                                          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Speed;                                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTravelSpeedSettings) == 0x000004, "Wrong alignment on FTravelSpeedSettings");
static_assert(sizeof(FTravelSpeedSettings) == 0x00000C, "Wrong size on FTravelSpeedSettings");
static_assert(offsetof(FTravelSpeedSettings, UseSpeed) == 0x000000, "Member 'FTravelSpeedSettings::UseSpeed' has a wrong offset!");
static_assert(offsetof(FTravelSpeedSettings, Speed) == 0x000004, "Member 'FTravelSpeedSettings::Speed' has a wrong offset!");
static_assert(offsetof(FTravelSpeedSettings, Duration) == 0x000008, "Member 'FTravelSpeedSettings::Duration' has a wrong offset!");

// ScriptStruct UniversalCameraPlugin.TargetFloat
// 0x0008 (0x0008 - 0x0000)
struct FTargetFloat final
{
public:
	ETargetMod                                    TargetMod;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatValue;                                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTargetFloat) == 0x000004, "Wrong alignment on FTargetFloat");
static_assert(sizeof(FTargetFloat) == 0x000008, "Wrong size on FTargetFloat");
static_assert(offsetof(FTargetFloat, TargetMod) == 0x000000, "Member 'FTargetFloat::TargetMod' has a wrong offset!");
static_assert(offsetof(FTargetFloat, FloatValue) == 0x000004, "Member 'FTargetFloat::FloatValue' has a wrong offset!");

// ScriptStruct UniversalCameraPlugin.UniversalCameraPositionSaveFormat
// 0x0040 (0x0040 - 0x0000)
struct FUniversalCameraPositionSaveFormat final
{
public:
	struct FVector                                DesiredLocation;                                   // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DesiredSocketOffset;                               // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DesiredTargetOffset;                               // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               DesiredRotation;                                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               DesiredRotationOffset;                             // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         DesiredZoom;                                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FUniversalCameraPositionSaveFormat) == 0x000004, "Wrong alignment on FUniversalCameraPositionSaveFormat");
static_assert(sizeof(FUniversalCameraPositionSaveFormat) == 0x000040, "Wrong size on FUniversalCameraPositionSaveFormat");
static_assert(offsetof(FUniversalCameraPositionSaveFormat, DesiredLocation) == 0x000000, "Member 'FUniversalCameraPositionSaveFormat::DesiredLocation' has a wrong offset!");
static_assert(offsetof(FUniversalCameraPositionSaveFormat, DesiredSocketOffset) == 0x00000C, "Member 'FUniversalCameraPositionSaveFormat::DesiredSocketOffset' has a wrong offset!");
static_assert(offsetof(FUniversalCameraPositionSaveFormat, DesiredTargetOffset) == 0x000018, "Member 'FUniversalCameraPositionSaveFormat::DesiredTargetOffset' has a wrong offset!");
static_assert(offsetof(FUniversalCameraPositionSaveFormat, DesiredRotation) == 0x000024, "Member 'FUniversalCameraPositionSaveFormat::DesiredRotation' has a wrong offset!");
static_assert(offsetof(FUniversalCameraPositionSaveFormat, DesiredRotationOffset) == 0x000030, "Member 'FUniversalCameraPositionSaveFormat::DesiredRotationOffset' has a wrong offset!");
static_assert(offsetof(FUniversalCameraPositionSaveFormat, DesiredZoom) == 0x00003C, "Member 'FUniversalCameraPositionSaveFormat::DesiredZoom' has a wrong offset!");

// ScriptStruct UniversalCameraPlugin.OffsetSettings
// 0x0010 (0x0010 - 0x0000)
struct FOffsetSettings final
{
public:
	int32                                         OffsetMod;                                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OffsetValue;                                       // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOffsetSettings) == 0x000004, "Wrong alignment on FOffsetSettings");
static_assert(sizeof(FOffsetSettings) == 0x000010, "Wrong size on FOffsetSettings");
static_assert(offsetof(FOffsetSettings, OffsetMod) == 0x000000, "Member 'FOffsetSettings::OffsetMod' has a wrong offset!");
static_assert(offsetof(FOffsetSettings, OffsetValue) == 0x000004, "Member 'FOffsetSettings::OffsetValue' has a wrong offset!");

// ScriptStruct UniversalCameraPlugin.TargetSettings_WithTemplates
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FTargetSettings_WithTemplates final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTargetSettings_WithTemplates) == 0x000008, "Wrong alignment on FTargetSettings_WithTemplates");
static_assert(sizeof(FTargetSettings_WithTemplates) == 0x000028, "Wrong size on FTargetSettings_WithTemplates");

// ScriptStruct UniversalCameraPlugin.TargetVector
// 0x0020 (0x0020 - 0x0000)
struct FTargetVector final
{
public:
	ETargetMod                                    TargetMod;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineComponent*                       SplineComponent;                                   // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                VectorValue;                                       // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTargetVector) == 0x000008, "Wrong alignment on FTargetVector");
static_assert(sizeof(FTargetVector) == 0x000020, "Wrong size on FTargetVector");
static_assert(offsetof(FTargetVector, TargetMod) == 0x000000, "Member 'FTargetVector::TargetMod' has a wrong offset!");
static_assert(offsetof(FTargetVector, SplineComponent) == 0x000008, "Member 'FTargetVector::SplineComponent' has a wrong offset!");
static_assert(offsetof(FTargetVector, VectorValue) == 0x000010, "Member 'FTargetVector::VectorValue' has a wrong offset!");

// ScriptStruct UniversalCameraPlugin.TargetSettings
// 0x0020 (0x0020 - 0x0000)
struct FTargetSettings final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        SceneComponent;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMeshComponent*                         Mesh;                                              // 0x0010(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Socket;                                            // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTargetSettings) == 0x000008, "Wrong alignment on FTargetSettings");
static_assert(sizeof(FTargetSettings) == 0x000020, "Wrong size on FTargetSettings");
static_assert(offsetof(FTargetSettings, Actor) == 0x000000, "Member 'FTargetSettings::Actor' has a wrong offset!");
static_assert(offsetof(FTargetSettings, SceneComponent) == 0x000008, "Member 'FTargetSettings::SceneComponent' has a wrong offset!");
static_assert(offsetof(FTargetSettings, Mesh) == 0x000010, "Member 'FTargetSettings::Mesh' has a wrong offset!");
static_assert(offsetof(FTargetSettings, Socket) == 0x000018, "Member 'FTargetSettings::Socket' has a wrong offset!");

// ScriptStruct UniversalCameraPlugin.PlaceholderCameraInfos
// 0x0018 (0x0018 - 0x0000)
struct FPlaceholderCameraInfos final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Yaw;                                               // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Pitch;                                             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Zoom;                                              // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPlaceholderCameraInfos) == 0x000004, "Wrong alignment on FPlaceholderCameraInfos");
static_assert(sizeof(FPlaceholderCameraInfos) == 0x000018, "Wrong size on FPlaceholderCameraInfos");
static_assert(offsetof(FPlaceholderCameraInfos, Location) == 0x000000, "Member 'FPlaceholderCameraInfos::Location' has a wrong offset!");
static_assert(offsetof(FPlaceholderCameraInfos, Yaw) == 0x00000C, "Member 'FPlaceholderCameraInfos::Yaw' has a wrong offset!");
static_assert(offsetof(FPlaceholderCameraInfos, Pitch) == 0x000010, "Member 'FPlaceholderCameraInfos::Pitch' has a wrong offset!");
static_assert(offsetof(FPlaceholderCameraInfos, Zoom) == 0x000014, "Member 'FPlaceholderCameraInfos::Zoom' has a wrong offset!");

// ScriptStruct UniversalCameraPlugin.BoolRotation
// 0x0003 (0x0003 - 0x0000)
struct FBoolRotation final
{
public:
	bool                                          Yaw;                                               // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Pitch;                                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Roll;                                              // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBoolRotation) == 0x000001, "Wrong alignment on FBoolRotation");
static_assert(sizeof(FBoolRotation) == 0x000003, "Wrong size on FBoolRotation");
static_assert(offsetof(FBoolRotation, Yaw) == 0x000000, "Member 'FBoolRotation::Yaw' has a wrong offset!");
static_assert(offsetof(FBoolRotation, Pitch) == 0x000001, "Member 'FBoolRotation::Pitch' has a wrong offset!");
static_assert(offsetof(FBoolRotation, Roll) == 0x000002, "Member 'FBoolRotation::Roll' has a wrong offset!");

// ScriptStruct UniversalCameraPlugin.ConstrainVector2
// 0x0003 (0x0003 - 0x0000)
struct FConstrainVector2 final
{
public:
	bool                                          X;                                                 // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Y;                                                 // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Z;                                                 // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConstrainVector2) == 0x000001, "Wrong alignment on FConstrainVector2");
static_assert(sizeof(FConstrainVector2) == 0x000003, "Wrong size on FConstrainVector2");
static_assert(offsetof(FConstrainVector2, X) == 0x000000, "Member 'FConstrainVector2::X' has a wrong offset!");
static_assert(offsetof(FConstrainVector2, Y) == 0x000001, "Member 'FConstrainVector2::Y' has a wrong offset!");
static_assert(offsetof(FConstrainVector2, Z) == 0x000002, "Member 'FConstrainVector2::Z' has a wrong offset!");

// ScriptStruct UniversalCameraPlugin.ConstrainVector
// 0x0003 (0x0003 - 0x0000)
struct FConstrainVector final
{
public:
	bool                                          X;                                                 // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Y;                                                 // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Z;                                                 // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConstrainVector) == 0x000001, "Wrong alignment on FConstrainVector");
static_assert(sizeof(FConstrainVector) == 0x000003, "Wrong size on FConstrainVector");
static_assert(offsetof(FConstrainVector, X) == 0x000000, "Member 'FConstrainVector::X' has a wrong offset!");
static_assert(offsetof(FConstrainVector, Y) == 0x000001, "Member 'FConstrainVector::Y' has a wrong offset!");
static_assert(offsetof(FConstrainVector, Z) == 0x000002, "Member 'FConstrainVector::Z' has a wrong offset!");

// ScriptStruct UniversalCameraPlugin.UniversalCameraInfo
// 0x004C (0x004C - 0x0000)
struct FUniversalCameraInfo final
{
public:
	float                                         Zoom;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConstrainZoomMinimum;                             // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinimumZoom;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConstrainZoomMaximum;                             // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaximumZoom;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERotationLimitMode                            RotationLimitMode;                                 // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxRotationRadiusAngle;                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ConstrainPitch;                                    // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinimumPitch;                                      // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaximumPitch;                                      // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReversePitchRestriction;                           // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ConstrainRoll;                                     // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinimumRoll;                                       // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaximumRoll;                                       // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReverseRollRestriction;                            // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ConstrainYaw;                                      // 0x0035(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinimumYaw;                                        // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaximumYaw;                                        // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReverseYawRestriction;                             // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MovementSpeed;                                     // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotatorSpeed;                                      // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FUniversalCameraInfo) == 0x000004, "Wrong alignment on FUniversalCameraInfo");
static_assert(sizeof(FUniversalCameraInfo) == 0x00004C, "Wrong size on FUniversalCameraInfo");
static_assert(offsetof(FUniversalCameraInfo, Zoom) == 0x000000, "Member 'FUniversalCameraInfo::Zoom' has a wrong offset!");
static_assert(offsetof(FUniversalCameraInfo, bConstrainZoomMinimum) == 0x000004, "Member 'FUniversalCameraInfo::bConstrainZoomMinimum' has a wrong offset!");
static_assert(offsetof(FUniversalCameraInfo, MinimumZoom) == 0x000008, "Member 'FUniversalCameraInfo::MinimumZoom' has a wrong offset!");
static_assert(offsetof(FUniversalCameraInfo, bConstrainZoomMaximum) == 0x00000C, "Member 'FUniversalCameraInfo::bConstrainZoomMaximum' has a wrong offset!");
