#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnLua

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "SeasunAccount_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct UnLua.PropertyCollector
// 0x0008 (0x0008 - 0x0000)
struct FPropertyCollector final
{
public:
	class AGameCharacter*                         None;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel3D*                         None_0;                                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         None_1;                                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerProfile*                         None_2;                                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMail*                                  None_3;                                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemTemplate                          None_4;                                            // 0x0000(0x0130)(HasGetValueTypeHash)
	class UWeaponItem*                            None_5;                                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItem*                                  None_6;                                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterCard*                         None_7;                                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                None_8;                                            // 0x0000(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUIInfo                                None_9;                                            // 0x0000(0x0048)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPropertyCollector;

}

