#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnLua

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SeasunAccount_structs.hpp"


namespace SDK
{

// ScriptStruct UnLua.PropertyCollector
// 0x0008 (0x0008 - 0x0000)
struct FPropertyCollector final
{
public:
	class UCanvasPanel3D*                         None;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         None_0;                                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerProfile*                         None_1;                                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMail*                                  None_2;                                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemTemplate                          None_3;                                            // 0x0000(0x0130)(HasGetValueTypeHash)
	class UItem*                                  None_4;                                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterCard*                         None_5;                                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                None_6;                                            // 0x0000(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUIInfo                                None_7;                                            // 0x0000(0x0048)(HasGetValueTypeHash)
};
static_assert(alignof(FPropertyCollector) == 0x000008, "Wrong alignment on FPropertyCollector");
static_assert(sizeof(FPropertyCollector) == 0x000008, "Wrong size on FPropertyCollector");
static_assert(offsetof(FPropertyCollector, None) == 0x000000, "Member 'FPropertyCollector::None' has a wrong offset!");
static_assert(offsetof(FPropertyCollector, None_0) == 0x000000, "Member 'FPropertyCollector::None_0' has a wrong offset!");
static_assert(offsetof(FPropertyCollector, None_1) == 0x000000, "Member 'FPropertyCollector::None_1' has a wrong offset!");
static_assert(offsetof(FPropertyCollector, None_2) == 0x000000, "Member 'FPropertyCollector::None_2' has a wrong offset!");
static_assert(offsetof(FPropertyCollector, None_3) == 0x000000, "Member 'FPropertyCollector::None_3' has a wrong offset!");
static_assert(offsetof(FPropertyCollector, None_4) == 0x000000, "Member 'FPropertyCollector::None_4' has a wrong offset!");
static_assert(offsetof(FPropertyCollector, None_5) == 0x000000, "Member 'FPropertyCollector::None_5' has a wrong offset!");
static_assert(offsetof(FPropertyCollector, None_6) == 0x000000, "Member 'FPropertyCollector::None_6' has a wrong offset!");
static_assert(offsetof(FPropertyCollector, None_7) == 0x000000, "Member 'FPropertyCollector::None_7' has a wrong offset!");

}

