#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_armor_subitem3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_armor_subitem3.uw_armor_subitem3_C
// 0x0030 (0x02B0 - 0x0280)
class UUw_armor_subitem3_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Armor_updown3;                                     // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Img_Armor3;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img_Armor3_1;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img_Armor3_2;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bPlaying;                                          // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartTime;                                         // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Play();
	void CustomEvent_0();
	void ExecuteUbergraph_uw_armor_subitem3(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_armor_subitem3_C">();
	}
	static class UUw_armor_subitem3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_armor_subitem3_C>();
	}
};
static_assert(alignof(UUw_armor_subitem3_C) == 0x000008, "Wrong alignment on UUw_armor_subitem3_C");
static_assert(sizeof(UUw_armor_subitem3_C) == 0x0002B0, "Wrong size on UUw_armor_subitem3_C");
static_assert(offsetof(UUw_armor_subitem3_C, UberGraphFrame) == 0x000280, "Member 'UUw_armor_subitem3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_armor_subitem3_C, Armor_updown3) == 0x000288, "Member 'UUw_armor_subitem3_C::Armor_updown3' has a wrong offset!");
static_assert(offsetof(UUw_armor_subitem3_C, Img_Armor3) == 0x000290, "Member 'UUw_armor_subitem3_C::Img_Armor3' has a wrong offset!");
static_assert(offsetof(UUw_armor_subitem3_C, Img_Armor3_1) == 0x000298, "Member 'UUw_armor_subitem3_C::Img_Armor3_1' has a wrong offset!");
static_assert(offsetof(UUw_armor_subitem3_C, Img_Armor3_2) == 0x0002A0, "Member 'UUw_armor_subitem3_C::Img_Armor3_2' has a wrong offset!");
static_assert(offsetof(UUw_armor_subitem3_C, bPlaying) == 0x0002A8, "Member 'UUw_armor_subitem3_C::bPlaying' has a wrong offset!");
static_assert(offsetof(UUw_armor_subitem3_C, StartTime) == 0x0002AC, "Member 'UUw_armor_subitem3_C::StartTime' has a wrong offset!");

}

