#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_armor_subitem1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_armor_subitem1.uw_armor_subitem1_C
// 0x0038 (0x02B8 - 0x0280)
class UUw_armor_subitem1_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Armor_leftright;                                   // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Img_Armor2;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img_Armor2_1;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img_Armor2_2;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img_Armor2_3;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bPlaying;                                          // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartTime;                                         // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Play();
	void Construct();
	void CustomEvent_0();
	void ExecuteUbergraph_uw_armor_subitem1(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_armor_subitem1_C">();
	}
	static class UUw_armor_subitem1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_armor_subitem1_C>();
	}
};
static_assert(alignof(UUw_armor_subitem1_C) == 0x000008, "Wrong alignment on UUw_armor_subitem1_C");
static_assert(sizeof(UUw_armor_subitem1_C) == 0x0002B8, "Wrong size on UUw_armor_subitem1_C");
static_assert(offsetof(UUw_armor_subitem1_C, UberGraphFrame) == 0x000280, "Member 'UUw_armor_subitem1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_armor_subitem1_C, Armor_leftright) == 0x000288, "Member 'UUw_armor_subitem1_C::Armor_leftright' has a wrong offset!");
static_assert(offsetof(UUw_armor_subitem1_C, Img_Armor2) == 0x000290, "Member 'UUw_armor_subitem1_C::Img_Armor2' has a wrong offset!");
static_assert(offsetof(UUw_armor_subitem1_C, Img_Armor2_1) == 0x000298, "Member 'UUw_armor_subitem1_C::Img_Armor2_1' has a wrong offset!");
static_assert(offsetof(UUw_armor_subitem1_C, Img_Armor2_2) == 0x0002A0, "Member 'UUw_armor_subitem1_C::Img_Armor2_2' has a wrong offset!");
static_assert(offsetof(UUw_armor_subitem1_C, Img_Armor2_3) == 0x0002A8, "Member 'UUw_armor_subitem1_C::Img_Armor2_3' has a wrong offset!");
static_assert(offsetof(UUw_armor_subitem1_C, bPlaying) == 0x0002B0, "Member 'UUw_armor_subitem1_C::bPlaying' has a wrong offset!");
static_assert(offsetof(UUw_armor_subitem1_C, StartTime) == 0x0002B4, "Member 'UUw_armor_subitem1_C::StartTime' has a wrong offset!");

}

