#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_chess2_label

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_chess2_label.uw_chess2_label_C
// 0x00A8 (0x0458 - 0x03B0)
class UUw_chess2_label_C final : public ULuaWidget
{
public:
	class UWidgetAnimation*                       Anim;                                              // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Add;                                               // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Del;                                               // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         DelImg1;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         DelImg2;                                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         DelImg3;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         DelImg4;                                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         DelImg5;                                           // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         DelImg6;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         DelImg7;                                           // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         DelImg8;                                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         DelImg9;                                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img1;                                              // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img2;                                              // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img3;                                              // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img4;                                              // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img5;                                              // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img6;                                              // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img7;                                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img8;                                              // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img9;                                              // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_chess2_label_C">();
	}
	static class UUw_chess2_label_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_chess2_label_C>();
	}
};
static_assert(alignof(UUw_chess2_label_C) == 0x000008, "Wrong alignment on UUw_chess2_label_C");
static_assert(sizeof(UUw_chess2_label_C) == 0x000458, "Wrong size on UUw_chess2_label_C");
static_assert(offsetof(UUw_chess2_label_C, Anim) == 0x0003B0, "Member 'UUw_chess2_label_C::Anim' has a wrong offset!");
static_assert(offsetof(UUw_chess2_label_C, Add) == 0x0003B8, "Member 'UUw_chess2_label_C::Add' has a wrong offset!");
static_assert(offsetof(UUw_chess2_label_C, Del) == 0x0003C0, "Member 'UUw_chess2_label_C::Del' has a wrong offset!");
static_assert(offsetof(UUw_chess2_label_C, DelImg1) == 0x0003C8, "Member 'UUw_chess2_label_C::DelImg1' has a wrong offset!");
static_assert(offsetof(UUw_chess2_label_C, DelImg2) == 0x0003D0, "Member 'UUw_chess2_label_C::DelImg2' has a wrong offset!");
static_assert(offsetof(UUw_chess2_label_C, DelImg3) == 0x0003D8, "Member 'UUw_chess2_label_C::DelImg3' has a wrong offset!");
static_assert(offsetof(UUw_chess2_label_C, DelImg4) == 0x0003E0, "Member 'UUw_chess2_label_C::DelImg4' has a wrong offset!");
static_assert(offsetof(UUw_chess2_label_C, DelImg5) == 0x0003E8, "Member 'UUw_chess2_label_C::DelImg5' has a wrong offset!");
static_assert(offsetof(UUw_chess2_label_C, DelImg6) == 0x0003F0, "Member 'UUw_chess2_label_C::DelImg6' has a wrong offset!");
static_assert(offsetof(UUw_chess2_label_C, DelImg7) == 0x0003F8, "Member 'UUw_chess2_label_C::DelImg7' has a wrong offset!");
static_assert(offsetof(UUw_chess2_label_C, DelImg8) == 0x000400, "Member 'UUw_chess2_label_C::DelImg8' has a wrong offset!");
static_assert(offsetof(UUw_chess2_label_C, DelImg9) == 0x000408, "Member 'UUw_chess2_label_C::DelImg9' has a wrong offset!");
static_assert(offsetof(UUw_chess2_label_C, Img1) == 0x000410, "Member 'UUw_chess2_label_C::Img1' has a wrong offset!");
static_assert(offsetof(UUw_chess2_label_C, Img2) == 0x000418, "Member 'UUw_chess2_label_C::Img2' has a wrong offset!");
static_assert(offsetof(UUw_chess2_label_C, Img3) == 0x000420, "Member 'UUw_chess2_label_C::Img3' has a wrong offset!");
static_assert(offsetof(UUw_chess2_label_C, Img4) == 0x000428, "Member 'UUw_chess2_label_C::Img4' has a wrong offset!");
static_assert(offsetof(UUw_chess2_label_C, Img5) == 0x000430, "Member 'UUw_chess2_label_C::Img5' has a wrong offset!");
static_assert(offsetof(UUw_chess2_label_C, Img6) == 0x000438, "Member 'UUw_chess2_label_C::Img6' has a wrong offset!");
static_assert(offsetof(UUw_chess2_label_C, Img7) == 0x000440, "Member 'UUw_chess2_label_C::Img7' has a wrong offset!");
static_assert(offsetof(UUw_chess2_label_C, Img8) == 0x000448, "Member 'UUw_chess2_label_C::Img8' has a wrong offset!");
static_assert(offsetof(UUw_chess2_label_C, Img9) == 0x000450, "Member 'UUw_chess2_label_C::Img9' has a wrong offset!");

}

