#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_monster_part_hp2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_monster_part_hp2.uw_fight_monster_part_hp2_C
// 0x00C8 (0x0600 - 0x0538)
class UUw_fight_monster_part_hp2_C final : public UPartHp2
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       VanishRight;                                       // 0x0540(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AppearRight;                                       // 0x0548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       VanishLeft;                                        // 0x0550(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AppearLeft;                                        // 0x0558(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Monsterhp_white;                                   // 0x0560(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           Damage;                                            // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Effect;                                            // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           HP;                                                // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         HpBg1;                                             // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       HpPanel;                                           // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img1;                                              // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img2;                                              // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img3;                                              // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img4;                                              // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelLeft;                                         // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelRight;                                        // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RED1;                                              // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           Shield_1;                                          // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         StateInvincible;                                   // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         StateReduceDown;                                   // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         StateReduceTreat;                                  // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         StateReplyAdd;                                     // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtNum;                                            // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void K2_OnReset();
	void ExecuteUbergraph_uw_fight_monster_part_hp2(int32 EntryPoint);
	void PlayWhiteAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_monster_part_hp2_C">();
	}
	static class UUw_fight_monster_part_hp2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_monster_part_hp2_C>();
	}
};
static_assert(alignof(UUw_fight_monster_part_hp2_C) == 0x000008, "Wrong alignment on UUw_fight_monster_part_hp2_C");
static_assert(sizeof(UUw_fight_monster_part_hp2_C) == 0x000600, "Wrong size on UUw_fight_monster_part_hp2_C");
static_assert(offsetof(UUw_fight_monster_part_hp2_C, UberGraphFrame) == 0x000538, "Member 'UUw_fight_monster_part_hp2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_part_hp2_C, VanishRight) == 0x000540, "Member 'UUw_fight_monster_part_hp2_C::VanishRight' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_part_hp2_C, AppearRight) == 0x000548, "Member 'UUw_fight_monster_part_hp2_C::AppearRight' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_part_hp2_C, VanishLeft) == 0x000550, "Member 'UUw_fight_monster_part_hp2_C::VanishLeft' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_part_hp2_C, AppearLeft) == 0x000558, "Member 'UUw_fight_monster_part_hp2_C::AppearLeft' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_part_hp2_C, Monsterhp_white) == 0x000560, "Member 'UUw_fight_monster_part_hp2_C::Monsterhp_white' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_part_hp2_C, Damage) == 0x000568, "Member 'UUw_fight_monster_part_hp2_C::Damage' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_part_hp2_C, Effect) == 0x000570, "Member 'UUw_fight_monster_part_hp2_C::Effect' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_part_hp2_C, HP) == 0x000578, "Member 'UUw_fight_monster_part_hp2_C::HP' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_part_hp2_C, HpBg1) == 0x000580, "Member 'UUw_fight_monster_part_hp2_C::HpBg1' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_part_hp2_C, HpPanel) == 0x000588, "Member 'UUw_fight_monster_part_hp2_C::HpPanel' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_part_hp2_C, Img1) == 0x000590, "Member 'UUw_fight_monster_part_hp2_C::Img1' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_part_hp2_C, Img2) == 0x000598, "Member 'UUw_fight_monster_part_hp2_C::Img2' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_part_hp2_C, Img3) == 0x0005A0, "Member 'UUw_fight_monster_part_hp2_C::Img3' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_part_hp2_C, Img4) == 0x0005A8, "Member 'UUw_fight_monster_part_hp2_C::Img4' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_part_hp2_C, InvalidationBox_0) == 0x0005B0, "Member 'UUw_fight_monster_part_hp2_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_part_hp2_C, PanelLeft) == 0x0005B8, "Member 'UUw_fight_monster_part_hp2_C::PanelLeft' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_part_hp2_C, PanelRight) == 0x0005C0, "Member 'UUw_fight_monster_part_hp2_C::PanelRight' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_part_hp2_C, RED1) == 0x0005C8, "Member 'UUw_fight_monster_part_hp2_C::RED1' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_part_hp2_C, Shield_1) == 0x0005D0, "Member 'UUw_fight_monster_part_hp2_C::Shield_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_part_hp2_C, StateInvincible) == 0x0005D8, "Member 'UUw_fight_monster_part_hp2_C::StateInvincible' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_part_hp2_C, StateReduceDown) == 0x0005E0, "Member 'UUw_fight_monster_part_hp2_C::StateReduceDown' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_part_hp2_C, StateReduceTreat) == 0x0005E8, "Member 'UUw_fight_monster_part_hp2_C::StateReduceTreat' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_part_hp2_C, StateReplyAdd) == 0x0005F0, "Member 'UUw_fight_monster_part_hp2_C::StateReplyAdd' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_part_hp2_C, TxtNum) == 0x0005F8, "Member 'UUw_fight_monster_part_hp2_C::TxtNum' has a wrong offset!");

}

