#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_fight_grenade_tips

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function uw_fight_grenade_tips.uw_fight_grenade_tips_C.ExecuteUbergraph_uw_fight_grenade_tips
// 0x0040 (0x0040 - 0x0000)
struct uw_fight_grenade_tips_C_ExecuteUbergraph_uw_fight_grenade_tips final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_grenade_tips_C_ExecuteUbergraph_uw_fight_grenade_tips;

// Function uw_fight_grenade_tips.uw_fight_grenade_tips_C.Tick__Overridden
// 0x003C (0x003C - 0x0000)
struct uw_fight_grenade_tips_C_Tick__Overridden final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_grenade_tips_C_Tick__Overridden;

// Function uw_fight_grenade_tips.uw_fight_grenade_tips_C.Play
// 0x0010 (0x0010 - 0x0000)
struct uw_fight_grenade_tips_C_Play final
{
public:
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_grenade_tips_C_Play;

// Function uw_fight_grenade_tips.uw_fight_grenade_tips_C.Stop
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_grenade_tips_C_Stop final
{
public:
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_grenade_tips_C_Stop;

// Function uw_fight_grenade_tips.uw_fight_grenade_tips_C.SetPlaySpeed
// 0x000C (0x000C - 0x0000)
struct uw_fight_grenade_tips_C_SetPlaySpeed final
{
public:
	float                                         InSpeedPre;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_grenade_tips_C_SetPlaySpeed;

// LuaFunction uw_fight_grenade_tips.uw_fight_grenade_tips_C.Tick
// 0x003C (0x003C - 0x0000)
struct uw_fight_grenade_tips_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_grenade_tips_C_Tick;

// LuaFunction uw_fight_grenade_tips.uw_fight_grenade_tips_C.ReceiveWarning
// 0x0008 (0x0008 - 0x0000)
struct uw_fight_grenade_tips_C_ReceiveWarning final
{
public:
	bool                                          IsWarning;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InTotalTime;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_uw_fight_grenade_tips_C_ReceiveWarning;

// Function uw_fight_grenade_tips.uw_fight_grenade_tips_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct uw_fight_grenade_tips_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_grenade_tips_C_GetModuleName;

}

