#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_monitor_girl015

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_monitor_girl015.uw_fight_monitor_girl015_C
// 0x0030 (0x0300 - 0x02D0)
class UUw_fight_monitor_girl015_C final : public UUserWidgetAnimation
{
public:
	class UWidgetAnimation*                       Snow;                                              // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         BarBowIce;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_34;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameNiagaraSystemWidget*               Lizi;                                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelCrossbow;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         VX;                                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Destruct();
	void Construct();
	void K2_OnCustomUmgAnimFinished(const class FString& AnimName);
	void K2_OnUpdate(float InDeltaTime);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_monitor_girl015_C">();
	}
	static class UUw_fight_monitor_girl015_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_monitor_girl015_C>();
	}
};
static_assert(alignof(UUw_fight_monitor_girl015_C) == 0x000008, "Wrong alignment on UUw_fight_monitor_girl015_C");
static_assert(sizeof(UUw_fight_monitor_girl015_C) == 0x000300, "Wrong size on UUw_fight_monitor_girl015_C");
static_assert(offsetof(UUw_fight_monitor_girl015_C, Snow) == 0x0002D0, "Member 'UUw_fight_monitor_girl015_C::Snow' has a wrong offset!");
static_assert(offsetof(UUw_fight_monitor_girl015_C, BarBowIce) == 0x0002D8, "Member 'UUw_fight_monitor_girl015_C::BarBowIce' has a wrong offset!");
static_assert(offsetof(UUw_fight_monitor_girl015_C, Image_34) == 0x0002E0, "Member 'UUw_fight_monitor_girl015_C::Image_34' has a wrong offset!");
static_assert(offsetof(UUw_fight_monitor_girl015_C, Lizi) == 0x0002E8, "Member 'UUw_fight_monitor_girl015_C::Lizi' has a wrong offset!");
static_assert(offsetof(UUw_fight_monitor_girl015_C, PanelCrossbow) == 0x0002F0, "Member 'UUw_fight_monitor_girl015_C::PanelCrossbow' has a wrong offset!");
static_assert(offsetof(UUw_fight_monitor_girl015_C, VX) == 0x0002F8, "Member 'UUw_fight_monitor_girl015_C::VX' has a wrong offset!");

}

