#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_player

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_player.uw_fight_player_C
// 0x00C0 (0x04B8 - 0x03F8)
class UUw_fight_player_C final : public UFightPlayerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       EnergyLoop;                                        // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       EnergyMax;                                         // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUw_fight_player_item_C*                One;                                               // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_player_item_C*                One_1;                                             // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_player_item_C*                One_2;                                             // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_player_item_C*                One_3;                                             // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           BarEnergy;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_166;                                 // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image;                                             // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_3;                                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgEnergyFail;                                     // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgEnergyLoop1;                                    // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgEnergyLoop2;                                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgEnergyLoop3;                                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgEnergyLoop3_1;                                  // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgEnergyLoop3_2;                                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgEnergyMax1;                                     // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgEnergyMax2;                                     // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgMask;                                           // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelEnergyMark;                                   // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtBlock;                                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtNmbMax;                                         // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtNun;                                            // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PlayPowerAnim(bool bFull);
	void K2_OnCustomUmgAnimFinished(const class FName& AnimName);
	void ExecuteUbergraph_uw_fight_player(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_player_C">();
	}
	static class UUw_fight_player_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_player_C>();
	}
};
static_assert(alignof(UUw_fight_player_C) == 0x000008, "Wrong alignment on UUw_fight_player_C");
static_assert(sizeof(UUw_fight_player_C) == 0x0004B8, "Wrong size on UUw_fight_player_C");
static_assert(offsetof(UUw_fight_player_C, UberGraphFrame) == 0x0003F8, "Member 'UUw_fight_player_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_C, EnergyLoop) == 0x000400, "Member 'UUw_fight_player_C::EnergyLoop' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_C, EnergyMax) == 0x000408, "Member 'UUw_fight_player_C::EnergyMax' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_C, One) == 0x000410, "Member 'UUw_fight_player_C::One' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_C, One_1) == 0x000418, "Member 'UUw_fight_player_C::One_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_C, One_2) == 0x000420, "Member 'UUw_fight_player_C::One_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_C, One_3) == 0x000428, "Member 'UUw_fight_player_C::One_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_C, BarEnergy) == 0x000430, "Member 'UUw_fight_player_C::BarEnergy' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_C, HorizontalBox_166) == 0x000438, "Member 'UUw_fight_player_C::HorizontalBox_166' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_C, Image) == 0x000440, "Member 'UUw_fight_player_C::Image' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_C, Image_3) == 0x000448, "Member 'UUw_fight_player_C::Image_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_C, ImgEnergyFail) == 0x000450, "Member 'UUw_fight_player_C::ImgEnergyFail' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_C, ImgEnergyLoop1) == 0x000458, "Member 'UUw_fight_player_C::ImgEnergyLoop1' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_C, ImgEnergyLoop2) == 0x000460, "Member 'UUw_fight_player_C::ImgEnergyLoop2' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_C, ImgEnergyLoop3) == 0x000468, "Member 'UUw_fight_player_C::ImgEnergyLoop3' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_C, ImgEnergyLoop3_1) == 0x000470, "Member 'UUw_fight_player_C::ImgEnergyLoop3_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_C, ImgEnergyLoop3_2) == 0x000478, "Member 'UUw_fight_player_C::ImgEnergyLoop3_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_C, ImgEnergyMax1) == 0x000480, "Member 'UUw_fight_player_C::ImgEnergyMax1' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_C, ImgEnergyMax2) == 0x000488, "Member 'UUw_fight_player_C::ImgEnergyMax2' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_C, ImgMask) == 0x000490, "Member 'UUw_fight_player_C::ImgMask' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_C, PanelEnergyMark) == 0x000498, "Member 'UUw_fight_player_C::PanelEnergyMark' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_C, TxtBlock) == 0x0004A0, "Member 'UUw_fight_player_C::TxtBlock' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_C, TxtNmbMax) == 0x0004A8, "Member 'UUw_fight_player_C::TxtNmbMax' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_C, TxtNun) == 0x0004B0, "Member 'UUw_fight_player_C::TxtNun' has a wrong offset!");

}

