#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_skill_keybtn

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_skill_keybtn.uw_fight_skill_keybtn_C
// 0x0058 (0x02D8 - 0x0280)
class UUw_fight_skill_keybtn_C final : public UUserWidget
{
public:
	class UProgressBar*                           BarLongPress;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HandleBtn;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_68;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgKey;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgKeyAdd;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         KeyBtn;                                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelLongPress;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtAdd;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtAdd_1;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtSkillKey;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtSkillKey1;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Destruct();
	void Construct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_skill_keybtn_C">();
	}
	static class UUw_fight_skill_keybtn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_skill_keybtn_C>();
	}
};
static_assert(alignof(UUw_fight_skill_keybtn_C) == 0x000008, "Wrong alignment on UUw_fight_skill_keybtn_C");
static_assert(sizeof(UUw_fight_skill_keybtn_C) == 0x0002D8, "Wrong size on UUw_fight_skill_keybtn_C");
static_assert(offsetof(UUw_fight_skill_keybtn_C, BarLongPress) == 0x000280, "Member 'UUw_fight_skill_keybtn_C::BarLongPress' has a wrong offset!");
static_assert(offsetof(UUw_fight_skill_keybtn_C, HandleBtn) == 0x000288, "Member 'UUw_fight_skill_keybtn_C::HandleBtn' has a wrong offset!");
static_assert(offsetof(UUw_fight_skill_keybtn_C, Image_68) == 0x000290, "Member 'UUw_fight_skill_keybtn_C::Image_68' has a wrong offset!");
static_assert(offsetof(UUw_fight_skill_keybtn_C, ImgKey) == 0x000298, "Member 'UUw_fight_skill_keybtn_C::ImgKey' has a wrong offset!");
static_assert(offsetof(UUw_fight_skill_keybtn_C, ImgKeyAdd) == 0x0002A0, "Member 'UUw_fight_skill_keybtn_C::ImgKeyAdd' has a wrong offset!");
static_assert(offsetof(UUw_fight_skill_keybtn_C, KeyBtn) == 0x0002A8, "Member 'UUw_fight_skill_keybtn_C::KeyBtn' has a wrong offset!");
static_assert(offsetof(UUw_fight_skill_keybtn_C, PanelLongPress) == 0x0002B0, "Member 'UUw_fight_skill_keybtn_C::PanelLongPress' has a wrong offset!");
static_assert(offsetof(UUw_fight_skill_keybtn_C, TxtAdd) == 0x0002B8, "Member 'UUw_fight_skill_keybtn_C::TxtAdd' has a wrong offset!");
static_assert(offsetof(UUw_fight_skill_keybtn_C, TxtAdd_1) == 0x0002C0, "Member 'UUw_fight_skill_keybtn_C::TxtAdd_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_skill_keybtn_C, TxtSkillKey) == 0x0002C8, "Member 'UUw_fight_skill_keybtn_C::TxtSkillKey' has a wrong offset!");
static_assert(offsetof(UUw_fight_skill_keybtn_C, TxtSkillKey1) == 0x0002D0, "Member 'UUw_fight_skill_keybtn_C::TxtSkillKey1' has a wrong offset!");

}

