#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_auxiliary_aim

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_auxiliary_aim.uw_fight_auxiliary_aim_C
// 0x0038 (0x0380 - 0x0348)
class UUw_fight_auxiliary_aim_C final : public UUserWidgetAnimation
{
public:
	class UWidgetAnimation*                       Disappear;                                         // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appear;                                            // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         LD;                                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         LU;                                                // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelAuxiliary;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RD;                                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RU;                                                // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_auxiliary_aim_C">();
	}
	static class UUw_fight_auxiliary_aim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_auxiliary_aim_C>();
	}
};
static_assert(alignof(UUw_fight_auxiliary_aim_C) == 0x000008, "Wrong alignment on UUw_fight_auxiliary_aim_C");
static_assert(sizeof(UUw_fight_auxiliary_aim_C) == 0x000380, "Wrong size on UUw_fight_auxiliary_aim_C");
static_assert(offsetof(UUw_fight_auxiliary_aim_C, Disappear) == 0x000348, "Member 'UUw_fight_auxiliary_aim_C::Disappear' has a wrong offset!");
static_assert(offsetof(UUw_fight_auxiliary_aim_C, Appear) == 0x000350, "Member 'UUw_fight_auxiliary_aim_C::Appear' has a wrong offset!");
static_assert(offsetof(UUw_fight_auxiliary_aim_C, LD) == 0x000358, "Member 'UUw_fight_auxiliary_aim_C::LD' has a wrong offset!");
static_assert(offsetof(UUw_fight_auxiliary_aim_C, LU) == 0x000360, "Member 'UUw_fight_auxiliary_aim_C::LU' has a wrong offset!");
static_assert(offsetof(UUw_fight_auxiliary_aim_C, PanelAuxiliary) == 0x000368, "Member 'UUw_fight_auxiliary_aim_C::PanelAuxiliary' has a wrong offset!");
static_assert(offsetof(UUw_fight_auxiliary_aim_C, RD) == 0x000370, "Member 'UUw_fight_auxiliary_aim_C::RD' has a wrong offset!");
static_assert(offsetof(UUw_fight_auxiliary_aim_C, RU) == 0x000378, "Member 'UUw_fight_auxiliary_aim_C::RU' has a wrong offset!");

}

