#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_level_star_list

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_level_star_list.uw_fight_level_star_list_C
// 0x0080 (0x0430 - 0x03B0)
class UUw_fight_level_star_list_C final : public ULuaWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Fail;                                              // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fail3;                                             // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Success;                                           // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         ImgOff;                                            // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgOn;                                             // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         OK;                                                // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         OK_1;                                              // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         OK_2;                                              // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         OK_red;                                            // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelOff;                                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelOn;                                           // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UE_ui_fighttask_01_p_C*                 ParticleOn;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtDescOff;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtDescOn;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet__Overridden(class UObject* ListItemObject);
	void ExecuteUbergraph_uw_fight_level_star_list(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnConstruct();
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_level_star_list_C">();
	}
	static class UUw_fight_level_star_list_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_level_star_list_C>();
	}
};
static_assert(alignof(UUw_fight_level_star_list_C) == 0x000008, "Wrong alignment on UUw_fight_level_star_list_C");
static_assert(sizeof(UUw_fight_level_star_list_C) == 0x000430, "Wrong size on UUw_fight_level_star_list_C");
static_assert(offsetof(UUw_fight_level_star_list_C, UberGraphFrame) == 0x0003B0, "Member 'UUw_fight_level_star_list_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_star_list_C, Fail) == 0x0003B8, "Member 'UUw_fight_level_star_list_C::Fail' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_star_list_C, NewAnimation) == 0x0003C0, "Member 'UUw_fight_level_star_list_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_star_list_C, Fail3) == 0x0003C8, "Member 'UUw_fight_level_star_list_C::Fail3' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_star_list_C, Success) == 0x0003D0, "Member 'UUw_fight_level_star_list_C::Success' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_star_list_C, ImgOff) == 0x0003D8, "Member 'UUw_fight_level_star_list_C::ImgOff' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_star_list_C, ImgOn) == 0x0003E0, "Member 'UUw_fight_level_star_list_C::ImgOn' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_star_list_C, OK) == 0x0003E8, "Member 'UUw_fight_level_star_list_C::OK' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_star_list_C, OK_1) == 0x0003F0, "Member 'UUw_fight_level_star_list_C::OK_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_star_list_C, OK_2) == 0x0003F8, "Member 'UUw_fight_level_star_list_C::OK_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_star_list_C, OK_red) == 0x000400, "Member 'UUw_fight_level_star_list_C::OK_red' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_star_list_C, PanelOff) == 0x000408, "Member 'UUw_fight_level_star_list_C::PanelOff' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_star_list_C, PanelOn) == 0x000410, "Member 'UUw_fight_level_star_list_C::PanelOn' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_star_list_C, ParticleOn) == 0x000418, "Member 'UUw_fight_level_star_list_C::ParticleOn' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_star_list_C, TxtDescOff) == 0x000420, "Member 'UUw_fight_level_star_list_C::TxtDescOff' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_star_list_C, TxtDescOn) == 0x000428, "Member 'UUw_fight_level_star_list_C::TxtDescOn' has a wrong offset!");

}

