#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_gainitem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_gainitem.uw_fight_gainitem_C
// 0x0030 (0x03E0 - 0x03B0)
class UUw_fight_gainitem_C final : public ULuaWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Enter;                                             // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Image_55;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgCommon;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgIcon;                                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtGuardNum;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet__Overridden(class UObject* ListItemObject);
	void ExecuteUbergraph_uw_fight_gainitem(int32 EntryPoint);
	void Construct();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnConstruct();
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_gainitem_C">();
	}
	static class UUw_fight_gainitem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_gainitem_C>();
	}
};
static_assert(alignof(UUw_fight_gainitem_C) == 0x000008, "Wrong alignment on UUw_fight_gainitem_C");
static_assert(sizeof(UUw_fight_gainitem_C) == 0x0003E0, "Wrong size on UUw_fight_gainitem_C");
static_assert(offsetof(UUw_fight_gainitem_C, UberGraphFrame) == 0x0003B0, "Member 'UUw_fight_gainitem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_gainitem_C, Enter) == 0x0003B8, "Member 'UUw_fight_gainitem_C::Enter' has a wrong offset!");
static_assert(offsetof(UUw_fight_gainitem_C, Image_55) == 0x0003C0, "Member 'UUw_fight_gainitem_C::Image_55' has a wrong offset!");
static_assert(offsetof(UUw_fight_gainitem_C, ImgCommon) == 0x0003C8, "Member 'UUw_fight_gainitem_C::ImgCommon' has a wrong offset!");
static_assert(offsetof(UUw_fight_gainitem_C, ImgIcon) == 0x0003D0, "Member 'UUw_fight_gainitem_C::ImgIcon' has a wrong offset!");
static_assert(offsetof(UUw_fight_gainitem_C, TxtGuardNum) == 0x0003D8, "Member 'UUw_fight_gainitem_C::TxtGuardNum' has a wrong offset!");

}

