#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_fire_button_aim_new

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_fire_button_aim_new.uw_fight_fire_button_aim_new_C
// 0x0048 (0x0540 - 0x04F8)
class UUw_fight_fire_button_aim_new_C final : public UNewCustomFireButton
{
public:
	class URedirectImage*                         BG;                                                // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Fire;                                              // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_81;                                          // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Mask;                                              // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelPress;                                        // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         PressImg;                                          // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Select;                                            // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Silence;                                           // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bStartAutoFire;                                    // 0x0538(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCurAutoFire;                                      // 0x0539(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bFireButtonDown;                                   // 0x053A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53B[0x1];                                      // 0x053B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         State;                                             // 0x053C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Clear_Player_Action();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_fire_button_aim_new_C">();
	}
	static class UUw_fight_fire_button_aim_new_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_fire_button_aim_new_C>();
	}
};
static_assert(alignof(UUw_fight_fire_button_aim_new_C) == 0x000008, "Wrong alignment on UUw_fight_fire_button_aim_new_C");
static_assert(sizeof(UUw_fight_fire_button_aim_new_C) == 0x000540, "Wrong size on UUw_fight_fire_button_aim_new_C");
static_assert(offsetof(UUw_fight_fire_button_aim_new_C, BG) == 0x0004F8, "Member 'UUw_fight_fire_button_aim_new_C::BG' has a wrong offset!");
static_assert(offsetof(UUw_fight_fire_button_aim_new_C, Fire) == 0x000500, "Member 'UUw_fight_fire_button_aim_new_C::Fire' has a wrong offset!");
static_assert(offsetof(UUw_fight_fire_button_aim_new_C, Image_81) == 0x000508, "Member 'UUw_fight_fire_button_aim_new_C::Image_81' has a wrong offset!");
static_assert(offsetof(UUw_fight_fire_button_aim_new_C, Mask) == 0x000510, "Member 'UUw_fight_fire_button_aim_new_C::Mask' has a wrong offset!");
static_assert(offsetof(UUw_fight_fire_button_aim_new_C, PanelPress) == 0x000518, "Member 'UUw_fight_fire_button_aim_new_C::PanelPress' has a wrong offset!");
static_assert(offsetof(UUw_fight_fire_button_aim_new_C, PressImg) == 0x000520, "Member 'UUw_fight_fire_button_aim_new_C::PressImg' has a wrong offset!");
static_assert(offsetof(UUw_fight_fire_button_aim_new_C, Select) == 0x000528, "Member 'UUw_fight_fire_button_aim_new_C::Select' has a wrong offset!");
static_assert(offsetof(UUw_fight_fire_button_aim_new_C, Silence) == 0x000530, "Member 'UUw_fight_fire_button_aim_new_C::Silence' has a wrong offset!");
static_assert(offsetof(UUw_fight_fire_button_aim_new_C, bStartAutoFire) == 0x000538, "Member 'UUw_fight_fire_button_aim_new_C::bStartAutoFire' has a wrong offset!");
static_assert(offsetof(UUw_fight_fire_button_aim_new_C, bCurAutoFire) == 0x000539, "Member 'UUw_fight_fire_button_aim_new_C::bCurAutoFire' has a wrong offset!");
static_assert(offsetof(UUw_fight_fire_button_aim_new_C, bFireButtonDown) == 0x00053A, "Member 'UUw_fight_fire_button_aim_new_C::bFireButtonDown' has a wrong offset!");
static_assert(offsetof(UUw_fight_fire_button_aim_new_C, State) == 0x00053C, "Member 'UUw_fight_fire_button_aim_new_C::State' has a wrong offset!");

}

