#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_operatebird_skill03

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_operatebird_skill03.uw_fight_operatebird_skill03_C
// 0x00B0 (0x0568 - 0x04B8)
class UUw_fight_operatebird_skill03_C final : public UNewBaseButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Oncdreset;                                         // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Oncd;                                              // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Qta_cd;                                            // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                ButtonUpDown;                                      // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CanvasPanel;                                       // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Container;                                         // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBG;                                             // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgCD;                                             // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgCdBlack;                                        // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgIcon;                                           // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgOnBG;                                           // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_skill_keybtn_C*               KeyBtn;                                            // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         KeyBtnImage;                                       // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Mask;                                              // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelCD;                                           // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelKey;                                          // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         PressImg;                                          // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         QtaMinusimg;                                       // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         QtaMinusimg_1;                                     // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Qtacd;                                             // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtCD;                                             // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__uw_fight_operatebird_skill03_ButtonUpDown_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__uw_fight_operatebird_skill03_ButtonUpDown_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature();
	void K2_OnButtonPress();
	void K2_OnButtonPressUp();
	void ExecuteUbergraph_uw_fight_operatebird_skill03(int32 EntryPoint);
	void K2_OnCustomUmgAnimFinished(const class FName& AnimName);
	void Construct();
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_operatebird_skill03_C">();
	}
	static class UUw_fight_operatebird_skill03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_operatebird_skill03_C>();
	}
};
static_assert(alignof(UUw_fight_operatebird_skill03_C) == 0x000008, "Wrong alignment on UUw_fight_operatebird_skill03_C");
static_assert(sizeof(UUw_fight_operatebird_skill03_C) == 0x000568, "Wrong size on UUw_fight_operatebird_skill03_C");
static_assert(offsetof(UUw_fight_operatebird_skill03_C, UberGraphFrame) == 0x0004B8, "Member 'UUw_fight_operatebird_skill03_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_operatebird_skill03_C, Oncdreset) == 0x0004C0, "Member 'UUw_fight_operatebird_skill03_C::Oncdreset' has a wrong offset!");
static_assert(offsetof(UUw_fight_operatebird_skill03_C, Oncd) == 0x0004C8, "Member 'UUw_fight_operatebird_skill03_C::Oncd' has a wrong offset!");
static_assert(offsetof(UUw_fight_operatebird_skill03_C, Qta_cd) == 0x0004D0, "Member 'UUw_fight_operatebird_skill03_C::Qta_cd' has a wrong offset!");
static_assert(offsetof(UUw_fight_operatebird_skill03_C, ButtonUpDown) == 0x0004D8, "Member 'UUw_fight_operatebird_skill03_C::ButtonUpDown' has a wrong offset!");
static_assert(offsetof(UUw_fight_operatebird_skill03_C, CanvasPanel) == 0x0004E0, "Member 'UUw_fight_operatebird_skill03_C::CanvasPanel' has a wrong offset!");
static_assert(offsetof(UUw_fight_operatebird_skill03_C, Container) == 0x0004E8, "Member 'UUw_fight_operatebird_skill03_C::Container' has a wrong offset!");
static_assert(offsetof(UUw_fight_operatebird_skill03_C, ImgBG) == 0x0004F0, "Member 'UUw_fight_operatebird_skill03_C::ImgBG' has a wrong offset!");
static_assert(offsetof(UUw_fight_operatebird_skill03_C, ImgCD) == 0x0004F8, "Member 'UUw_fight_operatebird_skill03_C::ImgCD' has a wrong offset!");
static_assert(offsetof(UUw_fight_operatebird_skill03_C, ImgCdBlack) == 0x000500, "Member 'UUw_fight_operatebird_skill03_C::ImgCdBlack' has a wrong offset!");
static_assert(offsetof(UUw_fight_operatebird_skill03_C, ImgIcon) == 0x000508, "Member 'UUw_fight_operatebird_skill03_C::ImgIcon' has a wrong offset!");
static_assert(offsetof(UUw_fight_operatebird_skill03_C, ImgOnBG) == 0x000510, "Member 'UUw_fight_operatebird_skill03_C::ImgOnBG' has a wrong offset!");
static_assert(offsetof(UUw_fight_operatebird_skill03_C, KeyBtn) == 0x000518, "Member 'UUw_fight_operatebird_skill03_C::KeyBtn' has a wrong offset!");
static_assert(offsetof(UUw_fight_operatebird_skill03_C, KeyBtnImage) == 0x000520, "Member 'UUw_fight_operatebird_skill03_C::KeyBtnImage' has a wrong offset!");
static_assert(offsetof(UUw_fight_operatebird_skill03_C, Mask) == 0x000528, "Member 'UUw_fight_operatebird_skill03_C::Mask' has a wrong offset!");
static_assert(offsetof(UUw_fight_operatebird_skill03_C, PanelCD) == 0x000530, "Member 'UUw_fight_operatebird_skill03_C::PanelCD' has a wrong offset!");
static_assert(offsetof(UUw_fight_operatebird_skill03_C, PanelKey) == 0x000538, "Member 'UUw_fight_operatebird_skill03_C::PanelKey' has a wrong offset!");
static_assert(offsetof(UUw_fight_operatebird_skill03_C, PressImg) == 0x000540, "Member 'UUw_fight_operatebird_skill03_C::PressImg' has a wrong offset!");
static_assert(offsetof(UUw_fight_operatebird_skill03_C, QtaMinusimg) == 0x000548, "Member 'UUw_fight_operatebird_skill03_C::QtaMinusimg' has a wrong offset!");
static_assert(offsetof(UUw_fight_operatebird_skill03_C, QtaMinusimg_1) == 0x000550, "Member 'UUw_fight_operatebird_skill03_C::QtaMinusimg_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_operatebird_skill03_C, Qtacd) == 0x000558, "Member 'UUw_fight_operatebird_skill03_C::Qtacd' has a wrong offset!");
static_assert(offsetof(UUw_fight_operatebird_skill03_C, TxtCD) == 0x000560, "Member 'UUw_fight_operatebird_skill03_C::TxtCD' has a wrong offset!");

}

