#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_fight_npc_hp

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function uw_fight_npc_hp.uw_fight_npc_hp_C.ExecuteUbergraph_uw_fight_npc_hp
// 0x004C (0x004C - 0x0000)
struct uw_fight_npc_hp_C_ExecuteUbergraph_uw_fight_npc_hp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bLow;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimPlayingFromAnimation_ReturnValue;   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimPlayingFromAnimation_ReturnValue_1; // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Percent;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x000C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_npc_hp_C_ExecuteUbergraph_uw_fight_npc_hp;

// Function uw_fight_npc_hp.uw_fight_npc_hp_C.Tick
// 0x003C (0x003C - 0x0000)
struct uw_fight_npc_hp_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_npc_hp_C_Tick;

// Function uw_fight_npc_hp.uw_fight_npc_hp_C.SetHpPercent
// 0x0004 (0x0004 - 0x0000)
struct uw_fight_npc_hp_C_SetHpPercent final
{
public:
	float                                         Percent;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_npc_hp_C_SetHpPercent;

// Function uw_fight_npc_hp.uw_fight_npc_hp_C.PlayLowAnim
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_npc_hp_C_PlayLowAnim final
{
public:
	bool                                          bLow;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_npc_hp_C_PlayLowAnim;

}

