#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_level_occupy_list

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_level_occupy_list.uw_fight_level_occupy_list_C
// 0x0098 (0x0448 - 0x03B0)
class UUw_fight_level_occupy_list_C final : public ULuaWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Disappear;                                         // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Up;                                                // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GrowUpBlue;                                        // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GrowUpRed;                                         // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OverBlue;                                          // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OverRed;                                           // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fight;                                             // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UProgressBar*                           BarBlue;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           BarRed;                                            // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBG;                                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAlphaMaskImage*                        ImgGrowUp;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgOverBlue;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgOVerRed;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgSize;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgWhite;                                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelWarn;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     Txt1;                                              // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtName;                                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet__Overridden(class UObject* ListItemObject);
	void ExecuteUbergraph_uw_fight_level_occupy_list(int32 EntryPoint);
	void Construct();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnConstruct();
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_level_occupy_list_C">();
	}
	static class UUw_fight_level_occupy_list_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_level_occupy_list_C>();
	}
};
static_assert(alignof(UUw_fight_level_occupy_list_C) == 0x000008, "Wrong alignment on UUw_fight_level_occupy_list_C");
static_assert(sizeof(UUw_fight_level_occupy_list_C) == 0x000448, "Wrong size on UUw_fight_level_occupy_list_C");
static_assert(offsetof(UUw_fight_level_occupy_list_C, UberGraphFrame) == 0x0003B0, "Member 'UUw_fight_level_occupy_list_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupy_list_C, Disappear) == 0x0003B8, "Member 'UUw_fight_level_occupy_list_C::Disappear' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupy_list_C, Up) == 0x0003C0, "Member 'UUw_fight_level_occupy_list_C::Up' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupy_list_C, GrowUpBlue) == 0x0003C8, "Member 'UUw_fight_level_occupy_list_C::GrowUpBlue' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupy_list_C, GrowUpRed) == 0x0003D0, "Member 'UUw_fight_level_occupy_list_C::GrowUpRed' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupy_list_C, OverBlue) == 0x0003D8, "Member 'UUw_fight_level_occupy_list_C::OverBlue' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupy_list_C, OverRed) == 0x0003E0, "Member 'UUw_fight_level_occupy_list_C::OverRed' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupy_list_C, Fight) == 0x0003E8, "Member 'UUw_fight_level_occupy_list_C::Fight' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupy_list_C, BarBlue) == 0x0003F0, "Member 'UUw_fight_level_occupy_list_C::BarBlue' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupy_list_C, BarRed) == 0x0003F8, "Member 'UUw_fight_level_occupy_list_C::BarRed' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupy_list_C, ImgBG) == 0x000400, "Member 'UUw_fight_level_occupy_list_C::ImgBG' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupy_list_C, ImgGrowUp) == 0x000408, "Member 'UUw_fight_level_occupy_list_C::ImgGrowUp' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupy_list_C, ImgOverBlue) == 0x000410, "Member 'UUw_fight_level_occupy_list_C::ImgOverBlue' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupy_list_C, ImgOVerRed) == 0x000418, "Member 'UUw_fight_level_occupy_list_C::ImgOVerRed' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupy_list_C, ImgSize) == 0x000420, "Member 'UUw_fight_level_occupy_list_C::ImgSize' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupy_list_C, ImgWhite) == 0x000428, "Member 'UUw_fight_level_occupy_list_C::ImgWhite' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupy_list_C, PanelWarn) == 0x000430, "Member 'UUw_fight_level_occupy_list_C::PanelWarn' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupy_list_C, Txt1) == 0x000438, "Member 'UUw_fight_level_occupy_list_C::Txt1' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupy_list_C, TxtName) == 0x000440, "Member 'UUw_fight_level_occupy_list_C::TxtName' has a wrong offset!");

}

