#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_cross2

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function uw_fight_cross2.uw_fight_cross2_C.Tick
// 0x003C (0x003C - 0x0000)
struct Uw_fight_cross2_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_cross2_C_Tick) == 0x000004, "Wrong alignment on Uw_fight_cross2_C_Tick");
static_assert(sizeof(Uw_fight_cross2_C_Tick) == 0x00003C, "Wrong size on Uw_fight_cross2_C_Tick");
static_assert(offsetof(Uw_fight_cross2_C_Tick, MyGeometry) == 0x000000, "Member 'Uw_fight_cross2_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Uw_fight_cross2_C_Tick, InDeltaTime) == 0x000038, "Member 'Uw_fight_cross2_C_Tick::InDeltaTime' has a wrong offset!");

// Function uw_fight_cross2.uw_fight_cross2_C.K2_OnReloading
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_cross2_C_K2_OnReloading final
{
public:
	bool                                          bIsReload;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EWeaponType                                   Type;                                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupt;                                        // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnimTime;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_cross2_C_K2_OnReloading) == 0x000004, "Wrong alignment on Uw_fight_cross2_C_K2_OnReloading");
static_assert(sizeof(Uw_fight_cross2_C_K2_OnReloading) == 0x000008, "Wrong size on Uw_fight_cross2_C_K2_OnReloading");
static_assert(offsetof(Uw_fight_cross2_C_K2_OnReloading, bIsReload) == 0x000000, "Member 'Uw_fight_cross2_C_K2_OnReloading::bIsReload' has a wrong offset!");
static_assert(offsetof(Uw_fight_cross2_C_K2_OnReloading, Type) == 0x000001, "Member 'Uw_fight_cross2_C_K2_OnReloading::Type' has a wrong offset!");
static_assert(offsetof(Uw_fight_cross2_C_K2_OnReloading, bInterrupt) == 0x000002, "Member 'Uw_fight_cross2_C_K2_OnReloading::bInterrupt' has a wrong offset!");
static_assert(offsetof(Uw_fight_cross2_C_K2_OnReloading, AnimTime) == 0x000004, "Member 'Uw_fight_cross2_C_K2_OnReloading::AnimTime' has a wrong offset!");

// Function uw_fight_cross2.uw_fight_cross2_C.ExecuteUbergraph_uw_fight_cross2
// 0x004C (0x004C - 0x0000)
struct Uw_fight_cross2_C_ExecuteUbergraph_uw_fight_cross2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsReload;                            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EWeaponType                                   K2Node_Event_Type;                                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupt;                           // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_AnimTime;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_cross2_C_ExecuteUbergraph_uw_fight_cross2) == 0x000004, "Wrong alignment on Uw_fight_cross2_C_ExecuteUbergraph_uw_fight_cross2");
static_assert(sizeof(Uw_fight_cross2_C_ExecuteUbergraph_uw_fight_cross2) == 0x00004C, "Wrong size on Uw_fight_cross2_C_ExecuteUbergraph_uw_fight_cross2");
static_assert(offsetof(Uw_fight_cross2_C_ExecuteUbergraph_uw_fight_cross2, EntryPoint) == 0x000000, "Member 'Uw_fight_cross2_C_ExecuteUbergraph_uw_fight_cross2::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_cross2_C_ExecuteUbergraph_uw_fight_cross2, K2Node_Event_MyGeometry) == 0x000004, "Member 'Uw_fight_cross2_C_ExecuteUbergraph_uw_fight_cross2::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Uw_fight_cross2_C_ExecuteUbergraph_uw_fight_cross2, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'Uw_fight_cross2_C_ExecuteUbergraph_uw_fight_cross2::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(Uw_fight_cross2_C_ExecuteUbergraph_uw_fight_cross2, K2Node_Event_bIsReload) == 0x000040, "Member 'Uw_fight_cross2_C_ExecuteUbergraph_uw_fight_cross2::K2Node_Event_bIsReload' has a wrong offset!");
static_assert(offsetof(Uw_fight_cross2_C_ExecuteUbergraph_uw_fight_cross2, K2Node_Event_Type) == 0x000041, "Member 'Uw_fight_cross2_C_ExecuteUbergraph_uw_fight_cross2::K2Node_Event_Type' has a wrong offset!");
static_assert(offsetof(Uw_fight_cross2_C_ExecuteUbergraph_uw_fight_cross2, K2Node_Event_bInterrupt) == 0x000042, "Member 'Uw_fight_cross2_C_ExecuteUbergraph_uw_fight_cross2::K2Node_Event_bInterrupt' has a wrong offset!");
static_assert(offsetof(Uw_fight_cross2_C_ExecuteUbergraph_uw_fight_cross2, K2Node_Event_AnimTime) == 0x000044, "Member 'Uw_fight_cross2_C_ExecuteUbergraph_uw_fight_cross2::K2Node_Event_AnimTime' has a wrong offset!");
static_assert(offsetof(Uw_fight_cross2_C_ExecuteUbergraph_uw_fight_cross2, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000048, "Member 'Uw_fight_cross2_C_ExecuteUbergraph_uw_fight_cross2::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_cross2_C_ExecuteUbergraph_uw_fight_cross2, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000049, "Member 'Uw_fight_cross2_C_ExecuteUbergraph_uw_fight_cross2::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_cross2_C_ExecuteUbergraph_uw_fight_cross2, CallFunc_BooleanOR_ReturnValue) == 0x00004A, "Member 'Uw_fight_cross2_C_ExecuteUbergraph_uw_fight_cross2::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

