#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_direction_defense

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_direction_defense.uw_fight_direction_defense_C
// 0x0088 (0x0888 - 0x0800)
class UUw_fight_direction_defense_C final : public UFightMonsterTipsItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0800(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0808(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appear;                                            // 0x0810(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Defense2;                                          // 0x0818(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Defense1;                                          // 0x0820(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         DefenseHp;                                         // 0x0828(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_7;                                           // 0x0830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_17;                                          // 0x0838(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_25;                                          // 0x0840(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_bai;                                         // 0x0848(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_yuan;                                        // 0x0850(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_yuan1;                                       // 0x0858(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_yuan2;                                       // 0x0860(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgArrow10;                                        // 0x0868(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgDown;                                           // 0x0870(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgHeight;                                         // 0x0878(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtDefenseName;                                    // 0x0880(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SequenceEvent__ENTRYPOINTuw_fight_direction_defense_0();
	void StartLoop(const class FName AnimName, bool HasAppear);
	void SetDefendTargetPercent(float Value);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void PlayDieAnim();
	void OnVisibilityChanged_Event_0(ESlateVisibility InVisibility);
	void AppearFinish(class UWidgetAnimation* Animation);
	void PlayHitAnim(const struct FApplyDamageResultData& DamageResultData);
	void PlayTypeAnim();
	void K2_OnCustomUmgAnimFinished(const class FName& AnimName);
	void ExecuteUbergraph_uw_fight_direction_defense(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_direction_defense_C">();
	}
	static class UUw_fight_direction_defense_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_direction_defense_C>();
	}
};
static_assert(alignof(UUw_fight_direction_defense_C) == 0x000008, "Wrong alignment on UUw_fight_direction_defense_C");
static_assert(sizeof(UUw_fight_direction_defense_C) == 0x000888, "Wrong size on UUw_fight_direction_defense_C");
static_assert(offsetof(UUw_fight_direction_defense_C, UberGraphFrame) == 0x000800, "Member 'UUw_fight_direction_defense_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_defense_C, Loop) == 0x000808, "Member 'UUw_fight_direction_defense_C::Loop' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_defense_C, Appear) == 0x000810, "Member 'UUw_fight_direction_defense_C::Appear' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_defense_C, Defense2) == 0x000818, "Member 'UUw_fight_direction_defense_C::Defense2' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_defense_C, Defense1) == 0x000820, "Member 'UUw_fight_direction_defense_C::Defense1' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_defense_C, DefenseHp) == 0x000828, "Member 'UUw_fight_direction_defense_C::DefenseHp' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_defense_C, Image_7) == 0x000830, "Member 'UUw_fight_direction_defense_C::Image_7' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_defense_C, Image_17) == 0x000838, "Member 'UUw_fight_direction_defense_C::Image_17' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_defense_C, Image_25) == 0x000840, "Member 'UUw_fight_direction_defense_C::Image_25' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_defense_C, Image_bai) == 0x000848, "Member 'UUw_fight_direction_defense_C::Image_bai' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_defense_C, Image_yuan) == 0x000850, "Member 'UUw_fight_direction_defense_C::Image_yuan' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_defense_C, Image_yuan1) == 0x000858, "Member 'UUw_fight_direction_defense_C::Image_yuan1' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_defense_C, Image_yuan2) == 0x000860, "Member 'UUw_fight_direction_defense_C::Image_yuan2' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_defense_C, ImgArrow10) == 0x000868, "Member 'UUw_fight_direction_defense_C::ImgArrow10' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_defense_C, ImgDown) == 0x000870, "Member 'UUw_fight_direction_defense_C::ImgDown' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_defense_C, ImgHeight) == 0x000878, "Member 'UUw_fight_direction_defense_C::ImgHeight' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_defense_C, TxtDefenseName) == 0x000880, "Member 'UUw_fight_direction_defense_C::TxtDefenseName' has a wrong offset!");

}

