#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_turret_bar

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_turret_bar.uw_fight_turret_bar_C
// 0x0028 (0x0520 - 0x04F8)
class UUw_fight_turret_bar_C final : public USpecialProgress
{
public:
	class URedirectImage*                         Image;                                             // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_22;                                          // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_24;                                          // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_34;                                          // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           Progress;                                          // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_turret_bar_C">();
	}
	static class UUw_fight_turret_bar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_turret_bar_C>();
	}
};
static_assert(alignof(UUw_fight_turret_bar_C) == 0x000008, "Wrong alignment on UUw_fight_turret_bar_C");
static_assert(sizeof(UUw_fight_turret_bar_C) == 0x000520, "Wrong size on UUw_fight_turret_bar_C");
static_assert(offsetof(UUw_fight_turret_bar_C, Image) == 0x0004F8, "Member 'UUw_fight_turret_bar_C::Image' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_bar_C, Image_22) == 0x000500, "Member 'UUw_fight_turret_bar_C::Image_22' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_bar_C, Image_24) == 0x000508, "Member 'UUw_fight_turret_bar_C::Image_24' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_bar_C, Image_34) == 0x000510, "Member 'UUw_fight_turret_bar_C::Image_34' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_bar_C, Progress) == 0x000518, "Member 'UUw_fight_turret_bar_C::Progress' has a wrong offset!");

}

