#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_ammunition5

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_ammunition5.uw_fight_ammunition5_C.OnBulletChange
// 0x000C (0x000C - 0x0000)
struct Uw_fight_ammunition5_C_OnBulletChange final
{
public:
	int32                                         InCurBullet;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMaxBullet;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InPercent;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_ammunition5_C_OnBulletChange) == 0x000004, "Wrong alignment on Uw_fight_ammunition5_C_OnBulletChange");
static_assert(sizeof(Uw_fight_ammunition5_C_OnBulletChange) == 0x00000C, "Wrong size on Uw_fight_ammunition5_C_OnBulletChange");
static_assert(offsetof(Uw_fight_ammunition5_C_OnBulletChange, InCurBullet) == 0x000000, "Member 'Uw_fight_ammunition5_C_OnBulletChange::InCurBullet' has a wrong offset!");
static_assert(offsetof(Uw_fight_ammunition5_C_OnBulletChange, InMaxBullet) == 0x000004, "Member 'Uw_fight_ammunition5_C_OnBulletChange::InMaxBullet' has a wrong offset!");
static_assert(offsetof(Uw_fight_ammunition5_C_OnBulletChange, InPercent) == 0x000008, "Member 'Uw_fight_ammunition5_C_OnBulletChange::InPercent' has a wrong offset!");

// Function uw_fight_ammunition5.uw_fight_ammunition5_C.ExecuteUbergraph_uw_fight_ammunition5
// 0x0014 (0x0014 - 0x0000)
struct Uw_fight_ammunition5_C_ExecuteUbergraph_uw_fight_ammunition5 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimPlayingFromName_ReturnValue;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InCurBullet;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InMaxBullet;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InPercent;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_ammunition5_C_ExecuteUbergraph_uw_fight_ammunition5) == 0x000004, "Wrong alignment on Uw_fight_ammunition5_C_ExecuteUbergraph_uw_fight_ammunition5");
static_assert(sizeof(Uw_fight_ammunition5_C_ExecuteUbergraph_uw_fight_ammunition5) == 0x000014, "Wrong size on Uw_fight_ammunition5_C_ExecuteUbergraph_uw_fight_ammunition5");
static_assert(offsetof(Uw_fight_ammunition5_C_ExecuteUbergraph_uw_fight_ammunition5, EntryPoint) == 0x000000, "Member 'Uw_fight_ammunition5_C_ExecuteUbergraph_uw_fight_ammunition5::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_ammunition5_C_ExecuteUbergraph_uw_fight_ammunition5, CallFunc_IsAnimPlayingFromName_ReturnValue) == 0x000004, "Member 'Uw_fight_ammunition5_C_ExecuteUbergraph_uw_fight_ammunition5::CallFunc_IsAnimPlayingFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_ammunition5_C_ExecuteUbergraph_uw_fight_ammunition5, K2Node_Event_InCurBullet) == 0x000008, "Member 'Uw_fight_ammunition5_C_ExecuteUbergraph_uw_fight_ammunition5::K2Node_Event_InCurBullet' has a wrong offset!");
static_assert(offsetof(Uw_fight_ammunition5_C_ExecuteUbergraph_uw_fight_ammunition5, K2Node_Event_InMaxBullet) == 0x00000C, "Member 'Uw_fight_ammunition5_C_ExecuteUbergraph_uw_fight_ammunition5::K2Node_Event_InMaxBullet' has a wrong offset!");
static_assert(offsetof(Uw_fight_ammunition5_C_ExecuteUbergraph_uw_fight_ammunition5, K2Node_Event_InPercent) == 0x000010, "Member 'Uw_fight_ammunition5_C_ExecuteUbergraph_uw_fight_ammunition5::K2Node_Event_InPercent' has a wrong offset!");

}

