#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_effect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_effect.uw_fight_effect_C
// 0x0098 (0x0328 - 0x0290)
class UUw_fight_effect_C final : public UFightHitTip
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Armor_broken;                                      // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUw_armor_subitem_C*                    Angle135;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_armor_subitem2_C*                   Angle180;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_armor_subitem_C*                    Angle225;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_armor_subitem1_C*                   Angle270;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_armor_subitem_C*                    Angle315;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_armor_subitem2_C*                   Angle360;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_armor_subitem_C*                    Angle45;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_armor_subitem1_C*                   Angle90;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Group_Armor;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_injured_subitem_C*            HitAngle135;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_injured_subitem2_C*           HitAngle180;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_injured_subitem_C*            HitAngle225;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_injured_subitem1_C*           HitAngle270;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_injured_subitem_C*            HitAngle315;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_injured_subitem2_C*           HitAngle360;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_injured_subitem_C*            HitAngle45;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_injured_subitem1_C*           HitAngle90;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnHit__Overridden(float Angle, float Shield, bool IsBigHit);
	void ExecuteUbergraph_uw_fight_effect(int32 EntryPoint);
	void OnHit(float Angle, float Shield, bool IsBigHit);
	void Construct();
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_effect_C">();
	}
	static class UUw_fight_effect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_effect_C>();
	}
};
static_assert(alignof(UUw_fight_effect_C) == 0x000008, "Wrong alignment on UUw_fight_effect_C");
static_assert(sizeof(UUw_fight_effect_C) == 0x000328, "Wrong size on UUw_fight_effect_C");
static_assert(offsetof(UUw_fight_effect_C, UberGraphFrame) == 0x000290, "Member 'UUw_fight_effect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_effect_C, Armor_broken) == 0x000298, "Member 'UUw_fight_effect_C::Armor_broken' has a wrong offset!");
static_assert(offsetof(UUw_fight_effect_C, Angle135) == 0x0002A0, "Member 'UUw_fight_effect_C::Angle135' has a wrong offset!");
static_assert(offsetof(UUw_fight_effect_C, Angle180) == 0x0002A8, "Member 'UUw_fight_effect_C::Angle180' has a wrong offset!");
static_assert(offsetof(UUw_fight_effect_C, Angle225) == 0x0002B0, "Member 'UUw_fight_effect_C::Angle225' has a wrong offset!");
static_assert(offsetof(UUw_fight_effect_C, Angle270) == 0x0002B8, "Member 'UUw_fight_effect_C::Angle270' has a wrong offset!");
static_assert(offsetof(UUw_fight_effect_C, Angle315) == 0x0002C0, "Member 'UUw_fight_effect_C::Angle315' has a wrong offset!");
static_assert(offsetof(UUw_fight_effect_C, Angle360) == 0x0002C8, "Member 'UUw_fight_effect_C::Angle360' has a wrong offset!");
static_assert(offsetof(UUw_fight_effect_C, Angle45) == 0x0002D0, "Member 'UUw_fight_effect_C::Angle45' has a wrong offset!");
static_assert(offsetof(UUw_fight_effect_C, Angle90) == 0x0002D8, "Member 'UUw_fight_effect_C::Angle90' has a wrong offset!");
static_assert(offsetof(UUw_fight_effect_C, Group_Armor) == 0x0002E0, "Member 'UUw_fight_effect_C::Group_Armor' has a wrong offset!");
static_assert(offsetof(UUw_fight_effect_C, HitAngle135) == 0x0002E8, "Member 'UUw_fight_effect_C::HitAngle135' has a wrong offset!");
static_assert(offsetof(UUw_fight_effect_C, HitAngle180) == 0x0002F0, "Member 'UUw_fight_effect_C::HitAngle180' has a wrong offset!");
static_assert(offsetof(UUw_fight_effect_C, HitAngle225) == 0x0002F8, "Member 'UUw_fight_effect_C::HitAngle225' has a wrong offset!");
static_assert(offsetof(UUw_fight_effect_C, HitAngle270) == 0x000300, "Member 'UUw_fight_effect_C::HitAngle270' has a wrong offset!");
static_assert(offsetof(UUw_fight_effect_C, HitAngle315) == 0x000308, "Member 'UUw_fight_effect_C::HitAngle315' has a wrong offset!");
static_assert(offsetof(UUw_fight_effect_C, HitAngle360) == 0x000310, "Member 'UUw_fight_effect_C::HitAngle360' has a wrong offset!");
static_assert(offsetof(UUw_fight_effect_C, HitAngle45) == 0x000318, "Member 'UUw_fight_effect_C::HitAngle45' has a wrong offset!");
static_assert(offsetof(UUw_fight_effect_C, HitAngle90) == 0x000320, "Member 'UUw_fight_effect_C::HitAngle90' has a wrong offset!");

}

