#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_defense_fullcombo

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_defense_fullcombo.uw_fight_defense_fullcombo_C
// 0x00D8 (0x0488 - 0x03B0)
class UUw_fight_defense_fullcombo_C final : public ULuaWidget
{
public:
	class UWidgetAnimation*                       AllEnter;                                          // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGameNiagaraSystemWidget*               burst01;                                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomText*                            CustomText_361;                                    // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Glow_2;                                            // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img1;                                              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img2;                                              // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img3;                                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img4;                                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img5;                                              // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img5_1;                                            // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img5_2;                                            // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img5_3;                                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img5_4;                                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img5_5;                                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img5_6;                                            // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img5_7;                                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img6;                                              // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img7;                                              // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgLight;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Light01;                                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Light02;                                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameNiagaraSystemWidget*               Lizi01;                                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Star;                                              // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Star_1;                                            // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtDefenseFullCombo;                               // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtDefenseFullCombo_1;                             // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtDefenseFullCombo_2;                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();

	class FString GetModuleName() const;
	void WidgetGeometryReadyFrame(int32 Frame) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_defense_fullcombo_C">();
	}
	static class UUw_fight_defense_fullcombo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_defense_fullcombo_C>();
	}
};
static_assert(alignof(UUw_fight_defense_fullcombo_C) == 0x000008, "Wrong alignment on UUw_fight_defense_fullcombo_C");
static_assert(sizeof(UUw_fight_defense_fullcombo_C) == 0x000488, "Wrong size on UUw_fight_defense_fullcombo_C");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, AllEnter) == 0x0003B0, "Member 'UUw_fight_defense_fullcombo_C::AllEnter' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, burst01) == 0x0003B8, "Member 'UUw_fight_defense_fullcombo_C::burst01' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, CustomText_361) == 0x0003C0, "Member 'UUw_fight_defense_fullcombo_C::CustomText_361' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, Glow_2) == 0x0003C8, "Member 'UUw_fight_defense_fullcombo_C::Glow_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, Img1) == 0x0003D0, "Member 'UUw_fight_defense_fullcombo_C::Img1' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, Img2) == 0x0003D8, "Member 'UUw_fight_defense_fullcombo_C::Img2' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, Img3) == 0x0003E0, "Member 'UUw_fight_defense_fullcombo_C::Img3' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, Img4) == 0x0003E8, "Member 'UUw_fight_defense_fullcombo_C::Img4' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, Img5) == 0x0003F0, "Member 'UUw_fight_defense_fullcombo_C::Img5' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, Img5_1) == 0x0003F8, "Member 'UUw_fight_defense_fullcombo_C::Img5_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, Img5_2) == 0x000400, "Member 'UUw_fight_defense_fullcombo_C::Img5_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, Img5_3) == 0x000408, "Member 'UUw_fight_defense_fullcombo_C::Img5_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, Img5_4) == 0x000410, "Member 'UUw_fight_defense_fullcombo_C::Img5_4' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, Img5_5) == 0x000418, "Member 'UUw_fight_defense_fullcombo_C::Img5_5' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, Img5_6) == 0x000420, "Member 'UUw_fight_defense_fullcombo_C::Img5_6' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, Img5_7) == 0x000428, "Member 'UUw_fight_defense_fullcombo_C::Img5_7' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, Img6) == 0x000430, "Member 'UUw_fight_defense_fullcombo_C::Img6' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, Img7) == 0x000438, "Member 'UUw_fight_defense_fullcombo_C::Img7' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, ImgLight) == 0x000440, "Member 'UUw_fight_defense_fullcombo_C::ImgLight' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, Light01) == 0x000448, "Member 'UUw_fight_defense_fullcombo_C::Light01' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, Light02) == 0x000450, "Member 'UUw_fight_defense_fullcombo_C::Light02' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, Lizi01) == 0x000458, "Member 'UUw_fight_defense_fullcombo_C::Lizi01' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, Star) == 0x000460, "Member 'UUw_fight_defense_fullcombo_C::Star' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, Star_1) == 0x000468, "Member 'UUw_fight_defense_fullcombo_C::Star_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, TxtDefenseFullCombo) == 0x000470, "Member 'UUw_fight_defense_fullcombo_C::TxtDefenseFullCombo' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, TxtDefenseFullCombo_1) == 0x000478, "Member 'UUw_fight_defense_fullcombo_C::TxtDefenseFullCombo_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_defense_fullcombo_C, TxtDefenseFullCombo_2) == 0x000480, "Member 'UUw_fight_defense_fullcombo_C::TxtDefenseFullCombo_2' has a wrong offset!");

}

