#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_joystick_cover

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_joystick_cover.uw_fight_joystick_cover_C
// 0x0060 (0x02E0 - 0x0280)
class UUw_fight_joystick_cover_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Arrow;                                             // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Finger_up;                                         // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Finger_LR;                                         // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Finger;                                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image;                                             // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_1;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_2;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_3;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_4;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_248;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img_Bg;                                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ExecuteUbergraph_uw_fight_joystick_cover(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_joystick_cover_C">();
	}
	static class UUw_fight_joystick_cover_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_joystick_cover_C>();
	}
};
static_assert(alignof(UUw_fight_joystick_cover_C) == 0x000008, "Wrong alignment on UUw_fight_joystick_cover_C");
static_assert(sizeof(UUw_fight_joystick_cover_C) == 0x0002E0, "Wrong size on UUw_fight_joystick_cover_C");
static_assert(offsetof(UUw_fight_joystick_cover_C, UberGraphFrame) == 0x000280, "Member 'UUw_fight_joystick_cover_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_joystick_cover_C, Arrow) == 0x000288, "Member 'UUw_fight_joystick_cover_C::Arrow' has a wrong offset!");
static_assert(offsetof(UUw_fight_joystick_cover_C, Finger_up) == 0x000290, "Member 'UUw_fight_joystick_cover_C::Finger_up' has a wrong offset!");
static_assert(offsetof(UUw_fight_joystick_cover_C, Finger_LR) == 0x000298, "Member 'UUw_fight_joystick_cover_C::Finger_LR' has a wrong offset!");
static_assert(offsetof(UUw_fight_joystick_cover_C, Finger) == 0x0002A0, "Member 'UUw_fight_joystick_cover_C::Finger' has a wrong offset!");
static_assert(offsetof(UUw_fight_joystick_cover_C, Image) == 0x0002A8, "Member 'UUw_fight_joystick_cover_C::Image' has a wrong offset!");
static_assert(offsetof(UUw_fight_joystick_cover_C, Image_1) == 0x0002B0, "Member 'UUw_fight_joystick_cover_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_joystick_cover_C, Image_2) == 0x0002B8, "Member 'UUw_fight_joystick_cover_C::Image_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_joystick_cover_C, Image_3) == 0x0002C0, "Member 'UUw_fight_joystick_cover_C::Image_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_joystick_cover_C, Image_4) == 0x0002C8, "Member 'UUw_fight_joystick_cover_C::Image_4' has a wrong offset!");
static_assert(offsetof(UUw_fight_joystick_cover_C, Image_248) == 0x0002D0, "Member 'UUw_fight_joystick_cover_C::Image_248' has a wrong offset!");
static_assert(offsetof(UUw_fight_joystick_cover_C, Img_Bg) == 0x0002D8, "Member 'UUw_fight_joystick_cover_C::Img_Bg' has a wrong offset!");

}

