#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_fight_ammunition_girl023

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_ammunition_girl023.uw_fight_ammunition_girl023_C.ExecuteUbergraph_uw_fight_ammunition_girl023
// 0x0030 (0x0030 - 0x0000)
struct uw_fight_ammunition_girl023_C_ExecuteUbergraph_uw_fight_ammunition_girl023 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InCurBullet;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InMaxBullet;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InPercent;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	bool                                          K2Node_Event_bActive;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bFromQTE;                             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_ammunition_girl023_C_ExecuteUbergraph_uw_fight_ammunition_girl023;

// Function uw_fight_ammunition_girl023.uw_fight_ammunition_girl023_C.BP_ChangeType
// 0x0002 (0x0002 - 0x0000)
struct uw_fight_ammunition_girl023_C_BP_ChangeType final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFromQTE;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_ammunition_girl023_C_BP_ChangeType;

// Function uw_fight_ammunition_girl023.uw_fight_ammunition_girl023_C.OnBulletChange
// 0x000C (0x000C - 0x0000)
struct uw_fight_ammunition_girl023_C_OnBulletChange final
{
public:
	int32                                         InCurBullet;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMaxBullet;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InPercent;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_ammunition_girl023_C_OnBulletChange;

}

