#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_action_item2

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_action_item2.uw_fight_action_item2_C
// 0x0028 (0x03D8 - 0x03B0)
class UUw_fight_action_item2_C final : public ULuaWidget
{
public:
	class UCustomButton*                          BtnChoose;                                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_194;                                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgMode;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgSl;                                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtName;                                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void OnConstruct();
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_action_item2_C">();
	}
	static class UUw_fight_action_item2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_action_item2_C>();
	}
};
static_assert(alignof(UUw_fight_action_item2_C) == 0x000008, "Wrong alignment on UUw_fight_action_item2_C");
static_assert(sizeof(UUw_fight_action_item2_C) == 0x0003D8, "Wrong size on UUw_fight_action_item2_C");
static_assert(offsetof(UUw_fight_action_item2_C, BtnChoose) == 0x0003B0, "Member 'UUw_fight_action_item2_C::BtnChoose' has a wrong offset!");
static_assert(offsetof(UUw_fight_action_item2_C, Image_194) == 0x0003B8, "Member 'UUw_fight_action_item2_C::Image_194' has a wrong offset!");
static_assert(offsetof(UUw_fight_action_item2_C, ImgMode) == 0x0003C0, "Member 'UUw_fight_action_item2_C::ImgMode' has a wrong offset!");
static_assert(offsetof(UUw_fight_action_item2_C, ImgSl) == 0x0003C8, "Member 'UUw_fight_action_item2_C::ImgSl' has a wrong offset!");
static_assert(offsetof(UUw_fight_action_item2_C, TxtName) == 0x0003D0, "Member 'UUw_fight_action_item2_C::TxtName' has a wrong offset!");

}

