#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_level_carbar

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_level_carbar.uw_fight_level_carbar_C
// 0x0040 (0x0388 - 0x0348)
class UUw_fight_level_carbar_C final : public UUserWidgetAnimation
{
public:
	class UWidgetAnimation*                       AllEnter;                                          // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         One;                                               // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Two;                                               // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Three;                                             // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Four;                                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           BarNum;                                            // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_241;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                SliderPic;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void K2_OnUpdate(float InDeltaTime);
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_level_carbar_C">();
	}
	static class UUw_fight_level_carbar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_level_carbar_C>();
	}
};
static_assert(alignof(UUw_fight_level_carbar_C) == 0x000008, "Wrong alignment on UUw_fight_level_carbar_C");
static_assert(sizeof(UUw_fight_level_carbar_C) == 0x000388, "Wrong size on UUw_fight_level_carbar_C");
static_assert(offsetof(UUw_fight_level_carbar_C, AllEnter) == 0x000348, "Member 'UUw_fight_level_carbar_C::AllEnter' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_carbar_C, One) == 0x000350, "Member 'UUw_fight_level_carbar_C::One' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_carbar_C, Two) == 0x000358, "Member 'UUw_fight_level_carbar_C::Two' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_carbar_C, Three) == 0x000360, "Member 'UUw_fight_level_carbar_C::Three' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_carbar_C, Four) == 0x000368, "Member 'UUw_fight_level_carbar_C::Four' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_carbar_C, BarNum) == 0x000370, "Member 'UUw_fight_level_carbar_C::BarNum' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_carbar_C, Image_241) == 0x000378, "Member 'UUw_fight_level_carbar_C::Image_241' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_carbar_C, SliderPic) == 0x000380, "Member 'UUw_fight_level_carbar_C::SliderPic' has a wrong offset!");

}

