#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_operatebox_skill

#include "Basic.hpp"


namespace SDK::Params
{

// LuaFunction uw_fight_operatebox_skill.uw_fight_operatebox_skill_C.K2_OnCustomUmgAnimFinished
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_operatebox_skill_C_K2_OnCustomUmgAnimFinished final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Uw_fight_operatebox_skill_C_K2_OnCustomUmgAnimFinished) == 0x000004, "Wrong alignment on Uw_fight_operatebox_skill_C_K2_OnCustomUmgAnimFinished");
static_assert(sizeof(Uw_fight_operatebox_skill_C_K2_OnCustomUmgAnimFinished) == 0x000008, "Wrong size on Uw_fight_operatebox_skill_C_K2_OnCustomUmgAnimFinished");
static_assert(offsetof(Uw_fight_operatebox_skill_C_K2_OnCustomUmgAnimFinished, AnimName) == 0x000000, "Member 'Uw_fight_operatebox_skill_C_K2_OnCustomUmgAnimFinished::AnimName' has a wrong offset!");

// LuaFunction uw_fight_operatebox_skill.uw_fight_operatebox_skill_C.OnChargeTimesChange
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_operatebox_skill_C_OnChargeTimesChange final
{
public:
	int32                                         InCurrentTimes;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InMaxTimes;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Uw_fight_operatebox_skill_C_OnChargeTimesChange) == 0x000004, "Wrong alignment on Uw_fight_operatebox_skill_C_OnChargeTimesChange");
static_assert(sizeof(Uw_fight_operatebox_skill_C_OnChargeTimesChange) == 0x000008, "Wrong size on Uw_fight_operatebox_skill_C_OnChargeTimesChange");
static_assert(offsetof(Uw_fight_operatebox_skill_C_OnChargeTimesChange, InCurrentTimes) == 0x000000, "Member 'Uw_fight_operatebox_skill_C_OnChargeTimesChange::InCurrentTimes' has a wrong offset!");
static_assert(offsetof(Uw_fight_operatebox_skill_C_OnChargeTimesChange, InMaxTimes) == 0x000004, "Member 'Uw_fight_operatebox_skill_C_OnChargeTimesChange::InMaxTimes' has a wrong offset!");

// Function uw_fight_operatebox_skill.uw_fight_operatebox_skill_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Uw_fight_operatebox_skill_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_operatebox_skill_C_GetModuleName) == 0x000008, "Wrong alignment on Uw_fight_operatebox_skill_C_GetModuleName");
static_assert(sizeof(Uw_fight_operatebox_skill_C_GetModuleName) == 0x000010, "Wrong size on Uw_fight_operatebox_skill_C_GetModuleName");
static_assert(offsetof(Uw_fight_operatebox_skill_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Uw_fight_operatebox_skill_C_GetModuleName::ReturnValue' has a wrong offset!");

}

