#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_skill_panel

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_skill_panel.uw_fight_skill_panel_C.ShowOrHideCancelBtn
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_skill_panel_C_ShowOrHideCancelBtn final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_skill_panel_C_ShowOrHideCancelBtn) == 0x000001, "Wrong alignment on Uw_fight_skill_panel_C_ShowOrHideCancelBtn");
static_assert(sizeof(Uw_fight_skill_panel_C_ShowOrHideCancelBtn) == 0x000001, "Wrong size on Uw_fight_skill_panel_C_ShowOrHideCancelBtn");
static_assert(offsetof(Uw_fight_skill_panel_C_ShowOrHideCancelBtn, bShow) == 0x000000, "Member 'Uw_fight_skill_panel_C_ShowOrHideCancelBtn::bShow' has a wrong offset!");

// Function uw_fight_skill_panel.uw_fight_skill_panel_C.ExecuteUbergraph_uw_fight_skill_panel
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_skill_panel_C_ExecuteUbergraph_uw_fight_skill_panel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShow;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_skill_panel_C_ExecuteUbergraph_uw_fight_skill_panel) == 0x000004, "Wrong alignment on Uw_fight_skill_panel_C_ExecuteUbergraph_uw_fight_skill_panel");
static_assert(sizeof(Uw_fight_skill_panel_C_ExecuteUbergraph_uw_fight_skill_panel) == 0x000008, "Wrong size on Uw_fight_skill_panel_C_ExecuteUbergraph_uw_fight_skill_panel");
static_assert(offsetof(Uw_fight_skill_panel_C_ExecuteUbergraph_uw_fight_skill_panel, EntryPoint) == 0x000000, "Member 'Uw_fight_skill_panel_C_ExecuteUbergraph_uw_fight_skill_panel::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_panel_C_ExecuteUbergraph_uw_fight_skill_panel, K2Node_Event_bShow) == 0x000004, "Member 'Uw_fight_skill_panel_C_ExecuteUbergraph_uw_fight_skill_panel::K2Node_Event_bShow' has a wrong offset!");

}

