#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_onlineboss_num

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_onlineboss_num.uw_fight_onlineboss_num_C
// 0x0030 (0x02B0 - 0x0280)
class UUw_fight_onlineboss_num_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       AllEnter;                                          // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         ImgBoundless;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         NumBox;                                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     Txt1;                                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtAll;                                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtNow;                                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_onlineboss_num_C">();
	}
	static class UUw_fight_onlineboss_num_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_onlineboss_num_C>();
	}
};
static_assert(alignof(UUw_fight_onlineboss_num_C) == 0x000008, "Wrong alignment on UUw_fight_onlineboss_num_C");
static_assert(sizeof(UUw_fight_onlineboss_num_C) == 0x0002B0, "Wrong size on UUw_fight_onlineboss_num_C");
static_assert(offsetof(UUw_fight_onlineboss_num_C, AllEnter) == 0x000280, "Member 'UUw_fight_onlineboss_num_C::AllEnter' has a wrong offset!");
static_assert(offsetof(UUw_fight_onlineboss_num_C, ImgBoundless) == 0x000288, "Member 'UUw_fight_onlineboss_num_C::ImgBoundless' has a wrong offset!");
static_assert(offsetof(UUw_fight_onlineboss_num_C, NumBox) == 0x000290, "Member 'UUw_fight_onlineboss_num_C::NumBox' has a wrong offset!");
static_assert(offsetof(UUw_fight_onlineboss_num_C, Txt1) == 0x000298, "Member 'UUw_fight_onlineboss_num_C::Txt1' has a wrong offset!");
static_assert(offsetof(UUw_fight_onlineboss_num_C, TxtAll) == 0x0002A0, "Member 'UUw_fight_onlineboss_num_C::TxtAll' has a wrong offset!");
static_assert(offsetof(UUw_fight_onlineboss_num_C, TxtNow) == 0x0002A8, "Member 'UUw_fight_onlineboss_num_C::TxtNow' has a wrong offset!");

}

