#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_power_girl002a_twobar

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_power_girl002a_twobar.uw_fight_power_girl002a_twobar_C.PlayDepleteAnim
// 0x0004 (0x0004 - 0x0000)
struct Uw_fight_power_girl002a_twobar_C_PlayDepleteAnim final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_power_girl002a_twobar_C_PlayDepleteAnim) == 0x000004, "Wrong alignment on Uw_fight_power_girl002a_twobar_C_PlayDepleteAnim");
static_assert(sizeof(Uw_fight_power_girl002a_twobar_C_PlayDepleteAnim) == 0x000004, "Wrong size on Uw_fight_power_girl002a_twobar_C_PlayDepleteAnim");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_C_PlayDepleteAnim, Index_0) == 0x000000, "Member 'Uw_fight_power_girl002a_twobar_C_PlayDepleteAnim::Index_0' has a wrong offset!");

// Function uw_fight_power_girl002a_twobar.uw_fight_power_girl002a_twobar_C.PlayFullAnim
// 0x0004 (0x0004 - 0x0000)
struct Uw_fight_power_girl002a_twobar_C_PlayFullAnim final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_power_girl002a_twobar_C_PlayFullAnim) == 0x000004, "Wrong alignment on Uw_fight_power_girl002a_twobar_C_PlayFullAnim");
static_assert(sizeof(Uw_fight_power_girl002a_twobar_C_PlayFullAnim) == 0x000004, "Wrong size on Uw_fight_power_girl002a_twobar_C_PlayFullAnim");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_C_PlayFullAnim, Index_0) == 0x000000, "Member 'Uw_fight_power_girl002a_twobar_C_PlayFullAnim::Index_0' has a wrong offset!");

// Function uw_fight_power_girl002a_twobar.uw_fight_power_girl002a_twobar_C.PlayStartStateAnim
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_power_girl002a_twobar_C_PlayStartStateAnim final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_power_girl002a_twobar_C_PlayStartStateAnim) == 0x000001, "Wrong alignment on Uw_fight_power_girl002a_twobar_C_PlayStartStateAnim");
static_assert(sizeof(Uw_fight_power_girl002a_twobar_C_PlayStartStateAnim) == 0x000001, "Wrong size on Uw_fight_power_girl002a_twobar_C_PlayStartStateAnim");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_C_PlayStartStateAnim, bPlay) == 0x000000, "Member 'Uw_fight_power_girl002a_twobar_C_PlayStartStateAnim::bPlay' has a wrong offset!");

// Function uw_fight_power_girl002a_twobar.uw_fight_power_girl002a_twobar_C.ExecuteUbergraph_uw_fight_power_girl002a_twobar
// 0x0010 (0x0010 - 0x0000)
struct Uw_fight_power_girl002a_twobar_C_ExecuteUbergraph_uw_fight_power_girl002a_twobar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_1;                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlay;                                // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_power_girl002a_twobar_C_ExecuteUbergraph_uw_fight_power_girl002a_twobar) == 0x000004, "Wrong alignment on Uw_fight_power_girl002a_twobar_C_ExecuteUbergraph_uw_fight_power_girl002a_twobar");
static_assert(sizeof(Uw_fight_power_girl002a_twobar_C_ExecuteUbergraph_uw_fight_power_girl002a_twobar) == 0x000010, "Wrong size on Uw_fight_power_girl002a_twobar_C_ExecuteUbergraph_uw_fight_power_girl002a_twobar");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_C_ExecuteUbergraph_uw_fight_power_girl002a_twobar, EntryPoint) == 0x000000, "Member 'Uw_fight_power_girl002a_twobar_C_ExecuteUbergraph_uw_fight_power_girl002a_twobar::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_C_ExecuteUbergraph_uw_fight_power_girl002a_twobar, K2Node_Event_Index_1) == 0x000004, "Member 'Uw_fight_power_girl002a_twobar_C_ExecuteUbergraph_uw_fight_power_girl002a_twobar::K2Node_Event_Index_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_C_ExecuteUbergraph_uw_fight_power_girl002a_twobar, K2Node_Event_Index) == 0x000008, "Member 'Uw_fight_power_girl002a_twobar_C_ExecuteUbergraph_uw_fight_power_girl002a_twobar::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_C_ExecuteUbergraph_uw_fight_power_girl002a_twobar, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'Uw_fight_power_girl002a_twobar_C_ExecuteUbergraph_uw_fight_power_girl002a_twobar::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_C_ExecuteUbergraph_uw_fight_power_girl002a_twobar, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00000D, "Member 'Uw_fight_power_girl002a_twobar_C_ExecuteUbergraph_uw_fight_power_girl002a_twobar::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_C_ExecuteUbergraph_uw_fight_power_girl002a_twobar, K2Node_Event_bPlay) == 0x00000E, "Member 'Uw_fight_power_girl002a_twobar_C_ExecuteUbergraph_uw_fight_power_girl002a_twobar::K2Node_Event_bPlay' has a wrong offset!");

}

