#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_monster_tips_item

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function uw_fight_monster_tips_item.uw_fight_monster_tips_item_C.StartLoop
// 0x0030 (0x0030 - 0x0000)
struct Uw_fight_monster_tips_item_C_StartLoop final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasAppear;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_monster_tips_item_C_StartLoop) == 0x000008, "Wrong alignment on Uw_fight_monster_tips_item_C_StartLoop");
static_assert(sizeof(Uw_fight_monster_tips_item_C_StartLoop) == 0x000030, "Wrong size on Uw_fight_monster_tips_item_C_StartLoop");
static_assert(offsetof(Uw_fight_monster_tips_item_C_StartLoop, Object) == 0x000000, "Member 'Uw_fight_monster_tips_item_C_StartLoop::Object' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_StartLoop, HasAppear) == 0x000008, "Member 'Uw_fight_monster_tips_item_C_StartLoop::HasAppear' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_StartLoop, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'Uw_fight_monster_tips_item_C_StartLoop::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_StartLoop, CallFunc_GetDisplayName_ReturnValue) == 0x000018, "Member 'Uw_fight_monster_tips_item_C_StartLoop::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_StartLoop, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000028, "Member 'Uw_fight_monster_tips_item_C_StartLoop::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function uw_fight_monster_tips_item.uw_fight_monster_tips_item_C.SetDefendTargetPercent
// 0x0010 (0x0010 - 0x0000)
struct Uw_fight_monster_tips_item_C_SetDefendTargetPercent final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_monster_tips_item_C_SetDefendTargetPercent) == 0x000008, "Wrong alignment on Uw_fight_monster_tips_item_C_SetDefendTargetPercent");
static_assert(sizeof(Uw_fight_monster_tips_item_C_SetDefendTargetPercent) == 0x000010, "Wrong size on Uw_fight_monster_tips_item_C_SetDefendTargetPercent");
static_assert(offsetof(Uw_fight_monster_tips_item_C_SetDefendTargetPercent, Value) == 0x000000, "Member 'Uw_fight_monster_tips_item_C_SetDefendTargetPercent::Value' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_SetDefendTargetPercent, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'Uw_fight_monster_tips_item_C_SetDefendTargetPercent::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function uw_fight_monster_tips_item.uw_fight_monster_tips_item_C.OnVisibilityChanged_Event_0
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_monster_tips_item_C_OnVisibilityChanged_Event_0 final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_monster_tips_item_C_OnVisibilityChanged_Event_0) == 0x000001, "Wrong alignment on Uw_fight_monster_tips_item_C_OnVisibilityChanged_Event_0");
static_assert(sizeof(Uw_fight_monster_tips_item_C_OnVisibilityChanged_Event_0) == 0x000001, "Wrong size on Uw_fight_monster_tips_item_C_OnVisibilityChanged_Event_0");
static_assert(offsetof(Uw_fight_monster_tips_item_C_OnVisibilityChanged_Event_0, InVisibility) == 0x000000, "Member 'Uw_fight_monster_tips_item_C_OnVisibilityChanged_Event_0::InVisibility' has a wrong offset!");

// Function uw_fight_monster_tips_item.uw_fight_monster_tips_item_C.PlayHitAnim
// 0x00C0 (0x00C0 - 0x0000)
struct Uw_fight_monster_tips_item_C_PlayHitAnim final
{
public:
	struct FApplyDamageResultData                 DamageResultData;                                  // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(Uw_fight_monster_tips_item_C_PlayHitAnim) == 0x000008, "Wrong alignment on Uw_fight_monster_tips_item_C_PlayHitAnim");
static_assert(sizeof(Uw_fight_monster_tips_item_C_PlayHitAnim) == 0x0000C0, "Wrong size on Uw_fight_monster_tips_item_C_PlayHitAnim");
static_assert(offsetof(Uw_fight_monster_tips_item_C_PlayHitAnim, DamageResultData) == 0x000000, "Member 'Uw_fight_monster_tips_item_C_PlayHitAnim::DamageResultData' has a wrong offset!");

// Function uw_fight_monster_tips_item.uw_fight_monster_tips_item_C.AppearFinish
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_monster_tips_item_C_AppearFinish final
{
public:
	class UWidgetAnimation*                       Animation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_monster_tips_item_C_AppearFinish) == 0x000008, "Wrong alignment on Uw_fight_monster_tips_item_C_AppearFinish");
static_assert(sizeof(Uw_fight_monster_tips_item_C_AppearFinish) == 0x000008, "Wrong size on Uw_fight_monster_tips_item_C_AppearFinish");
static_assert(offsetof(Uw_fight_monster_tips_item_C_AppearFinish, Animation) == 0x000000, "Member 'Uw_fight_monster_tips_item_C_AppearFinish::Animation' has a wrong offset!");

// Function uw_fight_monster_tips_item.uw_fight_monster_tips_item_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_monster_tips_item_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_monster_tips_item_C_OnAnimationFinished) == 0x000008, "Wrong alignment on Uw_fight_monster_tips_item_C_OnAnimationFinished");
static_assert(sizeof(Uw_fight_monster_tips_item_C_OnAnimationFinished) == 0x000008, "Wrong size on Uw_fight_monster_tips_item_C_OnAnimationFinished");
static_assert(offsetof(Uw_fight_monster_tips_item_C_OnAnimationFinished, Animation) == 0x000000, "Member 'Uw_fight_monster_tips_item_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function uw_fight_monster_tips_item.uw_fight_monster_tips_item_C.ExecuteUbergraph_uw_fight_monster_tips_item
// 0x0130 (0x0130 - 0x0000)
struct Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FApplyDamageResultData                 K2Node_Event_DamageResultData;                     // 0x0018(0x00C0)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentValue_ReturnValue;              // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentValue_ReturnValue_1;            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_CustomEvent_Animation;                      // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0110(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item) == 0x000008, "Wrong alignment on Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item");
static_assert(sizeof(Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item) == 0x000130, "Wrong size on Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item");
static_assert(offsetof(Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item, EntryPoint) == 0x000000, "Member 'Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item, K2Node_CustomEvent_InVisibility) == 0x000005, "Member 'Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000006, "Member 'Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000010, "Member 'Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item, K2Node_Event_DamageResultData) == 0x000018, "Member 'Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item::K2Node_Event_DamageResultData' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item, CallFunc_BooleanAND_ReturnValue) == 0x0000D8, "Member 'Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item, CallFunc_GetCurrentValue_ReturnValue) == 0x0000DC, "Member 'Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item::CallFunc_GetCurrentValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item, CallFunc_GetCurrentValue_ReturnValue_1) == 0x0000E0, "Member 'Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item::CallFunc_GetCurrentValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000E4, "Member 'Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000E8, "Member 'Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000F0, "Member 'Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000F8, "Member 'Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item, K2Node_CustomEvent_Animation) == 0x000100, "Member 'Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item::K2Node_CustomEvent_Animation' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item, CallFunc_PlayAnimation_ReturnValue_3) == 0x000108, "Member 'Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item, K2Node_Event_Animation) == 0x000110, "Member 'Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000118, "Member 'Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item, CallFunc_IsVisible_ReturnValue) == 0x000119, "Member 'Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item, CallFunc_PlayAnimation_ReturnValue_4) == 0x000120, "Member 'Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000128, "Member 'Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item, CallFunc_BooleanAND_ReturnValue_1) == 0x000129, "Member 'Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item, CallFunc_BooleanAND_ReturnValue_2) == 0x00012A, "Member 'Uw_fight_monster_tips_item_C_ExecuteUbergraph_uw_fight_monster_tips_item::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

}

