#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_MonBloodbar

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_MonBloodbar.uw_fight_MonBloodbar_C
// 0x01C8 (0x0678 - 0x04B0)
class UUw_fight_MonBloodbar_C final : public UMonBloodBar
{
public:
	class UGameCanvasPanel*                       Root;                                              // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01;                                            // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_1;                                          // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_2;                                          // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_3;                                          // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_4;                                          // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_5;                                          // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_6;                                          // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_7;                                          // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_8;                                          // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_9;                                          // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_10;                                         // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_11;                                         // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_12;                                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_13;                                         // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_14;                                         // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_15;                                         // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_16;                                         // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_17;                                         // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_18;                                         // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_19;                                         // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_20;                                         // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_21;                                         // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_22;                                         // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_23;                                         // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_24;                                         // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_25;                                         // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_26;                                         // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_27;                                         // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_28;                                         // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_29;                                         // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_30;                                         // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_31;                                         // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_32;                                         // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_33;                                         // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_34;                                         // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_35;                                         // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_36;                                         // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_37;                                         // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_38;                                         // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_39;                                         // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_40;                                         // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_41;                                         // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_42;                                         // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_43;                                         // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_44;                                         // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_45;                                         // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_46;                                         // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_47;                                         // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_48;                                         // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_49;                                         // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_50;                                         // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_51;                                         // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_52;                                         // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_53;                                         // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_54;                                         // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Slot01_55;                                         // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_MonBloodbar_C">();
	}
	static class UUw_fight_MonBloodbar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_MonBloodbar_C>();
	}
};
static_assert(alignof(UUw_fight_MonBloodbar_C) == 0x000008, "Wrong alignment on UUw_fight_MonBloodbar_C");
static_assert(sizeof(UUw_fight_MonBloodbar_C) == 0x000678, "Wrong size on UUw_fight_MonBloodbar_C");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Root) == 0x0004B0, "Member 'UUw_fight_MonBloodbar_C::Root' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01) == 0x0004B8, "Member 'UUw_fight_MonBloodbar_C::Slot01' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_1) == 0x0004C0, "Member 'UUw_fight_MonBloodbar_C::Slot01_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_2) == 0x0004C8, "Member 'UUw_fight_MonBloodbar_C::Slot01_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_3) == 0x0004D0, "Member 'UUw_fight_MonBloodbar_C::Slot01_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_4) == 0x0004D8, "Member 'UUw_fight_MonBloodbar_C::Slot01_4' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_5) == 0x0004E0, "Member 'UUw_fight_MonBloodbar_C::Slot01_5' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_6) == 0x0004E8, "Member 'UUw_fight_MonBloodbar_C::Slot01_6' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_7) == 0x0004F0, "Member 'UUw_fight_MonBloodbar_C::Slot01_7' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_8) == 0x0004F8, "Member 'UUw_fight_MonBloodbar_C::Slot01_8' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_9) == 0x000500, "Member 'UUw_fight_MonBloodbar_C::Slot01_9' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_10) == 0x000508, "Member 'UUw_fight_MonBloodbar_C::Slot01_10' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_11) == 0x000510, "Member 'UUw_fight_MonBloodbar_C::Slot01_11' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_12) == 0x000518, "Member 'UUw_fight_MonBloodbar_C::Slot01_12' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_13) == 0x000520, "Member 'UUw_fight_MonBloodbar_C::Slot01_13' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_14) == 0x000528, "Member 'UUw_fight_MonBloodbar_C::Slot01_14' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_15) == 0x000530, "Member 'UUw_fight_MonBloodbar_C::Slot01_15' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_16) == 0x000538, "Member 'UUw_fight_MonBloodbar_C::Slot01_16' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_17) == 0x000540, "Member 'UUw_fight_MonBloodbar_C::Slot01_17' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_18) == 0x000548, "Member 'UUw_fight_MonBloodbar_C::Slot01_18' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_19) == 0x000550, "Member 'UUw_fight_MonBloodbar_C::Slot01_19' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_20) == 0x000558, "Member 'UUw_fight_MonBloodbar_C::Slot01_20' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_21) == 0x000560, "Member 'UUw_fight_MonBloodbar_C::Slot01_21' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_22) == 0x000568, "Member 'UUw_fight_MonBloodbar_C::Slot01_22' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_23) == 0x000570, "Member 'UUw_fight_MonBloodbar_C::Slot01_23' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_24) == 0x000578, "Member 'UUw_fight_MonBloodbar_C::Slot01_24' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_25) == 0x000580, "Member 'UUw_fight_MonBloodbar_C::Slot01_25' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_26) == 0x000588, "Member 'UUw_fight_MonBloodbar_C::Slot01_26' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_27) == 0x000590, "Member 'UUw_fight_MonBloodbar_C::Slot01_27' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_28) == 0x000598, "Member 'UUw_fight_MonBloodbar_C::Slot01_28' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_29) == 0x0005A0, "Member 'UUw_fight_MonBloodbar_C::Slot01_29' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_30) == 0x0005A8, "Member 'UUw_fight_MonBloodbar_C::Slot01_30' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_31) == 0x0005B0, "Member 'UUw_fight_MonBloodbar_C::Slot01_31' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_32) == 0x0005B8, "Member 'UUw_fight_MonBloodbar_C::Slot01_32' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_33) == 0x0005C0, "Member 'UUw_fight_MonBloodbar_C::Slot01_33' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_34) == 0x0005C8, "Member 'UUw_fight_MonBloodbar_C::Slot01_34' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_35) == 0x0005D0, "Member 'UUw_fight_MonBloodbar_C::Slot01_35' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_36) == 0x0005D8, "Member 'UUw_fight_MonBloodbar_C::Slot01_36' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_37) == 0x0005E0, "Member 'UUw_fight_MonBloodbar_C::Slot01_37' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_38) == 0x0005E8, "Member 'UUw_fight_MonBloodbar_C::Slot01_38' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_39) == 0x0005F0, "Member 'UUw_fight_MonBloodbar_C::Slot01_39' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_40) == 0x0005F8, "Member 'UUw_fight_MonBloodbar_C::Slot01_40' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_41) == 0x000600, "Member 'UUw_fight_MonBloodbar_C::Slot01_41' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_42) == 0x000608, "Member 'UUw_fight_MonBloodbar_C::Slot01_42' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_43) == 0x000610, "Member 'UUw_fight_MonBloodbar_C::Slot01_43' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_44) == 0x000618, "Member 'UUw_fight_MonBloodbar_C::Slot01_44' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_45) == 0x000620, "Member 'UUw_fight_MonBloodbar_C::Slot01_45' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_46) == 0x000628, "Member 'UUw_fight_MonBloodbar_C::Slot01_46' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_47) == 0x000630, "Member 'UUw_fight_MonBloodbar_C::Slot01_47' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_48) == 0x000638, "Member 'UUw_fight_MonBloodbar_C::Slot01_48' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_49) == 0x000640, "Member 'UUw_fight_MonBloodbar_C::Slot01_49' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_50) == 0x000648, "Member 'UUw_fight_MonBloodbar_C::Slot01_50' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_51) == 0x000650, "Member 'UUw_fight_MonBloodbar_C::Slot01_51' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_52) == 0x000658, "Member 'UUw_fight_MonBloodbar_C::Slot01_52' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_53) == 0x000660, "Member 'UUw_fight_MonBloodbar_C::Slot01_53' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_54) == 0x000668, "Member 'UUw_fight_MonBloodbar_C::Slot01_54' has a wrong offset!");
static_assert(offsetof(UUw_fight_MonBloodbar_C, Slot01_55) == 0x000670, "Member 'UUw_fight_MonBloodbar_C::Slot01_55' has a wrong offset!");

}

