#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_player_item_skill03_pc

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_player_item_skill03_pc.uw_fight_player_item_skill03_pc_C
// 0x0210 (0x0778 - 0x0568)
class UUw_fight_player_item_skill03_pc_C final : public UBackSuperSkillButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0568(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnSustain;                                         // 0x0570(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Finish;                                            // 0x0578(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CdNumber;                                          // 0x0580(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Enough;                                            // 0x0588(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Sustain;                                           // 0x0590(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Switch;                                            // 0x0598(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Strong;                                            // 0x05A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         BarTier;                                           // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CanvasPanel;                                       // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UE_ui_fightstrong_03_p_C*               E_ui_fightstrong_03_p_C_98;                        // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Glow;                                              // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Glow_1;                                            // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Glow_2;                                            // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_3;                                           // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_4;                                           // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_5;                                           // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_66;                                          // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_81;                                          // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_104;                                         // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_169;                                         // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_384;                                         // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImageEnough;                                       // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBlack1;                                         // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBlack2;                                         // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBlack3;                                         // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBlack4;                                         // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBlack5;                                         // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBlack6;                                         // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBlack7;                                         // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBlack8;                                         // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgSustain2;                                       // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgSustain2_1;                                     // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgSwitch;                                         // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgSwitchOn1;                                      // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgSwitchOn2;                                      // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgWhite1;                                         // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgWhite2;                                         // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgWhite3;                                         // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgWhite4;                                         // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgWhite5;                                         // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgWhite6;                                         // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgWhite7;                                         // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgWhite8;                                         // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgWhiteLight1;                                    // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgWhiteLight2;                                    // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgWhiteLight3;                                    // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgWhiteLight4;                                    // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgWhiteLight5;                                    // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgWhiteLight6;                                    // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgWhiteLight7;                                    // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgWhiteLight8;                                    // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_skill_keybtn_C*               KeyBtn;                                            // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Number;                                            // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelKeyInfo;                                      // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelLangPress;                                    // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelStrong;                                       // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelSustain;                                      // 0x0730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelSwitch;                                       // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelTier;                                         // 0x0740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UE_ui_fightpower_01_p_C*                ParticleEnough;                                    // 0x0748(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Quan01;                                            // 0x0750(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Quan02;                                            // 0x0758(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtTier;                                           // 0x0760(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         White01;                                           // 0x0768(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         White02;                                           // 0x0770(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void K2_PlayFinishAnim();
	void K2_PlayEnoughAnim(bool bPlay);
	void OnSkillStrengthening(bool bStart);
	void OnSkillKeepInterrupt(bool bStart);
	void OnUIEffectSkillLongPress(bool bStart);
	void K2_OnCustomUmgAnimFinished(const class FName& AnimName);
	void ExecuteUbergraph_uw_fight_player_item_skill03_pc(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_player_item_skill03_pc_C">();
	}
	static class UUw_fight_player_item_skill03_pc_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_player_item_skill03_pc_C>();
	}
};
static_assert(alignof(UUw_fight_player_item_skill03_pc_C) == 0x000008, "Wrong alignment on UUw_fight_player_item_skill03_pc_C");
static_assert(sizeof(UUw_fight_player_item_skill03_pc_C) == 0x000778, "Wrong size on UUw_fight_player_item_skill03_pc_C");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, UberGraphFrame) == 0x000568, "Member 'UUw_fight_player_item_skill03_pc_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, OnSustain) == 0x000570, "Member 'UUw_fight_player_item_skill03_pc_C::OnSustain' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, Finish) == 0x000578, "Member 'UUw_fight_player_item_skill03_pc_C::Finish' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, CdNumber) == 0x000580, "Member 'UUw_fight_player_item_skill03_pc_C::CdNumber' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, Enough) == 0x000588, "Member 'UUw_fight_player_item_skill03_pc_C::Enough' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, Sustain) == 0x000590, "Member 'UUw_fight_player_item_skill03_pc_C::Sustain' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, Switch) == 0x000598, "Member 'UUw_fight_player_item_skill03_pc_C::Switch' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, Strong) == 0x0005A0, "Member 'UUw_fight_player_item_skill03_pc_C::Strong' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, BarTier) == 0x0005A8, "Member 'UUw_fight_player_item_skill03_pc_C::BarTier' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, CanvasPanel) == 0x0005B0, "Member 'UUw_fight_player_item_skill03_pc_C::CanvasPanel' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, E_ui_fightstrong_03_p_C_98) == 0x0005B8, "Member 'UUw_fight_player_item_skill03_pc_C::E_ui_fightstrong_03_p_C_98' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, Glow) == 0x0005C0, "Member 'UUw_fight_player_item_skill03_pc_C::Glow' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, Glow_1) == 0x0005C8, "Member 'UUw_fight_player_item_skill03_pc_C::Glow_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, Glow_2) == 0x0005D0, "Member 'UUw_fight_player_item_skill03_pc_C::Glow_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, Image_3) == 0x0005D8, "Member 'UUw_fight_player_item_skill03_pc_C::Image_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, Image_4) == 0x0005E0, "Member 'UUw_fight_player_item_skill03_pc_C::Image_4' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, Image_5) == 0x0005E8, "Member 'UUw_fight_player_item_skill03_pc_C::Image_5' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, Image_66) == 0x0005F0, "Member 'UUw_fight_player_item_skill03_pc_C::Image_66' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, Image_81) == 0x0005F8, "Member 'UUw_fight_player_item_skill03_pc_C::Image_81' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, Image_104) == 0x000600, "Member 'UUw_fight_player_item_skill03_pc_C::Image_104' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, Image_169) == 0x000608, "Member 'UUw_fight_player_item_skill03_pc_C::Image_169' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, Image_384) == 0x000610, "Member 'UUw_fight_player_item_skill03_pc_C::Image_384' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImageEnough) == 0x000618, "Member 'UUw_fight_player_item_skill03_pc_C::ImageEnough' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgBlack1) == 0x000620, "Member 'UUw_fight_player_item_skill03_pc_C::ImgBlack1' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgBlack2) == 0x000628, "Member 'UUw_fight_player_item_skill03_pc_C::ImgBlack2' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgBlack3) == 0x000630, "Member 'UUw_fight_player_item_skill03_pc_C::ImgBlack3' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgBlack4) == 0x000638, "Member 'UUw_fight_player_item_skill03_pc_C::ImgBlack4' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgBlack5) == 0x000640, "Member 'UUw_fight_player_item_skill03_pc_C::ImgBlack5' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgBlack6) == 0x000648, "Member 'UUw_fight_player_item_skill03_pc_C::ImgBlack6' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgBlack7) == 0x000650, "Member 'UUw_fight_player_item_skill03_pc_C::ImgBlack7' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgBlack8) == 0x000658, "Member 'UUw_fight_player_item_skill03_pc_C::ImgBlack8' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgSustain2) == 0x000660, "Member 'UUw_fight_player_item_skill03_pc_C::ImgSustain2' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgSustain2_1) == 0x000668, "Member 'UUw_fight_player_item_skill03_pc_C::ImgSustain2_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgSwitch) == 0x000670, "Member 'UUw_fight_player_item_skill03_pc_C::ImgSwitch' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgSwitchOn1) == 0x000678, "Member 'UUw_fight_player_item_skill03_pc_C::ImgSwitchOn1' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgSwitchOn2) == 0x000680, "Member 'UUw_fight_player_item_skill03_pc_C::ImgSwitchOn2' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgWhite1) == 0x000688, "Member 'UUw_fight_player_item_skill03_pc_C::ImgWhite1' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgWhite2) == 0x000690, "Member 'UUw_fight_player_item_skill03_pc_C::ImgWhite2' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgWhite3) == 0x000698, "Member 'UUw_fight_player_item_skill03_pc_C::ImgWhite3' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgWhite4) == 0x0006A0, "Member 'UUw_fight_player_item_skill03_pc_C::ImgWhite4' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgWhite5) == 0x0006A8, "Member 'UUw_fight_player_item_skill03_pc_C::ImgWhite5' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgWhite6) == 0x0006B0, "Member 'UUw_fight_player_item_skill03_pc_C::ImgWhite6' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgWhite7) == 0x0006B8, "Member 'UUw_fight_player_item_skill03_pc_C::ImgWhite7' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgWhite8) == 0x0006C0, "Member 'UUw_fight_player_item_skill03_pc_C::ImgWhite8' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgWhiteLight1) == 0x0006C8, "Member 'UUw_fight_player_item_skill03_pc_C::ImgWhiteLight1' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgWhiteLight2) == 0x0006D0, "Member 'UUw_fight_player_item_skill03_pc_C::ImgWhiteLight2' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgWhiteLight3) == 0x0006D8, "Member 'UUw_fight_player_item_skill03_pc_C::ImgWhiteLight3' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgWhiteLight4) == 0x0006E0, "Member 'UUw_fight_player_item_skill03_pc_C::ImgWhiteLight4' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgWhiteLight5) == 0x0006E8, "Member 'UUw_fight_player_item_skill03_pc_C::ImgWhiteLight5' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgWhiteLight6) == 0x0006F0, "Member 'UUw_fight_player_item_skill03_pc_C::ImgWhiteLight6' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgWhiteLight7) == 0x0006F8, "Member 'UUw_fight_player_item_skill03_pc_C::ImgWhiteLight7' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ImgWhiteLight8) == 0x000700, "Member 'UUw_fight_player_item_skill03_pc_C::ImgWhiteLight8' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, KeyBtn) == 0x000708, "Member 'UUw_fight_player_item_skill03_pc_C::KeyBtn' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, Number) == 0x000710, "Member 'UUw_fight_player_item_skill03_pc_C::Number' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, PanelKeyInfo) == 0x000718, "Member 'UUw_fight_player_item_skill03_pc_C::PanelKeyInfo' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, PanelLangPress) == 0x000720, "Member 'UUw_fight_player_item_skill03_pc_C::PanelLangPress' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, PanelStrong) == 0x000728, "Member 'UUw_fight_player_item_skill03_pc_C::PanelStrong' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, PanelSustain) == 0x000730, "Member 'UUw_fight_player_item_skill03_pc_C::PanelSustain' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, PanelSwitch) == 0x000738, "Member 'UUw_fight_player_item_skill03_pc_C::PanelSwitch' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, PanelTier) == 0x000740, "Member 'UUw_fight_player_item_skill03_pc_C::PanelTier' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, ParticleEnough) == 0x000748, "Member 'UUw_fight_player_item_skill03_pc_C::ParticleEnough' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, Quan01) == 0x000750, "Member 'UUw_fight_player_item_skill03_pc_C::Quan01' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, Quan02) == 0x000758, "Member 'UUw_fight_player_item_skill03_pc_C::Quan02' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, TxtTier) == 0x000760, "Member 'UUw_fight_player_item_skill03_pc_C::TxtTier' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, White01) == 0x000768, "Member 'UUw_fight_player_item_skill03_pc_C::White01' has a wrong offset!");
static_assert(offsetof(UUw_fight_player_item_skill03_pc_C, White02) == 0x000770, "Member 'UUw_fight_player_item_skill03_pc_C::White02' has a wrong offset!");

}

