#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_power_girl002a_0

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_power_girl002a.uw_fight_power_girl002a_C.PlayAnim
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_power_girl002a_C_PlayAnim final
{
public:
	bool                                          StateType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_power_girl002a_C_PlayAnim) == 0x000001, "Wrong alignment on Uw_fight_power_girl002a_C_PlayAnim");
static_assert(sizeof(Uw_fight_power_girl002a_C_PlayAnim) == 0x000001, "Wrong size on Uw_fight_power_girl002a_C_PlayAnim");
static_assert(offsetof(Uw_fight_power_girl002a_C_PlayAnim, StateType) == 0x000000, "Member 'Uw_fight_power_girl002a_C_PlayAnim::StateType' has a wrong offset!");

// Function uw_fight_power_girl002a.uw_fight_power_girl002a_C.ExecuteUbergraph_uw_fight_power_girl002a
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_power_girl002a_C_ExecuteUbergraph_uw_fight_power_girl002a final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_StateType;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_power_girl002a_C_ExecuteUbergraph_uw_fight_power_girl002a) == 0x000004, "Wrong alignment on Uw_fight_power_girl002a_C_ExecuteUbergraph_uw_fight_power_girl002a");
static_assert(sizeof(Uw_fight_power_girl002a_C_ExecuteUbergraph_uw_fight_power_girl002a) == 0x000008, "Wrong size on Uw_fight_power_girl002a_C_ExecuteUbergraph_uw_fight_power_girl002a");
static_assert(offsetof(Uw_fight_power_girl002a_C_ExecuteUbergraph_uw_fight_power_girl002a, EntryPoint) == 0x000000, "Member 'Uw_fight_power_girl002a_C_ExecuteUbergraph_uw_fight_power_girl002a::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_C_ExecuteUbergraph_uw_fight_power_girl002a, K2Node_Event_StateType) == 0x000004, "Member 'Uw_fight_power_girl002a_C_ExecuteUbergraph_uw_fight_power_girl002a::K2Node_Event_StateType' has a wrong offset!");

}

