#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_reload_button_new

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function uw_fight_reload_button_new.uw_fight_reload_button_new_C.K2_OnCharacterChange
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_reload_button_new_C_K2_OnCharacterChange final
{
public:
	class AGameCharacter*                         Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_reload_button_new_C_K2_OnCharacterChange) == 0x000008, "Wrong alignment on Uw_fight_reload_button_new_C_K2_OnCharacterChange");
static_assert(sizeof(Uw_fight_reload_button_new_C_K2_OnCharacterChange) == 0x000008, "Wrong size on Uw_fight_reload_button_new_C_K2_OnCharacterChange");
static_assert(offsetof(Uw_fight_reload_button_new_C_K2_OnCharacterChange, Character) == 0x000000, "Member 'Uw_fight_reload_button_new_C_K2_OnCharacterChange::Character' has a wrong offset!");

// Function uw_fight_reload_button_new.uw_fight_reload_button_new_C.UpdateFromCharacter
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_reload_button_new_C_UpdateFromCharacter final
{
public:
	class AGameCharacter*                         Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_reload_button_new_C_UpdateFromCharacter) == 0x000008, "Wrong alignment on Uw_fight_reload_button_new_C_UpdateFromCharacter");
static_assert(sizeof(Uw_fight_reload_button_new_C_UpdateFromCharacter) == 0x000008, "Wrong size on Uw_fight_reload_button_new_C_UpdateFromCharacter");
static_assert(offsetof(Uw_fight_reload_button_new_C_UpdateFromCharacter, Character) == 0x000000, "Member 'Uw_fight_reload_button_new_C_UpdateFromCharacter::Character' has a wrong offset!");

// Function uw_fight_reload_button_new.uw_fight_reload_button_new_C.ExecuteUbergraph_uw_fight_reload_button_new
// 0x0070 (0x0070 - 0x0000)
struct Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeaponType                                   K2Node_Event_WeaponType;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_WeaponMode;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_Event_Character;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_CustomEvent_Character;                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayerController*                  K2Node_DynamicCast_AsGame_Player_Controller;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGameCharacter*>                 CallFunc_GetPlayerCharacters_ReturnValue;          // 0x0048(0x0010)(ReferenceParm)
	class APlayerWeapon*                          CallFunc_GetWeapon_ReturnValue;                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new) == 0x000008, "Wrong alignment on Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new");
static_assert(sizeof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new) == 0x000070, "Wrong size on Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, EntryPoint) == 0x000000, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, K2Node_Event_WeaponType) == 0x000004, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::K2Node_Event_WeaponType' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, K2Node_Event_WeaponMode) == 0x000008, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::K2Node_Event_WeaponMode' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, K2Node_SwitchInteger_CmpSuccess) == 0x00000C, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000D, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00000E, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00000F, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, CallFunc_BooleanOR_ReturnValue) == 0x000010, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000011, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, CallFunc_BooleanOR_ReturnValue_1) == 0x000012, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, K2Node_Event_Character) == 0x000018, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::K2Node_Event_Character' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, K2Node_CustomEvent_Character) == 0x000020, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, K2Node_DynamicCast_AsGame_Player_Controller) == 0x000038, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::K2Node_DynamicCast_AsGame_Player_Controller' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, CallFunc_GetPlayerCharacters_ReturnValue) == 0x000048, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::CallFunc_GetPlayerCharacters_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, CallFunc_GetWeapon_ReturnValue) == 0x000058, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, CallFunc_Array_Get_Item) == 0x000060, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, CallFunc_IsValid_ReturnValue_2) == 0x000069, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x00006A, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x00006B, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x00006C, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, CallFunc_BooleanOR_ReturnValue_2) == 0x00006D, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, CallFunc_EqualEqual_ByteByte_ReturnValue_7) == 0x00006E, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::CallFunc_EqualEqual_ByteByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new, CallFunc_BooleanOR_ReturnValue_3) == 0x00006F, "Member 'Uw_fight_reload_button_new_C_ExecuteUbergraph_uw_fight_reload_button_new::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");

// Function uw_fight_reload_button_new.uw_fight_reload_button_new_C.ChangeIcon
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_reload_button_new_C_ChangeIcon final
{
public:
	EWeaponType                                   WeaponType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WeaponMode;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_reload_button_new_C_ChangeIcon) == 0x000004, "Wrong alignment on Uw_fight_reload_button_new_C_ChangeIcon");
static_assert(sizeof(Uw_fight_reload_button_new_C_ChangeIcon) == 0x000008, "Wrong size on Uw_fight_reload_button_new_C_ChangeIcon");
static_assert(offsetof(Uw_fight_reload_button_new_C_ChangeIcon, WeaponType) == 0x000000, "Member 'Uw_fight_reload_button_new_C_ChangeIcon::WeaponType' has a wrong offset!");
static_assert(offsetof(Uw_fight_reload_button_new_C_ChangeIcon, WeaponMode) == 0x000004, "Member 'Uw_fight_reload_button_new_C_ChangeIcon::WeaponMode' has a wrong offset!");

}

