#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_damage_Z_081

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_damage_Z_081.uw_fight_damage_Z_081_C
// 0x0030 (0x0410 - 0x03E0)
class UUw_fight_damage_Z_081_C final : public UDamageFloat_Base
{
public:
	class UWidgetAnimation*                       One_Anim4;                                         // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       One_Anim3;                                         // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       One_Anim2;                                         // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       One_Anim1;                                         // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUw_fight_damage_num_C*                 Num;                                               // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_79;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_damage_Z_081_C">();
	}
	static class UUw_fight_damage_Z_081_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_damage_Z_081_C>();
	}
};
static_assert(alignof(UUw_fight_damage_Z_081_C) == 0x000008, "Wrong alignment on UUw_fight_damage_Z_081_C");
static_assert(sizeof(UUw_fight_damage_Z_081_C) == 0x000410, "Wrong size on UUw_fight_damage_Z_081_C");
static_assert(offsetof(UUw_fight_damage_Z_081_C, One_Anim4) == 0x0003E0, "Member 'UUw_fight_damage_Z_081_C::One_Anim4' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_Z_081_C, One_Anim3) == 0x0003E8, "Member 'UUw_fight_damage_Z_081_C::One_Anim3' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_Z_081_C, One_Anim2) == 0x0003F0, "Member 'UUw_fight_damage_Z_081_C::One_Anim2' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_Z_081_C, One_Anim1) == 0x0003F8, "Member 'UUw_fight_damage_Z_081_C::One_Anim1' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_Z_081_C, Num) == 0x000400, "Member 'UUw_fight_damage_Z_081_C::Num' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_Z_081_C, Overlay_79) == 0x000408, "Member 'UUw_fight_damage_Z_081_C::Overlay_79' has a wrong offset!");

}

