#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_effect

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_effect.uw_fight_effect_C.OnHit__Overridden
// 0x000C (0x000C - 0x0000)
struct Uw_fight_effect_C_OnHit__Overridden final
{
public:
	float                                         Angle;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Shield;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBigHit;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_effect_C_OnHit__Overridden) == 0x000004, "Wrong alignment on Uw_fight_effect_C_OnHit__Overridden");
static_assert(sizeof(Uw_fight_effect_C_OnHit__Overridden) == 0x00000C, "Wrong size on Uw_fight_effect_C_OnHit__Overridden");
static_assert(offsetof(Uw_fight_effect_C_OnHit__Overridden, Angle) == 0x000000, "Member 'Uw_fight_effect_C_OnHit__Overridden::Angle' has a wrong offset!");
static_assert(offsetof(Uw_fight_effect_C_OnHit__Overridden, Shield) == 0x000004, "Member 'Uw_fight_effect_C_OnHit__Overridden::Shield' has a wrong offset!");
static_assert(offsetof(Uw_fight_effect_C_OnHit__Overridden, IsBigHit) == 0x000008, "Member 'Uw_fight_effect_C_OnHit__Overridden::IsBigHit' has a wrong offset!");

// Function uw_fight_effect.uw_fight_effect_C.ExecuteUbergraph_uw_fight_effect
// 0x0010 (0x0010 - 0x0000)
struct Uw_fight_effect_C_ExecuteUbergraph_uw_fight_effect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Angle;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Shield;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsBigHit;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_effect_C_ExecuteUbergraph_uw_fight_effect) == 0x000004, "Wrong alignment on Uw_fight_effect_C_ExecuteUbergraph_uw_fight_effect");
static_assert(sizeof(Uw_fight_effect_C_ExecuteUbergraph_uw_fight_effect) == 0x000010, "Wrong size on Uw_fight_effect_C_ExecuteUbergraph_uw_fight_effect");
static_assert(offsetof(Uw_fight_effect_C_ExecuteUbergraph_uw_fight_effect, EntryPoint) == 0x000000, "Member 'Uw_fight_effect_C_ExecuteUbergraph_uw_fight_effect::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_effect_C_ExecuteUbergraph_uw_fight_effect, K2Node_Event_Angle) == 0x000004, "Member 'Uw_fight_effect_C_ExecuteUbergraph_uw_fight_effect::K2Node_Event_Angle' has a wrong offset!");
static_assert(offsetof(Uw_fight_effect_C_ExecuteUbergraph_uw_fight_effect, K2Node_Event_Shield) == 0x000008, "Member 'Uw_fight_effect_C_ExecuteUbergraph_uw_fight_effect::K2Node_Event_Shield' has a wrong offset!");
static_assert(offsetof(Uw_fight_effect_C_ExecuteUbergraph_uw_fight_effect, K2Node_Event_IsBigHit) == 0x00000C, "Member 'Uw_fight_effect_C_ExecuteUbergraph_uw_fight_effect::K2Node_Event_IsBigHit' has a wrong offset!");

// LuaFunction uw_fight_effect.uw_fight_effect_C.OnHit
// 0x000C (0x000C - 0x0000)
struct Uw_fight_effect_C_OnHit final
{
public:
	float                                         Angle;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Shield;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBigHit;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_effect_C_OnHit) == 0x000004, "Wrong alignment on Uw_fight_effect_C_OnHit");
static_assert(sizeof(Uw_fight_effect_C_OnHit) == 0x00000C, "Wrong size on Uw_fight_effect_C_OnHit");
static_assert(offsetof(Uw_fight_effect_C_OnHit, Angle) == 0x000000, "Member 'Uw_fight_effect_C_OnHit::Angle' has a wrong offset!");
static_assert(offsetof(Uw_fight_effect_C_OnHit, Shield) == 0x000004, "Member 'Uw_fight_effect_C_OnHit::Shield' has a wrong offset!");
static_assert(offsetof(Uw_fight_effect_C_OnHit, IsBigHit) == 0x000008, "Member 'Uw_fight_effect_C_OnHit::IsBigHit' has a wrong offset!");

// Function uw_fight_effect.uw_fight_effect_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Uw_fight_effect_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_effect_C_GetModuleName) == 0x000008, "Wrong alignment on Uw_fight_effect_C_GetModuleName");
static_assert(sizeof(Uw_fight_effect_C_GetModuleName) == 0x000010, "Wrong size on Uw_fight_effect_C_GetModuleName");
static_assert(offsetof(Uw_fight_effect_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Uw_fight_effect_C_GetModuleName::ReturnValue' has a wrong offset!");

}

