#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_skill_panel_pc

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_skill_panel_pc.uw_fight_skill_panel_pc_C
// 0x0020 (0x0458 - 0x0438)
class UUw_fight_skill_panel_pc_C final : public USkillPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUw_fight_jump_button_new_pc_C*         JumpNew;                                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_skill_button_pc_C*            Skill1;                                            // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_skill03_button_pc_C*          Skill3;                                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnWeaponChange(class APlayerWeapon* InWeapon);
	void ShowOrHideCancelBtn(bool bShow);
	void ExecuteUbergraph_uw_fight_skill_panel_pc(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_skill_panel_pc_C">();
	}
	static class UUw_fight_skill_panel_pc_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_skill_panel_pc_C>();
	}
};
static_assert(alignof(UUw_fight_skill_panel_pc_C) == 0x000008, "Wrong alignment on UUw_fight_skill_panel_pc_C");
static_assert(sizeof(UUw_fight_skill_panel_pc_C) == 0x000458, "Wrong size on UUw_fight_skill_panel_pc_C");
static_assert(offsetof(UUw_fight_skill_panel_pc_C, UberGraphFrame) == 0x000438, "Member 'UUw_fight_skill_panel_pc_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_skill_panel_pc_C, JumpNew) == 0x000440, "Member 'UUw_fight_skill_panel_pc_C::JumpNew' has a wrong offset!");
static_assert(offsetof(UUw_fight_skill_panel_pc_C, Skill1) == 0x000448, "Member 'UUw_fight_skill_panel_pc_C::Skill1' has a wrong offset!");
static_assert(offsetof(UUw_fight_skill_panel_pc_C, Skill3) == 0x000450, "Member 'UUw_fight_skill_panel_pc_C::Skill3' has a wrong offset!");

}

