#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_direction_box

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_direction_box.uw_fight_direction_box_C
// 0x0068 (0x0868 - 0x0800)
class UUw_fight_direction_box_C final : public UFightMonsterTipsItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0800(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0808(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appear;                                            // 0x0810(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Image_20;                                          // 0x0818(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_22;                                          // 0x0820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_24;                                          // 0x0828(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_29;                                          // 0x0830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_33;                                          // 0x0838(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_169;                                         // 0x0840(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_bai;                                         // 0x0848(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgArrow13;                                        // 0x0850(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgDown;                                           // 0x0858(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgHeight;                                         // 0x0860(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void StartLoop(const class UObject* Object, bool HasAppear);
	void SetDefendTargetPercent(float Value);
	void PlayDieAnim();
	void AppearFinish(class UWidgetAnimation* Animation);
	void PlayTypeAnim();
	void ExecuteUbergraph_uw_fight_direction_box(int32 EntryPoint);
	void SequenceEvent__ENTRYPOINTuw_fight_direction_box_0();
	void OnVisibilityChanged_Event_0(ESlateVisibility InVisibility);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_direction_box_C">();
	}
	static class UUw_fight_direction_box_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_direction_box_C>();
	}
};
static_assert(alignof(UUw_fight_direction_box_C) == 0x000008, "Wrong alignment on UUw_fight_direction_box_C");
static_assert(sizeof(UUw_fight_direction_box_C) == 0x000868, "Wrong size on UUw_fight_direction_box_C");
static_assert(offsetof(UUw_fight_direction_box_C, UberGraphFrame) == 0x000800, "Member 'UUw_fight_direction_box_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_box_C, Loop) == 0x000808, "Member 'UUw_fight_direction_box_C::Loop' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_box_C, Appear) == 0x000810, "Member 'UUw_fight_direction_box_C::Appear' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_box_C, Image_20) == 0x000818, "Member 'UUw_fight_direction_box_C::Image_20' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_box_C, Image_22) == 0x000820, "Member 'UUw_fight_direction_box_C::Image_22' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_box_C, Image_24) == 0x000828, "Member 'UUw_fight_direction_box_C::Image_24' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_box_C, Image_29) == 0x000830, "Member 'UUw_fight_direction_box_C::Image_29' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_box_C, Image_33) == 0x000838, "Member 'UUw_fight_direction_box_C::Image_33' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_box_C, Image_169) == 0x000840, "Member 'UUw_fight_direction_box_C::Image_169' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_box_C, Image_bai) == 0x000848, "Member 'UUw_fight_direction_box_C::Image_bai' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_box_C, ImgArrow13) == 0x000850, "Member 'UUw_fight_direction_box_C::ImgArrow13' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_box_C, ImgDown) == 0x000858, "Member 'UUw_fight_direction_box_C::ImgDown' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_box_C, ImgHeight) == 0x000860, "Member 'UUw_fight_direction_box_C::ImgHeight' has a wrong offset!");

}

