#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_rush_button_new

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_rush_button_new.uw_fight_rush_button_new_C
// 0x0090 (0x0568 - 0x04D8)
class UUw_fight_rush_button_new_C final : public UNewRushButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnSwitch;                                          // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Oncdreset;                                         // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CdNumber;                                          // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Switch;                                            // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Sustain;                                           // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ReduceCD;                                          // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Strong;                                            // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Oncd;                                              // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Qta_cd;                                            // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Container;                                         // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBar;                                            // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBG;                                             // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgIcon;                                           // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgOnBG;                                           // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgReduce;                                         // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         PressImg;                                          // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bStartDerivedAnim;                                 // 0x0560(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_561[0x3];                                      // 0x0561(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SoundId;                                           // 0x0564(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_uw_fight_rush_button_new(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_rush_button_new_C">();
	}
	static class UUw_fight_rush_button_new_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_rush_button_new_C>();
	}
};
static_assert(alignof(UUw_fight_rush_button_new_C) == 0x000008, "Wrong alignment on UUw_fight_rush_button_new_C");
static_assert(sizeof(UUw_fight_rush_button_new_C) == 0x000568, "Wrong size on UUw_fight_rush_button_new_C");
static_assert(offsetof(UUw_fight_rush_button_new_C, UberGraphFrame) == 0x0004D8, "Member 'UUw_fight_rush_button_new_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_rush_button_new_C, OnSwitch) == 0x0004E0, "Member 'UUw_fight_rush_button_new_C::OnSwitch' has a wrong offset!");
static_assert(offsetof(UUw_fight_rush_button_new_C, Oncdreset) == 0x0004E8, "Member 'UUw_fight_rush_button_new_C::Oncdreset' has a wrong offset!");
static_assert(offsetof(UUw_fight_rush_button_new_C, CdNumber) == 0x0004F0, "Member 'UUw_fight_rush_button_new_C::CdNumber' has a wrong offset!");
static_assert(offsetof(UUw_fight_rush_button_new_C, Switch) == 0x0004F8, "Member 'UUw_fight_rush_button_new_C::Switch' has a wrong offset!");
static_assert(offsetof(UUw_fight_rush_button_new_C, Sustain) == 0x000500, "Member 'UUw_fight_rush_button_new_C::Sustain' has a wrong offset!");
static_assert(offsetof(UUw_fight_rush_button_new_C, ReduceCD) == 0x000508, "Member 'UUw_fight_rush_button_new_C::ReduceCD' has a wrong offset!");
static_assert(offsetof(UUw_fight_rush_button_new_C, Strong) == 0x000510, "Member 'UUw_fight_rush_button_new_C::Strong' has a wrong offset!");
static_assert(offsetof(UUw_fight_rush_button_new_C, Oncd) == 0x000518, "Member 'UUw_fight_rush_button_new_C::Oncd' has a wrong offset!");
static_assert(offsetof(UUw_fight_rush_button_new_C, Qta_cd) == 0x000520, "Member 'UUw_fight_rush_button_new_C::Qta_cd' has a wrong offset!");
static_assert(offsetof(UUw_fight_rush_button_new_C, Container) == 0x000528, "Member 'UUw_fight_rush_button_new_C::Container' has a wrong offset!");
static_assert(offsetof(UUw_fight_rush_button_new_C, ImgBar) == 0x000530, "Member 'UUw_fight_rush_button_new_C::ImgBar' has a wrong offset!");
static_assert(offsetof(UUw_fight_rush_button_new_C, ImgBG) == 0x000538, "Member 'UUw_fight_rush_button_new_C::ImgBG' has a wrong offset!");
static_assert(offsetof(UUw_fight_rush_button_new_C, ImgIcon) == 0x000540, "Member 'UUw_fight_rush_button_new_C::ImgIcon' has a wrong offset!");
static_assert(offsetof(UUw_fight_rush_button_new_C, ImgOnBG) == 0x000548, "Member 'UUw_fight_rush_button_new_C::ImgOnBG' has a wrong offset!");
static_assert(offsetof(UUw_fight_rush_button_new_C, ImgReduce) == 0x000550, "Member 'UUw_fight_rush_button_new_C::ImgReduce' has a wrong offset!");
static_assert(offsetof(UUw_fight_rush_button_new_C, PressImg) == 0x000558, "Member 'UUw_fight_rush_button_new_C::PressImg' has a wrong offset!");
static_assert(offsetof(UUw_fight_rush_button_new_C, bStartDerivedAnim) == 0x000560, "Member 'UUw_fight_rush_button_new_C::bStartDerivedAnim' has a wrong offset!");
static_assert(offsetof(UUw_fight_rush_button_new_C, SoundId) == 0x000564, "Member 'UUw_fight_rush_button_new_C::SoundId' has a wrong offset!");

}

