#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_injured_subitem1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_injured_subitem1.uw_fight_injured_subitem1_C
// 0x0038 (0x0380 - 0x0348)
class UUw_fight_injured_subitem1_C final : public UUserWidgetAnimation
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       bighit_leftright;                                  // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hit_leftright;                                     // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         ImgBig;                                            // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgFog;                                            // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgSmall;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bPlaying;                                          // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x3];                                      // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartTime;                                         // 0x037C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void K2_OnCustomUmgAnimFinished(const class FName& AnimName);
	void ExecuteUbergraph_uw_fight_injured_subitem1(int32 EntryPoint);
	void Play(bool IsBigDamage);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_injured_subitem1_C">();
	}
	static class UUw_fight_injured_subitem1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_injured_subitem1_C>();
	}
};
static_assert(alignof(UUw_fight_injured_subitem1_C) == 0x000008, "Wrong alignment on UUw_fight_injured_subitem1_C");
static_assert(sizeof(UUw_fight_injured_subitem1_C) == 0x000380, "Wrong size on UUw_fight_injured_subitem1_C");
static_assert(offsetof(UUw_fight_injured_subitem1_C, UberGraphFrame) == 0x000348, "Member 'UUw_fight_injured_subitem1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_injured_subitem1_C, bighit_leftright) == 0x000350, "Member 'UUw_fight_injured_subitem1_C::bighit_leftright' has a wrong offset!");
static_assert(offsetof(UUw_fight_injured_subitem1_C, Hit_leftright) == 0x000358, "Member 'UUw_fight_injured_subitem1_C::Hit_leftright' has a wrong offset!");
static_assert(offsetof(UUw_fight_injured_subitem1_C, ImgBig) == 0x000360, "Member 'UUw_fight_injured_subitem1_C::ImgBig' has a wrong offset!");
static_assert(offsetof(UUw_fight_injured_subitem1_C, ImgFog) == 0x000368, "Member 'UUw_fight_injured_subitem1_C::ImgFog' has a wrong offset!");
static_assert(offsetof(UUw_fight_injured_subitem1_C, ImgSmall) == 0x000370, "Member 'UUw_fight_injured_subitem1_C::ImgSmall' has a wrong offset!");
static_assert(offsetof(UUw_fight_injured_subitem1_C, bPlaying) == 0x000378, "Member 'UUw_fight_injured_subitem1_C::bPlaying' has a wrong offset!");
static_assert(offsetof(UUw_fight_injured_subitem1_C, StartTime) == 0x00037C, "Member 'UUw_fight_injured_subitem1_C::StartTime' has a wrong offset!");

}

