#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_fight_npc_title

#include "Basic.hpp"


namespace SDK::Params
{

// LuaFunction uw_fight_npc_title.uw_fight_npc_title_C.SetNpcName
// 0x0018 (0x0018 - 0x0000)
struct uw_fight_npc_title_C_SetNpcName final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_uw_fight_npc_title_C_SetNpcName;

// LuaFunction uw_fight_npc_title.uw_fight_npc_title_C.AllocNewWidget
// 0x0008 (0x0008 - 0x0000)
struct uw_fight_npc_title_C_AllocNewWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_uw_fight_npc_title_C_AllocNewWidget;

// LuaFunction uw_fight_npc_title.uw_fight_npc_title_C.FreeWidget
// 0x0008 (0x0008 - 0x0000)
struct uw_fight_npc_title_C_FreeWidget final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_uw_fight_npc_title_C_FreeWidget;

// Function uw_fight_npc_title.uw_fight_npc_title_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct uw_fight_npc_title_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_npc_title_C_GetModuleName;

}

