#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_injured_subitem

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_injured_subitem.uw_fight_injured_subitem_C.K2_OnCustomUmgAnimFinished
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_injured_subitem_C_K2_OnCustomUmgAnimFinished final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_injured_subitem_C_K2_OnCustomUmgAnimFinished) == 0x000004, "Wrong alignment on Uw_fight_injured_subitem_C_K2_OnCustomUmgAnimFinished");
static_assert(sizeof(Uw_fight_injured_subitem_C_K2_OnCustomUmgAnimFinished) == 0x000008, "Wrong size on Uw_fight_injured_subitem_C_K2_OnCustomUmgAnimFinished");
static_assert(offsetof(Uw_fight_injured_subitem_C_K2_OnCustomUmgAnimFinished, AnimName) == 0x000000, "Member 'Uw_fight_injured_subitem_C_K2_OnCustomUmgAnimFinished::AnimName' has a wrong offset!");

// Function uw_fight_injured_subitem.uw_fight_injured_subitem_C.ExecuteUbergraph_uw_fight_injured_subitem
// 0x0010 (0x0010 - 0x0000)
struct Uw_fight_injured_subitem_C_ExecuteUbergraph_uw_fight_injured_subitem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimName;                             // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_injured_subitem_C_ExecuteUbergraph_uw_fight_injured_subitem) == 0x000004, "Wrong alignment on Uw_fight_injured_subitem_C_ExecuteUbergraph_uw_fight_injured_subitem");
static_assert(sizeof(Uw_fight_injured_subitem_C_ExecuteUbergraph_uw_fight_injured_subitem) == 0x000010, "Wrong size on Uw_fight_injured_subitem_C_ExecuteUbergraph_uw_fight_injured_subitem");
static_assert(offsetof(Uw_fight_injured_subitem_C_ExecuteUbergraph_uw_fight_injured_subitem, EntryPoint) == 0x000000, "Member 'Uw_fight_injured_subitem_C_ExecuteUbergraph_uw_fight_injured_subitem::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_injured_subitem_C_ExecuteUbergraph_uw_fight_injured_subitem, K2Node_Event_AnimName) == 0x000004, "Member 'Uw_fight_injured_subitem_C_ExecuteUbergraph_uw_fight_injured_subitem::K2Node_Event_AnimName' has a wrong offset!");
static_assert(offsetof(Uw_fight_injured_subitem_C_ExecuteUbergraph_uw_fight_injured_subitem, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00000C, "Member 'Uw_fight_injured_subitem_C_ExecuteUbergraph_uw_fight_injured_subitem::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function uw_fight_injured_subitem.uw_fight_injured_subitem_C.Play
// 0x001C (0x001C - 0x0000)
struct Uw_fight_injured_subitem_C_Play final
{
public:
	bool                                          IsBigDamage;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable;                                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ___name_Variable;                                  // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ___name_Variable_1;                                // 0x000C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0014(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_injured_subitem_C_Play) == 0x000004, "Wrong alignment on Uw_fight_injured_subitem_C_Play");
static_assert(sizeof(Uw_fight_injured_subitem_C_Play) == 0x00001C, "Wrong size on Uw_fight_injured_subitem_C_Play");
static_assert(offsetof(Uw_fight_injured_subitem_C_Play, IsBigDamage) == 0x000000, "Member 'Uw_fight_injured_subitem_C_Play::IsBigDamage' has a wrong offset!");
static_assert(offsetof(Uw_fight_injured_subitem_C_Play, ___bool_Variable) == 0x000001, "Member 'Uw_fight_injured_subitem_C_Play::___bool_Variable' has a wrong offset!");
static_assert(offsetof(Uw_fight_injured_subitem_C_Play, ___name_Variable) == 0x000004, "Member 'Uw_fight_injured_subitem_C_Play::___name_Variable' has a wrong offset!");
static_assert(offsetof(Uw_fight_injured_subitem_C_Play, ___name_Variable_1) == 0x00000C, "Member 'Uw_fight_injured_subitem_C_Play::___name_Variable_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_injured_subitem_C_Play, K2Node_Select_Default) == 0x000014, "Member 'Uw_fight_injured_subitem_C_Play::K2Node_Select_Default' has a wrong offset!");

}

