#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_special_ui

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function uw_fight_special_ui.uw_fight_special_ui_C.Tick
// 0x003C (0x003C - 0x0000)
struct Uw_fight_special_ui_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_special_ui_C_Tick) == 0x000004, "Wrong alignment on Uw_fight_special_ui_C_Tick");
static_assert(sizeof(Uw_fight_special_ui_C_Tick) == 0x00003C, "Wrong size on Uw_fight_special_ui_C_Tick");
static_assert(offsetof(Uw_fight_special_ui_C_Tick, MyGeometry) == 0x000000, "Member 'Uw_fight_special_ui_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Uw_fight_special_ui_C_Tick, InDeltaTime) == 0x000038, "Member 'Uw_fight_special_ui_C_Tick::InDeltaTime' has a wrong offset!");

// Function uw_fight_special_ui.uw_fight_special_ui_C.ExecuteUbergraph_uw_fight_special_ui
// 0x0040 (0x0040 - 0x0000)
struct Uw_fight_special_ui_C_ExecuteUbergraph_uw_fight_special_ui final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_special_ui_C_ExecuteUbergraph_uw_fight_special_ui) == 0x000004, "Wrong alignment on Uw_fight_special_ui_C_ExecuteUbergraph_uw_fight_special_ui");
static_assert(sizeof(Uw_fight_special_ui_C_ExecuteUbergraph_uw_fight_special_ui) == 0x000040, "Wrong size on Uw_fight_special_ui_C_ExecuteUbergraph_uw_fight_special_ui");
static_assert(offsetof(Uw_fight_special_ui_C_ExecuteUbergraph_uw_fight_special_ui, EntryPoint) == 0x000000, "Member 'Uw_fight_special_ui_C_ExecuteUbergraph_uw_fight_special_ui::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_special_ui_C_ExecuteUbergraph_uw_fight_special_ui, K2Node_Event_MyGeometry) == 0x000004, "Member 'Uw_fight_special_ui_C_ExecuteUbergraph_uw_fight_special_ui::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Uw_fight_special_ui_C_ExecuteUbergraph_uw_fight_special_ui, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'Uw_fight_special_ui_C_ExecuteUbergraph_uw_fight_special_ui::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function uw_fight_special_ui.uw_fight_special_ui_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Uw_fight_special_ui_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_special_ui_C_GetModuleName) == 0x000008, "Wrong alignment on Uw_fight_special_ui_C_GetModuleName");
static_assert(sizeof(Uw_fight_special_ui_C_GetModuleName) == 0x000010, "Wrong size on Uw_fight_special_ui_C_GetModuleName");
static_assert(offsetof(Uw_fight_special_ui_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Uw_fight_special_ui_C_GetModuleName::ReturnValue' has a wrong offset!");

}

