#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_level_guard

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_level_guard.uw_fight_level_guard_C
// 0x00C8 (0x0410 - 0x0348)
class UUw_fight_level_guard_C final : public UUserWidgetAnimation
{
public:
	class UWidgetAnimation*                       TimeHint;                                          // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Animation_revert;                                  // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Animation_out_effect;                              // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TimeReduce;                                        // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TimeAdd;                                           // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TimeFinish;                                        // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TimeWarn;                                          // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Common;                                            // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         GameLevelTime;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image;                                             // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_55;                                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgLine11;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgLine12;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgLine21;                                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgLine22;                                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgMonter;                                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgTime;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameNiagaraSystemWidget*               NiagaraSystemWidget_61;                            // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     Txt1;                                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TXt2;                                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtGuardNum;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtTargetGuardNum;                                 // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtTimeChange;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtTimeSeconds;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void K2_OnUpdate(float InDeltaTime);
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_level_guard_C">();
	}
	static class UUw_fight_level_guard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_level_guard_C>();
	}
};
static_assert(alignof(UUw_fight_level_guard_C) == 0x000008, "Wrong alignment on UUw_fight_level_guard_C");
static_assert(sizeof(UUw_fight_level_guard_C) == 0x000410, "Wrong size on UUw_fight_level_guard_C");
static_assert(offsetof(UUw_fight_level_guard_C, TimeHint) == 0x000348, "Member 'UUw_fight_level_guard_C::TimeHint' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_guard_C, Animation_revert) == 0x000350, "Member 'UUw_fight_level_guard_C::Animation_revert' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_guard_C, Animation_out_effect) == 0x000358, "Member 'UUw_fight_level_guard_C::Animation_out_effect' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_guard_C, TimeReduce) == 0x000360, "Member 'UUw_fight_level_guard_C::TimeReduce' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_guard_C, TimeAdd) == 0x000368, "Member 'UUw_fight_level_guard_C::TimeAdd' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_guard_C, TimeFinish) == 0x000370, "Member 'UUw_fight_level_guard_C::TimeFinish' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_guard_C, TimeWarn) == 0x000378, "Member 'UUw_fight_level_guard_C::TimeWarn' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_guard_C, Common) == 0x000380, "Member 'UUw_fight_level_guard_C::Common' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_guard_C, GameLevelTime) == 0x000388, "Member 'UUw_fight_level_guard_C::GameLevelTime' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_guard_C, Image) == 0x000390, "Member 'UUw_fight_level_guard_C::Image' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_guard_C, Image_55) == 0x000398, "Member 'UUw_fight_level_guard_C::Image_55' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_guard_C, ImgLine11) == 0x0003A0, "Member 'UUw_fight_level_guard_C::ImgLine11' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_guard_C, ImgLine12) == 0x0003A8, "Member 'UUw_fight_level_guard_C::ImgLine12' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_guard_C, ImgLine21) == 0x0003B0, "Member 'UUw_fight_level_guard_C::ImgLine21' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_guard_C, ImgLine22) == 0x0003B8, "Member 'UUw_fight_level_guard_C::ImgLine22' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_guard_C, ImgMonter) == 0x0003C0, "Member 'UUw_fight_level_guard_C::ImgMonter' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_guard_C, ImgTime) == 0x0003C8, "Member 'UUw_fight_level_guard_C::ImgTime' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_guard_C, InvalidationBox_0) == 0x0003D0, "Member 'UUw_fight_level_guard_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_guard_C, NiagaraSystemWidget_61) == 0x0003D8, "Member 'UUw_fight_level_guard_C::NiagaraSystemWidget_61' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_guard_C, Txt1) == 0x0003E0, "Member 'UUw_fight_level_guard_C::Txt1' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_guard_C, TXt2) == 0x0003E8, "Member 'UUw_fight_level_guard_C::TXt2' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_guard_C, TxtGuardNum) == 0x0003F0, "Member 'UUw_fight_level_guard_C::TxtGuardNum' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_guard_C, TxtTargetGuardNum) == 0x0003F8, "Member 'UUw_fight_level_guard_C::TxtTargetGuardNum' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_guard_C, TxtTimeChange) == 0x000400, "Member 'UUw_fight_level_guard_C::TxtTimeChange' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_guard_C, TxtTimeSeconds) == 0x000408, "Member 'UUw_fight_level_guard_C::TxtTimeSeconds' has a wrong offset!");

}

