#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_ShowBunkerState

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_ShowBunkerState.uw_fight_ShowBunkerState_C
// 0x0018 (0x0360 - 0x0348)
class UUw_fight_ShowBunkerState_C final : public UUserWidgetAnimation
{
public:
	class URedirectTextBlock*                     State;                                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     State_1;                                           // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     State_2;                                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void K2_OnUpdate(float InDeltaTime);
	void Construct();
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_ShowBunkerState_C">();
	}
	static class UUw_fight_ShowBunkerState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_ShowBunkerState_C>();
	}
};
static_assert(alignof(UUw_fight_ShowBunkerState_C) == 0x000008, "Wrong alignment on UUw_fight_ShowBunkerState_C");
static_assert(sizeof(UUw_fight_ShowBunkerState_C) == 0x000360, "Wrong size on UUw_fight_ShowBunkerState_C");
static_assert(offsetof(UUw_fight_ShowBunkerState_C, State) == 0x000348, "Member 'UUw_fight_ShowBunkerState_C::State' has a wrong offset!");
static_assert(offsetof(UUw_fight_ShowBunkerState_C, State_1) == 0x000350, "Member 'UUw_fight_ShowBunkerState_C::State_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_ShowBunkerState_C, State_2) == 0x000358, "Member 'UUw_fight_ShowBunkerState_C::State_2' has a wrong offset!");

}

