#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_turret

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_turret.uw_fight_turret_C
// 0x0058 (0x0408 - 0x03B0)
class UUw_fight_turret_C final : public ULuaWidget
{
public:
	class UWidgetAnimation*                       Enter2;                                            // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Enter;                                             // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUw_fight_turret_aimbtn_C*              AimBtn;                                            // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_ammunition5_C*                Ammunition;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CanvasPanel_0;                                     // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_turret_closebtn_C*            CloseBtn;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_turret_cross_C*               Cross;                                             // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_turret_firebtn_C*             FireBtn;                                           // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image;                                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_turret_reload_C*              Reload;                                            // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Whit1;                                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void OnConstruct();
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_turret_C">();
	}
	static class UUw_fight_turret_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_turret_C>();
	}
};
static_assert(alignof(UUw_fight_turret_C) == 0x000008, "Wrong alignment on UUw_fight_turret_C");
static_assert(sizeof(UUw_fight_turret_C) == 0x000408, "Wrong size on UUw_fight_turret_C");
static_assert(offsetof(UUw_fight_turret_C, Enter2) == 0x0003B0, "Member 'UUw_fight_turret_C::Enter2' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_C, Enter) == 0x0003B8, "Member 'UUw_fight_turret_C::Enter' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_C, AimBtn) == 0x0003C0, "Member 'UUw_fight_turret_C::AimBtn' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_C, Ammunition) == 0x0003C8, "Member 'UUw_fight_turret_C::Ammunition' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_C, CanvasPanel_0) == 0x0003D0, "Member 'UUw_fight_turret_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_C, CloseBtn) == 0x0003D8, "Member 'UUw_fight_turret_C::CloseBtn' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_C, Cross) == 0x0003E0, "Member 'UUw_fight_turret_C::Cross' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_C, FireBtn) == 0x0003E8, "Member 'UUw_fight_turret_C::FireBtn' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_C, Image) == 0x0003F0, "Member 'UUw_fight_turret_C::Image' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_C, Reload) == 0x0003F8, "Member 'UUw_fight_turret_C::Reload' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_C, Whit1) == 0x000400, "Member 'UUw_fight_turret_C::Whit1' has a wrong offset!");

}

