#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_level_skillintro

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function uw_fight_level_skillintro.uw_fight_level_skillintro_C.Tick__Overridden
// 0x003C (0x003C - 0x0000)
struct Uw_fight_level_skillintro_C_Tick__Overridden final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_level_skillintro_C_Tick__Overridden) == 0x000004, "Wrong alignment on Uw_fight_level_skillintro_C_Tick__Overridden");
static_assert(sizeof(Uw_fight_level_skillintro_C_Tick__Overridden) == 0x00003C, "Wrong size on Uw_fight_level_skillintro_C_Tick__Overridden");
static_assert(offsetof(Uw_fight_level_skillintro_C_Tick__Overridden, MyGeometry) == 0x000000, "Member 'Uw_fight_level_skillintro_C_Tick__Overridden::MyGeometry' has a wrong offset!");
static_assert(offsetof(Uw_fight_level_skillintro_C_Tick__Overridden, InDeltaTime) == 0x000038, "Member 'Uw_fight_level_skillintro_C_Tick__Overridden::InDeltaTime' has a wrong offset!");

// Function uw_fight_level_skillintro.uw_fight_level_skillintro_C.ExecuteUbergraph_uw_fight_level_skillintro
// 0x0040 (0x0040 - 0x0000)
struct Uw_fight_level_skillintro_C_ExecuteUbergraph_uw_fight_level_skillintro final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_level_skillintro_C_ExecuteUbergraph_uw_fight_level_skillintro) == 0x000004, "Wrong alignment on Uw_fight_level_skillintro_C_ExecuteUbergraph_uw_fight_level_skillintro");
static_assert(sizeof(Uw_fight_level_skillintro_C_ExecuteUbergraph_uw_fight_level_skillintro) == 0x000040, "Wrong size on Uw_fight_level_skillintro_C_ExecuteUbergraph_uw_fight_level_skillintro");
static_assert(offsetof(Uw_fight_level_skillintro_C_ExecuteUbergraph_uw_fight_level_skillintro, EntryPoint) == 0x000000, "Member 'Uw_fight_level_skillintro_C_ExecuteUbergraph_uw_fight_level_skillintro::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_level_skillintro_C_ExecuteUbergraph_uw_fight_level_skillintro, K2Node_Event_MyGeometry) == 0x000004, "Member 'Uw_fight_level_skillintro_C_ExecuteUbergraph_uw_fight_level_skillintro::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Uw_fight_level_skillintro_C_ExecuteUbergraph_uw_fight_level_skillintro, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'Uw_fight_level_skillintro_C_ExecuteUbergraph_uw_fight_level_skillintro::K2Node_Event_InDeltaTime' has a wrong offset!");

// LuaFunction uw_fight_level_skillintro.uw_fight_level_skillintro_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_level_skillintro_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Uw_fight_level_skillintro_C_OnAnimationFinished) == 0x000008, "Wrong alignment on Uw_fight_level_skillintro_C_OnAnimationFinished");
static_assert(sizeof(Uw_fight_level_skillintro_C_OnAnimationFinished) == 0x000008, "Wrong size on Uw_fight_level_skillintro_C_OnAnimationFinished");
static_assert(offsetof(Uw_fight_level_skillintro_C_OnAnimationFinished, Animation) == 0x000000, "Member 'Uw_fight_level_skillintro_C_OnAnimationFinished::Animation' has a wrong offset!");

// LuaFunction uw_fight_level_skillintro.uw_fight_level_skillintro_C.Tick
// 0x003C (0x003C - 0x0000)
struct Uw_fight_level_skillintro_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_level_skillintro_C_Tick) == 0x000004, "Wrong alignment on Uw_fight_level_skillintro_C_Tick");
static_assert(sizeof(Uw_fight_level_skillintro_C_Tick) == 0x00003C, "Wrong size on Uw_fight_level_skillintro_C_Tick");
static_assert(offsetof(Uw_fight_level_skillintro_C_Tick, MyGeometry) == 0x000000, "Member 'Uw_fight_level_skillintro_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Uw_fight_level_skillintro_C_Tick, InDeltaTime) == 0x000038, "Member 'Uw_fight_level_skillintro_C_Tick::InDeltaTime' has a wrong offset!");

// Function uw_fight_level_skillintro.uw_fight_level_skillintro_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Uw_fight_level_skillintro_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_level_skillintro_C_GetModuleName) == 0x000008, "Wrong alignment on Uw_fight_level_skillintro_C_GetModuleName");
static_assert(sizeof(Uw_fight_level_skillintro_C_GetModuleName) == 0x000010, "Wrong size on Uw_fight_level_skillintro_C_GetModuleName");
static_assert(offsetof(Uw_fight_level_skillintro_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Uw_fight_level_skillintro_C_GetModuleName::ReturnValue' has a wrong offset!");

}

