#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_novice

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_novice.uw_fight_novice_C
// 0x0078 (0x02F8 - 0x0280)
class UUw_fight_novice_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       Arrow;                                             // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Finger;                                            // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Down;                                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Down2;                                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Down3;                                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Down4;                                             // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_55;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Mid;                                               // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Mid2;                                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Mid3;                                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Mid4;                                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Up;                                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Up2;                                               // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Up3;                                               // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Up4;                                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_novice_C">();
	}
	static class UUw_fight_novice_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_novice_C>();
	}
};
static_assert(alignof(UUw_fight_novice_C) == 0x000008, "Wrong alignment on UUw_fight_novice_C");
static_assert(sizeof(UUw_fight_novice_C) == 0x0002F8, "Wrong size on UUw_fight_novice_C");
static_assert(offsetof(UUw_fight_novice_C, Arrow) == 0x000280, "Member 'UUw_fight_novice_C::Arrow' has a wrong offset!");
static_assert(offsetof(UUw_fight_novice_C, Finger) == 0x000288, "Member 'UUw_fight_novice_C::Finger' has a wrong offset!");
static_assert(offsetof(UUw_fight_novice_C, Down) == 0x000290, "Member 'UUw_fight_novice_C::Down' has a wrong offset!");
static_assert(offsetof(UUw_fight_novice_C, Down2) == 0x000298, "Member 'UUw_fight_novice_C::Down2' has a wrong offset!");
static_assert(offsetof(UUw_fight_novice_C, Down3) == 0x0002A0, "Member 'UUw_fight_novice_C::Down3' has a wrong offset!");
static_assert(offsetof(UUw_fight_novice_C, Down4) == 0x0002A8, "Member 'UUw_fight_novice_C::Down4' has a wrong offset!");
static_assert(offsetof(UUw_fight_novice_C, Image_55) == 0x0002B0, "Member 'UUw_fight_novice_C::Image_55' has a wrong offset!");
static_assert(offsetof(UUw_fight_novice_C, Mid) == 0x0002B8, "Member 'UUw_fight_novice_C::Mid' has a wrong offset!");
static_assert(offsetof(UUw_fight_novice_C, Mid2) == 0x0002C0, "Member 'UUw_fight_novice_C::Mid2' has a wrong offset!");
static_assert(offsetof(UUw_fight_novice_C, Mid3) == 0x0002C8, "Member 'UUw_fight_novice_C::Mid3' has a wrong offset!");
static_assert(offsetof(UUw_fight_novice_C, Mid4) == 0x0002D0, "Member 'UUw_fight_novice_C::Mid4' has a wrong offset!");
static_assert(offsetof(UUw_fight_novice_C, Up) == 0x0002D8, "Member 'UUw_fight_novice_C::Up' has a wrong offset!");
static_assert(offsetof(UUw_fight_novice_C, Up2) == 0x0002E0, "Member 'UUw_fight_novice_C::Up2' has a wrong offset!");
static_assert(offsetof(UUw_fight_novice_C, Up3) == 0x0002E8, "Member 'UUw_fight_novice_C::Up3' has a wrong offset!");
static_assert(offsetof(UUw_fight_novice_C, Up4) == 0x0002F0, "Member 'UUw_fight_novice_C::Up4' has a wrong offset!");

}

