#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_bar_girl006a

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_bar_girl006a.uw_fight_bar_girl006a_C
// 0x0048 (0x0408 - 0x03C0)
class UUw_fight_bar_girl006a_C final : public UFightBarGirl006a
{
public:
	class URedirectImage*                         Four;                                              // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Four_12;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CanvasPanel_28;                                    // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image;                                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_1;                                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_2;                                           // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_3;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_54;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgNoPower_1;                                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_bar_girl006a_C">();
	}
	static class UUw_fight_bar_girl006a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_bar_girl006a_C>();
	}
};
static_assert(alignof(UUw_fight_bar_girl006a_C) == 0x000008, "Wrong alignment on UUw_fight_bar_girl006a_C");
static_assert(sizeof(UUw_fight_bar_girl006a_C) == 0x000408, "Wrong size on UUw_fight_bar_girl006a_C");
static_assert(offsetof(UUw_fight_bar_girl006a_C, Four) == 0x0003C0, "Member 'UUw_fight_bar_girl006a_C::Four' has a wrong offset!");
static_assert(offsetof(UUw_fight_bar_girl006a_C, Four_12) == 0x0003C8, "Member 'UUw_fight_bar_girl006a_C::Four_12' has a wrong offset!");
static_assert(offsetof(UUw_fight_bar_girl006a_C, CanvasPanel_28) == 0x0003D0, "Member 'UUw_fight_bar_girl006a_C::CanvasPanel_28' has a wrong offset!");
static_assert(offsetof(UUw_fight_bar_girl006a_C, Image) == 0x0003D8, "Member 'UUw_fight_bar_girl006a_C::Image' has a wrong offset!");
static_assert(offsetof(UUw_fight_bar_girl006a_C, Image_1) == 0x0003E0, "Member 'UUw_fight_bar_girl006a_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_bar_girl006a_C, Image_2) == 0x0003E8, "Member 'UUw_fight_bar_girl006a_C::Image_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_bar_girl006a_C, Image_3) == 0x0003F0, "Member 'UUw_fight_bar_girl006a_C::Image_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_bar_girl006a_C, Image_54) == 0x0003F8, "Member 'UUw_fight_bar_girl006a_C::Image_54' has a wrong offset!");
static_assert(offsetof(UUw_fight_bar_girl006a_C, ImgNoPower_1) == 0x000400, "Member 'UUw_fight_bar_girl006a_C::ImgNoPower_1' has a wrong offset!");

}

