#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_skill_button

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function uw_fight_skill_button.uw_fight_skill_button_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_skill_button_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_skill_button_C_PreConstruct) == 0x000001, "Wrong alignment on Uw_fight_skill_button_C_PreConstruct");
static_assert(sizeof(Uw_fight_skill_button_C_PreConstruct) == 0x000001, "Wrong size on Uw_fight_skill_button_C_PreConstruct");
static_assert(offsetof(Uw_fight_skill_button_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Uw_fight_skill_button_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function uw_fight_skill_button.uw_fight_skill_button_C.OnQTEStateChange
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_skill_button_C_OnQTEStateChange final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_skill_button_C_OnQTEStateChange) == 0x000001, "Wrong alignment on Uw_fight_skill_button_C_OnQTEStateChange");
static_assert(sizeof(Uw_fight_skill_button_C_OnQTEStateChange) == 0x000001, "Wrong size on Uw_fight_skill_button_C_OnQTEStateChange");
static_assert(offsetof(Uw_fight_skill_button_C_OnQTEStateChange, bActive) == 0x000000, "Member 'Uw_fight_skill_button_C_OnQTEStateChange::bActive' has a wrong offset!");

// Function uw_fight_skill_button.uw_fight_skill_button_C.OnModifyStateChange
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_skill_button_C_OnModifyStateChange final
{
public:
	bool                                          bModify;                                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_skill_button_C_OnModifyStateChange) == 0x000001, "Wrong alignment on Uw_fight_skill_button_C_OnModifyStateChange");
static_assert(sizeof(Uw_fight_skill_button_C_OnModifyStateChange) == 0x000001, "Wrong size on Uw_fight_skill_button_C_OnModifyStateChange");
static_assert(offsetof(Uw_fight_skill_button_C_OnModifyStateChange, bModify) == 0x000000, "Member 'Uw_fight_skill_button_C_OnModifyStateChange::bModify' has a wrong offset!");

// Function uw_fight_skill_button.uw_fight_skill_button_C.K2_PlayCDAnim
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_skill_button_C_K2_PlayCDAnim final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_skill_button_C_K2_PlayCDAnim) == 0x000001, "Wrong alignment on Uw_fight_skill_button_C_K2_PlayCDAnim");
static_assert(sizeof(Uw_fight_skill_button_C_K2_PlayCDAnim) == 0x000001, "Wrong size on Uw_fight_skill_button_C_K2_PlayCDAnim");
static_assert(offsetof(Uw_fight_skill_button_C_K2_PlayCDAnim, bPlay) == 0x000000, "Member 'Uw_fight_skill_button_C_K2_PlayCDAnim::bPlay' has a wrong offset!");

// Function uw_fight_skill_button.uw_fight_skill_button_C.OnSkillStrengthening
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_skill_button_C_OnSkillStrengthening final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_skill_button_C_OnSkillStrengthening) == 0x000001, "Wrong alignment on Uw_fight_skill_button_C_OnSkillStrengthening");
static_assert(sizeof(Uw_fight_skill_button_C_OnSkillStrengthening) == 0x000001, "Wrong size on Uw_fight_skill_button_C_OnSkillStrengthening");
static_assert(offsetof(Uw_fight_skill_button_C_OnSkillStrengthening, bStart) == 0x000000, "Member 'Uw_fight_skill_button_C_OnSkillStrengthening::bStart' has a wrong offset!");

// Function uw_fight_skill_button.uw_fight_skill_button_C.K2_NormalEnergyChange
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_skill_button_C_K2_NormalEnergyChange final
{
public:
	bool                                          bFull;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_skill_button_C_K2_NormalEnergyChange) == 0x000001, "Wrong alignment on Uw_fight_skill_button_C_K2_NormalEnergyChange");
static_assert(sizeof(Uw_fight_skill_button_C_K2_NormalEnergyChange) == 0x000001, "Wrong size on Uw_fight_skill_button_C_K2_NormalEnergyChange");
static_assert(offsetof(Uw_fight_skill_button_C_K2_NormalEnergyChange, bFull) == 0x000000, "Member 'Uw_fight_skill_button_C_K2_NormalEnergyChange::bFull' has a wrong offset!");

// Function uw_fight_skill_button.uw_fight_skill_button_C.K2_SetButtonForbid
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_skill_button_C_K2_SetButtonForbid final
{
public:
	bool                                          bForbid;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_skill_button_C_K2_SetButtonForbid) == 0x000001, "Wrong alignment on Uw_fight_skill_button_C_K2_SetButtonForbid");
static_assert(sizeof(Uw_fight_skill_button_C_K2_SetButtonForbid) == 0x000001, "Wrong size on Uw_fight_skill_button_C_K2_SetButtonForbid");
static_assert(offsetof(Uw_fight_skill_button_C_K2_SetButtonForbid, bForbid) == 0x000000, "Member 'Uw_fight_skill_button_C_K2_SetButtonForbid::bForbid' has a wrong offset!");

// Function uw_fight_skill_button.uw_fight_skill_button_C.PlayDerivedSkillAnim
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_skill_button_C_PlayDerivedSkillAnim final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_skill_button_C_PlayDerivedSkillAnim) == 0x000001, "Wrong alignment on Uw_fight_skill_button_C_PlayDerivedSkillAnim");
static_assert(sizeof(Uw_fight_skill_button_C_PlayDerivedSkillAnim) == 0x000001, "Wrong size on Uw_fight_skill_button_C_PlayDerivedSkillAnim");
static_assert(offsetof(Uw_fight_skill_button_C_PlayDerivedSkillAnim, bPlay) == 0x000000, "Member 'Uw_fight_skill_button_C_PlayDerivedSkillAnim::bPlay' has a wrong offset!");

// Function uw_fight_skill_button.uw_fight_skill_button_C.K2_PlaySustainAnim
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_skill_button_C_K2_PlaySustainAnim final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_skill_button_C_K2_PlaySustainAnim) == 0x000001, "Wrong alignment on Uw_fight_skill_button_C_K2_PlaySustainAnim");
static_assert(sizeof(Uw_fight_skill_button_C_K2_PlaySustainAnim) == 0x000001, "Wrong size on Uw_fight_skill_button_C_K2_PlaySustainAnim");
static_assert(offsetof(Uw_fight_skill_button_C_K2_PlaySustainAnim, bPlay) == 0x000000, "Member 'Uw_fight_skill_button_C_K2_PlaySustainAnim::bPlay' has a wrong offset!");

// Function uw_fight_skill_button.uw_fight_skill_button_C.OnButtonDom
// 0x0078 (0x0078 - 0x0000)
struct Uw_fight_skill_button_C_OnButtonDom final
{
public:
	int32                                         Type;                                              // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          InMouseEvent;                                      // 0x0008(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Uw_fight_skill_button_C_OnButtonDom) == 0x000008, "Wrong alignment on Uw_fight_skill_button_C_OnButtonDom");
static_assert(sizeof(Uw_fight_skill_button_C_OnButtonDom) == 0x000078, "Wrong size on Uw_fight_skill_button_C_OnButtonDom");
static_assert(offsetof(Uw_fight_skill_button_C_OnButtonDom, Type) == 0x000000, "Member 'Uw_fight_skill_button_C_OnButtonDom::Type' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_OnButtonDom, InMouseEvent) == 0x000008, "Member 'Uw_fight_skill_button_C_OnButtonDom::InMouseEvent' has a wrong offset!");

// Function uw_fight_skill_button.uw_fight_skill_button_C.OnSkillKeepInterrupt
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_skill_button_C_OnSkillKeepInterrupt final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_skill_button_C_OnSkillKeepInterrupt) == 0x000001, "Wrong alignment on Uw_fight_skill_button_C_OnSkillKeepInterrupt");
static_assert(sizeof(Uw_fight_skill_button_C_OnSkillKeepInterrupt) == 0x000001, "Wrong size on Uw_fight_skill_button_C_OnSkillKeepInterrupt");
static_assert(offsetof(Uw_fight_skill_button_C_OnSkillKeepInterrupt, bStart) == 0x000000, "Member 'Uw_fight_skill_button_C_OnSkillKeepInterrupt::bStart' has a wrong offset!");

// Function uw_fight_skill_button.uw_fight_skill_button_C.K2_OnCustomUmgAnimFinished__Overridden
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_skill_button_C_K2_OnCustomUmgAnimFinished__Overridden final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_skill_button_C_K2_OnCustomUmgAnimFinished__Overridden) == 0x000004, "Wrong alignment on Uw_fight_skill_button_C_K2_OnCustomUmgAnimFinished__Overridden");
static_assert(sizeof(Uw_fight_skill_button_C_K2_OnCustomUmgAnimFinished__Overridden) == 0x000008, "Wrong size on Uw_fight_skill_button_C_K2_OnCustomUmgAnimFinished__Overridden");
static_assert(offsetof(Uw_fight_skill_button_C_K2_OnCustomUmgAnimFinished__Overridden, AnimName) == 0x000000, "Member 'Uw_fight_skill_button_C_K2_OnCustomUmgAnimFinished__Overridden::AnimName' has a wrong offset!");

// Function uw_fight_skill_button.uw_fight_skill_button_C.ExecuteUbergraph_uw_fight_skill_button
// 0x00D0 (0x00D0 - 0x0000)
struct Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimName;                             // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bActive;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bModify;                              // 0x000F(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlay_2;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStart_1;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bFull;                                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bForbid;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlay_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlay;                                // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Type;                           // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_CustomEvent_InMouseEvent;                   // 0x0020(0x0070)(ConstParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameController_C*                   K2Node_DynamicCast_AsBP_Game_Controller;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRushMode_ReturnValue;                  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Type, struct FPointerEvent& InMouseEvent)> K2Node_CreateDelegate_OutputDelegate;              // 0x00BC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStart;                               // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button) == 0x000008, "Wrong alignment on Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button");
static_assert(sizeof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button) == 0x0000D0, "Wrong size on Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, EntryPoint) == 0x000000, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, K2Node_Event_AnimName) == 0x000004, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::K2Node_Event_AnimName' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00000C, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, K2Node_Event_IsDesignTime) == 0x00000D, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, K2Node_Event_bActive) == 0x00000E, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::K2Node_Event_bActive' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, K2Node_Event_bModify) == 0x00000F, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::K2Node_Event_bModify' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, K2Node_Event_bPlay_2) == 0x000010, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::K2Node_Event_bPlay_2' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000011, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, K2Node_Event_bStart_1) == 0x000012, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::K2Node_Event_bStart_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, K2Node_Event_bFull) == 0x000013, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::K2Node_Event_bFull' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, K2Node_Event_bForbid) == 0x000014, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::K2Node_Event_bForbid' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, K2Node_Event_bPlay_1) == 0x000015, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::K2Node_Event_bPlay_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, K2Node_Event_bPlay) == 0x000016, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::K2Node_Event_bPlay' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, K2Node_CustomEvent_Type) == 0x000018, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::K2Node_CustomEvent_Type' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, K2Node_CustomEvent_InMouseEvent) == 0x000020, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::K2Node_CustomEvent_InMouseEvent' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000090, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000091, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, CallFunc_GetPlayerController_ReturnValue) == 0x000098, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, CallFunc_BooleanOR_ReturnValue) == 0x0000A0, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, K2Node_DynamicCast_AsBP_Game_Controller) == 0x0000A8, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::K2Node_DynamicCast_AsBP_Game_Controller' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, CallFunc_GetRushMode_ReturnValue) == 0x0000B4, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::CallFunc_GetRushMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x0000B8, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x0000B9, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, K2Node_CreateDelegate_OutputDelegate) == 0x0000BC, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, CallFunc_BooleanAND_ReturnValue) == 0x0000CC, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button, K2Node_Event_bStart) == 0x0000CD, "Member 'Uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button::K2Node_Event_bStart' has a wrong offset!");

// LuaFunction uw_fight_skill_button.uw_fight_skill_button_C.K2_OnCustomUmgAnimFinished
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_skill_button_C_K2_OnCustomUmgAnimFinished final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_skill_button_C_K2_OnCustomUmgAnimFinished) == 0x000004, "Wrong alignment on Uw_fight_skill_button_C_K2_OnCustomUmgAnimFinished");
static_assert(sizeof(Uw_fight_skill_button_C_K2_OnCustomUmgAnimFinished) == 0x000008, "Wrong size on Uw_fight_skill_button_C_K2_OnCustomUmgAnimFinished");
static_assert(offsetof(Uw_fight_skill_button_C_K2_OnCustomUmgAnimFinished, AnimName) == 0x000000, "Member 'Uw_fight_skill_button_C_K2_OnCustomUmgAnimFinished::AnimName' has a wrong offset!");

// LuaFunction uw_fight_skill_button.uw_fight_skill_button_C.OnChargeTimesChange
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_skill_button_C_OnChargeTimesChange final
{
public:
	int32                                         InCurrentTimes;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InMaxTimes;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Uw_fight_skill_button_C_OnChargeTimesChange) == 0x000004, "Wrong alignment on Uw_fight_skill_button_C_OnChargeTimesChange");
static_assert(sizeof(Uw_fight_skill_button_C_OnChargeTimesChange) == 0x000008, "Wrong size on Uw_fight_skill_button_C_OnChargeTimesChange");
static_assert(offsetof(Uw_fight_skill_button_C_OnChargeTimesChange, InCurrentTimes) == 0x000000, "Member 'Uw_fight_skill_button_C_OnChargeTimesChange::InCurrentTimes' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_button_C_OnChargeTimesChange, InMaxTimes) == 0x000004, "Member 'Uw_fight_skill_button_C_OnChargeTimesChange::InMaxTimes' has a wrong offset!");

// Function uw_fight_skill_button.uw_fight_skill_button_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Uw_fight_skill_button_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_skill_button_C_GetModuleName) == 0x000008, "Wrong alignment on Uw_fight_skill_button_C_GetModuleName");
static_assert(sizeof(Uw_fight_skill_button_C_GetModuleName) == 0x000010, "Wrong size on Uw_fight_skill_button_C_GetModuleName");
static_assert(offsetof(Uw_fight_skill_button_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Uw_fight_skill_button_C_GetModuleName::ReturnValue' has a wrong offset!");

}

