#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_skill_aim_girl005askill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_skill_aim_girl005askill.uw_fight_skill_aim_girl005askill_C
// 0x0018 (0x0360 - 0x0348)
class UUw_fight_skill_aim_girl005askill_C final : public UFightModifierSpecialSignaItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ALLloop;                                           // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelSkill;                                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void OnVis(ESlateVisibility InVisibility);
	void Destruct();
	void ExecuteUbergraph_uw_fight_skill_aim_girl005askill(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_skill_aim_girl005askill_C">();
	}
	static class UUw_fight_skill_aim_girl005askill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_skill_aim_girl005askill_C>();
	}
};
static_assert(alignof(UUw_fight_skill_aim_girl005askill_C) == 0x000008, "Wrong alignment on UUw_fight_skill_aim_girl005askill_C");
static_assert(sizeof(UUw_fight_skill_aim_girl005askill_C) == 0x000360, "Wrong size on UUw_fight_skill_aim_girl005askill_C");
static_assert(offsetof(UUw_fight_skill_aim_girl005askill_C, UberGraphFrame) == 0x000348, "Member 'UUw_fight_skill_aim_girl005askill_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_skill_aim_girl005askill_C, ALLloop) == 0x000350, "Member 'UUw_fight_skill_aim_girl005askill_C::ALLloop' has a wrong offset!");
static_assert(offsetof(UUw_fight_skill_aim_girl005askill_C, PanelSkill) == 0x000358, "Member 'UUw_fight_skill_aim_girl005askill_C::PanelSkill' has a wrong offset!");

}

