#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_bar_girl008a

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_bar_girl008a.uw_fight_bar_girl008a_C
// 0x0078 (0x0498 - 0x0420)
class UUw_fight_bar_girl008a_C final : public UFightBarGirl008a2
{
public:
	class UGameCanvasPanel*                       CanvasPanel_28;                                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_141;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_194;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgNormal;                                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Line;                                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Line_1;                                            // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Line_img;                                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameNiagaraSystemWidget*               NiagaraSystemWidget_94;                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelBoundary;                                     // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Point1;                                            // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Point1_1;                                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Point2;                                            // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Point2_1;                                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Shang;                                             // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Xia;                                               // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_bar_girl008a_C">();
	}
	static class UUw_fight_bar_girl008a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_bar_girl008a_C>();
	}
};
static_assert(alignof(UUw_fight_bar_girl008a_C) == 0x000008, "Wrong alignment on UUw_fight_bar_girl008a_C");
static_assert(sizeof(UUw_fight_bar_girl008a_C) == 0x000498, "Wrong size on UUw_fight_bar_girl008a_C");
static_assert(offsetof(UUw_fight_bar_girl008a_C, CanvasPanel_28) == 0x000420, "Member 'UUw_fight_bar_girl008a_C::CanvasPanel_28' has a wrong offset!");
static_assert(offsetof(UUw_fight_bar_girl008a_C, Image_141) == 0x000428, "Member 'UUw_fight_bar_girl008a_C::Image_141' has a wrong offset!");
static_assert(offsetof(UUw_fight_bar_girl008a_C, Image_194) == 0x000430, "Member 'UUw_fight_bar_girl008a_C::Image_194' has a wrong offset!");
static_assert(offsetof(UUw_fight_bar_girl008a_C, ImgNormal) == 0x000438, "Member 'UUw_fight_bar_girl008a_C::ImgNormal' has a wrong offset!");
static_assert(offsetof(UUw_fight_bar_girl008a_C, Line) == 0x000440, "Member 'UUw_fight_bar_girl008a_C::Line' has a wrong offset!");
static_assert(offsetof(UUw_fight_bar_girl008a_C, Line_1) == 0x000448, "Member 'UUw_fight_bar_girl008a_C::Line_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_bar_girl008a_C, Line_img) == 0x000450, "Member 'UUw_fight_bar_girl008a_C::Line_img' has a wrong offset!");
static_assert(offsetof(UUw_fight_bar_girl008a_C, NiagaraSystemWidget_94) == 0x000458, "Member 'UUw_fight_bar_girl008a_C::NiagaraSystemWidget_94' has a wrong offset!");
static_assert(offsetof(UUw_fight_bar_girl008a_C, PanelBoundary) == 0x000460, "Member 'UUw_fight_bar_girl008a_C::PanelBoundary' has a wrong offset!");
static_assert(offsetof(UUw_fight_bar_girl008a_C, Point1) == 0x000468, "Member 'UUw_fight_bar_girl008a_C::Point1' has a wrong offset!");
static_assert(offsetof(UUw_fight_bar_girl008a_C, Point1_1) == 0x000470, "Member 'UUw_fight_bar_girl008a_C::Point1_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_bar_girl008a_C, Point2) == 0x000478, "Member 'UUw_fight_bar_girl008a_C::Point2' has a wrong offset!");
static_assert(offsetof(UUw_fight_bar_girl008a_C, Point2_1) == 0x000480, "Member 'UUw_fight_bar_girl008a_C::Point2_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_bar_girl008a_C, Shang) == 0x000488, "Member 'UUw_fight_bar_girl008a_C::Shang' has a wrong offset!");
static_assert(offsetof(UUw_fight_bar_girl008a_C, Xia) == 0x000490, "Member 'UUw_fight_bar_girl008a_C::Xia' has a wrong offset!");

}

