#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_operatebird_pc

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_operatebird_pc.uw_fight_operatebird_pc_C
// 0x0020 (0x03D0 - 0x03B0)
class UUw_fight_operatebird_pc_C final : public ULuaWidget
{
public:
	class UCustomSafeZone*                        CustomSafeZone_24;                                 // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_55;                                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_operatebird_skill_C*          Skill;                                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_operatebird_skill03_C*        Skill03;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void OnConstruct();
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_operatebird_pc_C">();
	}
	static class UUw_fight_operatebird_pc_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_operatebird_pc_C>();
	}
};
static_assert(alignof(UUw_fight_operatebird_pc_C) == 0x000008, "Wrong alignment on UUw_fight_operatebird_pc_C");
static_assert(sizeof(UUw_fight_operatebird_pc_C) == 0x0003D0, "Wrong size on UUw_fight_operatebird_pc_C");
static_assert(offsetof(UUw_fight_operatebird_pc_C, CustomSafeZone_24) == 0x0003B0, "Member 'UUw_fight_operatebird_pc_C::CustomSafeZone_24' has a wrong offset!");
static_assert(offsetof(UUw_fight_operatebird_pc_C, Image_55) == 0x0003B8, "Member 'UUw_fight_operatebird_pc_C::Image_55' has a wrong offset!");
static_assert(offsetof(UUw_fight_operatebird_pc_C, Skill) == 0x0003C0, "Member 'UUw_fight_operatebird_pc_C::Skill' has a wrong offset!");
static_assert(offsetof(UUw_fight_operatebird_pc_C, Skill03) == 0x0003C8, "Member 'UUw_fight_operatebird_pc_C::Skill03' has a wrong offset!");

}

