#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_fight_power_girl002a_bar_0

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_power_girl002a_bar.uw_fight_power_girl002a_bar_C.ExecuteUbergraph_uw_fight_power_girl002a_bar
// 0x0010 (0x0010 - 0x0000)
struct uw_fight_power_girl002a_bar_C_ExecuteUbergraph_uw_fight_power_girl002a_bar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPlay;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Index_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_power_girl002a_bar_C_ExecuteUbergraph_uw_fight_power_girl002a_bar;

// Function uw_fight_power_girl002a_bar.uw_fight_power_girl002a_bar_C.PlayFullAnim
// 0x0004 (0x0004 - 0x0000)
struct uw_fight_power_girl002a_bar_C_PlayFullAnim final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_power_girl002a_bar_C_PlayFullAnim;

// Function uw_fight_power_girl002a_bar.uw_fight_power_girl002a_bar_C.PlayDepleteAnim
// 0x0004 (0x0004 - 0x0000)
struct uw_fight_power_girl002a_bar_C_PlayDepleteAnim final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_power_girl002a_bar_C_PlayDepleteAnim;

// Function uw_fight_power_girl002a_bar.uw_fight_power_girl002a_bar_C.PlayStartStateAnim
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_power_girl002a_bar_C_PlayStartStateAnim final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_power_girl002a_bar_C_PlayStartStateAnim;

}

