#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_direction_turret

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_direction_turret.uw_fight_direction_turret_C
// 0x0048 (0x0848 - 0x0800)
class UUw_fight_direction_turret_C final : public UFightMonsterTipsItem
{
public:
	class URedirectImage*                         BarBlue;                                           // 0x0800(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image;                                             // 0x0808(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_22;                                          // 0x0810(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_24;                                          // 0x0818(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_34;                                          // 0x0820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_74;                                          // 0x0828(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgArrow4;                                         // 0x0830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgDown;                                           // 0x0838(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgHeight;                                         // 0x0840(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_direction_turret_C">();
	}
	static class UUw_fight_direction_turret_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_direction_turret_C>();
	}
};
static_assert(alignof(UUw_fight_direction_turret_C) == 0x000008, "Wrong alignment on UUw_fight_direction_turret_C");
static_assert(sizeof(UUw_fight_direction_turret_C) == 0x000848, "Wrong size on UUw_fight_direction_turret_C");
static_assert(offsetof(UUw_fight_direction_turret_C, BarBlue) == 0x000800, "Member 'UUw_fight_direction_turret_C::BarBlue' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_turret_C, Image) == 0x000808, "Member 'UUw_fight_direction_turret_C::Image' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_turret_C, Image_22) == 0x000810, "Member 'UUw_fight_direction_turret_C::Image_22' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_turret_C, Image_24) == 0x000818, "Member 'UUw_fight_direction_turret_C::Image_24' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_turret_C, Image_34) == 0x000820, "Member 'UUw_fight_direction_turret_C::Image_34' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_turret_C, Image_74) == 0x000828, "Member 'UUw_fight_direction_turret_C::Image_74' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_turret_C, ImgArrow4) == 0x000830, "Member 'UUw_fight_direction_turret_C::ImgArrow4' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_turret_C, ImgDown) == 0x000838, "Member 'UUw_fight_direction_turret_C::ImgDown' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_turret_C, ImgHeight) == 0x000840, "Member 'UUw_fight_direction_turret_C::ImgHeight' has a wrong offset!");

}

