#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_fight_skill03_button_new

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_skill03_button_new.uw_fight_skill03_button_new_C.ExecuteUbergraph_uw_fight_skill03_button_new
// 0x0018 (0x0018 - 0x0000)
struct uw_fight_skill03_button_new_C_ExecuteUbergraph_uw_fight_skill03_button_new final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPlayAnim_1;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlayCD;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStart_2;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlaySustain;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlayAnim;                            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStart_1;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStart;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimPlayingFromAnimation_ReturnValue;   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_Event_AnimName;                             // 0x000C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill03_button_new_C_ExecuteUbergraph_uw_fight_skill03_button_new;

// Function uw_fight_skill03_button_new.uw_fight_skill03_button_new_C.K2_OnCustomUmgAnimFinished__Overridden
// 0x0008 (0x0008 - 0x0000)
struct uw_fight_skill03_button_new_C_K2_OnCustomUmgAnimFinished__Overridden final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_skill03_button_new_C_K2_OnCustomUmgAnimFinished__Overridden;

// Function uw_fight_skill03_button_new.uw_fight_skill03_button_new_C.OnUIEffectSkillLongPress
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill03_button_new_C_OnUIEffectSkillLongPress final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill03_button_new_C_OnUIEffectSkillLongPress;

// Function uw_fight_skill03_button_new.uw_fight_skill03_button_new_C.OnSkillKeepInterrupt
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill03_button_new_C_OnSkillKeepInterrupt final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill03_button_new_C_OnSkillKeepInterrupt;

// Function uw_fight_skill03_button_new.uw_fight_skill03_button_new_C.K2_PlayEnoughAnim
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill03_button_new_C_K2_PlayEnoughAnim final
{
public:
	bool                                          bPlayAnim;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill03_button_new_C_K2_PlayEnoughAnim;

// Function uw_fight_skill03_button_new.uw_fight_skill03_button_new_C.K2_PlaySustainAnim
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill03_button_new_C_K2_PlaySustainAnim final
{
public:
	bool                                          bPlaySustain;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill03_button_new_C_K2_PlaySustainAnim;

// Function uw_fight_skill03_button_new.uw_fight_skill03_button_new_C.OnSkillStrengthening__Overridden
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill03_button_new_C_OnSkillStrengthening__Overridden final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill03_button_new_C_OnSkillStrengthening__Overridden;

// Function uw_fight_skill03_button_new.uw_fight_skill03_button_new_C.K2_PlayCDAnim__Overridden
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill03_button_new_C_K2_PlayCDAnim__Overridden final
{
public:
	bool                                          bPlayCD;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill03_button_new_C_K2_PlayCDAnim__Overridden;

// Function uw_fight_skill03_button_new.uw_fight_skill03_button_new_C.K2_PlayFinishAnim
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill03_button_new_C_K2_PlayFinishAnim final
{
public:
	bool                                          bPlayAnim;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill03_button_new_C_K2_PlayFinishAnim;

// LuaFunction uw_fight_skill03_button_new.uw_fight_skill03_button_new_C.K2_PlayCDAnim
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill03_button_new_C_K2_PlayCDAnim final
{
public:
	bool                                          bPlayCD;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill03_button_new_C_K2_PlayCDAnim;

// LuaFunction uw_fight_skill03_button_new.uw_fight_skill03_button_new_C.K2_OnCustomUmgAnimFinished
// 0x0008 (0x0008 - 0x0000)
struct uw_fight_skill03_button_new_C_K2_OnCustomUmgAnimFinished final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_skill03_button_new_C_K2_OnCustomUmgAnimFinished;

// LuaFunction uw_fight_skill03_button_new.uw_fight_skill03_button_new_C.OnChargeTimesChange
// 0x0008 (0x0008 - 0x0000)
struct uw_fight_skill03_button_new_C_OnChargeTimesChange final
{
public:
	int32                                         InCurrentTimes;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InMaxTimes;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_uw_fight_skill03_button_new_C_OnChargeTimesChange;

// LuaFunction uw_fight_skill03_button_new.uw_fight_skill03_button_new_C.OnSkillStrengthening
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill03_button_new_C_OnSkillStrengthening final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill03_button_new_C_OnSkillStrengthening;

// Function uw_fight_skill03_button_new.uw_fight_skill03_button_new_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct uw_fight_skill03_button_new_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_skill03_button_new_C_GetModuleName;

}

