#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_level_occupyc_info_list

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_level_occupyc_info_list.uw_fight_level_occupyc_info_list_C
// 0x0018 (0x03C8 - 0x03B0)
class UUw_fight_level_occupyc_info_list_C final : public ULuaWidget
{
public:
	class UWidgetAnimation*                       InfoEnter;                                         // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCustListView*                          ListOccupy;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_level_occupy_smalllist_C*     ListSmallOccupy;                                   // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void OnConstruct();
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_level_occupyc_info_list_C">();
	}
	static class UUw_fight_level_occupyc_info_list_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_level_occupyc_info_list_C>();
	}
};
static_assert(alignof(UUw_fight_level_occupyc_info_list_C) == 0x000008, "Wrong alignment on UUw_fight_level_occupyc_info_list_C");
static_assert(sizeof(UUw_fight_level_occupyc_info_list_C) == 0x0003C8, "Wrong size on UUw_fight_level_occupyc_info_list_C");
static_assert(offsetof(UUw_fight_level_occupyc_info_list_C, InfoEnter) == 0x0003B0, "Member 'UUw_fight_level_occupyc_info_list_C::InfoEnter' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupyc_info_list_C, ListOccupy) == 0x0003B8, "Member 'UUw_fight_level_occupyc_info_list_C::ListOccupy' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupyc_info_list_C, ListSmallOccupy) == 0x0003C0, "Member 'UUw_fight_level_occupyc_info_list_C::ListSmallOccupy' has a wrong offset!");

}

