#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_npc_hpnpbreak

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function uw_fight_npc_hpnpbreak.uw_fight_npc_hpnpbreak_C.SetHpPercent
// 0x0004 (0x0004 - 0x0000)
struct Uw_fight_npc_hpnpbreak_C_SetHpPercent final
{
public:
	float                                         Percent;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_npc_hpnpbreak_C_SetHpPercent) == 0x000004, "Wrong alignment on Uw_fight_npc_hpnpbreak_C_SetHpPercent");
static_assert(sizeof(Uw_fight_npc_hpnpbreak_C_SetHpPercent) == 0x000004, "Wrong size on Uw_fight_npc_hpnpbreak_C_SetHpPercent");
static_assert(offsetof(Uw_fight_npc_hpnpbreak_C_SetHpPercent, Percent) == 0x000000, "Member 'Uw_fight_npc_hpnpbreak_C_SetHpPercent::Percent' has a wrong offset!");

// Function uw_fight_npc_hpnpbreak.uw_fight_npc_hpnpbreak_C.Tick
// 0x003C (0x003C - 0x0000)
struct Uw_fight_npc_hpnpbreak_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_npc_hpnpbreak_C_Tick) == 0x000004, "Wrong alignment on Uw_fight_npc_hpnpbreak_C_Tick");
static_assert(sizeof(Uw_fight_npc_hpnpbreak_C_Tick) == 0x00003C, "Wrong size on Uw_fight_npc_hpnpbreak_C_Tick");
static_assert(offsetof(Uw_fight_npc_hpnpbreak_C_Tick, MyGeometry) == 0x000000, "Member 'Uw_fight_npc_hpnpbreak_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Uw_fight_npc_hpnpbreak_C_Tick, InDeltaTime) == 0x000038, "Member 'Uw_fight_npc_hpnpbreak_C_Tick::InDeltaTime' has a wrong offset!");

// Function uw_fight_npc_hpnpbreak.uw_fight_npc_hpnpbreak_C.PlayLowAnim
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_npc_hpnpbreak_C_PlayLowAnim final
{
public:
	bool                                          bLow;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_npc_hpnpbreak_C_PlayLowAnim) == 0x000001, "Wrong alignment on Uw_fight_npc_hpnpbreak_C_PlayLowAnim");
static_assert(sizeof(Uw_fight_npc_hpnpbreak_C_PlayLowAnim) == 0x000001, "Wrong size on Uw_fight_npc_hpnpbreak_C_PlayLowAnim");
static_assert(offsetof(Uw_fight_npc_hpnpbreak_C_PlayLowAnim, bLow) == 0x000000, "Member 'Uw_fight_npc_hpnpbreak_C_PlayLowAnim::bLow' has a wrong offset!");

// Function uw_fight_npc_hpnpbreak.uw_fight_npc_hpnpbreak_C.ExecuteUbergraph_uw_fight_npc_hpnpbreak
// 0x0048 (0x0048 - 0x0000)
struct Uw_fight_npc_hpnpbreak_C_ExecuteUbergraph_uw_fight_npc_hpnpbreak final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Percent;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bLow;                           // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimPlayingFromAnimation_ReturnValue;   // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_npc_hpnpbreak_C_ExecuteUbergraph_uw_fight_npc_hpnpbreak) == 0x000004, "Wrong alignment on Uw_fight_npc_hpnpbreak_C_ExecuteUbergraph_uw_fight_npc_hpnpbreak");
static_assert(sizeof(Uw_fight_npc_hpnpbreak_C_ExecuteUbergraph_uw_fight_npc_hpnpbreak) == 0x000048, "Wrong size on Uw_fight_npc_hpnpbreak_C_ExecuteUbergraph_uw_fight_npc_hpnpbreak");
static_assert(offsetof(Uw_fight_npc_hpnpbreak_C_ExecuteUbergraph_uw_fight_npc_hpnpbreak, EntryPoint) == 0x000000, "Member 'Uw_fight_npc_hpnpbreak_C_ExecuteUbergraph_uw_fight_npc_hpnpbreak::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_npc_hpnpbreak_C_ExecuteUbergraph_uw_fight_npc_hpnpbreak, K2Node_CustomEvent_Percent) == 0x000004, "Member 'Uw_fight_npc_hpnpbreak_C_ExecuteUbergraph_uw_fight_npc_hpnpbreak::K2Node_CustomEvent_Percent' has a wrong offset!");
static_assert(offsetof(Uw_fight_npc_hpnpbreak_C_ExecuteUbergraph_uw_fight_npc_hpnpbreak, K2Node_Event_MyGeometry) == 0x000008, "Member 'Uw_fight_npc_hpnpbreak_C_ExecuteUbergraph_uw_fight_npc_hpnpbreak::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Uw_fight_npc_hpnpbreak_C_ExecuteUbergraph_uw_fight_npc_hpnpbreak, K2Node_Event_InDeltaTime) == 0x000040, "Member 'Uw_fight_npc_hpnpbreak_C_ExecuteUbergraph_uw_fight_npc_hpnpbreak::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(Uw_fight_npc_hpnpbreak_C_ExecuteUbergraph_uw_fight_npc_hpnpbreak, K2Node_CustomEvent_bLow) == 0x000044, "Member 'Uw_fight_npc_hpnpbreak_C_ExecuteUbergraph_uw_fight_npc_hpnpbreak::K2Node_CustomEvent_bLow' has a wrong offset!");
static_assert(offsetof(Uw_fight_npc_hpnpbreak_C_ExecuteUbergraph_uw_fight_npc_hpnpbreak, CallFunc_IsAnimPlayingFromAnimation_ReturnValue) == 0x000045, "Member 'Uw_fight_npc_hpnpbreak_C_ExecuteUbergraph_uw_fight_npc_hpnpbreak::CallFunc_IsAnimPlayingFromAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_npc_hpnpbreak_C_ExecuteUbergraph_uw_fight_npc_hpnpbreak, CallFunc_Less_FloatFloat_ReturnValue) == 0x000046, "Member 'Uw_fight_npc_hpnpbreak_C_ExecuteUbergraph_uw_fight_npc_hpnpbreak::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

}

