#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_fight_power_girl002a_twobar

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_power_girl002a_twobar.uw_fight_power_girl002a_twobar_C.ExecuteUbergraph_uw_fight_power_girl002a_twobar
// 0x0010 (0x0010 - 0x0000)
struct uw_fight_power_girl002a_twobar_C_ExecuteUbergraph_uw_fight_power_girl002a_twobar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_1;                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlay;                                // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_power_girl002a_twobar_C_ExecuteUbergraph_uw_fight_power_girl002a_twobar;

// Function uw_fight_power_girl002a_twobar.uw_fight_power_girl002a_twobar_C.PlayStartStateAnim
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_power_girl002a_twobar_C_PlayStartStateAnim final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_power_girl002a_twobar_C_PlayStartStateAnim;

// Function uw_fight_power_girl002a_twobar.uw_fight_power_girl002a_twobar_C.PlayFullAnim
// 0x0004 (0x0004 - 0x0000)
struct uw_fight_power_girl002a_twobar_C_PlayFullAnim final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_power_girl002a_twobar_C_PlayFullAnim;

// Function uw_fight_power_girl002a_twobar.uw_fight_power_girl002a_twobar_C.PlayDepleteAnim
// 0x0004 (0x0004 - 0x0000)
struct uw_fight_power_girl002a_twobar_C_PlayDepleteAnim final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_power_girl002a_twobar_C_PlayDepleteAnim;

}

