#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_npc_hp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_npc_hp.uw_fight_npc_hp_C
// 0x0088 (0x0598 - 0x0510)
class UUw_fight_npc_hp_C final : public UNpcHp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Monsterhp_appear;                                  // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Npchp_white;                                       // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reset;                                             // 0x0528(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HpBreak;                                           // 0x0530(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HpLow;                                             // 0x0538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UProgressBar*                           BarHp;                                             // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           BarHpRed;                                          // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Effect;                                            // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image;                                             // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_90;                                          // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBG;                                             // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBreak;                                          // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtTeammateName;                                   // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         LastPercent;                                       // 0x0588(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurPercent;                                        // 0x058C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LerpTime;                                          // 0x0590(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PlayBreakAnim();
	void PlayLowAnim(bool bLow);
	void SetHpPercent(float Percent);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PlayWhiteAnim();
	void ExecuteUbergraph_uw_fight_npc_hp(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_npc_hp_C">();
	}
	static class UUw_fight_npc_hp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_npc_hp_C>();
	}
};
static_assert(alignof(UUw_fight_npc_hp_C) == 0x000008, "Wrong alignment on UUw_fight_npc_hp_C");
static_assert(sizeof(UUw_fight_npc_hp_C) == 0x000598, "Wrong size on UUw_fight_npc_hp_C");
static_assert(offsetof(UUw_fight_npc_hp_C, UberGraphFrame) == 0x000510, "Member 'UUw_fight_npc_hp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_npc_hp_C, Monsterhp_appear) == 0x000518, "Member 'UUw_fight_npc_hp_C::Monsterhp_appear' has a wrong offset!");
static_assert(offsetof(UUw_fight_npc_hp_C, Npchp_white) == 0x000520, "Member 'UUw_fight_npc_hp_C::Npchp_white' has a wrong offset!");
static_assert(offsetof(UUw_fight_npc_hp_C, Reset) == 0x000528, "Member 'UUw_fight_npc_hp_C::Reset' has a wrong offset!");
static_assert(offsetof(UUw_fight_npc_hp_C, HpBreak) == 0x000530, "Member 'UUw_fight_npc_hp_C::HpBreak' has a wrong offset!");
static_assert(offsetof(UUw_fight_npc_hp_C, HpLow) == 0x000538, "Member 'UUw_fight_npc_hp_C::HpLow' has a wrong offset!");
static_assert(offsetof(UUw_fight_npc_hp_C, BarHp) == 0x000540, "Member 'UUw_fight_npc_hp_C::BarHp' has a wrong offset!");
static_assert(offsetof(UUw_fight_npc_hp_C, BarHpRed) == 0x000548, "Member 'UUw_fight_npc_hp_C::BarHpRed' has a wrong offset!");
static_assert(offsetof(UUw_fight_npc_hp_C, Effect) == 0x000550, "Member 'UUw_fight_npc_hp_C::Effect' has a wrong offset!");
static_assert(offsetof(UUw_fight_npc_hp_C, Image) == 0x000558, "Member 'UUw_fight_npc_hp_C::Image' has a wrong offset!");
static_assert(offsetof(UUw_fight_npc_hp_C, Image_90) == 0x000560, "Member 'UUw_fight_npc_hp_C::Image_90' has a wrong offset!");
static_assert(offsetof(UUw_fight_npc_hp_C, ImgBG) == 0x000568, "Member 'UUw_fight_npc_hp_C::ImgBG' has a wrong offset!");
static_assert(offsetof(UUw_fight_npc_hp_C, ImgBreak) == 0x000570, "Member 'UUw_fight_npc_hp_C::ImgBreak' has a wrong offset!");
static_assert(offsetof(UUw_fight_npc_hp_C, InvalidationBox_0) == 0x000578, "Member 'UUw_fight_npc_hp_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UUw_fight_npc_hp_C, TxtTeammateName) == 0x000580, "Member 'UUw_fight_npc_hp_C::TxtTeammateName' has a wrong offset!");
static_assert(offsetof(UUw_fight_npc_hp_C, LastPercent) == 0x000588, "Member 'UUw_fight_npc_hp_C::LastPercent' has a wrong offset!");
static_assert(offsetof(UUw_fight_npc_hp_C, CurPercent) == 0x00058C, "Member 'UUw_fight_npc_hp_C::CurPercent' has a wrong offset!");
static_assert(offsetof(UUw_fight_npc_hp_C, LerpTime) == 0x000590, "Member 'UUw_fight_npc_hp_C::LerpTime' has a wrong offset!");

}

