#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_turret_closebtn

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_turret_closebtn.uw_fight_turret_closebtn_C
// 0x0050 (0x0400 - 0x03B0)
class UUw_fight_turret_closebtn_C final : public ULuaWidget
{
public:
	class UCustomButton*                          BtnClose;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CanvasPanel;                                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_skill_keybtn_C*               KeyBtn;                                            // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         KeyBtnImage;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Nomral;                                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelKey;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelKeyTips;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelPress;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         PressImg;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage_79;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_turret_closebtn_C">();
	}
	static class UUw_fight_turret_closebtn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_turret_closebtn_C>();
	}
};
static_assert(alignof(UUw_fight_turret_closebtn_C) == 0x000008, "Wrong alignment on UUw_fight_turret_closebtn_C");
static_assert(sizeof(UUw_fight_turret_closebtn_C) == 0x000400, "Wrong size on UUw_fight_turret_closebtn_C");
static_assert(offsetof(UUw_fight_turret_closebtn_C, BtnClose) == 0x0003B0, "Member 'UUw_fight_turret_closebtn_C::BtnClose' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_closebtn_C, CanvasPanel) == 0x0003B8, "Member 'UUw_fight_turret_closebtn_C::CanvasPanel' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_closebtn_C, KeyBtn) == 0x0003C0, "Member 'UUw_fight_turret_closebtn_C::KeyBtn' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_closebtn_C, KeyBtnImage) == 0x0003C8, "Member 'UUw_fight_turret_closebtn_C::KeyBtnImage' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_closebtn_C, Nomral) == 0x0003D0, "Member 'UUw_fight_turret_closebtn_C::Nomral' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_closebtn_C, PanelKey) == 0x0003D8, "Member 'UUw_fight_turret_closebtn_C::PanelKey' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_closebtn_C, PanelKeyTips) == 0x0003E0, "Member 'UUw_fight_turret_closebtn_C::PanelKeyTips' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_closebtn_C, PanelPress) == 0x0003E8, "Member 'UUw_fight_turret_closebtn_C::PanelPress' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_closebtn_C, PressImg) == 0x0003F0, "Member 'UUw_fight_turret_closebtn_C::PressImg' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_closebtn_C, RedirectImage_79) == 0x0003F8, "Member 'UUw_fight_turret_closebtn_C::RedirectImage_79' has a wrong offset!");

}

