#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_fight_aimimg2

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function uw_fight_aimimg2.uw_fight_aimimg2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_aimimg2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_aimimg2_C_PreConstruct;

// Function uw_fight_aimimg2.uw_fight_aimimg2_C.VisibilityChange
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_aimimg2_C_VisibilityChange final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_aimimg2_C_VisibilityChange;

// Function uw_fight_aimimg2.uw_fight_aimimg2_C.ExecuteUbergraph_uw_fight_aimimg2
// 0x0020 (0x0020 - 0x0000)
struct uw_fight_aimimg2_C_ExecuteUbergraph_uw_fight_aimimg2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate;             // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_aimimg2_C_ExecuteUbergraph_uw_fight_aimimg2;

}

