#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_turret_cross

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_turret_cross.uw_fight_turret_cross_C
// 0x0090 (0x0510 - 0x0480)
class UUw_fight_turret_cross_C final : public UCrossHair_FightTurretCross
{
public:
	class UWidgetAnimation*                       Enter;                                             // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Center;                                            // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CrossPanel;                                        // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Group_FireStarter_zoom;                            // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Group_zoom;                                        // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image;                                             // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_1;                                           // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_2;                                           // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_3;                                           // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_4;                                           // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_5;                                           // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_6;                                           // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_49;                                          // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               LD_1;                                              // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               LU_1;                                              // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RD_1;                                              // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RU_1;                                              // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_turret_cross_C">();
	}
	static class UUw_fight_turret_cross_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_turret_cross_C>();
	}
};
static_assert(alignof(UUw_fight_turret_cross_C) == 0x000010, "Wrong alignment on UUw_fight_turret_cross_C");
static_assert(sizeof(UUw_fight_turret_cross_C) == 0x000510, "Wrong size on UUw_fight_turret_cross_C");
static_assert(offsetof(UUw_fight_turret_cross_C, Enter) == 0x000480, "Member 'UUw_fight_turret_cross_C::Enter' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_cross_C, Center) == 0x000488, "Member 'UUw_fight_turret_cross_C::Center' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_cross_C, CrossPanel) == 0x000490, "Member 'UUw_fight_turret_cross_C::CrossPanel' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_cross_C, Group_FireStarter_zoom) == 0x000498, "Member 'UUw_fight_turret_cross_C::Group_FireStarter_zoom' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_cross_C, Group_zoom) == 0x0004A0, "Member 'UUw_fight_turret_cross_C::Group_zoom' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_cross_C, Image) == 0x0004A8, "Member 'UUw_fight_turret_cross_C::Image' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_cross_C, Image_1) == 0x0004B0, "Member 'UUw_fight_turret_cross_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_cross_C, Image_2) == 0x0004B8, "Member 'UUw_fight_turret_cross_C::Image_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_cross_C, Image_3) == 0x0004C0, "Member 'UUw_fight_turret_cross_C::Image_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_cross_C, Image_4) == 0x0004C8, "Member 'UUw_fight_turret_cross_C::Image_4' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_cross_C, Image_5) == 0x0004D0, "Member 'UUw_fight_turret_cross_C::Image_5' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_cross_C, Image_6) == 0x0004D8, "Member 'UUw_fight_turret_cross_C::Image_6' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_cross_C, Image_49) == 0x0004E0, "Member 'UUw_fight_turret_cross_C::Image_49' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_cross_C, LD_1) == 0x0004E8, "Member 'UUw_fight_turret_cross_C::LD_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_cross_C, LU_1) == 0x0004F0, "Member 'UUw_fight_turret_cross_C::LU_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_cross_C, RD_1) == 0x0004F8, "Member 'UUw_fight_turret_cross_C::RD_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_turret_cross_C, RU_1) == 0x000500, "Member 'UUw_fight_turret_cross_C::RU_1' has a wrong offset!");

}

