#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_direction_guard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_direction_guard.uw_fight_direction_guard_C
// 0x00C8 (0x08C8 - 0x0800)
class UUw_fight_direction_guard_C final : public UFightMonsterTipsItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0800(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0808(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appear;                                            // 0x0810(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GuardDefeat;                                       // 0x0818(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GuardFight;                                        // 0x0820(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GuardWarn2;                                        // 0x0828(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GuardWarn1;                                        // 0x0830(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         BarBlue;                                           // 0x0838(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         BarRed;                                            // 0x0840(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_26;                                          // 0x0848(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_74;                                          // 0x0850(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_bai;                                         // 0x0858(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_yuan2;                                       // 0x0860(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgArrow7;                                         // 0x0868(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgArrowRed;                                       // 0x0870(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBarBlue;                                        // 0x0878(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBarRed;                                         // 0x0880(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBarWhite;                                       // 0x0888(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgDefeat;                                         // 0x0890(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgDown;                                           // 0x0898(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       ImgFight;                                          // 0x08A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgFight1;                                         // 0x08A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgFight2;                                         // 0x08B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgHeight;                                         // 0x08B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtGuardName;                                      // 0x08C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PlayTypeAnim();
	void ExecuteUbergraph_uw_fight_direction_guard(int32 EntryPoint);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void AppearFinish(class UWidgetAnimation* Animation);
	void PlayDieAnim();
	void OnVisibilityChanged_Event_0(ESlateVisibility InVisibility);
	void SetDefendTargetPercent(float Value);
	void StartLoop(const class UObject* Object, bool HasAppear);
	void SequenceEvent__ENTRYPOINTuw_fight_direction_guard_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_direction_guard_C">();
	}
	static class UUw_fight_direction_guard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_direction_guard_C>();
	}
};
static_assert(alignof(UUw_fight_direction_guard_C) == 0x000008, "Wrong alignment on UUw_fight_direction_guard_C");
static_assert(sizeof(UUw_fight_direction_guard_C) == 0x0008C8, "Wrong size on UUw_fight_direction_guard_C");
static_assert(offsetof(UUw_fight_direction_guard_C, UberGraphFrame) == 0x000800, "Member 'UUw_fight_direction_guard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_guard_C, Loop) == 0x000808, "Member 'UUw_fight_direction_guard_C::Loop' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_guard_C, Appear) == 0x000810, "Member 'UUw_fight_direction_guard_C::Appear' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_guard_C, GuardDefeat) == 0x000818, "Member 'UUw_fight_direction_guard_C::GuardDefeat' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_guard_C, GuardFight) == 0x000820, "Member 'UUw_fight_direction_guard_C::GuardFight' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_guard_C, GuardWarn2) == 0x000828, "Member 'UUw_fight_direction_guard_C::GuardWarn2' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_guard_C, GuardWarn1) == 0x000830, "Member 'UUw_fight_direction_guard_C::GuardWarn1' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_guard_C, BarBlue) == 0x000838, "Member 'UUw_fight_direction_guard_C::BarBlue' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_guard_C, BarRed) == 0x000840, "Member 'UUw_fight_direction_guard_C::BarRed' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_guard_C, Image_26) == 0x000848, "Member 'UUw_fight_direction_guard_C::Image_26' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_guard_C, Image_74) == 0x000850, "Member 'UUw_fight_direction_guard_C::Image_74' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_guard_C, Image_bai) == 0x000858, "Member 'UUw_fight_direction_guard_C::Image_bai' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_guard_C, Image_yuan2) == 0x000860, "Member 'UUw_fight_direction_guard_C::Image_yuan2' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_guard_C, ImgArrow7) == 0x000868, "Member 'UUw_fight_direction_guard_C::ImgArrow7' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_guard_C, ImgArrowRed) == 0x000870, "Member 'UUw_fight_direction_guard_C::ImgArrowRed' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_guard_C, ImgBarBlue) == 0x000878, "Member 'UUw_fight_direction_guard_C::ImgBarBlue' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_guard_C, ImgBarRed) == 0x000880, "Member 'UUw_fight_direction_guard_C::ImgBarRed' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_guard_C, ImgBarWhite) == 0x000888, "Member 'UUw_fight_direction_guard_C::ImgBarWhite' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_guard_C, ImgDefeat) == 0x000890, "Member 'UUw_fight_direction_guard_C::ImgDefeat' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_guard_C, ImgDown) == 0x000898, "Member 'UUw_fight_direction_guard_C::ImgDown' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_guard_C, ImgFight) == 0x0008A0, "Member 'UUw_fight_direction_guard_C::ImgFight' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_guard_C, ImgFight1) == 0x0008A8, "Member 'UUw_fight_direction_guard_C::ImgFight1' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_guard_C, ImgFight2) == 0x0008B0, "Member 'UUw_fight_direction_guard_C::ImgFight2' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_guard_C, ImgHeight) == 0x0008B8, "Member 'UUw_fight_direction_guard_C::ImgHeight' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_guard_C, TxtGuardName) == 0x0008C0, "Member 'UUw_fight_direction_guard_C::TxtGuardName' has a wrong offset!");

}

