#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_ammunition4

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_ammunition4.uw_fight_ammunition4_C
// 0x01A8 (0x0520 - 0x0378)
class UUw_fight_ammunition4_C final : public UCrossAmmunition
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NotEnough;                                         // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Overheated;                                        // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         Box;                                               // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UE_ui_fightstrong_07_p_C*               E_ui_fightstrong_07_p_C;                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UE_ui_fightstrong_07_p_C*               E_ui_fightstrong_07_p_C_182;                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image;                                             // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_1;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_3;                                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBullet1;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBullet10;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBullet11;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBullet12;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBullet13;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBullet14;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBullet15;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBullet16;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBullet2;                                        // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBullet3;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBullet4;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBullet5;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBullet6;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBullet7;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBullet8;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBullet9;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvaVary;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Mask;                                              // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelBullet1;                                      // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelBullet10;                                     // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelBullet11;                                     // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelBullet12;                                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelBullet13;                                     // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelBullet14;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelBullet15;                                     // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelBullet16;                                     // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelBullet2;                                      // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelBullet3;                                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelBullet4;                                      // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelBullet5;                                      // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelBullet6;                                      // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelBullet7;                                      // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelBullet8;                                      // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelBullet9;                                      // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelStrongNum;                                    // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelStrongTime;                                   // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWidget*>                        PanelBullets;                                      // 0x04E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class URedirectImage*>                 ImgBullets;                                        // 0x04F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FLinearColor                           NormalColor;                                       // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EffectColor;                                       // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int32 GetNextLeftCount(class UModifier* InModifier);
	void Set_Bullet_Image(int32 Start, int32 End, const struct FLinearColor& Color);
	void SetBullet(class UWidget* BulletWidget, int32 InBulet);
	void Construct();
	void SetBulletEffect(bool bShow);
	void SetBulletTimeEffect(bool bShow);
	void ClearBulletEffect();
	void SetBulletCountEffect(float StartPercent, float EndPercent, float Start, float End);
	void OnBulletChange(int32 InCurBullet, int32 InMaxBullet, float InPercent);
	void K2_SkillCastBulletFail();
	void ExecuteUbergraph_uw_fight_ammunition4(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_ammunition4_C">();
	}
	static class UUw_fight_ammunition4_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_ammunition4_C>();
	}
};
static_assert(alignof(UUw_fight_ammunition4_C) == 0x000008, "Wrong alignment on UUw_fight_ammunition4_C");
static_assert(sizeof(UUw_fight_ammunition4_C) == 0x000520, "Wrong size on UUw_fight_ammunition4_C");
static_assert(offsetof(UUw_fight_ammunition4_C, UberGraphFrame) == 0x000378, "Member 'UUw_fight_ammunition4_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, NotEnough) == 0x000380, "Member 'UUw_fight_ammunition4_C::NotEnough' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, Overheated) == 0x000388, "Member 'UUw_fight_ammunition4_C::Overheated' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, Box) == 0x000390, "Member 'UUw_fight_ammunition4_C::Box' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, E_ui_fightstrong_07_p_C) == 0x000398, "Member 'UUw_fight_ammunition4_C::E_ui_fightstrong_07_p_C' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, E_ui_fightstrong_07_p_C_182) == 0x0003A0, "Member 'UUw_fight_ammunition4_C::E_ui_fightstrong_07_p_C_182' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, Image) == 0x0003A8, "Member 'UUw_fight_ammunition4_C::Image' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, Image_1) == 0x0003B0, "Member 'UUw_fight_ammunition4_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, Image_3) == 0x0003B8, "Member 'UUw_fight_ammunition4_C::Image_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, ImgBullet1) == 0x0003C0, "Member 'UUw_fight_ammunition4_C::ImgBullet1' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, ImgBullet10) == 0x0003C8, "Member 'UUw_fight_ammunition4_C::ImgBullet10' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, ImgBullet11) == 0x0003D0, "Member 'UUw_fight_ammunition4_C::ImgBullet11' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, ImgBullet12) == 0x0003D8, "Member 'UUw_fight_ammunition4_C::ImgBullet12' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, ImgBullet13) == 0x0003E0, "Member 'UUw_fight_ammunition4_C::ImgBullet13' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, ImgBullet14) == 0x0003E8, "Member 'UUw_fight_ammunition4_C::ImgBullet14' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, ImgBullet15) == 0x0003F0, "Member 'UUw_fight_ammunition4_C::ImgBullet15' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, ImgBullet16) == 0x0003F8, "Member 'UUw_fight_ammunition4_C::ImgBullet16' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, ImgBullet2) == 0x000400, "Member 'UUw_fight_ammunition4_C::ImgBullet2' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, ImgBullet3) == 0x000408, "Member 'UUw_fight_ammunition4_C::ImgBullet3' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, ImgBullet4) == 0x000410, "Member 'UUw_fight_ammunition4_C::ImgBullet4' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, ImgBullet5) == 0x000418, "Member 'UUw_fight_ammunition4_C::ImgBullet5' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, ImgBullet6) == 0x000420, "Member 'UUw_fight_ammunition4_C::ImgBullet6' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, ImgBullet7) == 0x000428, "Member 'UUw_fight_ammunition4_C::ImgBullet7' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, ImgBullet8) == 0x000430, "Member 'UUw_fight_ammunition4_C::ImgBullet8' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, ImgBullet9) == 0x000438, "Member 'UUw_fight_ammunition4_C::ImgBullet9' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, InvaVary) == 0x000440, "Member 'UUw_fight_ammunition4_C::InvaVary' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, Mask) == 0x000448, "Member 'UUw_fight_ammunition4_C::Mask' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, PanelBullet1) == 0x000450, "Member 'UUw_fight_ammunition4_C::PanelBullet1' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, PanelBullet10) == 0x000458, "Member 'UUw_fight_ammunition4_C::PanelBullet10' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, PanelBullet11) == 0x000460, "Member 'UUw_fight_ammunition4_C::PanelBullet11' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, PanelBullet12) == 0x000468, "Member 'UUw_fight_ammunition4_C::PanelBullet12' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, PanelBullet13) == 0x000470, "Member 'UUw_fight_ammunition4_C::PanelBullet13' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, PanelBullet14) == 0x000478, "Member 'UUw_fight_ammunition4_C::PanelBullet14' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, PanelBullet15) == 0x000480, "Member 'UUw_fight_ammunition4_C::PanelBullet15' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, PanelBullet16) == 0x000488, "Member 'UUw_fight_ammunition4_C::PanelBullet16' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, PanelBullet2) == 0x000490, "Member 'UUw_fight_ammunition4_C::PanelBullet2' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, PanelBullet3) == 0x000498, "Member 'UUw_fight_ammunition4_C::PanelBullet3' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, PanelBullet4) == 0x0004A0, "Member 'UUw_fight_ammunition4_C::PanelBullet4' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, PanelBullet5) == 0x0004A8, "Member 'UUw_fight_ammunition4_C::PanelBullet5' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, PanelBullet6) == 0x0004B0, "Member 'UUw_fight_ammunition4_C::PanelBullet6' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, PanelBullet7) == 0x0004B8, "Member 'UUw_fight_ammunition4_C::PanelBullet7' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, PanelBullet8) == 0x0004C0, "Member 'UUw_fight_ammunition4_C::PanelBullet8' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, PanelBullet9) == 0x0004C8, "Member 'UUw_fight_ammunition4_C::PanelBullet9' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, PanelStrongNum) == 0x0004D0, "Member 'UUw_fight_ammunition4_C::PanelStrongNum' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, PanelStrongTime) == 0x0004D8, "Member 'UUw_fight_ammunition4_C::PanelStrongTime' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, PanelBullets) == 0x0004E0, "Member 'UUw_fight_ammunition4_C::PanelBullets' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, ImgBullets) == 0x0004F0, "Member 'UUw_fight_ammunition4_C::ImgBullets' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, NormalColor) == 0x000500, "Member 'UUw_fight_ammunition4_C::NormalColor' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition4_C, EffectColor) == 0x000510, "Member 'UUw_fight_ammunition4_C::EffectColor' has a wrong offset!");

}

