#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_npc_title

#include "Basic.hpp"


namespace SDK::Params
{

// LuaFunction uw_fight_npc_title.uw_fight_npc_title_C.FreeWidget
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_npc_title_C_FreeWidget final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Uw_fight_npc_title_C_FreeWidget) == 0x000008, "Wrong alignment on Uw_fight_npc_title_C_FreeWidget");
static_assert(sizeof(Uw_fight_npc_title_C_FreeWidget) == 0x000008, "Wrong size on Uw_fight_npc_title_C_FreeWidget");
static_assert(offsetof(Uw_fight_npc_title_C_FreeWidget, InWidget) == 0x000000, "Member 'Uw_fight_npc_title_C_FreeWidget::InWidget' has a wrong offset!");

// LuaFunction uw_fight_npc_title.uw_fight_npc_title_C.AllocNewWidget
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_npc_title_C_AllocNewWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Uw_fight_npc_title_C_AllocNewWidget) == 0x000008, "Wrong alignment on Uw_fight_npc_title_C_AllocNewWidget");
static_assert(sizeof(Uw_fight_npc_title_C_AllocNewWidget) == 0x000008, "Wrong size on Uw_fight_npc_title_C_AllocNewWidget");
static_assert(offsetof(Uw_fight_npc_title_C_AllocNewWidget, ReturnValue) == 0x000000, "Member 'Uw_fight_npc_title_C_AllocNewWidget::ReturnValue' has a wrong offset!");

// LuaFunction uw_fight_npc_title.uw_fight_npc_title_C.SetNpcName
// 0x0018 (0x0018 - 0x0000)
struct Uw_fight_npc_title_C_SetNpcName final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Uw_fight_npc_title_C_SetNpcName) == 0x000008, "Wrong alignment on Uw_fight_npc_title_C_SetNpcName");
static_assert(sizeof(Uw_fight_npc_title_C_SetNpcName) == 0x000018, "Wrong size on Uw_fight_npc_title_C_SetNpcName");
static_assert(offsetof(Uw_fight_npc_title_C_SetNpcName, InWidget) == 0x000000, "Member 'Uw_fight_npc_title_C_SetNpcName::InWidget' has a wrong offset!");
static_assert(offsetof(Uw_fight_npc_title_C_SetNpcName, Name_0) == 0x000008, "Member 'Uw_fight_npc_title_C_SetNpcName::Name_0' has a wrong offset!");

// Function uw_fight_npc_title.uw_fight_npc_title_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Uw_fight_npc_title_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_npc_title_C_GetModuleName) == 0x000008, "Wrong alignment on Uw_fight_npc_title_C_GetModuleName");
static_assert(sizeof(Uw_fight_npc_title_C_GetModuleName) == 0x000010, "Wrong size on Uw_fight_npc_title_C_GetModuleName");
static_assert(offsetof(Uw_fight_npc_title_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Uw_fight_npc_title_C_GetModuleName::ReturnValue' has a wrong offset!");

}

