#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_level_occupy_info

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_level_occupy_info.uw_fight_level_occupy_info_C
// 0x0040 (0x03F0 - 0x03B0)
class UUw_fight_level_occupy_info_C final : public ULuaWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Disappear;                                         // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InTo;                                              // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         ImgBG;                                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_level_occupy_list_C*          OccupyInfoItem;                                    // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       OccupyRoot;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelTxt;                                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     Txt1;                                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet__Overridden(class UObject* ListItemObject);
	void ExecuteUbergraph_uw_fight_level_occupy_info(int32 EntryPoint);
	void Construct();
	void OnListItemObjectSet(class UObject* ListItemObject);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_level_occupy_info_C">();
	}
	static class UUw_fight_level_occupy_info_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_level_occupy_info_C>();
	}
};
static_assert(alignof(UUw_fight_level_occupy_info_C) == 0x000008, "Wrong alignment on UUw_fight_level_occupy_info_C");
static_assert(sizeof(UUw_fight_level_occupy_info_C) == 0x0003F0, "Wrong size on UUw_fight_level_occupy_info_C");
static_assert(offsetof(UUw_fight_level_occupy_info_C, UberGraphFrame) == 0x0003B0, "Member 'UUw_fight_level_occupy_info_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupy_info_C, Disappear) == 0x0003B8, "Member 'UUw_fight_level_occupy_info_C::Disappear' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupy_info_C, InTo) == 0x0003C0, "Member 'UUw_fight_level_occupy_info_C::InTo' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupy_info_C, ImgBG) == 0x0003C8, "Member 'UUw_fight_level_occupy_info_C::ImgBG' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupy_info_C, OccupyInfoItem) == 0x0003D0, "Member 'UUw_fight_level_occupy_info_C::OccupyInfoItem' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupy_info_C, OccupyRoot) == 0x0003D8, "Member 'UUw_fight_level_occupy_info_C::OccupyRoot' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupy_info_C, PanelTxt) == 0x0003E0, "Member 'UUw_fight_level_occupy_info_C::PanelTxt' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_occupy_info_C, Txt1) == 0x0003E8, "Member 'UUw_fight_level_occupy_info_C::Txt1' has a wrong offset!");

}

