#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_cross7

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_cross7.uw_fight_cross7_C
// 0x0050 (0x04D0 - 0x0480)
class UUw_fight_cross7_C final : public UCrossHair_FightCross
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URedirectImage*                         Center;                                            // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CrossPanel;                                        // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Group_zoom;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       GroupAmmunition;                                   // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvaVary;                                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage_453;                                 // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Root;                                              // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ESlateVisibility                              Visibity;                                          // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void K2_OnReloading(bool bIsReload, EWeaponType Type, bool bInterrupt, float AnimTime);
	void ExecuteUbergraph_uw_fight_cross7(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_cross7_C">();
	}
	static class UUw_fight_cross7_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_cross7_C>();
	}
};
static_assert(alignof(UUw_fight_cross7_C) == 0x000010, "Wrong alignment on UUw_fight_cross7_C");
static_assert(sizeof(UUw_fight_cross7_C) == 0x0004D0, "Wrong size on UUw_fight_cross7_C");
static_assert(offsetof(UUw_fight_cross7_C, UberGraphFrame) == 0x000480, "Member 'UUw_fight_cross7_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross7_C, Center) == 0x000488, "Member 'UUw_fight_cross7_C::Center' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross7_C, CrossPanel) == 0x000490, "Member 'UUw_fight_cross7_C::CrossPanel' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross7_C, Group_zoom) == 0x000498, "Member 'UUw_fight_cross7_C::Group_zoom' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross7_C, GroupAmmunition) == 0x0004A0, "Member 'UUw_fight_cross7_C::GroupAmmunition' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross7_C, InvaVary) == 0x0004A8, "Member 'UUw_fight_cross7_C::InvaVary' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross7_C, RedirectImage_453) == 0x0004B0, "Member 'UUw_fight_cross7_C::RedirectImage_453' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross7_C, Root) == 0x0004B8, "Member 'UUw_fight_cross7_C::Root' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross7_C, Visibity) == 0x0004C0, "Member 'UUw_fight_cross7_C::Visibity' has a wrong offset!");

}

