#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_damage_Z_089

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_damage_Z_089.uw_fight_damage_Z_089_C
// 0x0040 (0x0420 - 0x03E0)
class UUw_fight_damage_Z_089_C final : public UDamageFloat_Base
{
public:
	class UWidgetAnimation*                       One_Anim3Minus2;                                   // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       One_Anim1Minus2;                                   // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Two_Anim3Minus1;                                   // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       One_Anim1Minus1;                                   // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Two_Anim3;                                         // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       One_Anim1;                                         // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUw_fight_damage_num_C*                 Num;                                               // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_79;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_damage_Z_089_C">();
	}
	static class UUw_fight_damage_Z_089_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_damage_Z_089_C>();
	}
};
static_assert(alignof(UUw_fight_damage_Z_089_C) == 0x000008, "Wrong alignment on UUw_fight_damage_Z_089_C");
static_assert(sizeof(UUw_fight_damage_Z_089_C) == 0x000420, "Wrong size on UUw_fight_damage_Z_089_C");
static_assert(offsetof(UUw_fight_damage_Z_089_C, One_Anim3Minus2) == 0x0003E0, "Member 'UUw_fight_damage_Z_089_C::One_Anim3Minus2' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_Z_089_C, One_Anim1Minus2) == 0x0003E8, "Member 'UUw_fight_damage_Z_089_C::One_Anim1Minus2' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_Z_089_C, Two_Anim3Minus1) == 0x0003F0, "Member 'UUw_fight_damage_Z_089_C::Two_Anim3Minus1' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_Z_089_C, One_Anim1Minus1) == 0x0003F8, "Member 'UUw_fight_damage_Z_089_C::One_Anim1Minus1' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_Z_089_C, Two_Anim3) == 0x000400, "Member 'UUw_fight_damage_Z_089_C::Two_Anim3' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_Z_089_C, One_Anim1) == 0x000408, "Member 'UUw_fight_damage_Z_089_C::One_Anim1' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_Z_089_C, Num) == 0x000410, "Member 'UUw_fight_damage_Z_089_C::Num' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_Z_089_C, Overlay_79) == 0x000418, "Member 'UUw_fight_damage_Z_089_C::Overlay_79' has a wrong offset!");

}

