#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_power

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_power.uw_fight_power_C.ExecuteUbergraph_uw_fight_power
// 0x0020 (0x0020 - 0x0000)
struct Uw_fight_power_C_ExecuteUbergraph_uw_fight_power final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InValue;                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bStart_1;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Start;                                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_End;                                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bStart;                               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_power_C_ExecuteUbergraph_uw_fight_power) == 0x000004, "Wrong alignment on Uw_fight_power_C_ExecuteUbergraph_uw_fight_power");
static_assert(sizeof(Uw_fight_power_C_ExecuteUbergraph_uw_fight_power) == 0x000020, "Wrong size on Uw_fight_power_C_ExecuteUbergraph_uw_fight_power");
static_assert(offsetof(Uw_fight_power_C_ExecuteUbergraph_uw_fight_power, EntryPoint) == 0x000000, "Member 'Uw_fight_power_C_ExecuteUbergraph_uw_fight_power::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_C_ExecuteUbergraph_uw_fight_power, K2Node_Event_InValue) == 0x000004, "Member 'Uw_fight_power_C_ExecuteUbergraph_uw_fight_power::K2Node_Event_InValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_C_ExecuteUbergraph_uw_fight_power, CallFunc_Less_FloatFloat_ReturnValue) == 0x000008, "Member 'Uw_fight_power_C_ExecuteUbergraph_uw_fight_power::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_C_ExecuteUbergraph_uw_fight_power, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x00000C, "Member 'Uw_fight_power_C_ExecuteUbergraph_uw_fight_power::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_C_ExecuteUbergraph_uw_fight_power, K2Node_Event_bStart_1) == 0x000010, "Member 'Uw_fight_power_C_ExecuteUbergraph_uw_fight_power::K2Node_Event_bStart_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_C_ExecuteUbergraph_uw_fight_power, K2Node_Event_Start) == 0x000014, "Member 'Uw_fight_power_C_ExecuteUbergraph_uw_fight_power::K2Node_Event_Start' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_C_ExecuteUbergraph_uw_fight_power, K2Node_Event_End) == 0x000018, "Member 'Uw_fight_power_C_ExecuteUbergraph_uw_fight_power::K2Node_Event_End' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_C_ExecuteUbergraph_uw_fight_power, K2Node_Event_bStart) == 0x00001C, "Member 'Uw_fight_power_C_ExecuteUbergraph_uw_fight_power::K2Node_Event_bStart' has a wrong offset!");

// Function uw_fight_power.uw_fight_power_C.OnPowerTimeStrengthening
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_power_C_OnPowerTimeStrengthening final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_power_C_OnPowerTimeStrengthening) == 0x000001, "Wrong alignment on Uw_fight_power_C_OnPowerTimeStrengthening");
static_assert(sizeof(Uw_fight_power_C_OnPowerTimeStrengthening) == 0x000001, "Wrong size on Uw_fight_power_C_OnPowerTimeStrengthening");
static_assert(offsetof(Uw_fight_power_C_OnPowerTimeStrengthening, bStart) == 0x000000, "Member 'Uw_fight_power_C_OnPowerTimeStrengthening::bStart' has a wrong offset!");

// Function uw_fight_power.uw_fight_power_C.OnPowerStrengthening
// 0x000C (0x000C - 0x0000)
struct Uw_fight_power_C_OnPowerStrengthening final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Start;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         End;                                               // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_power_C_OnPowerStrengthening) == 0x000004, "Wrong alignment on Uw_fight_power_C_OnPowerStrengthening");
static_assert(sizeof(Uw_fight_power_C_OnPowerStrengthening) == 0x00000C, "Wrong size on Uw_fight_power_C_OnPowerStrengthening");
static_assert(offsetof(Uw_fight_power_C_OnPowerStrengthening, bStart) == 0x000000, "Member 'Uw_fight_power_C_OnPowerStrengthening::bStart' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_C_OnPowerStrengthening, Start) == 0x000004, "Member 'Uw_fight_power_C_OnPowerStrengthening::Start' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_C_OnPowerStrengthening, End) == 0x000008, "Member 'Uw_fight_power_C_OnPowerStrengthening::End' has a wrong offset!");

// Function uw_fight_power.uw_fight_power_C.K2_PlayAnim
// 0x0004 (0x0004 - 0x0000)
struct Uw_fight_power_C_K2_PlayAnim final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_power_C_K2_PlayAnim) == 0x000004, "Wrong alignment on Uw_fight_power_C_K2_PlayAnim");
static_assert(sizeof(Uw_fight_power_C_K2_PlayAnim) == 0x000004, "Wrong size on Uw_fight_power_C_K2_PlayAnim");
static_assert(offsetof(Uw_fight_power_C_K2_PlayAnim, InValue) == 0x000000, "Member 'Uw_fight_power_C_K2_PlayAnim::InValue' has a wrong offset!");

}

