#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_player

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_player.uw_fight_player_C.PlayPowerAnim
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_player_C_PlayPowerAnim final
{
public:
	bool                                          bFull;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_player_C_PlayPowerAnim) == 0x000001, "Wrong alignment on Uw_fight_player_C_PlayPowerAnim");
static_assert(sizeof(Uw_fight_player_C_PlayPowerAnim) == 0x000001, "Wrong size on Uw_fight_player_C_PlayPowerAnim");
static_assert(offsetof(Uw_fight_player_C_PlayPowerAnim, bFull) == 0x000000, "Member 'Uw_fight_player_C_PlayPowerAnim::bFull' has a wrong offset!");

// Function uw_fight_player.uw_fight_player_C.K2_OnCustomUmgAnimFinished
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_player_C_K2_OnCustomUmgAnimFinished final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_player_C_K2_OnCustomUmgAnimFinished) == 0x000004, "Wrong alignment on Uw_fight_player_C_K2_OnCustomUmgAnimFinished");
static_assert(sizeof(Uw_fight_player_C_K2_OnCustomUmgAnimFinished) == 0x000008, "Wrong size on Uw_fight_player_C_K2_OnCustomUmgAnimFinished");
static_assert(offsetof(Uw_fight_player_C_K2_OnCustomUmgAnimFinished, AnimName) == 0x000000, "Member 'Uw_fight_player_C_K2_OnCustomUmgAnimFinished::AnimName' has a wrong offset!");

// Function uw_fight_player.uw_fight_player_C.ExecuteUbergraph_uw_fight_player
// 0x0010 (0x0010 - 0x0000)
struct Uw_fight_player_C_ExecuteUbergraph_uw_fight_player final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimName;                             // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bFull;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_player_C_ExecuteUbergraph_uw_fight_player) == 0x000004, "Wrong alignment on Uw_fight_player_C_ExecuteUbergraph_uw_fight_player");
static_assert(sizeof(Uw_fight_player_C_ExecuteUbergraph_uw_fight_player) == 0x000010, "Wrong size on Uw_fight_player_C_ExecuteUbergraph_uw_fight_player");
static_assert(offsetof(Uw_fight_player_C_ExecuteUbergraph_uw_fight_player, EntryPoint) == 0x000000, "Member 'Uw_fight_player_C_ExecuteUbergraph_uw_fight_player::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_C_ExecuteUbergraph_uw_fight_player, K2Node_Event_AnimName) == 0x000004, "Member 'Uw_fight_player_C_ExecuteUbergraph_uw_fight_player::K2Node_Event_AnimName' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_C_ExecuteUbergraph_uw_fight_player, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00000C, "Member 'Uw_fight_player_C_ExecuteUbergraph_uw_fight_player::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_C_ExecuteUbergraph_uw_fight_player, K2Node_Event_bFull) == 0x00000D, "Member 'Uw_fight_player_C_ExecuteUbergraph_uw_fight_player::K2Node_Event_bFull' has a wrong offset!");

}

