#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_jump_button_new_pc

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function uw_fight_jump_button_new_pc.uw_fight_jump_button_new_pc_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_jump_button_new_pc_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_jump_button_new_pc_C_PreConstruct) == 0x000001, "Wrong alignment on Uw_fight_jump_button_new_pc_C_PreConstruct");
static_assert(sizeof(Uw_fight_jump_button_new_pc_C_PreConstruct) == 0x000001, "Wrong size on Uw_fight_jump_button_new_pc_C_PreConstruct");
static_assert(offsetof(Uw_fight_jump_button_new_pc_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Uw_fight_jump_button_new_pc_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function uw_fight_jump_button_new_pc.uw_fight_jump_button_new_pc_C.Tick
// 0x003C (0x003C - 0x0000)
struct Uw_fight_jump_button_new_pc_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_jump_button_new_pc_C_Tick) == 0x000004, "Wrong alignment on Uw_fight_jump_button_new_pc_C_Tick");
static_assert(sizeof(Uw_fight_jump_button_new_pc_C_Tick) == 0x00003C, "Wrong size on Uw_fight_jump_button_new_pc_C_Tick");
static_assert(offsetof(Uw_fight_jump_button_new_pc_C_Tick, MyGeometry) == 0x000000, "Member 'Uw_fight_jump_button_new_pc_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Uw_fight_jump_button_new_pc_C_Tick, InDeltaTime) == 0x000038, "Member 'Uw_fight_jump_button_new_pc_C_Tick::InDeltaTime' has a wrong offset!");

// Function uw_fight_jump_button_new_pc.uw_fight_jump_button_new_pc_C.ExecuteUbergraph_uw_fight_jump_button_new_pc
// 0x0044 (0x0044 - 0x0000)
struct Uw_fight_jump_button_new_pc_C_ExecuteUbergraph_uw_fight_jump_button_new_pc final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_jump_button_new_pc_C_ExecuteUbergraph_uw_fight_jump_button_new_pc) == 0x000004, "Wrong alignment on Uw_fight_jump_button_new_pc_C_ExecuteUbergraph_uw_fight_jump_button_new_pc");
static_assert(sizeof(Uw_fight_jump_button_new_pc_C_ExecuteUbergraph_uw_fight_jump_button_new_pc) == 0x000044, "Wrong size on Uw_fight_jump_button_new_pc_C_ExecuteUbergraph_uw_fight_jump_button_new_pc");
static_assert(offsetof(Uw_fight_jump_button_new_pc_C_ExecuteUbergraph_uw_fight_jump_button_new_pc, EntryPoint) == 0x000000, "Member 'Uw_fight_jump_button_new_pc_C_ExecuteUbergraph_uw_fight_jump_button_new_pc::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_jump_button_new_pc_C_ExecuteUbergraph_uw_fight_jump_button_new_pc, K2Node_Event_MyGeometry) == 0x000004, "Member 'Uw_fight_jump_button_new_pc_C_ExecuteUbergraph_uw_fight_jump_button_new_pc::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Uw_fight_jump_button_new_pc_C_ExecuteUbergraph_uw_fight_jump_button_new_pc, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'Uw_fight_jump_button_new_pc_C_ExecuteUbergraph_uw_fight_jump_button_new_pc::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(Uw_fight_jump_button_new_pc_C_ExecuteUbergraph_uw_fight_jump_button_new_pc, K2Node_Event_IsDesignTime) == 0x000040, "Member 'Uw_fight_jump_button_new_pc_C_ExecuteUbergraph_uw_fight_jump_button_new_pc::K2Node_Event_IsDesignTime' has a wrong offset!");

}

