#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_monster_tips

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_monster_tips.uw_fight_monster_tips_C
// 0x0020 (0x04A8 - 0x0488)
class UUw_fight_monster_tips_C final : public UFightMonsterTips
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0488(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_271;                               // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelMonter;                                       // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelTask;                                         // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ExecuteUbergraph_uw_fight_monster_tips(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_monster_tips_C">();
	}
	static class UUw_fight_monster_tips_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_monster_tips_C>();
	}
};
static_assert(alignof(UUw_fight_monster_tips_C) == 0x000008, "Wrong alignment on UUw_fight_monster_tips_C");
static_assert(sizeof(UUw_fight_monster_tips_C) == 0x0004A8, "Wrong size on UUw_fight_monster_tips_C");
static_assert(offsetof(UUw_fight_monster_tips_C, UberGraphFrame) == 0x000488, "Member 'UUw_fight_monster_tips_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_tips_C, InvalidationBox_271) == 0x000490, "Member 'UUw_fight_monster_tips_C::InvalidationBox_271' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_tips_C, PanelMonter) == 0x000498, "Member 'UUw_fight_monster_tips_C::PanelMonter' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_tips_C, PanelTask) == 0x0004A0, "Member 'UUw_fight_monster_tips_C::PanelTask' has a wrong offset!");

}

