#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_rogue3d_switch02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_rogue3d_switch02.uw_fight_rogue3d_switch02_C
// 0x0108 (0x0388 - 0x0280)
class UUw_fight_rogue3d_switch02_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Out;                                          // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_In;                                           // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGameMeshWidget*                        Zero03;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         BG_1;                                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Glow;                                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image;                                             // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameNiagaraSystemWidget*               Lizi;                                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameNiagaraSystemWidget*               Lizi_1;                                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Raodong01;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Raodong02;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Raodong02_1;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Raodong02_2;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Raodong02_3;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Raodong02_4;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         White;                                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         EffectId;                                          // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   PostParam;                                         // 0x0308(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   PostParam2;                                        // 0x0330(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   PostParam1;                                        // 0x0358(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         EffectId2;                                         // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SequenceEvent__ENTRYPOINTuw_fight_rogue3d_switch02_3();
	void SequenceEvent__ENTRYPOINTuw_fight_rogue3d_switch02_2();
	void SequenceEvent__ENTRYPOINTuw_fight_rogue3d_switch02_1();
	void SequenceEvent__ENTRYPOINTuw_fight_rogue3d_switch02_0();
	void EndPlayEffect();
	void SequenceEvent_0();
	void SequenceEvent_1();
	void SequenceEvent_2();
	void SequenceEvent_3();
	void OnInitialized();
	void Destruct();
	void ExecuteUbergraph_uw_fight_rogue3d_switch02(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_rogue3d_switch02_C">();
	}
	static class UUw_fight_rogue3d_switch02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_rogue3d_switch02_C>();
	}
};
static_assert(alignof(UUw_fight_rogue3d_switch02_C) == 0x000008, "Wrong alignment on UUw_fight_rogue3d_switch02_C");
static_assert(sizeof(UUw_fight_rogue3d_switch02_C) == 0x000388, "Wrong size on UUw_fight_rogue3d_switch02_C");
static_assert(offsetof(UUw_fight_rogue3d_switch02_C, UberGraphFrame) == 0x000280, "Member 'UUw_fight_rogue3d_switch02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch02_C, Anim_Out) == 0x000288, "Member 'UUw_fight_rogue3d_switch02_C::Anim_Out' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch02_C, Anim_In) == 0x000290, "Member 'UUw_fight_rogue3d_switch02_C::Anim_In' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch02_C, Zero03) == 0x000298, "Member 'UUw_fight_rogue3d_switch02_C::Zero03' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch02_C, BG_1) == 0x0002A0, "Member 'UUw_fight_rogue3d_switch02_C::BG_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch02_C, Glow) == 0x0002A8, "Member 'UUw_fight_rogue3d_switch02_C::Glow' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch02_C, Image) == 0x0002B0, "Member 'UUw_fight_rogue3d_switch02_C::Image' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch02_C, Lizi) == 0x0002B8, "Member 'UUw_fight_rogue3d_switch02_C::Lizi' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch02_C, Lizi_1) == 0x0002C0, "Member 'UUw_fight_rogue3d_switch02_C::Lizi_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch02_C, Raodong01) == 0x0002C8, "Member 'UUw_fight_rogue3d_switch02_C::Raodong01' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch02_C, Raodong02) == 0x0002D0, "Member 'UUw_fight_rogue3d_switch02_C::Raodong02' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch02_C, Raodong02_1) == 0x0002D8, "Member 'UUw_fight_rogue3d_switch02_C::Raodong02_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch02_C, Raodong02_2) == 0x0002E0, "Member 'UUw_fight_rogue3d_switch02_C::Raodong02_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch02_C, Raodong02_3) == 0x0002E8, "Member 'UUw_fight_rogue3d_switch02_C::Raodong02_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch02_C, Raodong02_4) == 0x0002F0, "Member 'UUw_fight_rogue3d_switch02_C::Raodong02_4' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch02_C, White) == 0x0002F8, "Member 'UUw_fight_rogue3d_switch02_C::White' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch02_C, EffectId) == 0x000300, "Member 'UUw_fight_rogue3d_switch02_C::EffectId' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch02_C, PostParam) == 0x000308, "Member 'UUw_fight_rogue3d_switch02_C::PostParam' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch02_C, PostParam2) == 0x000330, "Member 'UUw_fight_rogue3d_switch02_C::PostParam2' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch02_C, PostParam1) == 0x000358, "Member 'UUw_fight_rogue3d_switch02_C::PostParam1' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch02_C, EffectId2) == 0x000380, "Member 'UUw_fight_rogue3d_switch02_C::EffectId2' has a wrong offset!");

}

