#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_aimimg_lowhp

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_aimimg_lowhp.uw_fight_aimimg_lowhp_C
// 0x0020 (0x0368 - 0x0348)
class UUw_fight_aimimg_lowhp_C final : public UUserWidgetAnimation
{
public:
	class UWidgetAnimation*                       LowHp;                                             // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Image;                                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_1;                                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_21;                                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_aimimg_lowhp_C">();
	}
	static class UUw_fight_aimimg_lowhp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_aimimg_lowhp_C>();
	}
};
static_assert(alignof(UUw_fight_aimimg_lowhp_C) == 0x000008, "Wrong alignment on UUw_fight_aimimg_lowhp_C");
static_assert(sizeof(UUw_fight_aimimg_lowhp_C) == 0x000368, "Wrong size on UUw_fight_aimimg_lowhp_C");
static_assert(offsetof(UUw_fight_aimimg_lowhp_C, LowHp) == 0x000348, "Member 'UUw_fight_aimimg_lowhp_C::LowHp' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg_lowhp_C, Image) == 0x000350, "Member 'UUw_fight_aimimg_lowhp_C::Image' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg_lowhp_C, Image_1) == 0x000358, "Member 'UUw_fight_aimimg_lowhp_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg_lowhp_C, Image_21) == 0x000360, "Member 'UUw_fight_aimimg_lowhp_C::Image_21' has a wrong offset!");

}

