#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_skill03_button_pc

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_skill03_button_pc.uw_fight_skill03_button_pc_C.K2_PlayEnoughAnim
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_skill03_button_pc_C_K2_PlayEnoughAnim final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_skill03_button_pc_C_K2_PlayEnoughAnim) == 0x000001, "Wrong alignment on Uw_fight_skill03_button_pc_C_K2_PlayEnoughAnim");
static_assert(sizeof(Uw_fight_skill03_button_pc_C_K2_PlayEnoughAnim) == 0x000001, "Wrong size on Uw_fight_skill03_button_pc_C_K2_PlayEnoughAnim");
static_assert(offsetof(Uw_fight_skill03_button_pc_C_K2_PlayEnoughAnim, bPlay) == 0x000000, "Member 'Uw_fight_skill03_button_pc_C_K2_PlayEnoughAnim::bPlay' has a wrong offset!");

// Function uw_fight_skill03_button_pc.uw_fight_skill03_button_pc_C.K2_PlayCDAnim
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_skill03_button_pc_C_K2_PlayCDAnim final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_skill03_button_pc_C_K2_PlayCDAnim) == 0x000001, "Wrong alignment on Uw_fight_skill03_button_pc_C_K2_PlayCDAnim");
static_assert(sizeof(Uw_fight_skill03_button_pc_C_K2_PlayCDAnim) == 0x000001, "Wrong size on Uw_fight_skill03_button_pc_C_K2_PlayCDAnim");
static_assert(offsetof(Uw_fight_skill03_button_pc_C_K2_PlayCDAnim, bPlay) == 0x000000, "Member 'Uw_fight_skill03_button_pc_C_K2_PlayCDAnim::bPlay' has a wrong offset!");

// Function uw_fight_skill03_button_pc.uw_fight_skill03_button_pc_C.OnSkillStrengthening
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_skill03_button_pc_C_OnSkillStrengthening final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_skill03_button_pc_C_OnSkillStrengthening) == 0x000001, "Wrong alignment on Uw_fight_skill03_button_pc_C_OnSkillStrengthening");
static_assert(sizeof(Uw_fight_skill03_button_pc_C_OnSkillStrengthening) == 0x000001, "Wrong size on Uw_fight_skill03_button_pc_C_OnSkillStrengthening");
static_assert(offsetof(Uw_fight_skill03_button_pc_C_OnSkillStrengthening, bStart) == 0x000000, "Member 'Uw_fight_skill03_button_pc_C_OnSkillStrengthening::bStart' has a wrong offset!");

// Function uw_fight_skill03_button_pc.uw_fight_skill03_button_pc_C.K2_PlaySustainAnim
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_skill03_button_pc_C_K2_PlaySustainAnim final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_skill03_button_pc_C_K2_PlaySustainAnim) == 0x000001, "Wrong alignment on Uw_fight_skill03_button_pc_C_K2_PlaySustainAnim");
static_assert(sizeof(Uw_fight_skill03_button_pc_C_K2_PlaySustainAnim) == 0x000001, "Wrong size on Uw_fight_skill03_button_pc_C_K2_PlaySustainAnim");
static_assert(offsetof(Uw_fight_skill03_button_pc_C_K2_PlaySustainAnim, bPlay) == 0x000000, "Member 'Uw_fight_skill03_button_pc_C_K2_PlaySustainAnim::bPlay' has a wrong offset!");

// Function uw_fight_skill03_button_pc.uw_fight_skill03_button_pc_C.OnSkillKeepInterrupt
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_skill03_button_pc_C_OnSkillKeepInterrupt final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_skill03_button_pc_C_OnSkillKeepInterrupt) == 0x000001, "Wrong alignment on Uw_fight_skill03_button_pc_C_OnSkillKeepInterrupt");
static_assert(sizeof(Uw_fight_skill03_button_pc_C_OnSkillKeepInterrupt) == 0x000001, "Wrong size on Uw_fight_skill03_button_pc_C_OnSkillKeepInterrupt");
static_assert(offsetof(Uw_fight_skill03_button_pc_C_OnSkillKeepInterrupt, bStart) == 0x000000, "Member 'Uw_fight_skill03_button_pc_C_OnSkillKeepInterrupt::bStart' has a wrong offset!");

// Function uw_fight_skill03_button_pc.uw_fight_skill03_button_pc_C.OnUIEffectSkillLongPress
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_skill03_button_pc_C_OnUIEffectSkillLongPress final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_skill03_button_pc_C_OnUIEffectSkillLongPress) == 0x000001, "Wrong alignment on Uw_fight_skill03_button_pc_C_OnUIEffectSkillLongPress");
static_assert(sizeof(Uw_fight_skill03_button_pc_C_OnUIEffectSkillLongPress) == 0x000001, "Wrong size on Uw_fight_skill03_button_pc_C_OnUIEffectSkillLongPress");
static_assert(offsetof(Uw_fight_skill03_button_pc_C_OnUIEffectSkillLongPress, bStart) == 0x000000, "Member 'Uw_fight_skill03_button_pc_C_OnUIEffectSkillLongPress::bStart' has a wrong offset!");

// Function uw_fight_skill03_button_pc.uw_fight_skill03_button_pc_C.K2_OnCustomUmgAnimFinished__Overridden
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_skill03_button_pc_C_K2_OnCustomUmgAnimFinished__Overridden final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_skill03_button_pc_C_K2_OnCustomUmgAnimFinished__Overridden) == 0x000004, "Wrong alignment on Uw_fight_skill03_button_pc_C_K2_OnCustomUmgAnimFinished__Overridden");
static_assert(sizeof(Uw_fight_skill03_button_pc_C_K2_OnCustomUmgAnimFinished__Overridden) == 0x000008, "Wrong size on Uw_fight_skill03_button_pc_C_K2_OnCustomUmgAnimFinished__Overridden");
static_assert(offsetof(Uw_fight_skill03_button_pc_C_K2_OnCustomUmgAnimFinished__Overridden, AnimName) == 0x000000, "Member 'Uw_fight_skill03_button_pc_C_K2_OnCustomUmgAnimFinished__Overridden::AnimName' has a wrong offset!");

// Function uw_fight_skill03_button_pc.uw_fight_skill03_button_pc_C.ExecuteUbergraph_uw_fight_skill03_button_pc
// 0x0018 (0x0018 - 0x0000)
struct Uw_fight_skill03_button_pc_C_ExecuteUbergraph_uw_fight_skill03_button_pc final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPlay_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlay_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStart_2;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlay;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStart_1;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimPlayingFromAnimation_ReturnValue;   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStart;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_AnimName;                             // 0x000C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_skill03_button_pc_C_ExecuteUbergraph_uw_fight_skill03_button_pc) == 0x000004, "Wrong alignment on Uw_fight_skill03_button_pc_C_ExecuteUbergraph_uw_fight_skill03_button_pc");
static_assert(sizeof(Uw_fight_skill03_button_pc_C_ExecuteUbergraph_uw_fight_skill03_button_pc) == 0x000018, "Wrong size on Uw_fight_skill03_button_pc_C_ExecuteUbergraph_uw_fight_skill03_button_pc");
static_assert(offsetof(Uw_fight_skill03_button_pc_C_ExecuteUbergraph_uw_fight_skill03_button_pc, EntryPoint) == 0x000000, "Member 'Uw_fight_skill03_button_pc_C_ExecuteUbergraph_uw_fight_skill03_button_pc::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill03_button_pc_C_ExecuteUbergraph_uw_fight_skill03_button_pc, K2Node_Event_bPlay_2) == 0x000004, "Member 'Uw_fight_skill03_button_pc_C_ExecuteUbergraph_uw_fight_skill03_button_pc::K2Node_Event_bPlay_2' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill03_button_pc_C_ExecuteUbergraph_uw_fight_skill03_button_pc, K2Node_Event_bPlay_1) == 0x000005, "Member 'Uw_fight_skill03_button_pc_C_ExecuteUbergraph_uw_fight_skill03_button_pc::K2Node_Event_bPlay_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill03_button_pc_C_ExecuteUbergraph_uw_fight_skill03_button_pc, K2Node_Event_bStart_2) == 0x000006, "Member 'Uw_fight_skill03_button_pc_C_ExecuteUbergraph_uw_fight_skill03_button_pc::K2Node_Event_bStart_2' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill03_button_pc_C_ExecuteUbergraph_uw_fight_skill03_button_pc, K2Node_Event_bPlay) == 0x000007, "Member 'Uw_fight_skill03_button_pc_C_ExecuteUbergraph_uw_fight_skill03_button_pc::K2Node_Event_bPlay' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill03_button_pc_C_ExecuteUbergraph_uw_fight_skill03_button_pc, K2Node_Event_bStart_1) == 0x000008, "Member 'Uw_fight_skill03_button_pc_C_ExecuteUbergraph_uw_fight_skill03_button_pc::K2Node_Event_bStart_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill03_button_pc_C_ExecuteUbergraph_uw_fight_skill03_button_pc, CallFunc_IsAnimPlayingFromAnimation_ReturnValue) == 0x000009, "Member 'Uw_fight_skill03_button_pc_C_ExecuteUbergraph_uw_fight_skill03_button_pc::CallFunc_IsAnimPlayingFromAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill03_button_pc_C_ExecuteUbergraph_uw_fight_skill03_button_pc, K2Node_Event_bStart) == 0x00000A, "Member 'Uw_fight_skill03_button_pc_C_ExecuteUbergraph_uw_fight_skill03_button_pc::K2Node_Event_bStart' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill03_button_pc_C_ExecuteUbergraph_uw_fight_skill03_button_pc, K2Node_Event_AnimName) == 0x00000C, "Member 'Uw_fight_skill03_button_pc_C_ExecuteUbergraph_uw_fight_skill03_button_pc::K2Node_Event_AnimName' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill03_button_pc_C_ExecuteUbergraph_uw_fight_skill03_button_pc, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000014, "Member 'Uw_fight_skill03_button_pc_C_ExecuteUbergraph_uw_fight_skill03_button_pc::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// LuaFunction uw_fight_skill03_button_pc.uw_fight_skill03_button_pc_C.K2_OnCustomUmgAnimFinished
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_skill03_button_pc_C_K2_OnCustomUmgAnimFinished final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_skill03_button_pc_C_K2_OnCustomUmgAnimFinished) == 0x000004, "Wrong alignment on Uw_fight_skill03_button_pc_C_K2_OnCustomUmgAnimFinished");
static_assert(sizeof(Uw_fight_skill03_button_pc_C_K2_OnCustomUmgAnimFinished) == 0x000008, "Wrong size on Uw_fight_skill03_button_pc_C_K2_OnCustomUmgAnimFinished");
static_assert(offsetof(Uw_fight_skill03_button_pc_C_K2_OnCustomUmgAnimFinished, AnimName) == 0x000000, "Member 'Uw_fight_skill03_button_pc_C_K2_OnCustomUmgAnimFinished::AnimName' has a wrong offset!");

// LuaFunction uw_fight_skill03_button_pc.uw_fight_skill03_button_pc_C.OnChargeTimesChange
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_skill03_button_pc_C_OnChargeTimesChange final
{
public:
	int32                                         InCurrentTimes;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InMaxTimes;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Uw_fight_skill03_button_pc_C_OnChargeTimesChange) == 0x000004, "Wrong alignment on Uw_fight_skill03_button_pc_C_OnChargeTimesChange");
static_assert(sizeof(Uw_fight_skill03_button_pc_C_OnChargeTimesChange) == 0x000008, "Wrong size on Uw_fight_skill03_button_pc_C_OnChargeTimesChange");
static_assert(offsetof(Uw_fight_skill03_button_pc_C_OnChargeTimesChange, InCurrentTimes) == 0x000000, "Member 'Uw_fight_skill03_button_pc_C_OnChargeTimesChange::InCurrentTimes' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill03_button_pc_C_OnChargeTimesChange, InMaxTimes) == 0x000004, "Member 'Uw_fight_skill03_button_pc_C_OnChargeTimesChange::InMaxTimes' has a wrong offset!");

// Function uw_fight_skill03_button_pc.uw_fight_skill03_button_pc_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Uw_fight_skill03_button_pc_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_skill03_button_pc_C_GetModuleName) == 0x000008, "Wrong alignment on Uw_fight_skill03_button_pc_C_GetModuleName");
static_assert(sizeof(Uw_fight_skill03_button_pc_C_GetModuleName) == 0x000010, "Wrong size on Uw_fight_skill03_button_pc_C_GetModuleName");
static_assert(offsetof(Uw_fight_skill03_button_pc_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Uw_fight_skill03_button_pc_C_GetModuleName::ReturnValue' has a wrong offset!");

}

