#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_power_girl002a_bar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_power_girl002a_bar.uw_fight_power_girl002a_bar_C
// 0x0050 (0x03C8 - 0x0378)
class Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C final : public UFightBarGirl002aItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Deplete;                                           // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Full;                                              // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CanvasPanel_0;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img1;                                              // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgLight;                                          // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgMask;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelPower1;                                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           Power1_2;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PlayStartStateAnim(bool bPlay);
	void PlayDepleteAnim(int32 Index_0);
	void PlayFullAnim(int32 Index_0);
	void ExecuteUbergraph_uw_fight_power_girl002a_bar(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WidgetBlueprintGeneratedClass uw_fight_power_girl002a_bar.uw_fight_power_girl002a_bar_C", true, "uw_fight_power_girl002a_bar_C">();
	}
	static class Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C>();
	}
};
static_assert(alignof(Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C) == 0x000008, "Wrong alignment on Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C");
static_assert(sizeof(Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C) == 0x0003C8, "Wrong size on Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C");
static_assert(offsetof(Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C, UberGraphFrame) == 0x000378, "Member 'Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C, Deplete) == 0x000380, "Member 'Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C::Deplete' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C, Full) == 0x000388, "Member 'Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C::Full' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C, Loop) == 0x000390, "Member 'Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C::Loop' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C, CanvasPanel_0) == 0x000398, "Member 'Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C, Img1) == 0x0003A0, "Member 'Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C::Img1' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C, ImgLight) == 0x0003A8, "Member 'Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C::ImgLight' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C, ImgMask) == 0x0003B0, "Member 'Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C::ImgMask' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C, PanelPower1) == 0x0003B8, "Member 'Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C::PanelPower1' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C, Power1_2) == 0x0003C0, "Member 'Uw_fight_power_girl002a_bar::UUw_fight_power_girl002a_bar_C::Power1_2' has a wrong offset!");

}

