#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_boss_hp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_boss_hp.uw_fight_boss_hp_C
// 0x0200 (0x0828 - 0x0628)
class UUw_fight_boss_hp_C final : public UFightBossHp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0628(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Switch;                                            // 0x0630(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Control_Back;                                      // 0x0638(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Control_Go;                                        // 0x0640(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       P3;                                                // 0x0648(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       P2;                                                // 0x0650(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ControlFreeOpen;                                   // 0x0658(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Silent;                                            // 0x0660(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SpecialOpen;                                       // 0x0668(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SpecialTime;                                       // 0x0670(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Interrupt;                                         // 0x0678(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reset;                                             // 0x0680(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HpHeal;                                            // 0x0688(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HpInviNoSee;                                       // 0x0690(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       break_reduce;                                      // 0x0698(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       break_increase;                                    // 0x06A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       break_full;                                        // 0x06A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UProgressBar*                           BarSkill;                                          // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           BarSpecial;                                        // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CanvasPanel_156;                                   // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomText*                            CustomText_361;                                    // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         EffectImDot;                                       // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         EffectImg;                                         // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_93;                                  // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       HpPanel;                                           // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_81;                                          // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_148;                                         // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBeheaded;                                       // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgControl;                                        // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgControlFree1;                                   // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgControlFree2;                                   // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgControlFree3;                                   // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgHpHeal;                                         // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAlphaMaskImage*                        ImgIconNew;                                        // 0x0730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgSkill;                                          // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgSkillBG;                                        // 0x0740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustListView*                          ListBossPoint;                                     // 0x0748(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustListView*                          ListControl;                                       // 0x0750(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustListView*                          ListResistance;                                    // 0x0758(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Mask;                                              // 0x0760(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Mask_1;                                            // 0x0768(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Mask_2;                                            // 0x0770(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAlphaMaskImage*                        Mask01;                                            // 0x0778(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAlphaMaskImage*                        Mask02;                                            // 0x0780(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelBounce;                                       // 0x0788(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PanelCrossbow;                                     // 0x0790(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelHpMark;                                       // 0x0798(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelOnlineBossNum;                                // 0x07A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelShieldMark;                                   // 0x07A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelSpecial;                                      // 0x07B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RED1;                                              // 0x07B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         StateInvincible;                                   // 0x07C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         StateReduceTreat;                                  // 0x07C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         StateReplyAdd;                                     // 0x07D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtSpecial;                                        // 0x07D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         White;                                             // 0x07E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         White_1;                                           // 0x07E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         White_2;                                           // 0x07F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         White_3;                                           // 0x07F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         White_4;                                           // 0x0800(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         White_5;                                           // 0x0808(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         TLimit;                                            // 0x0810(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_814[0x4];                                      // 0x0814(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPaperSprite*>                   IconArr;                                           // 0x0818(0x0010)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_uw_fight_boss_hp(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void StageBreakProgressPlayAnim(float Precent, bool bBreak);
	void K2_NotifyInitBindBoss();
	void Construct();
	void K2_OnAppliedModifierChange(int32 ModifierID, bool IsApply, int64 InLauncherCharacterHashIndex);
	void OnDamageNumChange(float DamageTaken);
	void K2_OnUpdate(float InDeltaTime);
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_boss_hp_C">();
	}
	static class UUw_fight_boss_hp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_boss_hp_C>();
	}
};
static_assert(alignof(UUw_fight_boss_hp_C) == 0x000008, "Wrong alignment on UUw_fight_boss_hp_C");
static_assert(sizeof(UUw_fight_boss_hp_C) == 0x000828, "Wrong size on UUw_fight_boss_hp_C");
static_assert(offsetof(UUw_fight_boss_hp_C, UberGraphFrame) == 0x000628, "Member 'UUw_fight_boss_hp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, Switch) == 0x000630, "Member 'UUw_fight_boss_hp_C::Switch' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, Control_Back) == 0x000638, "Member 'UUw_fight_boss_hp_C::Control_Back' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, Control_Go) == 0x000640, "Member 'UUw_fight_boss_hp_C::Control_Go' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, P3) == 0x000648, "Member 'UUw_fight_boss_hp_C::P3' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, P2) == 0x000650, "Member 'UUw_fight_boss_hp_C::P2' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, ControlFreeOpen) == 0x000658, "Member 'UUw_fight_boss_hp_C::ControlFreeOpen' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, Silent) == 0x000660, "Member 'UUw_fight_boss_hp_C::Silent' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, SpecialOpen) == 0x000668, "Member 'UUw_fight_boss_hp_C::SpecialOpen' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, SpecialTime) == 0x000670, "Member 'UUw_fight_boss_hp_C::SpecialTime' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, Interrupt) == 0x000678, "Member 'UUw_fight_boss_hp_C::Interrupt' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, Reset) == 0x000680, "Member 'UUw_fight_boss_hp_C::Reset' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, HpHeal) == 0x000688, "Member 'UUw_fight_boss_hp_C::HpHeal' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, HpInviNoSee) == 0x000690, "Member 'UUw_fight_boss_hp_C::HpInviNoSee' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, break_reduce) == 0x000698, "Member 'UUw_fight_boss_hp_C::break_reduce' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, break_increase) == 0x0006A0, "Member 'UUw_fight_boss_hp_C::break_increase' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, break_full) == 0x0006A8, "Member 'UUw_fight_boss_hp_C::break_full' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, BarSkill) == 0x0006B0, "Member 'UUw_fight_boss_hp_C::BarSkill' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, BarSpecial) == 0x0006B8, "Member 'UUw_fight_boss_hp_C::BarSpecial' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, CanvasPanel_156) == 0x0006C0, "Member 'UUw_fight_boss_hp_C::CanvasPanel_156' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, CustomText_361) == 0x0006C8, "Member 'UUw_fight_boss_hp_C::CustomText_361' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, EffectImDot) == 0x0006D0, "Member 'UUw_fight_boss_hp_C::EffectImDot' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, EffectImg) == 0x0006D8, "Member 'UUw_fight_boss_hp_C::EffectImg' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, HorizontalBox_93) == 0x0006E0, "Member 'UUw_fight_boss_hp_C::HorizontalBox_93' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, HpPanel) == 0x0006E8, "Member 'UUw_fight_boss_hp_C::HpPanel' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, Image_81) == 0x0006F0, "Member 'UUw_fight_boss_hp_C::Image_81' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, Image_148) == 0x0006F8, "Member 'UUw_fight_boss_hp_C::Image_148' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, ImgBeheaded) == 0x000700, "Member 'UUw_fight_boss_hp_C::ImgBeheaded' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, ImgControl) == 0x000708, "Member 'UUw_fight_boss_hp_C::ImgControl' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, ImgControlFree1) == 0x000710, "Member 'UUw_fight_boss_hp_C::ImgControlFree1' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, ImgControlFree2) == 0x000718, "Member 'UUw_fight_boss_hp_C::ImgControlFree2' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, ImgControlFree3) == 0x000720, "Member 'UUw_fight_boss_hp_C::ImgControlFree3' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, ImgHpHeal) == 0x000728, "Member 'UUw_fight_boss_hp_C::ImgHpHeal' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, ImgIconNew) == 0x000730, "Member 'UUw_fight_boss_hp_C::ImgIconNew' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, ImgSkill) == 0x000738, "Member 'UUw_fight_boss_hp_C::ImgSkill' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, ImgSkillBG) == 0x000740, "Member 'UUw_fight_boss_hp_C::ImgSkillBG' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, ListBossPoint) == 0x000748, "Member 'UUw_fight_boss_hp_C::ListBossPoint' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, ListControl) == 0x000750, "Member 'UUw_fight_boss_hp_C::ListControl' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, ListResistance) == 0x000758, "Member 'UUw_fight_boss_hp_C::ListResistance' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, Mask) == 0x000760, "Member 'UUw_fight_boss_hp_C::Mask' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, Mask_1) == 0x000768, "Member 'UUw_fight_boss_hp_C::Mask_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, Mask_2) == 0x000770, "Member 'UUw_fight_boss_hp_C::Mask_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, Mask01) == 0x000778, "Member 'UUw_fight_boss_hp_C::Mask01' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, Mask02) == 0x000780, "Member 'UUw_fight_boss_hp_C::Mask02' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, PanelBounce) == 0x000788, "Member 'UUw_fight_boss_hp_C::PanelBounce' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, PanelCrossbow) == 0x000790, "Member 'UUw_fight_boss_hp_C::PanelCrossbow' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, PanelHpMark) == 0x000798, "Member 'UUw_fight_boss_hp_C::PanelHpMark' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, PanelOnlineBossNum) == 0x0007A0, "Member 'UUw_fight_boss_hp_C::PanelOnlineBossNum' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, PanelShieldMark) == 0x0007A8, "Member 'UUw_fight_boss_hp_C::PanelShieldMark' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, PanelSpecial) == 0x0007B0, "Member 'UUw_fight_boss_hp_C::PanelSpecial' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, RED1) == 0x0007B8, "Member 'UUw_fight_boss_hp_C::RED1' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, StateInvincible) == 0x0007C0, "Member 'UUw_fight_boss_hp_C::StateInvincible' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, StateReduceTreat) == 0x0007C8, "Member 'UUw_fight_boss_hp_C::StateReduceTreat' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, StateReplyAdd) == 0x0007D0, "Member 'UUw_fight_boss_hp_C::StateReplyAdd' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, TxtSpecial) == 0x0007D8, "Member 'UUw_fight_boss_hp_C::TxtSpecial' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, White) == 0x0007E0, "Member 'UUw_fight_boss_hp_C::White' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, White_1) == 0x0007E8, "Member 'UUw_fight_boss_hp_C::White_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, White_2) == 0x0007F0, "Member 'UUw_fight_boss_hp_C::White_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, White_3) == 0x0007F8, "Member 'UUw_fight_boss_hp_C::White_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, White_4) == 0x000800, "Member 'UUw_fight_boss_hp_C::White_4' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, White_5) == 0x000808, "Member 'UUw_fight_boss_hp_C::White_5' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, TLimit) == 0x000810, "Member 'UUw_fight_boss_hp_C::TLimit' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_C, IconArr) == 0x000818, "Member 'UUw_fight_boss_hp_C::IconArr' has a wrong offset!");

}

