#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_player_hp_pc

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_player_hp_pc.uw_fight_player_hp_pc_C.K2_OnPlayHpLowAnim
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_player_hp_pc_C_K2_OnPlayHpLowAnim final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_player_hp_pc_C_K2_OnPlayHpLowAnim) == 0x000001, "Wrong alignment on Uw_fight_player_hp_pc_C_K2_OnPlayHpLowAnim");
static_assert(sizeof(Uw_fight_player_hp_pc_C_K2_OnPlayHpLowAnim) == 0x000001, "Wrong size on Uw_fight_player_hp_pc_C_K2_OnPlayHpLowAnim");
static_assert(offsetof(Uw_fight_player_hp_pc_C_K2_OnPlayHpLowAnim, bPlay) == 0x000000, "Member 'Uw_fight_player_hp_pc_C_K2_OnPlayHpLowAnim::bPlay' has a wrong offset!");

// Function uw_fight_player_hp_pc.uw_fight_player_hp_pc_C.K2_OnPlayEnergyFullAnim
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_player_hp_pc_C_K2_OnPlayEnergyFullAnim final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_player_hp_pc_C_K2_OnPlayEnergyFullAnim) == 0x000001, "Wrong alignment on Uw_fight_player_hp_pc_C_K2_OnPlayEnergyFullAnim");
static_assert(sizeof(Uw_fight_player_hp_pc_C_K2_OnPlayEnergyFullAnim) == 0x000001, "Wrong size on Uw_fight_player_hp_pc_C_K2_OnPlayEnergyFullAnim");
static_assert(offsetof(Uw_fight_player_hp_pc_C_K2_OnPlayEnergyFullAnim, bPlay) == 0x000000, "Member 'Uw_fight_player_hp_pc_C_K2_OnPlayEnergyFullAnim::bPlay' has a wrong offset!");

// Function uw_fight_player_hp_pc.uw_fight_player_hp_pc_C.PlayStateAnim
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_player_hp_pc_C_PlayStateAnim final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_player_hp_pc_C_PlayStateAnim) == 0x000001, "Wrong alignment on Uw_fight_player_hp_pc_C_PlayStateAnim");
static_assert(sizeof(Uw_fight_player_hp_pc_C_PlayStateAnim) == 0x000001, "Wrong size on Uw_fight_player_hp_pc_C_PlayStateAnim");
static_assert(offsetof(Uw_fight_player_hp_pc_C_PlayStateAnim, bPlay) == 0x000000, "Member 'Uw_fight_player_hp_pc_C_PlayStateAnim::bPlay' has a wrong offset!");

// Function uw_fight_player_hp_pc.uw_fight_player_hp_pc_C.K2_OnPlayEnergyFullLoopAnim
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_player_hp_pc_C_K2_OnPlayEnergyFullLoopAnim final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_player_hp_pc_C_K2_OnPlayEnergyFullLoopAnim) == 0x000001, "Wrong alignment on Uw_fight_player_hp_pc_C_K2_OnPlayEnergyFullLoopAnim");
static_assert(sizeof(Uw_fight_player_hp_pc_C_K2_OnPlayEnergyFullLoopAnim) == 0x000001, "Wrong size on Uw_fight_player_hp_pc_C_K2_OnPlayEnergyFullLoopAnim");
static_assert(offsetof(Uw_fight_player_hp_pc_C_K2_OnPlayEnergyFullLoopAnim, bPlay) == 0x000000, "Member 'Uw_fight_player_hp_pc_C_K2_OnPlayEnergyFullLoopAnim::bPlay' has a wrong offset!");

// Function uw_fight_player_hp_pc.uw_fight_player_hp_pc_C.K2_OnCustomUmgAnimFinished
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_player_hp_pc_C_K2_OnCustomUmgAnimFinished final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_player_hp_pc_C_K2_OnCustomUmgAnimFinished) == 0x000004, "Wrong alignment on Uw_fight_player_hp_pc_C_K2_OnCustomUmgAnimFinished");
static_assert(sizeof(Uw_fight_player_hp_pc_C_K2_OnCustomUmgAnimFinished) == 0x000008, "Wrong size on Uw_fight_player_hp_pc_C_K2_OnCustomUmgAnimFinished");
static_assert(offsetof(Uw_fight_player_hp_pc_C_K2_OnCustomUmgAnimFinished, AnimName) == 0x000000, "Member 'Uw_fight_player_hp_pc_C_K2_OnCustomUmgAnimFinished::AnimName' has a wrong offset!");

// Function uw_fight_player_hp_pc.uw_fight_player_hp_pc_C.ExecuteUbergraph_uw_fight_player_hp_pc
// 0x0014 (0x0014 - 0x0000)
struct Uw_fight_player_hp_pc_C_ExecuteUbergraph_uw_fight_player_hp_pc final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimName;                             // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPlay_3;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlay_2;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlay_1;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlay;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_player_hp_pc_C_ExecuteUbergraph_uw_fight_player_hp_pc) == 0x000004, "Wrong alignment on Uw_fight_player_hp_pc_C_ExecuteUbergraph_uw_fight_player_hp_pc");
static_assert(sizeof(Uw_fight_player_hp_pc_C_ExecuteUbergraph_uw_fight_player_hp_pc) == 0x000014, "Wrong size on Uw_fight_player_hp_pc_C_ExecuteUbergraph_uw_fight_player_hp_pc");
static_assert(offsetof(Uw_fight_player_hp_pc_C_ExecuteUbergraph_uw_fight_player_hp_pc, EntryPoint) == 0x000000, "Member 'Uw_fight_player_hp_pc_C_ExecuteUbergraph_uw_fight_player_hp_pc::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_hp_pc_C_ExecuteUbergraph_uw_fight_player_hp_pc, K2Node_Event_AnimName) == 0x000004, "Member 'Uw_fight_player_hp_pc_C_ExecuteUbergraph_uw_fight_player_hp_pc::K2Node_Event_AnimName' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_hp_pc_C_ExecuteUbergraph_uw_fight_player_hp_pc, K2Node_Event_bPlay_3) == 0x00000C, "Member 'Uw_fight_player_hp_pc_C_ExecuteUbergraph_uw_fight_player_hp_pc::K2Node_Event_bPlay_3' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_hp_pc_C_ExecuteUbergraph_uw_fight_player_hp_pc, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00000D, "Member 'Uw_fight_player_hp_pc_C_ExecuteUbergraph_uw_fight_player_hp_pc::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_hp_pc_C_ExecuteUbergraph_uw_fight_player_hp_pc, K2Node_Event_bPlay_2) == 0x00000E, "Member 'Uw_fight_player_hp_pc_C_ExecuteUbergraph_uw_fight_player_hp_pc::K2Node_Event_bPlay_2' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_hp_pc_C_ExecuteUbergraph_uw_fight_player_hp_pc, K2Node_Event_bPlay_1) == 0x00000F, "Member 'Uw_fight_player_hp_pc_C_ExecuteUbergraph_uw_fight_player_hp_pc::K2Node_Event_bPlay_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_hp_pc_C_ExecuteUbergraph_uw_fight_player_hp_pc, K2Node_Event_bPlay) == 0x000010, "Member 'Uw_fight_player_hp_pc_C_ExecuteUbergraph_uw_fight_player_hp_pc::K2Node_Event_bPlay' has a wrong offset!");

}

