#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_aimimg

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function uw_fight_aimimg.uw_fight_aimimg_C.VisibilityChange
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_aimimg_C_VisibilityChange final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_aimimg_C_VisibilityChange) == 0x000001, "Wrong alignment on Uw_fight_aimimg_C_VisibilityChange");
static_assert(sizeof(Uw_fight_aimimg_C_VisibilityChange) == 0x000001, "Wrong size on Uw_fight_aimimg_C_VisibilityChange");
static_assert(offsetof(Uw_fight_aimimg_C_VisibilityChange, InVisibility) == 0x000000, "Member 'Uw_fight_aimimg_C_VisibilityChange::InVisibility' has a wrong offset!");

// Function uw_fight_aimimg.uw_fight_aimimg_C.ExecuteUbergraph_uw_fight_aimimg
// 0x0020 (0x0020 - 0x0000)
struct Uw_fight_aimimg_C_ExecuteUbergraph_uw_fight_aimimg final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_aimimg_C_ExecuteUbergraph_uw_fight_aimimg) == 0x000008, "Wrong alignment on Uw_fight_aimimg_C_ExecuteUbergraph_uw_fight_aimimg");
static_assert(sizeof(Uw_fight_aimimg_C_ExecuteUbergraph_uw_fight_aimimg) == 0x000020, "Wrong size on Uw_fight_aimimg_C_ExecuteUbergraph_uw_fight_aimimg");
static_assert(offsetof(Uw_fight_aimimg_C_ExecuteUbergraph_uw_fight_aimimg, EntryPoint) == 0x000000, "Member 'Uw_fight_aimimg_C_ExecuteUbergraph_uw_fight_aimimg::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_aimimg_C_ExecuteUbergraph_uw_fight_aimimg, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Uw_fight_aimimg_C_ExecuteUbergraph_uw_fight_aimimg::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Uw_fight_aimimg_C_ExecuteUbergraph_uw_fight_aimimg, K2Node_Event_IsDesignTime) == 0x000014, "Member 'Uw_fight_aimimg_C_ExecuteUbergraph_uw_fight_aimimg::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(Uw_fight_aimimg_C_ExecuteUbergraph_uw_fight_aimimg, K2Node_CustomEvent_InVisibility) == 0x000015, "Member 'Uw_fight_aimimg_C_ExecuteUbergraph_uw_fight_aimimg::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(Uw_fight_aimimg_C_ExecuteUbergraph_uw_fight_aimimg, K2Node_SwitchEnum_CmpSuccess) == 0x000016, "Member 'Uw_fight_aimimg_C_ExecuteUbergraph_uw_fight_aimimg::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Uw_fight_aimimg_C_ExecuteUbergraph_uw_fight_aimimg, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'Uw_fight_aimimg_C_ExecuteUbergraph_uw_fight_aimimg::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function uw_fight_aimimg.uw_fight_aimimg_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_aimimg_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_aimimg_C_PreConstruct) == 0x000001, "Wrong alignment on Uw_fight_aimimg_C_PreConstruct");
static_assert(sizeof(Uw_fight_aimimg_C_PreConstruct) == 0x000001, "Wrong size on Uw_fight_aimimg_C_PreConstruct");
static_assert(offsetof(Uw_fight_aimimg_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Uw_fight_aimimg_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

