#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_power_girl002a_twobar_0

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_power_girl002a_twobar.uw_fight_power_girl002a_twobar_C
// 0x0088 (0x0418 - 0x0390)
class Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C final : public UFightBarGirl002aItem2
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Deplete2;                                          // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Deplete;                                           // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Full2;                                             // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Full;                                              // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CanvasPanel_0;                                     // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img1;                                              // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img2;                                              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img3;                                              // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img4;                                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgLight;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgLight1;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgMask;                                           // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelPower1;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           Power1;                                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           Power2;                                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PlayDepleteAnim(int32 Index_0);
	void PlayFullAnim(int32 Index_0);
	void PlayStartStateAnim(bool bPlay);
	void ExecuteUbergraph_uw_fight_power_girl002a_twobar(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WidgetBlueprintGeneratedClass uw_fight_power_girl002a_twobar.uw_fight_power_girl002a_twobar_C", true, "uw_fight_power_girl002a_twobar_C">();
	}
	static class Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C>();
	}
};
static_assert(alignof(Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C) == 0x000008, "Wrong alignment on Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C");
static_assert(sizeof(Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C) == 0x000418, "Wrong size on Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C, UberGraphFrame) == 0x000390, "Member 'Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C, Deplete2) == 0x000398, "Member 'Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C::Deplete2' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C, Deplete) == 0x0003A0, "Member 'Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C::Deplete' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C, Full2) == 0x0003A8, "Member 'Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C::Full2' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C, Full) == 0x0003B0, "Member 'Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C::Full' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C, Loop) == 0x0003B8, "Member 'Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C::Loop' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C, CanvasPanel_0) == 0x0003C0, "Member 'Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C, Img1) == 0x0003C8, "Member 'Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C::Img1' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C, Img2) == 0x0003D0, "Member 'Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C::Img2' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C, Img3) == 0x0003D8, "Member 'Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C::Img3' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C, Img4) == 0x0003E0, "Member 'Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C::Img4' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C, ImgLight) == 0x0003E8, "Member 'Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C::ImgLight' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C, ImgLight1) == 0x0003F0, "Member 'Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C::ImgLight1' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C, ImgMask) == 0x0003F8, "Member 'Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C::ImgMask' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C, PanelPower1) == 0x000400, "Member 'Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C::PanelPower1' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C, Power1) == 0x000408, "Member 'Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C::Power1' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C, Power2) == 0x000410, "Member 'Uw_fight_power_girl002a_twobar_0::UUw_fight_power_girl002a_twobar_C::Power2' has a wrong offset!");

}

