#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_level_warn

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_level_warn.uw_fight_level_warn_C
// 0x0058 (0x0408 - 0x03B0)
class UUw_fight_level_warn_C final : public ULuaWidget
{
public:
	class UWidgetAnimation*                       ALLloop;                                           // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Down;                                              // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Down_1;                                            // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Down_2;                                            // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Down_3;                                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Shadow1;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Shadow2;                                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Up;                                                // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Up_1;                                              // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Up_2;                                              // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Up_3;                                              // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_level_warn_C">();
	}
	static class UUw_fight_level_warn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_level_warn_C>();
	}
};
static_assert(alignof(UUw_fight_level_warn_C) == 0x000008, "Wrong alignment on UUw_fight_level_warn_C");
static_assert(sizeof(UUw_fight_level_warn_C) == 0x000408, "Wrong size on UUw_fight_level_warn_C");
static_assert(offsetof(UUw_fight_level_warn_C, ALLloop) == 0x0003B0, "Member 'UUw_fight_level_warn_C::ALLloop' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_warn_C, Down) == 0x0003B8, "Member 'UUw_fight_level_warn_C::Down' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_warn_C, Down_1) == 0x0003C0, "Member 'UUw_fight_level_warn_C::Down_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_warn_C, Down_2) == 0x0003C8, "Member 'UUw_fight_level_warn_C::Down_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_warn_C, Down_3) == 0x0003D0, "Member 'UUw_fight_level_warn_C::Down_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_warn_C, Shadow1) == 0x0003D8, "Member 'UUw_fight_level_warn_C::Shadow1' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_warn_C, Shadow2) == 0x0003E0, "Member 'UUw_fight_level_warn_C::Shadow2' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_warn_C, Up) == 0x0003E8, "Member 'UUw_fight_level_warn_C::Up' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_warn_C, Up_1) == 0x0003F0, "Member 'UUw_fight_level_warn_C::Up_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_warn_C, Up_2) == 0x0003F8, "Member 'UUw_fight_level_warn_C::Up_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_warn_C, Up_3) == 0x000400, "Member 'UUw_fight_level_warn_C::Up_3' has a wrong offset!");

}

