#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_rogue3d

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_rogue3d.uw_fight_rogue3d_C
// 0x0048 (0x02C8 - 0x0280)
class UUw_fight_rogue3d_C final : public UUserWidget
{
public:
	class URedirectImage*                         BG;                                                // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                BtnComplete;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomSafeZone*                        CustomSafeZone_0;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtComplete;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtDesc;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtMapGroup;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtMapId;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtNum;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtSkin;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_rogue3d_C">();
	}
	static class UUw_fight_rogue3d_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_rogue3d_C>();
	}
};
static_assert(alignof(UUw_fight_rogue3d_C) == 0x000008, "Wrong alignment on UUw_fight_rogue3d_C");
static_assert(sizeof(UUw_fight_rogue3d_C) == 0x0002C8, "Wrong size on UUw_fight_rogue3d_C");
static_assert(offsetof(UUw_fight_rogue3d_C, BG) == 0x000280, "Member 'UUw_fight_rogue3d_C::BG' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_C, BtnComplete) == 0x000288, "Member 'UUw_fight_rogue3d_C::BtnComplete' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_C, CustomSafeZone_0) == 0x000290, "Member 'UUw_fight_rogue3d_C::CustomSafeZone_0' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_C, TxtComplete) == 0x000298, "Member 'UUw_fight_rogue3d_C::TxtComplete' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_C, TxtDesc) == 0x0002A0, "Member 'UUw_fight_rogue3d_C::TxtDesc' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_C, TxtMapGroup) == 0x0002A8, "Member 'UUw_fight_rogue3d_C::TxtMapGroup' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_C, TxtMapId) == 0x0002B0, "Member 'UUw_fight_rogue3d_C::TxtMapId' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_C, TxtNum) == 0x0002B8, "Member 'UUw_fight_rogue3d_C::TxtNum' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_C, TxtSkin) == 0x0002C0, "Member 'UUw_fight_rogue3d_C::TxtSkin' has a wrong offset!");

}

