#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_fight_scene_switch_fast2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_scene_switch_fast2.uw_fight_scene_switch_fast2_C
// 0x0028 (0x02A8 - 0x0280)
class Uuw_fight_scene_switch_fast2_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Off;                                               // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       On;                                                // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Image_29;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         EffectId;                                          // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_uw_fight_scene_switch_fast2(int32 EntryPoint);
	void EndEvent();
	void BeginEvent();
	void SwitchEvent();
	void EndPlayEffect();
	void SequenceEvent__ENTRYPOINTuw_fight_scene_switch_fast2_0();
	void SequenceEvent__ENTRYPOINTuw_fight_scene_switch_fast2_1();
	void SequenceEvent__ENTRYPOINTuw_fight_scene_switch_fast2_2();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("uw_fight_scene_switch_fast2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"uw_fight_scene_switch_fast2_C")
	}
	static class Uuw_fight_scene_switch_fast2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uuw_fight_scene_switch_fast2_C>();
	}
};
DUMPER7_ASSERTS_Uuw_fight_scene_switch_fast2_C;

}

