#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_damage_weak

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_damage_weak.uw_fight_damage_weak_C
// 0x0060 (0x0440 - 0x03E0)
class UUw_fight_damage_weak_C final : public UDamageFloat_Base
{
public:
	class UWidgetAnimation*                       Anim15;                                            // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim14;                                            // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim5;                                             // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim4;                                             // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim13;                                            // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim12;                                            // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim11;                                            // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim3;                                             // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim2;                                             // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim1;                                             // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUw_fight_damage_num_C*                 Num;                                               // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_79;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_damage_weak_C">();
	}
	static class UUw_fight_damage_weak_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_damage_weak_C>();
	}
};
static_assert(alignof(UUw_fight_damage_weak_C) == 0x000008, "Wrong alignment on UUw_fight_damage_weak_C");
static_assert(sizeof(UUw_fight_damage_weak_C) == 0x000440, "Wrong size on UUw_fight_damage_weak_C");
static_assert(offsetof(UUw_fight_damage_weak_C, Anim15) == 0x0003E0, "Member 'UUw_fight_damage_weak_C::Anim15' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_weak_C, Anim14) == 0x0003E8, "Member 'UUw_fight_damage_weak_C::Anim14' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_weak_C, Anim5) == 0x0003F0, "Member 'UUw_fight_damage_weak_C::Anim5' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_weak_C, Anim4) == 0x0003F8, "Member 'UUw_fight_damage_weak_C::Anim4' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_weak_C, Anim13) == 0x000400, "Member 'UUw_fight_damage_weak_C::Anim13' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_weak_C, Anim12) == 0x000408, "Member 'UUw_fight_damage_weak_C::Anim12' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_weak_C, Anim11) == 0x000410, "Member 'UUw_fight_damage_weak_C::Anim11' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_weak_C, Anim3) == 0x000418, "Member 'UUw_fight_damage_weak_C::Anim3' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_weak_C, Anim2) == 0x000420, "Member 'UUw_fight_damage_weak_C::Anim2' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_weak_C, Anim1) == 0x000428, "Member 'UUw_fight_damage_weak_C::Anim1' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_weak_C, Num) == 0x000430, "Member 'UUw_fight_damage_weak_C::Num' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_weak_C, Overlay_79) == 0x000438, "Member 'UUw_fight_damage_weak_C::Overlay_79' has a wrong offset!");

}

