#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_fight_skill_button

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function uw_fight_skill_button.uw_fight_skill_button_C.ExecuteUbergraph_uw_fight_skill_button
// 0x00D0 (0x00D0 - 0x0000)
struct uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimName;                             // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bActive;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bModify;                              // 0x000F(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlay_2;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStart_1;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bFull;                                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bForbid;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlay_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlay;                                // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Type;                           // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_CustomEvent_InMouseEvent;                   // 0x0020(0x0070)(ConstParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameController_C*                   K2Node_DynamicCast_AsBP_Game_Controller;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRushMode_ReturnValue;                  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const int32 Type, const struct FPointerEvent& InMouseEvent)> K2Node_CreateDelegate_OutputDelegate; // 0x00BC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStart;                               // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_C_ExecuteUbergraph_uw_fight_skill_button;

// Function uw_fight_skill_button.uw_fight_skill_button_C.K2_OnCustomUmgAnimFinished__Overridden
// 0x0008 (0x0008 - 0x0000)
struct uw_fight_skill_button_C_K2_OnCustomUmgAnimFinished__Overridden final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_skill_button_C_K2_OnCustomUmgAnimFinished__Overridden;

// Function uw_fight_skill_button.uw_fight_skill_button_C.OnSkillKeepInterrupt
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_button_C_OnSkillKeepInterrupt final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_C_OnSkillKeepInterrupt;

// Function uw_fight_skill_button.uw_fight_skill_button_C.OnButtonDom
// 0x0078 (0x0078 - 0x0000)
struct uw_fight_skill_button_C_OnButtonDom final
{
public:
	int32                                         Type;                                              // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          InMouseEvent;                                      // 0x0008(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_uw_fight_skill_button_C_OnButtonDom;

// Function uw_fight_skill_button.uw_fight_skill_button_C.K2_PlaySustainAnim
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_button_C_K2_PlaySustainAnim final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_C_K2_PlaySustainAnim;

// Function uw_fight_skill_button.uw_fight_skill_button_C.PlayDerivedSkillAnim
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_button_C_PlayDerivedSkillAnim final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_C_PlayDerivedSkillAnim;

// Function uw_fight_skill_button.uw_fight_skill_button_C.K2_SetButtonForbid
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_button_C_K2_SetButtonForbid final
{
public:
	bool                                          bForbid;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_C_K2_SetButtonForbid;

// Function uw_fight_skill_button.uw_fight_skill_button_C.K2_NormalEnergyChange
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_button_C_K2_NormalEnergyChange final
{
public:
	bool                                          bFull;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_C_K2_NormalEnergyChange;

// Function uw_fight_skill_button.uw_fight_skill_button_C.OnSkillStrengthening__Overridden
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_button_C_OnSkillStrengthening__Overridden final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_C_OnSkillStrengthening__Overridden;

// Function uw_fight_skill_button.uw_fight_skill_button_C.K2_PlayCDAnim__Overridden
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_button_C_K2_PlayCDAnim__Overridden final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_C_K2_PlayCDAnim__Overridden;

// Function uw_fight_skill_button.uw_fight_skill_button_C.OnModifyStateChange
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_button_C_OnModifyStateChange final
{
public:
	bool                                          bModify;                                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_C_OnModifyStateChange;

// Function uw_fight_skill_button.uw_fight_skill_button_C.OnQTEStateChange
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_button_C_OnQTEStateChange final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_C_OnQTEStateChange;

// Function uw_fight_skill_button.uw_fight_skill_button_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_button_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_C_PreConstruct;

// LuaFunction uw_fight_skill_button.uw_fight_skill_button_C.K2_PlayCDAnim
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_button_C_K2_PlayCDAnim final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_C_K2_PlayCDAnim;

// LuaFunction uw_fight_skill_button.uw_fight_skill_button_C.OnChargeTimesChange
// 0x0008 (0x0008 - 0x0000)
struct uw_fight_skill_button_C_OnChargeTimesChange final
{
public:
	int32                                         InCurrentTimes;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InMaxTimes;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_uw_fight_skill_button_C_OnChargeTimesChange;

// LuaFunction uw_fight_skill_button.uw_fight_skill_button_C.K2_OnCustomUmgAnimFinished
// 0x0008 (0x0008 - 0x0000)
struct uw_fight_skill_button_C_K2_OnCustomUmgAnimFinished final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_skill_button_C_K2_OnCustomUmgAnimFinished;

// LuaFunction uw_fight_skill_button.uw_fight_skill_button_C.OnSkillStrengthening
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_button_C_OnSkillStrengthening final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_C_OnSkillStrengthening;

// Function uw_fight_skill_button.uw_fight_skill_button_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct uw_fight_skill_button_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_skill_button_C_GetModuleName;

}

